[{"text": "Hey everybody! It's LavenderTowne.", "start": 0.02, "duration": 1.6}, {"text": "And today, I'm going to be testing out three free animation programs and deciding which one is the best.", "start": 1.62, "duration": 4.64}, {"text": "But first, I want to give a quick shout out to the sponsor of today's video, Skillshare.", "start": 6.9, "duration": 3.94}, {"text": "Skillshare is a website with over 25,000 different classes,", "start": 11.18, "duration": 3.78}, {"text": "on the subjects of business, design, illustration, animation and more.", "start": 14.96, "duration": 4.44}, {"text": "I've been using it to try to learn more about animation and After Effects.", "start": 20.0, "duration": 3.88}, {"text": "Because After Effects is a program, I have had a very tumultuous relationship with, ever since art school.", "start": 23.88, "duration": 6.44}, {"text": "And this class has just made it so much more accessible and just a lot easier to approach.", "start": 30.54, "duration": 5.62}, {"text": "If learning a new skill is part of your new year's resolutions,", "start": 36.28, "duration": 3.38}, {"text": "I highly recommend to trying it out.", "start": 39.66, "duration": 1.62}, {"text": "You can get 2 months for free, if you're one of the first 500 people to click the link in the description.", "start": 41.28, "duration": 4.86}, {"text": "And if you want to continue on after 2 months,", "start": 46.52, "duration": 1.96}, {"text": "you can get the Premium Membership for less than $10 a month, if you choose their annual plan.", "start": 48.48, "duration": 5.36}, {"text": "Thank you so much to Skillshare for the continued support.", "start": 54.18, "duration": 2.6}, {"text": "So the first free program that I wanted to try is called Pencil 2D", "start": 57.82, "duration": 3.64}, {"text": "and it pretty much just sells itself as a standard frame-by-frame 2D animation program.", "start": 61.46, "duration": 4.66}, {"text": "It also has some vector capability apparently,", "start": 66.14, "duration": 2.26}, {"text": "but since it usually sells itself as a sort of hand drawing, kind of animation program,", "start": 68.4, "duration": 5.4}, {"text": "I decided to focus mainly on its bitmap tools.", "start": 73.8, "duration": 2.58}, {"text": "Now the first thing I noticed about it is that it looks very simple.", "start": 76.58, "duration": 2.86}, {"text": "It looks a little cheap and like a free program.", "start": 80.02, "duration": 2.24}, {"text": "It doesn't look overly fancy but that is actually one of its strengths.", "start": 82.74, "duration": 3.48}, {"text": "I feel like as I used it, I just realized that it was very user friendly.", "start": 86.22, "duration": 3.88}, {"text": "It's not as overwhelming as a lot of other animation programs I'd used.", "start": 90.1, "duration": 4.26}, {"text": "The keyframes, you can just click and drag", "start": 95.38, "duration": 2.04}, {"text": "and the layers that they bring up as a default, are also very simple to understand.", "start": 97.42, "duration": 5.96}, {"text": "There's a bitmap layer, where you just draw like normal,", "start": 103.38, "duration": 2.4}, {"text": "a vector layer, where you can use vectors,", "start": 105.78, "duration": 1.88}, {"text": "and a camera layer, where you can move around in the space and do camera movements like that.", "start": 107.96, "duration": 6.04}, {"text": "So, I like that element of it quite a bit.", "start": 114.0, "duration": 2.02}, {"text": "I decided on each of these, I was going to try to do a ball bounce", "start": 116.4, "duration": 3.18}, {"text": "to test the animation tools.", "start": 120.06, "duration": 1.42}, {"text": "And then, I would try to draw a one colored character to test its ability to do more illustrative work.", "start": 121.48, "duration": 7.4}, {"text": "Now, right off the bat, I'm gonna say that one of the cons of Pencil 2D", "start": 129.8, "duration": 3.32}, {"text": "is that it cannot do, like multiply layers.", "start": 133.12, "duration": 4.04}, {"text": "You can't really use your layers in the way that you can use them in Photoshop.", "start": 137.16, "duration": 3.22}, {"text": "So that means, if you're gonna be shading, all you have to work with is alpha,", "start": 140.38, "duration": 3.94}, {"text": "which is a little different than having a multiply layer.", "start": 144.32, "duration": 2.82}, {"text": "So, if you wanted to do color shading or something like that, it's gonna be like lot more difficult", "start": 147.14, "duration": 4.54}, {"text": "than it would be in a program that has a more complicated set of blending modes.", "start": 151.68, "duration": 4.86}, {"text": "It also has fairly basic tools as far as it goes.", "start": 157.06, "duration": 4.36}, {"text": "And like I said, that could be a good thing or a bad thing, depending on what you're trying to do.", "start": 161.42, "duration": 4.7}, {"text": "I don't think that any of them look especially  bad but they just sort of, they're just very functional, I guess.", "start": 166.98, "duration": 6.74}, {"text": "I was able to use ball bounce very quickly, it was not hard to figure out.", "start": 174.42, "duration": 4.22}, {"text": "And I gotta say, it's actually pretty nice to animate with.", "start": 179.42, "duration": 2.54}, {"text": "You just use the arrow keys to scroll around in your keyframes.", "start": 182.34, "duration": 2.72}, {"text": "You can choose different like levels of looping that you want.", "start": 185.06, "duration": 3.5}, {"text": "And one of the things I appreciate the most, is that it's so easy to move around your keyframes.", "start": 188.56, "duration": 4.3}, {"text": "In a lot of, even very premium-priced animation programs,", "start": 192.86, "duration": 3.08}, {"text": "it's very difficult to move your keyframes around.", "start": 195.94, "duration": 2.66}, {"text": "Just so that you can add or remove one frame or push things closer or farther apart.", "start": 198.92, "duration": 4.12}, {"text": "So, that the timing looks a little better on the animation.", "start": 203.04, "duration": 2.14}, {"text": "And so having that functionality really easy, is really beneficial.", "start": 205.48, "duration": 4.3}, {"text": "I didn't look at a single tutorial while I was working with Pencil 2D and I was able to animate just fine.", "start": 209.78, "duration": 5.32}, {"text": "Now, as far as illustrating something a little bit more complicated than a ball,", "start": 215.92, "duration": 3.82}, {"text": "I found it was pretty easy to use.", "start": 219.74, "duration": 2.24}, {"text": "There wasn't too much issue with the pencil tool.", "start": 221.98, "duration": 2.56}, {"text": "And I found it's very responsive with my tablet,", "start": 224.78, "duration": 2.84}, {"text": "which sometimes these free programs can run a little choppy,", "start": 227.62, "duration": 3.34}, {"text": "and when you're drawing really fast, it can start to slow down.", "start": 231.34, "duration": 2.82}, {"text": "But I didn't have any problem with that.", "start": 234.16, "duration": 1.6}, {"text": "I used their inking tool and just added another layer so that I could add some ink on top.", "start": 236.08, "duration": 5.46}, {"text": "And I couldn't easily find a way to change the bitmap layer to be lighter", "start": 241.66, "duration": 4.68}, {"text": "but it wasn't too much of an issue because the pencil was already a bit more transparent.", "start": 246.34, "duration": 4.04}, {"text": "And I do believe that there's a way to do it.", "start": 250.38, "duration": 2.1}, {"text": "But because it wasn't giving me any trouble,\nI didn't bother looking it up.", "start": 252.64, "duration": 2.82}, {"text": "Another thing that Pencil 2D does, which kind of bothered me was,", "start": 255.66, "duration": 3.14}, {"text": "it constantly asks you, if you want to save,", "start": 258.98, "duration": 2.4}, {"text": "which is really good because you don't want to lose animation work, that can be a real killer.", "start": 261.38, "duration": 4.06}, {"text": "But, every time that you open a new document or whatever,", "start": 265.84, "duration": 3.86}, {"text": "you have to tell it, do not ask again, if you don't want it to be popping up every five minutes.", "start": 269.7, "duration": 4.46}, {"text": "And personally, I really didn't want it to be quite that persistent.", "start": 275.0, "duration": 4.64}, {"text": "I think having an Autosave in the background is probably better than that.", "start": 279.78, "duration": 3.72}, {"text": "But, it is good that there's something there trying to protect you from losing your work.", "start": 283.5, "duration": 4.5}, {"text": "At this point, is when I was trying to add the shading and I just couldn't figure out a way to do it.", "start": 288.9, "duration": 4.28}, {"text": "So unfortunately, I couldn't really add it on.", "start": 293.18, "duration": 2.46}, {"text": "It ended up just looking, sort of, watery and weird.", "start": 295.64, "duration": 2.52}, {"text": "On top, you can see that it's not at full opacity, which is good.", "start": 298.44, "duration": 3.24}, {"text": "But, it just doesn't look quite right, coz it's not darkening down the colors underneath.", "start": 301.92, "duration": 4.98}, {"text": "It's just doing a more transparent layer of the color that I picked.", "start": 306.9, "duration": 4.86}, {"text": "So it's really not looking the way that I want it to.", "start": 311.9, "duration": 2.32}, {"text": "So, basically if you wanted to do shading with this program,", "start": 315.04, "duration": 2.7}, {"text": "you'd have to be a little more clever with it", "start": 317.74, "duration": 1.68}, {"text": "and pick every color individually, based on the colors underneath it.", "start": 319.42, "duration": 3.64}, {"text": "Which would be quite tedious, when it comes to animation.", "start": 323.14, "duration": 2.6}, {"text": "Though, to be fair, a lot of animations don't do shading layers, even really professional ones.", "start": 325.98, "duration": 4.98}, {"text": "And if they do, it's like very, very sparingly.", "start": 331.6, "duration": 2.64}, {"text": "So maybe that's not as big of an issue for you guys, depending on what you want to animate.", "start": 334.24, "duration": 3.92}, {"text": "I actually kind of like the grittiness of the inking tool.", "start": 339.58, "duration": 3.26}, {"text": "It has almost, sort of, like a rough pixelated edge a little bit,", "start": 343.26, "duration": 3.38}, {"text": "which I thought I was going to hate, when I first started using it,", "start": 346.64, "duration": 2.54}, {"text": "but in the end, it actually made it look kind of cool and unique.", "start": 349.18, "duration": 2.58}, {"text": "It's sometimes nice to have things not be totally smooth, especially, when you're working with digital.", "start": 352.42, "duration": 4.96}, {"text": "Gives it a bit more tooth and a little bit more of a presence on the page.", "start": 357.52, "duration": 4.72}, {"text": "So, to wrap up my review of this program in\nparticular,", "start": 362.64, "duration": 4.2}, {"text": "I would give it probably, a 19 out of 24 frames.", "start": 367.16, "duration": 3.9}, {"text": "Because overall, it just really does the job quite well.", "start": 371.56, "duration": 3.34}, {"text": "It is missing some key things that if you wanted to do", "start": 374.9, "duration": 2.35}, {"text": "something more pretty and illustrative in your animation,", "start": 377.25, "duration": 3.97}, {"text": "you're definitely going to miss.", "start": 381.22, "duration": 1.4}, {"text": "And I will say that when I first opened it up, it had a very weird setting on the onion skin.", "start": 382.94, "duration": 4.78}, {"text": "So it was, like basically, wasn't working", "start": 387.72, "duration": 1.8}, {"text": "and I had to look around to find a way to fix that.", "start": 389.52, "duration": 3.32}, {"text": "But overall, I think this is actually a very strong free program", "start": 393.22, "duration": 3.24}, {"text": "and I think that you could learn on it for a long time,", "start": 396.46, "duration": 2.52}, {"text": "before you would ever feel the need to buy any more expensive one.", "start": 398.98, "duration": 3.18}, {"text": "Next up, I wanted to try Blenders 2D animation program.", "start": 402.92, "duration": 3.64}, {"text": "They've really just come out with this in its current form very recently", "start": 406.7, "duration": 4.42}, {"text": "and I was excited to try it out.", "start": 411.12, "duration": 1.16}, {"text": "I believe it's called Grease Pencil.", "start": 412.28, "duration": 1.58}, {"text": "And, the first things first.", "start": 414.54, "duration": 1.98}, {"text": "You will notice, there's a major difference in the way that this program looks.", "start": 416.54, "duration": 3.58}, {"text": "It looks a lot more slick, like a program that you'd have to pay for.", "start": 420.4, "duration": 3.02}, {"text": "However, that also makes it extremely complicated, if you've never watched someone use it", "start": 423.72, "duration": 4.98}, {"text": "or looked up a tutorial, it's quite overwhelming.", "start": 428.9, "duration": 2.62}, {"text": "There's this tiny text everywhere and a million little tools", "start": 431.52, "duration": 3.06}, {"text": "and honestly, I found it a little daunting, when I first opened it up.", "start": 434.58, "duration": 3.96}, {"text": "Now, for those of you who don't know,", "start": 438.88, "duration": 1.36}, {"text": "Blender has been the, sort of, forefront of the free 3D modeling programs for a long time.", "start": 440.24, "duration": 7.56}, {"text": "In art school, a lot of people I knew, used it", "start": 448.48, "duration": 2.3}, {"text": "because it is still accessible and it's a very good 3D sculpting program.", "start": 450.78, "duration": 4.2}, {"text": "But like I said, this is kind of the first foray that they had into 2D animation.", "start": 455.58, "duration": 4.7}, {"text": "And right off the bat, I was able to figure out the onion skin pretty quickly.", "start": 460.9, "duration": 3.62}, {"text": "There wasn't anything too bad.", "start": 464.52, "duration": 1.58}, {"text": "One of the things that's kind of weird about it is that it has sort of an infinite canvas", "start": 466.4, "duration": 3.72}, {"text": "and it's also a canvas that you could move in 3D.", "start": 470.24, "duration": 2.42}, {"text": "So, if you're not careful, your animation will suddenly be looking, like it's at a weird angle", "start": 472.82, "duration": 4.9}, {"text": "and it's in 3D space, sort of, hovering in the air.", "start": 477.72, "duration": 2.76}, {"text": "So you have to be a little careful about that.", "start": 480.7, "duration": 1.94}, {"text": "The keyframes are not as easy to move, as they were in Pencil 2D,", "start": 483.76, "duration": 3.74}, {"text": "which was super frustrating because there was a point in this animation,", "start": 487.5, "duration": 3.6}, {"text": "where I wanted to just move one of the frames over and add another frame", "start": 491.46, "duration": 3.76}, {"text": "because I wanted it to slowed down at the peak of the balls bounce", "start": 495.22, "duration": 2.98}, {"text": "and I couldn't do that because I kept trying to select the keyframe I wanted to move", "start": 498.32, "duration": 4.92}, {"text": "and then it would only move one of them", "start": 503.24, "duration": 1.68}, {"text": "and I really tried to figure it out for a long time", "start": 504.92, "duration": 3.04}, {"text": "but it was just kind of, it was really a nightmare trying to figure out how to do it.", "start": 507.96, "duration": 4.4}, {"text": "I don't know why it's so difficult.", "start": 513.12, "duration": 1.5}, {"text": "I feel like in these programs, you should always just be able to sort of Shift+Click the keys that you want", "start": 514.62, "duration": 4.98}, {"text": "and then move them with your mouse but for some reason that was just not working for me.", "start": 519.6, "duration": 3.62}, {"text": "Another thing that's really strange is it just,", "start": 523.84, "duration": 1.74}, {"text": "it really doesn't look like any kind of drawing program that I've ever seen.", "start": 525.58, "duration": 3.76}, {"text": "Everything's in weird places and the Fill bucket tool does not do what you think it would do.", "start": 529.34, "duration": 5.06}, {"text": "That's one of the things that I noticed, right off the bat, when I started just trying to do more illustrative stuff.", "start": 535.0, "duration": 4.84}, {"text": "But, as far as animation goes, it wasn't too horrible picking it up and just trying to work on it.", "start": 540.46, "duration": 4.84}, {"text": "One of the things that's very sad though, is that it let me close out of this ball bounce without saving", "start": 545.76, "duration": 4.82}, {"text": "and it didn't even, like ask me, if I wanted to save.", "start": 550.82, "duration": 2.52}, {"text": "So, I lost that ball bounce completely,", "start": 553.34, "duration": 2.56}, {"text": "which is kind of, it's kind of the opposite of Pencil 2D in every way.", "start": 556.84, "duration": 3.5}, {"text": "It has so much more functionality but it's much harder to use", "start": 560.52, "duration": 2.66}, {"text": "and it totally doesn't help you not lose your work.", "start": 563.18, "duration": 3.77}, {"text": "I can't believe that I literally just lost that whole animation.", "start": 566.95, "duration": 3.41}, {"text": "The way I lost it, was I tried to make a new image so I was starting to try to draw out this character", "start": 571.66, "duration": 5.22}, {"text": "and I thought that if it was going to put it in a new tab that would be fine.", "start": 576.88, "duration": 3.82}, {"text": "Like, you know, when you make something new in Photoshop,", "start": 580.7, "duration": 2.24}, {"text": "it just puts the project you were using before into a different tab.", "start": 583.04, "duration": 4.36}, {"text": "Or I thought if it closes it, it'll definitely pop up a little thing to be like,", "start": 587.9, "duration": 3.66}, {"text": "\"Hey, do you want to save this first?\"", "start": 591.68, "duration": 1.2}, {"text": "But it didn't do either of those things.", "start": 592.88, "duration": 1.64}, {"text": "And in times, when I tried to exit out without saving on this drawing", "start": 594.88, "duration": 4.2}, {"text": "because I wanted to see what It would do in that scenario,", "start": 599.08, "duration": 2.5}, {"text": "it gives you a notification that you haven't saved", "start": 601.98, "duration": 2.48}, {"text": "but it doesn't let you save it.", "start": 604.46, "duration": 1.3}, {"text": "It's not like, \"Would you like to save this?\"", "start": 605.76, "duration": 1.84}, {"text": "It's like, \"Are you sure you want to close this? Yes or no.", "start": 607.68, "duration": 2.88}, {"text": "Which is also kind of a nitpick", "start": 610.96, "duration": 1.52}, {"text": "but it's like really weird that it makes you, like cancel out of closing it and then you have to save separately.", "start": 612.48, "duration": 6.58}, {"text": "It's a row, it's a weird little thing.", "start": 619.06, "duration": 2.54}, {"text": "Another thing I noticed is that their brush pencily tool that I'm using is not at full opacity.", "start": 622.56, "duration": 6.06}, {"text": "It seems to be pressure sensitive opacity, which is really cool, if that's what you're going for.", "start": 628.62, "duration": 4.28}, {"text": "But, I didn't realize it until I'd already inked this whole thing", "start": 632.9, "duration": 2.96}, {"text": "and honestly, I don't really, I wasn't a big fan of that.", "start": 635.86, "duration": 3.32}, {"text": "So, I wish I'd looked at a little closer before I had started working on this.", "start": 639.18, "duration": 4.28}, {"text": "My last major gripe about Blender 2D's Grease pencil", "start": 644.1, "duration": 3.88}, {"text": "is I could not for the life of me, figure out how to fill the colors.", "start": 647.98, "duration": 4.4}, {"text": "I actually looked it up. I tried to look up tutorials, I tried to look up lots of different places.", "start": 652.74, "duration": 4.26}, {"text": "Unfortunately, like I said, because this is such a new program,", "start": 657.0, "duration": 2.78}, {"text": "there actually isn't that much out there to\nhelp you learn how to use it.", "start": 659.78, "duration": 3.32}, {"text": "And their Fill bucket tool, which you would think would do the thing", "start": 664.0, "duration": 3.66}, {"text": "that it does in every art and animation program ever,", "start": 667.66, "duration": 2.52}, {"text": "would fill in your colors,", "start": 671.12, "duration": 1.48}, {"text": "it just straight up did not do that.", "start": 672.86, "duration": 2.26}, {"text": "It actually adds, like a weird little extra line inside the area,", "start": 675.12, "duration": 3.94}, {"text": "the things you're trying to color in.", "start": 679.06, "duration": 1.74}, {"text": "And I'm not sure why. So, I'm gonna keep working on that and trying to figure out what went wrong here", "start": 680.98, "duration": 5.24}, {"text": "because I literally could not get it to work.", "start": 686.34, "duration": 2.62}, {"text": "And I think that that's super strange.", "start": 688.96, "duration": 1.62}, {"text": "I actually kind of liked the idea of a tool that tries to close any gaps in the line art that you're using,", "start": 690.58, "duration": 5.96}, {"text": "because it seemed like that's what it was trying to do.", "start": 696.64, "duration": 2.04}, {"text": "But yeah, it just didn't, I couldn't figure out a way to color this thing.", "start": 699.22, "duration": 3.62}, {"text": "Last up is a program called Synfig and it is a vector-based program.", "start": 703.74, "duration": 3.86}, {"text": "So you don't do as much free handing, you do more like shape based stuff", "start": 707.6, "duration": 3.5}, {"text": "and you can do a lot of puppetry with vectors.", "start": 711.22, "duration": 2.4}, {"text": "I found it to be pretty impossible to use it without a tutorial.", "start": 714.26, "duration": 3.58}, {"text": "I'm not actually sure what was going wrong.", "start": 717.84, "duration": 2.82}, {"text": "Most of it, I kind of was able to figure out just by working through it.", "start": 720.9, "duration": 3.14}, {"text": "But unfortunately, this program is very, very free feeling.", "start": 724.36, "duration": 5.1}, {"text": "I'm not sure how to put it but it totally crashed on me", "start": 729.46, "duration": 3.62}, {"text": "before I could figure out a way to get it to move.", "start": 733.08, "duration": 3.02}, {"text": "And then, when I tried to look up a tutorial to figure out", "start": 736.9, "duration": 2.78}, {"text": "how to fix the problems I was having with the program,", "start": 739.96, "duration": 2.32}, {"text": "it also crashed for the guy, whose tutorial I was watching several times.", "start": 742.28, "duration": 4.24}, {"text": "So basically, I don't think it's really ready yet.", "start": 746.7, "duration": 2.8}, {"text": "It might end up getting improved and turn out to be a really good program", "start": 749.5, "duration": 3.7}, {"text": "but as it is now, it's really not really reliable enough to use for animation.", "start": 753.2, "duration": 3.5}, {"text": "So in conclusion, if you're looking for something really easy to pick up", "start": 758.02, "duration": 2.92}, {"text": "and really simple that might have some\nlimited illustration functionalities,", "start": 760.94, "duration": 4.22}, {"text": "I highly recommend Pencil 2D.", "start": 765.16, "duration": 1.86}, {"text": "If you're looking for something that will take a little bit longer to learn", "start": 767.4, "duration": 2.66}, {"text": "but has a lot more that you can do with it,", "start": 770.06, "duration": 1.9}, {"text": "I would recommend Blender's Grease pencil.", "start": 772.1, "duration": 2.2}, {"text": "And I wouldn't recommend Synfig to anyone", "start": 774.6, "duration": 2.1}, {"text": "because like I said, I just don't think that it's really ready to use yet.", "start": 776.7, "duration": 2.88}, {"text": "I hope you guys found this helpful.", "start": 780.28, "duration": 1.72}, {"text": "Like I said, I did take up pretty much a beginner, first time opening the program approach, to each of these.", "start": 782.62, "duration": 5.22}, {"text": "But if you like, I can research up on them more and learn how to use them really properly.", "start": 787.84, "duration": 4.78}, {"text": "And then do a follow up video, seeing how having more experience", "start": 792.62, "duration": 3.34}, {"text": "with each program changes my opinions with it.", "start": 795.96, "duration": 2.4}, {"text": "Thank you so much for watching till the end.", "start": 798.74, "duration": 1.42}, {"text": "And big thank you to Skillshare for continually supporting the channel.", "start": 800.26, "duration": 2.84}, {"text": "Do check out the link in the description, if you want a two month free trial.", "start": 803.26, "duration": 2.84}, {"text": "And I will see you guys in the next one.", "start": 806.48, "duration": 1.9}, {"text": "A huge thank you to my patrons including", "start": 810.88, "duration": 2.2}, {"text": "Blep, Ollie, Elizabeth Alban, LeBlehBlehBleh,\nCalponpon, TheArtsyMoose, YaBoyST,", "start": 813.08, "duration": 5.14}, {"text": "JayJayJade, Sgt. Pendulum,  Okamorei,\nMikeadacytl,", "start": 818.38, "duration": 3.06}, {"text": "Hope Chilsome, Rosy Warlock, Dr. Casket, Zoey Stardust, Qytrd, Imagine Creation,", "start": 821.45, "duration": 5.7}, {"text": "Carla Tapia, Midnight Doodles, Clockwork Construct, Cassitarius, and Megan Claire.", "start": 827.15, "duration": 4.03}]