[{"text": "You guys know what beetle really wants to promote right now?", "start": 0.0, "duration": 2.879}, {"text": "Your show youth and consequences, which has all episodes up on YouTube red right now", "start": 2.98, "duration": 3.35}, {"text": "And you can sign up for a free 30-day trial to watch. How did you know but anyway back to the video?", "start": 6.33, "duration": 4.41}, {"text": "I've been thinking lately about how", "start": 10.75, "duration": 2.0}, {"text": "Inspiring my friends are", "start": 13.03, "duration": 2.0}, {"text": "I want to be you when I grow up. Someday, kid. Someday.", "start": 21.25, "duration": 3.81}, {"text": "My friendships have become such a source of inspiration and support in my life. Especially my female friendships", "start": 25.06, "duration": 6.53}, {"text": "I am surrounded by women who are driven,", "start": 31.59, "duration": 2.729}, {"text": "compassionate and intelligent", "start": 34.87, "duration": 1.14}, {"text": "And I'm just so grateful and honored to know them. Whenever I get to see them, I feel so grounded and tranquil", "start": 36.01, "duration": 7.52}, {"text": "I've always extra", "start": 46.93, "duration": 1.35}, {"text": "Astounded whenever these people put themselves down and for a while I used to address it like this: girl stop talking like that. You're", "start": 48.28, "duration": 6.02}, {"text": "adorable amazing artistic", "start": 54.55, "duration": 2.0}, {"text": "irresistible hilarious pretty", "start": 57.01, "duration": 2.0}, {"text": "ha thanks, yeah", "start": 59.469, "duration": 2.0}, {"text": "mm-hmm", "start": 61.539, "duration": 1.651}, {"text": "And it never worked", "start": 63.19, "duration": 1.009}, {"text": "I mean why would it - I would roll my eyes at the same thing too like your friends of course are gonna say stuff like", "start": 64.199, "duration": 4.56}, {"text": "That because they're your friends, and they're gonna compliment you and they think you're awesome", "start": 68.76, "duration": 2.579}, {"text": "So I started doing a new tactic... it looks like my soulmate is either gonna be a Libra", "start": 71.71, "duration": 4.76}, {"text": "Pisces or cancer. Mmm go for the Libra. You don't want another water sign. Ohh", "start": 76.63, "duration": 3.68}, {"text": "Pisces and cancer are water? I didn't know.", "start": 80.82, "duration": 2.1}, {"text": "Yeah. I'm such a loser for knowing that haha", "start": 83.02, "duration": 2.64}, {"text": "Stop being mean to my friend! And though it's like hella aggressive", "start": 87.66, "duration": 3.74}, {"text": "I found that it actually works because something about it kind of", "start": 91.409, "duration": 3.12}, {"text": "Reframes the way that you're talking to yourself it reminds you that you wouldn't put up with a friend saying that to you", "start": 94.99, "duration": 5.569}, {"text": "So why should you say it to yourself?", "start": 100.59, "duration": 2.0}, {"text": "Plus it's really fun. Especially if your friend's across the room:", "start": 102.729, "duration": 4.19}, {"text": "ughh I don't know why I became a writer everything I write is freaking awful! Stop being mean to My friend!", "start": 107.619, "duration": 5.9}, {"text": "Or if they don't know that you heard them", "start": 113.52, "duration": 2.04}, {"text": "Ughhh I'm So ugly! Stop being mean to my friend!", "start": 116.14, "duration": 3.82}, {"text": "even if they're just thinking it: huh why should I even bother tweeting, all my opinions are stupid", "start": 120.36, "duration": 6.28}, {"text": "Stop being mean to my friend!", "start": 126.76, "duration": 1.24}, {"text": "So yeah, if your amazing talented friends are putting themselves down, be a good friend and stand up for them", "start": 128.36, "duration": 5.92}, {"text": "against themselves", "start": 134.82, "duration": 1.68}, {"text": "Especially against themselves. Speaking of, thanks so much my friend on Anna lore for being in today's video", "start": 136.5, "duration": 4.52}, {"text": "Check her out. She's not only an amazing dancer, but she's a hilarious comedian and a great watercolor artist", "start": 141.72, "duration": 5.119}, {"text": "She actually painted that little photo of me where there's like space around my head, so yay! I'm Anna Akana", "start": 146.99, "duration": 5.909}, {"text": "Thanks to Squarespace for sponsoring today's video if you go to Squarespace dot", "start": 153.57, "duration": 3.619}, {"text": "Com slash Anna you can get 10% off a domain name your online store", "start": 157.32, "duration": 3.799}, {"text": "Whatever you want to do 10% off your first purchase", "start": 161.12, "duration": 2.22}, {"text": "By going to Squarespace dot com slash Anna I know you guys are used to like the cool", "start": 163.62, "duration": 3.92}, {"text": "Animated ads at the end of my videos done by Bethany, but actually today if you go over to squarespace's channel", "start": 167.64, "duration": 6.11}, {"text": "I have made a dedicated video for them", "start": 173.75, "duration": 2.07}, {"text": "It's about how good work takes time and provides some insights into the creative process", "start": 175.83, "duration": 4.759}, {"text": "And how not to let yourself get discouraged", "start": 180.69, "duration": 2.119}, {"text": "So please go ahead and click the link in the description below to check out that video and you can go to Squarespace dot com slash", "start": 182.82, "duration": 5.449}, {"text": "Anna to get 10% off your first purchase", "start": 188.269, "duration": 2.0}]