[{"text": "The Nintendo e-Reader is a little-remembered card reader addon for the Game Boy Advance,", "start": 0.56, "duration": 4.4}, {"text": "with... a lot of different uses!", "start": 4.96, "duration": 2.44}, {"text": "It was released shortly after the Game Boy Advance launch,", "start": 7.4, "duration": 2.22}, {"text": "and despite the GBA being a massive success for Nintendo,", "start": 9.62, "duration": 2.94}, {"text": "this Swiss army knife of a peripheral... was not, lasting only two years in North America.", "start": 12.56, "duration": 4.68}, {"text": "It was the key to unlocking bonus content in a handful of GBA games and GameCube games,", "start": 17.24, "duration": 4.08}, {"text": "as well as capable of playing games itself and, sidenote,", "start": 21.32, "duration": 2.84}, {"text": "was not Nintendo's unexpected foray into the cutthroat world of e-book devices like the Amazon Kindle,", "start": 24.16, "duration": 5.34}, {"text": "which is probably what you were trying to google.", "start": 29.5, "duration": 2.16}, {"text": "Like a lot of Nintendo's gadgets, it was a little ahead of its time and a little too unwieldy for its own good.", "start": 31.66, "duration": 4.78}, {"text": "Still, it's a fascinating device for this show we call Punching Weight,", "start": 36.44, "duration": 3.6}, {"text": "where we celebrate the weird, ambitious and unnecessary,", "start": 40.04, "duration": 2.78}, {"text": "and in this episode we're gonna take a deep dive into the Nintendo GBA e-Reader.", "start": 42.82, "duration": 4.26}, {"text": "But first, a huge thanks to NordVPN for sponsoring this video.", "start": 47.08, "duration": 3.6}, {"text": "Listen, since the use of emulators and ROMs are increasingly under threat,", "start": 50.68, "duration": 4.14}, {"text": "you're gonna want to use a VPN to protect yourself and keep your data safe, wherever you go!", "start": 54.82, "duration": 4.3}, {"text": "You can save 66% off a two-year plan if you go to nordvpn.com/stopskeletons", "start": 59.12, "duration": 5.62}, {"text": "and use the offer code ‘STOPSKELETONS’.", "start": 64.74, "duration": 2.3}, {"text": "On with the show!", "start": 67.52, "duration": 1.4}, {"text": "It's easy to forget about the trading card game boom of the late nineties and early aughts.", "start": 78.3, "duration": 4.8}, {"text": "Magic: The Gathering had been holdin' it down for years,", "start": 83.18, "duration": 2.44}, {"text": "but then along came Pokémon and Yu-Gi-Oh, and suddenly we're seein' trading card game spinoffs,", "start": 85.62, "duration": 4.98}, {"text": "trading card minigames, and whole games based around a deck of cards!", "start": 90.6, "duration": 3.92}, {"text": "Cards were hot! And when you also take into account Nintendo's penchant", "start": 94.52, "duration": 3.4}, {"text": "for differentiating themselves from the competition with neat system add-ons,", "start": 97.92, "duration": 3.5}, {"text": "it's no surprise they wanted in on the action.", "start": 101.42, "duration": 2.44}, {"text": "The GBA e-Reader was a collaboration between Nintendo,", "start": 103.96, "duration": 3.02}, {"text": "Creatures, Inc., who also had a hand in the Game Boy Camera,", "start": 106.98, "duration": 2.96}, {"text": "and HAL Laboratories, with the actual card-reading tech developed by camera manufacturer Olympus.", "start": 109.94, "duration": 5.1}, {"text": "It was originally a far less ambitious device:", "start": 115.06, "duration": 3.42}, {"text": "First unveiled to the West as the Pokémon e-Reader at E3 2001,", "start": 118.48, "duration": 4.8}, {"text": "only as a device to turn your GBA into a virtual Pokédex for the Pokémon TCG.", "start": 123.28, "duration": 5.08}, {"text": "In fact, when it was first released in Japan in December 2001,", "start": 128.44, "duration": 3.82}, {"text": "it did not have link cable capability, which we'll break down in more detail in a minute.", "start": 132.26, "duration": 4.46}, {"text": "Nintendo would later release an updated version, the e-Reader+,", "start": 136.76, "duration": 4.36}, {"text": "that included link cable support and opened up a whole new world of possibilities.", "start": 141.12, "duration": 4.1}, {"text": "This is technically the version released in September 2002 to North America and Australia,", "start": 145.42, "duration": 4.92}, {"text": "however, it was simply known as the e-Reader, to avoid confusion.", "start": 150.34, "duration": 3.42}, {"text": "For reasons that'll become clear later on, the e-Reader never made it to Europe.", "start": 153.88, "duration": 3.94}, {"text": "It retailed for $39,99 in the US, which is about 55 bucks today,", "start": 157.82, "duration": 4.34}, {"text": "with various packs of cards ranging from three to six bucks.", "start": 162.16, "duration": 3.4}, {"text": "Not too bad, but to really make it work, you needed a lot of extras on top of that,", "start": 165.56, "duration": 4.34}, {"text": "depending on how you wanted to use it.", "start": 169.9, "duration": 2.1}, {"text": "The GBA link cables, a second GBA...", "start": 172.08, "duration": 2.28}, {"text": "... a GameCube, GameCube GBA link cables for that...", "start": 174.92, "duration": 3.04}, {"text": "... and then of course, the cards themselves!", "start": 178.1, "duration": 2.66}, {"text": "e-Reader cards, and there were over a thousand of these,", "start": 181.36, "duration": 3.14}, {"text": "held data on a dot-code strip printed along the card's border.", "start": 184.58, "duration": 3.38}, {"text": "Cards had one-to-two stripes, holding 2,2k of data on the long side, and 1,1k of data on the short side.", "start": 187.96, "duration": 6.78}, {"text": "For those playing along at home, that's about 544 cards for the DOS shareware of Doom", "start": 194.8, "duration": 5.4}, {"text": "if they were using the two long sides,", "start": 200.2, "duration": 1.72}, {"text": "which I don't think anyone's put GBA Doom on the e-Reader yet, so...", "start": 201.92, "duration": 3.84}, {"text": "Get on that, modders!", "start": 205.76, "duration": 1.34}, {"text": "Now, the technical details are cool, but, like...", "start": 207.14, "duration": 2.12}, {"text": "Whoa, gee, oh...", "start": 209.26, "duration": 1.02}, {"text": "Grace, what is this?!", "start": 210.44, "duration": 1.36}, {"text": "Is this... ?", "start": 211.8, "duration": 0.88}, {"text": "Ladies and gentlemen, we did the math!", "start": 214.26, "duration": 1.54}, {"text": "The No-Intro version of GBA Doom could fit on 486 cards with the vertical and horizontal dot code,", "start": 215.8, "duration": 5.94}, {"text": "and 180 cards with the two horizontal dot codes, to make...", "start": 221.74, "duration": 3.68}, {"text": "... 666 cards!", "start": 225.76, "duration": 2.32}, {"text": "My god...", "start": 228.34, "duration": 1.06}, {"text": "... what have we done?!", "start": 230.0, "duration": 1.16}, {"text": "Or not done.", "start": 231.46, "duration": 0.8}, {"text": "GRACE: Get on it, modders!", "start": 232.46, "duration": 1.54}, {"text": "DEREK: So technical details are cool, but what do these cards actually do?", "start": 234.08, "duration": 3.68}, {"text": "Well, they did a lot of things!", "start": 237.76, "duration": 1.72}, {"text": "They could have full NES games, original minigames, a whole standalone board game, videos,", "start": 239.48, "duration": 5.1}, {"text": "and tons of extra content for games, like new areas, new challenges, items, music,", "start": 244.58, "duration": 5.28}, {"text": "and at least one time where it was used to patch out a glitch!", "start": 249.86, "duration": 3.08}, {"text": "So in short, it did a LOT of things!", "start": 252.94, "duration": 2.8}, {"text": "In fact, too many things!", "start": 256.06, "duration": 2.12}, {"text": "There were also a lot of different ways to actually get cards:", "start": 258.28, "duration": 3.34}, {"text": "The e-Reader came packed with cards, some games came bundled with cards,", "start": 261.62, "duration": 3.86}, {"text": "some were packed into magazines, and others were given away at special events and are very rare.", "start": 265.48, "duration": 4.94}, {"text": "But most cards were sold as packs for about five bucks a pop.", "start": 270.42, "duration": 3.12}, {"text": "... well, at least the NES ones were.", "start": 273.62, "duration": 2.08}, {"text": "Cards for games like Animal Crossing and Pokémon though,", "start": 275.7, "duration": 2.68}, {"text": "in keeping with the tradition of trading cards, were parts of a larger set.", "start": 278.38, "duration": 3.72}, {"text": "For example, Animal Crossing-e series 1 had 66 total cards,", "start": 282.1, "duration": 3.56}, {"text": "and sold five cards in a booster pack for $2,99 each.", "start": 285.66, "duration": 3.38}, {"text": "It was difficult to collect them all,", "start": 289.04, "duration": 1.8}, {"text": "and it's easy to see why it'd be hard to convince Mom to indulge in any of this.", "start": 290.84, "duration": 4.52}, {"text": "So that's a lot off the top, but the real question I'm sure you're wondering is:", "start": 295.44, "duration": 4.02}, {"text": "\"How does it actually work?\"", "start": 299.46, "duration": 1.24}, {"text": "The e-Reader itself is a rather big device, bigger than a GBA SP.", "start": 300.7, "duration": 4.24}, {"text": "Doesn't exactly fit in your pocket, it's not really portable.", "start": 304.94, "duration": 2.98}, {"text": "It is essentially a GBA cart with a giant card reader on top, with a slit for sliding cards.", "start": 308.02, "duration": 5.36}, {"text": "And because it is essentially just a GBA cart, it works with anything with a GBA port,", "start": 313.38, "duration": 4.94}, {"text": "including the GameCube GBA Player and DS!", "start": 318.32, "duration": 2.98}, {"text": "The problem comes with the link cable port:", "start": 321.34, "duration": 2.34}, {"text": "While it fits perfectly for the classic GBA and GameCube Player, it's not the best fit for the SP,", "start": 323.68, "duration": 5.5}, {"text": "requires a link cable adapter for the Micro, and physically doesn't fit the original DS,", "start": 329.18, "duration": 4.98}, {"text": "though if you carve out a hole in the plastic casing, it will work.", "start": 334.16, "duration": 3.48}, {"text": "This is not an issue for the DS Lite, by the way,", "start": 337.78, "duration": 2.62}, {"text": "but it's so weird-looking with a giant card reader bolted to it!", "start": 340.4, "duration": 3.44}, {"text": "Again, can't imagine why this never caught on!", "start": 343.84, "duration": 2.64}, {"text": "Side note: Because all GBA's are region free, the e-Reader itself is also region free,", "start": 346.48, "duration": 4.96}, {"text": "except the cards themselves are not!", "start": 351.44, "duration": 3.46}, {"text": "So that sucks.", "start": 355.08, "duration": 0.96}, {"text": "The device itself works well enough, though can be temperamental.", "start": 356.04, "duration": 3.36}, {"text": "A big problem is that scanning is actually a real pain, you have to slide a card at just the right speed.", "start": 359.4, "duration": 5.72}, {"text": "[Beep!] \"Read error.\"", "start": 365.12, "duration": 1.32}, {"text": "[Grace chuckles off-screen]", "start": 366.44, "duration": 1.82}, {"text": "Most cases require multiple swipes from multiple cards.", "start": 368.26, "duration": 3.16}, {"text": "Luckily you can swipe cards in any order you want,", "start": 371.42, "duration": 2.58}, {"text": "but you're required to hit A on the GBA every time a swipe is successful or unsuccessful.", "start": 374.16, "duration": 5.84}, {"text": "We found using the GameCube GBA Player works best because it stabilizes the unit.", "start": 380.0, "duration": 4.72}, {"text": "GRACE: Noooo!", "start": 385.12, "duration": 0.78}, {"text": "DEREK: Thankfully the e-Reader has its own internal memory,", "start": 385.9, "duration": 2.8}, {"text": "so once you've swiped in a game, it stays saved in the e-Reader until you swipe in something else,", "start": 388.7, "duration": 5.38}, {"text": "which is really cool!", "start": 394.08, "duration": 1.3}, {"text": "When we pulled this thing out of storage, there was a game still saved on here from probably 15 years earlier!", "start": 395.38, "duration": 5.4}, {"text": "Speaking of the games, let's start diving into the actual uses of the e-Reader.", "start": 400.94, "duration": 3.92}, {"text": "Like we said, this thing did a LOT of things,", "start": 404.86, "duration": 2.62}, {"text": "but our favorite are the classic NES games.", "start": 407.48, "duration": 2.74}, {"text": "Predating the Virtual Console and the Classic NES Series on the GBA,", "start": 410.22, "duration": 3.46}, {"text": "these were one of the first times Nintendo re-released old games as standalone content,", "start": 413.8, "duration": 4.94}, {"text": "and it was a major selling point in commercials.", "start": 418.74, "duration": 2.18}, {"text": "Like we said, sliding ten data stripes will test your patience,", "start": 420.98, "duration": 3.56}, {"text": "but having an entire NES game stored on five cards is still such an amazing thing!", "start": 424.54, "duration": 4.9}, {"text": "There were 13 classic NES games released in total, and we happen to have four of them.", "start": 429.44, "duration": 4.06}, {"text": "Of the games we were able to test, none had anything that isn't in the OG NES versions,", "start": 433.5, "duration": 5.04}, {"text": "in fact, they're actually missing features!", "start": 438.54, "duration": 2.38}, {"text": "Balloon Fight and Ice Climber are missing a two-player option,", "start": 440.92, "duration": 3.18}, {"text": "and Excitebike still does not have the ability to save custom tracks,", "start": 444.1, "duration": 4.02}, {"text": "though they at least took the option out.", "start": 448.12, "duration": 2.34}, {"text": "The biggest knock against them is that none of them save high scores.", "start": 450.46, "duration": 3.76}, {"text": "I mean, the damn thing is rewriteable,", "start": 454.22, "duration": 2.18}, {"text": "you'd think that storing high scores while the game was loaded into the e-Reader wouldn't be too big of an ask.", "start": 456.4, "duration": 5.44}, {"text": "At any rate, high score saves, two-player mode and even the ability to save custom tracks", "start": 461.84, "duration": 4.96}, {"text": "were later implemented into the GBA Classic re-releases,", "start": 466.8, "duration": 2.98}, {"text": "which renders these e-Reader versions... pretty obsolete.", "start": 469.78, "duration": 3.42}, {"text": "Another negative: Each NES games comes on five cards.", "start": 473.2, "duration": 3.54}, {"text": "Again, the novelty of having an entire NES game housed on ten lines of data,", "start": 476.74, "duration": 4.5}, {"text": "printed on five cards, is still pretty mind-blowing!", "start": 481.24, "duration": 2.98}, {"text": "But if you lose a card or buy an incomplete set, the rest are basically useless!", "start": 484.22, "duration": 4.72}, {"text": "And I dunno about you, but I wasn't the most organized kid growing up,", "start": 488.96, "duration": 3.86}, {"text": "I'm honestly not sure how I managed to keep all these together after all these years.", "start": 493.02, "duration": 4.52}, {"text": "Similarly to the NES games, Nintendo also planned on dipping into the vault for Game & Watch re-releases,", "start": 497.62, "duration": 5.98}, {"text": "but that was canned after the e-Reader underperformed.", "start": 503.6, "duration": 2.92}, {"text": "Manhole-e came packed in with the e-Reader, and it is the sole Game & Watch game for the e-Reader.", "start": 506.6, "duration": 5.32}, {"text": "Here's something odd: Unlike the NES games, it does not save onto the e-Reader,", "start": 512.0, "duration": 3.9}, {"text": "and needs to be re-scanned every time you want to play.", "start": 515.9, "duration": 2.58}, {"text": "So you could either lug around your GBA and your e-Reader, and your Manhole-e card...", "start": 518.54, "duration": 5.06}, {"text": "... or just play Manhole on one of the various Game & Watch collections", "start": 523.74, "duration": 3.7}, {"text": "for the Game Boy and Game Boy Advance.", "start": 527.44, "duration": 1.88}, {"text": "Needless to say, the e-Reader version does not save high scores,", "start": 529.32, "duration": 3.54}, {"text": "which is almost the entire point of games like that.", "start": 532.86, "duration": 2.9}, {"text": "But hey, this is Punching Weight, and we are all about unnecessary!", "start": 535.78, "duration": 3.36}, {"text": "Moving on, the next e-Reader game is pretty damn impressive,", "start": 539.32, "duration": 3.48}, {"text": "it's both one of the coolest e-Reader games,", "start": 542.8, "duration": 2.7}, {"text": "and the biggest indicator that Nintendo did not believe in the e-Reader:", "start": 545.5, "duration": 3.94}, {"text": "Mario Party-e!", "start": 549.44, "duration": 1.28}, {"text": "Yes, not only did Nintendo actually release a board game version of Mario Party,", "start": 550.72, "duration": 4.72}, {"text": "its cards had e-Reader support!", "start": 555.44, "duration": 2.4}, {"text": "It's an otherwise fully functional tabletop board game, with extra bonus games played on the GBA.", "start": 557.84, "duration": 5.32}, {"text": "Yes, the e-Reader games are just extra bonus games,", "start": 563.3, "duration": 3.1}, {"text": "because it didn't even come bundled with an e-Reader.", "start": 566.4, "duration": 2.58}, {"text": "Nintendo expected you to already have one, I guess?", "start": 568.98, "duration": 3.08}, {"text": "The game can be played without an e-Reader, so we also have no idea why it's called Mario Party-e.", "start": 572.06, "duration": 5.8}, {"text": "But the king of trading cards was, of course, Pokémon!", "start": 577.96, "duration": 3.04}, {"text": "\"Gotta Catch the Cards!\"", "start": 581.0, "duration": 1.34}, {"text": "Pokémon TCG cards had e-Reader dot codes from Expedition to EX Team Magma VS. Team Aqua,", "start": 582.34, "duration": 6.34}, {"text": "which comes out to over a whopping SIX HUNDRED cards! Geez!", "start": 588.68, "duration": 3.98}, {"text": "You might have had e-Reader cards in your collection this whole time and not even known it!", "start": 592.66, "duration": 3.66}, {"text": "Most of these cards had a single code stripe on the short side that displayed Pokédex information,", "start": 596.32, "duration": 4.88}, {"text": "which, if you'll remember, was the original intention of the e-Reader,", "start": 601.2, "duration": 3.48}, {"text": "but other cards also had long slide codes that unlocked minigames, animations and music!", "start": 604.68, "duration": 5.42}, {"text": "Some even unlocked secret attacks that could be used during play,", "start": 610.1, "duration": 3.18}, {"text": "but these were never tournament legal.", "start": 613.28, "duration": 1.76}, {"text": "We have the full Machop evolution set, which came packed in with the system,", "start": 615.04, "duration": 3.44}, {"text": "which means we could unlock the minigame Machop At Work!", "start": 618.48, "duration": 3.28}, {"text": "It's a game where Machop is a good boy just doin' his best and workin' for the weekend!", "start": 621.76, "duration": 4.78}, {"text": "But there are dozens of minigames like this, and as far as we know, they have never been re-released,", "start": 626.54, "duration": 5.54}, {"text": "which means there is a TON of exclusive Pokémon content locked within these cards!", "start": 632.08, "duration": 5.58}, {"text": "Now, part of this may be because these minigames were released", "start": 637.76, "duration": 2.98}, {"text": "while Wizards of the Coast was publishing the TCG.", "start": 640.74, "duration": 2.9}, {"text": "When Nintendo took over from them in June 2003,", "start": 643.7, "duration": 3.0}, {"text": "they stopped making minigames altogether, and only published short-side dot codes.", "start": 646.7, "duration": 4.4}, {"text": "Fun fact: Wizards of the Coast actually raised the price of the TCG when the dot codes came out,", "start": 651.1, "duration": 5.44}, {"text": "which Nintendo kept until way after the e-Reader was discontinued in the US.", "start": 656.54, "duration": 4.78}, {"text": "GRACE: Boom!", "start": 661.6, "duration": 0.68}, {"text": "GRACE: Boom. !", "start": 662.28, "duration": 0.7}, {"text": "GRACE: Boom.. !", "start": 662.98, "duration": 0.72}, {"text": "GRACE: Boom... !", "start": 663.7, "duration": 0.64}, {"text": "GRACE: Boom... baby!", "start": 664.34, "duration": 1.2}, {"text": "We'll be right back.", "start": 665.54, "duration": 0.98}, {"text": "[Grace chuckles off-screen]", "start": 666.52, "duration": 1.3}, {"text": "\"But,\" I hear you asking, \"What about them poker mayne vydeo gamesz?!\"", "start": 668.92, "duration": 4.32}, {"text": "Well you're in luck, because there's also another completely separate kind of Pokémon e-Reader cards", "start": 673.24, "duration": 4.9}, {"text": "that work with Pokémon Ruby and Sapphire!", "start": 678.14, "duration": 2.56}, {"text": "There are far fewer cards for these games,", "start": 680.7, "duration": 2.5}, {"text": "about sixty Battle-e cards, and that's including promo cards, released in North America.", "start": 683.2, "duration": 4.58}, {"text": "Though there were a few more sets in Japan.", "start": 688.04, "duration": 2.06}, {"text": "By the way, to give you an idea of how short-lived the e-Reader was in North America,", "start": 690.2, "duration": 4.76}, {"text": "it didn't even last a full Pokémon generation,", "start": 694.96, "duration": 2.8}, {"text": "as all the e-Reader functionality was taken out of Pokémon Emerald for its international localization.", "start": 697.76, "duration": 4.92}, {"text": "There are a few different types of Battle-e cards, the most common ones are the Trainer and Berry cards,", "start": 702.68, "duration": 5.18}, {"text": "which allow you to battle new trainers, or allow you to get exclusive berries respectively.", "start": 707.86, "duration": 4.86}, {"text": "The most famous and sought-after card, though, is the elusive Eon Ticket,", "start": 712.72, "duration": 3.96}, {"text": "which was only given out by Nintendo at E3 2003, in volume 173 of Nintendo Power,", "start": 716.68, "duration": 5.56}, {"text": "and at some Toys \"R\" Us stores -- rest in peace, Toys \"R\" Us.", "start": 722.24, "duration": 3.0}, {"text": "Players who got an Eon Ticket were also able to share copies of it via record mixing,", "start": 725.24, "duration": 4.42}, {"text": "so the e-Reader wasn't the only way to get it.", "start": 729.66, "duration": 2.44}, {"text": "The Eon Ticket let you go to a special location", "start": 732.1, "duration": 2.44}, {"text": "where you could capture Latias or Latios, depending on your game.", "start": 734.54, "duration": 3.5}, {"text": "Unfortunately, to do any of this, you need a second GBA.", "start": 738.16, "duration": 3.72}, {"text": "Remember: The e-Reader is basically a GBA cart itself,", "start": 741.88, "duration": 3.4}, {"text": "so first, you need your GBA with your copy of Ruby or Sapphire,", "start": 745.28, "duration": 4.04}, {"text": "a link cable, and a second GBA with the e-Reader.", "start": 749.76, "duration": 3.2}, {"text": "It was reasonable for Nintendo to expect the average Pokémon superfan to have a link cable", "start": 753.04, "duration": 4.54}, {"text": "and a friend or sibling with their own game and GBA to trade with.", "start": 757.58, "duration": 3.16}, {"text": "That's the entire idea behind making two versions of each game.", "start": 760.74, "duration": 3.0}, {"text": "But this was just a step too far, and it didn't catch on like Nintendo had hoped,", "start": 763.74, "duration": 4.8}, {"text": "at least in North America.", "start": 768.54, "duration": 1.3}, {"text": "Still, my favorite Battle-e card though was a special card released only in a Japanese magazine,", "start": 769.84, "duration": 5.8}, {"text": "that actually patched out a glitch!", "start": 775.64, "duration": 1.66}, {"text": "Pokémon Ruby and Sapphire had a weird bug which basically created a lost year", "start": 777.3, "duration": 4.38}, {"text": "where berries couldn't grow for a full calendar year.", "start": 781.68, "duration": 2.36}, {"text": "This card set could actually execute code into the game and patch it out!", "start": 784.12, "duration": 4.2}, {"text": "Now, sure, there were other ways Nintendo allowed players to patch out this glitch,", "start": 788.32, "duration": 3.9}, {"text": "but for my money, this is one of the coolest uses of an e-Reader card!", "start": 792.22, "duration": 3.62}, {"text": "Another super-cool e-Reader game was Super Mario Advance 4: Super Mario Bros. 3", "start": 796.02, "duration": 5.58}, {"text": "a.k.a. the greatest name for a Nintendo game of all time!", "start": 801.7, "duration": 3.78}, {"text": "Though it's a shame they didn't go all the way dumb and call it \"Super Mario Advance 4: Super Mario Bros. 3 e\",", "start": 805.62, "duration": 6.48}, {"text": "which is what the cards were called.", "start": 812.18, "duration": 1.48}, {"text": "Side note: The best video game title of all time is still:", "start": 813.66, "duration": 3.68}, {"text": "\"Peter Jackson's King Kong: The Official Game of the Movie\"", "start": 817.34, "duration": 3.9}, {"text": "Anyway, SMA4:SMB3eUS had 36 cards spread across two series,", "start": 821.34, "duration": 6.22}, {"text": "and they were all really cool!", "start": 827.56, "duration": 1.62}, {"text": "The cards had a few basic flavors:", "start": 829.18, "duration": 1.92}, {"text": "Demo cards that were essentially speedruns and Let's Plays before YouTube,", "start": 831.1, "duration": 4.76}, {"text": "and Power-Up cards, which let you add items to your inventory,", "start": 835.86, "duration": 3.3}, {"text": "or modify the game itself with switches that change the way the game was played!", "start": 839.16, "duration": 4.88}, {"text": "However, the true star of the show were the exclusive, brand-new level cards.", "start": 844.04, "duration": 4.58}, {"text": "There were 38 total e-Reader exclusive levels, of which only 13 were ever released in the US.", "start": 848.62, "duration": 7.06}, {"text": "By travelling to World-e, you can play these new levels", "start": 855.7, "duration": 3.02}, {"text": "and also collect special coins which were only available in e-Reader levels.", "start": 858.72, "duration": 3.96}, {"text": "Collecting enough coins would actually unlock three more minigames,", "start": 862.68, "duration": 3.38}, {"text": "but because of how bad the e-Reader flopped, two of these minigames were not unlockable in North America", "start": 866.06, "duration": 5.08}, {"text": "because we missed out on 25 level cards.", "start": 871.14, "duration": 3.02}, {"text": "After the e-Reader got kiboshed, it created a weird market in the Mario fandom.", "start": 874.16, "duration": 4.6}, {"text": "SMA4:SMB3e e-Reader card levels would actually save onto your cart after you unlocked them,", "start": 878.76, "duration": 6.14}, {"text": "so for a long time, one of the only ways you could play these levels", "start": 884.9, "duration": 3.16}, {"text": "is if you bought a cart that had all the unlocked levels on it.", "start": 888.06, "duration": 3.92}, {"text": "For example, our copy was bought second-hand, and has a few levels saved on it.", "start": 892.02, "duration": 4.58}, {"text": "In 2016, Nintendo re-released SMA4:SMB3e onto the WiiU Virtual Console,", "start": 896.62, "duration": 6.24}, {"text": "and it actually has all the levels and minigames unlocked from the start,", "start": 902.86, "duration": 4.3}, {"text": "including the levels that were previously Japanese exclusive!", "start": 907.16, "duration": 3.22}, {"text": "Not to mention, a physical cart actually doesn't have enough room for all 38 levels,", "start": 910.4, "duration": 4.8}, {"text": "so this makes the Virtual Console version THE definitive version,", "start": 915.2, "duration": 3.62}, {"text": "which is kind of unprecedented for a Virtual Console release!", "start": 918.82, "duration": 3.38}, {"text": "Now, naturally, all these levels have been recreated in Mario Maker,", "start": 922.2, "duration": 3.78}, {"text": "but this is still really, really cool!", "start": 925.98, "duration": 2.0}, {"text": "However, all the demo movies and Power-Up switches are not available on the WiiU version,", "start": 927.98, "duration": 5.46}, {"text": "but the e-Reader input screen is still there, which is kinda weird.", "start": 933.44, "duration": 3.92}, {"text": "This is particularly upsetting in light of a hidden set of game-altering switches", "start": 937.48, "duration": 4.24}, {"text": "hackers have found buried in the code.", "start": 941.72, "duration": 2.4}, {"text": "The cards that would have activated the switches were never released,", "start": 944.14, "duration": 3.58}, {"text": "so it's worth buying SMA4:SMB3e...", "start": 947.72, "duration": 3.84}, {"text": "... wait, did I say that right?", "start": 951.7, "duration": 0.98}, {"text": "Yeah, okay...", "start": 952.68, "duration": 1.04}, {"text": "... SMA4:SMB3e on WiiU Virtual Console for the extra levels,", "start": 953.82, "duration": 4.78}, {"text": "and downloading a ROM to play with the extra switches!", "start": 958.6, "duration": 3.08}, {"text": "Uh... though good luck trying to find those ROMs.", "start": 961.74, "duration": 2.5}, {"text": "Moving on, the third way you can use your e-Reader is with the GameCube,", "start": 964.54, "duration": 3.76}, {"text": "and the main way you would have done that, in North America at least, is with Animal Crossing.", "start": 968.3, "duration": 4.58}, {"text": "Pokémon Channel also had e-Reader compatibility and came with three special cards", "start": 973.12, "duration": 4.26}, {"text": "that you could use for the Smeargle paint minigame,", "start": 977.38, "duration": 3.26}, {"text": "but after the e-Reader got cancelled, they stopped including the cards in the box.", "start": 980.64, "duration": 4.46}, {"text": "They didn't actually remove the e-Reader capability,", "start": 985.18, "duration": 2.48}, {"text": "so you could still play the game if you got your hands on the cards.", "start": 987.66, "duration": 2.84}, {"text": "Anyway, Animal Crossing was a hugely ambitious game for a pre-Internet time,", "start": 990.56, "duration": 4.62}, {"text": "and was compatible with both the e-Reader and the GameCube GBA link cable,", "start": 995.18, "duration": 4.26}, {"text": "using them both to unlock a ton of extra content.", "start": 999.44, "duration": 2.56}, {"text": "Connecting your GBA via the GameCube GBA controller link cable granted you access to the Island,", "start": 1002.0, "duration": 5.58}, {"text": "while the e-Reader granted access to a ton of stuff!", "start": 1007.58, "duration": 2.96}, {"text": "There are five types of Animal Crossing cards, spread out over four different series,", "start": 1010.58, "duration": 4.32}, {"text": "and while that sounds like Nintendo really committing to the e-Reader,", "start": 1014.9, "duration": 3.6}, {"text": "it's actually another huge example of them not committing.", "start": 1018.5, "duration": 2.76}, {"text": "Let's start with the town tune cards:", "start": 1021.4, "duration": 2.18}, {"text": "They had dot code data stripes on them, but also the music notation right there,", "start": 1023.58, "duration": 5.06}, {"text": "so you didn't actually need the e-Reader to access the song.", "start": 1028.64, "duration": 3.32}, {"text": "Character cards could be used to send letters to animals in the game,", "start": 1031.96, "duration": 2.98}, {"text": "but each card also had passwords you could send via a letter instead,", "start": 1034.94, "duration": 3.98}, {"text": "again reducing the need to use the actual e-Reader.", "start": 1038.98, "duration": 2.7}, {"text": "On top of everything else, card-swiping is particularly time consuming in Animal Crossing", "start": 1041.68, "duration": 4.8}, {"text": "because of its flavorful dialog trees.", "start": 1046.48, "duration": 2.3}, {"text": "Also because the game kicks you out of the menu if you swipe a card wrong!", "start": 1048.78, "duration": 4.02}, {"text": "Design cards can be used to put new designs on clothes,", "start": 1052.88, "duration": 2.92}, {"text": "which is convenient if you're not that adept at making designs yourself,", "start": 1055.8, "duration": 3.62}, {"text": "but if you DO have a talent for that type of thing, you don't really need the cards.", "start": 1059.5, "duration": 3.98}, {"text": "But that sounds like a hell of a chore to me, so I'll just be sticking with the cards, thank you.", "start": 1063.56, "duration": 3.88}, {"text": "The fourth type are the game cards, the true e-Reader exclusive stuff!", "start": 1067.46, "duration": 4.04}, {"text": "You played them by swiping the game cards, and then swiping character cards to put them in your minigame.", "start": 1071.5, "duration": 4.6}, {"text": "Full disclosure though, we don't have any of the game cards ourselves,", "start": 1076.1, "duration": 3.4}, {"text": "and had some problems finding videos of this online.", "start": 1079.5, "duration": 2.92}, {"text": "Okay, so now we gotta talk Animal Crossing NES games:", "start": 1082.7, "duration": 3.36}, {"text": "Hidden in Animal Crossing are 15 NES games unlocked in various ways,", "start": 1086.06, "duration": 3.78}, {"text": "from going to the Island, at Tom Nook's lottery, or through promos given away by Nintendo.", "start": 1089.84, "duration": 5.62}, {"text": "They're super difficult to unlock in-game,", "start": 1095.56, "duration": 2.12}, {"text": "and back in the day internet forums were filled with tons of bunk rumors", "start": 1097.68, "duration": 4.1}, {"text": "for what games and how to unlock them.", "start": 1101.78, "duration": 2.68}, {"text": "Thank goodness we live in today's Internet hellscape, and we can save ourselves the drama", "start": 1104.52, "duration": 4.04}, {"text": "by googling the secret game codes and inputting them at Tom Nook's store.", "start": 1108.56, "duration": 3.78}, {"text": "However, this only worked for 15 of the actual 19 playable NES games,", "start": 1112.42, "duration": 4.78}, {"text": "the remaining four being Super Mario Bros., which was Japanese-exclusive,", "start": 1117.2, "duration": 3.54}, {"text": "the Legend of Zelda, which was never released officially,", "start": 1120.74, "duration": 2.78}, {"text": "Ice Climber and Mario Bros.", "start": 1123.52, "duration": 2.0}, {"text": "To access Ice Climber and Mario Bros., you can't input a code,", "start": 1125.66, "duration": 3.74}, {"text": "you NEED their special Animal Crossing e-Reader cards!", "start": 1129.4, "duration": 3.58}, {"text": "Well, either the e-Reader cards, or hacking with something like a GameShark,", "start": 1132.98, "duration": 3.4}, {"text": "but I wanna make sure we're crystal-clear on this:", "start": 1136.38, "duration": 2.56}, {"text": "The NES cards are NOT how you unlock the rest of the NES games in Animal Crossing,", "start": 1139.02, "duration": 5.62}, {"text": "and this copy of Ice Climber will not unlock Ice Climber in Animal Crossing.", "start": 1144.64, "duration": 4.56}, {"text": "For the version in Animal Crossing, it needs that one special e-card.", "start": 1149.36, "duration": 4.56}, {"text": "Side note: It's pretty cool that Animal Crossing has any NES games at all!", "start": 1154.04, "duration": 4.58}, {"text": "And it gets credit for being one of the first ways Nintendo re-released a collection of classic NES games,", "start": 1158.62, "duration": 5.74}, {"text": "but I still think the e-Reader NES Classic series takes the cake for being the first", "start": 1164.36, "duration": 4.22}, {"text": "\"Hey! These games are worth playing for their own sake!\"", "start": 1168.58, "duration": 3.36}, {"text": "- take on repackaging classic games.", "start": 1171.94, "duration": 2.08}, {"text": "It was a genuinely cool way for people to re-experience these games, or play them for the first time!", "start": 1174.14, "duration": 4.52}, {"text": "But both Animal Crossing and the NES e-Reader games deserve credit", "start": 1178.66, "duration": 3.76}, {"text": "for helping pave the way for the Classic NES series on the GBA, the Virtual Console,", "start": 1182.42, "duration": 5.04}, {"text": "and the general retro gaming community!", "start": 1187.5, "duration": 2.34}, {"text": "The e-Reader was discontinued in mid-2004,", "start": 1189.94, "duration": 2.74}, {"text": "but as we've mentioned, it actually lasted a bit longer in Japan.", "start": 1192.68, "duration": 3.72}, {"text": "In fact, its website is still live as of the making of this video!", "start": 1196.4, "duration": 4.16}, {"text": "As the e-Reader was phased out around the world,", "start": 1200.68, "duration": 2.5}, {"text": "e-Reader compatibility was straight-up deleted from the localized versions.", "start": 1203.18, "duration": 3.66}, {"text": "This, combined with the fact that the e-Reader was region-locked,", "start": 1206.94, "duration": 3.26}, {"text": "meant that only the staunchest importers got to play these games in a way they were meant to be played.", "start": 1210.2, "duration": 5.12}, {"text": "We don't have access to all these games, so we'll just run down a quick list:", "start": 1215.32, "duration": 3.46}, {"text": "Rockman Zero 3 had e-Reader mod cards,", "start": 1218.88, "duration": 2.74}, {"text": "and their in-game content was fully translated for the English release, and accessible via cheat codes.", "start": 1221.62, "duration": 5.62}, {"text": "Though the cards themselves never made it overseas,", "start": 1227.3, "duration": 2.3}, {"text": "this content would be included in the Mega Man Zero DS  collection.", "start": 1229.6, "duration": 4.34}, {"text": "Rockman EX 4, 5 and 6 had a similar e-Reader functionality,", "start": 1234.0, "duration": 3.94}, {"text": "but the North American Battle Network games have never been re-released... yet.", "start": 1237.94, "duration": 5.12}, {"text": "F-Zero: GP Legend's e-Reader functionality", "start": 1243.06, "duration": 2.6}, {"text": "was somewhat folded into the rest of the game for the US release,", "start": 1245.66, "duration": 2.98}, {"text": "and you could unlock certain card features by completing certain tasks.", "start": 1248.64, "duration": 4.0}, {"text": "However, staff ghosts and e+ course features were removed entirely from the international game.", "start": 1252.7, "duration": 5.54}, {"text": "Mario VS. Donkey Kong actually had five e-Reader level cards that are extremely rare, even in Japan.", "start": 1258.24, "duration": 5.94}, {"text": "Nintendo only gave out five cards,", "start": 1264.18, "duration": 1.84}, {"text": "though it appears twelve levels were actually planned for the release, and can be accessed via hacking.", "start": 1266.02, "duration": 5.02}, {"text": "The WiiU Virtual Console release does not feature these extra levels, like Super Mario 3 Advance.", "start": 1271.04, "duration": 5.14}, {"text": "Lots of Pokémon games from this time had extra e-Reader stuff exclusive to the Japanese releases:", "start": 1276.42, "duration": 5.48}, {"text": "Pokémon Pinball: Ruby & Sapphire had a small amount of e-Reader cards that were given out as promotions.", "start": 1281.98, "duration": 5.24}, {"text": "Pokémon FireRed and LeafGreen's e-Reader functionality", "start": 1287.3, "duration": 3.56}, {"text": "let Japanese players scan new trainers into the Battle Tower,", "start": 1290.86, "duration": 3.74}, {"text": "but most of these trainers are unlocked by default in the worldwide releases.", "start": 1294.6, "duration": 3.78}, {"text": "Pokémon Emerald had its e-Reader functionality removed,", "start": 1298.46, "duration": 3.0}, {"text": "but some of the Japanese e-Reader functions were added to the game.", "start": 1301.46, "duration": 3.56}, {"text": "The only way to get an Eon Ticket in the PAL and US versions of Emerald", "start": 1305.02, "duration": 4.12}, {"text": "is record mixing with another game with an unlocked Eon Ticket already.", "start": 1309.14, "duration": 3.54}, {"text": "Pokémon Colosseum had a Card-e room that was completely sealed off in international versions.", "start": 1312.74, "duration": 5.2}, {"text": "It's where you'd have your battle card fights, as well as capture three extra Shadow Pokémon.", "start": 1318.06, "duration": 4.86}, {"text": "Domo-kun no Fushigi Terebi is unique on this list", "start": 1323.04, "duration": 3.18}, {"text": "because it is a completely Japanese-exclusive game.", "start": 1326.22, "duration": 2.8}, {"text": "Its e-Reader cards could unlock minigames.", "start": 1329.08, "duration": 2.8}, {"text": "Hamtaro Card-e, or \"Tottoku Hamtaro Ham-Ham Ham-Ha! Magic Princess\",", "start": 1331.98, "duration": 5.76}, {"text": "actually doesn't work with any GBA games, it's a card set that works similarly to the NES Classic series.", "start": 1337.74, "duration": 5.5}, {"text": "Swiping the cards unlocked cute little minigames", "start": 1343.24, "duration": 2.44}, {"text": "that really prove that when you work together, it IS much better!", "start": 1345.68, "duration": 3.78}, {"text": "Grace made me say this.", "start": 1350.12, "duration": 1.12}, {"text": "♫ \"My ham-hams!\" ♫", "start": 1351.24, "duration": 1.28}, {"text": "But perhaps the biggest casualty of all:", "start": 1352.52, "duration": 2.02}, {"text": "We were robbed of three different minigames that you could play on the Game Boy Advance in Pikmin 2!", "start": 1354.62, "duration": 5.74}, {"text": "So cute!!", "start": 1360.56, "duration": 1.22}, {"text": "And as far as we know, these games have never been re-released.", "start": 1361.9, "duration": 3.26}, {"text": "How ya feel, Grace?", "start": 1365.32, "duration": 1.04}, {"text": "GRACE: Ah... sad!", "start": 1366.8, "duration": 1.62}, {"text": "And that just about covers everything!", "start": 1369.06, "duration": 2.64}, {"text": "The e-Reader was short-lived and definitely ahead of its time,", "start": 1371.7, "duration": 3.46}, {"text": "but was a pretty damn cool device, and a must-have device for hardcore collectors!", "start": 1375.16, "duration": 4.66}, {"text": "While Grace and I both love this little thing for all it can do,", "start": 1380.06, "duration": 2.72}, {"text": "I can understand why it wasn't successful: Look at how long it took us just to explain it!", "start": 1382.78, "duration": 4.62}, {"text": "That's the kind of thing that ad execs lose sleep over!", "start": 1387.4, "duration": 2.66}, {"text": "But it's something I hope the hacking community can get excited about!", "start": 1390.06, "duration": 3.04}, {"text": "There was a small homebrew scene that seems to have completely petered out", "start": 1393.22, "duration": 3.84}, {"text": "by the time the DS conquered the market,", "start": 1397.06, "duration": 1.82}, {"text": "but a lot of their documentation is still available for those that are interested!", "start": 1398.88, "duration": 3.8}, {"text": "Thanks so much for watching, please subscribe, click that bell, leave a like, leave a comment,", "start": 1402.68, "duration": 4.62}, {"text": "and don't forget to check out NordVPN.com/stopskeletons!", "start": 1407.3, "duration": 4.36}, {"text": "VPN's are an essential way to protect yourself online,", "start": 1411.72, "duration": 3.12}, {"text": "and as the only VPN to get a five-star rating from PCMag,", "start": 1414.84, "duration": 4.06}, {"text": "NordVPN is the VPN that Grace and I personally use.", "start": 1419.0, "duration": 3.56}, {"text": "Listen: Grace and I do a lot of work at coffee shops and at libraries,", "start": 1422.56, "duration": 3.88}, {"text": "and you need to protect yourself when you're using public internet!", "start": 1426.48, "duration": 2.88}, {"text": "Again, thanks to NordVPN, you can use the code \"stopskeletons\" at NordVPN.com/stopskeletons", "start": 1429.44, "duration": 7.3}, {"text": "to get a 66% off a two-year plan!", "start": 1436.74, "duration": 3.42}, {"text": "That's NordVPN.com/stopskeletons, and the offer code \"stopskeletons\".", "start": 1440.22, "duration": 5.28}, {"text": "Alright, I'll be over here just, uh...", "start": 1445.58, "duration": 2.36}, {"text": "... swiping some e-Reader cards.", "start": 1448.04, "duration": 1.74}, {"text": "Yeah...", "start": 1452.26, "duration": 0.98}, {"text": "Think I'ma play some Excitebike.", "start": 1453.44, "duration": 1.6}, {"text": "[♫ improvised sick beat ♫]\n\"Load application - Start application\"", "start": 1455.1, "duration": 5.76}, {"text": "Excitebike...", "start": 1461.96, "duration": 1.54}, {"text": "[♫ another sick GBA beat ♫]", "start": 1464.88, "duration": 4.06}, {"text": "Ooh, forgot about this rockin' music!", "start": 1468.94, "duration": 2.04}, {"text": "Grace, we didn't talk about the rockin' music!", "start": 1471.9, "duration": 1.5}, {"text": "GRACE: We forgot...", "start": 1473.4, "duration": 0.96}, {"text": "\"Read error!\"", "start": 1488.32, "duration": 1.02}, {"text": "[Grace chuckles off-screen]", "start": 1489.34, "duration": 1.84}, {"text": "[♫ fanfare ♫]", "start": 1495.84, "duration": 2.58}, {"text": "\"Scanning a dot code. Start application.\"", "start": 1498.42, "duration": 3.74}, {"text": "\"Okay to overwrite this application?\"", "start": 1502.16, "duration": 2.9}, {"text": "Yes.", "start": 1505.08, "duration": 0.92}, {"text": "\"Saving...\"", "start": 1506.0, "duration": 0.76}, {"text": "[♫ Excitebike intro jingle ♫]", "start": 1512.16, "duration": 7.8}, {"text": "[♫ start race jingle ♫]", "start": 1521.88, "duration": 6.94}]