[{"text": "College enrollment is expected to rise from approximately 20 million students in", "start": 7.87, "duration": 4.189}, {"text": "2016 to over 23 million by 2025 the average student loan debt in America is currently over", "start": 12.37, "duration": 6.62}, {"text": "$30,000 per student and shockingly a recent study found that in the first two years of college", "start": 19.779, "duration": 5.27}, {"text": "45% of students showed no gains and critical thinking if this is true this begs the question are schools failing us", "start": 25.81, "duration": 6.649}, {"text": "Before we can answer the question we have to go over a very brief history of human education for 90% of our existence", "start": 32.8, "duration": 7.099}, {"text": "Humans have lived as nomadic", "start": 40.03, "duration": 2.0}, {"text": "Hunter-gatherers in those days the dominant form of learning occurred between families and tribes we learned to hunt and gather from those around us around", "start": 42.1, "duration": 7.49}, {"text": "10,000 BC an", "start": 49.93, "duration": 1.62}, {"text": "Agricultural revolution occurred this dramatically changed the ways in which we live humans began to settle down and form early civilizations", "start": 51.55, "duration": 7.309}, {"text": "Agriculture was a massive part of our lives up until the Industrial Revolution", "start": 59.559, "duration": 3.02}, {"text": "As you can imagine this agricultural period covers a large span of time from approximately", "start": 62.98, "duration": 4.609}, {"text": "10,000 BC to around 1760 ad in this period of time we shifted from primarily tribal learning to various types of", "start": 68.08, "duration": 7.519}, {"text": "apprenticeships and", "start": 75.759, "duration": 1.081}, {"text": "apprenticeship takes on a very broad meaning here such as working under a master craftsman a slave master or being part of a guild", "start": 76.84, "duration": 7.25}, {"text": "essentially education started to shift away from the family unit the next major revolution the Industrial Revolution", "start": 84.52, "duration": 5.989}, {"text": "Marked another drastic change in our education. It was during the industrial period that schools as we know them formed", "start": 91.18, "duration": 6.29}, {"text": "But how did it happen? the Secretary of Education for the state of Massachusetts", "start": 97.689, "duration": 3.74}, {"text": "At the time Horace Mann studied several systems across Europe to find the one that he believed would be the best for America", "start": 101.619, "duration": 6.05}, {"text": "He concluded that the Prussian model would be the best it was funded by taxes attendance was mandatory, and it had specially trained teachers", "start": 107.67, "duration": 6.809}, {"text": "But the thing is many people might not know that the Prussians used their school system as a way to instill", "start": 114.49, "duration": 5.569}, {"text": "Obedience to Authority in young students in fact a Prussian philosopher by the name of Johann", "start": 120.189, "duration": 5.15}, {"text": "Played a key role in forming their educational system", "start": 125.68, "duration": 2.389}, {"text": "And he said that if you want to influence a person you must do more than merely talk to him", "start": 128.069, "duration": 5.13}, {"text": "you must fashion him and", "start": 133.62, "duration": 1.66}, {"text": "Fashion him in such a way that he simply cannot will otherwise than what you wish him to will now. This is where?", "start": 135.28, "duration": 5.75}, {"text": "Conspiracy theorists might call it a day and reduce the entirety of public education in America to that of a brainwashing machine", "start": 141.159, "duration": 5.99}, {"text": "I don't agree in man's journals", "start": 147.15, "duration": 2.16}, {"text": "He openly acknowledges that the Prussians were using their system of education for evil", "start": 149.31, "duration": 4.259}, {"text": "But he believed that it could be used for good if it was put in the right hands some man", "start": 153.569, "duration": 3.99}, {"text": "Advocated heavily for the Prussian model and it became the one implemented in America the next step was to create a standardized educational experience in", "start": 157.72, "duration": 7.519}, {"text": "1892 a committee of 10 people was selected to oversee the standardization of", "start": 165.7, "duration": 4.55}, {"text": "education in America at the time", "start": 170.53, "duration": 1.95}, {"text": "Education was too varied across different schools to accurately gauge", "start": 172.48, "duration": 3.11}, {"text": "Which schools were doing well and how different students rank compared to one another when assessing them for college admissions?", "start": 175.66, "duration": 5.929}, {"text": "So this committee of 10 studied schools across America and saw that there were approximately", "start": 181.629, "duration": 4.1}, {"text": "40 different courses being studied among the various schools they narrowed this list down to the nine courses that they deemed to be the most", "start": 185.95, "duration": 6.949}, {"text": "important which were Latin, Greek, English, other modern languages,", "start": 193.03, "duration": 4.339}, {"text": "Mathematics, physics, astronomy and chemistry, natural history, history civil government and political economy and geography", "start": 197.98, "duration": 6.919}, {"text": "After these nine courses were selected, the committee of 10 selected 10 more members for each course to answer questions such as", "start": 205.269, "duration": 7.25}, {"text": "When should the subject be introduced?", "start": 212.519, "duration": 2.081}, {"text": "When should different part of it be introduced?", "start": 214.6, "duration": 2.1}, {"text": "How long should it be studied for?", "start": 217.2, "duration": 1.5}, {"text": "And what parts of the subject should be studied?", "start": 218.7, "duration": 1.72}, {"text": "Together these few people shape the curriculum for all future students", "start": 221.079, "duration": 4.121}, {"text": "Although there has been some changes to this curriculum a large part of this curriculum still makes up the core of K to 12 education", "start": 225.22, "duration": 6.529}, {"text": "At the time this public and standardized education was created. I believe that it was quite progressive and innovative", "start": 231.91, "duration": 5.809}, {"text": "There are actually lots of benefits to a public and standardized education such as it's free it allows us to run schools more efficiently", "start": 237.879, "duration": 6.71}, {"text": "Maintains a minimum level of quality and all people must be treated equally and allowed to receive an education", "start": 244.87, "duration": 5.389}, {"text": "regardless of race sex class creed or status and", "start": 250.78, "duration": 3.079}, {"text": "Lastly it acted as a powerful economic machine during", "start": 254.26, "duration": 2.75}, {"text": "Industrial times and allowed the middle class to grow how could a system that did so much for our economy go so wrong", "start": 257.169, "duration": 5.809}, {"text": "That's what we'll talk about in part 2 of this video this video is sponsored by our", "start": 263.53, "duration": 3.739}, {"text": "Friends over at blinkist blinkist is an app that summarizes some of the key insights from over", "start": 267.42, "duration": 4.47}, {"text": "2200 of the best-selling non-fiction books they have an expert editorial team that selects the most relevant books at the time and", "start": 272.32, "duration": 5.989}, {"text": "teases out the key concepts in an easily digestible", "start": 278.38, "duration": 2.3}, {"text": "Format called blinks these blinks can be used to introduce you to new topics books and writers help you vet books before buying them", "start": 281.17, "duration": 6.529}, {"text": "Prime you for an upcoming read and refresh your memory on things you read in the past", "start": 287.77, "duration": 3.889}, {"text": "Blinks can be read in short 5 to 10 minute bursts or listen to an audio format", "start": 291.82, "duration": 3.86}, {"text": "So you can squeeze in some learning anytime during the day blinkist's subscriptions normally start at $49.99 for an entire year", "start": 295.68, "duration": 6.419}, {"text": "But blinkist is offering an exclusive deal for freedom and thought fans", "start": 302.17, "duration": 3.2}, {"text": "You can click the link in the description below to receive 20% off a new subscription or try out the free trial for blinkists", "start": 305.44, "duration": 6.38}, {"text": "As always, thanks for watching, and I'll see you next time", "start": 311.83, "duration": 2.75}]