[{"text": "Hey, everyone; get ready for a new nerd episode, but first, a word about our sponsor: ExpressVPN.", "start": 0.28, "duration": 5.32}, {"text": "Just in case ya didn't know, a VPN is a Virtual Private Network.", "start": 5.86, "duration": 3.26}, {"text": "It's a service that encrypts your internet data and protects your online identity.", "start": 9.12, "duration": 3.88}, {"text": "There's an ExpressVPN program for your computer, an app for your mobile device, and a plugin for your browser.", "start": 13.0, "duration": 5.3}, {"text": "It's very easy to set up.", "start": 18.3, "duration": 1.4}, {"text": "Just download the program, open it up, choose your virtual location and click the big button.", "start": 19.7, "duration": 4.4}, {"text": "I use ExpressVPN because, honestly, privacy is important to me and to you, as well.", "start": 24.26, "duration": 4.44}, {"text": "It's also a good value, considering it's less than $7 a month with a 30-day money-back guarantee.", "start": 28.7, "duration": 4.92}, {"text": "Take back your internet privacy today, and find out how you can get three months free by clicking the link in the description box:", "start": 33.62, "duration": 6.02}, {"text": "expressvpn.com/cinemassacre.", "start": 39.64, "duration": 2.94}, {"text": "That's \"expressvpn.com/cinemassacre\", for three months free, with a one-year package.", "start": 42.58, "duration": 6.94}, {"text": "Again, please visit \"expressvpn.com/cinemassacre\" to learn more.", "start": 49.54, "duration": 4.32}, {"text": "Take back your internet privacy today!", "start": 54.16, "duration": 2.24}, {"text": "But now, let's get \"Chronologically Confused\"!", "start": 56.52, "duration": 3.2}, {"text": "AVGN: Let's take a trip back to the early-2000s.", "start": 61.2, "duration": 2.42}, {"text": "PlayStation 2, GameCube and original Xbox are dukin' it out,", "start": 63.62, "duration": 3.06}, {"text": "but, ah, let's not get into all that Console War shit, right now.", "start": 66.7, "duration": 2.84}, {"text": "So, anyway, Square Enix, which was still called \"SquareSoft\" at the time, is the RPG master.", "start": 69.54, "duration": 5.18}, {"text": "With the long-running success of their \"Final Fantasy\" series, and hot off the release of \"Final Fantasy X\",", "start": 74.72, "duration": 5.14}, {"text": "the company makes an announcement, that at the time, hit the world with shock and confusion.", "start": 79.86, "duration": 5.0}, {"text": "Enter \"Kingdom Hearts\", an ambitious crossover between the Final Fantasy universe and Disney.", "start": 84.86, "duration": 5.72}, {"text": "Yeah, Disney.", "start": 90.58, "duration": 1.34}, {"text": "If you were to see screenshots of the game in magazines at the time, you'd think it was a joke.", "start": 91.92, "duration": 4.7}, {"text": "But it wasn't; in fact, it was a big success,", "start": 96.62, "duration": 2.74}, {"text": "and it was followed by \"Kingdom Hearts II\" in 2005.", "start": 99.36, "duration": 2.9}, {"text": "And since then, everybody's been waiting for the third game.", "start": 102.26, "duration": 3.08}, {"text": "But little did they know, it wouldn't be out... for thirteen years.", "start": 105.36, "duration": 3.78}, {"text": "Now, I'll admit, I haven't played any of the games, so far.", "start": 109.36, "duration": 3.62}, {"text": "But with all the hype surrounding it, and with the third game right around the corner, I was wondering:", "start": 112.98, "duration": 3.96}, {"text": "\"Is it worth getting into?\"", "start": 116.94, "duration": 1.14}, {"text": "I mean, there's not... that much to catch up with... there's only three games, right?", "start": 118.08, "duration": 4.12}, {"text": "Yeeaaah...", "start": 122.2, "duration": 1.3}, {"text": "Well, well, well...", "start": 123.5, "duration": 1.62}, {"text": "Kingdom Hearts is a MASSIVE series with about twenty games altogether,", "start": 125.12, "duration": 4.06}, {"text": "containing sequels, prequels, remakes, HD remasters, and even concerts.", "start": 129.28, "duration": 5.5}, {"text": "If you think you can play just the main three games and know what's up then...", "start": 134.78, "duration": 4.38}, {"text": "*chuckles* Oh, think again.", "start": 139.16, "duration": 2.72}, {"text": "The first game starts off simple enough, it tells the story of a boy named Sora who lives on the Destiny Islands with his friends.", "start": 141.92, "duration": 6.48}, {"text": "The group dreams of leaving the islands and exploring new worlds,", "start": 148.4, "duration": 2.86}, {"text": "but one night the islands are attacked by evil monsters called the \"Heartless\", to battle the Heartless, Sora obtains the \"Keyblade\".", "start": 151.26, "duration": 6.62}, {"text": "It's not really a blade so much as a big fucking key that you use to bash the ever-loving shit out of enemies with.", "start": 157.88, "duration": 5.48}, {"text": "Sora defeats the Heartless that attacked their home, but the island is destroyed,", "start": 163.36, "duration": 4.1}, {"text": "and at the same time this is happening, Donald Duck and Goofy set out to find Mickey Mouse", "start": 167.46, "duration": 4.46}, {"text": "using a spaceship and end up landing in Traverse Town where they meet Sora and begin their quest to find their friends and stop the Heartless.", "start": 171.92, "duration": 5.84}, {"text": "It's a decent Action-RPG that stands up with Square's usual quality of games.", "start": 177.78, "duration": 4.08}, {"text": "The story can be kind of confusing but makes sense within the confines of the universe of establishes.", "start": 181.86, "duration": 4.78}, {"text": "Then the second game comes out and that's where it gets really nuts,", "start": 186.64, "duration": 3.98}, {"text": "It starts you off in Twilight Town as a new guy; Roxas, and his friends.", "start": 190.62, "duration": 3.86}, {"text": "Well, that's fine. But what happened to Sora, Donald and Goofy?", "start": 194.56, "duration": 3.18}, {"text": "These new characters are never mentioned anywhere in the first game, but all of a sudden they're the main characters?", "start": 197.84, "duration": 5.34}, {"text": "Sora, Donald and Goofy don't even show up until about two hours into the game.", "start": 203.18, "duration": 4.26}, {"text": "So what happened?", "start": 207.44, "duration": 1.76}, {"text": "Well, it turns out to get the full story,", "start": 209.2, "duration": 2.38}, {"text": "you have to play Kingdom Hearts: Chain of Memories on the GameBoy Advance before playing Kingdom Hearts 2.", "start": 211.62, "duration": 5.22}, {"text": "That's where Roxas gets introduced and it also gives the story in between the first and second game.", "start": 216.84, "duration": 4.66}, {"text": "But come on, you can't just stick some new characters in the main sequel without any explanation or proper introduction,", "start": 221.5, "duration": 6.82}, {"text": "so now you have to get a GameBoy Advance if you don't already have one and play through another game just so you can be up to speed on part two.", "start": 228.32, "duration": 6.86}, {"text": "Okay, imagine if you're watching the Back to the Future trilogy, you finished the first one and can't wait to see what happens,", "start": 235.24, "duration": 5.6}, {"text": "then the movie starts and it's just a bunch of new characters you've never seen before", "start": 240.84, "duration": 3.46}, {"text": "and Doc and Marty finally show up 45 minutes into the damn movie.", "start": 244.3, "duration": 3.4}, {"text": "Then you find out, you're supposed to listen to a book on tape before you watch it.", "start": 247.7, "duration": 4.12}, {"text": "I guess it's also like how you have to sit through an hour of the awful Star Wars Holiday Special just to see the introduction of Boba Fett.", "start": 251.82, "duration": 6.5}, {"text": "Geez, hopefully that's the last time I ever have to reference THAT unsalvageable waste of recording media.", "start": 258.4, "duration": 5.4}, {"text": "However, even if you do play it, Chain or Memories doesn't even explain who Roxas is, it just introduces him.", "start": 263.94, "duration": 6.38}, {"text": "Roxas is Sora's \"Nobody\".", "start": 270.46, "duration": 1.96}, {"text": "In Kingdom Hearts, when someone with a strong heart loses their heart, they create a nobody.", "start": 272.42, "duration": 4.8}, {"text": "So when Sora gave his heart to save Kairi in the first game, he created Roxas.", "start": 277.28, "duration": 4.7}, {"text": "Well, that's all well and good, but how about explain that shit?", "start": 281.98, "duration": 2.94}, {"text": "Most of the prequels and in-between games came out in 2008 and onward, that's three years after Kingdom Hearts 2 is released, and six after the first.", "start": 285.14, "duration": 8.0}, {"text": "Oh and the names, you want to get into the titles?", "start": 293.14, "duration": 2.7}, {"text": "Boy, did they use every possible naming convention under the sun.", "start": 296.02, "duration": 4.3}, {"text": "You have numbered games, games using the Greek alphabet, decimals and even fractions.", "start": 300.32, "duration": 5.78}, {"text": "The game about Roxas is called:", "start": 306.16, "duration": 1.94}, {"text": "Ahh *stammering* That. Look.", "start": 308.1, "duration": 2.16}, {"text": "That's the title.", "start": 310.34, "duration": 0.98}, {"text": "I can't even think of any sequels in general that use fractions,", "start": 311.32, "duration": 4.18}, {"text": "maybe The Naked Gun movies, but off the top of my head, that's about it.", "start": 315.62, "duration": 4.26}, {"text": "And I don't even know if it's intended to be a fraction.", "start": 320.08, "duration": 2.9}, {"text": "After reducing it down, it should be called \"Kingdom Hearts 179 days\".", "start": 323.2, "duration": 5.18}, {"text": "Yeah, yeah, I know it's supposed to be 358 days between two characters, but seriously,", "start": 328.54, "duration": 4.84}, {"text": "the first time I saw this title I didn't even know how to read it.", "start": 333.38, "duration": 3.02}, {"text": "Is it \"358 Over Two Days\"? Is it \"358 Halves Days\"?", "start": 336.4, "duration": 4.48}, {"text": "No, the way it's supposed to be read,", "start": 340.96, "duration": 2.28}, {"text": "is \"Kingdom Hearts Three-Five-Eight Days over Two\".", "start": 343.24, "duration": 4.04}, {"text": "Why not just call it \"Kingdom Hearts Roxas Story\"?", "start": 347.38, "duration": 2.82}, {"text": "Why all the convoluted, cockamamie names?!", "start": 350.2, "duration": 2.76}, {"text": "The one that really takes the cake for me and get ready for this,", "start": 352.96, "duration": 3.26}, {"text": "is \"Kingdom Hearts 0.2: Birth by Sleep - A Fragmentary Passage\".", "start": 356.22, "duration": 5.76}, {"text": "That's a paragraph!", "start": 361.98, "duration": 1.54}, {"text": "You have a decimal, a subtitle and a tag line?!", "start": 363.52, "duration": 2.94}, {"text": "Now that's a motherfucking title!", "start": 366.54, "duration": 2.26}, {"text": "So with that said, let's finally start tackling this timeline,", "start": 368.96, "duration": 3.28}, {"text": "it starts not with Kingdom Hearts 1, but with Kingdom Hearts... Chi,", "start": 372.24, "duration": 4.62}, {"text": "which was a Japan-only browser-based game explaining the Keyblade War.", "start": 377.0, "duration": 3.92}, {"text": "Nowadays, it isn't even playable,", "start": 380.92, "duration": 2.36}, {"text": "but the cutscenes were remastered in Kingdom Hearts HD 2.8 Final Chapter Prologue for the PS4.", "start": 383.28, "duration": 6.04}, {"text": "What a mouthful!", "start": 389.4, "duration": 1.3}, {"text": "This was followed by Kingdom Hearts: Birth by Sleep for the PSP,", "start": 390.7, "duration": 3.78}, {"text": "then we have Kingdom Hearts 1,", "start": 394.48, "duration": 2.26}, {"text": "Kingdom Hearts: Chain of Memories,", "start": 396.74, "duration": 1.78}, {"text": "Kingdom Hearts 385/2 Days,", "start": 398.52, "duration": 3.48}, {"text": "and Kingdom Hearts 2.", "start": 402.0, "duration": 1.72}, {"text": "After that is where it starts getting really weird or... weirder.", "start": 403.72, "duration": 3.9}, {"text": "After two, we get Kingdom Hearts coded, which only came out on Japanese mobile phones.", "start": 407.62, "duration": 5.36}, {"text": "It was however later released as Kingdom Hearts Re:coded on the Nintendo DS,", "start": 412.98, "duration": 5.18}, {"text": "after Coded came Kingdom Hearts: Dream Drop Distance, the first tongue-twister sequel for the 3DS,", "start": 418.5, "duration": 6.06}, {"text": "and the last game before Kingdom Hearts 3, was Kingdom Hearts 0.2: Birth by Sleep - A Fragmentary Passage.", "start": 424.56, "duration": 6.7}, {"text": "Yeah, that's one of my favorites.", "start": 431.38, "duration": 1.62}, {"text": "That right there is everything you need to know for Kingdom Hearts 3.", "start": 433.08, "duration": 3.58}, {"text": "So if you were following from the beginning just to get the full story, you'd be spending hundreds of dollars,", "start": 436.66, "duration": 5.0}, {"text": "or maybe even thousands between every game and console you need,", "start": 441.66, "duration": 3.64}, {"text": "you know, just to see Mickey, Donald, Goofy and some anime kids beat the shit out of people with keys.", "start": 445.3, "duration": 5.58}, {"text": "Not to mention, there was a concert in 2017 and 2018 with additional plot points,", "start": 450.92, "duration": 5.74}, {"text": "but the only way you're gonna see that now is if you build yourself a time machine.", "start": 456.66, "duration": 3.42}, {"text": "So on top of the thousand dollars you're spending on the games, you're also gonna have to spend millions to obtain plutonium to power a flux capacitor.", "start": 460.08, "duration": 7.24}, {"text": "Oh, then again, It's on YouTube.", "start": 467.32, "duration": 1.92}, {"text": "Luckily nowadays, there's a ton of Kingdom Hearts compilations you can get that pack multiple games into one,", "start": 469.44, "duration": 5.66}, {"text": "there's almost as many remakes and remasters as there are actual games in the series.", "start": 475.1, "duration": 4.62}, {"text": "You have Kingdom Hearts HD 1.5 Remix,", "start": 479.72, "duration": 3.04}, {"text": "Kingdom Hearts HD 2.5 Remix,", "start": 482.76, "duration": 2.16}, {"text": "Kingdom Hearts HD 2.8 Remix Final Chapter Prologue,", "start": 484.92, "duration": 3.06}, {"text": "Kingdom Hearts HD 1.5 + 2.5 Remix", "start": 487.98, "duration": 3.74}, {"text": "and lastly Kingdom Hearts - The Story So Far.", "start": 491.72, "duration": 3.36}, {"text": "What a convenient title.", "start": 495.26, "duration": 1.5}, {"text": "The Story So Far packs in everything you need to know - the full story - before Kingdom Hearts 3 drops,", "start": 496.76, "duration": 6.1}, {"text": "and you don't need to understand complex mathematics or the Greek alphabet to play it.", "start": 502.94, "duration": 4.1}, {"text": "With all the shit packed in well after the first and second game, it makes me think:", "start": 507.04, "duration": 5.0}, {"text": "\"They hadn't planned any of this\".", "start": 512.04, "duration": 1.46}, {"text": "The first game is pretty straightforward.", "start": 513.5, "duration": 1.86}, {"text": "You travel to different Disney worlds to stop the Heartless and try to find your friends,", "start": 515.36, "duration": 4.14}, {"text": "the plethora of side stories and prequels just makes me feel like they were desperately trying to keep the hype train running until the third game finally came out.", "start": 519.66, "duration": 7.52}, {"text": "This series did essentially span three console generations, so I can understand they wanted to give the fanbase something to do in the mean time.", "start": 527.18, "duration": 7.32}, {"text": "But I just wonder if they had this entire story planned or we're just patting it out to keep the interest going.", "start": 534.5, "duration": 5.6}, {"text": "So for someone who's just now looking to play these games for the first time.", "start": 540.1, "duration": 4.0}, {"text": "I'm...", "start": 544.26, "duration": 0.66}, {"text": "kind of intimidated.", "start": 544.92, "duration": 1.26}, {"text": "Between all the entries in the series you're looking at over a hundred hours of gameplay", "start": 546.26, "duration": 4.32}, {"text": "and that's without even counting Kingdom Hearts 3.", "start": 550.58, "duration": 2.52}, {"text": "Well gee, add that to the whole list of games in general that I'm trying to play,", "start": 553.1, "duration": 4.12}, {"text": "it's gonna be another thirteen years to do that.", "start": 557.22, "duration": 2.2}, {"text": "I guess though, by that time, the third game will be old enough to do a proper Angry Nerd review.", "start": 559.62, "duration": 4.52}, {"text": "But these games so far are pretty decent,", "start": 564.22, "duration": 2.74}, {"text": "they provide a nice amount of playtime for your money and the worlds are diverse and interesting.", "start": 566.96, "duration": 4.46}, {"text": "While the Disney stuff is kind of weird, it never feels out of place in the game's universe.", "start": 571.42, "duration": 4.78}, {"text": "Also, now with Disney owning Star Wars and the Marvel Universes, it'll be cool battling alongside Jedi and Avengers.", "start": 576.2, "duration": 6.78}, {"text": "Will that ever happen?", "start": 582.98, "duration": 1.2}, {"text": "Maybe, maybe not, but maybe when Kingdom Hearts 4 drops in 2030,", "start": 584.18, "duration": 4.28}, {"text": "then we'll finally be able to see Sora, Mickey, Donald and Goofy team-up with Han Solo, Luke and Iron Man.", "start": 588.46, "duration": 6.98}, {"text": "Or not.", "start": 595.74, "duration": 0.7}, {"text": "But until then, who knows how many prequels and spin-offs and side stories and 4K remasters and remakes and reboots and requels we'll see.", "start": 596.64, "duration": 9.82}, {"text": "Only time will tell.", "start": 606.46, "duration": 1.42}]