[{"text": "WELCOME GAMERS to *PHOTOSHOP BATTLE ROYALE*", "start": 0.13, "duration": 2.27}, {"text": "A competition where a hundred people will compete to do", "start": 2.56, "duration": 2.36}, {"text": "the NASTIEST [REDACTED] to the most NORMAL images on the Internet!", "start": 5.0, "duration": 2.8}, {"text": "With a prize pool of (get this) $1000 DOLLARS", "start": 7.8, "duration": 2.28}, {"text": "FEATURING YOUR HOST QUACKITY AND THE JUDGES", "start": 10.08, "duration": 2.52}, {"text": "the ENTIRE...TWITCH...CHAT", "start": 12.6, "duration": 1.7}, {"text": "We're also proud to announce that this competition has been sponsored by my own moms (purse)...", "start": 14.3, "duration": 4.92}, {"text": "And by the mobile game RAID SHADOW LEGENDS.", "start": 19.22, "duration": 2.2}, {"text": "ha...raid", "start": 21.42, "duration": 0.5}, {"text": "A LOT OF THINGS are gonna happen today, alright?", "start": 23.26, "duration": 2.42}, {"text": "A LOT OF THINGS are going to happen", "start": 25.68, "duration": 1.32}, {"text": "There are three channels in here, image here", "start": 27.0, "duration": 2.36}, {"text": "I will place the image that I want you guys to photo shop and how I want you guys to photoshop.", "start": 29.36, "duration": 5.0}, {"text": "You'll have 10 Minutes from there to begin sending your images", "start": 34.5, "duration": 2.24}, {"text": "Alright, once you've done that you will add your image to submissions", "start": 36.75, "duration": 3.569}, {"text": "If you try to be a little FUNNY GUY post something COMPLETELY unrelated", "start": 40.32, "duration": 3.509}, {"text": "It's not gonna work. Chat, you are going to decide who is a winner - who gets to, uh, continue", "start": 43.93, "duration": 5.239}, {"text": "I've been told by the, uh, producers that we have hit a hundred, a hundred members. So, uh, are you ready chat?", "start": 49.48, "duration": 5.779}, {"text": "We're gonna take this very intimidating picture of Josh Peck and make him into a mobster now I myself I'm going to participate. Oh", "start": 57.86, "duration": 7.52}, {"text": "He already looks like a goddamn mafiosa to begin with. So to begin with the timer starts, by the way, it's ten minutes and meanwhile, I'll begin myself to", "start": 66.26, "duration": 7.36}, {"text": "Its fedoras? he's gonna look like a gamer not like a mobster", "start": 74.46, "duration": 3.48}, {"text": "They have golden teeth. That is so true", "start": 79.229, "duration": 2.12}, {"text": "Everyone doing their Photoshop images you better", "start": 83.82, "duration": 2.12}, {"text": "What are you doing to my body I hate you so much for doing this.", "start": 90.92, "duration": 4.3}, {"text": "HE'S A MOBSTER, MOBSTERS DON'T WEAR AIRPODS", "start": 95.22, "duration": 2.0}, {"text": "What is wrong with you people?", "start": 97.66, "duration": 2.0}, {"text": "All right, first one, let's go are you seeing this chat yes or no, let's go No Oh", "start": 111.96, "duration": 6.34}, {"text": "Crowd. We got a tough crowd", "start": 119.79, "duration": 2.0}, {"text": "What is this?? who the hell made this one??are they gonna join the Photoshop battle royale I I would I'd vote yes, dude", "start": 125.49, "duration": 6.829}, {"text": "Yes. Yes, let's go. Let's go, dude", "start": 132.319, "duration": 3.029}, {"text": "Jack Geoff Picasso, I don't know man. You did a good thing with the cigar smoke. I like that touch", "start": 136.95, "duration": 6.44}, {"text": "You nailed the mustache for like the shirt chat. Is it a yes or no? Come on, let's go. All right", "start": 143.39, "duration": 5.129}, {"text": "No, I'm sorry, man. I'm sorry. WHO the fuck MADE THIS the polls are sayin YES, though. What? Okay. All right", "start": 148.799, "duration": 7.4}, {"text": "It's art its art", "start": 156.2, "duration": 2.0}, {"text": "You made it look like one of the mafioso f*cking victims! That's gonna be a no for me", "start": 158.7, "duration": 4.52}, {"text": "What the hell? Is that? Dude? WHY ARE YOU GIVING THEM A YES????", "start": 163.22, "duration": 2.789}, {"text": "Wow, you guys are probably the worst judges on planet Earth that looks like a cowboy what kind of mafiosa wears cowboy hat, dude?", "start": 166.01, "duration": 6.779}, {"text": "Tough crowd man", "start": 174.299, "duration": 2.0}, {"text": "Oh Jack yes or no. Mm. Oh, that's a no prevalent. No good by", "start": 177.239, "duration": 4.85}, {"text": "The Godfather Drake's Revenge", "start": 184.11, "duration": 2.0}, {"text": "LOOK AT-  look at the ratio 95 percent. Yes", "start": 188.67, "duration": 3.5}, {"text": "Wait, why are the hands so skinny?? chat says? Yes, you're getting unique votes, oh sh*t. Oh he's pissed off", "start": 193.739, "duration": 6.38}, {"text": "That's good. This looks like a rapper. That's not a mobster. Dude. That's a rapper. Dad says no chat says no, okay", "start": 200.19, "duration": 7.369}, {"text": "I'm sorry Oh THIS IS  CLASSY", "start": 207.56, "duration": 2.0}, {"text": "This is it, this is the last one does Hallie make it or not, mix mixed opinion, it's controversial I like it", "start": 213.16, "duration": 6.68}, {"text": "Damn, these are really mixed. Come on chat, vote!", "start": 219.88, "duration": 2.4}, {"text": "50/50", "start": 223.07, "duration": 1.29}, {"text": "Hello, I'm Morgan Freeman", "start": 224.36, "duration": 2.0}, {"text": "Will Hallie make it to the next round or will see suffer in the true depths of hell find out?", "start": 226.67, "duration": 7.699}, {"text": "After this brief message from fuckin loser", "start": 234.59, "duration": 2.66}, {"text": "Thanks Raid shadow legend for sponsoring", "start": 238.1, "duration": 2.0}, {"text": "This video does things to them that I am able to produce content like this and give back to you guys for supporting the channel", "start": 240.1, "duration": 5.069}, {"text": "now what actually is", "start": 245.18, "duration": 2.0}, {"text": "Legends rate of shadow legends is one of the most ambitious", "start": 247.43, "duration": 2.48}, {"text": "RPG projects of 2019 and you can play for totally free on your smartphone. I like that. It's free me personally", "start": 250.489, "duration": 6.619}, {"text": "I've been getting quite immersed into it because unlike many other mobile games out", "start": 257.109, "duration": 3.33}, {"text": "There raid really keeps you mesmerized think see the amount of content that is actually packed into this game", "start": 260.44, "duration": 5.01}, {"text": "There's a campaign mode all sorts of different detailed characters items quests and a lot more to discover if you go to the description down", "start": 265.45, "duration": 6.839}, {"text": "below you can download the game from my unique link and give", "start": 272.29, "duration": 2.459}, {"text": "50,000 silver immediately and you'll be enrolled into their special launch tournament where there's numerous in-game prizes and physical ones, too", "start": 275.27, "duration": 7.07}, {"text": "so download rate Shadow legends today and you'll be able to play with me and thousands across a world and", "start": 282.34, "duration": 5.76}, {"text": "Now we return to photoshop", "start": 288.89, "duration": 2.69}, {"text": "battle royale", "start": 292.4, "duration": 1.66}, {"text": "*quackity dies* FIFTY FIFTY", "start": 294.06, "duration": 1.5}, {"text": "Results are in results are in it's a yes", "start": 300.46, "duration": 2.92}, {"text": "Out of 100 players only nine made it out alive", "start": 310.59, "duration": 2.67}, {"text": "auntie cry pedi dummy thick Thanos", "start": 313.72, "duration": 2.299}, {"text": "But Rico's hope some dill pickle Oliver DDP pop bored and Halle is something to begin round to a tournament", "start": 316.02, "duration": 6.21}, {"text": "It has been settled players are going to go 1v1 and make the best", "start": 322.23, "duration": 3.299}, {"text": "Photoshop image chat was given three to choose from gang of grandmas romantic Thanos and ugly, baby", "start": 325.6, "duration": 5.839}, {"text": "chat shows romantic Thanos", "start": 332.08, "duration": 2.0}, {"text": "born", "start": 334.78, "duration": 1.47}, {"text": "in the", "start": 336.25, "duration": 1.98}, {"text": "Quackety, it's 1:00 a.m. I cannot talk. Okay", "start": 338.23, "duration": 4.009}, {"text": "Okay, in four minutes we're gonna make this the most romantic thing ever we're gonna give him a happy face", "start": 349.93, "duration": 4.58}, {"text": "It doesn't look like feet maybe he's proposing with his feet and what's a big fucking deal dude ah", "start": 363.639, "duration": 5.33}, {"text": "The timer went up right? Let's take a look submission contestants", "start": 369.7, "duration": 3.529}, {"text": "Why is he marrying me", "start": 377.02, "duration": 2.0}, {"text": "Why cuz why not the kiss camp is such a great touch. I may be in love and the pose results are in", "start": 379.33, "duration": 6.92}, {"text": "We're both European so we can really talk too loud", "start": 394.12, "duration": 3.709}, {"text": "The trick is versus Shawn yay, Wes", "start": 402.93, "duration": 2.419}, {"text": "We've got a gorilla doing the floss a roblox character and then you got obese me. Okay, obese", "start": 405.38, "duration": 6.75}, {"text": "Kanye west I'm sure okay. I", "start": 414.87, "duration": 3.29}, {"text": "Have to take a pen. Oh my god", "start": 418.8, "duration": 2.119}, {"text": "I don't care if you have to take a pic check into a conclusion", "start": 420.949, "duration": 3.69}, {"text": "You guys were gonna make obese quackety into an area. Are you guys ready? Yeah. I'm going to make myself look a lot skinnier", "start": 424.639, "duration": 7.11}, {"text": "I need to out of the hair eager. Laughs hairy thick lips Oh God", "start": 438.539, "duration": 4.49}, {"text": "Where's mr. Shawn you okay didn't be like that I", "start": 450.99, "duration": 3.079}, {"text": "Was in a hurry dude, the lipstick was a finishing touch, all right", "start": 462.479, "duration": 4.04}, {"text": "Shawn yay Wes just kind of died. It's you versus me pal. You know what I would pay for snapchat premium", "start": 467.07, "duration": 6.109}, {"text": "We got former President Obama with the Queen but we got this baby with a weapon then we got mr", "start": 480.129, "duration": 6.739}, {"text": "Locke offered which one chat. Let's go with baby Cali and Auntie cry", "start": 486.869, "duration": 5.279}, {"text": "To make this baby into a war baby. Alright make this baby into James Charles and make him in the war", "start": 497.86, "duration": 6.199}, {"text": "Alright you have five minutes to do so make him pale. Ha ha ha. Oh", "start": 504.089, "duration": 5.01}, {"text": "Damn, it. Looks like I'm spray paint again uses highlight. What the hell is highlight? I don't know these in makeup turns", "start": 509.919, "duration": 5.539}, {"text": "Damn, you're lookin good James. Oh, he could be holding a pinkie drink a tea instead of a gun chat", "start": 515.589, "duration": 6.32}, {"text": "I'm working on it, please. Yes", "start": 521.909, "duration": 2.219}, {"text": "I'm sup you have to submit your pinky drink. What the hell is?", "start": 529.449, "duration": 5.63}, {"text": "Yours", "start": 540.67, "duration": 2.0}, {"text": "Do you want me to show this one stream it's so bad I", "start": 549.879, "duration": 2.72}, {"text": "Even me in the first place was that bad", "start": 553.509, "duration": 2.33}, {"text": "This is a submitted twitches lagging. So I can't tell who's winning. Auntie. Cry you're losing auntie", "start": 556.959, "duration": 6.71}, {"text": "Dummy fake Thanos and Oliver DDT now we got boogie2988", "start": 572.04, "duration": 4.699}, {"text": "being very happy", "start": 577.26, "duration": 1.43}, {"text": "we got a very happy bald guy with some cool-ass glasses and think about it boogie and the guy looked the", "start": 578.69, "duration": 5.52}, {"text": "Exact same we got an old couple. Let's finish this poll up chat", "start": 584.49, "duration": 4.43}, {"text": "What do you want them to do to boogie make him into Thanos make him a furry make him into a furry fan", "start": 588.92, "duration": 5.849}, {"text": "Oh, sorry. Oh I", "start": 594.77, "duration": 1.51}, {"text": "heard curry like the rice", "start": 596.28, "duration": 2.149}, {"text": "Let's go", "start": 599.73, "duration": 2.0}, {"text": "I'm gonna add wings", "start": 601.77, "duration": 2.0}, {"text": "Doesn't have", "start": 607.89, "duration": 2.0}, {"text": "His soul just like a goddamn body", "start": 626.07, "duration": 2.6}, {"text": "It's furry thatthose polls are 70% is to Oliver and 30% is to dummy big", "start": 628.68, "duration": 6.619}, {"text": "No", "start": 635.82, "duration": 1.74}, {"text": "Thank you", "start": 637.56, "duration": 2.0}, {"text": "Free-for-all round everyone vs. Everyone best to compete. How are you guys doing today?", "start": 644.19, "duration": 7.309}, {"text": "Holding the moon just need to use your imagination and get it to the best version", "start": 659.94, "duration": 4.22}, {"text": "You can we're gonna take a sad picture of Obama", "start": 664.16, "duration": 2.64}, {"text": "That's as big as I can make him dude now he needs to be holding other something other than the moon", "start": 668.67, "duration": 4.489}, {"text": "So we're gonna replace it with Brendan Fraser crying. Alright, yeah", "start": 673.16, "duration": 3.239}, {"text": "a big joint", "start": 680.37, "duration": 2.0}, {"text": "Submission contestants. Are you guys ready? Everyone ready? Oh", "start": 687.24, "duration": 5.64}, {"text": "My god", "start": 700.57, "duration": 2.0}, {"text": "I", "start": 710.8, "duration": 2.0}, {"text": "Am going to set the pole for this cuz it this is just incredible. This is incredible", "start": 712.99, "duration": 5.03}, {"text": "This is a lot more than I expected. How do you guys feel I'm having a heart attack?", "start": 718.02, "duration": 3.45}, {"text": "I'm thinking", "start": 723.16, "duration": 2.0}, {"text": "This is what the polls are looking like and we got patrika s-- at the very top and the next person we got is dill", "start": 725.89, "duration": 5.69}, {"text": "Pickle, how are you guys feeling? How are you guys feeling?", "start": 731.71, "duration": 2.0}, {"text": "Housing what would you guys do with a thousand bucks?", "start": 739.93, "duration": 2.03}, {"text": "I'm", "start": 743.32, "duration": 2.0}, {"text": "So surprised this is like the first cost contest I've ever entered in my entire life and I'm already second like this is crazy", "start": 745.45, "duration": 5.989}, {"text": "True creativity wood. These are all the images. There's got to be an image in here", "start": 753.91, "duration": 4.099}, {"text": "You guys can give me your full creativity. Can we do like crossover?", "start": 758.02, "duration": 3.769}, {"text": "You guys can take all of these images or whatever you want you can cross them over", "start": 764.5, "duration": 5.15}, {"text": "Just read one fucking amazing product. Good luck guys. I know you can do it. Good luck", "start": 770.02, "duration": 6.289}, {"text": "I will compile everything. Alright, why did you guys make me do this? Yo, I have an idea holding the flossing monkey", "start": 778.51, "duration": 7.739}, {"text": "There you go. Fellas. How's it going? Everything good. You have ten minutes left. Yeah. Yeah", "start": 786.25, "duration": 5.04}, {"text": "Dude we're gonna be in a quackety video. That's insane. No, you know, I should sing you guys a song", "start": 797.03, "duration": 5.209}, {"text": "I'd like to hear music while I work. Yeah, music is good", "start": 805.13, "duration": 3.859}, {"text": "March time", "start": 819.14, "duration": 2.0}, {"text": "My heart is racing let's look at this. Oh", "start": 827.96, "duration": 2.84}, {"text": "This is from Patrick on the moves", "start": 832.28, "duration": 3.919}, {"text": "You put flossing monkeys you even put fucking boogie picking his nose with the Infinity Gauntlet", "start": 836.2, "duration": 5.34}, {"text": "Man on the buzz hair O'Brien rock hopper on the roof my feminine self on top of the car. Holy Sh, and then we got", "start": 841.85, "duration": 7.789}, {"text": "Glossy because Mick Crompton is arrested guys. It's voting time. Let's go. Let's see this", "start": 855.53, "duration": 7.609}, {"text": "A dream. I'm legit like insane. I'm surprised I actually got in", "start": 875.99, "duration": 6.859}, {"text": "A little speech to everyone who thinks they can't do anything", "start": 890.36, "duration": 3.589}, {"text": "You could definitely do something because I I didn't even use Photoshop. I just use some random art program for free", "start": 893.95, "duration": 6.45}, {"text": "You just clowned on every other it is time for you guys to sing a song with me", "start": 902.12, "duration": 6.649}, {"text": "Everyone's a winner", "start": 910.79, "duration": 2.0}, {"text": "No one's a loser", "start": 913.16, "duration": 2.0}, {"text": "Photoshop is a big pocket easing game", "start": 916.59, "duration": 3.619}, {"text": "Thank you guys so much for watching this is the end of the competition", "start": 923.01, "duration": 2.809}, {"text": "And again, thank you so much to today's sponsor without sponsors. I am not able to give huge cash prizes like this", "start": 925.86, "duration": 6.08}, {"text": "So thank you so much to them", "start": 931.94, "duration": 1.14}, {"text": "Make sure to follow my twitch account since that's where the whole event was livestream and make sure to join the discord center", "start": 933.08, "duration": 4.559}, {"text": "Which is where it all went down. Thank you guys so much for watching. I'll see you next time", "start": 937.64, "duration": 3.419}]