[{"text": "Hey it's me Destin, welcome back to Smarter Every Day", "start": 0.0, "duration": 2.82}, {"text": "When I make a video, I normally ask a question and have a pretty good idea -", "start": 2.82, "duration": 4.0}, {"text": "- of where that question is going to take me.", "start": 6.82, "duration": 1.8}, {"text": "This one is way different.", "start": 8.62, "duration": 1.52}, {"text": "We're going to start in a weight room and we are going to end up deep in the bowels", "start": 10.14, "duration": 3.28}, {"text": "of Johnson Space Center, where we meet a lady who literally burns astronaut pee.", "start": 13.42, "duration": 5.44}, {"text": "We all know in space if an astronaut sits around he is going to lose muscle mass", "start": 18.86, "duration": 3.7}, {"text": "But Earth is different\nWhen I lift this weight, it's actually weight", "start": 22.76, "duration": 4.54}, {"text": "So here is my question, how do astronauts lift weights in space?", "start": 27.3, "duration": 5.82}, {"text": "To learn the answer to this, lets go talk to astronauts Don Pettit and Mike Hopkins", "start": 33.62, "duration": 5.2}, {"text": "It doesn't look like you've been lifting quite as much as this man over here", "start": 39.1, "duration": 4.48}, {"text": "I'm Destin\nHi Destin, I'm Mike\nMike, nice to meet you", "start": 43.78, "duration": 3.2}, {"text": "And Mike, you're an expert at working out in space right?", "start": 46.98, "duration": 2.88}, {"text": "Well I've spent some time working out here on Earth, and, ah, I just took that to space with me", "start": 49.86, "duration": 3.9}, {"text": "You take people like Mike and I\n(Destin) Studs, lets be clear, studs right?", "start": 53.96, "duration": 4.36}, {"text": "People like Mike and I\n(Destin laughs)", "start": 58.32, "duration": 2.56}, {"text": "And, you know, we're in the middle of life, we're healthy, and we go to station", "start": 62.8, "duration": 3.92}, {"text": "And we get disease like symptoms instilled in our bodies, from any number of venues, physiological venues", "start": 66.86, "duration": 8.66}, {"text": "And it's a great way to study the effect of these things and what's causing them and how to prevent them", "start": 75.78, "duration": 7.68}, {"text": "Some of these diseases we're talking about take years to manifest here on Earth, but up in space we'll see them in months -", "start": 83.46, "duration": 6.86}, {"text": "(Destin) Right\n- or weeks, so that's another advantage to doing it up in orbit", "start": 90.32, "duration": 4.18}, {"text": "(Destin) Oh that makes sense\nAnd we're working right now this machine which I like to call 'The Beast'", "start": 94.5, "duration": 5.52}, {"text": "- everybody calls it the ARED\n(Destin) Which stands for what?", "start": 100.02, "duration": 3.78}, {"text": "- ah you know...", "start": 103.88, "duration": 0.96}, {"text": "(Dr Bob) Advanced Resistive Exercise Device\n(Destin) Advanced resistive\n(Don) This is Dr Bob\n(Mike) He is the expert", "start": 104.84, "duration": 5.12}, {"text": "(Destin) Dr Bob...you got to keep these astronauts straight", "start": 109.96, "duration": 2.68}, {"text": "It takes some special engineering thinking to make a machine that allows you to weight lift in a weightless environment", "start": 113.08, "duration": 7.0}, {"text": "Before Dr Bob explains how ARED works I wanted to see if I could figure this out", "start": 120.48, "duration": 3.44}, {"text": "My first thought was to use a spring, but the more you compress a spring the more force is required", "start": 123.92, "duration": 4.7}, {"text": "Weight is a constant force, so that doesn't work", "start": 128.78, "duration": 2.68}, {"text": "I thought about the same thing with elastic bands, but the more you stretch them, the more force is required, so that doesn't work either", "start": 131.46, "duration": 5.4}, {"text": "My final thought was to use an air cylinder", "start": 137.1, "duration": 2.54}, {"text": "If you plug one end of the air cylinder and you compressed it that would work up to a point, but as the volume decreases, pressure increases requiring more force", "start": 139.84, "duration": 8.96}, {"text": "So how did they do it?", "start": 148.8, "duration": 1.2}, {"text": "The heart of the system are these two canisters right here\n(Destin) Okay", "start": 150.4, "duration": 3.52}, {"text": "These two canisters contain a vacuum\nNow if we could look inside the canister you would see a piston that would slide", "start": 153.92, "duration": 5.88}, {"text": "(Destin) OH! Wait a second! Because a vacuum never changes", "start": 159.8, "duration": 3.32}, {"text": "Yeah the vacuum is always the same, its always a vacuum", "start": 163.12, "duration": 1.68}, {"text": "(Destin) So instead of pressurizing air and pushing against something you're just going to pull it", "start": 164.8, "duration": 3.22}, {"text": "The volume of your vacuum is right here between the piston and the top of the chamber\n(Destin) Okay", "start": 168.1, "duration": 4.36}, {"text": "Now you pan down, attached to the piston is a rod that comes on down here and attaches here and here", "start": 172.9, "duration": 7.74}, {"text": "(Destin) Okay\nSo the vacuum always wants to pull those rods up", "start": 180.94, "duration": 4.08}, {"text": "(Destin) Like a syringe\nLike a syringe, exactly like a syringe", "start": 185.26, "duration": 2.12}, {"text": "(Destin) Okay this is really clever, think about it\nYou got a cylinder, a piston and the atmospheric pressure all around", "start": 187.38, "duration": 6.36}, {"text": "If you push the piston in all the way and you close the valve at the end, and you pull, you're going to create a vacuum", "start": 193.74, "duration": 6.1}, {"text": "- because the normal air pressure on the inside of the station is pushing on the backside of the piston it creates a force", "start": 199.84, "duration": 5.56}, {"text": "More importantly, a constant force\nThis is super simple and super clever", "start": 205.4, "duration": 4.88}, {"text": "So as the vacuum pulls the pistons up, it forces this arm down\nSo pistons go up, arm goes down and that is constant", "start": 210.66, "duration": 10.18}, {"text": "And so right now the vacuum is holding this arm to this upper stop\nWhen Mike stands up it will release", "start": 221.28, "duration": 7.88}, {"text": "And now he is holding that 50 pounds in this example on his shoulders", "start": 229.36, "duration": 4.48}, {"text": "(Destin) Okay, it's way more complicated than I thought it was\nOkay one more time please Mike?", "start": 235.84, "duration": 4.14}, {"text": "(Mike) Okay, here we go\n(Destin) Going down\n(Mike) Going down", "start": 239.98, "duration": 3.0}, {"text": "(Dr Bob) Vacuum is pressing him down, and now he is standing up against the force of the vacuum", "start": 242.98, "duration": 3.98}, {"text": "(Don) Destin, this is just simple levers\n(Destin) This is Archimedes", "start": 246.96, "duration": 3.6}, {"text": "(Don) First class, second class", "start": 250.72, "duration": 1.44}, {"text": "Don's right, it's just a lever\nIf the vacuum is pulling up on one side of the bar, it's going to be pushing down with a constant force on the other", "start": 252.64, "duration": 6.66}, {"text": "Another cool thing is if you vary the position of the fulcrum, you can vary the weight", "start": 259.3, "duration": 4.2}, {"text": "In fact, they've got an easy way to adjust that, so a guy like me can work out with guys like Mike and Don", "start": 263.5, "duration": 5.68}, {"text": "(Destin) Okay...wow feels like weight", "start": 269.38, "duration": 4.94}, {"text": "- it feels exactly like weight", "start": 274.44, "duration": 1.84}, {"text": "(Don) That's how it was designed", "start": 276.4, "duration": 2.38}, {"text": "(Destin) Okay, so here's a question, so is this all about muscle?", "start": 279.26, "duration": 3.58}, {"text": "It's all about muscle -\n(Destin) Okay\n- its about bones", "start": 282.98, "duration": 2.66}, {"text": "(Destin) What do you mean?\nAh bone density, loading your skeletal system", "start": 285.78, "duration": 4.4}, {"text": "(Destin) I though when you work out, you're working out because of your muscles\n(Dr Bob) You are...ah, you're also putting loads on your skeletal system -", "start": 290.22, "duration": 6.24}, {"text": "- most notably the hip area, the spine area...everything kind of below the waist you don't use in space", "start": 296.5, "duration": 6.12}, {"text": "(Destin) So what does loading the bone do for you, you said bone density?", "start": 302.82, "duration": 3.38}, {"text": "(Dr Bob) Yes, ah, loading the bone stimulates bone growth -\n(Destin) Okay", "start": 306.4, "duration": 4.46}, {"text": "- so we want to minimize any losses by stimulating the bones as much as we can\n(Destin) Okay, is that a big deal in space?", "start": 310.86, "duration": 5.86}, {"text": "It's a huge deal\n(Destin) What do you mean it's a huge deal?", "start": 316.72, "duration": 2.3}, {"text": "Well, without that, you can stand to loose -", "start": 319.02, "duration": 3.88}, {"text": "- two to two and a half percent of your bone density per month", "start": 323.6, "duration": 3.54}, {"text": "Did you hear what he said?\n2 to 2.5% per MONTH!\nThat's crazy if you extrapolate that out -", "start": 327.68, "duration": 4.86}, {"text": "- your bones are going to be gone", "start": 332.54, "duration": 1.66}, {"text": "(Destin) So after 30 months you have half your bone density?", "start": 334.2, "duration": 3.62}, {"text": "Possibly, but no ones ever\nI mean we don't send people to the space station and NOT have them exercise", "start": 337.82, "duration": 6.34}, {"text": "Okay if it takes three years to get to Mars and back, a certain percentage of your bone mineral density lost every month is a huge deal!", "start": 344.42, "duration": 6.46}, {"text": "So I started poring through the data and I learned that the bulk of that bone mineral density loss is lost in the lower back, in the hip and in the femur -", "start": 351.12, "duration": 7.38}, {"text": "- and if you think about it, that makes sense, because where do the elderly most often break a bone?", "start": 358.5, "duration": 3.94}, {"text": "So to understand this even better I went to the Nutritional Biochemistry Lab there at Johnson Space Centre -", "start": 362.8, "duration": 4.96}, {"text": "- and I learned, that the majority of those minerals are being pee-d out of the astronauts bodies", "start": 367.76, "duration": 5.04}, {"text": "I'm with Doctor Scott Smith and you are part of the Nutritional Biochemistry team here at NASA Johnson Space Centre...that's a really nice logo, I like that", "start": 373.26, "duration": 9.6}, {"text": "So I noticed that you have pee on the counter here", "start": 382.96, "duration": 3.2}, {"text": "- Why is this so important?", "start": 386.18, "duration": 1.76}, {"text": "We'll we're a nutritional biochemistry lab so we look at biochemistry, um, a lot of the work that we do is focused on bone -", "start": 388.04, "duration": 7.22}, {"text": "- because there is a lot of things in your body, um, there's a lot of things in your diet that relate to your bones -", "start": 395.26, "duration": 5.94}, {"text": "- so things like calcium and other factors all effect your bones, so we're very interested in looking at those things -", "start": 401.32, "duration": 6.46}, {"text": "- and the easiest way to do that is by looking at blood samples and urine samples", "start": 407.98, "duration": 3.48}, {"text": "Your body is pretty smart, and it maintains the skeleton that you need to do what you're doing -", "start": 411.62, "duration": 6.1}, {"text": "- what that means is that you're forming as much bone as you're breaking down", "start": 417.72, "duration": 4.0}, {"text": "(Destin) It's like this cycle and you're making bone and you're loosing it at the same time\n(Scott) Right, and as long as you're doing those two things at the same rate, then all is good", "start": 421.88, "duration": 8.04}, {"text": "(Destin) Okay\n(Scott) When you start doing more of one than the other is when you get out of balance", "start": 429.92, "duration": 5.18}, {"text": "This is one -80F freezer and we got another dozen or so upstairs, we've got another dozen or so two hours away in a bunker that we protect them -", "start": 435.66, "duration": 8.02}, {"text": "- so that if a hurricane hits here and the power goes off, we don't loose those samples", "start": 443.68, "duration": 4.54}, {"text": "Are you serious? So you gotta protect the astronaut pee?\nYes, like you wouldn't believe", "start": 448.22, "duration": 4.5}, {"text": "It is considered a National Treasure", "start": 453.34, "duration": 2.14}, {"text": "That's my goal in life, is for my pee to be considered a National Treasure\nIt's not quite what the moon rocks are...", "start": 455.7, "duration": 6.78}, {"text": "You're being serious, because I mean if you think about it like, you can't reproduce it, because the amount of money and tax-payer dollars that went into creating -", "start": 462.48, "duration": 6.82}, {"text": "- that specific controlled astronaut pee, is irreplaceable\nThat's correct", "start": 469.3, "duration": 5.12}, {"text": "If you want, Anna's here...Anna's running urine calcium's right now", "start": 474.84, "duration": 4.92}, {"text": "(Destin) Really", "start": 479.88, "duration": 0.8}, {"text": "(Destin) So Ann, you're taking the urine and you're putting it into the machine?", "start": 481.92, "duration": 4.34}, {"text": "Yes, I'm diluting it, 1:100", "start": 486.42, "duration": 2.06}, {"text": "(Destin) How does it feel to know that a National Treasure is in your hands? That National Treasure being astronaut urine...", "start": 488.48, "duration": 5.94}, {"text": "It's really something special", "start": 495.14, "duration": 2.08}, {"text": "(Destin laughing) What a great way to answer that question!", "start": 497.64, "duration": 4.04}, {"text": "This instrument is looking at urinary calcium", "start": 501.98, "duration": 2.44}, {"text": "(Destin) So you're saying that this is where the bone mass goes? They pee out their bones\n(Scott) That is correct, they pee out their bones", "start": 504.62, "duration": 6.22}, {"text": "(Destin) WOAH", "start": 511.24, "duration": 0.96}, {"text": "(Destin) There's a fire going on in here! You didn't tell me that!", "start": 514.48, "duration": 3.52}, {"text": "No, I didn't tell you\n(Destin) What's up with the fire?", "start": 518.0, "duration": 2.54}, {"text": "(Scott) The machine injects a sample into that flame\n(Destin) Okay", "start": 520.54, "duration": 3.06}, {"text": "And then as it burns, what happens is the machine measures the absorption of light and based on standards and curves, um -", "start": 523.76, "duration": 9.56}, {"text": "- you're looking at...its absorbs different wavelengths from that heat and tells you where the calcium is", "start": 533.34, "duration": 6.64}, {"text": "There's a lot of big words happening right here, but I want us to stop and think about what's actually happening", "start": 539.98, "duration": 4.54}, {"text": "We're taking astronaut pee, and we're burning it, and we're looking at the colour of burnt astronaut pee -", "start": 544.52, "duration": 6.96}, {"text": "- is that correct?\nThat's correct", "start": 551.48, "duration": 2.24}, {"text": "In crew members with the ARED, when they came back, when we looked at their X-Rays -", "start": 554.36, "duration": 4.46}, {"text": "- their bone mineral density was the same as it was before flight", "start": 558.82, "duration": 3.26}, {"text": "(Destin) And that's never happened before?\n(Scott) And that's never happened before, with good diet and hard exercise", "start": 562.08, "duration": 5.0}, {"text": "(Scott) This is the percent change, per month, in whole body bone mineral density\n(Destin) Okay", "start": 567.36, "duration": 6.4}, {"text": "(Scott) In crew members in the MIR, where they didn't have any resistive exercise -", "start": 573.86, "duration": 3.86}, {"text": "In crew members early on station where they had the iRED, and crew members with the ARED", "start": 577.72, "duration": 5.76}, {"text": "(Destin) BOOM, can't go to Mars, can't go to Mars, you can go to Mars", "start": 583.58, "duration": 4.58}, {"text": "(Scott) Theoretically yes\n(Destin) Because of ARED", "start": 588.46, "duration": 2.08}, {"text": "(Scott) And again, there is still questions about strength and the core", "start": 590.54, "duration": 1.74}, {"text": "(Destin) I get it, but let's go to Mars\nSeriously! That's, like, that data is very very clear", "start": 592.28, "duration": 5.7}, {"text": "(Scott) That's what we thought", "start": 597.98, "duration": 1.2}, {"text": "(Destin) Another thing that is really cool about this research is that all these papers that are being cranked out by the biochemistry lab at NASA -", "start": 599.18, "duration": 5.16}, {"text": "- are not just applicable to space\nIn the future these lessons about diet and skeletal loading will also help people like my granny -", "start": 604.34, "duration": 6.6}, {"text": "- who is currently recovering from a broken hip, and to me, that's a huge deal", "start": 610.94, "duration": 4.34}, {"text": "Okay, I hope you enjoyed this episode of Smarter Every Day", "start": 615.5, "duration": 2.68}, {"text": "Smarter Every Day is sponsored by Audible.com, and this is the book I want you to get", "start": 618.18, "duration": 3.98}, {"text": "It's called Packing for Mars by Mary Roach, and I listened to this thing on the way out to Houston", "start": 622.16, "duration": 4.96}, {"text": "It's a really really good book, I enjoyed it a lot, it's about the weird things that the human body does when you put it in space", "start": 627.12, "duration": 6.16}, {"text": "What happens to all the stuff that your skin excretes, how does your body detect blood pressure, how is that effected by the gravity vector, all kinds of weird stuff", "start": 633.46, "duration": 7.24}, {"text": "Human bodies do, you know, crude things, so you're not going to want to listen to this around the kids", "start": 640.7, "duration": 4.12}, {"text": "I cannot recommend this enough: Packing for Mars by Mary Roach", "start": 645.2, "duration": 3.62}, {"text": "You can get that for free from Audible.com/smarter\nI think you'll like it", "start": 648.82, "duration": 4.44}, {"text": "Also, feel free to check out the rest of the space series, if you feel like this episode earned your subscription, feel free to do that -", "start": 653.26, "duration": 5.6}, {"text": "- or even support on Patreon, but only if it earned it", "start": 658.86, "duration": 2.82}, {"text": "Anyway, thank you so much for watching", "start": 661.68, "duration": 2.04}, {"text": "I'm Destin, you're getting Smarter Every Day\nHave a good one", "start": 663.72, "duration": 2.92}, {"text": "(Destin) Wow, feels like weight, it feels exactly like weight", "start": 671.64, "duration": 4.82}, {"text": "(Don) That's how it was designed", "start": 676.8, "duration": 2.16}, {"text": "(Destin) So I can feel the inertia from those flywheels", "start": 678.96, "duration": 3.0}, {"text": "(Don) Those little details are really important when you get in a weightless environment", "start": 683.1, "duration": 4.96}, {"text": "(Destin) Holy cow, it feels like I've got weight on my shoulders", "start": 688.32, "duration": 4.24}, {"text": "(Don) And it just shows that what engineers can do when they're given, ah, a challenging project and you give them free reign to come up with a design", "start": 692.6, "duration": 11.58}, {"text": "(Destin) Like I don't like lifting weights and I'm already sad\nThat's amazing", "start": 704.36, "duration": 5.72}]