[{"text": "Sponsored by Squarespace. From websites and online stores to marketing tools and analytics, Squarespace is the all-in-one platform to build a beautiful", "start": 0.52, "duration": 7.399}, {"text": "Online presence. Okay. I think this is going pretty well so far. Sara: \"I know they seem so nice!\"", "start": 8.139, "duration": 7.07}, {"text": "I Think this really has the potential to be a real friendship. Sara: \"I know this is going so much better than I thought\"", "start": 20.47, "duration": 4.969}, {"text": "Except the whole gluten-free thing and you made banana bread! Sara: \"I said I was sorry!\"", "start": 26.019, "duration": 2.99}, {"text": "Josh: \"Is everything okay over there?\"", "start": 30.07, "duration": 2.0}, {"text": "Yes, we're fine! Sara: \"Really fine!\" Josh: \"Yeah\"", "start": 33.25, "duration": 3.619}, {"text": "Okay, its decision time which game do we want to play Settlers of Catan or exploding kittens?", "start": 38.23, "duration": 4.669}, {"text": "Sara: \"Well one is really fun and one is really strategic.\" What kind of people do you think that they are? Sara: \"Do they even like games?\"", "start": 42.899, "duration": 5.91}, {"text": "Let's just flip a coin", "start": 49.329, "duration": 1.46}, {"text": "You know people wonder when you truly know for certain that you're an adult and and I think it's the first time you feel like", "start": 50.789, "duration": 7.53}, {"text": "It's literally impossible to make new friends", "start": 58.32, "duration": 2.7}, {"text": "Look, I know that some people have a harder time making friends growing up than others, but it's like when you're younger you're just", "start": 61.02, "duration": 7.2}, {"text": "You're with people your age. They're everywhere. They're at school, They're in the neighborhood, They're at church.", "start": 68.95, "duration": 5.69}, {"text": "You don't have to make much of an effort. But then one day", "start": 74.83, "duration": 2.659}, {"text": "They're not anymore. Suddenly, You have to put forth an effort, you want to see people. What I'm saying is: introverts,", "start": 78.009, "duration": 6.8}, {"text": "Don't worry, it gets better when you get older. See when you become an adult", "start": 84.81, "duration": 4.169}, {"text": "You don't just call up another adult like they do on the show Friends and say, \"Hey,", "start": 89.2, "duration": 4.61}, {"text": "Do you want to hang out?\" it becomes much more complicated. There's--there's just more to consider", "start": 94.119, "duration": 5.75}, {"text": "Like is this a good use of my time? I work today.", "start": 99.869, "duration": 3.75}, {"text": "Is this really how I want to spend my evening before I inevitably have to go spend another 8 hours of my life at work", "start": 103.659, "duration": 5.75}, {"text": "Tomorrow? So there's more pressure once you're actually hanging out", "start": 109.409, "duration": 3.239}, {"text": "It's an added weight to it, you know? And there's no promise that you'll see these people again, you could blow it!", "start": 114.13, "duration": 6.319}, {"text": "Josh: \"Hey, how much longer do you want to stay?\" Kelli: \"I don't know, like half an hour?", "start": 120.56, "duration": 3.7}, {"text": "I kinda wanted to watch some Netflix before I go to bed.\" Josh: \"Yeah, that sounds good\" Kelli: \"Ok.\"", "start": 124.26, "duration": 4.04}, {"text": "Kelli: \"What are they doing?\"", "start": 128.96, "duration": 1.48}, {"text": "Josh: \"Uh, well earlier, they were flipping a coin but now it looks like they're praying\"", "start": 130.76, "duration": 4.72}, {"text": "There are just so many excuses not to hang out with people", "start": 135.98, "duration": 3.08}, {"text": "I mean people will get married which means that you have to connect with not just one person but", "start": 139.06, "duration": 5.19}, {"text": "Double the people now. It's a big jump. And then people start having kids which means you'll never see them again", "start": 145.1, "duration": 6.34}, {"text": "unless you have kids too. So let's start having babies.", "start": 151.72, "duration": 3.9}, {"text": "And there just aren't that many places to meet people when you're an adult. So unless you make a concerted effort to put yourself out there", "start": 155.7, "duration": 7.78}, {"text": "Netflix will slowly cradle you to your grave one lonely night at a time, but", "start": 164.18, "duration": 5.15}, {"text": "making a concerted effort feels weird because again", "start": 169.55, "duration": 3.139}, {"text": "it's hard to just", "start": 172.69, "duration": 1.63}, {"text": "Call someone up and ask if they want to hang out as an adult. You feel like you need some excuse to justify it", "start": 174.32, "duration": 5.809}, {"text": "I can't explain why it's this way but it is. Josh: \"Hello?\" Oh, hey, man", "start": 180.13, "duration": 4.949}, {"text": "We would you know, we're wondering if maybe you guys wanted to hang out tonight. Josh: \"Oh, oh why is something going on?\"", "start": 185.6, "duration": 5.989}, {"text": "We don't have any friends. Josh: \"Oh", "start": 192.739, "duration": 2.93}, {"text": "that's sad, uh", "start": 196.64, "duration": 2.0}, {"text": "Sure. Sure. We'll come over sure.\" Oh, okay. Great", "start": 199.25, "duration": 2.869}, {"text": "Boy that hurt but that sure did work", "start": 202.88, "duration": 2.359}, {"text": "Obviously, there isn't an easy fix to this problem", "start": 206.15, "duration": 3.11}, {"text": "I know but I have three suggestions that might help make friendship easier once you hit the adulthood stage", "start": 209.32, "duration": 6.22}, {"text": "When you're young, you can just hang out with anyone. When you're older,", "start": 219.08, "duration": 3.26}, {"text": "It requires more effort to stay friends with anyone in less you need some common ground", "start": 222.34, "duration": 4.92}, {"text": "So find a group that does something you enjoy and get plugged into it", "start": 227.26, "duration": 4.139}, {"text": "Okay, get plugged. in the church, it's a church term.", "start": 231.4, "duration": 3.76}, {"text": "Friendship are not going to fall in your lap as an adult.", "start": 238.54, "duration": 2.44}, {"text": "That's the hard truth. Okay, you have to work for this now. Look guys friends come in three forms. You have friends", "start": 241.1, "duration": 6.08}, {"text": "These are the people you know. You have good friends", "start": 247.36, "duration": 3.589}, {"text": "These are the people who company you really enjoy and then you have best friends", "start": 251.74, "duration": 5.029}, {"text": "And these are people who you don't have to worry about what you're gonna do when you hang out you're not really scared to eat", "start": 256.959, "duration": 6.5}, {"text": "In front of them. These people become much more rare the older you get", "start": 263.46, "duration": 4.08}, {"text": "So if you find people that you can connect with, hang on to them. Work at it, make it a priority", "start": 267.54, "duration": 6.74}, {"text": "Okay, and number three this is the best advice of all, okay", "start": 274.34, "duration": 3.96}, {"text": "that's a joke, but it's also not because you'll actually make lots of great friends", "start": 281.12, "duration": 4.44}, {"text": "I know we have", "start": 285.57, "duration": 2.0}, {"text": "Josh off-camera: \"Wow\" Wow. It's true though", "start": 288.18, "duration": 2.0}, {"text": "You know guys, the only thing harder than making friends is making a website.", "start": 292.88, "duration": 4.12}, {"text": "It's confusing time-consuming and it's stressful, but that's why I love Squarespace because they make building a website", "start": 297.01, "duration": 7.459}, {"text": "Not only easy, but actually fun their templates are not just good", "start": 304.47, "duration": 4.26}, {"text": "They are a word winning and they have one for whatever you're trying to do", "start": 308.73, "duration": 3.6}, {"text": "There's 24/7 customer service", "start": 312.36, "duration": 1.71}, {"text": "If you ever need any help and you can now transfer your third-party", "start": 314.07, "duration": 3.269}, {"text": "domains to Squarespace", "start": 317.62, "duration": 1.35}, {"text": "Another nice thing about them is that it's an all-in-one platform, which means that they do it", "start": 318.97, "duration": 4.699}, {"text": "All. Domains, websites, online stores, marketing tools. They are your one-stop shop", "start": 323.669, "duration": 5.1}, {"text": "So are you ready to start a website? Make it with Squarespace.", "start": 329.08, "duration": 2.839}, {"text": "Do what we did and head over to Squarespace.com for a free trial and when you're ready to launch go to squarespace.com/cow", "start": 332.14, "duration": 6.14}, {"text": "to get 10% off your first purchase of a website or domain. That's squarespace.com/cow", "start": 338.4, "duration": 5.32}, {"text": "It's America's number one comedy,", "start": 345.2, "duration": 2.54}, {"text": "Adults", "start": 348.0, "duration": 1.14}, {"text": "Watch as these four lovable losers try and navigate a game night. It's the show critics are calling fun,", "start": 349.15, "duration": 7.79}, {"text": "Relevant, hip, edgy", "start": 358.03, "duration": 2.33}, {"text": "Groundbreaking, a good time, hip, a good time, four stars", "start": 361.9, "duration": 7.07}, {"text": "Don't miss out on the number one show it's called Adults", "start": 370.39, "duration": 3.529}]