[{"text": "Pc system manufacturers, like MSI and Gigabyte,", "start": 0.04, "duration": 3.44}, {"text": "have released some fantastic small form-factor gaming machines in the last couple of years,", "start": 3.48, "duration": 5.9}, {"text": "but they ALL have the same disadvantage:", "start": 9.38, "duration": 4.44}, {"text": "non-standard and in many cases non upgradable components.", "start": 13.82, "duration": 6.24}, {"text": "No. You have to leave it to the hardcore enthusiasts:", "start": 20.06, "duration": 5.0}, {"text": "pioneers like Lucas Diakon, to break free from what has become THE way to build a small form-factor gaming rig", "start": 25.06, "duration": 10.18}, {"text": "ITX motherboards with a single graphics card are out. mATX Motherboards with dual graphic cards are in.", "start": 35.6, "duration": 9.62}, {"text": "Oh, and did I mention that this thing is liquid cooled and under 15 liters?", "start": 45.22, "duration": 5.94}, {"text": "Making it only slightly bigger than the Corsair One? So strap on my friends, cuz this is going to be good.", "start": 51.24, "duration": 7.84}, {"text": "Synergy allows you to share your mouse and keyboard between multiple computers at once.", "start": 68.3, "duration": 6.58}, {"text": "Check it out now at the link in the video description.", "start": 74.88, "duration": 2.94}, {"text": "I feel like we should start with one small problem.", "start": 78.74, "duration": 2.6}, {"text": "Project Orthrus, named for the mythological greek two-headed dog is not for sale, yet.", "start": 81.86, "duration": 6.6}, {"text": "This one was actually built by our friends at Proto Case. They do great work.", "start": 88.48, "duration": 5.7}, {"text": "The rackmount gaming case they built for me is still going strong,", "start": 94.18, "duration": 3.44}, {"text": "so it's no surprise then that Lukas went to them with his incredible design and they got to work.", "start": 97.62, "duration": 7.66}, {"text": "Every component was laser-cut in-house,", "start": 106.0, "duration": 3.28}, {"text": "the front panel details and rear I/O, not to mention the badass front logo, were milled out.", "start": 109.28, "duration": 6.7}, {"text": "The radiator holder was routed out, the motherboard tray and SSD holder were bent.", "start": 115.98, "duration": 7.36}, {"text": "They pressed in all the rivets, standoffs and threaded nuts, routered the side panel", "start": 123.34, "duration": 5.96}, {"text": "and put the whole thing together with a beautiful coat of their Proto legacy black powder coating.", "start": 129.3, "duration": 6.78}, {"text": "A couple revisions of that and this is what landed on our doorstep.", "start": 136.66, "duration": 5.94}, {"text": "Still some assembly required though, am I right?", "start": 142.6, "duration": 2.58}, {"text": "We actually needed two care packages to assemble our case.", "start": 145.42, "duration": 4.26}, {"text": "The one from Proto Case, that was unidentifiable as a case, other than the main chassis frame.", "start": 149.68, "duration": 6.38}, {"text": "And one from Lukas himself, that included, among other things, a server power supply with custom", "start": 156.18, "duration": 8.04}, {"text": "rerouted 12-volt rails to support our dual graphics cards and custom shorter cables.", "start": 164.22, "duration": 7.52}, {"text": "This thing is already way too cool. We haven't even assembled it yet.", "start": 171.74, "duration": 3.3}, {"text": "Yours would of course come in a much more finished state though,", "start": 175.22, "duration": 3.82}, {"text": "so we're going to fast forward to system assembly.", "start": 179.04, "duration": 3.26}, {"text": "Front I/O was pretty straightforward. Dual USB 2 and dual USB 3 with HDMI pass-through for VR", "start": 182.78, "duration": 9.0}, {"text": "and a dope-ass capacitive power button are nice extras.", "start": 191.78, "duration": 5.1}, {"text": "Then it was time to move on to core components. We chose an Intel Core i7 6900K,", "start": 196.88, "duration": 7.12}, {"text": "for maximum PCIe bandwidth for the 2 PCI Express 16x slots on our ASUS X99 MWS motherboard.", "start": 204.0, "duration": 8.68}, {"text": "And I'm pretty sure the WS stands for west side, because this thing is awesome.", "start": 212.68, "duration": 4.64}, {"text": "We added a sprinkling of Corsair Vengeance RGB memory on the side for maximum FPS.", "start": 217.38, "duration": 6.78}, {"text": "And our 240 millimeter AIO goes in next.", "start": 224.16, "duration": 5.42}, {"text": "But due to width limitations, there is a mere 55 millimetres of height available for the CPU block.", "start": 229.58, "duration": 8.4}, {"text": "Which is why we ended up using an older generation Corsair H100I.", "start": 237.98, "duration": 5.46}, {"text": "Alright, we're getting close now. Let's pop the graphics cards in.", "start": 243.44, "duration": 3.82}, {"text": "The design comes with brackets to fit a pair of 2.5 inch drives on the motherboard side and a 3.5 inch drive,", "start": 247.26, "duration": 8.06}, {"text": "plus another two and a half inch to piggyback on top in the second graphics card tray, if you're not using it.", "start": 255.32, "duration": 6.96}, {"text": "But we are using it, for twin GTX 1080Ti Founders Editions, so there will be no junk in the backside for us.", "start": 262.62, "duration": 10.02}, {"text": "These shielded PCI Express Risers go in now.", "start": 273.04, "duration": 4.26}, {"text": "Note that one of them is actually more narrow than the other in order for the SLI bridges to fit.", "start": 277.3, "duration": 7.08}, {"text": "Then we install the cards themselves. It is a bit tricky as the bottom card needs to be installed first,", "start": 284.58, "duration": 7.94}, {"text": "then have its custom spliced and extended SLI bridges connected,", "start": 292.52, "duration": 6.38}, {"text": "wrapped behind the tray and then powered up.", "start": 298.9, "duration": 3.6}, {"text": "The extra length of the SLI cables actually enables them to be hidden behind the cards,", "start": 302.62, "duration": 5.32}, {"text": "so you can show them off in their full SLI glory. Now that the key components are together,", "start": 307.94, "duration": 6.9}, {"text": "it's time to spruce the machine up with mucho RGB and tidy your cabling.", "start": 314.84, "duration": 5.14}, {"text": "Yuck, looks like a fun task in such a tiny case. Let's ... summon the comrade! Oh! That looked pretty easy!", "start": 320.2, "duration": 10.92}, {"text": "Now let's check her out all tidied up and in her maximum RGB glory.", "start": 331.12, "duration": 5.76}, {"text": "Ladies and gents, project Orthrus, Revision3.", "start": 336.88, "duration": 5.12}, {"text": "So, from an idea, to a 3D model, to the lowest displacement chassis to be able to run GTX 1080Ti SLI.", "start": 342.6, "duration": 10.06}, {"text": "I don't think anything could have prepared me for something this breathtakingly nerd-delicious.", "start": 353.54, "duration": 6.14}, {"text": "And the performance is shocking!", "start": 359.68, "duration": 2.58}, {"text": "It's really not that far off having these components on an open test bench.", "start": 362.26, "duration": 6.54}, {"text": "And is basically identical to having them in a full-size chassis.", "start": 368.8, "duration": 5.5}, {"text": "Infact for the card that would normally be suffocating in the top PCIe slot, it's even better.", "start": 374.3, "duration": 7.14}, {"text": "There is still some more work to be done.", "start": 381.78, "duration": 2.76}, {"text": "Our aussie friends cannot hand-wire and paint every power supply for Orthrus buyers.", "start": 384.68, "duration": 7.48}, {"text": "And I think if we were to do another project with this case,", "start": 392.16, "duration": 4.9}, {"text": "we'd probably reverse the front fans to keep from recycling hot air", "start": 397.06, "duration": 4.58}, {"text": "and maybe make use of the included reservoir mount for a custom water loop,", "start": 401.64, "duration": 6.14}, {"text": "but... we'll save that for another time. For now, for all intents and purposes, mission accomplished.", "start": 407.78, "duration": 6.94}, {"text": "You could even say that... now that's not a gaming rig. THAT's a gaming rig!", "start": 414.72, "duration": 6.72}, {"text": "So a huge shout out to Lukas and Proto Case", "start": 422.0, "duration": 3.84}, {"text": "for allowing us to be the first to make a video on this amazing case,", "start": 425.84, "duration": 5.1}, {"text": "and also for sending us another one when we lost the first one.", "start": 430.98, "duration": 3.88}, {"text": "You can follow this project's future development at the link in the video description or on Twitter @LukeD_NC.", "start": 434.88, "duration": 7.76}, {"text": "Do you suffer from the incredibly first world problem of having far too many", "start": 444.0, "duration": 4.6}, {"text": "computers to keep track of which keyboard and mouse goes with which?", "start": 448.6, "duration": 4.42}, {"text": "Well actually I'm being facetious, because that can be a real problem if you have a", "start": 453.36, "duration": 4.76}, {"text": "development station and a gaming station or a PC and a Mac.", "start": 458.12, "duration": 3.6}, {"text": "Well, Synergy allows you to share one mouse and one keyboard between all of them.", "start": 461.72, "duration": 5.66}, {"text": "So you will no longer get confused and it all happens amazingly seamlessly.", "start": 467.38, "duration": 4.7}, {"text": "They offer a basic and a pro option with a one-time payment for lifetime access and features include,", "start": 472.08, "duration": 6.23}, {"text": "aside from just being able to move the mouse across screens like you wouldn't even believe,", "start": 478.52, "duration": 5.08}, {"text": "clipboard sharing, dragging and dropping files, the ability to set up hotkeys and more.", "start": 483.74, "duration": 6.06}, {"text": "Use our link in the video description to get 50% off of Synergy today.", "start": 489.8, "duration": 5.34}, {"text": "So thanks for watching guys if you dislike this video you can hit that button.", "start": 495.9, "duration": 3.1}, {"text": "But if you liked it, hit the like button, get subscribed, maybe consider checking out where to buy this.", "start": 499.0, "duration": 4.26}, {"text": "Well the internal components are available for purchase.", "start": 503.52, "duration": 2.84}, {"text": "Where to buy the stuff we've featured at the link in the video description.", "start": 506.36, "duration": 2.7}, {"text": "Also down there is our merch store, which has cool shirts like this one", "start": 509.06, "duration": 3.08}, {"text": "and our community forum, which you should totally join.", "start": 512.14, "duration": 2.96}]