[{"text": "This video is brought to you by The Great Courses Plus, more on that later.", "start": 0.03, "duration": 2.76}, {"text": "History happens in a lot of places.", "start": 3.06, "duration": 1.94}, {"text": "In political assemblies and royal courts, on battlefields,", "start": 5.0, "duration": 2.7}, {"text": "at marketplaces and in the home, but for us losers who are stuck here in the present", "start": 7.7, "duration": 3.84}, {"text": "we need accounts and resources to understand the past or we might as well be flying blind.", "start": 11.54, "duration": 3.68}, {"text": "So while history happens everywhere all the time, history is made in the pages of books.", "start": 15.22, "duration": 4.48}, {"text": "And that's what the series is about; the history makers.", "start": 19.7, "duration": 2.34}, {"text": "Those writers who do the crucial work of keeping the past alive.", "start": 22.04, "duration": 2.6}, {"text": "And there's no better example of a history maker than Herodotus,", "start": 24.64, "duration": 2.76}, {"text": "who not only made history, but, he like *made* history.", "start": 27.4, "duration": 3.54}, {"text": "Unfortunately, like many of the figures we've covered and will cover in this series,", "start": 30.94, "duration": 3.58}, {"text": "his book can be a mess to read through,", "start": 34.529, "duration": 2.071}, {"text": "his structure is painfully disjointed in places,", "start": 36.6, "duration": 2.1}, {"text": "and he has a reputation for being a gigantic liar.", "start": 38.7, "duration": 2.46}, {"text": "That is a worrying trend with these guys,", "start": 41.16, "duration": 2.06}, {"text": "but that's also why I'm here making these videos in the first place!", "start": 43.22, "duration": 2.34}, {"text": "So to set the record straight and to figure out why Herodotus is so foundational to the history of history,", "start": 45.56, "duration": 4.62}, {"text": "let's do some history.", "start": 50.18, "duration": 1.1}, {"text": "...wait, what-", "start": 51.28, "duration": 0.82}, {"text": "You'd think that for a character who wrote so much,", "start": 52.1, "duration": 1.98}, {"text": "we'd have a decent understanding of where this dude came from.", "start": 54.08, "duration": 2.78}, {"text": "But, heh, no.", "start": 56.86, "duration": 1.34}, {"text": "He tells us outright that he's from Halicarnassus on the South West Coast of Anatolia", "start": 58.2, "duration": 3.68}, {"text": "But WHEN is another matter entirely.", "start": 61.88, "duration": 2.24}, {"text": "Historians often date him to around 484 BC", "start": 64.12, "duration": 2.46}, {"text": "but the reason why is...", "start": 66.58, "duration": 2.0}, {"text": "Aw man", "start": 68.58, "duration": 0.5}, {"text": "It's- it is really dumb, you guys.", "start": 69.08, "duration": 1.56}, {"text": "We have a record of Herodotus living in Athens and being sent out to the new colony at Thurii at 443 BC.", "start": 70.64, "duration": 5.52}, {"text": "So historians just kind of assumed,", "start": 76.16, "duration": 2.02}, {"text": "\"Well, if he was sent out to a colony he must have been about 40 years old.", "start": 78.18, "duration": 4.02}, {"text": "So that would place his birthday -", "start": 82.2, "duration": 1.34}, {"text": "Let's see -", "start": 83.54, "duration": 0.68}, {"text": "40 years before 443, in about 484.\"", "start": 84.22, "duration": 2.96}, {"text": "And that's it!", "start": 87.18, "duration": 1.28}, {"text": "THAT's the reason!", "start": 88.46, "duration": 1.42}, {"text": "I shouldn't need to tell you how abysmal that logic is.", "start": 89.88, "duration": 2.76}, {"text": "Takeaway here is that for all we DO know about Ancient Greece,", "start": 92.64, "duration": 2.9}, {"text": "there are entire swathes that might as well be blank,", "start": 95.54, "duration": 2.26}, {"text": "and Herodotus' birthday is one of them.", "start": 97.8, "duration": 1.86}, {"text": "Some records show that he travelled around to a lot of different places,", "start": 99.66, "duration": 2.52}, {"text": "but for the sake of sticking to information that we actually, y'know, *know*,", "start": 102.18, "duration": 3.86}, {"text": "We're gonna keep pretty close to the text that Herodotus leaves us.", "start": 106.04, "duration": 2.68}, {"text": "With that in mind, the typical notion of Herodotus is that", "start": 108.72, "duration": 2.28}, {"text": "he was the first person to study the past and he wrote a book", "start": 111.0, "duration": 2.64}, {"text": "recounting the Greco-Persian Wars, but both of those are only partially true.", "start": 113.64, "duration": 3.78}, {"text": "He wasn't the first writer in the field and he talked about way more than just Greece.", "start": 117.42, "duration": 3.779}, {"text": "See, Herodotus didn't set out to write history.", "start": 121.2, "duration": 2.56}, {"text": "Rather, he initially wanted to write a travel guide,", "start": 123.76, "duration": 2.7}, {"text": "inspired by a work called 'The Travels Around The World', by Hecataeus of Miletus.", "start": 126.46, "duration": 3.52}, {"text": "That book was a comprehensive look at the lands and peoples around the Mediterranean,", "start": 129.98, "duration": 3.1}, {"text": "complete with this weirdly accurate map of the ancient world.", "start": 133.08, "duration": 2.92}, {"text": "And you can see those influences in the way that Herodotus writes.", "start": 136.0, "duration": 2.6}, {"text": "He's happy to spend entire chapters just telling fun stories about anything from the old Kings of Egypt,", "start": 138.6, "duration": 4.66}, {"text": "to the proper technique for wrestling a crocodile,", "start": 143.26, "duration": 2.06}, {"text": "to how much he coughed while hotboxing with the Scythians.", "start": 145.32, "duration": 2.72}, {"text": "At his core, Herodotus is a storyteller, and everything from his fun anecdotes,", "start": 148.04, "duration": 3.88}, {"text": "to his inordinately long narrative tangents, to his sweeping assertions of cause and effect, derived from his love of stories.", "start": 151.92, "duration": 5.78}, {"text": "From his home of Halicarnassus, Herodotus was traveling constantly.", "start": 157.7, "duration": 3.34}, {"text": "First to the island of Samos, then to the rest of Greece, the Black Sea, Egypt, parts of Persia, and possibly even more.", "start": 161.04, "duration": 5.7}, {"text": "As he went around hearing stories and writing about the places he saw,", "start": 166.74, "duration": 2.94}, {"text": "he got the idea to organize all of them in the order that they were conquered by the Persians.", "start": 169.68, "duration": 3.52}, {"text": "So partway through writing, he radically restructured his travel guide into a loose chronology of the growing Persian Empire.", "start": 173.2, "duration": 5.72}, {"text": "And funnily enough, you can really see these instances of complete tonal whiplash", "start": 178.92, "duration": 3.68}, {"text": "between historical anecdotes and fully unrelated digressions about local culture.", "start": 182.6, "duration": 4.18}, {"text": "The first half of his book is FULL of this.", "start": 186.78, "duration": 1.88}, {"text": "It's essentially like he's saying,", "start": 188.66, "duration": 1.28}, {"text": "\"Yep, so that's the story of King Cyrus the Great who founded the Persian Empire,", "start": 189.94, "duration": 3.18}, {"text": "and then his son King Cambyses the Mad conquered Egypt, but before we do any of that,", "start": 193.12, "duration": 4.26}, {"text": "lemme just tell you a little bit about Ancient Egypt first.\"", "start": 197.39, "duration": 2.27}, {"text": "And then he spends the next seventy pages just talking about Ancient Egypt,", "start": 199.66, "duration": 3.94}, {"text": "and after all that is done, he picks up with the story of Cambyses as if he never stopped,", "start": 203.6, "duration": 3.62}, {"text": "and then continues on to the tale of his son, King Darius.", "start": 207.22, "duration": 2.6}, {"text": "So it is a chronology, but ohhh boy, is it a messy one.", "start": 209.82, "duration": 4.06}, {"text": "That goes on for about five chapters,", "start": 213.88, "duration": 1.62}, {"text": "but eventually we get to more familiar ground", "start": 215.5, "duration": 1.64}, {"text": "as Herodotus arrives at Persia's conquest of Ionia in 505 BC.", "start": 217.14, "duration": 3.56}, {"text": "Six years later, the Athenians gave a helping hand to their fellow Ionians in an attempt at anti-Persian revolt,", "start": 220.7, "duration": 4.52}, {"text": "and from here, Herodotus dives into the customs, government and origins of the great cities of Athens and Sparta,", "start": 225.22, "duration": 4.92}, {"text": "leading up to Persia's attempted invasion of Greece in 490 BC, and this is where it all comes together.", "start": 230.14, "duration": 4.72}, {"text": "The last four chapters of Herodotus' book is all about the Persian Wars that you know and love,", "start": 234.86, "duration": 3.9}, {"text": "Marathon, Thermopylae, Salamis, Plataea, all that jazz.", "start": 238.76, "duration": 3.74}, {"text": "We've been through before so I'll skip over most of the details,", "start": 242.5, "duration": 2.22}, {"text": "but that's effectively the way that Herodotus' book goes down.", "start": 244.72, "duration": 2.86}, {"text": "Half of it is a sweeping account to the Persian Empire's rise interspersed with a travel guide,", "start": 247.58, "duration": 3.94}, {"text": "and the second half is a direct narrative of the Greco-Persian Wars.", "start": 251.52, "duration": 2.8}, {"text": "And he states his objectives most clearly at the very start of his book.", "start": 254.32, "duration": 3.26}, {"text": "Herodotus of Halicarnassus here presents his inquiry so that the deeds of mankind may not be forgotten in time,", "start": 257.58, "duration": 5.68}, {"text": "and that great and marvelous works, some displayed by Greeks, some by Persians, may not be without their glory", "start": 263.26, "duration": 5.24}, {"text": "and to show why the two peoples fought with each other.", "start": 268.5, "duration": 2.54}, {"text": "Gotta say, I really appreciate when ancient authors just lay their cards out of the very start of the book.", "start": 271.04, "duration": 4.48}, {"text": "Herodotus wasn't just describing the world or chronicling events like writers before him,", "start": 275.52, "duration": 4.1}, {"text": "he created a method of inquiring into the past to find out why those events happened.", "start": 279.62, "duration": 4.22}, {"text": "Homer had actually asked a similar question at the beginning of the Iliad,", "start": 283.84, "duration": 3.14}, {"text": "wondering to the muses why it was that Agamemnon and Achilles were so butthurt with each other.", "start": 286.98, "duration": 3.92}, {"text": "But whereas Homer was happy to attribute cause and effects to divine will,", "start": 290.9, "duration": 3.06}, {"text": "Herodotus grounded his inquiry into the observable mortal world,", "start": 293.96, "duration": 3.0}, {"text": "and that word 'historias' in the Greek is where we get the word 'history'.", "start": 296.96, "duration": 3.96}, {"text": "So, Herodotus invented big age history", "start": 300.92, "duration": 2.66}, {"text": "and told the centuries-spanning story of Persia's great rise and eventual defeat by the Greeks,", "start": 303.58, "duration": 4.38}, {"text": "But then why do so many people think that he's a massive liar?", "start": 307.96, "duration": 3.26}, {"text": "I mean even Thucydides threw shade at Herodotus for stooping to cheap storytelling", "start": 311.22, "duration": 3.72}, {"text": "and for not properly checking his sources.", "start": 314.94, "duration": 2.04}, {"text": "Well, despite his best attempts to ground cause and effect in mortal actions rather than the obscure will of the gods,", "start": 316.98, "duration": 5.08}, {"text": "Herodotus still fell prey to some mythical exaggerations", "start": 322.06, "duration": 2.94}, {"text": "In one tale, the singer Aryan sailed from Corinth to Tarentum and found himself on the receiving end of an armed robbery by his crewmates.", "start": 325.0, "duration": 6.38}, {"text": "They let him sing one last song and then tossed him overboard so that he could go swimming with the fishies in classic monster fashion,", "start": 331.38, "duration": 5.32}, {"text": "but Orion surprised everybody by actually swimming with the fishes", "start": 336.7, "duration": 4.0}, {"text": "when a dolphin sent by Apollo arrived to escort Aryan safely to shore.", "start": 340.7, "duration": 3.46}, {"text": "There's also an account of Persian ants the size of foxes who dug up gold,", "start": 344.16, "duration": 3.56}, {"text": "and other stories of a turf war in Central Europe between griffins and cyclopes, also over gold.", "start": 347.72, "duration": 5.12}, {"text": "So why does Herodotus include all of these weird myths in the middle of a history book?", "start": 352.84, "duration": 3.96}, {"text": "Well, it's in the way that he did his research.", "start": 356.8, "duration": 2.12}, {"text": "He gathered eyewitness accounts, hearsay and local folktales during his travels,", "start": 358.92, "duration": 3.74}, {"text": "and he was committed to relaying all of the stories that he heard,", "start": 362.66, "duration": 2.48}, {"text": "even when he didn't strictly believe them and even when they conflicted.", "start": 365.14, "duration": 3.22}, {"text": "He outright says, 'In all cases I am bound to report what I am told, but not in every case to believe it.'", "start": 368.36, "duration": 5.34}, {"text": "Now this attitude towards research habits may well give other historians a heart attack,", "start": 373.7, "duration": 3.68}, {"text": "but I honestly respect that commitment to complete information.", "start": 377.38, "duration": 2.72}, {"text": "Unlike the travels of Marco Polo, where all of the embellishments came after the fact,", "start": 380.1, "duration": 3.48}, {"text": "Herodotus captured a complete picture of what the ancients thought their world was like, myths and all.", "start": 383.58, "duration": 4.5}, {"text": "And even so, researchers in the 90s figured out that those giant gold-digging ants were most likely a type of Himalayan 'marmot' that digs up gold dust,", "start": 388.08, "duration": 7.48}, {"text": "And the ancient Persian word for 'marmot' and 'mountain ant' would have been nearly identical to a Greek speaker like Herodotus.", "start": 395.56, "duration": 5.34}, {"text": "The dolphins story is a little more dubious, but there's art in Corinth and Tarentum showing a singer on a dolphin,", "start": 400.9, "duration": 5.12}, {"text": "so it may be an exaggerated story rather than an outright myth or a fabrication.", "start": 406.02, "duration": 3.5}, {"text": "As for the gold hoarding griffins...", "start": 409.52, "duration": 1.76}, {"text": "yeah, I got nothing.", "start": 411.28, "duration": 1.04}, {"text": "The second big bit of wackiness is the relationship between Athens and Sparta during the Persian Wars.", "start": 412.32, "duration": 4.2}, {"text": "Even though the cities were closely allied against their invaders,", "start": 416.52, "duration": 2.92}, {"text": "Herodotus often shows them bickering over who gets to be in charge,", "start": 419.44, "duration": 2.78}, {"text": "and goes out of his way to show how slow Sparta was to arrive for the Battle of Marathon,", "start": 422.22, "duration": 3.52}, {"text": "only getting there to congratulate Athens a day after all the hard work was already taken care of.", "start": 425.74, "duration": 4.18}, {"text": "And in the lead-up to the Battle of Plataea, he gives Athens several stanzas", "start": 429.92, "duration": 3.26}, {"text": "to humble brag about how great and honorable they've been throughout the war effort.", "start": 433.18, "duration": 3.32}, {"text": "Beyond this, Sparta doesn't exactly cut a regal figure in Herodotus's accounts,", "start": 436.5, "duration": 4.26}, {"text": "since they kind of always lose unless big boy Athens is there to save them.", "start": 440.76, "duration": 3.7}, {"text": "This is uneven storytelling at best and outright bias at worst, but there's a very good reason for it.", "start": 444.46, "duration": 5.38}, {"text": "Herodotus was living in Athens around the start of the Peloponnesian War,", "start": 449.84, "duration": 3.26}, {"text": "so his sources would have turned up all kinds of Athenian-Spartan rivalry just from contemporary animosity.", "start": 453.1, "duration": 4.58}, {"text": "With Sparta and Athens jockeying for control of Greece,", "start": 457.68, "duration": 2.64}, {"text": "both cities would logically want to claim the moral high ground,", "start": 460.32, "duration": 2.72}, {"text": "and the result is the retroactive insertion of all this weird intercity rivalry", "start": 463.04, "duration": 3.54}, {"text": "where there probably wasn't all that much in the first place.", "start": 466.58, "duration": 2.54}, {"text": "It's the rough equivalent of a Cold War-era historian showing some narrative bias about America's cooperation with the Soviets in the Second World War -", "start": 469.12, "duration": 6.88}, {"text": "the present invariably shapes opinions on the past.", "start": 476.0, "duration": 2.64}, {"text": "But there's one last tiny instance of total historical fabrication.", "start": 478.64, "duration": 4.36}, {"text": "See, the Histories begins with an account of a conversation between the Athenian lawgiver Solon and King Croesus of Lydia.", "start": 483.0, "duration": 6.34}, {"text": "Croesus was rich.", "start": 489.34, "duration": 1.24}, {"text": "Stupidly rich, in fact, because his mints and mines produced the first coins in the ancient world.", "start": 490.58, "duration": 4.68}, {"text": "When the two met, Croesus asked Solon who he thought the happiest person in the world was,", "start": 495.26, "duration": 4.16}, {"text": "very much expecting the answer to be himself, you know, with all the money and whatnot.", "start": 499.42, "duration": 3.94}, {"text": "To his shock, Solon's answer was instead some comparatively humble Athenian guy,", "start": 503.36, "duration": 4.38}, {"text": "on the grounds that you can never count a person happy until they're dead", "start": 507.74, "duration": 3.08}, {"text": "because fortune always finds time to screw somebody over.", "start": 510.82, "duration": 2.6}, {"text": "Croesus was obviously displeased but he would soon find Solon to be all too right,", "start": 513.42, "duration": 4.24}, {"text": "as Croesus hubristically set out to conquer the growing Persian Empire", "start": 517.66, "duration": 3.1}, {"text": "and succeeded only in losing all of his land and money and power.", "start": 520.76, "duration": 3.58}, {"text": "The moral of the story being, don't count your empires before they hatch.", "start": 524.34, "duration": 3.46}, {"text": "The main problem here, and it's a tiny problem, is that this whole conversation is well...", "start": 527.8, "duration": 5.48}, {"text": "categorically impossible.", "start": 533.4, "duration": 1.26}, {"text": "Solon left his native Athens in the mid 590s BC and Croesus would have been an infant at the time,", "start": 534.74, "duration": 5.32}, {"text": "He didn't even become King until the year that Solon died,", "start": 540.06, "duration": 2.74}, {"text": "so the notion of the two having a full conversation was ludicrous.", "start": 542.8, "duration": 2.82}, {"text": "That begs the question - why'd you put it in a history book?", "start": 545.62, "duration": 3.2}, {"text": "A couple of quick clues clear up what's going on.", "start": 548.82, "duration": 2.22}, {"text": "For one, it plays out like a scene in a play with full dialogue and everything, it's very dramatised.", "start": 551.04, "duration": 5.36}, {"text": "Two, it features prominently in the first chapter of the book, as if to kind of set the stage for everything that comes later.", "start": 556.4, "duration": 5.18}, {"text": "And three, most of the ancient audience would have known that the two characters were separated by a good couple decades,", "start": 561.58, "duration": 5.08}, {"text": "so they probably wouldn't have taken it too literally.", "start": 566.66, "duration": 2.46}, {"text": "What Herodotus might have intended was to use this scene as a symbolic framing device", "start": 569.12, "duration": 4.1}, {"text": "to establish the recurring theme of, hey watch out for hubris, it'll get you.", "start": 573.22, "duration": 4.36}, {"text": "This idea crops up again, and again, with Darius and eventually King Xerxes,", "start": 577.58, "duration": 3.9}, {"text": "and little that Herodotus know, it foreshadowed the later fate of the Athenian Empire.", "start": 581.48, "duration": 4.4}, {"text": "Spoopy.", "start": 585.88, "duration": 0.78}, {"text": "Still pretty uncool to play it off as something that actually happened,", "start": 586.66, "duration": 2.84}, {"text": "but back in the day most Greeks would have known to take this figuratively,", "start": 589.5, "duration": 3.16}, {"text": "as a tone piece to set the stage for the rest of the history book.", "start": 592.66, "duration": 2.68}, {"text": "So as long as you know to look out for tales that sound maybe a little bit too mythical,", "start": 595.34, "duration": 3.8}, {"text": "and for an anachronistic depiction of Athenian and Spartan rivalry,", "start": 599.14, "duration": 3.18}, {"text": "you can essentially read through Herodotus and get a pretty good picture of the classical Greek world.", "start": 602.32, "duration": 4.68}, {"text": "Is it confusing and weirdly structured?", "start": 607.0, "duration": 2.2}, {"text": "Yes, dear God, the man speaks in layers upon layers of narrative digressions,", "start": 609.2, "duration": 4.04}, {"text": "but I do genuinely think it's worth reading if you're curious,", "start": 613.24, "duration": 3.34}, {"text": "and generations of historians have Herodotus to thank", "start": 616.58, "duration": 2.54}, {"text": "for being the first person to look into the past and inquire, why?", "start": 619.12, "duration": 3.32}, {"text": "We here at OSP are all about teaching and learning,", "start": 622.88, "duration": 2.54}, {"text": "and if you want on-demand access to some of the world's best educators on a massive range of topics,", "start": 625.42, "duration": 3.92}, {"text": "then you should check out today's sponsor, The Great Courses Plus.", "start": 629.34, "duration": 2.76}, {"text": "This service takes all of the lectures and full courses offered by The Great Courses and packs it all into one easy-to-browse streaming service.", "start": 632.1, "duration": 6.3}, {"text": "It's like a Netflix for college classes, with over 11,000 lectures on topics ranging from math and history, to travel and cooking.", "start": 638.4, "duration": 6.58}, {"text": "I personally have been learning with The Great Courses since I was watching math lectures with my dad way back in middle school,", "start": 644.98, "duration": 4.82}, {"text": "and nowadays I love jumping into a new topic in history with a lecture from The Great Courses Plus to start me off.", "start": 649.8, "duration": 4.76}, {"text": "If you'd like to learn more about our boy Herodotus and how he fits into the larger picture of Greek history,", "start": 654.56, "duration": 4.64}, {"text": "then I have got to recommend this lecture on the birth of history from the foundations of Western Civilisation course.", "start": 659.2, "duration": 4.84}, {"text": "Whether you want to dig deeper into a topic you're already familiar with, or maybe starting completely fresh with something new,", "start": 664.04, "duration": 4.95}, {"text": "I really believe that there's something you'll be able to learn from and enjoy with The Great Courses Plus,", "start": 668.99, "duration": 4.27}, {"text": "and they're offering all of you a free month to get you started if you sign up with our link at TheGreatCoursesPlus.com/OverlySarcastic", "start": 673.26, "duration": 6.02}, {"text": "or click on that shiny blue link down in the description.", "start": 679.28, "duration": 2.36}, {"text": "Again, that's TheGreatCoursesPlus.com/OverlySarcastic for one month of unlimited courses.", "start": 681.64, "duration": 5.66}, {"text": "On the subject of the Persian Wars, now that the video is over, I've just got to dish on this Philippides nonsense.", "start": 687.3, "duration": 4.34}, {"text": "There was no runner who came back to Athens, announced that they won the battle and dropped dead.", "start": 691.64, "duration": 4.16}, {"text": "That was made up centuries afterwards and it's dumb.", "start": 695.8, "duration": 2.44}, {"text": "What really happened was that Darius sent his fleet around Attica to attack Athens after the battle,", "start": 698.24, "duration": 4.64}, {"text": "so the Athenian army had to run, exhausted from fighting at Marathon, in full armor, all that 26.2 miles to Athens", "start": 702.88, "duration": 6.5}, {"text": "in order to defend it AGAIN for when the fleet arrived.", "start": 709.38, "duration": 2.8}, {"text": "There's no reason people should be getting this wrong. It's literally in the book.", "start": 712.18, "duration": 3.62}, {"text": "So if you ask me, it's not actually a marathon unless you're shlepping 50 full pounds of bronze to save your city from a sacking.", "start": 715.8, "duration": 6.06}, {"text": "Get on their level.", "start": 721.86, "duration": 1.2}]