[{"text": "Hi, I got my hands on a bunch of these Thermoelectric Peltier devices ,thanks to Circuit Specialists.", "start": 0.03, "duration": 6.97}, {"text": "I've never used them before but, from what I know when you apply electricity to them they pump heat.", "start": 7.049, "duration": 5.73}, {"text": "Well, let's power it with 12 volt DC. I know the theory -(gets shocked)", "start": 13.24, "duration": 4.76}, {"text": "Sh** ow(gets shocked again)", "start": 18.04, "duration": 0.5}, {"text": "I know the theory behind it, but I haven't really experienced one", "start": 19.27, "duration": 3.919}, {"text": "What? This - OWW(gets burned)", "start": 25.539, "duration": 2.0}, {"text": "It burn-freezes", "start": 27.97, "duration": 2.0}, {"text": "It's like you're naked in space and your side facing the Sun is boiling hot and the other side is freezing cold.", "start": 30.039, "duration": 7.07}, {"text": "I knew this would happen", "start": 37.11, "duration": 1.469}, {"text": "But when you really experience it, new questions pop in your head, like all my life when I ran", "start": 38.579, "duration": 5.13}, {"text": "electricity through a conductor it always heated up.", "start": 43.989, "duration": 2.479}, {"text": "Except now it's cooling down, and it's heating up on the other side.", "start": 46.468, "duration": 3.241}, {"text": "It kind of works like my wife. While the rest of her body is at boiling temperature, her feet are at absolute zero.", "start": 49.75, "duration": 7.009}, {"text": "Okay, let's power it up again and look at it with my thermal camera.", "start": 56.89, "duration": 3.59}, {"text": "Right now, both sides are at the same temperature.", "start": 61.0, "duration": 2.6}, {"text": "And if I power it up", "start": 64.39, "duration": 2.0}, {"text": "This side cools down", "start": 67.93, "duration": 2.0}, {"text": "quickly, while the other side heats up. Ooh it's burning.", "start": 71.409, "duration": 5.99}, {"text": "(Blows to Cool it Down)", "start": 77.399, "duration": 2.0}, {"text": "I shouldn't run it at maximum power with no heat sink.(Blows again)", "start": 79.659, "duration": 2.681}, {"text": "Running it at 5 volts", "start": 82.34, "duration": 2.199}, {"text": "and one side heats up,", "start": 85.96, "duration": 2.0}, {"text": "while the other side cools down. So it's like 29 degrees here and", "start": 88.81, "duration": 5.51}, {"text": "60 degrees here. So there's like 30 degrees different between both sides.", "start": 95.17, "duration": 4.489}, {"text": "And if I flip the voltage here, you see the cold and hot sides", "start": 100.03, "duration": 3.349}, {"text": "flip too. Now this side is cooling down and", "start": 103.93, "duration": 2.989}, {"text": "that side is heating up. If I let it run for a while the cold side heats up, too", "start": 107.74, "duration": 5.12}, {"text": "But it seems like the device is keeping the temperature difference", "start": 112.86, "duration": 3.299}, {"text": "constant around 30 degrees at five volts. And the temperature difference between the two surfaces is power dependent.", "start": 116.32, "duration": 6.739}, {"text": "So at maximum power the difference can be 60 to 70 degrees.", "start": 123.06, "duration": 4.18}, {"text": "These things work based on Peltier Effect, Seebeck Effect and Thomson Effect", "start": 127.24, "duration": 4.46}, {"text": "which is basically the extension of Seebeck and Peltier Effects.", "start": 131.73, "duration": 2.47}, {"text": "And all these are different manifestations of the one thing that is the Thermoelectric Effect.", "start": 134.2, "duration": 5.3}, {"text": "which happens when two conductors with different materials touch each other.", "start": 140.0, "duration": 3.909}, {"text": "The Seebeck effect is when there is a temperature difference between the junction of", "start": 143.91, "duration": 4.619}, {"text": "two material and rest of it a voltage is created across the junction and acts like a generator.", "start": 148.75, "duration": 5.36}, {"text": "The voltage is typically very small in order of microvolts and increases with more temperature difference.", "start": 154.11, "duration": 6.21}, {"text": "Measuring that tiny voltage you can measure the temperature.", "start": 160.5, "duration": 3.0}, {"text": "That's what they do in thermocouples joining two different wires, chrome and alumel in this case,", "start": 163.5, "duration": 5.52}, {"text": "and you can read the temperature on the meter.", "start": 169.36, "duration": 2.84}, {"text": "In the Peltier Effect, if you run current through the same joint it can cool down and absorb heat, or", "start": 172.78, "duration": 7.04}, {"text": "it can heat up and radiate heat depending on the direction of the current.", "start": 180.19, "duration": 4.61}, {"text": "The problem is that I have no idea what happens in atomic quantum level that passing", "start": 184.8, "duration": 5.22}, {"text": "electricity through two material can cool it down. I read somewhere that the electrons move the heat away.", "start": 190.3, "duration": 6.169}, {"text": "What the hell does that mean?", "start": 196.81, "duration": 1.429}, {"text": "If you know a good explanation, please leave it in the comments,", "start": 198.239, "duration": 3.33}, {"text": "so I learn it too. Or if you want to learn math and science then check the sponsor of this video:- Brilliant.org", "start": 201.57, "duration": 5.93}, {"text": "Such professional, much interactive.", "start": 207.9, "duration": 3.28}, {"text": "Tons of math and science courses, with interactive problem-solving and quizzes to make sure you learn what you want better.", "start": 211.5, "duration": 6.54}, {"text": "So sign up for free at brilliant.org/electroboom", "start": 218.1, "duration": 3.58}, {"text": "to get access to a lot of free courses already, but using my link you get 20% off of the annual premium subscription", "start": 221.94, "duration": 6.6}, {"text": "that gives you full website access for less than $10 a month.", "start": 228.88, "duration": 3.74}, {"text": "So this device is fascinating! For whatever reason when you run current through it", "start": 233.14, "duration": 4.639}, {"text": "it pushes heat from one side to the other creating a temperature difference.", "start": 237.78, "duration": 3.839}, {"text": "Like if both surfaces start at 30 degrees Celsius running current can make one side 0 and the other 60 degrees.", "start": 241.63, "duration": 7.16}, {"text": "But it also wastes tons of power. 50 watts max for this guy.", "start": 248.79, "duration": 4.049}, {"text": "So it heats up quickly while the temperature difference remains around the same.", "start": 252.84, "duration": 4.29}, {"text": "So one side could be 100 degrees and the other side 40.", "start": 257.29, "duration": 3.41}, {"text": "But if I can somehow cool down the hot side to say 50 degrees Celsius then the cold side could be -10 degrees.", "start": 260.7, "duration": 6.6}, {"text": "The cold side would suck the heat from the environment and pump it to the hot side.", "start": 267.68, "duration": 3.98}, {"text": "That's why I bought a bunch of heat sinks to experiment with. So I attach the device and heatsink using a thermal compound", "start": 271.75, "duration": 6.829}, {"text": "that fills the gap between the two and provides a very good thermal conductivity.", "start": 278.7, "duration": 4.88}, {"text": "The metal heatsink with so many fins creates a large surface area to transfer heat to air better and cool down.", "start": 283.9, "duration": 6.94}, {"text": "Okay, let's give it a try.", "start": 290.949, "duration": 2.0}, {"text": "Oh look at that, the surface is getting colder. Great!", "start": 293.949, "duration": 3.17}, {"text": "But as the heat sink is getting warmer, the cold surface is going up too.", "start": 298.27, "duration": 4.73}, {"text": "Which means we have to blow air with a fan on the heatsink to keep it cold.", "start": 303.37, "duration": 4.91}, {"text": "Or even better, just place the heatsink in cold water. Hehehe!", "start": 308.83, "duration": 3.5}, {"text": "And we power it up", "start": 313.27, "duration": 2.0}, {"text": "And there it goes! hehe", "start": 316.3, "duration": 2.0}, {"text": "Of course as the water slowly heats up the temperature rises too.", "start": 319.27, "duration": 5.089}, {"text": "Running cold water would help but that wastes a lot of water.", "start": 324.729, "duration": 3.32}, {"text": "- 11 degrees. Let's add some water to the surface and power it up and see what happens.", "start": 328.93, "duration": 6.41}, {"text": "And zip it all freezes! Heh. And if I disconnect the power...", "start": 337.539, "duration": 5.24}, {"text": "BAM it heats right back up! These Peltier devices, or shall we call them Thermoelectric Devices, work on the same principles", "start": 346.3, "duration": 7.309}, {"text": "I talked about, but instead of one junction of two different material,", "start": 353.61, "duration": 3.39}, {"text": "there are many junctions placed in series like these between two surfaces made of P and N semiconductors.", "start": 357.0, "duration": 6.32}, {"text": "Running current through them creates a temperature difference.", "start": 363.76, "duration": 2.38}, {"text": "Also if you place a temperature difference between the two surfaces,", "start": 366.15, "duration": 3.209}, {"text": "you create a much higher voltage because of so many junctions in series. Flipping the temperature also flips the voltage.", "start": 369.46, "duration": 6.739}, {"text": "Let's give it a try. I have a box of tea with metal bottom, and if I pour boiling water in it,", "start": 376.199, "duration": 6.39}, {"text": "it creates a voltage at the output of the device around...", "start": 383.64, "duration": 4.52}, {"text": "2 volts! So I can use these to power something. Here I have a 10 ohm resistor and if I connect it to the output...", "start": 388.74, "duration": 6.04}, {"text": "right now I'm drawing like...", "start": 395.2, "duration": 2.0}, {"text": "160 milliamps from it. Of course the voltage drops", "start": 397.44, "duration": 3.2}, {"text": "as the hot water cools down and the heatsink heats up. And temperature difference gets smaller.", "start": 400.94, "duration": 4.88}, {"text": "In general, thermoelectric devices are pretty inefficient to create either cool or voltage.", "start": 406.3, "duration": 5.38}, {"text": "Their main application is in those small cooler or fridges because they are light and small.", "start": 411.68, "duration": 5.02}, {"text": "Now I want to put nine of these modules together to create a cooling surface/a generator, if possible.", "start": 417.14, "duration": 5.74}, {"text": "And so I bought a big fan to blow on the heat sinks and a bunch of screws and a wood board.", "start": 423.06, "duration": 5.68}, {"text": "Let's put them together.", "start": 429.04, "duration": 1.7}, {"text": "F***", "start": 438.22, "duration": 0.5}, {"text": "Ah f***", "start": 458.54, "duration": 0.5}, {"text": "The hell? My camera of six years just blew up!", "start": 460.78, "duration": 3.94}, {"text": "Well now I'm stuck with one camera and it doesn't have a microphone input,", "start": 466.009, "duration": 3.259}, {"text": "so I can't really use my wireless lapel anymore. Audio quality down.", "start": 469.269, "duration": 3.87}, {"text": "Here, my window of opportunity is made now I have to just install these heat sinks in it.", "start": 478.099, "duration": 5.479}, {"text": "Okay, so let me show you what we've got. The fan here will blow up directly into the heatsink", "start": 510.38, "duration": 5.659}, {"text": "I raise the heat sinks up a little bit so that the air has a chance to get over to all the fins of the heatsink.", "start": 516.38, "duration": 5.75}, {"text": "And I put those pieces of wood in the bigger channels to block them a little bit to make sure that the air gets", "start": 522.13, "duration": 5.369}, {"text": "to all the fins and the heat sinks are all in parallel so the air escapes from front and back vents", "start": 527.5, "duration": 5.7}, {"text": "I noticed something interesting. It seems like because the fan is turning this way", "start": 533.2, "duration": 4.14}, {"text": "Maximum air flow is coming out this way and out that way and there is very little air flow in these areas", "start": 537.89, "duration": 6.679}, {"text": "so that might affect the...", "start": 544.57, "duration": 2.0}, {"text": "temperature performance of the heat sinks. So I guess the air is not just coming straight up,", "start": 546.77, "duration": 4.699}, {"text": "It's twisting and I guess that's where the knowledge of fluid dynamics would have helped", "start": 551.47, "duration": 5.58}, {"text": "I've got an idea to make the air flow better using a CD cover. Let's hope it works.", "start": 557.12, "duration": 4.669}, {"text": "So here's what I've made for the fan and I think I've seen it on some other fans before.", "start": 571.53, "duration": 4.219}, {"text": "Basically my fan, when it blows, the air spins up like this.", "start": 575.94, "duration": 4.67}, {"text": "But now with these fins the air instead of twisting it will hit these walls and comes straight up.", "start": 580.61, "duration": 6.0}, {"text": "But now I've made them curved. So what happens is that when the air hits here it slips inside,", "start": 586.62, "duration": 6.139}, {"text": "so all these fins push the air inside where there is almost no air flow and when the air hits on the outside curve of", "start": 592.76, "duration": 6.78}, {"text": "the fins it is pushed out this way. So it spreads further out. So instead of one twisting column of air,", "start": 599.54, "duration": 6.51}, {"text": "hopefully it's more spread out and even. Okay, let's see if it helps.", "start": 606.21, "duration": 3.53}, {"text": "It doesn't really help that I place the fan too close to the fins, you know if there was a", "start": 609.84, "duration": 4.909}, {"text": "greater", "start": 615.45, "duration": 1.02}, {"text": "spacing between them the air would be much more even and would cover more of the fins. Oh, you know, I'm an electrical engineer", "start": 616.47, "duration": 6.799}, {"text": "I'm not really qualified to do this kind of mechanical stuff", "start": 623.27, "duration": 3.75}, {"text": "Hey, look at this! These two the airflow feels almost the same. This one feels a little bit less, but it's much more even now.", "start": 627.06, "duration": 7.85}, {"text": "Okay, now that everything is in place, I'm gonna cover between them with silicone, not only to keep these devices in place,", "start": 638.96, "duration": 6.32}, {"text": "but also to further isolate the hot and cold surfaces, or at least that's my thought.", "start": 645.38, "duration": 5.36}, {"text": "I need a small pan", "start": 652.88, "duration": 2.0}, {"text": "You don't want to have to cut a piece of sheet metal I want it nice and straight. Like this but small.", "start": 656.09, "duration": 5.96}, {"text": "Something square and small.", "start": 662.66, "duration": 2.0}, {"text": "Don't seem to have it", "start": 664.94, "duration": 1.46}, {"text": "*Falling Pan*", "start": 666.4, "duration": 1.36}, {"text": "S***", "start": 667.76, "duration": 0.5}, {"text": "This looks good, but it's part of a napkin holder", "start": 668.48, "duration": 2.44}, {"text": "Maybe I should buy the whole thing and cut this out of it", "start": 670.93, "duration": 3.21}, {"text": "These metal doors are perfect if I can find one without the handle", "start": 674.36, "duration": 3.5}, {"text": "*Falling 'Metal doors'*", "start": 677.86, "duration": 1.12}, {"text": "S***", "start": 678.98, "duration": 0.5}, {"text": "Fine, I'll just buy one of these and cut it", "start": 679.68, "duration": 2.28}, {"text": "You know some people play Minecraft in their channels. I'm kind of doing the same.", "start": 683.12, "duration": 4.43}, {"text": "I'm mining for money", "start": 687.55, "duration": 1.29}, {"text": "Then go to the villagers to trade for tools and equipment and make my own stuff. Hey, I'm a gaming channel!", "start": 688.84, "duration": 7.82}, {"text": "*Cutting a Metal Sheet out of it + Music*", "start": 696.66, "duration": 3.84}, {"text": "Now I'll attach this piece of metal over my Peltier devices using thermal paste", "start": 700.9, "duration": 5.72}, {"text": "and hopefully this piece of metal will help spread the heat evenly to all the devices", "start": 707.12, "duration": 3.88}, {"text": "And so it's done just took a week or two and thanks to my patron's support,", "start": 711.44, "duration": 4.52}, {"text": "I got a new and improved camera! So to thank them I'll buy them four 3d printers. Thanks for keeping my videos afloat.", "start": 715.96, "duration": 6.869}, {"text": "Now to use it as a generator, I put all the modules in series hoping that the sum of voltages is usable", "start": 722.83, "duration": 6.09}, {"text": "So here I'm boiling some water and with my 24 volt fan running, I put my water on top of it and", "start": 728.92, "duration": 7.709}, {"text": "That's it?", "start": 738.62, "duration": 1.709}, {"text": "I guess my heat sink in water was creating a larger difference. What is this good for? It's a joke!", "start": 740.329, "duration": 5.15}, {"text": "I guess I can turn on two white LEDs in series.", "start": 745.48, "duration": 3.839}, {"text": "Oh look one of them is red.", "start": 750.589, "duration": 2.0}, {"text": "So a 24 volt fan a pot of boiling water and hours of work to turn two LEDs on?!", "start": 753.199, "duration": 6.109}, {"text": "I think somewhere it said if the module is good for cooling, It's not good for power generation,", "start": 759.82, "duration": 5.24}, {"text": "So it'd better cool! Now to make it a cooler.", "start": 765.36, "duration": 2.26}, {"text": "Unfortunately, my power supply can do 10 amps maximum while every module can take five amps max at 12 volts", "start": 768.079, "duration": 6.619}, {"text": "So I put every three modules in series and put the branches in parallel so that I can at least do three amps per module.", "start": 774.699, "duration": 6.809}, {"text": "Not ideal, but hey. I'll run the unit and the fan at 24 volts so 8 volt per module.", "start": 781.509, "duration": 6.09}, {"text": "Look at this, it's cooling quite well. Well now that it's almost settled,", "start": 791.569, "duration": 3.98}, {"text": "it's running eight amps at 24 volts, so around 190 watts. I'm sure if I contain this it will get even cooler.", "start": 795.55, "duration": 6.63}, {"text": "Unfortunately running more power through my modules won't make much of a difference, because my fan can remove a limited amount of heat.", "start": 803.18, "duration": 6.289}, {"text": "So instead of this side getting colder my heatsink will get warmer.", "start": 809.47, "duration": 3.719}, {"text": "Look at all the condensation! But it works great as a fridge if I want to make this surface super cold,", "start": 813.35, "duration": 6.08}, {"text": "I can put my heat sink in water or ice. Maybe something to try in the future.", "start": 819.43, "duration": 3.899}, {"text": "In any case, I learned some good stuff doing this project.", "start": 823.58, "duration": 2.62}, {"text": "If you also want to learn Math and Science then, Brilliant.org is your friend!", "start": 826.4, "duration": 4.74}, {"text": "It's like a teacher you never had. You learn on your own time,", "start": 831.14, "duration": 3.16}, {"text": "learn what you enjoy for your job or to increase your skills, solving fun problems and taking quizzes,", "start": 834.309, "duration": 5.91}, {"text": "Very useful! For some reason, I really enjoy geometry and its problems. It's like a game to me. So to keep my skills sharp,", "start": 840.439, "duration": 6.739}, {"text": "I'm taking their geometry fundamentals course doing a series of cool problems.", "start": 847.179, "duration": 4.56}, {"text": "It's a great mental workout.", "start": 851.74, "duration": 1.769}, {"text": "If you really like to advance in Math and Science too, learning what you like professionally at your own convenience,", "start": 853.509, "duration": 5.549}, {"text": "then go to brilliant.org/electroboom and sign up for free and get 20% off for the first 200 viewers.", "start": 859.22, "duration": 6.96}, {"text": "And thanks for watching!", "start": 866.52, "duration": 0.8}, {"text": "*Outro*", "start": 867.32, "duration": 8.68}]