[{"text": "This video is sponsored by NordVPN visit NordVPN.com/nameexplain", "start": 0.0, "duration": 4.0}, {"text": "to get 75% of a free year plan and stick around to the end of the video to find out how to", "start": 4.0, "duration": 4.67}, {"text": "can extra month for free?", "start": 8.67, "duration": 1.57}, {"text": "In October 2018 many news websites started reporting on the couple of Adam Thomas and Claudia patatas as they came under scrutiny", "start": 10.24, "duration": 7.309}, {"text": "Simply due to the naming of their child many wanted the name to be banned", "start": 17.89, "duration": 4.25}, {"text": "Now this might sound silly but it kind of falls into place when you realize they gave their child the middle name of Adolf in honor", "start": 22.14, "duration": 5.91}, {"text": "Of the former German leader. This isn't the only instances in history. However that the name of a child has come under scrutiny", "start": 28.05, "duration": 5.79}, {"text": "Certain names have come under scrutiny", "start": 34.42, "duration": 1.53}, {"text": "or outright banned across the world", "start": 35.95, "duration": 2.0}, {"text": "Some due to the history held with the names like, well, Adolf and some just because of how silly they are the name", "start": 37.96, "duration": 5.479}, {"text": "the name Akuma has become illegal in Japan due to it being the Japanese word for devil", "start": 43.54, "duration": 3.799}, {"text": "and in France", "start": 47.34, "duration": 0.789}, {"text": "Parents were disallowed from naming their daughter Nutella while this might sound somewhat silly and let's face it", "start": 48.129, "duration": 4.91}, {"text": "A lot of the time it is a lot of countries have compiled lists or banned names with some nations taking a step further", "start": 53.039, "duration": 6.3}, {"text": "One that comes to mind is the naming laws in Sweden, Sweden enacted a naming law in 1982", "start": 59.469, "duration": 5.899}, {"text": "Which mean that all children born in the country have to have their first names approved by the government", "start": 65.369, "duration": 4.5}, {"text": "This was first introduced all the way back in 1901 meant to prevent non-noble families giving their children noble names", "start": 69.869, "duration": 6.24}, {"text": "over time this change and the law reads in English that first name shall not be approved if they can cause offense or can", "start": 76.439, "duration": 5.7}, {"text": "Be supposed to cause discomfort for the one using it which is a logical way to put it of course a famous example of this", "start": 82.14, "duration": 5.909}, {"text": "Is with baby BRFXXCCXXMNPCCCCLLLMMNPRXVCLMNCKSSQLBB11116", "start": 88.049, "duration": 15.951}, {"text": "which is pronounced Albin", "start": 104.1, "duration": 1.949}, {"text": "yet perhaps the most interest in case of name control in a country is with the island nation of Iceland", "start": 106.049, "duration": 3.951}, {"text": "while most countries have a list of banned names", "start": 110.049, "duration": 2.569}, {"text": "Iceland has a list of approved names the collection of just a few thousand names put together by the Atlantic naming committee if you have", "start": 112.799, "duration": 6.12}, {"text": "A child in Iceland and wish to give it a name not on the list", "start": 118.92, "duration": 2.43}, {"text": "You have to send a request to the Icelandic naming committee", "start": 121.35, "duration": 2.459}, {"text": "And hope they approve it and they make very well not as to have a name approved by the Icelandic naming committee", "start": 123.81, "duration": 5.039}, {"text": "It has to be a name that can fit into the convention and grammar of the Icelandic language", "start": 128.849, "duration": 4.05}, {"text": "an example of this would be with the name Carolina which isn't allowed and must be", "start": 133.2, "duration": 3.929}, {"text": "Karólína instead of to fit with Icelandic culture and language another", "start": 137.41, "duration": 3.559}, {"text": "interesting example", "start": 141.16, "duration": 0.63}, {"text": "happen in", "start": 141.79, "duration": 0.69}, {"text": "2014 with Harriet and Duncan two children living in Iceland with their parents from the UK when it came time to renew their passports the", "start": 142.48, "duration": 6.83}, {"text": "Icelandic government didn't approve their names as they didn't fit with the Icelandic", "start": 149.31, "duration": 3.57}, {"text": "conventions leaving them in the eyes of the law to be simply called girl and boy their British father said that all this is really", "start": 153.01, "duration": 6.289}, {"text": "Rather silly which perhaps the most British way of going about is there are of course many more rules on baby names across the planet", "start": 159.299, "duration": 6.66}, {"text": "But this video isn't just a curious look at the weird baby names of funny rules or names from across the globe", "start": 165.959, "duration": 4.95}, {"text": "I wish to apply some my own thinking", "start": 170.91, "duration": 2.039}, {"text": "Ideas onto the subject is this, well, banning certain names the correct thing to do so from here on out in the video we are", "start": 173.14, "duration": 6.05}, {"text": "somewhat leaving the world of facts and sources behind", "start": 179.19, "duration": 2.459}, {"text": "I'm not really going to share my personal opinion on the matter", "start": 181.65, "duration": 2.76}, {"text": "But more some of the schools of thought that I fought about on the subject", "start": 184.41, "duration": 3.359}, {"text": "You may think something completely different and that's completely fine. So I live in a country with far less street naming rules", "start": 187.769, "duration": 6.029}, {"text": "I've known people personally with very unconventional names", "start": 193.799, "duration": 2.94}, {"text": "so it's something I'm used to freedom of expression is a big thing here in the UK article 10 of the Human Rights Act of", "start": 196.739, "duration": 5.94}, {"text": "1998 explains that everyone has the right to freedom of expression", "start": 202.93, "duration": 2.99}, {"text": "This right shall include freedom to hold opinions and receive and impart information and ideas without", "start": 206.139, "duration": 4.79}, {"text": "interference by public authority and to my ears", "start": 211.239, "duration": 2.42}, {"text": "This sounds like you should apply to what you can call your child if you want to name your child something unique you have", "start": 213.66, "duration": 4.589}, {"text": "To write to you about being denied it by the government", "start": 218.25, "duration": 2.339}, {"text": "Of course in conjunction with this, people should perhaps be aware that even though they have the right to name a child anything there are", "start": 220.59, "duration": 5.79}, {"text": "Names that have perhaps more taboo than some and this is where a retort can come into play", "start": 226.38, "duration": 4.319}, {"text": "Let's look back at the Swedish naming law", "start": 230.799, "duration": 2.24}, {"text": "it states the name cannot cause offence, but can be supposed to cause discomfort for the one using it and this is so so", "start": 233.04, "duration": 5.94}, {"text": "Important naming a child is unlike naming a car or a pet tortoise that tiny baby will grow up and become another human in", "start": 239.079, "duration": 6.68}, {"text": "Society a ridiculous name given by uncaring parents can have huge ramifications for the child once grown up in society and in the workforce", "start": 245.829, "duration": 7.49}, {"text": "even before the child as an adult kids at school can be creative with bullying names even", "start": 253.48, "duration": 4.4}, {"text": "Normal conventional names kids can still find a rhyme or a pun to bully others", "start": 258.01, "duration": 4.039}, {"text": "so giving your child a name that's easy to make fun of straight away can be damaging of course, however", "start": 262.049, "duration": 4.93}, {"text": "Or a talk to this can be that when the child is old enough if they can legally change their name", "start": 266.98, "duration": 4.29}, {"text": "anyway", "start": 271.31, "duration": 0.5}, {"text": "Of course, you can have very silly names", "start": 271.81, "duration": 2.279}, {"text": "But what I'm more interested in is the name we started with Adolf in fact, The name is just another name", "start": 274.12, "duration": 5.96}, {"text": "However, the name Adolf has become cemented as a taboo name", "start": 280.24, "duration": 2.96}, {"text": "Thanks to the actions of just one man", "start": 283.2, "duration": 1.66}, {"text": "But he isn't the only notorious figure in history many people in history have done awful things", "start": 284.87, "duration": 4.79}, {"text": "But their names haven't gone down in infamy of being banned or dub taboo. Where is this line?", "start": 289.88, "duration": 4.97}, {"text": "Drawn take the name of the most infamous Russian leader Joseph Stalin. He did many bad things in his time", "start": 294.85, "duration": 5.519}, {"text": "But the name Joseph has remained a popular given name not becoming", "start": 300.37, "duration": 3.33}, {"text": "Associated with the one figure like Adolf has the main reason names can be taboo is due to the people", "start": 303.82, "duration": 5.18}, {"text": "Associated with them while the general consensus may be that Adolf is a taboo name as we saw at the start of this video", "start": 309.08, "duration": 5.44}, {"text": "There are clearly small pockets of society who do not see it as a taboo name", "start": 314.52, "duration": 3.88}, {"text": "but rather a name that should be", "start": 318.4, "duration": 1.54}, {"text": "Celebrated and this can work the other way round a name of some who's generally considered to be a good person could be a name", "start": 319.94, "duration": 5.839}, {"text": "Of taboo to another person. It's all about our individual ideologies", "start": 325.78, "duration": 3.57}, {"text": "Perhaps most interestingly is looking into the future names that are now taboo are due to the history associated with them", "start": 329.48, "duration": 6.47}, {"text": "But history is always being made and we might not know what the future holds", "start": 335.95, "duration": 3.419}, {"text": "Say if there's another tyrannical dictator in the future who goes down as well the most infamous people in history", "start": 339.65, "duration": 5.179}, {"text": "Say if they had a common", "start": 345.05, "duration": 1.44}, {"text": "Conventional name like John or Sarah what would become of that name in the fallout of world war ii the name adolf dropped in?", "start": 346.49, "duration": 6.68}, {"text": "popularity and people already with the name use a nickname the Adi Dass found that Adolf Dassler started going by Adi after the war would we", "start": 353.39, "duration": 7.369}, {"text": "Lose the name as common as john due to something like this happening. What would happen today? Many people already called John?", "start": 360.76, "duration": 5.25}, {"text": "Anyway, I've been rambling one for far too long", "start": 366.11, "duration": 2.209}, {"text": "I definitely can't wait to see their like to dislike ratio on this one", "start": 368.39, "duration": 3.589}, {"text": "But maybe we should go back to that initial question. Is it right to bad names?", "start": 371.98, "duration": 3.75}, {"text": "Well, it's hard to figure out a definitive answer there's arguments for and against there and that's okay", "start": 375.83, "duration": 5.959}, {"text": "Not every question needs an answer. Sometimes a question just raises more questions", "start": 381.79, "duration": 4.529}, {"text": "Luckily a question that does have a definitive answer is what's my favorite VPN to use and that the definitive answer is of course", "start": 387.23, "duration": 5.959}, {"text": "An odd VPN who have very kindly sponsored today's video", "start": 393.19, "duration": 3.299}, {"text": "This video has somewhat been about censorship and censorship on the inter remains a prevalent issue", "start": 396.49, "duration": 4.589}, {"text": "Some countries have very strict online censorship and control and luckily Nord VPN helps make sure your information", "start": 401.15, "duration": 5.809}, {"text": "Stays safe and nothing comes between you and your online experience", "start": 407.06, "duration": 3.26}, {"text": "They have thousands of superfast servers across 60 countries", "start": 410.389, "duration": 3.35}, {"text": "Which connect you to military-grade encryption giving you a safe and secure online experience?", "start": 413.74, "duration": 4.35}, {"text": "and if at any point you don't feel comfortable using Nord VPN their", "start": 418.09, "duration": 3.209}, {"text": "24/7 customer support a 30-day money-back guarantee will give you peace of mind", "start": 421.58, "duration": 3.8}, {"text": "Nord VPN offering views of named explained that's amazing deal for a limited time of seventy five percent of a three-year plan by going to", "start": 425.75, "duration": 6.38}, {"text": "Nord VPN comm", "start": 432.13, "duration": 1.18}, {"text": "/name explain it down in the description below that works out at just two dollars ninety nine a month an amazing deal as the busiest", "start": 433.31, "duration": 6.26}, {"text": "Shopping days of the year approach. You can even get an extra month for free by using the promo code name explained", "start": 439.57, "duration": 4.919}, {"text": "Thank you very much to Nord VPN of helping support name explained", "start": 444.49, "duration": 3.149}, {"text": "And once again, that's Nord VPN comm /name explained and promo code at name explained. Thank you", "start": 447.639, "duration": 5.94}, {"text": "And of course a huge thank you to all my patrons whose generous donations on a monthly basis make a name explain possible", "start": 453.58, "duration": 7.05}, {"text": "Thank you all so much", "start": 460.63, "duration": 2.0}]