[{"text": "So one of the biggest issues of our time is\none of the issues where the United States", "start": 0.52, "duration": 6.19}, {"text": "internationally is no longer really a participant\nin the discussion. There are no longer really", "start": 6.71, "duration": 6.14}, {"text": "at the table thanks to Donald Trump. And that\ntopic is climate change. The climate crisis.", "start": 12.85, "duration": 5.55}, {"text": "Now it's not some vague thing in the future.\nPeople are dying from climate change and pollution", "start": 18.4, "duration": 4.77}, {"text": "related issues right now. Now is when we are\neither going to figure it out, uh, or not", "start": 23.17, "duration": 7.05}, {"text": "figure it out and continue to fall further\nand further behind more and more urgently", "start": 30.22, "duration": 4.74}, {"text": "behind in figuring this out.", "start": 34.96, "duration": 2.25}, {"text": "It's a national security issue. It's a moral\nissue. It's a, a physical issue with regard", "start": 37.21, "duration": 5.689}, {"text": "to the physical health impact that climate\nchange has on humans and animals on this planet", "start": 42.899, "duration": 5.391}, {"text": "and biodiversity of the non animal kind as\nwell. And Donald Trump has been clear. Climate", "start": 48.29, "duration": 5.36}, {"text": "change is a hoax created by the Chinese. It's\nnot a problem. The U S is out of the Paris", "start": 53.65, "duration": 5.17}, {"text": "climate accords. So other countries have to\ntake the lead. It's not the u s who's going", "start": 58.82, "duration": 4.399}, {"text": "to do it. And so now if you want to be at\nthe forefront of fighting climate change,", "start": 63.219, "duration": 5.641}, {"text": "you don't go to the u s you go to China, you\ngo to India and you go to other countries.", "start": 68.86, "duration": 5.52}, {"text": "And this is becoming a very, a vicious circle.\nA sort of self fulfilling or self perpetuating", "start": 74.38, "duration": 4.729}, {"text": "prophecy. Trump simply didn't go to yesterday's\ng seven meeting about the climate.", "start": 79.109, "duration": 7.61}, {"text": "This was the place to talk about the Amazon\nrain forest fires, which by the way, the [inaudible]", "start": 86.719, "duration": 5.161}, {"text": "said, we're going to throw 20 million at it.\nThere are movies, as has been pointed out", "start": 91.88, "duration": 3.93}, {"text": "on Twitter, that have budgets that are more\nthan five times the amount of money that these", "start": 95.81, "duration": 3.649}, {"text": "seven countries are saying we will devote\nto the Amazon fire issue. This was the meeting", "start": 99.459, "duration": 5.21}, {"text": "about cutting carbon emissions, about dealing\nwith the crisis that is now, which is climate", "start": 104.669, "duration": 5.12}, {"text": "change. Trump just wasn't there. Trump was\nlater asked, why weren't you at the climate", "start": 109.789, "duration": 5.14}, {"text": "session? He said, oh, we're having it. In\na little while of reports, tried to explain", "start": 114.929, "duration": 3.83}, {"text": "to him that it's in the past. It already happened.\nTime moves forward. Uh, and Trump didn't seem", "start": 118.759, "duration": 5.061}, {"text": "to hear him, but he says, we have the cleanest\nair and the cleanest water on the planet,", "start": 123.82, "duration": 4.139}, {"text": "which is of course, both ridiculous and untrue.", "start": 127.959, "duration": 2.77}, {"text": "Instead of five session, did you make it to\nthe climbing section? Were there any conclusions", "start": 130.729, "duration": 5.631}, {"text": "they get before you're going to, in fact,\nit's going to be our next section, but we", "start": 136.36, "duration": 1.42}, {"text": "haven't had a different message that you'd\nlike to deliver it to. You know, I want clean", "start": 137.78, "duration": 4.79}, {"text": "air and clean water and we're right now having\nthe cleanest air and clean this water on the", "start": 142.57, "duration": 4.9}, {"text": "planet. But that's what I want. I want absolutely\ndrink air and clean water,", "start": 147.47, "duration": 5.95}, {"text": "living in a complete fantasy world as usual.\nAnd it was later reported that Trump wasn't", "start": 153.42, "duration": 5.41}, {"text": "there, but someone from his team was French\npresident McCrone also said, oh, I did broach", "start": 158.83, "duration": 6.79}, {"text": "the topic of the fires with Trump and Trump\nwants the fires put out. So, okay, there's", "start": 165.62, "duration": 5.89}, {"text": "that. Now, I hate to admit this because I\nwant the United States to be part of the climate", "start": 171.51, "duration": 6.56}, {"text": "change discussion. We're one of the biggest\nusers of fossil fuels. We have to be part", "start": 178.07, "duration": 4.97}, {"text": "of the solution, but there's probably way\nmore progress to be made when Donald Trump", "start": 183.04, "duration": 5.391}, {"text": "is not participating. Uh, the guy suggested\nbombing hurricanes to stop them. The guy thinks", "start": 188.431, "duration": 7.309}, {"text": "climate change is a hoax created by China.\nWhat can you really add to a discussion about", "start": 195.74, "duration": 5.41}, {"text": "climate change? And unfortunately, the reality\nis that Donald Trump's constituents only make", "start": 201.15, "duration": 4.31}, {"text": "this more feasible. You've got the people\nwho just don't understand climate change,", "start": 205.46, "duration": 3.74}, {"text": "so they don't believe in it.", "start": 209.2, "duration": 1.54}, {"text": "You've got the partisan hacks who just think\nit's a matter of opinion, and liberals are", "start": 210.74, "duration": 4.91}, {"text": "wrong because they want to be on the other\nopposite side of liberals. You've got the", "start": 215.65, "duration": 4.08}, {"text": "religious nuts who believe God would never\nmake it possible for humans to hurt the planet.", "start": 219.73, "duration": 6.38}, {"text": "And then you've got like the business and\nindustry people who probably believe climate", "start": 226.11, "duration": 5.27}, {"text": "change and accept the science, but they recognize\nthat their businesses potentially become less", "start": 231.38, "duration": 5.75}, {"text": "profitable if we take climate change seriously.\nAnd so you have this perfect constituency", "start": 237.13, "duration": 5.52}, {"text": "to do nothing about climate change and to\nfeel good and justified about doing nothing", "start": 242.65, "duration": 5.28}, {"text": "either because they're owning the libs or\nbecause of God or because of whatever else.", "start": 247.93, "duration": 4.34}, {"text": "Now I understand why Trump didn't go to the\nmeeting. I'm more left wondering why Trump", "start": 252.27, "duration": 4.859}, {"text": "even went to the g seven his big contribution\nwas bringing Melania who gotten media attention", "start": 257.129, "duration": 6.32}, {"text": "for kissing Emmanuel Macron for suggesting\nRussia be allowed back into the [inaudible],", "start": 263.449, "duration": 4.881}, {"text": "which we'll talk about a little bit later.", "start": 268.33, "duration": 2.209}, {"text": "Trump did nothing else. Notable in the positive\nsense, right? Why do these Sissy Europeans", "start": 270.539, "duration": 5.481}, {"text": "keep talking about things like climate and\nnuclear weapons in the environment and trade?", "start": 276.02, "duration": 5.929}, {"text": "What about golf scores and moral lago? Trump\nshould really just stop going and I hate to", "start": 281.949, "duration": 5.111}, {"text": "say it because the u s not being a participant\nshort term is a very, very bad thing, but", "start": 287.06, "duration": 6.051}, {"text": "my thought is this guy is adding nothing and\nhe's just embarrassing us. Maybe the next", "start": 293.111, "duration": 4.368}, {"text": "president can start showing up and actually\nparticipating in more of a productive and", "start": 297.479, "duration": 4.261}, {"text": "respectable way. I believe that we are actually\nat that point were Trump just shouldn't even", "start": 301.74, "duration": 4.34}, {"text": "go to this stuff. Let me know if you agree.\nDisagree with me. I'm on Twitter at d pacman.", "start": 306.08, "duration": 4.35}, {"text": "The show is on twitter@davidpakmanshowandofcoursewearenowontwitchattwitch.tv", "start": 310.43, "duration": 6.18}]