[{"text": "When it comes to controlling your microcontroller project wirelessly", "start": 0.76, "duration": 3.32}, {"text": "Then Bluetooth is nowadays an easy to implement option", "start": 4.64, "duration": 3.48}, {"text": "It is so easy to do that, I even created a Bluetooth firework igniter project and", "start": 8.8, "duration": 5.12}, {"text": "a standalone video about the HC-05 Bluetooth module in the past.", "start": 14.44, "duration": 4.84}, {"text": "If you don't remember this board then let me say that it can be bought for just two dollars", "start": 20.16, "duration": 4.92}, {"text": "can be connected to your favorite microcontroller through a simple serial RX and TX connection", "start": 25.08, "duration": 6.28}, {"text": "and basically sends over all the text you sent to it from your phone to the Arduino and also the other way around", "start": 31.72, "duration": 6.84}, {"text": "this way you can edit your Arduino code in a way that it reacts to certain code words and", "start": 39.32, "duration": 5.2}, {"text": "Just like that in round 3 minutes, you successfully created a Bluetooth control project.", "start": 44.859, "duration": 5.51}, {"text": "Pretty awesome, I would say.", "start": 51.129, "duration": 1.651}, {"text": "But as time passed other versions of this Bluetooth board got created. Which leads me to this HM-10 board", "start": 52.78, "duration": 7.24}, {"text": "Which is super cheap as well, but unlike its predecessor is not built around a Bluetooth 2.0 IC", "start": 60.02, "duration": 6.66}, {"text": "but around the CC2541 IC. Which features Bluetooth 4.0", "start": 66.72, "duration": 5.56}, {"text": "and BLE aka Bluetooth Low Energy", "start": 72.76, "duration": 3.0}, {"text": "But what are the practical differences between those two Bluetooth boards and is an upgrade to bluetooth", "start": 76.28, "duration": 6.28}, {"text": "4.0. Really worth it?", "start": 82.81, "duration": 2.0}, {"text": "Let's find out", "start": 85.12, "duration": 2.0}, {"text": "This video is sponsored by JLC PCB one fact about them", "start": 98.53, "duration": 4.88}, {"text": "JLC PCB manufactures quick-turn prototypes and small", "start": 103.8, "duration": 4.16}, {"text": "/medium quality PCBs in four factories for about 10 years", "start": 108.48, "duration": 3.96}, {"text": "Upload your Gerber files to order high quality PCBs for low prices.", "start": 113.2, "duration": 4.24}, {"text": "Now for a proper comparison let's start over with the HC-05 board.", "start": 119.4, "duration": 4.72}, {"text": "To use it we have to connect its 5 volt pin to 5 volts, its ground pin to ground", "start": 125.08, "duration": 5.16}, {"text": "Its TX pin to pin 8 and it's RX pin to a 1 kilo ohm/2 kilo ohm", "start": 130.6, "duration": 6.32}, {"text": "voltage divider which connects to pin 9 of the Aduino.", "start": 136.92, "duration": 3.56}, {"text": "This way we convert the 4.5 volts, voltage levels of the Arduino to 3 volts voltage levels", "start": 141.19, "duration": 6.709}, {"text": "Which are compatible with the HC-05 boards.", "start": 148.21, "duration": 3.439}, {"text": "For the software we only need a simple sketch that uses pin 8 and 9 as serial communication pins.", "start": 152.38, "duration": 6.64}, {"text": "In order to forward all data we enter through the serial monitor", "start": 159.16, "duration": 3.76}, {"text": "while also outputting sent data from the module through the serial monitor", "start": 163.56, "duration": 4.04}, {"text": "So after uploading the codes it was time for the smartphone part.", "start": 168.76, "duration": 4.18}, {"text": "There I installed the  application", "start": 173.7, "duration": 2.0}, {"text": "Serial Bluetooth Terminal because it's interface is very well and intuitive designed", "start": 176.02, "duration": 5.44}, {"text": "and best of all it functions with Bluetooth classic and Bluetooth low-energy devices.", "start": 181.8, "duration": 5.02}, {"text": "That means after pairing with the HC-05 board with the pairing code 1 2 3 4", "start": 187.72, "duration": 6.4}, {"text": "and connecting to it through the app", "start": 194.48, "duration": 1.92}, {"text": "I can send over ASCII text, which gets presented through the serial monitor.", "start": 196.96, "duration": 4.04}, {"text": "Which obviously also works the other way around", "start": 201.44, "duration": 3.24}, {"text": "and just like I described it before this way I can let the microcontroller react to different code words.", "start": 205.28, "duration": 6.04}, {"text": "And thus create all sorts of different projects.", "start": 211.64, "duration": 2.88}, {"text": "And if we want to upgrade the HC-05 boards to the HM-10 board then all we must do is to simply replace it.", "start": 215.08, "duration": 7.96}, {"text": "Since the pinout of the two breakout ports is exactly the same.", "start": 223.44, "duration": 3.6}, {"text": "Now of course you will need to pair with the new BLE device called MLT-BT05", "start": 227.88, "duration": 5.76}, {"text": "with the pairing code 1 2 3 4 5 6", "start": 234.01, "duration": 2.75}, {"text": "But afterwards it works exactly the same way as the old Bluetooth boards", "start": 237.34, "duration": 4.55}, {"text": "So at this point you might be asking yourself what's the point then?", "start": 242.68, "duration": 3.76}, {"text": "but as soon as I connect a multimeter in series to the 5 volt power", "start": 246.52, "duration": 4.24}, {"text": "connection of the board we can see why this technology is called low energy", "start": 251.019, "duration": 4.97}, {"text": "When the Bluetooth boards is not paired with device", "start": 256.52, "duration": 2.76}, {"text": "It draws around 9 milliamps", "start": 259.4, "duration": 2.64}, {"text": "and during sending or receiving data. It draws  around 9.1 milliamps", "start": 262.32, "duration": 4.64}, {"text": "That is not really a low power yet if we consider that the old", "start": 267.68, "duration": 4.28}, {"text": "HC-05 boards draws around 20 milliamps unpaired", "start": 272.12, "duration": 3.84}, {"text": "Around 19 milliamps while sending or receiving and drops down to only 2 milliamps after entering its low power modes", "start": 276.6, "duration": 7.68}, {"text": "after five seconds of doing nothing", "start": 284.68, "duration": 2.0}, {"text": "But what we have not considered yet are all the available AT commands the HM-10 offers.", "start": 287.32, "duration": 6.04}, {"text": "There we can find the AT sleep commands,  which like the name implies puts the board into a sleep mode.", "start": 294.08, "duration": 6.44}, {"text": "Where it only draws around 120 micro amps,", "start": 300.76, "duration": 3.4}, {"text": "which is pretty low power and should be able to run off a coin cell for quite a while", "start": 304.92, "duration": 5.04}, {"text": "Those AT commands might only work when the board is not paired with your phone", "start": 310.64, "duration": 4.48}, {"text": "But it is still a low-power solution for projects that only need to send data occasionally", "start": 315.76, "duration": 5.6}, {"text": "Such AT commands do  also exist for the older", "start": 322.28, "duration": 3.08}, {"text": "HC-05 board", "start": 325.96, "duration": 1.44}, {"text": "Which can be used for example, turn one Bluetooth board into master device and the other into a slave device", "start": 327.4, "duration": 6.86}, {"text": "So that they can communicate with one another", "start": 334.96, "duration": 2.8}, {"text": "Which also does work with the HM-10 boards, but you cannot mix between the two Bluetooth versions.", "start": 338.04, "duration": 6.32}, {"text": "Also keep in mind that you must hold the push button while powering up the HC-05 board to enter this AT mode.", "start": 345.36, "duration": 7.68}, {"text": "But I'm getting off topic here", "start": 353.5, "duration": 2.0}, {"text": "right now we know that the BLE board can manually enter asleep modes and can get woken up by either connecting to it", "start": 355.64, "duration": 7.56}, {"text": "or sending along text to it through the serial monitor", "start": 363.2, "duration": 3.64}, {"text": "What also seems possible is to activate an auto sleep mode through the AT command set.", "start": 367.56, "duration": 5.44}, {"text": "But after recalling all available ones through AT help, it seems like this command is missing from my board.", "start": 373.28, "duration": 7.4}, {"text": "The reason is probably my board version", "start": 381.52, "duration": 2.4}, {"text": "Which after doing a bit of research seems to be a copy of a copy and thus misses this function", "start": 383.96, "duration": 6.32}, {"text": "So always be careful what you buy.", "start": 390.55, "duration": 2.179}, {"text": "For the last tests I edited the basic communication sketch", "start": 393.7, "duration": 4.01}, {"text": "So that it sends a response to the phone to measure the time difference between sending and receiving", "start": 398.04, "duration": 5.28}, {"text": "Afterwards I sent data from all around my apartment with different distances and", "start": 404.88, "duration": 4.84}, {"text": "measured the ping for both Bluetooth 2.0 and 4.0", "start": 410.08, "duration": 4.16}, {"text": "And concluded that both versions work flawlessly no matter the distance and offered a similar ping", "start": 414.64, "duration": 6.48}, {"text": "The last mentionable difference for me was that Bluetooth 4.0. does pair a bit faster with the phone than Bluetooth 2.0", "start": 421.88, "duration": 7.52}, {"text": "But overall when it comes to simple microcontroller data transfer projects", "start": 429.92, "duration": 4.8}, {"text": "I have to say that when you do not care about power. Then the upgrade is really not worth it at first sight.", "start": 434.72, "duration": 7.2}, {"text": "Of course when we dig deeper, then Bluetooth 4.0 offers more security", "start": 442.64, "duration": 4.88}, {"text": "better error correction and communicates faster", "start": 447.84, "duration": 2.84}, {"text": "But when it comes to simple Arduino Bluetooth projects then the difference is pretty insignificant", "start": 450.82, "duration": 5.39}, {"text": "but feel free to let me know your opinion in the comment section below", "start": 457.36, "duration": 4.01}, {"text": "As always thanks for watching. If you enjoyed the video then don't forget to like share and subscribe", "start": 462.12, "duration": 5.88}, {"text": "Stay creative, and I will see you next time!", "start": 468.72, "duration": 3.68}]