[{"text": "Today's video is sponsored by Knights Chronicle. Nice Chronicle is an anime inspired RPG available on the iOS and Android. Yes", "start": 0.03, "duration": 6.72}, {"text": "It's a mobile game played anywhere play while you're sitting player while you're walking play it when you're on the toilet, dude", "start": 6.75, "duration": 5.58}, {"text": "What the heck for a mobile game?", "start": 12.33, "duration": 1.29}, {"text": "I was actually really impressed bhai's combat system which had a surprising amount of depth with satisfying", "start": 13.62, "duration": 4.23}, {"text": "Animations and that includes over a hundred heroes to choose from voice by actors", "start": 17.949, "duration": 3.53}, {"text": "You're likely very familiar with from anime", "start": 21.48, "duration": 1.889}, {"text": "like Yuki Kaji playing Theo again a psycho duckling Leona", "start": 23.369, "duration": 3.33}, {"text": "Tomokazu sugita playing Marduk and many many more which can find by going through the codex", "start": 26.98, "duration": 4.61}, {"text": "Characters are constantly being added but it also has multiplayer, too", "start": 31.75, "duration": 3.139}, {"text": "So you can team up in PvE or fuck each other up in", "start": 34.89, "duration": 2.849}, {"text": "PvP links in the description below to download it on whatever phone you have. And with that said let's get on with the video", "start": 37.899, "duration": 6.59}, {"text": "Hey guys and welcome to summer 2018 anime in a nutshell if this is your first time here, we're gonna be watching summer anime", "start": 49.37, "duration": 6.169}, {"text": "It's gonna be awesome. It's gonna be high every new season we come in with high hopes and positivity", "start": 55.54, "duration": 4.47}, {"text": "Hey guys welcome to summer 2018 anime in a nutshell, this is your first time here just", "start": 64.13, "duration": 5.0}, {"text": "Just get out where you can it's not it's not fucking worth it", "start": 73.61, "duration": 2.209}, {"text": "So brooding guy wakes up on an island and he's from the future", "start": 85.99, "duration": 2.779}, {"text": "But he can't remember anything and it's a mystery because he has to do", "start": 88.78, "duration": 3.199}, {"text": "something to prevent", "start": 92.89, "duration": 2.0}, {"text": "Something and there's a bunch of lollies involved. What is this shitty? Donnie Darko?", "start": 94.9, "duration": 4.58}, {"text": "FBI registry edition. Look I'm all for setting up a time travel mystery, but it's painfully obvious", "start": 100.39, "duration": 4.67}, {"text": "Oh, this is just a mediocre adaptation to a visual novel", "start": 105.06, "duration": 2.909}, {"text": "Look, even this police officer could give less shits about the protagonists plot points. So what are you in for today?", "start": 107.98, "duration": 5.9}, {"text": "Uh, I woke up with a girl on my crotch. Mm-hmm. Oh, and I'm from the future anything else", "start": 113.88, "duration": 5.25}, {"text": "Nautical", "start": 122.53, "duration": 2.0}, {"text": "Okay, well you seem like a mentally stable man who could be no threat to society here's your stuff you're free to go", "start": 126.58, "duration": 4.639}, {"text": "This is it. It's our time boys. It's actual Yuri on land", "start": 131.25, "duration": 3.63}, {"text": "So this seems like some cute girls doing ballet or performing arts school with some Yuri bait. I don't know", "start": 134.89, "duration": 4.85}, {"text": "It looks nice, but it seems pretty standard. Wait. Wait, what wait, that's they're fighting now", "start": 139.74, "duration": 4.199}, {"text": "What what why they fight this just part of the stage show", "start": 143.94, "duration": 2.429}, {"text": "wait what what is going on", "start": 146.369, "duration": 1.931}, {"text": "(in the background) oh my god she pushed her off", "start": 148.3, "duration": 2.0}, {"text": "She's free falling to her death is that a talking giraffe, why is there a talking giraffe? Girl I think you're tripping balls", "start": 150.3, "duration": 5.16}, {"text": "Shut up random talking giraffe! your tripping balls", "start": 156.12, "duration": 2.82}, {"text": "Now she's joining in oh, oh, whoa", "start": 160.42, "duration": 2.64}, {"text": "I have no idea what I watched, but it was awesome. I think", "start": 163.72, "duration": 4.82}, {"text": "Man, this guy really loves falling from high places", "start": 169.39, "duration": 2.12}, {"text": "Didn't you one of the high selling points of anime and not to be too simplistic?", "start": 171.51, "duration": 4.679}, {"text": "Is that the the Japanese creators treat their audiences as though they have brains?", "start": 176.38, "duration": 6.44}, {"text": "I want you to make a disgusted face and show me your underwear", "start": 182.86, "duration": 4.279}, {"text": "Most parents always talk about how proud they are of their children, but in some instances that's not the case", "start": 190.65, "duration": 5.269}, {"text": "Hi mom", "start": 199.44, "duration": 2.0}, {"text": "I", "start": 202.8, "duration": 1.17}, {"text": "Think I found a religion I can finally get behind. Sometimes I ask myself", "start": 203.97, "duration": 3.74}, {"text": "Is there a line that needs to be drawn between the excitement of discovering a very specific new kink people will find you weird for?", "start": 208.08, "duration": 6.919}, {"text": "and", "start": 215.0, "duration": 0.79}, {"text": "Exceeding no limits of disappointment if your parents found out what you are really like", "start": 215.79, "duration": 4.369}, {"text": "I'm I'm sorry. Mom. I made up my mind a long time ago. Oh, yeah", "start": 221.52, "duration": 3.41}, {"text": "She's still falling. There are two types of sports anime", "start": 225.6, "duration": 3.979}, {"text": "firstly theres", "start": 230.24, "duration": 1.44}, {"text": "SPOORTS!!!", "start": 231.98, "duration": 1.98}, {"text": "Bro you watching some SPORTS!!", "start": 233.97, "duration": 2.21}, {"text": "their sports", "start": 237.06, "duration": 2.0}, {"text": "Yeah, we watch anime for the sports", "start": 239.34, "duration": 2.93}, {"text": "So let me break that down for you on one hand", "start": 243.0, "duration": 2.3}, {"text": "You have a badminton anime with some of the most intense and well directed sports", "start": 245.3, "duration": 3.24}, {"text": "choreography right off the bat if this opening match doesn't draw you in then", "start": 248.73, "duration": 4.25}, {"text": "The amount of sweat coming off. These girls will fuck me. That's a lot of sweat man", "start": 253.35, "duration": 5.509}, {"text": "We're just which is on a fucking roll today, aren't we my only issue so far is that it seems a bit dramatic", "start": 258.859, "duration": 4.68}, {"text": "Look, I love drama in sports anime", "start": 263.94, "duration": 2.33}, {"text": "But geez at least Lube me up before forcing it all in it's all a bit heavy-handed at the moment", "start": 266.27, "duration": 5.789}, {"text": "I mean check out this unedited scene where one of the girls sees the culprits who murdered her entire family years ago", "start": 272.06, "duration": 5.97}, {"text": "Damn. so dramatic", "start": 281.2, "duration": 7.2}, {"text": "Oh", "start": 291.12, "duration": 2.0}, {"text": "No way, sorry, I I got confused", "start": 294.0, "duration": 2.48}, {"text": "That was just when she saw someone who beat her a badminton one time and on the other side, we have dead or alive extreme beachvollyball", "start": 296.48, "duration": 6.92}, {"text": "Anime edition. I don't really have anything else to say. It's summer people. Just embrace it", "start": 304.56, "duration": 5.359}, {"text": "You know, I never understood this show don't tell philosophy with film media like if we're adapting novels", "start": 309.919, "duration": 5.519}, {"text": "why would you want to watch the anime adapt the novel when you could just sit there and", "start": 315.439, "duration": 4.92}, {"text": "Read it like the heelflip actually intended now, some of you may look at this show about a gamer transported to a fantasy world", "start": 320.729, "duration": 6.47}, {"text": "That's based on this game where he far-out levels everyone and as girls tripping over his feets and it's it's a fantasy world", "start": 327.199, "duration": 6.72}, {"text": "but it does have some original ideas in it like", "start": 334.8, "duration": 2.809}, {"text": "Well, this one has a girl named RAM, nope better I forgot about Reiser", "start": 339.99, "duration": 5.149}, {"text": "You know, it doesn't really matter if it's similar because at least every ISA guy has their own unique spells and everything", "start": 346.02, "duration": 5.66}, {"text": "Okay, many of you may be thinking how can you even be original in the Issei", "start": 358.85, "duration": 3.649}, {"text": "ki,genre, anymore when every idea has been done", "start": 362.5, "duration": 2.4}, {"text": "But the master of Ragnarok and lesser of I in Josh shows us that you can incorporate", "start": 364.9, "duration": 4.019}, {"text": "Wacky ideas that we just haven't seen before in the genre because yeah, it's a nice acai. Yeah. It's another power fantasy", "start": 369.17, "duration": 6.739}, {"text": "Yeah, he has a harem posse surrounding him but get this", "start": 375.91, "duration": 3.809}, {"text": "This time the protagonist", "start": 380.45, "duration": 2.239}, {"text": "has a", "start": 383.51, "duration": 2.0}, {"text": "smartphone", "start": 385.52, "duration": 2.0}, {"text": "Smart yeah, yeah", "start": 387.59, "duration": 1.7}, {"text": "Yeah, something something's sexy men something something three seasons a movie and still no nipples something something keep it in your pants girls", "start": 389.29, "duration": 7.2}, {"text": "But it should be illegal for water to look this good. I mean, this is just setting unrealistic expectations for every body of water", "start": 396.53, "duration": 7.55}, {"text": "I now see in the future why can't you look as beautiful", "start": 404.08, "duration": 3.839}, {"text": "Girl you're in the wrong show, but free eight the only show about diving this season as we also have Grand blue", "start": 413.66, "duration": 6.829}, {"text": "Which is definitely a show about diving and not people getting shit-faced drunk, but no judgments here", "start": 421.52, "duration": 5.539}, {"text": "I mean, this is genuinely funny and I think it was about time Japan embrace the frat boy college party comedy genre", "start": 427.06, "duration": 5.25}, {"text": "But damn there is a lot of naked men here. I know we have to impress the girls", "start": 432.38, "duration": 3.77}, {"text": "But when are we gonna get some good old fashioned fanservice?", "start": 436.15, "duration": 3.119}, {"text": "Son of a bitch", "start": 443.6, "duration": 2.0}, {"text": "Well, we've done it guys we finally made a waifu out of our blood congratulations", "start": 447.8, "duration": 5.69}, {"text": "I mean over the Sun we were searching for best girl when she was in us all along we bleed best girl", "start": 457.09, "duration": 5.01}, {"text": "We donates best girl best girl", "start": 462.31, "duration": 2.0}, {"text": "Best girl gives us aids hey I just wanted to say that you are you you look really cute today", "start": 464.78, "duration": 4.579}, {"text": "aww thanks for the compliment", "start": 469.359, "duration": 1.961}, {"text": "What I wasn't talking to you I was talking to your tampon", "start": 471.32, "duration": 3.289}, {"text": "Look, I know this has meant to be a fun edutainment sure about the inner workings of our body", "start": 474.61, "duration": 4.17}, {"text": "But I just I just can't with a show I come out with more questions than I start with and I need answers", "start": 478.78, "duration": 4.5}, {"text": "How can red blood cells blush? Yeah platelets are cute and all but there's a reason in society", "start": 483.31, "duration": 3.989}, {"text": "We don't trust important construction work too fucking toddlers", "start": 487.3, "duration": 3.42}, {"text": "Mitochondria do is that like important for the cell or something when we get to the sperm episode are they just gonna be playing fortnite?", "start": 490.88, "duration": 6.44}, {"text": "How can blood bleed you you make up the blood? How each such what is happening, but you know what?", "start": 497.5, "duration": 4.58}, {"text": "This means right are we finally gonna get the one and only waifu this community truly deserves", "start": 502.09, "duration": 5.429}, {"text": "Cancer chan. Hey, look, it's attack on titan. Season 3. yaaay", "start": 508.54, "duration": 3.48}, {"text": "Aren't we all excited. I mean its attack on Titan. We're still hyped right people were still hyped over this", "start": 513.04, "duration": 5.28}, {"text": "I mean, it's it's attack on titan. Okay , let's say let's just play the opening you'll get you're gonna get hyped over the opening", "start": 518.32, "duration": 5.339}, {"text": "Alright, let's just yeah. Yeah, this is this is this is getting you high try this this is working", "start": 523.659, "duration": 5.16}, {"text": "Margarita's your hyped right?", "start": 530.24, "duration": 2.09}, {"text": "Bakugo's mom", "start": 538.58, "duration": 2.0}, {"text": "Look it's simple really most people don't understand that if you're being chased by an edgy serial killer in order to conquer edge you must", "start": 542.69, "duration": 7.07}, {"text": "first become edge and", "start": 549.76, "duration": 1.99}, {"text": "I think this first episode", "start": 551.75, "duration": 1.35}, {"text": "title really captures the spirit of that now this is exactly what I needed after to clean my palates just a nice bubbly slice of", "start": 553.1, "duration": 6.619}, {"text": "Life of a cute girl taking care of a loli and you know, it's refreshing to see your main character like this", "start": 559.72, "duration": 4.47}, {"text": "I mean she's young but she's trying really hard to be", "start": 564.22, "duration": 2.7}, {"text": "Responsible and I like her design as well because I think she's cute with her pink hair and oh god", "start": 567.02, "duration": 5.059}, {"text": "She's fucking insane isn't she", "start": 572.08, "duration": 2.0}, {"text": "Pink haired one", "start": 575.65, "duration": 1.38}, {"text": "Why's it always the fucking pink haired one? Oh, hey. Look, it's Diet. Nichijou. Oh, hey look its diet. Yu-gi-oh hair", "start": 577.03, "duration": 7.459}, {"text": "oh, hey look its diet every Idol show that's ever existed and", "start": 584.61, "duration": 3.9}, {"text": "Now, I wish I was back at Angels of Death again CGI mecha", "start": 589.3, "duration": 4.28}, {"text": "furries", "start": 594.46, "duration": 1.11}, {"text": "The three genders look it's simple really most people don't understand that when Humanity is under attack and all. Hope is lost", "start": 595.57, "duration": 6.289}, {"text": "In order to conquer a bad CGT. You must first become bad see, all right", "start": 602.38, "duration": 5.45}, {"text": "I'm not even gonna pretend I knew what was going on, but I think that was the point of it", "start": 607.83, "duration": 4.83}, {"text": "I've heard very good things about this writer", "start": 612.66, "duration": 1.71}, {"text": "So I will stay on but at least it was nice enough to let us know it was a wild ride from the get-go", "start": 614.37, "duration": 4.29}, {"text": "Instead of just slapping in our face right at the end", "start": 618.79, "duration": 2.509}, {"text": "we have a fucking doorbell, you know, I don't know why I was expecting for a show with the title bananafish swim free little fishy", "start": 641.26, "duration": 6.979}, {"text": "But I sure as hell wasn't expecting a stylish old-school gangster thriller set in New York. I was immediately gripped", "start": 648.25, "duration": 5.6}, {"text": "Thanks to his visual designs grounded action direction", "start": 653.85, "duration": 2.579}, {"text": "It feels less like an anime and more like an 80s action", "start": 656.43, "duration": 2.19}, {"text": "Thriller probably because that was when the source material was made it was certainly more homoerotic than I expected", "start": 658.69, "duration": 5.539}, {"text": "I mean the protagonist is so sexy", "start": 664.23, "duration": 1.78}, {"text": "Everyone seems to be out for his dick even the villains are like god, I hate that hero. Yeah, me too", "start": 666.01, "duration": 5.21}, {"text": "I bet his dick is too big", "start": 671.22, "duration": 1.78}, {"text": "what was that? I bet he's like really good at sex. If I were to give a blind recommendation based on the first few episodes", "start": 673.0, "duration": 5.239}, {"text": "This would be it. I mean it's got action", "start": 678.43, "duration": 2.96}, {"text": "A cast that doesn't seem like your cookie cutter anime tropes and even some yaoi for you fujo's out there. Yep", "start": 681.39, "duration": 4.559}, {"text": "I don't know about you, but I think this summer season has finally", "start": 685.98, "duration": 2.88}, {"text": "landed", "start": 689.38, "duration": 2.0}, {"text": "I believe i can fly", "start": 693.16, "duration": 2.039}, {"text": "Hey guys, hope you enjoyed that video. Thank you again to knights Chronicle for sponsoring", "start": 697.16, "duration": 4.189}, {"text": "This season's summer rundown if any of what I showed you in the beginning of this video", "start": 701.35, "duration": 3.57}, {"text": "Interested you then all the links are in the description below and you can download it on whatever", "start": 705.02, "duration": 3.589}, {"text": "Mobile device you have available for those you who also miss my Murray's Janvrin video", "start": 708.68, "duration": 3.859}, {"text": "I release a motherfucking tea mug Limited Edition for those of you who still remember my first dead meme", "start": 712.54, "duration": 6.63}, {"text": "so if you do want one of these limited edition mugs get them while you can because you only have a week left if you", "start": 719.21, "duration": 5.299}, {"text": "Want to see my other seasonal stuff then click on this video here and you know", "start": 724.51, "duration": 2.969}, {"text": "Like subscribe all that fucking usual shit if you want to but anyways, that's it for me", "start": 727.48, "duration": 5.4}, {"text": "I've been Gigguk and I will see you all next time", "start": 732.91, "duration": 3.149}]