[{"text": "Hey everyone!", "start": 0.619, "duration": 0.891}, {"text": "So I've wanted to do the assumptions tag for a while now because there is just so much material to keep it light ish.", "start": 1.51, "duration": 5.91}, {"text": "I'll probably break this into installments and sprinkle in some silly misconceptions along with the heavier stuff.", "start": 7.42, "duration": 5.58}, {"text": "Assumption 1: I'm short. I don't know,", "start": 13.0, "duration": 2.0}, {"text": "I'm 5 7, you can decide if that's short or tall.", "start": 15.0, "duration": 2.86}, {"text": "Usually though when I meet people from the internet for the first time they say", "start": 17.929, "duration": 3.5}, {"text": "Whoa you are so much taller than I expected", "start": 21.429, "duration": 2.271}, {"text": "So, yeah", "start": 24.5, "duration": 0.769}, {"text": "If you meet me expect taller than you're ready for.", "start": 25.269, "duration": 3.311}, {"text": "Assumption 2:", "start": 28.58, "duration": 0.78}, {"text": "I experienced the same dysphoria as other non-binary people because non-binary folks all experienced the same dysphoria", "start": 29.36, "duration": 6.74}, {"text": "No", "start": 36.1, "duration": 0.56}, {"text": "This rebuttal is gonna be long. Buckle up", "start": 36.66, "duration": 2.26}, {"text": "There are about a million and a half thousand quatrillion ways to be non-binary", "start": 39.44, "duration": 4.48}, {"text": "and everyone's relationship with dysphoria is unique to them. For me, I've struggled with my hair, chest, hips and a ton of social things", "start": 43.92, "duration": 8.14}, {"text": "Let's talk about hair because that dysphoria is completely gone.", "start": 52.06, "duration": 2.74}, {"text": "Before I cut my hair, I was constantly and debilitatingly", "start": 54.8, "duration": 3.34}, {"text": "fixated/anxious about my appearance because I could never", "start": 58.14, "duration": 3.24}, {"text": "recognize myself in the mirror and I didn't even realize that was what was happening at the time", "start": 61.55, "duration": 4.129}, {"text": "I just knew I didn't like what I was seeing.", "start": 65.68, "duration": 2.26}, {"text": "Back then I used words like ugly, awkward, unattractive and other descriptors often associated with typical insecurities rather than dysphoria", "start": 67.94, "duration": 7.78}, {"text": "Because that was the language available to me.", "start": 75.76, "duration": 2.44}, {"text": "Now I understand that I didn't recognize myself because I felt my hair made me look like a woman,", "start": 78.2, "duration": 5.0}, {"text": "and I'm not a woman.", "start": 83.44, "duration": 1.2}, {"text": "At that point in my life I had never heard of an afab person looking at themselves and feeling a disconnect mismatched negative confusion", "start": 84.64, "duration": 6.539}, {"text": "or thinking their appearance literally looked wrong before, unless they were a trans guy and I'm not a trans guy", "start": 91.18, "duration": 6.4}, {"text": "I also wasn't sure what it felt like to look right. That's why cutting my hair was so scary", "start": 97.58, "duration": 3.59}, {"text": "What if I did it and felt no relief?", "start": 101.17, "duration": 2.23}, {"text": "A lot of trans men feel relief when they cut their hair", "start": 103.4, "duration": 2.2}, {"text": "But again, not a trans man.", "start": 105.6, "duration": 2.0}, {"text": "Feminine gals get cute pixie cuts", "start": 107.6, "duration": 1.7}, {"text": "But that definitely wasn't me either and there's this women who go short for a more masculine look", "start": 109.3, "duration": 4.94}, {"text": "But I didn't want to be a masculine woman.  Basically most of my confusion and inability to name my gender dysphoria right away", "start": 114.249, "duration": 6.569}, {"text": "Came from having minimal exposure to non-binary representations", "start": 120.82, "duration": 2.98}, {"text": "and/or healthy role models. What if I cut my hair and still felt this ugly weirdness forever?", "start": 123.8, "duration": 4.86}, {"text": "Thankfully that didn't happen. I chopped it off and since then there have certainly been days", "start": 128.84, "duration": 3.91}, {"text": "I felt like I looked hideous and I'm hecka self-conscious but that disconnect or my hair is foreign to me feeling was gone", "start": 132.75, "duration": 7.409}, {"text": "Now when I feel not cute at least it still looks like me.", "start": 140.16, "duration": 3.02}, {"text": "Not who is that person in the selfie I just took? I litterally don't understand.", "start": 143.18, "duration": 4.0}, {"text": "Cutting my hair was the first time I drastically felt dysphoria being relieved", "start": 147.18, "duration": 3.26}, {"text": "So it was incredibly profound.", "start": 150.44, "duration": 1.92}, {"text": "For me, it cemented understanding the difference between being dysphoric about something and not liking a personal feature", "start": 152.36, "duration": 5.66}, {"text": "unrelated to dysphoria.", "start": 158.02, "duration": 1.22}, {"text": "Because I don't just blame everything I'm not into on dysphoria.", "start": 159.24, "duration": 3.12}, {"text": "Although that is another assumption some people have", "start": 162.36, "duration": 2.58}, {"text": "For example:", "start": 164.94, "duration": 0.92}, {"text": "(content warning discussion about menstruation until)", "start": 165.86, "duration": 2.12}, {"text": "There's my period.", "start": 168.5, "duration": 0.68}, {"text": "While I dislike my period I'm not disphoric about it.", "start": 169.18, "duration": 2.84}, {"text": "Which brings us to this video sponsor: Clue.", "start": 172.02, "duration": 2.46}, {"text": "The clue app is a free period tracking app that is available for iPhone, iPad, Android phones and tablets.", "start": 174.48, "duration": 4.979}, {"text": "It's not a contraceptive, if you want to avoid pregnancy utilize birth control.", "start": 179.46, "duration": 3.42}, {"text": "I use Clue because I find it helpful for identifying patterns that occur in my body.", "start": 182.88, "duration": 3.52}, {"text": "For instance, I learned that I break out a day or two before my cycle", "start": 186.4, "duration": 3.08}, {"text": "Also the third day of my period is the worst for back aches", "start": 189.48, "duration": 2.52}, {"text": "So I make sure I'm armed with my doll and heating packs. Also, I can set reminders for stuff like that", "start": 192.0, "duration": 4.649}, {"text": "So I never forget and I'm always prepared.", "start": 196.649, "duration": 2.131}, {"text": "Look at it. You're such a cat!", "start": 198.78, "duration": 2.0}, {"text": "I love you cat.", "start": 201.38, "duration": 0.96}, {"text": "And while all those things are neat,", "start": 202.34, "duration": 1.74}, {"text": "the reason I really like Clue is because they work so hard at being super inclusive", "start": 204.08, "duration": 4.7}, {"text": "the app doesn't assume anything about your sexuality, gender,", "start": 208.8, "duration": 3.04}, {"text": "and it actively uses gender-neutral language and design.", "start": 211.84, "duration": 2.84}, {"text": "This means it's not all pink and butterflies and", "start": 214.68, "duration": 1.98}, {"text": "you can turn things off like the ovulation or fertility windows if they make you uncomfortable to see.", "start": 216.66, "duration": 4.48}, {"text": "This makes clew a great choice for trans and non-binary people who want to track their cycle and get more info on their body", "start": 221.14, "duration": 5.52}, {"text": "without feeling misgendered the whole time.", "start": 226.66, "duration": 1.72}, {"text": "Plus Clue is always open to feedback", "start": 228.38, "duration": 1.36}, {"text": "If you ever have a suggestion for how the app could become even more comfortable for all kinds of folks.", "start": 229.74, "duration": 4.9}, {"text": "And, on top of all of that, their website is full of useful resources on", "start": 234.64, "duration": 3.7}, {"text": "safer sex, coping with gender dysphoria and how to find LGBTQ+ friendly health care", "start": 238.34, "duration": 4.82}, {"text": "Rad, right?", "start": 243.16, "duration": 0.82}, {"text": "Like actually incredibly cool and necessary", "start": 243.98, "duration": 2.52}, {"text": "It makes cycle stuff accessible for people beyond cis women", "start": 246.5, "duration": 3.14}, {"text": "which is so dope!", "start": 249.66, "duration": 0.96}, {"text": "Download Clue for free by clicking the link in the description or search period tracker in the app store and choose Clue.", "start": 250.62, "duration": 5.14}, {"text": "All right back to feelings on my Red Scare. I don't dig it. I get shitty cramps,", "start": 255.76, "duration": 4.48}, {"text": "nausea isn't fun, and I dislike spending cash money on menstrual products", "start": 260.25, "duration": 4.19}, {"text": "My monthly oil change is anything but pleasant.", "start": 264.44, "duration": 2.72}, {"text": "If I could pay to never have Shark Week again?", "start": 267.16, "duration": 1.869}, {"text": "I'd totally do it.", "start": 269.029, "duration": 0.991}, {"text": "Sign me up!", "start": 270.02, "duration": 0.84}, {"text": "All that being said my period doesn't make me feel confused, unlike myself or panicked because there's a distressing", "start": 270.86, "duration": 6.32}, {"text": "incongruence between what's happening to me and what should be happening.", "start": 277.18, "duration": 3.8}, {"text": "I don't feel less like my gender on my period.", "start": 280.98, "duration": 2.68}, {"text": "I'm still non-binary, I'm just bloated.", "start": 283.66, "duration": 2.98}, {"text": "And I'll loop this back to assumption 2: just because I'm", "start": 289.28, "duration": 2.86}, {"text": "whatever about my Crimson Tide doesn't mean that all NB people are.", "start": 292.14, "duration": 4.34}, {"text": "Some folks are very disphoric about that time of the month", "start": 296.48, "duration": 2.42}, {"text": "It's okay and valid for people to be different", "start": 298.9, "duration": 2.44}, {"text": "Also another fun on flow related fact:", "start": 301.34, "duration": 2.44}, {"text": "Several humans commented on my Lube video", "start": 303.78, "duration": 2.0}, {"text": "Link above, it's a really good video", "start": 305.78, "duration": 1.32}, {"text": "I dissolve a dildo in it", "start": 307.1, "duration": 1.56}, {"text": "And said that Lube can be a surprisingly helpful tool for inserting a menstrual cup so there's a hack for you!", "start": 315.9, "duration": 5.7}, {"text": "More things I don't like but I'm not dysphoric about.", "start": 321.6, "duration": 2.64}, {"text": "My voice.", "start": 324.24, "duration": 0.9}, {"text": "I feel connected to my voice in the way that my brain thinks my voice is my brain", "start": 325.14, "duration": 4.2}, {"text": "What?", "start": 329.58, "duration": 0.5}, {"text": "I feel connected to my voice in the way that my brain thinks that my voice is my voice.", "start": 330.08, "duration": 5.06}, {"text": "But boy, oh boy am I self-conscious about it?", "start": 335.14, "duration": 2.3}, {"text": "Whenever a video of mine finds its way outside my regular audience", "start": 337.44, "duration": 3.32}, {"text": "My voice is the first thing they go for", "start": 340.76, "duration": 2.46}, {"text": "Viciously", "start": 343.22, "duration": 0.94}, {"text": "I am aware that I sound unique, high-pitched, chipmunk-like,", "start": 344.16, "duration": 4.64}, {"text": "squeaky, expressive, annoying and grating in some people's opinions.", "start": 348.8, "duration": 4.4}, {"text": "Comments have told me to go on testosterone even if it causes me dysphoria", "start": 353.24, "duration": 4.2}, {"text": "Because my voice is a travesty and I should spare people from having to listen to it. Got it.", "start": 357.48, "duration": 4.58}, {"text": "So while I kind of wish my voice was", "start": 362.099, "duration": 2.22}, {"text": "Less polarizing,", "start": 365.76, "duration": 1.4}, {"text": "it doesn't cause me distress in relation to feeling as if it doesn't belong to me", "start": 367.16, "duration": 4.16}, {"text": "It doesn't make me feel less non-binary.", "start": 371.32, "duration": 2.26}, {"text": "Dysphoria is more than just hating your body or some feature.", "start": 373.58, "duration": 3.24}, {"text": "It's about something making you feel uncomfortable because it conflicts with your gender. At least that's what it's like for me", "start": 376.82, "duration": 6.04}, {"text": "It gets complicated when you're both insecure for non dysphoric reasons and disphoric about something simultaneously", "start": 382.86, "duration": 5.84}, {"text": "(Content warning: mentions of negative body image and body shame until)", "start": 388.72, "duration": 3.4}, {"text": "I've had personal challenges with my relationship with weight that I've been working on and will keep working on for non dysphoric reasons", "start": 392.4, "duration": 6.98}, {"text": "but also", "start": 399.38, "duration": 0.72}, {"text": "weight can make me feel dysphoric about my hips because in my head", "start": 400.1, "duration": 3.78}, {"text": "Prominent hips make me look like a woman and I'm not a woman.", "start": 403.96, "duration": 3.32}, {"text": "dysphoria and insecurities can be like a Venn diagram", "start": 407.28, "duration": 3.28}, {"text": "Some things are totally separate but overlap is possible.", "start": 410.56, "duration": 3.5}, {"text": "Side note, folks on the internet like to call people's physical insecurities \"dysmorphia\" sometimes,", "start": 414.06, "duration": 4.56}, {"text": "even though they aren't licensed psychologist doctors or therapists,", "start": 418.62, "duration": 3.0}, {"text": "which is interesting to me since BDD is an official diagnosis we shouldn't just be assigning to strangers", "start": 421.62, "duration": 6.36}, {"text": "And often involves things like obsessive compulsions", "start": 427.98, "duration": 2.28}, {"text": "Hallucinations as in perceiving or exaggerating flaws that are either non-existent or slight", "start": 430.62, "duration": 4.7}, {"text": "extreme measures and cause of clinically significant distress", "start": 435.55, "duration": 3.109}, {"text": "Body dysmorphia is not the same as an insecurity the same way dysphoria isn't.", "start": 438.92, "duration": 4.3}, {"text": "And that's my hot take on that!", "start": 443.22, "duration": 1.46}, {"text": "My cat's just been here the whole time", "start": 448.86, "duration": 1.64}, {"text": "Oow did I wake you up? Sorry. Yeah, close your eyes cover your eyes up with your paw", "start": 450.82, "duration": 4.5}, {"text": "I love you little kitty.", "start": 455.32, "duration": 1.48}, {"text": "when you're non-binary, understanding what you might be dysphoric about versus what you just don't like", "start": 456.8, "duration": 4.64}, {"text": "unrelated to dysphoria can be confusing.", "start": 461.44, "duration": 2.66}, {"text": "Or it can be easy! It's easy for some people.", "start": 464.1, "duration": 2.42}, {"text": "My personal advice, feel free to take or leave it, what works for me might not work for you,", "start": 466.52, "duration": 3.56}, {"text": "is if this stuff is really stressing you out,", "start": 470.08, "duration": 2.14}, {"text": "or you can't decide if you want to make a transitional change, especially an irreversible one, is don't rush into anything.", "start": 472.22, "duration": 6.28}, {"text": "Take your time. If you can.", "start": 478.82, "duration": 2.18}, {"text": "Give all these feelings and thoughts room to breathe and eliminate outside expectation", "start": 481.0, "duration": 4.52}, {"text": "You are not a weirdo if you decide to make a change,", "start": 485.52, "duration": 2.92}, {"text": "and you're not a disappointing not trans enough person if you decide not to.", "start": 488.44, "duration": 3.44}, {"text": "You don't have to do anything.", "start": 491.88, "duration": 2.42}, {"text": "And on the flip side, your body and yourself are yours.", "start": 494.3, "duration": 2.6}, {"text": "You have total agency to alter something about your physicality,", "start": 496.9, "duration": 3.34}, {"text": "expression or identity if you want to and there is no time line", "start": 500.26, "duration": 2.18}, {"text": "and there is no timeline you should be sticking to with any of this stuff.", "start": 502.44, "duration": 4.1}, {"text": "You are doing good as long as you're doing whatever makes you happy and healthy and keeps you safe.", "start": 506.54, "duration": 5.5}, {"text": "Try to ignore any pressure you may feel from friends, society, the medias, etc", "start": 512.04, "duration": 4.46}, {"text": "Because it's not great to be making these kinds of decisions in order to make others happy or gain their approval", "start": 516.5, "duration": 4.94}, {"text": "and approach choices slowly, thoughtfully and safely.", "start": 521.44, "duration": 3.44}, {"text": "These issues can be tough. It's okay to not know, be unsure or move gradually.", "start": 524.88, "duration": 4.42}, {"text": "You can also just sit in there not knowing that's okay", "start": 529.3, "duration": 2.14}, {"text": "You can just exist there and you don't have to hide if you're not sure either.", "start": 531.44, "duration": 2.8}, {"text": "You can tell people, say:", "start": 534.24, "duration": 1.02}, {"text": "Hey, I'm unsure!", "start": 535.26, "duration": 1.66}, {"text": "I don't know what's going on.", "start": 536.92, "duration": 1.3}, {"text": "Want to talk to me about it?", "start": 538.22, "duration": 1.52}, {"text": "There's no pressure to do something if you're not ready or not sure.", "start": 539.74, "duration": 2.36}, {"text": "It took me 27 years to get to where I am today.", "start": 542.1, "duration": 2.76}, {"text": "Assumption 4: many of you think I'm 16.", "start": 544.86, "duration": 2.24}, {"text": "I'm 27.", "start": 548.36, "duration": 0.9}, {"text": "Figuring yourself out is not a race.", "start": 549.26, "duration": 1.96}, {"text": "And if you're looking for external support, opening up to trusted, loved ones, doctors and licensed therapists can be helpful", "start": 551.22, "duration": 6.08}, {"text": "I so recommend therapy to anyone who can access it.", "start": 557.3, "duration": 3.24}, {"text": "I therapy the crap out of myself and it's nice.", "start": 560.54, "duration": 2.52}, {"text": "I also unapologetically asked my doctors nine hundred thousand questions.", "start": 563.06, "duration": 3.8}, {"text": "Yeah. I hope this pep talk helped at least one person.", "start": 566.86, "duration": 2.7}, {"text": "Assumption 5:", "start": 569.56, "duration": 1.08}, {"text": "I make up weird songs and jingles about just about everything.", "start": 570.64, "duration": 2.8}, {"text": "True!", "start": 573.44, "duration": 0.54}, {"text": "Maybe I'll insert some of Grace and I's bizarre original tunes here.", "start": 573.98, "duration": 3.06}, {"text": "Okay, what tune should we start with?", "start": 577.06, "duration": 1.52}, {"text": "I think we need to start with", "start": 578.76, "duration": 1.52}, {"text": "[I honestly have no idea what's going there I'm so sorry I dunnot know how to write that part down]", "start": 580.28, "duration": 69.32}, {"text": "That might be it. I mean it's not it, there's more, there's more but that's like five.", "start": 649.76, "duration": 4.72}, {"text": "Yeah, what do you want from us people? Five is enough! We can't give you all of our material! Yeah!", "start": 654.48, "duration": 5.14}, {"text": "Assumption 6: I like my coffee super sweet", "start": 660.14, "duration": 2.5}, {"text": "Yes and no.", "start": 662.64, "duration": 1.52}, {"text": "I do love me some obnoxious Cramer's like Butterfinger and thin mint", "start": 664.16, "duration": 3.18}, {"text": "but sometimes I find myself in the mood for a hot black cup of joe.", "start": 667.34, "duration": 3.12}, {"text": "But I usually dip a doughnut in it. Is that cheating? Does that make it sweet?", "start": 670.46, "duration": 4.16}, {"text": "Assumption 7:", "start": 674.62, "duration": 0.88}, {"text": "I make sex education vids because they are scandalous and get lots of clicks and views", "start": 675.5, "duration": 4.28}, {"text": "Actually, confession:", "start": 679.78, "duration": 1.58}, {"text": "I lose subscribers every time I post a sex ed video. Like a lot of subscribers, like 500 to a thousand subscribers", "start": 681.4, "duration": 6.9}, {"text": "But I'm not gonna stop because I'm passionate about safer sex", "start": 688.3, "duration": 3.3}, {"text": "And I think the loss is totally worth it for the information to be put out there and made accessible", "start": 691.6, "duration": 4.54}, {"text": "Yeah, alright, that's it. Leave more assumptions about me in the comments below", "start": 697.06, "duration": 3.36}, {"text": "Oof. That's a scary request", "start": 700.42, "duration": 1.94}, {"text": "Don't be too mean and I'll see you later. Okay. Bye", "start": 702.36, "duration": 2.5}, {"text": "Hey there, ho there before you go there. Don't forget to click that link", "start": 705.879, "duration": 5.179}, {"text": "The YouTube algorithm works in very strange ways a click's the best way to give Ash Hardell your praise.", "start": 712.0, "duration": 6.419}, {"text": "So hey ho before you go. Don't forget to click that link", "start": 718.43, "duration": 5.479}]