[{"text": "Hi, this is Henry, and this is the first in a series of videos about special relativity", "start": 0.76, "duration": 3.8}, {"text": "This is definitely not an academic course,", "start": 5.02, "duration": 2.06}, {"text": "but it's going to be a more in-depth and developed exploration of a single topic", "start": 7.08, "duration": 3.44}, {"text": "than a typical standalone minute physics video.", "start": 10.54, "duration": 1.98}, {"text": "I've been greatly inspired and heckled to do this by my friend Grant Sanderson of Three Blue One Brown", "start": 12.52, "duration": 5.2}, {"text": "who set the standard for this kind of thing with his excellent series", "start": 17.72, "duration": 2.92}, {"text": "series'es? on calculus and linear algebra.", "start": 20.65, "duration": 3.19}, {"text": "So, special relativity.", "start": 23.84, "duration": 1.8}, {"text": "Special relativity is one of the most popularly famous ideas in physics", "start": 25.72, "duration": 4.12}, {"text": "It's the thing that Einstein figured out about the speed of light and space and time and e equals mc-squared", "start": 29.84, "duration": 4.46}, {"text": "It changed our understanding of the universe and its core ideas are accessible in principle to anyone who understands some basic algebra and geometry", "start": 34.42, "duration": 6.98}, {"text": "You don't even need to know calculus", "start": 41.77, "duration": 1.5}, {"text": "And yet in spite of this", "start": 43.27, "duration": 1.68}, {"text": "special relativity is one of the subjects in physics that confuses the most people and in many cases turns them away from physics altogether I", "start": 44.95, "duration": 6.979}, {"text": "think in part", "start": 51.969, "duration": 0.831}, {"text": "This is because special relativity is not quite a big enough subject to ever get its own full class in physics departments you might see", "start": 52.8, "duration": 6.209}, {"text": "classical mechanics or quantum mechanics or electromagnetism or intro to general relativity on a course syllabus", "start": 59.079, "duration": 5.479}, {"text": "But it's surprisingly rare to see special relativity", "start": 64.559, "duration": 2.43}, {"text": "Even though relativity is an essential building block upon which most of the rest of modern physics depends", "start": 67.21, "duration": 4.819}, {"text": "Special relativity is typically relegated to just a few days squeezed into the beginning or end of other physics courses.", "start": 72.4, "duration": 5.659}, {"text": "However, the more important reason special relativity confuses so many people is that it's almost always introduced", "start": 78.46, "duration": 5.72}, {"text": "confusingly with lots of complicated algebraic equations with Delta X's and Delta X Prime's and square roots", "start": 84.43, "duration": 5.36}, {"text": "Which sometimes you divide by and sometimes you multiply by and all the while you're scrambling to figure out where in all this symbol logical", "start": 89.79, "duration": 5.459}, {"text": "mess they're hiding a supposedly mind-blowing insight about the fundamental nature of space and time", "start": 95.25, "duration": 4.5}, {"text": "Special relativity", "start": 101.049, "duration": 0.991}, {"text": "doesn't have to be that way.", "start": 102.04, "duration": 1.49}, {"text": "And I think the complicated explanations have only survived this long because they're how Einstein did it. But he was a professional", "start": 103.53, "duration": 5.909}, {"text": "physicist climbing an intellectual mountain up its steepest face.", "start": 109.54, "duration": 2.959}, {"text": "And I don't think that we should require everyone who learns about special relativity now to have to follow the same path Einstein did", "start": 112.5, "duration": 5.61}, {"text": "Especially not now that we have super beautiful and simple geometric ways of explaining it", "start": 118.45, "duration": 3.65}, {"text": "Essentially we figured out afterwards that there's a much easier way to climb the mountain than what Einstein did, a way that you could probably", "start": 122.71, "duration": 5.779}, {"text": "even figure out on your own, given the right prompting. And it's that", "start": 128.489, "duration": 3.55}, {"text": "fundamentally beautiful simple geometric way to understand space and time that I want you to leave with after watching this series of videos.", "start": 132.35, "duration": 6.529}, {"text": "If all goes well, hopefully you'll gain some intuition for what special relativity really is, why it works", "start": 139.1, "duration": 5.72}, {"text": "why it's right, and why all those paradoxes you've probably heard about aren't paradoxical at all.", "start": 144.92, "duration": 5.21}, {"text": "They're just easy confusions to stumble into when you're attacking things with an army of square roots", "start": 150.17, "duration": 4.639}, {"text": "This is going to require some mental effort from your end.", "start": 155.15, "duration": 2.599}, {"text": "There's a very real", "start": 157.75, "duration": 1.15}, {"text": "mathematical sense in which learning special relativity is kind of like living your entire life thinking the earth is flat", "start": 158.9, "duration": 5.0}, {"text": "And then learning that the earth is actually round. A round Earth isn't actually that complicated of a thing to picture", "start": 163.9, "duration": 5.16}, {"text": "I mean, it's just a ball", "start": 169.06, "duration": 1.36}, {"text": "But trying to get used to that idea, to really take it in and figure out how your day-to-day", "start": 170.42, "duration": 4.43}, {"text": "experiences on this flat seeming surface of the earth-- how they fit into this new round earth idea-- that would certainly take some mental effort.", "start": 174.98, "duration": 7.25}, {"text": "It is, though, a totally different kind of mental effort from plugging lots of numbers into complicated square root formulas and", "start": 182.42, "duration": 5.66}, {"text": "ultimately, much more worthwhile", "start": 188.3, "duration": 1.41}, {"text": "I mean you probably have a pretty good intuition about round Earth concepts, like what happens if you just keep walking east and", "start": 189.71, "duration": 6.949}, {"text": "what's the shape of the Earth's shadow on the moon without having to do complicated calculations in spherical polar", "start": 196.94, "duration": 5.299}, {"text": "coordinates. In fact we're gonna take this analogy to the extreme.", "start": 202.52, "duration": 3.439}, {"text": "Just like a globe is a really useful", "start": 206.15, "duration": 2.0}, {"text": "hands-on visual way to explore what it means for the earth to be round because a globe comes with roundness built-in,", "start": 208.34, "duration": 6.17}, {"text": "I've designed and had built a hands-on", "start": 214.58, "duration": 2.72}, {"text": "space-time globe that has special relativity built in.", "start": 217.64, "duration": 2.72}, {"text": "It's not quite as simple as a globe globe because special relativity is a little weirder than roundness", "start": 220.459, "duration": 5.63}, {"text": "But the thing I like about this machined aluminum space-time globe is that it's a physical", "start": 226.31, "duration": 3.71}, {"text": "manifestation of the intuition that I hope you develop for special relativity.", "start": 230.18, "duration": 3.08}, {"text": "We're going to use it to gain a hands-on understanding of the twins paradox, length contraction, and time dilation,", "start": 233.54, "duration": 5.029}, {"text": "why nothing can go faster than light, and much more. I hope to see you in the next video", "start": 238.82, "duration": 4.849}, {"text": "And while you're waiting for the next special relativity video to come out you might want to check out this video's sponsor: Brilliant.org", "start": 245.59, "duration": 6.02}, {"text": "a site full of interactive quizzes and mini courses on physics and math. As you've probably heard me say before, if you want to", "start": 251.709, "duration": 6.529}, {"text": "understand physics deeply, you really have to think through ideas and solve problems yourself and Brilliant offers a great way to do just that--", "start": 258.239, "duration": 6.36}, {"text": "either by learning a new topic, like neural networks", "start": 264.79, "duration": 2.629}, {"text": "practicing problem solving in an area you already know, like algebra or", "start": 267.79, "duration": 3.349}, {"text": "solving tricky puzzles, like this one. If you decide to sign up for", "start": 271.3, "duration": 3.679}, {"text": "premium access to all of their courses and quizzes, you can get 20% off by going to brilliant.org/minutephysics. Again,", "start": 275.08, "duration": 6.89}, {"text": "that's brilliant.org/minutephysics, which lets Brilliant know you came from here", "start": 281.97, "duration": 4.169}]