[{"text": "Dear friends followers, welcome back to my channel", "start": 0.02, "duration": 2.12}, {"text": "and to a video about the secret hidden bedrooms on many long-haul airplanes.", "start": 2.14, "duration": 5.52}, {"text": "The question: Where do pilots and flight attendants go for a nap during a long-haul flight?", "start": 7.66, "duration": 6.12}, {"text": "So don't fall asleep and let's get started!", "start": 13.78, "duration": 3.1}, {"text": "*Pilot and ATC controller interaction*", "start": 16.88, "duration": 8.74}, {"text": "This video is brought to you by airplanesticker.com", "start": 25.62, "duration": 3.2}, {"text": "Check out their website and find your favorite airplane model or airline as a suitcase sticker and order today.", "start": 28.82, "duration": 7.38}, {"text": "Watch until the end of the video for a great giveaway.", "start": 36.52, "duration": 3.52}, {"text": "Remember the last time you were in a long-distance flight you got acquainted with your seat", "start": 40.04, "duration": 4.2}, {"text": "and the flight attendant came around after takeoff serving you food and drinks.", "start": 44.24, "duration": 5.0}, {"text": "Now, you must know that with most airlines flight attendants remain at their position", "start": 49.24, "duration": 5.74}, {"text": "or service station for the entire flight.", "start": 54.98, "duration": 2.92}, {"text": "But after a couple of hours another flight attendant suddenly starts serving you food and drinks", "start": 57.9, "duration": 5.4}, {"text": "and you start questioning", "start": 63.3, "duration": 1.54}, {"text": "Where did the pretty flight attendant go serving me earlier?", "start": 65.0, "duration": 3.06}, {"text": "Now, I'm not sure if you have seen these mysterious doors on long-haul Jets.", "start": 68.06, "duration": 4.84}, {"text": "They very often come with an electric lock and no real description what's behind them.", "start": 72.9, "duration": 5.62}, {"text": "Well, these doors lead to the crew rest compartments for the flight attendants.", "start": 78.52, "duration": 5.18}, {"text": "So if you ever wonder where the flight attendant has gone,", "start": 83.7, "duration": 3.16}, {"text": "she's probably on her controlled rest in the crew compartment.", "start": 86.86, "duration": 3.84}, {"text": "Now, where are these crew compartments located?", "start": 90.7, "duration": 3.08}, {"text": "Now this very much depends on the size of the airplane and airline.", "start": 93.78, "duration": 4.46}, {"text": "Some crew compartments are below the cabin floors", "start": 98.24, "duration": 3.38}, {"text": "or above the passenger seats on more modern jets such as the Boeing Dreamliner.", "start": 101.62, "duration": 5.58}, {"text": "So if we look at this picture of the Boeing 787 at the far end of the cabin", "start": 107.2, "duration": 5.16}, {"text": "you can see the crew rest for the flight attendants which gives space for two flight attendants or more", "start": 112.36, "duration": 6.8}, {"text": "depending on the airline order. So the flight attendants use the very narrow staircase", "start": 119.16, "duration": 5.56}, {"text": "hidden behind the mysterious doors I've mentioned earlier to climb into that compartment.", "start": 124.72, "duration": 5.0}, {"text": "At the front of the fuselage just above the first class you have another crew rest area for the pilots.", "start": 130.0, "duration": 6.7}, {"text": "How are these areas equipped?", "start": 136.7, "duration": 2.38}, {"text": "Well don't expect the five-star hotel room", "start": 139.08, "duration": 3.08}, {"text": "They are comparable to Japanese sleeping pods or the one you see in the Fifth Element movie.", "start": 142.16, "duration": 6.26}, {"text": "So there are pretty small but comfortable they come with a decent bed a few cushions and a proper duvet.", "start": 148.42, "duration": 7.1}, {"text": "Curtains to get some privacy from other colleagues, a light for each compartment", "start": 155.52, "duration": 4.78}, {"text": "which can be dimmed as shown by my dear colleague pilot Alexander", "start": 160.3, "duration": 4.12}, {"text": "and you can also set your desired temperature.", "start": 164.42, "duration": 2.86}, {"text": "Very rarely some of them come with the same entertainment system", "start": 167.28, "duration": 3.62}, {"text": "like a TV for instance as the passengers have.", "start": 170.9, "duration": 3.42}, {"text": "Others comes with emergency equipment such as:", "start": 174.32, "duration": 2.64}, {"text": "an oxygen mask in case of cabin depressurization,", "start": 176.96, "duration": 3.5}, {"text": "a PBE in case of smoke in the cabin and a fire extinguisher.", "start": 180.46, "duration": 5.44}, {"text": "And as a safety measure their beds comes with a belt to be closed around your waist", "start": 185.9, "duration": 5.06}, {"text": "to prevent you from getting hurt in severe turbulence.", "start": 190.96, "duration": 3.2}, {"text": "Last but not least you have an Interphone with which other crew members can call you in case of emergency", "start": 194.16, "duration": 6.18}, {"text": "but luckily there are primarily used to wake you up from your controlled rest.", "start": 200.34, "duration": 5.22}, {"text": "When can you get some rest time? Now this just depends entirely on the crew composition.", "start": 205.56, "duration": 5.46}, {"text": "On flights longer than nine hours, flight crews literally work in shifts", "start": 211.02, "duration": 4.86}, {"text": "Now I can't really speak for the flight attendants on how they divided their rest time,", "start": 215.88, "duration": 4.3}, {"text": "but from the pilot's perspective, that's how we do it.", "start": 220.18, "duration": 3.74}, {"text": "Now let's say we were to be flying from Frankfurt, Germany to Los Angeles, California.", "start": 223.92, "duration": 4.74}, {"text": "Now that's a 12-hour flight", "start": 228.66, "duration": 2.56}, {"text": "and with most airlines that requires at least three sometimes even four pilots for that trip.", "start": 231.22, "duration": 6.6}, {"text": "Now let's say three pilots for our example", "start": 237.82, "duration": 2.98}, {"text": "So during the briefing we decide on who will be the pilot flying and who will be the pilot monitoring.", "start": 240.8, "duration": 6.5}, {"text": "Now the pilot flying will be the pilot performing takeoff and landing.", "start": 247.3, "duration": 5.62}, {"text": "So he or she has to be up in the cockpit for those two phases of flight.", "start": 252.92, "duration": 5.44}, {"text": "Now very often the pilot monitoring sitting next to the pilot flying during takeoff", "start": 258.36, "duration": 5.32}, {"text": "will also be the one for landing.", "start": 263.68, "duration": 2.82}, {"text": "You then first have to calculate the actual time window in which rest is allowed", "start": 266.5, "duration": 6.14}, {"text": "So for our example all pilots need to be within the cockpit for takeoff", "start": 272.64, "duration": 5.3}, {"text": "until passing 10,000 feet (1084 meter)", "start": 277.94, "duration": 2.02}, {"text": "as it is prohibited to be in the bunk for takeoff. And the same goes for landing,", "start": 279.96, "duration": 5.62}, {"text": "all crew members should be in the cockpit for the descent preparations and checklists", "start": 285.58, "duration": 5.88}, {"text": "which start roughly 1 hour before landing.", "start": 291.46, "duration": 3.24}, {"text": "So from 12 hours, we are down to 10 hours and 50 minutes.", "start": 294.7, "duration": 5.16}, {"text": "But we also have to take into account the time of actually waking up, putting on the uniform back on,", "start": 299.86, "duration": 6.68}, {"text": "swapping seats with the colleague and doing a proper hand over and briefing update.", "start": 306.54, "duration": 5.94}, {"text": "That's a minimum of 10 minutes each. So another 30 minutes subtracted", "start": 312.54, "duration": 6.04}, {"text": "gives us 10 hours and 20 minutes of actual rest time divided by 3 pilots", "start": 318.58, "duration": 7.08}, {"text": "approximately 3 hours and 27 minutes of rest.", "start": 325.66, "duration": 5.02}, {"text": "Does that make sense?", "start": 330.68, "duration": 1.36}, {"text": "Speaking of pilot flying,", "start": 332.62, "duration": 1.62}, {"text": "during the time the captain is in the crew bunk having his rest, very often", "start": 334.24, "duration": 5.22}, {"text": "the more experienced first officer will be the pilot flying in the left-hand seat for the time", "start": 339.46, "duration": 7.16}, {"text": "unless otherwise discussed at the briefing.", "start": 346.62, "duration": 2.52}, {"text": "The colleagues flying at the time will set a timer, when to wake up the resting pilots", "start": 349.14, "duration": 5.62}, {"text": "and use the Interphone system to do so.", "start": 354.76, "duration": 2.84}, {"text": "It's a similar time as if you press the flight attendants button", "start": 357.6, "duration": 3.74}, {"text": "It will light up in the crew compartment and you have to acknowledge the wake-up call by pressing a little button", "start": 361.34, "duration": 6.64}, {"text": "Notifying the flying crew, you are getting up.", "start": 368.2, "duration": 3.54}, {"text": "Do you get enough rest in the bunk?", "start": 371.76, "duration": 2.7}, {"text": "Now that question is difficult to answer as it really depends on the time of day, the day of your rotation,", "start": 374.46, "duration": 7.24}, {"text": "jet-lag effects and if it's a smooth or bumpy flight.", "start": 381.72, "duration": 3.86}, {"text": "I admit one of my colleagues had to go back to the bunk once and wake me up", "start": 385.58, "duration": 5.1}, {"text": "cause I was so fast asleep, and I didn't hear to wake up chime.", "start": 390.68, "duration": 4.34}, {"text": "Trust me. Once in a while sleep deprivation will haunt down and knock you out when you least expect it.", "start": 395.02, "duration": 7.38}, {"text": "So the next time you wonder where the lovely flight attendant has gone to,", "start": 402.4, "duration": 4.34}, {"text": "she might be getting some rest time above your head in the secret bedroom of the airplane.", "start": 406.74, "duration": 6.58}, {"text": "And as mentioned at the beginning of the video,", "start": 413.32, "duration": 2.14}, {"text": "I have another amazing giveaway for you guys you can sign up for.", "start": 415.46, "duration": 5.1}, {"text": "As this video is brought to you by my colleagues and friends from", "start": 420.56, "duration": 3.44}, {"text": "airplanesticker.com. They came up with a really cool idea!", "start": 424.0, "duration": 4.44}, {"text": "airplanesticker.com was founded by pilot friend of mine who wanted to represent the company", "start": 428.44, "duration": 5.66}, {"text": "he was flying for on his flight kit with a sticker.", "start": 434.1, "duration": 4.0}, {"text": "And since there was no market for it,", "start": 438.1, "duration": 2.12}, {"text": "he created the first designs by himself.", "start": 440.22, "duration": 2.9}, {"text": "The interest and feedback of the colleagues was overwhelming", "start": 443.5, "duration": 3.28}, {"text": "and the idea was born to spread this product across the globe.", "start": 446.78, "duration": 4.44}, {"text": "So he called me up one day and said:", "start": 451.22, "duration": 1.76}, {"text": "\"Joe, check your emails! I've just sent you your own", "start": 452.98, "duration": 3.56}, {"text": "personalized airplane sticker!\"", "start": 456.54, "duration": 2.22}, {"text": "I totally fell in love with it and I said:", "start": 459.16, "duration": 2.7}, {"text": "\"Mate, send me over a hundred of those and we'll make a cool giveaway for my followers.\"", "start": 461.86, "duration": 5.0}, {"text": "And here we are right now. So if you want this really cool", "start": 466.86, "duration": 3.52}, {"text": "747-8 Captain Joe sticker + 2 Captain Joe bumper stickers,", "start": 470.58, "duration": 6.1}, {"text": "go down in the link in the description box below,", "start": 476.68, "duration": 2.68}, {"text": "click on airplanes sticker giveaway,", "start": 479.36, "duration": 2.68}, {"text": "that will bring you to my website fill out the contact form.", "start": 482.04, "duration": 4.0}, {"text": "And if you are one among the hundred lucky ones", "start": 486.04, "duration": 3.34}, {"text": "you'll receive an email with instructions so we can send it via mail to you.", "start": 489.66, "duration": 5.02}, {"text": "And you have to sign up for my newsletter", "start": 494.68, "duration": 3.22}, {"text": "I have one word for you:", "start": 497.9, "duration": 2.0}, {"text": "Legend wait for it wait for eternity and even longer.", "start": 500.42, "duration": 3.84}, {"text": "That's it for today. Thank you very much for your time. Hit that subscribe button", "start": 506.34, "duration": 3.44}, {"text": "and activate the notification bell so you won't miss out upcoming videos.", "start": 509.78, "duration": 4.26}, {"text": "And don't forget, a good pilot is always learning", "start": 514.04, "duration": 3.4}, {"text": "see you next week, wish you all the best, your captain Joe.", "start": 517.44, "duration": 3.44}]