[{"text": "Dear friends and followers, welcome back to my channel. Today is a follow-up video to my recent topic 'What's in a pilot's bag'", "start": 0.03, "duration": 7.289}, {"text": "I mentioned you shouldn't buy polarised sunglasses as a pilot and today I'll be showing you why, so let's get started.", "start": 7.72, "duration": 7.249}, {"text": " ", "start": 16.96, "duration": 2.0}, {"text": "By the way, today's video Is brought to you by GlassesUSA.com, well it seems pretty obvious as we are primarily going to talk about", "start": 22.72, "duration": 6.799}, {"text": "sunglasses today.", "start": 29.8, "duration": 0.87}, {"text": "So check out their special link in the description box below to get a great discount on your first", "start": 30.67, "duration": 5.179}, {"text": "pair of shades from GlassesUSA.com. \nNow before we talk about a normal set of Sunglasses and a pair of polarised ones and", "start": 35.95, "duration": 7.819}, {"text": "how they affect your vision, we quickly need to discuss", "start": 43.989, "duration": 3.53}, {"text": "unpolarised and", "start": 48.129, "duration": 1.351}, {"text": "polarised light waves. Now the light emitting from the sun releases light particles, better known as photons. These", "start": 49.48, "duration": 7.61}, {"text": "Photons vibrate Up and Down or side to side", "start": 57.37, "duration": 2.599}, {"text": "Creating a Bundle of light Waves Flying Towards Planet Earth, Which means that the light provided by The sun Flies in", "start": 60.3, "duration": 7.34}, {"text": "Horizontal or Vertical Waves therefore Making The light Waves unpolarized", "start": 67.78, "duration": 4.62}, {"text": "But The sunlight can Untangle Itself Pretty Easily", "start": 72.54, "duration": 3.86}, {"text": "Those light Particles Just Have to strike something like a Lake or in our case", "start": 76.66, "duration": 4.68}, {"text": "Clouds and Then They'll Start Vibrating in The Same Direction meaning, That all Photons Start Oscillating", "start": 81.58, "duration": 5.96}, {"text": "in the direction That's perpendicular to that surface so the light particles that Bounce off a", "start": 87.88, "duration": 6.42}, {"text": "Horizontal surface Will Then Begin oscillating Vertically Meaning The Reflected particles Suddenly Have Fallen Into Sync", "start": 94.54, "duration": 7.489}, {"text": "Reflecting As", "start": 102.7, "duration": 1.32}, {"text": "Polarized Light Which Brings us back to our Polarized Sunglasses", "start": 104.02, "duration": 4.25}, {"text": "i admit the name Was not well chosen They Should, Have Called it", "start": 108.52, "duration": 4.01}, {"text": "Sunglasses with Vertical or horizontal Bars Which are Able to block", "start": 112.93, "duration": 4.579}, {"text": "Polarized Light So Let's Say The sunlight Which gets Reflected off a Cloud is coming Vertically Towards you", "start": 118.0, "duration": 7.129}, {"text": "giving You That Nasty glare now if you put on your polarized Sunglasses with", "start": 125.619, "duration": 4.669}, {"text": "horizontal bars in Them They will block the vertical light Waves and Reduce the glare now you'll think That's Great Because Pilots See", "start": 130.539, "duration": 7.61}, {"text": "Sunlight Being Reflected From Clouds Most of Their time in the Air so why can't They Wear", "start": 138.34, "duration": 5.659}, {"text": "Polarized Sunglasses and Here comes the problem Now most Modern Airplanes are fitted With lCD", "start": 144.28, "duration": 6.02}, {"text": "Monitors Showing You Primary Flying Instruments Navigation display and Many Other important Gauges But", "start": 150.49, "duration": 6.559}, {"text": "All Liquid Crystal Displays are partly Based on polarization Glass", "start": 157.45, "duration": 4.819}, {"text": "Filters a Meaning The Light Emitted of The lcD screen Is", "start": 162.61, "duration": 4.19}, {"text": "Polarized and in our case the Polarized light Waves of The screen emit out", "start": 167.56, "duration": 4.82}, {"text": "Horizontally and There's a Simple Way of showing This Now the polarization filter on my Ray-bans is Aligned Horizontally", "start": 173.17, "duration": 6.949}, {"text": "So the light of the lcD monitor", "start": 180.85, "duration": 2.0}, {"text": "Will Then Bypass My horizontal Bars on my ray Ban and i can see What is Shown on the monitor", "start": 182.92, "duration": 6.26}, {"text": "but as soon as i tilt my Head to either side the polarization filter Becomes then", "start": 189.64, "duration": 4.91}, {"text": "Vertical and Blocks Out The light Emitted from The LCD and the monitor Turns pitch black", "start": 194.95, "duration": 6.409}, {"text": "especially The display on the radio management Panel", "start": 202.06, "duration": 2.51}, {"text": "Always Turns Black As You are looking at It at a side angle and That's one of The Panels you Need a lot During Flight", "start": 205.0, "duration": 6.47}, {"text": "a Similar Thing happens when you look out through the cockpit Windows the cockpit Windows are", "start": 211.47, "duration": 5.22}, {"text": "Partially Polarized due to the way They are built and heating elements Installed Within the different Glass Layers again", "start": 216.82, "duration": 6.38}, {"text": "Looking Through The Windows At a particular angle You'll Get These Dark Oily Patches Which drastically", "start": 223.63, "duration": 5.839}, {"text": "Reduce Your visibility i also Wouldn'T recommend getting the polarized sunglasses for Planes Within The General Aviation", "start": 229.75, "duration": 6.44}, {"text": "Category Because more and more Planes are getting fitted With Glass Cockpit", "start": 236.65, "duration": 4.04}, {"text": "Instruments or at Least One of The Gauges Will have an LcD", "start": 240.88, "duration": 3.199}, {"text": "Screen and you don't want to constantly Put down your cool shades Just that you can monitor that instrument. In my opinion Polarized Sunglasses", "start": 244.15, "duration": 7.309}, {"text": "Are Great for climbing mount everest or going on a Polar", "start": 251.56, "duration": 3.98}, {"text": "Expedition, I hope You enjoyed This short video about The effect of Polarized Sunglasses and the copied instruments make sure to perform a Touching", "start": 256.06, "duration": 7.22}, {"text": "App My instagram account the link is in the description Below and don't forget to hit the subscribe button", "start": 263.45, "duration": 4.38}, {"text": "And the notification Bells so you won't Miss out upcoming videos see you next week all the best?", "start": 267.93, "duration": 5.269}, {"text": "Your Captain Joe. Don't forget to check out the Glassesusa.com link in description Below By cutting out the Middleman Glasses", "start": 273.41, "duration": 7.71}, {"text": "Usa.com offers Prescription Glasses at Up to 70% of the Retail price, Now we all know how expensive", "start": 281.37, "duration": 6.529}, {"text": "Aviation Equipment can Be and You'll be Amazed how much Cheaper the in-House Brands or designer Brands are with Glasses use a calm i", "start": 288.24, "duration": 7.819}, {"text": "Got Myself These Great Looking Ray bans", "start": 296.06, "duration": 2.04}, {"text": "24250 Threes", "start": 298.8, "duration": 1.29}, {"text": "Obviously Not for flying but i want to arrive in style as i meet up with My", "start": 300.09, "duration": 4.129}, {"text": "Friends and You'll never Fail with a Great Pair of Ray-bans trust me", "start": 304.29, "duration": 3.92}, {"text": "And as you might Know that I DJ from time to time on rooftop Bars Playing Deep house music", "start": 308.4, "duration": 5.149}, {"text": "Into the Sunset and for that occasion i got these great in-House Brand Sunglasses Called Romano", "start": 313.8, "duration": 5.869}, {"text": "Fantastic quality and a Great price and These Shades Right Here i used to show you the effect of", "start": 320.46, "duration": 5.029}, {"text": "Polarization on lcD Displays and They're also available in Their store", "start": 325.59, "duration": 3.5}, {"text": "So have fun shopping at Glasses use a calm They're special Link for an Amazing discount is in the description Below", "start": 329.31, "duration": 6.47}, {"text": "Make sure to check it out and i'll see ya", "start": 336.06, "duration": 2.72}]