[{"text": "This episode of Real Engineering is brought to you by brilliant.org,", "start": 0.0, "duration": 3.82}, {"text": "a problem solving website that helps you think like an engineer.", "start": 3.82, "duration": 2.96}, {"text": "Guns are a technology whose roots can be traced all the way back to 12th century China.", "start": 7.18, "duration": 4.48}, {"text": "And although the technology has advanced beyond recognition:", "start": 11.66, "duration": 3.22}, {"text": "with the guns growing in size and power their ammunition has evolved from spherical", "start": 14.88, "duration": 4.18}, {"text": "to the more familiar bullet shape to make them more efficient at supersonic speeds;", "start": 19.06, "duration": 3.86}, {"text": "the barrels have been bored with twists to impart a spin on the round to make it more accurate;", "start": 22.92, "duration": 4.2}, {"text": "and the method of their transportation has revolutionized how they're used.", "start": 27.12, "duration": 3.48}, {"text": "But there has been one constant for this technology through the centuries.", "start": 30.6, "duration": 3.56}, {"text": "Today we're going to learn how this technology looks set to be revolutionized by its largest iteration to date", "start": 34.16, "duration": 5.14}, {"text": "with the invention of the rail gun.", "start": 39.3, "duration": 1.54}, {"text": "Rail guns are guns that use electromagnetic force to propel a projectile instead of an explosive.", "start": 42.24, "duration": 4.88}, {"text": "Using explosives to power artillery has some drawbacks.", "start": 47.94, "duration": 2.68}, {"text": "Perhaps the most glaring one, being that naval ships have to carry huge caches of", "start": 51.16, "duration": 3.72}, {"text": "explosives on board to power their guns. This has backfired several times throughout history,", "start": 54.88, "duration": 5.4}, {"text": "particularly during World War II when on multiple occasions Japanese attacks detonated huge stores of ammunitions within ships,", "start": 60.28, "duration": 7.46}, {"text": "with the most horrifying case being the kamikaze attack on the USS John Burke,", "start": 67.74, "duration": 4.5}, {"text": "where the resulting explosion dwarfed the gigantic ships in its convoy.", "start": 72.24, "duration": 4.02}, {"text": "Obviously, avoiding future cases of this would be ideal; but this isn't the only advantage.", "start": 76.26, "duration": 5.0}, {"text": "Current railgun designs are doubling the muzzle velocity of all naval artillery", "start": 81.26, "duration": 4.24}, {"text": "with hypersonic speeds up to Mach 6 -- most naval artillery max out at Mach 3.", "start": 85.5, "duration": 5.4}, {"text": "This would extend the range and reduce the time to impact by nearly double too", "start": 90.9, "duration": 3.86}, {"text": "if it wasn't for the elevated air resistance at these speeds.", "start": 94.76, "duration": 3.38}, {"text": "This technology has been a focus of the US military for decades, and for good reason.", "start": 98.14, "duration": 4.9}, {"text": "So let's see how it works and what needs to improve before we see it introduced to service.", "start": 103.04, "duration": 4.06}, {"text": "Rail guns use electromagnetism to propel a conductive armature, housing the projectile, downrange.", "start": 107.54, "duration": 5.78}, {"text": "The physics is quite simple, however the math is not.", "start": 113.32, "duration": 2.98}, {"text": "Two parallel rods are connected to a power source -- these two rods can be considered the weapon's barrel.", "start": 116.3, "duration": 5.66}, {"text": "Connecting these two rods and completing the circuit is the armature.", "start": 121.96, "duration": 3.72}, {"text": "As the current passes through the rails, it generates a magnetic field.", "start": 125.68, "duration": 3.24}, {"text": "The same happens as it passes through the armature.", "start": 128.92, "duration": 2.6}, {"text": "The interaction of these perpendicular currents through the magnetic field produces something called the Lorentz Force.", "start": 131.52, "duration": 5.72}, {"text": "This force acts both perpendicular to the flow of the current and the magnetic field.", "start": 137.24, "duration": 4.64}, {"text": "In the case of the railgun, this force is what pushes the projectile through the barrel and downrange.", "start": 141.88, "duration": 4.54}, {"text": "The beauty of the Lorentz Force is that it's consistent,", "start": 147.1, "duration": 2.44}, {"text": "meaning the longer the barrel the higher the muzzle velocity.", "start": 149.54, "duration": 3.06}, {"text": "but the power required to simply overcome the static friction within the barrel of a miniature railgun", "start": 152.6, "duration": 4.96}, {"text": "can require significant amounts of energy most individuals don't easily have access to.", "start": 157.56, "duration": 4.82}, {"text": "This is when things start to get extremely interesting or extremely challenging", "start": 162.94, "duration": 3.96}, {"text": "because both solving for the Lorentz Force and generating sufficient Lorentz Force", "start": 166.9, "duration": 3.98}, {"text": "are both huge engineering challenges that have only been made possible and sustainable in the last 20 years.", "start": 170.88, "duration": 6.1}, {"text": "The Lorentz Force, in the case of a railgun, is simply the current multiplied by the armature width, the magnetic field in Teslas, and sine theta,", "start": 176.98, "duration": 8.3}, {"text": "where theta is the angle of the current, which in this case is 90 degrees.", "start": 185.28, "duration": 4.16}, {"text": "The magnetic field, B, is a property of the railguns design,", "start": 189.44, "duration": 3.5}, {"text": "such as materials, rail separation, and diameter and overall design geometry.", "start": 192.94, "duration": 4.68}, {"text": "With some assumptions, the equations clean up a bit,", "start": 197.62, "duration": 2.52}, {"text": "but for actual railgun design, these assumptions can't be made.", "start": 200.14, "duration": 3.6}, {"text": "While this technology has huge potential,", "start": 203.74, "duration": 2.26}, {"text": "there are some problems that need to be overcome to make this a serious weapon system.", "start": 206.0, "duration": 4.5}, {"text": "First and foremost, the same force that is applied to the armature also acts on the parallel rails.", "start": 210.5, "duration": 5.0}, {"text": "Quite literally, every time the weapon system is fired, the gun is actively trying to tear itself apart.", "start": 215.5, "duration": 5.84}, {"text": "On top of all this, the heat generated during each shot is so immense it is melting the rails.", "start": 221.34, "duration": 5.32}, {"text": "This can be seen during test fire drills with prototype railgun systems.", "start": 226.66, "duration": 3.7}, {"text": "That discharge you see behind the projectile is not the result of explosive propulsion,", "start": 230.36, "duration": 4.26}, {"text": "but a result of the resistive electric heating created by the huge current running through the rails", "start": 234.629, "duration": 5.111}, {"text": "and the frictional force between the armature and the rail,", "start": 239.74, "duration": 2.8}, {"text": "causing the rails to melt and shed material during each shot, causing more damage to the rail.", "start": 242.54, "duration": 4.7}, {"text": "These are unavoidable side effects,", "start": 247.58, "duration": 1.98}, {"text": "which are currently limiting the railgun to just a few shots before the damage breaks the gun entirely.", "start": 249.56, "duration": 5.06}, {"text": "Next, and possibly the most obvious limitation to the railgun design as a whole, is power.", "start": 255.12, "duration": 5.0}, {"text": "For this weapon to ever be introduced to service, it would have to be paired with a power source", "start": 260.46, "duration": 4.08}, {"text": "capable of providing the 25 megawatts needed to fire it.", "start": 264.54, "duration": 3.34}, {"text": "Even if previous generation ships had this capability,", "start": 267.88, "duration": 3.32}, {"text": "they would not have had enough power in reserve", "start": 271.2, "duration": 2.24}, {"text": "after satisfying the needs to the onboard systems and propulsion.", "start": 273.44, "duration": 3.22}, {"text": "But America's new futuristic Zumwalt-Class Destroyer", "start": 276.66, "duration": 2.9}, {"text": "is an all-electric composite ship that was slated to test this new weapon.", "start": 279.56, "duration": 4.44}, {"text": "With a generator capable of creating 78 megawatts, it would still have 58 megawatts of capacity available", "start": 284.0, "duration": 6.1}, {"text": "after providing for the rest of the ship's essential power requirements.", "start": 290.1, "duration": 3.36}, {"text": "Difficulties in railgun development and fiscal pull backs in Zumwalt construction have delayed their introduction.", "start": 293.8, "duration": 5.6}, {"text": "But they can, and likely will, be retrofitted in the coming years,", "start": 299.4, "duration": 3.64}, {"text": "once the current Durability problems have been solved.", "start": 303.04, "duration": 2.88}, {"text": "And while this technology is currently being funded by the military, it has far-reaching potential for other industries.", "start": 305.92, "duration": 5.86}, {"text": "We spoke recently of the challenges of intercepting ICBMs with traditional missiles.", "start": 311.78, "duration": 4.6}, {"text": "Rail guns could allow multiple interceptors to be quickly fired at a fraction of the cost and increase the chances of success.", "start": 316.38, "duration": 6.3}, {"text": "They have even been suggested as a means of protecting the earth from asteroids,", "start": 322.68, "duration": 3.98}, {"text": "with huge versions in orbit, to destroy or change the direction of incoming asteroids.", "start": 326.66, "duration": 5.22}, {"text": "Launching a satellite like this could also be made drastically cheaper too", "start": 331.88, "duration": 3.56}, {"text": "if we can deliver the materials to orbit with nothing more than the force a magnetic field imparts on a moving electric charge.", "start": 335.44, "duration": 6.44}, {"text": "If you'd like to learn more about electricity and magnetism and how they affect the world around us", "start": 341.88, "duration": 4.1}, {"text": "or any number of other scientific and mathematical principles,", "start": 345.98, "duration": 3.32}, {"text": "the best way to learn and understand principles like this is by applying them yourself,", "start": 349.3, "duration": 3.88}, {"text": "and that's exactly what brilliant.org allows you to do.", "start": 353.18, "duration": 2.7}, {"text": "One of my goals with this channel is to inspire my viewers to follow the path of past engineers to make this world a better place.", "start": 355.88, "duration": 6.02}, {"text": "But to do that you have to learn how to apply these principles yourself.", "start": 361.9, "duration": 3.4}, {"text": "Brilliant is a problem-solving site that helps you think like an engineer", "start": 365.3, "duration": 3.56}, {"text": "by guiding you through problems that are broken into digestible sections that bring you from knowing nothing", "start": 368.86, "duration": 4.68}, {"text": "to having a deep understanding of the topic.", "start": 373.54, "duration": 2.16}, {"text": "What I love is that when you answer something incorrectly, it even tells you exactly why so you can correct your misconceptions.", "start": 375.7, "duration": 6.08}, {"text": "To support Real Engineering and learn more about Brilliant, go to brilliant.org/realengineering", "start": 381.78, "duration": 5.14}, {"text": "and sign up for free. And the first 200 people that go to that link will get 20% off their annual premium subscription.", "start": 386.92, "duration": 6.38}, {"text": "Brilliant is a perfect fit for my channel, so please check them out.", "start": 393.3, "duration": 3.4}, {"text": "As usual, thank you to all my Patreon supporters for helping this channel exist.", "start": 396.7, "duration": 4.2}, {"text": "Myself and Sam from Wendover Productions just released the latest episode of our podcast, Showmakers,", "start": 400.9, "duration": 5.28}, {"text": "with special guest, Christian Tierney, who is an incredible photographer and videographer", "start": 406.18, "duration": 4.54}, {"text": "who recently worked with Conor McGregor for his last fight with Floyd Mayweather.", "start": 410.72, "duration": 3.98}, {"text": "The link for that should be on screen now.", "start": 414.7, "duration": 1.4}]