[{"text": "Today's video is sponsored by NordVPN, the world's leading Virtual Private Network company protecting millions of people on the internet every day.", "start": 0.03, "duration": 7.619}, {"text": "Hi, I'm Griffin Johnson, the Armchair Historian. Today's episode: why Italy was so incompetent during the Second World War. This should be fun.", "start": 8.019, "duration": 7.43}, {"text": "Fascist Italy's military has long been the target of ridicule aimed at its lack of competence and commitment to duty.", "start": 32.18, "duration": 7.04}, {"text": "In this video we'll be evaluating the factors that inhibited the Italian military during the Second World War,", "start": 39.22, "duration": 4.77}, {"text": "and examine whether or not the poor reputation of fascist Italy's military, which continues to this day largely in the form of internet memes,", "start": 44.24, "duration": 7.13}, {"text": "is entirely deserved.", "start": 51.53, "duration": 1.56}, {"text": "Now, let's begin by providing a bit of context.", "start": 53.09, "duration": 3.13}, {"text": "Joining me today is Potential History to do just that.", "start": 56.22, "duration": 3.58}, {"text": "Potential History: Since 1922,", "start": 59.8, "duration": 1.02}, {"text": "Italy was under the leadership of Benito Mussolini, known as Il Duce, or \"the leader\".", "start": 60.82, "duration": 5.16}, {"text": "What Il Duce imagined was nothing less than the restoration of the Roman Empire,", "start": 66.2, "duration": 4.34}, {"text": "an ambition even Hitler prodded going as far as to call him \"one of the Caesars\".", "start": 70.62, "duration": 4.54}, {"text": "Now, although I'm sure that big chin himself meant every word of his intentions, in reality", "start": 75.16, "duration": 4.4}, {"text": "It turned out... Well, I won't spoil it for you...", "start": 79.56, "duration": 3.4}, {"text": "Bad. It turned out very bad.", "start": 82.96, "duration": 1.44}, {"text": "Even though there were clearly grand ambitions behind the troops Mussolini sent to the field,", "start": 84.409, "duration": 3.92}, {"text": "The fact of the matter was, that they received substandard equipment.", "start": 88.33, "duration": 2.909}, {"text": "Including thinly armored and very undergunned tanks. If you want to learn more specifically about Italian armor,", "start": 91.729, "duration": 5.33}, {"text": "check out my video in the description below.", "start": 97.06, "duration": 2.0}, {"text": "Armchair Historian: Let's start by analysing Italy's leadership during the Second World War.", "start": 99.38, "duration": 3.66}, {"text": "Naturally, we'll start with big chin himself. Mussolini was eager to get involved, but Pietro Badoglio and Italo Balbo,", "start": 103.58, "duration": 7.5}, {"text": "two of his top marshals, advised him to be patient. In his mind,", "start": 111.08, "duration": 3.58}, {"text": "there was no doubt that the world would soon be subjected to", "start": 114.67, "duration": 2.65}, {"text": "Axis rule and he was hoping to secure a territory for Italy. As a result, Mussolini ignored his army's", "start": 117.5, "duration": 6.3}, {"text": "logistical deficiencies, which became very apparent just two weeks into the Italian invasion of France.", "start": 123.8, "duration": 5.36}, {"text": "This was exacerbated by the lack of equipment, some of which had been lost due to", "start": 129.46, "duration": 4.32}, {"text": "Mussolini's involvement in wars in Spain and East Africa. To make matters worse", "start": 134.08, "duration": 4.56}, {"text": "the Italian High Command was simply not up to par with those of the other Great Powers.", "start": 138.7, "duration": 4.32}, {"text": "Many of Mussolini's marshals only gained their positions because of their political affiliation and personal loyalty rather than military experience.", "start": 143.02, "duration": 8.04}, {"text": "Incompetence was not limited to the upper echelons of the command structure, however.", "start": 151.6, "duration": 3.9}, {"text": "MacGregor Knox in his book on the subject provides the following explanation as to why.", "start": 155.5, "duration": 5.16}, {"text": "[quote on screen]", "start": 160.66, "duration": 16.9}, {"text": "This translated into a widespread failure to adapt to the changing nature of combat, with many officers preparing their soldiers for First World War era", "start": 177.82, "duration": 8.3}, {"text": "scenarios, and equipping them with outdated weapons. In terms of industrial capacity and natural resources,", "start": 186.26, "duration": 6.28}, {"text": "Italy was also at a disadvantage. To give you an idea of how dire the situation", "start": 192.65, "duration": 4.669}, {"text": "truly was at one point, the Italian infantry divisions were short, roughly", "start": 197.68, "duration": 4.52}, {"text": "15,000 contemporary artillery guns,", "start": 202.4, "duration": 2.4}, {"text": "but the Italian military factories could only produce 8 percent of that number in a year.", "start": 204.8, "duration": 4.94}, {"text": "Furthermore, the artillery that was available to the Italian soldiers was often defective in some way. In Frank Joseph's book,", "start": 209.92, "duration": 7.349}, {"text": "He quotes an Australian soldier, Robert Donovan, who professed that:", "start": 217.269, "duration": 4.051}, {"text": "[quote on screen]", "start": 221.32, "duration": 11.5}, {"text": "Throughout the war, the industries of Britain and its allies out-competed Italian industries in producing artillery,", "start": 233.0, "duration": 6.02}, {"text": "aircraft, and ships alike.", "start": 239.3, "duration": 1.67}, {"text": "And much like Germany, Italy suffered from a dearth of natural resources, like coal and oil, that were needed to power those", "start": 240.97, "duration": 6.11}, {"text": "factories in the first place. Now that we understand that both Italy's command and resource output were inferior to its neighbours',", "start": 247.08, "duration": 6.52}, {"text": "let's analyse Italy's forces and equipment. The Navy was by far the best thing that Italy had going for it. Its presence in the", "start": 253.7, "duration": 7.1}, {"text": "Mediterranean Sea was imposing. Its destroyers, submarines, and torpedo boats outnumbering those of Britain and France in the region.", "start": 260.9, "duration": 6.62}, {"text": "But the Navy suffered from two significant drawbacks. Number one:", "start": 267.52, "duration": 3.539}, {"text": "It was hindered by fuel shortages, and number two: like the infantry, it could not depend on the Air Force.", "start": 271.06, "duration": 5.7}, {"text": "This is largely a result of the Air Force's disorganized state, being composed of myriad aircraft types like the", "start": 276.92, "duration": 6.829}, {"text": "infantryman barring World War 1 era weapons, some Italian pilots were forced to fly in", "start": 283.97, "duration": 4.94}, {"text": "outdated biplanes, even during the final stages of the war.", "start": 289.1, "duration": 3.23}, {"text": "Not to mention, in September 1939 less than half of Italy's planes were operational.", "start": 292.74, "duration": 4.92}, {"text": "But of all three military branches, one could easily make the argument that ground forces suffer the most from equipment and supply shortages.", "start": 297.66, "duration": 7.44}, {"text": "In 1940, only about a quarter of Italy's divisions were supplied with a sufficient amount of weapons and rations.", "start": 305.1, "duration": 6.38}, {"text": "Those weapons that did make it into the hands of these soldiers were at times outdated, with the newly adopted Carcano rifle being sometimes", "start": 311.82, "duration": 7.52}, {"text": "exchanged for World War one era rifles because of its limited range, accuracy, and jamming issues.", "start": 319.58, "duration": 5.84}, {"text": "What's more, as of 1937 each", "start": 325.62, "duration": 2.46}, {"text": "Infantry Division was composed of only two", "start": 328.09, "duration": 2.51}, {"text": "Infantry regiments instead of three. Thus as the total numbers of divisions increased, the fighting capacity of each division decreased.", "start": 330.66, "duration": 7.54}, {"text": "Each of these new divisions needed a new commander as well, and Italy suffered from a sort of marshal brain drain.", "start": 338.2, "duration": 5.66}, {"text": "Granted, the binary system did provide each Italian division with more maneuverability,", "start": 344.17, "duration": 4.25}, {"text": "but this advantage was nullified by the fact that the Italians were facing motorised enemies on the battlefield.", "start": 348.46, "duration": 5.39}, {"text": "By en-large, Italian divisions were non-motorized as the country did not have the industrial capacity", "start": 354.36, "duration": 5.56}, {"text": "to produce automotive parts. On the whole, we can definitively conclude that the Italian military performed poorly during the Second World War.", "start": 359.92, "duration": 7.38}, {"text": "It failed to make a breakthrough in France, failed to invade Greece and Yugoslavia", "start": 368.04, "duration": 4.06}, {"text": "without first soliciting German support, and failed to assert control over North Africa despite outnumbering British forces in Libya ten to one", "start": 372.12, "duration": 7.68}, {"text": "during its planned invasion of Egypt. As such, Italy's string of failures and early capitulation", "start": 379.8, "duration": 5.6}, {"text": "in 1944 can be better attributed to brash leadership, a lack of industrialization,", "start": 385.4, "duration": 5.3}, {"text": "scarce resources, as well as equipment shortages and", "start": 390.7, "duration": 3.54}, {"text": "deficiencies, as opposed to a scarcity of brave and dutiful soldiers. This seems to be the consensus among modern historians.", "start": 394.26, "duration": 7.1}, {"text": "Although in William L. Shirer's book, the Rise and Fall of the Third Reich,", "start": 401.5, "duration": 3.769}, {"text": "another less heard of argument is put forth. Shirer points to the lack of popular support", "start": 405.82, "duration": 4.76}, {"text": "among Italian people, who unlike the Germans, never truly embraced fascism to explain the inability of", "start": 410.74, "duration": 6.54}, {"text": "Mussolini's regime to address the problems we've discussed throughout this video.", "start": 417.28, "duration": 4.1}, {"text": "Now on to our sponsor, NordVPN. Many people neglect to take online privacy seriously.", "start": 421.38, "duration": 5.7}, {"text": "But since we're living during a digital age where a YouTube video like this can easily reach thousands of people around the world,", "start": 427.09, "duration": 6.3}, {"text": "there is a growing need to keep your information safe and secure. Cyber security may seem very complex,", "start": 433.61, "duration": 5.779}, {"text": "but NordVPN makes protecting your information as easy as possible. using some of the newest technology available,", "start": 439.39, "duration": 6.089}, {"text": "NordVPN shields your internet activity from hackers and malware, even when you're connected to public Wi-Fi networks.", "start": 445.73, "duration": 6.829}, {"text": "You can use my coupon code \"history\" for a whole", "start": 452.84, "duration": 2.72}, {"text": "77% off of their three-year package, which is only two dollars and seventy five cents a month.", "start": 455.88, "duration": 5.88}, {"text": "We're confident that you'll be satisfied with the results. If not, NordVPN guarantees your money back up to 30 days.", "start": 461.99, "duration": 6.739}, {"text": "Thanks for watching.", "start": 470.53, "duration": 0.98}, {"text": "I'd like to thank my General Staff on Patreon and the Armchair Historian team listed on screen. If you're interested in learning more about", "start": 471.51, "duration": 6.69}, {"text": "Italian History, we've actually got a playlist dedicated to that very subject, including videos on Venice, Italian unification and Italy during the first world war;", "start": 478.7, "duration": 8.38}, {"text": "Lastly, be sure to check out Potential History's video on Italian tanks.", "start": 487.6, "duration": 3.919}, {"text": "I'll see you next time in August with our video on Russia's transformation into an Empire.", "start": 491.52, "duration": 5.01}]