[{"text": "Many gamers prefer to use 10 keyless keyboards because", "start": 0.0, "duration": 3.04}, {"text": "Lopping off the numpad gives you a few more inches of desk real estate for your mouse hand along with improved ergonomics", "start": 3.04, "duration": 5.62}, {"text": "The only problem is that well, sometimes you've really do miss those buttons", "start": 8.66, "duration": 5.18}, {"text": "Fortunately the good people at Chassepot have come up with a sensible solution", "start": 14.08, "duration": 5.44}, {"text": "Why not take all those keys over there and move them over there?", "start": 19.78, "duration": 5.08}, {"text": "How did nobody think of this before?", "start": 25.48, "duration": 1.54}, {"text": "So here it is the Chassepot C1000", "start": 27.02, "duration": 3.56}, {"text": "A beautiful 114 key keyboard with an innovative design that I love", "start": 30.58, "duration": 6.4}, {"text": "and hate", "start": 36.98, "duration": 1.38}, {"text": " ", "start": 38.36, "duration": 0.5}, {"text": " ", "start": 38.86, "duration": 0.5}, {"text": "Let's talk about why after this message from our sponsor Madrinas,", "start": 39.36, "duration": 3.5}, {"text": "Madrinas coffee blends specialty cold brew coffees", "start": 43.12, "duration": 2.66}, {"text": "in to 15 ounces, grab-and-go cans for your convenience", "start": 45.78, "duration": 2.62}, {"text": "Check them out and use offer code, Linus, to save 40% today", "start": 48.52, "duration": 3.22}, {"text": "Closed Caption is provided by: FireStarz, and other community contributors", "start": 52.08, "duration": 9.12}, {"text": "Chassepot, a company apparently named by someone who's really into 19th-century French rifles", "start": 61.3, "duration": 5.54}, {"text": "says the C1000 design was guided by three principles.", "start": 66.84, "duration": 3.84}, {"text": "respecting users input habits,", "start": 70.68, "duration": 2.0}, {"text": "reducing finger travel and twisting,", "start": 72.68, "duration": 2.5}, {"text": "and increasing efficiency with shortcut keys.", "start": 75.18, "duration": 3.1}, {"text": "At least that's what I think this sentence is trying to say", "start": 78.28, "duration": 2.68}, {"text": "but there are some problems here, like that the first two principles happen", "start": 80.96, "duration": 3.78}, {"text": "To be in direct conflict with one another.", "start": 84.74, "duration": 2.1}, {"text": "for example", "start": 86.84, "duration": 0.64}, {"text": "One of the most dramatic breaks from convention on this layout", "start": 87.48, "duration": 3.14}, {"text": "aside from having the numpad,", "start": 90.62, "duration": 2.06}, {"text": "function keys and", "start": 92.82, "duration": 1.12}, {"text": "most of the navigation keys up top here", "start": 93.94, "duration": 2.36}, {"text": "is the decision to move the arrow keys to the left side of the board.", "start": 96.58, "duration": 4.52}, {"text": "Now they claimed that they did this for gamers", "start": 101.22, "duration": 2.98}, {"text": "But in reality, I think they just had nowhere else to put them,", "start": 104.2, "duration": 3.78}, {"text": "not only do these buttons offer", "start": 107.98, "duration": 2.2}, {"text": "no clear advantage over WASD", "start": 110.28, "duration": 2.34}, {"text": "Which happened to also be surrounded by useful keys for your pinky and your thumb to strike", "start": 112.72, "duration": 5.32}, {"text": "but their placement here really screws up regular old typing.", "start": 118.04, "duration": 4.6}, {"text": "That's the exact thing they said they weren't going to do.", "start": 122.78, "duration": 2.7}, {"text": "because the up key is between the Z and Shift keys, which are normally neighbors", "start": 125.48, "duration": 4.92}, {"text": "It is super easy to accidentally move your cursor mid-sentence", "start": 130.46, "duration": 3.78}, {"text": "Especially if you're coming from an ortho linear layout like the ergo docks,", "start": 134.42, "duration": 3.26}, {"text": "which you can check it over here", "start": 137.68, "duration": 1.26}, {"text": "and if you're really unlucky", "start": 138.94, "duration": 1.9}, {"text": "You'll also hit shift at the same time as up highlighting and then overwriting everything you just typed", "start": 140.94, "duration": 6.06}, {"text": "But wait", "start": 147.549, "duration": 0.681}, {"text": "There's more, now that there's three arrow keys on the bottom row some other buttons had to move", "start": 148.23, "duration": 4.65}, {"text": "Like the Windows key get the f**k out of here", "start": 153.07, "duration": 2.809}, {"text": "You're going to the left of the tab now", "start": 155.88, "duration": 2.279}, {"text": "Now that one actually doesn't bother me too much because at least it's still accessible with the pinkie key", "start": 158.41, "duration": 5.419}, {"text": "which I already use to strike it", "start": 163.829, "duration": 2.351}, {"text": "but it is going to mess with any muscle memory that you've built up for windows hotkeys", "start": 166.18, "duration": 4.88}, {"text": "As will the slightly increased distance between left ctrl and the alphabet keys like", "start": 171.18, "duration": 4.9}, {"text": "Sacrebleu Chassepot", "start": 176.08, "duration": 1.84}, {"text": "Pourquoi m'envoies tu ça, si tu sais que le rarssourie ne fonctionnons pas", "start": 177.92, "duration": 5.18}, {"text": "There's also some changes for the right hand,", "start": 183.28, "duration": 2.14}, {"text": "They actually shortened the spacebar and added a second backspace key next to it for some reason", "start": 185.42, "duration": 6.92}, {"text": "and then they went put delete over here too - instead of function, which is", "start": 192.34, "duration": 5.36}, {"text": "Super-sized and way the crap, ah, yes up here because of that. They had to move the tilde key putting it", "start": 197.7, "duration": 7.02}, {"text": "Where the question mark should be and again moving shift further away.", "start": 204.72, "duration": 5.3}, {"text": "Honestly Chassepot,", "start": 210.02, "duration": 1.38}, {"text": "I'm starting to feel like this was designed by someone who's only ever read about keyboards in a book", "start": 211.4, "duration": 6.08}, {"text": "now in fairness, at least you can remap almost all of the keys", "start": 217.48, "duration": 5.08}, {"text": "in the fairly robust Chassepot Power Console software", "start": 222.56, "duration": 3.58}, {"text": "almost", "start": 226.88, "duration": 0.68}, {"text": "so these extra switches look like", "start": 227.56, "duration": 3.1}, {"text": "Remappable macro buttons that just happen to be set by default to", "start": 230.66, "duration": 4.12}, {"text": "show desktop", "start": 235.1, "duration": 0.88}, {"text": "file explorer", "start": 236.22, "duration": 1.1}, {"text": "and task manager", "start": 237.48, "duration": 1.2}, {"text": "Unfortunately, they along with the lock screen button", "start": 238.82, "duration": 3.7}, {"text": "And this nifty double zero key are the only buttons that you may not remap", "start": 242.52, "duration": 5.84}, {"text": "basically the exact buttons that you'd be most likely to want to remap are the ones that you", "start": 248.8, "duration": 5.36}, {"text": "Cannot remap. Now to be clear over time", "start": 254.9, "duration": 3.199}, {"text": "I could probably get used to all these little quirks and changes but they raise an important question. Why should I bother?", "start": 258.099, "duration": 6.87}, {"text": "Okay, so here's why. The C1000 is a pretty sweet keyboard", "start": 266.539, "duration": 5.66}, {"text": "The UV coated key caps are made of ABS plastic with a laser etched legend that looks techy without being over-the-top. The round corners", "start": 272.199, "duration": 6.75}, {"text": "thin bezels and the integrated carry handle", "start": 279.199, "duration": 3.86}, {"text": "give it a sleek geek chic look and the steel top plate precludes any kind of dec flex and", "start": 283.64, "duration": 6.9}, {"text": "and gives the C1000 a comfortable weight of", "start": 290.68, "duration": 3.1}, {"text": "1022 grams also comfortable by the way this hoody", "start": 294.0, "duration": 4.6}, {"text": "head to lttstore.com and get it on your skin ASAP. Now the board is available in two versions", "start": 298.94, "duration": 4.88}, {"text": "the C1000 go has a white LED backlight and blue Outemu switches while the pro is full RGB with your choice of blue red", "start": 304.14, "duration": 8.32}, {"text": "Or brown switches the instruction manual mentions that Cherry MX switches are available", "start": 312.46, "duration": 4.26}, {"text": "But apparently that's only if you email support wait 20 business days", "start": 317.3, "duration": 3.38}, {"text": "And pay an extra $50 and that's a pretty challenging thing because for 50 bucks", "start": 321.31, "duration": 4.709}, {"text": "This G.skill KM 360 10 keyless with Cherry MX switches is available. We actually have one in the mail right now", "start": 326.53, "duration": 7.619}, {"text": "So make sure you subscribe so you don't miss that review", "start": 334.15, "duration": 2.339}, {"text": "Another advantage of the C1000 though is that it can be paired wirelessly over Bluetooth to up to 3 devices", "start": 336.59, "duration": 5.75}, {"text": "thanks to its 1860 milliamp hour lithium-ion battery which Chassepot claims will last for 90 hours with the backlight off or", "start": 342.56, "duration": 7.36}, {"text": "fifteen hours with RGB blasting full pony power the keyboard charges in three-and-a-half hours via USB type-c", "start": 349.96, "duration": 7.08}, {"text": "But if you're not into that, you can also just operate it in Wired mode to take advantage of its USB pass-through", "start": 357.34, "duration": 5.28}, {"text": "So should you buy this keyboard then?", "start": 362.8, "duration": 2.18}, {"text": "Honestly", "start": 365.18, "duration": 0.5}, {"text": "I'm pretty disappointed by Chassepot's decision to place some buttons in a way that prevents this product from being", "start": 365.68, "duration": 6.24}, {"text": "Completely plug and play with a minimal learning curve. They said that was one of their goals, but to me what it looks like", "start": 371.98, "duration": 7.48}, {"text": "Is they prioritized having a sleek-looking", "start": 379.56, "duration": 3.04}, {"text": "symmetrical keyboard layout so they like put all the keys on in a cool attractive way and then", "start": 382.98, "duration": 6.06}, {"text": "decided which keys did what I mean, why else would they do something like", "start": 389.33, "duration": 4.1}, {"text": "Separating the home and end keys and making one of them twice as big. Next there's the price", "start": 394.04, "duration": 5.54}, {"text": "$200 actually, isn't that steep for a wireless?", "start": 399.72, "duration": 3.76}, {"text": "Mechanical full RGB keyboard, especially from a young company that's producing small runs, but it does sting a little that", "start": 403.6, "duration": 6.42}, {"text": "We're not getting cherry switches at that price. I think even a drop of just", "start": 410.02, "duration": 3.52}, {"text": "Twenty dollars would make it a little less top-heavy", "start": 413.96, "duration": 2.78}, {"text": "And then at that point if you can get past its shortcomings it is a well made keyboard in a form factor", "start": 416.81, "duration": 6.44}, {"text": "That makes sense on the desk and it will definitely turn heads at your next LAN party", "start": 423.25, "duration": 5.79}, {"text": "#SHAMELESSPLUGFORLTX2020", "start": 429.29, "duration": 2.929}, {"text": "Speaking of shameless. You could call the C Sonic prime ultra titanium the creme de la creme of power supplies", "start": 433.31, "duration": 6.5}, {"text": "It's got ultra high efficiency with an 80 plus titanium rating", "start": 440.08, "duration": 3.51}, {"text": "It's fully modular and it includes a PSU tester in the box", "start": 443.59, "duration": 4.14}, {"text": "Which is really useful if you're trying to custom liquid cool. The prime ultra titanium also has fluid dynamic fan", "start": 447.73, "duration": 5.699}, {"text": "bearings hybrid fan control to control the overall fan noise and a 50,000 hour life", "start": 453.6, "duration": 4.86}, {"text": "Expectancy with a 12 year warranty so buy it today at the links in the video description.", "start": 458.84, "duration": 4.4}, {"text": "So thanks for watching guys. See ya", "start": 464.09, "duration": 2.0}]