[{"text": "This video is sponsored by Vikings: War of Clans.", "start": 0.0, "duration": 4.0}, {"text": "If you enjoy top-down strategy games set in a time when Vikings ruled the world,", "start": 4.42, "duration": 3.98}, {"text": "then you should check out Vikings: War of Clans!", "start": 8.64, "duration": 2.52}, {"text": "Build settlements, command heroes and craft items to conquer your enemies.", "start": 11.32, "duration": 4.08}, {"text": "Sign up today by clicking on the link in the description below", "start": 15.6, "duration": 2.56}, {"text": "and not only will you be supporting our channel but you’ll also begin with a protection shield", "start": 18.16, "duration": 4.52}, {"text": "and an additional 200 gold to aid you in your conquest.", "start": 22.68, "duration": 4.76}, {"text": "Our story begins during the first years of the second millennium.", "start": 32.24, "duration": 3.66}, {"text": "For the last two hundred years settlements throughout Europe", "start": 36.3, "duration": 3.06}, {"text": "live in constant fear of being ravaged by two groups of ruthless pagan raiders;", "start": 39.36, "duration": 5.22}, {"text": "Hungarians, who assaulted the European interior, and the Norsemen, attacking mostly along the coasts.", "start": 44.58, "duration": 6.46}, {"text": "But it wasn't only a mindless plunder.", "start": 51.26, "duration": 2.54}, {"text": "By the beginning of the 11th century the Vikings were already deeply involved in the local politics", "start": 54.02, "duration": 5.64}, {"text": "of the weakened Western duchies and kingdoms and more often became concerned with trade than raiding.", "start": 59.66, "duration": 6.86}, {"text": "But, since our channel is not really about trading, we'll focus on the latter one,", "start": 66.8, "duration": 5.06}, {"text": "which didn't just cease in a matter of days.", "start": 71.86, "duration": 3.0}, {"text": "It's the year 1008 and the Norse raiding party under famous Thorkell the Tall plunders the coasts of the Eastern Baltic.", "start": 74.96, "duration": 8.22}, {"text": "Among his men is 13 years old Olaf Haraldsson, one of the descendants of the first King of Norway,", "start": 83.32, "duration": 6.66}, {"text": "forging his own way to wealth and respect.", "start": 90.16, "duration": 3.18}, {"text": "It was initially a rough journey, as on one occasion,", "start": 93.62, "duration": 3.38}, {"text": "Olaf's party was ambushed and decimated by Finnic tribesmen in southern Finland,", "start": 97.0, "duration": 5.08}, {"text": "but over the next few years they’re luck improved ravaging the English coasts and entrenching themselves in local politics.", "start": 102.08, "duration": 7.3}, {"text": "King Aethelred eventually paid a huge amount to be rid of them,", "start": 109.74, "duration": 3.88}, {"text": "but ironically a couple of years later Olaf assisted the English king in his fight", "start": 113.62, "duration": 5.34}, {"text": "against the Danish invasion of Sweyn Forkbeard and his son Canute.", "start": 118.96, "duration": 4.56}, {"text": "In 1013 Olaf found himself plundering the coasts of the western Iberian Peninsula,", "start": 123.8, "duration": 5.56}, {"text": "possibly on his way to the Mediterranean.", "start": 129.48, "duration": 2.26}, {"text": "There's a story, that Olaf dreamt about a powerful man urging him to forsake his plans", "start": 131.82, "duration": 5.82}, {"text": "and sail back home in order to become the king of all Norway, for all time.", "start": 137.88, "duration": 5.26}, {"text": "Obviously this could be allegory, but Olaf apparently followed these instructions and set sail back north.", "start": 143.34, "duration": 6.94}, {"text": "He wintered at the court of Duke Richard of Normandy.", "start": 150.82, "duration": 3.1}, {"text": "Olaf’s kinsmen in northern France settled there two generations earlier", "start": 154.16, "duration": 4.12}, {"text": "and now were westernized Christian warriors and scholars.", "start": 158.38, "duration": 3.46}, {"text": "There, young Olaf was impressed by stories about mighty Charlemagne; of his deeds and how he build the Frankish Empire.", "start": 162.1, "duration": 7.96}, {"text": "These stories left a long lasting impression on the young man", "start": 170.38, "duration": 3.74}, {"text": "and in early 1014 Olaf was baptised in Rouen cathedral.", "start": 174.26, "duration": 4.88}, {"text": "Soon, he departed Normandy and set sail back to Norway.", "start": 179.88, "duration": 4.3}, {"text": "The country was divided between various local chieftains,", "start": 184.76, "duration": 3.3}, {"text": "but the most powerful were the Jarls of Lade, formally retainers of the Danish king.", "start": 188.2, "duration": 5.3}, {"text": "But at the time of Olaf’s arrival in Norway, king Sweyn Forkbeard of Denmark was already dead", "start": 193.76, "duration": 6.06}, {"text": "and his son Canute ascended to the throne.", "start": 199.82, "duration": 2.7}, {"text": "Olaf saw this as an opportunity and offered Canute’s his help to regain control of England.", "start": 202.52, "duration": 7.26}, {"text": "While Olaf’s contribution to Canute’s reclaiming of the English throne remains unclear,", "start": 209.92, "duration": 5.16}, {"text": "the success of the latter eased Olaf’s way to the throne in Norway,", "start": 215.08, "duration": 4.34}, {"text": "as his most influential opponent, Jarl Erik of Lade was appointed Earl of Northumbria by King Canute.", "start": 219.42, "duration": 6.92}, {"text": "Thus, in 1015 Olaf took this advantage and crowned himself as King of Norway.", "start": 226.34, "duration": 7.32}, {"text": "In the following years Olaf made efforts to consolidate his rule over various petty rulers across the country,", "start": 234.16, "duration": 6.66}, {"text": "showing his ability as a commander and politician.", "start": 240.82, "duration": 3.7}, {"text": "But aside from his desire for power,", "start": 244.74, "duration": 1.94}, {"text": "Olaf as an ardent Christian wanted to enforce the new faith among the Norsemen.", "start": 246.68, "duration": 5.58}, {"text": "The thing was, that while faith in Jesus already reached many settlements in coastal Norway,", "start": 252.26, "duration": 5.66}, {"text": "the more remote inlands still worshipped old Norse gods.", "start": 257.92, "duration": 4.1}, {"text": "Yet Olaf was ruthless and determined,", "start": 262.5, "duration": 2.64}, {"text": "he let the sword pave way for the cross, coercing his people to the new faith.", "start": 265.34, "duration": 5.36}, {"text": "In 1024 Olaf convoked a moot, in which he declared Christianity the official faith in Norway.", "start": 271.24, "duration": 7.94}, {"text": "This was an unpopular decision, which made him new enemies.", "start": 279.32, "duration": 4.82}, {"text": "What’s more, Olaf’s further decisions to refit the existing laws to „Christian law”", "start": 284.7, "duration": 5.7}, {"text": "and strengthen control over local lords using men from his own guard,", "start": 290.4, "duration": 4.56}, {"text": "garnered serious opposition among the nobles of Norway.", "start": 294.96, "duration": 4.08}, {"text": "Yet King Olaf’s reforms and harsh Christianisation methods couldn’t spark enough fire to threaten his position.", "start": 299.26, "duration": 7.14}, {"text": "The real danger to his rule was located abroad.", "start": 306.4, "duration": 4.02}, {"text": "Canute Sweynsson, King of Denmark and England, was well informed regarding Olaf’s doings in Norway", "start": 311.56, "duration": 6.32}, {"text": "and perceived him as just a mere tributary king and a subordinate.", "start": 317.88, "duration": 4.1}, {"text": "He dispatched a letter to Olaf, reminding him of his position and urging him to recognize Knut’s supremacy.", "start": 322.18, "duration": 7.26}, {"text": "Unsurprisingly, Olaf refused to do so,", "start": 330.0, "duration": 2.52}, {"text": "possibly hoping that Canute would actually be too busy with affairs in England and Denmark", "start": 332.52, "duration": 4.74}, {"text": "to even bother with Norway.", "start": 337.26, "duration": 2.14}, {"text": "But he was wrong.", "start": 339.4, "duration": 2.18}, {"text": "In 1026 Canute sent a large fleet to deal with Olaf and his ally, the King of Sweden,", "start": 342.02, "duration": 5.88}, {"text": "but the naval clash that followed was largely inconclusive, with considerable losses on both sides.", "start": 348.0, "duration": 5.8}, {"text": "Subsequently, Canute learned about Olaf’s internal problems and began supporting his opposition,", "start": 354.34, "duration": 5.56}, {"text": "buying them with promises and treasuries.", "start": 359.9, "duration": 2.48}, {"text": "He also turned the Jarl of Lade against their king,", "start": 362.38, "duration": 3.16}, {"text": "and just after his pilgrimage to Rome, Canute set sail to Norway.", "start": 365.54, "duration": 4.72}, {"text": "Olaf had no means left to maintain his fight against Canute", "start": 370.38, "duration": 4.36}, {"text": "and with vanishing support from his own nobles, he was forced to flee into exile.", "start": 374.74, "duration": 5.46}, {"text": "Olaf sought refuge in Sweden and then within the court of Grand Prince Yaroslav the Wise in Novgorod.", "start": 380.46, "duration": 7.02}, {"text": "Soon, after appointing Hakon (the last Lade jarl) as Earl of Norway,", "start": 387.6, "duration": 5.16}, {"text": "Canute sailed back to England.", "start": 392.76, "duration": 2.42}, {"text": "Hakon’s appointment wasn’t the most fortunate, as he drowned at sea in 1029.", "start": 395.34, "duration": 5.38}, {"text": "Olaf learned about Canute’s departure and Hakon’s death and perceived this as an excellent opportunity to reclaim his kingdom.", "start": 400.72, "duration": 8.64}, {"text": "In early 1030 he arrived in Sweden with his most loyal followers,", "start": 409.36, "duration": 5.02}, {"text": "where he was reinforced by Swedish Vikings who, ironically, were still predominantly heathen.", "start": 414.38, "duration": 6.7}, {"text": "Olaf’s force reached Trondelag  in the summer of the same year and headed to the Verdal plain 70 kilometres to the north of Nidaros .", "start": 421.34, "duration": 7.98}, {"text": "Although Norwegian sagas indicate that Olaf gathered several thousands of men,", "start": 429.54, "duration": 4.84}, {"text": "it’s more likely that his host consisted of more meagre numbers.", "start": 434.38, "duration": 4.12}, {"text": "They set a camp on slightly elevated terrain near the town of Stiklestad.", "start": 438.5, "duration": 5.12}, {"text": "Olaf probably assumed he would be able to gather a significant following in Norway once the news of his landing had spread,", "start": 443.92, "duration": 7.3}, {"text": "but we’ll never find out if this would’ve actually happened,", "start": 451.54, "duration": 3.02}, {"text": "as in the last days of July a hostile army entered the plain.", "start": 454.56, "duration": 4.22}, {"text": "The King’s return caused two influential chieftains Kalf Arnason and Thorir Hund to challenge Olaf,", "start": 459.26, "duration": 7.16}, {"text": "and defend Canute’s status quo in Norway.", "start": 466.42, "duration": 2.68}, {"text": "Their troops were probably less hardened, but of far superior numbers,", "start": 469.48, "duration": 4.5}, {"text": "forming an army more than twice the size of Olaf’s, but still counting no more than a few thousand men.", "start": 473.98, "duration": 6.26}, {"text": "Olaf didn’t have a viable battle plan, and most likely was surprised by the size of the army he was going to face.", "start": 480.66, "duration": 7.68}, {"text": "The hill they camped on wasn’t reinforced by any field defences, and Olaf’s only hope to win the battle", "start": 488.64, "duration": 6.84}, {"text": "was to do the unexpected and strike downhill at the enemy’s superior numbers.", "start": 495.48, "duration": 6.02}, {"text": "Both sides clashed at the base of the hill forming two shieldwalls", "start": 501.88, "duration": 4.2}, {"text": "striving to gain an upper hand in the melee fighting.", "start": 506.08, "duration": 3.48}, {"text": "The battle was long and bloody. Many men on both sides died,", "start": 510.0, "duration": 4.16}, {"text": "but Olaf’s forces, despite trying to hold their ground fiercely, was gradually pushed back.", "start": 514.16, "duration": 5.92}, {"text": "As the deathtoll rose, Olaf’s inferior numbers were gradually worn by casualties", "start": 520.5, "duration": 5.1}, {"text": "and could no longer repel the enemy.", "start": 525.78, "duration": 2.4}, {"text": "Eventually, according to lore, having been wounded three times,", "start": 528.68, "duration": 3.92}, {"text": "King Olaf fell dead against a large rock.", "start": 532.6, "duration": 2.72}, {"text": "His troops scattered, leaving the victorious Kalf and Thorir’s army on the battlefield.", "start": 535.66, "duration": 5.34}, {"text": "The abrupt end of Olaf’s campaign left Canute as the undisputed king of Norway.", "start": 541.62, "duration": 5.4}, {"text": "Yet in the following years,", "start": 547.28, "duration": 1.46}, {"text": "the harsh reign of Canute’s son who was summoned to Norway to rule as his father’s deputy", "start": 548.74, "duration": 5.46}, {"text": "made the Norwegian nobles realize,", "start": 554.3, "duration": 2.14}, {"text": "that during Olaf’s reign their positions were not nearly as eroded as they were under the later Danish rule.", "start": 556.44, "duration": 7.38}, {"text": "One of the significant signs that Olaf’s popularity grew immensely after his death,", "start": 563.82, "duration": 4.88}, {"text": "was that his son Magnus ascended the throne five years later", "start": 568.86, "duration": 4.08}, {"text": "and was supported by Kalf Arnason, his father’s opponent near Stiklestad.", "start": 572.94, "duration": 5.16}, {"text": "Olaf’s reburial a year later supposedly revealed that his body had remained preserved, untouched by time.", "start": 578.52, "duration": 7.82}, {"text": "This marked the way to his canonization by Bishop of Nidaros shortly thereafter.", "start": 586.66, "duration": 5.76}, {"text": "The king’s heroic last stand at Stiklestad and his efforts, though often brutal, to Christianise Norway", "start": 592.98, "duration": 6.54}, {"text": "bolstered his popularity in the country long after his death.", "start": 599.52, "duration": 4.58}, {"text": "The cult of king martyr was additionally sanctioned by the Norwegian church,", "start": 604.44, "duration": 4.16}, {"text": "and over the years he became regarded as Norway’s patron,", "start": 608.6, "duration": 3.8}, {"text": "serving as an important nation-building figure in the emerging Norwegian state.", "start": 612.4, "duration": 6.86}]