[{"text": "This video was made possible by Brilliant.\nLearn intuitively with Brilliant for 20% off", "start": 0.11, "duration": 4.891}, {"text": "by being one of the first 200 to sign up at\nbrilliant.org/Wendover.", "start": 5.001, "duration": 4.939}, {"text": "If you look up, there are 4,708 satellites\nthat came from earth currently orbiting our", "start": 9.94, "duration": 6.39}, {"text": "planet. Just in the portion of the sky you\ncan see, hundreds of satellites are passing", "start": 16.33, "duration": 4.2}, {"text": "overhead at any given time. You often can’t\nsee them, but they’re there making GPS work,", "start": 20.53, "duration": 5.55}, {"text": "taking images of earth, providing communications,\neven spying for governments. These satellites", "start": 26.08, "duration": 4.93}, {"text": "are some of the most expensive single objects\nthat can be made. If you took at tennis ball", "start": 31.01, "duration": 4.77}, {"text": "sized chunk of the Hubble Space Telescope,\nit would be worth over $1,500. Modern full-scale,", "start": 35.78, "duration": 6.66}, {"text": "commercial grade satellites cost in the hundreds\nof millions of dollars. They’re just incredibly", "start": 42.44, "duration": 4.85}, {"text": "complex objects that require years to construct.\nMany of the satellites flying over you right", "start": 47.29, "duration": 5.49}, {"text": "now, though, started their life here at SSL\nin Palo Alto, California.", "start": 52.78, "duration": 4.62}, {"text": "SSL is a commercial company owned by Maxar\nTechnologies specializing in satellite and", "start": 57.4, "duration": 4.8}, {"text": "spacecraft construction. They’ve built spacecraft\nthat are current in orbit for everyone from", "start": 62.2, "duration": 4.26}, {"text": "DirecTV to national governments. If you’ve\never watched satellite TV, listened to satellite", "start": 66.46, "duration": 4.81}, {"text": "radio, or used satellite internet on a plane,\nthere’s a decent chance you’ve directly", "start": 71.27, "duration": 3.75}, {"text": "used one of the satellites they built here\nin their factory. But let’s say you want", "start": 75.02, "duration": 3.99}, {"text": "to buy a satellite from SSL, what do you do?\n“Well the first thing you do is you pick", "start": 79.01, "duration": 3.969}, {"text": "up the phone and call us but the next thing\nyou should do is check your bank account to", "start": 82.979, "duration": 3.981}, {"text": "make sure you have enough money to buy a satellite.\nSatellites, depending on what kind it is and", "start": 86.96, "duration": 6.32}, {"text": "where it’s going can cost tens of millions\nof dollars up to several hundred million dollars.”", "start": 93.28, "duration": 6.949}, {"text": "Once a customer makes that first phone call\nto SSL, there will then be an ongoing back", "start": 100.229, "duration": 4.231}, {"text": "and forth between them and the customer. Essentially,\nthe customer will tell SSL what they want", "start": 104.46, "duration": 4.71}, {"text": "their satellite to do and SSL will come back\nto them with a price. Eventually, if all goes", "start": 109.17, "duration": 4.699}, {"text": "well, they’ll sign a contract.\nThat’s exactly what happened a few years", "start": 113.869, "duration": 3.371}, {"text": "ago between SSL and Telesat—a global satellite\ncompany headquartered in Canada that owns", "start": 117.24, "duration": 5.059}, {"text": "and operates a fleet of satellites. Their\nsatellites are used to broadcast signals,", "start": 122.299, "duration": 4.051}, {"text": "whether it be TV, Radio, or Internet, for\ntheir customers—satellite TV, radio, and", "start": 126.35, "duration": 4.629}, {"text": "internet providers. In this case, Telesat\nneeded a satellite to provide additional capacity", "start": 130.979, "duration": 4.971}, {"text": "over the busy North Atlantic region and so\nthey came and signed a contract with SSL to", "start": 135.95, "duration": 4.3}, {"text": "build their new satellite—Telstar 19 VANTAGE.\nSoon after contracts were signed, work began", "start": 140.25, "duration": 5.31}, {"text": "on designing the satellite. In that process\nthe designers usually pull designs for some", "start": 145.56, "duration": 4.259}, {"text": "more generic aspects from previous projects\nand then modify them to suit the particular", "start": 149.819, "duration": 4.0}, {"text": "job. The length of that process can vary widely\nbased off how complex the satellite is but", "start": 153.819, "duration": 4.721}, {"text": "throughout the process, as soon as they’ve\nlocked a design in, they’ll begin ordering", "start": 158.54, "duration": 4.05}, {"text": "parts. SSL builds about half their components\nthemselves and orders the other half from", "start": 162.59, "duration": 4.67}, {"text": "other companies. The decision on whether to\norder or build in-house usually comes down", "start": 167.26, "duration": 4.34}, {"text": "to performance. “There are certain components\nwhere, depending on what the requirements", "start": 171.6, "duration": 4.96}, {"text": "are we build higher performance components\nthan suppliers, some of them our suppliers", "start": 176.56, "duration": 4.81}, {"text": "build better components than we do.” Over\nthe years SSL has looked at what it’s good", "start": 181.37, "duration": 4.56}, {"text": "at and what other suppliers are good at and\nmade the decision on what to order based off", "start": 185.93, "duration": 4.089}, {"text": "that. For example, one of the components that\nSSL builds are the antenna reflectors. These", "start": 190.019, "duration": 4.672}, {"text": "are what actually direct signals down to earth\nand each of them is custom designed for the", "start": 194.691, "duration": 3.909}, {"text": "region that the satellite will cover. “So\nthis is, for example, for Telstar 18 Vantage,", "start": 198.6, "duration": 4.7}, {"text": "you can see here that these are these reflectors\nthat would be sticking out on the side and", "start": 203.3, "duration": 6.23}, {"text": "it’s used for sending signals back to earth\nand all those little dots you see on there", "start": 209.53, "duration": 4.55}, {"text": "are for photogrammetry so they’re used to\nmake sure that the surface is actually exactly", "start": 214.08, "duration": 7.18}, {"text": "as designed so we have these cameras that\ntake pictures of these and all the dots to", "start": 221.26, "duration": 6.199}, {"text": "make sure that it was build according to the\ndesign.” The satellite these antenna reflectors", "start": 227.459, "duration": 6.601}, {"text": "eventually went on, Telstar 18 Vantage, the\nsister satellite of Telstar 19 Vantage, will", "start": 234.06, "duration": 4.85}, {"text": "launch in late August 2018 and soon after\nwill go into service providing data services", "start": 238.91, "duration": 4.44}, {"text": "over Asia and Oceania so the antenna reflector\nwas carefully crafted to provide signal over", "start": 243.35, "duration": 4.43}, {"text": "populated areas and busy flight and maritime\ncorridors while not wasting resources on providing", "start": 247.78, "duration": 4.72}, {"text": "service to areas the company already has coverage\nfor or that would have little demand such", "start": 252.5, "duration": 3.709}, {"text": "as to the south of Australia.\nAbout 9 to 15 months after ordering, the majority", "start": 256.209, "duration": 4.45}, {"text": "of the ordered components will start rolling\nthrough the door and then the bulk of the", "start": 260.659, "duration": 3.101}, {"text": "assembly process begins. This process is too\ncomplex to go into detail on, but essentially", "start": 263.76, "duration": 4.93}, {"text": "they’ll first build the major elements separately.\nOne group will assemble the propulsion system", "start": 268.69, "duration": 4.039}, {"text": "and framework of the satellite while another\nwill assemble the payload, what the satellite", "start": 272.729, "duration": 3.5}, {"text": "is actually built to carry whether that be\nan advanced camera or a communications system,", "start": 276.229, "duration": 3.741}, {"text": "while yet another group will assemble the\nsuper-light and efficient solar panels that", "start": 279.97, "duration": 3.309}, {"text": "will power the satellite when in orbit. The\nassembly of the different major components", "start": 283.279, "duration": 4.01}, {"text": "will take a few more months and then they’ll\nstart to compile those different major components", "start": 287.289, "duration": 3.861}, {"text": "together over a period of a few more months.\nEach component is tested independently before", "start": 291.15, "duration": 4.569}, {"text": "and while being installed on the satellite,\nbut once they’re all pieced together there", "start": 295.719, "duration": 3.45}, {"text": "begins an incredibly rigorous phase of testing\nthe satellite as a whole. When buying a satellite", "start": 299.169, "duration": 4.541}, {"text": "from a trusted manufacturer like SSL, the\ncustomer is buying reliability so there can", "start": 303.71, "duration": 4.65}, {"text": "be no compromise on testing. They need to\nbe sure that the satellite will actually survive", "start": 308.36, "duration": 4.529}, {"text": "launch and work in space and the best way\nto do that is to just simulate launch and", "start": 312.889, "duration": 5.331}, {"text": "space. There are three major factors that\ncould harm a satellite—vibration, temperature,", "start": 318.22, "duration": 3.449}, {"text": "and sound.\nThe vibration comes as a satellite launches", "start": 321.669, "duration": 3.53}, {"text": "in a rocket so they test that their satellites\ncan survive launch. “When you put these", "start": 325.199, "duration": 4.95}, {"text": "satellites on top of a rocket in the payload\nfaring they experience a lot of vibration", "start": 330.149, "duration": 4.23}, {"text": "loads in the x, y, and z so we’re able to\nsimulate those with this vibration table.", "start": 334.379, "duration": 5.68}, {"text": "It has a baseplate there and you can shake\nit in this direction, in this direction, or", "start": 340.059, "duration": 3.371}, {"text": "in this direction so it does in all different\ndirections to simulate the environment and", "start": 343.43, "duration": 4.68}, {"text": "make sure that it’s all operating.” The\nsatellite on the table in testing here is", "start": 348.11, "duration": 4.269}, {"text": "Telstar 19 Vantage itself. This here is just\none of many tests where they literally just", "start": 352.379, "duration": 5.171}, {"text": "shake the satellite and see how it responds.\nThey only last about 60-90 seconds each because", "start": 357.55, "duration": 5.23}, {"text": "that’s how long the satellite will experience\nvibration during launch until the rocket reaches", "start": 362.78, "duration": 3.819}, {"text": "the upper atmosphere.\nThey’ll also test to be sure that their", "start": 366.599, "duration": 2.22}, {"text": "satellites can survive the vacuum and temperatures\nof space. “So, what you see up there, this", "start": 368.819, "duration": 4.94}, {"text": "big blue pumpkin looking thing like Cinderella’s\ncarriage, that one is called our thermal vacuum", "start": 373.759, "duration": 7.16}, {"text": "chamber, we like to call it the blue pumpkin,\nand what we use it for is to simulate the", "start": 380.919, "duration": 5.25}, {"text": "thermal vacuum of space so we’ll go down\nto the vacuum levels of space, you know 10-10", "start": 386.169, "duration": 7.65}, {"text": "TOR, and we will turn on the payload on different\nparts of the satellite to make sure that everything’s", "start": 393.819, "duration": 5.28}, {"text": "functioning properly when you put it in space\nand in addition to that, once it’s under", "start": 399.099, "duration": 4.77}, {"text": "vacuum, we have these thermal panels in there\nto simulate the hot and cold environment.", "start": 403.869, "duration": 4.41}, {"text": "So like, when you’re facing the sun and\nthe satellite gets really hot, we bring those", "start": 408.279, "duration": 4.67}, {"text": "temperature to bear and then we make it really\ncold when it’s facing away from earth in", "start": 412.949, "duration": 3.77}, {"text": "an eclipse type situation and make sure everything’s\nfunctioning properly.”", "start": 416.719, "duration": 3.391}, {"text": "Lastly, launch is very loud to the point that\nthe acoustic energy could actually damage", "start": 420.11, "duration": 4.799}, {"text": "a satellite so they make sure it doesn’t\nby simulating the launch environment through", "start": 424.909, "duration": 3.611}, {"text": "bombarding the satellite with acoustic energy\nwith speakers. There are a myriad of other", "start": 428.52, "duration": 4.259}, {"text": "tests performed before the satellite is given\nSSL’s stamp of approval, but once it’s", "start": 432.779, "duration": 4.25}, {"text": "ready, the satellite does, of course, need\nto get to the launch site. The customer decides", "start": 437.029, "duration": 4.59}, {"text": "which launch provider to use whether it be\nSpaceX, United Launch Alliance, Arianespace,", "start": 441.619, "duration": 4.181}, {"text": "or another so the satellite might only need\nto go as far as Vandenberg Air Force base", "start": 445.8, "duration": 4.2}, {"text": "a four hour drive away or as far as Baikonur\nCosmodrome in Kazakstan.", "start": 450.0, "duration": 4.65}, {"text": "The launch site is also partially decided\nbased off what sort of orbit the satellite", "start": 454.65, "duration": 3.62}, {"text": "is going into. If a satellite is going to\norbit in a north-south direction over the", "start": 458.27, "duration": 3.949}, {"text": "poles they want to launch in that direction\nso they want to launch from a site with open", "start": 462.219, "duration": 3.91}, {"text": "water to the north or south both for safety\nand, for some rocket designs, so stages of", "start": 466.129, "duration": 4.74}, {"text": "rockets can fall into the ocean throughout\nthe launch process. SpaceX, for example, therefore", "start": 470.869, "duration": 4.751}, {"text": "uses Vandenberg Air Force Base in California\nfor their polar orbit launches as it has the", "start": 475.62, "duration": 4.099}, {"text": "Pacific Ocean directly south. For geosynchronous\norbits where satellites travel from west to", "start": 479.719, "duration": 4.57}, {"text": "east at the same rate as earth rotates they\nwant to launch in the same direction as the", "start": 484.289, "duration": 4.541}, {"text": "satellite will orbit. For that reason they\ncan’t launch from Vandenberg as it has land", "start": 488.83, "duration": 3.509}, {"text": "to the east so SpaceX uses the launch pads\non Cape Canaveral, Florida as they have the", "start": 492.339, "duration": 3.98}, {"text": "Atlantic Ocean to the east. In the the case\nof Telstar 19 Vantage, it was going in geosynchronous", "start": 496.319, "duration": 5.12}, {"text": "orbit in order to stay consistently over it’s\nservice area so SSL needed to get the satellite", "start": 501.439, "duration": 4.32}, {"text": "all the way across the country to Florida.\nNo matter where a satellite is going, it gets", "start": 505.759, "duration": 4.23}, {"text": "packed up into one of these specialized shipping\ncontainers. For travel to closer launch sites", "start": 509.989, "duration": 4.4}, {"text": "within the US they’ll often drive. They’ll\nput the container on a truck driven by trusted", "start": 514.389, "duration": 4.21}, {"text": "oversize vehicle drivers, have a lead vehicle\nchecking for obstructions, a trailing vehicle", "start": 518.599, "duration": 4.23}, {"text": "watching to make sure nothing goes wrong,\nand for longer drives a motorhome so drivers", "start": 522.829, "duration": 3.7}, {"text": "can swap out and rest while still moving.\nIf the launch site is far, such as the ones", "start": 526.529, "duration": 4.24}, {"text": "overseas in French Guyana, in Kazakstan, or\neven the further ones in the US such as Cape", "start": 530.769, "duration": 4.311}, {"text": "Canaveral they’ll fly the satellite over\nin an Antonov cargo plane. Satellites arrive", "start": 535.08, "duration": 4.46}, {"text": "to their launch sites at least a month before\ntheir launch as there’s plenty of last minute", "start": 539.54, "duration": 3.77}, {"text": "preparation to do. They have to perform additional\ntesting to make sure nothing was damaged in", "start": 543.31, "duration": 4.86}, {"text": "transport, fuel it up, and mount it in the\nrocket.", "start": 548.17, "duration": 2.68}, {"text": "Once that happens, though, there’s a period\nwhere there’s really nothing for SSL to", "start": 550.85, "duration": 3.591}, {"text": "do. “As they go through the process of the\ncountdown there are a number of places where", "start": 554.441, "duration": 4.578}, {"text": "we’re asked to confirm that we’re ready\nfor launch, then they launch us and at that", "start": 559.019, "duration": 4.62}, {"text": "point we can no longer monitor our satellite\nuntil we’re off the launch vehicle so for", "start": 563.639, "duration": 6.551}, {"text": "about a half hour we’re hoping that the\nlaunch vehicle guys are doing everything ok", "start": 570.19, "duration": 5.399}, {"text": "and they usually are.” In the case of Telstar\n19 Vantage, the customer entrusted SpaceX", "start": 575.589, "duration": 4.831}, {"text": "with the responsibility of getting their satellite\nto orbit so on July 22nd, 2018 at 1:50 AM", "start": 580.42, "duration": 6.18}, {"text": "a Falcon 9 rocket lifted off from Cape Canaveral\ncarrying SSL’s latest creation to space.", "start": 586.6, "duration": 5.31}, {"text": "The launch of this satellite actually made\nthe record books as it is the heaviest commercial", "start": 591.91, "duration": 3.789}, {"text": "communications satellite to ever be entered\ninto service at 15,600 pounds. On that early", "start": 595.699, "duration": 5.961}, {"text": "morning in July, the Falcon 9 gained altitude\nas it flew south-east over Africa, then 32", "start": 601.66, "duration": 5.2}, {"text": "minutes and 40 seconds after launching, 358\nmiles above Mozambique, Telstar 19 Vantage", "start": 606.86, "duration": 5.459}, {"text": "was released from the rocket and gently pushed\nforward in the first moments of it’s 15", "start": 612.319, "duration": 4.46}, {"text": "year long orbit of earth.\nAt that point, the work’s not done for SSL,", "start": 616.779, "duration": 4.25}, {"text": "though. Their job is not just to build the\nsatellite but also to enter it into service", "start": 621.029, "duration": 4.721}, {"text": "in space. Once the satellite is deployed,\nSSL will look for its signal and establish", "start": 625.75, "duration": 4.93}, {"text": "communications. “We start commanding the\nsatellite, we tell the satellite what we want", "start": 630.68, "duration": 5.83}, {"text": "it to do, we start to get the satellite into\na safe position after launch, we’ll deploy", "start": 636.51, "duration": 7.33}, {"text": "solar arrays so we can start generating power,\nwe’ll start to activate everything on the", "start": 643.84, "duration": 4.88}, {"text": "satellite and we’ll put the satellite in\nthe safe condition so that the crew can start", "start": 648.72, "duration": 4.119}, {"text": "to get some rest.” Over the next ten days\nthere’s a process of firing the satellite’s", "start": 652.839, "duration": 4.25}, {"text": "engines to raise it from the altitude of 350\nmiles where it was deployed to 22,000 miles", "start": 657.089, "duration": 4.921}, {"text": "where it will stay for its service life. There’s\nthen another two to four weeks of testing", "start": 662.01, "duration": 4.36}, {"text": "to make sure everything survived launch and\nthen, finally, after years or work, it’s", "start": 666.37, "duration": 5.04}, {"text": "time to hand over the satellite to Telesat,\nthe customer, so they can put it online and", "start": 671.41, "duration": 4.099}, {"text": "start operating it commercially. At that point,\nafter years of work the satellite can finally", "start": 675.509, "duration": 5.051}, {"text": "itself be put to work.\nOne of the aspects of how satellites work", "start": 680.56, "duration": 4.709}, {"text": "that I found most interesting to learn about\nwhen I filmed this video was on how orbits", "start": 685.269, "duration": 4.051}, {"text": "work. The science of how you can make an object\norbit at such a consistent speed that it will", "start": 689.32, "duration": 3.819}, {"text": "stay still over one particular area of earth\nis fascinating and if you want to learn all", "start": 693.139, "duration": 3.88}, {"text": "about how that works, Brilliant teaches you\nexactly that in their classical mechanics", "start": 697.019, "duration": 4.26}, {"text": "course. Of course there’s more than just\norbits, this course provides a great overview", "start": 701.279, "duration": 3.891}, {"text": "of physics and with Brilliant, you’ll actually\nunderstand the concepts rather than just learning", "start": 705.17, "duration": 4.27}, {"text": "them. They specialize in teaching the intuitive\nprinciples behind concepts so that you learn", "start": 709.44, "duration": 4.99}, {"text": "the why. They also have plenty of other fascinating\ncourses on topics like astronomy, logic, and", "start": 714.43, "duration": 5.06}, {"text": "gravitational physics—a course that teaches\nhow planetary orbits work. All in all, Brilliant", "start": 719.49, "duration": 4.731}, {"text": "is a great place to learn and best of all,\nyou can try Brilliant classes for free by", "start": 724.221, "duration": 3.988}, {"text": "signing up at brilliant.org/Wendover and then,\nif you decide to upgrade to their premium", "start": 728.209, "duration": 4.68}, {"text": "account, the first 200 to do so at that link\nwill get 20% off.", "start": 732.889, "duration": 3.731}]