[{"text": "So after my alarm goes off, I might use it a couple of times but I try to get up and", "start": 18.289, "duration": 6.139}, {"text": "not stay in bed too long and", "start": 24.949, "duration": 2.239}, {"text": "Then I always make my bed first thing", "start": 28.22, "duration": 2.659}, {"text": "It just helps me start the day with a clean room and the clean mind", "start": 33.98, "duration": 4.16}, {"text": "And then I'll usually check my phones any text messages from last night that I missed", "start": 45.739, "duration": 6.59}, {"text": "And", "start": 54.199, "duration": 1.921}, {"text": "then I always check the weather because", "start": 56.12, "duration": 2.0}, {"text": "Boston weather is pretty variable and I like to be prepared for the day and pick out my outfit and", "start": 58.399, "duration": 5.119}, {"text": "Then I'll just go to the hallway bathroom and brush my teeth", "start": 64.43, "duration": 3.08}, {"text": "Wash my face to my skincare routine and just get ready for the day", "start": 67.79, "duration": 3.65}, {"text": "and", "start": 72.65, "duration": 1.8}, {"text": "then I don't do this every morning, but I try to", "start": 74.45, "duration": 2.959}, {"text": "do some yoga and stretch a little bit because I'm usually sore right when I wake up and I find that stretching just", "start": 77.93, "duration": 7.73}, {"text": "Helps me prepare for my day better and puts me in a really good mood", "start": 86.12, "duration": 2.959}, {"text": "And I love doing yoga, so I'm working on my practice", "start": 98.18, "duration": 3.29}, {"text": "And", "start": 110.84, "duration": 1.29}, {"text": "Then I do do this every day", "start": 112.13, "duration": 1.73}, {"text": "I like to meditate for like five to ten minutes because I find that it just really helps me clear my mind", "start": 113.86, "duration": 6.779}, {"text": "and get focused and kind of get rid of all of the", "start": 120.89, "duration": 3.47}, {"text": "Noise and the distracting thoughts that I'm always thinking about so it really helps me", "start": 124.79, "duration": 4.819}, {"text": "Just get my brain in a good mood for classes and just for enjoying things", "start": 129.92, "duration": 5.15}, {"text": "And", "start": 137.9, "duration": 1.86}, {"text": "Then I always make sure to take my vitamins every day", "start": 139.76, "duration": 2.54}, {"text": "So the ones that I use are by a company called care of and they're actually partnering with me on today's video", "start": 142.61, "duration": 6.08}, {"text": "so thank you so much care of and", "start": 148.69, "duration": 2.0}, {"text": "The thing I like about carob is that they're all", "start": 151.4, "duration": 2.029}, {"text": "specialized to your needs and", "start": 153.77, "duration": 1.74}, {"text": "They all come in these personalized little packets with your name on them and like a quote or fun fact for the day", "start": 155.51, "duration": 5.99}, {"text": "So they're actually really fun to take", "start": 161.51, "duration": 2.0}, {"text": "and", "start": 163.7, "duration": 1.38}, {"text": "Then it can be kind of difficult to know what you really should be taking and I know I've struggled with this", "start": 165.08, "duration": 4.969}, {"text": "So care of has this online quiz", "start": 170.209, "duration": 2.45}, {"text": "Where they will ask you questions about like your diet your lifestyle", "start": 173.15, "duration": 3.95}, {"text": "Your immune system kind of just your your body's needs and then they will personalize the vitamin recommendations for you", "start": 177.32, "duration": 6.289}, {"text": "So you're really only taking what you need to be taking just for your body", "start": 183.61, "duration": 3.479}, {"text": "So I really like this because everything is customized to my body and my diet and my exercise level", "start": 187.31, "duration": 6.739}, {"text": "So they know that I'm a student. They know that I'm vegan and", "start": 194.049, "duration": 3.45}, {"text": "Then they give recommendations based on that. So everything is specifically for me and like what I need to be taking", "start": 198.079, "duration": 6.41}, {"text": "and then it only takes about five minutes and then at the end you'll have", "start": 205.75, "duration": 3.529}, {"text": "Personalized recommendations for vitamins and for proteins if you need them, so these are mine", "start": 209.65, "duration": 5.36}, {"text": "so I have a veggie Omega because", "start": 215.01, "duration": 1.96}, {"text": "I'm vegan", "start": 216.97, "duration": 0.98}, {"text": "so I can't take fish oil, but I still want to get those omega-3s and then I also have", "start": 217.95, "duration": 4.41}, {"text": "plant protein because I need more protein in my diet and", "start": 222.58, "duration": 2.809}, {"text": "Then every month you'll get delivered to your door your own personalized", "start": 226.36, "duration": 3.319}, {"text": "Recommendation so there's my vitamin pack with my name on it and then protein with my name on it, too", "start": 230.2, "duration": 5.3}, {"text": "It's just really cool", "start": 235.5, "duration": 0.72}, {"text": "and", "start": 236.22, "duration": 0.82}, {"text": "Then there's also these little packets for on-the-go and they also have these little quick stick powders for a little pick-me-up", "start": 237.04, "duration": 5.3}, {"text": "So I got the ones for stress because I'm a student and I'm always stressed. So it really helps", "start": 242.38, "duration": 4.939}, {"text": "So Kara also has an app so you can set reminders to take your vitamins every day", "start": 247.959, "duration": 4.16}, {"text": "And then when you do take them you can work that you did", "start": 252.12, "duration": 2.88}, {"text": "so it's like a little game and you feel very accomplished which I like and", "start": 255.0, "duration": 3.45}, {"text": "Then for 50% off your first order go to take care of comm and enter the promo code Sienna 50", "start": 258.97, "duration": 6.949}, {"text": "Which is just for you guys. So I love taking them and I feel so healthy. So I really hope you guys do too", "start": 265.919, "duration": 6.51}, {"text": "So after I'm ready for the day I have a little bit of studying to do", "start": 274.21, "duration": 3.86}, {"text": "So my first class is Korean and I'm just doing a little bit of homework for that", "start": 278.34, "duration": 4.529}, {"text": "My handwriting is kind of bad don't judge me, but I'm trying to get better", "start": 291.31, "duration": 4.309}, {"text": "And", "start": 302.08, "duration": 1.71}, {"text": "then I just packed my bag for the day and make sure I have everything and", "start": 303.79, "duration": 4.309}, {"text": "Set out for my first class", "start": 308.86, "duration": 2.0}, {"text": "Most days I have time to get breakfast in the D Hall", "start": 325.21, "duration": 3.17}, {"text": "But today I didn't so I just went and picked up a green juice", "start": 328.38, "duration": 3.959}, {"text": "My first class of the day, it's Korean and it's in northwest labs so I had there", "start": 340.66, "duration": 5.029}, {"text": "Oh, that's ok", "start": 348.4, "duration": 3.44}, {"text": "This is my section leader east song singing and she's incredible, I love her I", "start": 354.52, "duration": 5.69}, {"text": "Have Korean every single day and I have so much fun in this class and", "start": 378.88, "duration": 4.399}, {"text": "Then after I'll head to lunch and this is Annenberg the freshman dining hall and this is where we eat all of our meals", "start": 384.22, "duration": 6.44}, {"text": "Thank you", "start": 393.33, "duration": 2.0}, {"text": "And", "start": 396.45, "duration": 1.5}, {"text": "This year they put in a plant-based section, which always makes me so happy", "start": 397.95, "duration": 4.339}, {"text": "I always feel like hugging the dining-hall workers", "start": 402.29, "duration": 2.19}, {"text": "whenever I see the amazing vegan food that they made and", "start": 404.58, "duration": 2.99}, {"text": "Then this is my friend Jonathan and we were just grabbing quick lunch before our classes and he was showing off his tattoo", "start": 407.67, "duration": 6.919}, {"text": "Next I head to my Women and Gender Studies class, which is my favorite class, and I look forward to it every single week", "start": 415.92, "duration": 6.859}, {"text": "And", "start": 424.71, "duration": 2.0}, {"text": "Then after classes are done for the day all head to the Smith Center, which is the Campus Center and", "start": 427.05, "duration": 6.32}, {"text": "I have a job there", "start": 433.89, "duration": 1.85}, {"text": "so I work at one of the desks and", "start": 435.74, "duration": 2.16}, {"text": "just kind of point people in directions and tell them where the bathroom is and I got to do my homework while doing it so", "start": 438.24, "duration": 5.36}, {"text": "It's pretty nice job", "start": 443.6, "duration": 1.3}, {"text": "And I usually sit there for about two or three hours. That's usually the length of one of my shifts", "start": 444.9, "duration": 5.57}, {"text": "After my shift is over", "start": 461.21, "duration": 1.31}, {"text": "I get a text from one of my friends saying we should go study on the lawn in front of Widener Library", "start": 462.52, "duration": 4.77}, {"text": "Because it's such a beautiful day. So we go put out a little blanket and", "start": 467.63, "duration": 4.13}, {"text": "Study, but also just kind of goof off. Ah", "start": 472.31, "duration": 2.54}, {"text": "This is one of my really good friends ma day, and she's a junior", "start": 486.08, "duration": 4.1}, {"text": "So I'm always happy when she wants to hang out with a first-year like me", "start": 490.18, "duration": 4.02}, {"text": "and", "start": 494.99, "duration": 1.44}, {"text": "then after studying of it we had to", "start": 496.43, "duration": 2.239}, {"text": "Tante to get some coffee and like an afternoon pick-me-up and do a little more studying together", "start": 499.07, "duration": 5.299}, {"text": "We were actually doing our taxes together, which was pretty funny", "start": 504.37, "duration": 2.73}, {"text": "We both have no idea how to do taxes and we're helping each other out", "start": 507.65, "duration": 3.32}, {"text": "Just used to let me buy her coffee and then bought mine", "start": 511.789, "duration": 3.26}, {"text": "And", "start": 518.719, "duration": 1.771}, {"text": "Tata is a favorite amongst Harvard students because it has really good food and coffee and it just has such a nice ambiance", "start": 520.49, "duration": 6.71}, {"text": "So I always come here to study", "start": 527.2, "duration": 2.0}, {"text": "and", "start": 529.97, "duration": 2.0}, {"text": "Then after ma day leads I really get to work on a draft for one of my papers for my expose class", "start": 531.98, "duration": 7.46}, {"text": "Which is like our expository writing class, which is a requirement for all freshmen", "start": 539.44, "duration": 3.779}, {"text": "Sometimes if I really need to focus I'll go to a", "start": 545.03, "duration": 2.479}, {"text": "Widener, but I really like coffee shop vibes and the kind of background noise", "start": 547.7, "duration": 4.639}, {"text": "So I really do a lot of my studying in coffee shops", "start": 552.339, "duration": 3.36}, {"text": "and", "start": 556.52, "duration": 2.0}, {"text": "Then it's back to the Berg which is what we call the freshmen dining hall and I'm getting dinner with my really good friend Lucy", "start": 558.53, "duration": 7.609}, {"text": "And", "start": 586.22, "duration": 1.35}, {"text": "Then after dinner we decided to go work out", "start": 587.57, "duration": 2.72}, {"text": "Which I usually like to do before dinner and I was really full so it probably wasn't the best idea", "start": 590.29, "duration": 5.01}, {"text": "But we went and did some cardio", "start": 595.64, "duration": 3.23}, {"text": "So I like to go on the elliptical machines and I'll usually go for like about an hour", "start": 598.88, "duration": 5.299}, {"text": "Maybe 45 minutes if I'm short on time and then I always listen to music because it helps me work out better", "start": 604.4, "duration": 6.619}, {"text": "So I'm listening to BTS, of course and make sure to stream map of the soul persona because it's a really good album", "start": 611.02, "duration": 7.23}, {"text": "And then this is us looking all sweaty, but very happy after an hour-long workout and then we just go to", "start": 631.4, "duration": 7.859}, {"text": "Some ab work together. I", "start": 639.96, "duration": 2.359}, {"text": "try to work out about", "start": 643.44, "duration": 2.0}, {"text": "Five days a week, but it doesn't always happen. So some weeks. It's more like three some weeks if it's really bad", "start": 645.48, "duration": 6.5}, {"text": "It's more like one but I always try to get a workout in because I think it's really important", "start": 651.98, "duration": 4.59}, {"text": "especially as a student you just cope with stress and", "start": 656.57, "duration": 2.789}, {"text": "Work your body break a sweat and it really helps with like my mental health and mental clarity. I think it's really important and", "start": 659.73, "duration": 6.95}, {"text": "Then after I always make sure to stretch", "start": 667.2, "duration": 2.239}, {"text": "and", "start": 670.14, "duration": 1.83}, {"text": "Then straight from the gym. I head to my women and business committee meeting and this is my chair Samantha. She's so cute", "start": 671.97, "duration": 7.25}, {"text": "I love her a lot. I really love my committee. We have a lot of fun", "start": 679.22, "duration": 3.36}, {"text": "And then when I get back it's a little after 9 p.m. So I just shower and get ready for bed", "start": 686.49, "duration": 7.309}, {"text": "That is me goofing off in trying to be cute and", "start": 706.17, "duration": 3.59}, {"text": "Then after I've done my skincare routine, and I'm fully ready for bed. I get in PJs and", "start": 710.73, "duration": 5.54}, {"text": "Do a little bit of reading and this is Virginia walls to the lighthouse", "start": 717.0, "duration": 3.859}, {"text": "So I always like to read before bed because I think it's a lot healthier than being on your phone", "start": 721.56, "duration": 4.19}, {"text": "Even though I'm definitely on my phone, you know, get off your phone", "start": 726.12, "duration": 3.289}, {"text": "at this point it's about", "start": 730.8, "duration": 2.0}, {"text": "Midnight and I just switch off the light and go to bed", "start": 733.14, "duration": 4.549}, {"text": "into it all again the next day I", "start": 738.3, "duration": 2.539}, {"text": "Really? Hope you guys enjoyed seeing a day in my life and make sure to LIKE and subscribe and I'll see you in the next", "start": 741.39, "duration": 7.19}, {"text": "Video. Thanks so much for watching", "start": 748.58, "duration": 2.0}]