[{"text": "Are you the person in the group who's always getting bitten by mosquitoes? Because I certainly am", "start": 0.0, "duration": 5.18}, {"text": "and science has shown that this is a thing - that mosquitoes are more attracted to some people", "start": 5.18, "duration": 4.1}, {"text": "than others. And the reason for that is at least partially genetic, which is why", "start": 9.28, "duration": 4.08}, {"text": "this video is supported by 23andMe, a company that reads sections of your genetic code", "start": 13.36, "duration": 4.9}, {"text": "and then helps you understand, what's in there.", "start": 18.26, "duration": 2.94}, {"text": "Now, they've actually been involved in some research that has identified particular spots on your DNA", "start": 21.6, "duration": 5.3}, {"text": "that make you more or less likely to be attractive to mosquitoes, and in this video", "start": 26.9, "duration": 4.959}, {"text": "I want to put that to the test. So I flew to New Mexico State University", "start": 31.86, "duration": 4.38}, {"text": "to meet mosquito man Professor Immo Hansen.", "start": 36.28, "duration": 2.96}, {"text": "Everyone: Hello!", "start": 41.02, "duration": 1.4}, {"text": "Hansen: We have a collection of lab strains", "start": 42.66, "duration": 2.46}, {"text": "Derek: Here, he maintains colonies of many different species of mosquitoes, and one exotic strain", "start": 45.2, "duration": 5.46}, {"text": "he actually feeds with his own blood(!)", "start": 50.76, "duration": 2.66}, {"text": "Hansen: No, no, I'm serious. These ones are made from my blood.", "start": 53.42, "duration": 3.2}, {"text": "D: Really!?\nH: Yes! Absolutely, yeah.", "start": 56.74, "duration": 2.04}, {"text": "D: You feed these!?\nH: And I'm the only one feeding them - I can't ask my students, you know, that would be a nightmare", "start": 58.9, "duration": 4.9}, {"text": "H: getting permissions to this room here.\nD: How do you blood feed them?", "start": 63.8, "duration": 2.76}, {"text": "D: With just, sticking your arm in there?\nH: Well, I just put my arm in there and wait", "start": 67.06, "duration": 3.78}, {"text": "D: Is it psychologically itchy or...?\nH: No it is really itchy [laughs]", "start": 72.12, "duration": 3.96}, {"text": "H: Yeah, and I'm getting, I mean, 25 bites or so right now", "start": 76.56, "duration": 3.44}, {"text": "D: Mosquitoes need our blood proteins to make their eggs, so only the female mosquitoes bite.", "start": 80.88, "duration": 5.54}, {"text": "The eggs hatch into these wriggly larvae, which develop into pupae", "start": 86.9, "duration": 4.28}, {"text": "before becoming flying, adult mosquitoes. Then they, once again, seek out vertebrate blood to make more eggs.", "start": 91.2, "duration": 6.62}, {"text": "The whole lifecycle takes just two weeks! But what I wanted to know is: am I a desirable target?", "start": 98.28, "duration": 7.02}, {"text": "D: How can we figure out if I'm attractive to mosquitoes?", "start": 105.82, "duration": 3.0}, {"text": "H: Okay, we have a Y-tube, basically, which has a holding chamber. We put the mosquitoes down here,", "start": 109.02, "duration": 5.879}, {"text": "H: there's a little fan inducing a draft, something like 4 m/s.", "start": 114.9, "duration": 3.94}, {"text": "We're gonna insert a bait into one of these chambers, in the green or the yellow one.", "start": 119.1, "duration": 5.76}, {"text": "D: So, by bait, you're saying me?\nH: Yes, you, exactly.\nD: [laughs]", "start": 125.16, "duration": 3.28}, {"text": "H: You put your hand in there. [It] would be good if you would rub your hand first, so", "start": 128.44, "duration": 4.48}, {"text": "H: If you're sweaty...\nD: Get some oils?\nH: Yes!", "start": 133.48, "duration": 2.46}, {"text": "D: This is the right spot...\nH: That's where the good stuff is, exactly.", "start": 135.94, "duration": 2.48}, {"text": "H: Almost feeds exclusively on humans. They are really specialized on biting humans.", "start": 140.78, "duration": 4.58}, {"text": "D: That's good to know...\nH: Yeah\n[both laugh]", "start": 145.98, "duration": 2.58}, {"text": "H: There's 20 mosquitoes in the holding chamber.", "start": 149.18, "duration": 2.26}, {"text": "D: And they're gonna decide whether to come and find me, or go down the other side and... they find nothing.", "start": 151.44, "duration": 6.4}, {"text": "H: Right.\nD: We're releasing the mosquitoes. I see them coming!", "start": 157.9, "duration": 3.48}, {"text": "D: Oh, he's chosen wrong!", "start": 161.66, "duration": 1.72}, {"text": "H: Do you see that?", "start": 165.38, "duration": 1.24}, {"text": "H: Man, you are attractive!", "start": 167.46, "duration": 2.0}, {"text": "D: Really?\nH: I mean, sorry I-\n[both laugh]", "start": 169.46, "duration": 3.24}, {"text": "H: You are a strong attractant to mosquitoes. They all went in your direction.\nD: None of them went the other way!", "start": 172.84, "duration": 6.58}, {"text": "D: (laughing) This is amazing!", "start": 180.26, "duration": 2.22}, {"text": "H: Well, there's one stranded in here\nD: I did not expect to have such a strong... response, like", "start": 182.96, "duration": 6.06}, {"text": "D: You see all those mosquitoes...", "start": 189.46, "duration": 2.0}, {"text": "D: This type of test was actually used to discover that the basis for our attractiveness to mosquitoes is at least partially genetic.", "start": 192.35, "duration": 6.589}, {"text": "Researchers recruited 18 pairs of identical female twins and 19 pairs of non identical, or fraternal female twins.", "start": 199.48, "duration": 7.26}, {"text": "Then they used the Y-tube Test to evaluate the mosquito attractiveness of each individual,", "start": 206.92, "duration": 4.46}, {"text": "measured by the fraction of mosquitoes who correctly flew to the arm of the tube where the twin was standing.", "start": 211.38, "duration": 4.96}, {"text": "What scientists found is that the mosquito attractiveness of twins is", "start": 216.83, "duration": 3.44}, {"text": "correlated, that is, the more attractive you are to mosquitoes, the more likely your twin is, too.", "start": 220.34, "duration": 4.54}, {"text": "But that's... not all that surprising, and could be caused by environmental factors, or a common diet.", "start": 225.16, "duration": 5.08}, {"text": "But, comparing identical twins to fraternal twins revealed the correlation was higher for identical twins.", "start": 230.24, "duration": 6.46}, {"text": "This strongly suggests genetics influence how attractive you are to mosquitoes.", "start": 237.44, "duration": 3.88}, {"text": "Since the identical twins share more of the same genes than fraternal twins, this explains", "start": 241.54, "duration": 4.74}, {"text": "why their mosquito attractiveness would be more closely correlated if it really is genetics that", "start": 246.28, "duration": 4.74}, {"text": "determines how much mosquitoes like you.", "start": 251.02, "duration": 2.0}, {"text": "D: With that last test, I was clearly attractive to these mosquitoes.\nH: Yes.\nD: Except we weren't comparing me to any other human,", "start": 253.7, "duration": 6.62}, {"text": "D: we were just comparing me to a control, no human.\nH: Exactly, yes.", "start": 260.32, "duration": 3.78}, {"text": "D: So, what if we compare myself with my wife Raquel? [laughs]\nH: Uh-huh?", "start": 264.46, "duration": 4.2}, {"text": "D: Normally, I get bitten and she doesn't.\nH: Okay.\nD: So this should be a good test... maybe?", "start": 268.66, "duration": 4.7}, {"text": "D: To see whether under lab conditions...", "start": 274.0, "duration": 2.0}, {"text": "H: We can we reproduce your...\nD: We'll reproduce our anecdotal finding. That I'm more attractive.\nH: Exactly, anecdotal evidence a little once again", "start": 276.58, "duration": 6.38}, {"text": "H: They are a little...\nD: Once again...", "start": 282.96, "duration": 2.0}, {"text": "D: ...preparing.", "start": 285.34, "duration": 0.94}, {"text": "H: Okay!\nD: Hands in position!\nRaquel: Yeah.", "start": 287.22, "duration": 2.38}, {"text": "H: Yeah, see, they actually start to wake up. They... smelled something. Something's going on here.\nR: Here we go.", "start": 289.6, "duration": 6.46}, {"text": "H: Okay. \nD: What are we seein'?", "start": 296.22, "duration": 2.0}, {"text": "D: Whoa!", "start": 298.74, "duration": 1.4}, {"text": "D: I'm getting a good amount over here, but so are you?", "start": 301.22, "duration": 3.1}, {"text": "D: Let's see. I think I'm getting more. It looks to me like you got three.", "start": 305.08, "duration": 3.9}, {"text": "H: Okay, I'm gonna stop the experiment right now.\nD: Alright.", "start": 309.12, "duration": 3.38}, {"text": "H: *chuck!* Okay, now let's count. I think it's seven on your side here?", "start": 312.76, "duration": 4.48}, {"text": "Lab assistant: Five in the holding.\nH: Five in the holding.", "start": 318.8, "duration": 3.2}, {"text": "H: And quite a few on your side!\n[Hansen and Derek laugh]", "start": 323.06, "duration": 3.5}, {"text": "H: So, who gets bitten?\nD: I get bitten.\nH: You get bitten!", "start": 326.66, "duration": 2.66}, {"text": "H: In reality, we would repeat this experiment, maybe eight times or so.", "start": 329.32, "duration": 3.86}, {"text": "D: Right.\nH: And switching you guys around, but I think this is a good way to show how this works.", "start": 333.3, "duration": 8.56}, {"text": "D: Okay, so that result was not particularly scientifically rigorous, but it did reproduce our experience in the wild,", "start": 342.36, "duration": 6.34}, {"text": "D: which is that I am much more attractive. ....Well at least when it comes to mosquitoes, than Raquel.", "start": 348.7, "duration": 6.34}, {"text": "D: But the question is, I guess, does this come down to our genetics?", "start": 355.46, "duration": 3.14}, {"text": "R: Yeah, so, we spat into some tubes and sent them off to be tested.\nD: Right, and we were interested in seven particular", "start": 359.24, "duration": 6.18}, {"text": "D: locations on our DNA, which were located in a 2017 study that involved 23andMe.", "start": 365.42, "duration": 5.78}, {"text": "D: So the way 23andMe works is, when you sign up, you can opt in to be part of research,", "start": 371.2, "duration": 4.54}, {"text": "D: and 16 000 people agreed to be part of this study and rate their perceived attractiveness to mosquitoes.", "start": 375.92, "duration": 5.42}, {"text": "D: So then what the scientists did was a genome-wide association study, that is, they looked at all the DNA", "start": 381.46, "duration": 5.78}, {"text": "D: of all of those participants and tried to see if there were commonalities amongst the people who", "start": 387.26, "duration": 5.34}, {"text": "D: said they were attractive to mosquitoes and that were different to the people who said they weren't attractive to mosquitoes.", "start": 392.6, "duration": 5.32}, {"text": "D: And they identified seven particular locations on the DNA. Seven single letter changes which seemed", "start": 397.92, "duration": 6.36}, {"text": "D: to be associated with different levels of attractiveness to mosquitoes.", "start": 404.28, "duration": 3.56}, {"text": "D: So we have our results back, and do you wanna see them?\nR: I do. I do, I'm very curious.", "start": 407.84, "duration": 4.78}, {"text": "D: Alright, let's pull it up here.", "start": 412.62, "duration": 2.04}, {"text": "D: Okay, so of the seven locations that are related to mosquito attractiveness, it turns out we have the identical DNA at four of them.", "start": 414.86, "duration": 8.02}, {"text": "D: So you can rule those out.\nR: Okay.\nD: Which leaves only three areas where we actually have differing", "start": 423.06, "duration": 5.08}, {"text": "D: DNA. So, at the first location, you have one copy of a letter change which actually makes you significantly", "start": 428.32, "duration": 7.34}, {"text": "D: *protected* from mosquitoes.\nR: Oh, no way!", "start": 435.9, "duration": 2.76}, {"text": "D: Yeah, it's associated with decreased attractive to mosquitoes\nR: Oh, that's cool!", "start": 438.66, "duration": 2.79}, {"text": "D: I do not have any letter changes at that location. Now, at the second location where we differ, I have", "start": 441.45, "duration": 7.79}, {"text": "D: a letter change compared to you that makes *me* less attractive to mosquitoes, so more protected.", "start": 449.52, "duration": 6.32}, {"text": "R: Interesting.\nD: If you look at the significance of those two letter changes,", "start": 456.04, "duration": 3.22}, {"text": "D: yours is about twice as significant than mine.\nR: Okay.", "start": 459.72, "duration": 3.08}, {"text": "D: But still we both have a protective letter switch. So, in the last snip we actually differ significantly.", "start": 463.1, "duration": 7.66}, {"text": "D: And I have two copies of a variant that makes me more attractive to mosquitoes.", "start": 471.12, "duration": 6.0}, {"text": "D: This was the only snip which was associated with being more attractive to mosquitoes,", "start": 477.18, "duration": 4.24}, {"text": "D: and I have two copies of that change, and you have no copies of that change.", "start": 481.52, "duration": 5.6}, {"text": "R: So that makes sense.\nD: So overall, I would say our genetics really adds up here.", "start": 487.28, "duration": 5.2}, {"text": "D: And of course, we can't say that this proves that it is right, but it is definitely consistent", "start": 492.58, "duration": 5.06}, {"text": "D: with these snips actually being associated with your attractiveness to mosquitoes, and that's sort of...", "start": 497.64, "duration": 4.8}, {"text": "D: borne out by our experience.\nR: That's so cool!", "start": 502.6, "duration": 2.4}, {"text": "D: Now, it's unclear exactly how these genetic changes might make us more or less attractive to mosquitoes,", "start": 505.22, "duration": 5.54}, {"text": "but it's likely that it has something to do with the odor or the volatile chemicals", "start": 510.86, "duration": 5.06}, {"text": "that our bodies give off, and due to the microbiome, the bacteria on our skin.", "start": 515.92, "duration": 4.42}, {"text": "One of the main signals that mosquitoes like to follow is carbon dioxide.", "start": 520.6, "duration": 4.32}, {"text": "So that means if you have a higher metabolism, or if you've just been exercising, or if you're a bigger person, or even if you're pregnant,", "start": 525.04, "duration": 6.48}, {"text": "you are more likely to attract mosquitoes. But mosquitoes are also attracted to some other volatiles", "start": 531.52, "duration": 6.02}, {"text": "that we give off, things like lactic acid, acetone and ammonia.", "start": 537.54, "duration": 4.12}, {"text": "But scientists have also found some chemicals that repel, or appear to impair mosquitoes' ability to find us.", "start": 541.8, "duration": 7.18}, {"text": "Those chemicals we naturally give off are octanal, nonanal, decanal, and 6-methyl-5-hepten-2-one.", "start": 549.46, "duration": 8.32}, {"text": "So, why is this important?", "start": 557.78, "duration": 1.9}, {"text": "Well the researchers estimate that our attractiveness to mosquitoes is about as hereditary as height", "start": 559.68, "duration": 5.52}, {"text": "or IQ, that is to say genetics play a significant role here, so", "start": 565.2, "duration": 4.58}, {"text": "understanding that relationship is really important, especially when you consider that, of all the animals,", "start": 570.1, "duration": 4.66}, {"text": "mosquitoes have the greatest impact on human health.", "start": 574.88, "duration": 2.64}, {"text": "D: Are mosquitoes the worst animal of all time for humans?\nH: Absolutely.", "start": 577.52, "duration": 3.52}, {"text": "H: Absolutely, there's no question about that. Malaria has killed more people than people have killed people. They are the most dangerous animal in the world.", "start": 581.24, "duration": 7.68}, {"text": "D: By some estimates, mosquitoes have killed more than half of the humans who have ever lived.", "start": 589.58, "duration": 5.4}, {"text": "Now, that estimate has been debated and is likely too high, but even so, this year, over a million people will die", "start": 595.22, "duration": 7.36}, {"text": "of mosquito-borne illnesses. So if not half, certainly a significant number of humans have died", "start": 602.58, "duration": 5.98}, {"text": "due to mosquitoes, probably more than any other single cause, which led me to wonder:", "start": 608.56, "duration": 4.8}, {"text": "D: Do you think humans may have evolved this trait to smell worse to mosquitoes as an adaptation to avoid the diseases? Or...", "start": 613.36, "duration": 7.46}, {"text": "D: is it just by accident that some people are less attractive to mosquitoes than others?", "start": 620.82, "duration": 3.92}, {"text": "H: .......", "start": 625.78, "duration": 1.78}, {"text": "H: ...That is a really good question!\n[both laugh]", "start": 627.56, "duration": 3.06}, {"text": "D: And while we're on the subject of evolution, consider this:", "start": 630.96, "duration": 3.14}, {"text": "if you ever contract malaria, it actually changes your body chemistry", "start": 634.1, "duration": 5.48}, {"text": "to make you produce an odor that makes you more attractive to mosquitoes.", "start": 639.58, "duration": 4.38}, {"text": "Think about that! The malaria parasite has evolved so that, when it's in its host,", "start": 644.3, "duration": 5.86}, {"text": "it makes the host more attractive to mosquitoes... mosquitoes are the thing that transmit malaria!", "start": 650.16, "duration": 6.2}, {"text": "It's phenomenal! I mean evolution is incredible!", "start": 656.62, "duration": 4.02}, {"text": "[Veritasium logo]", "start": 662.02, "duration": 1.72}, {"text": "This episode of veritasium is supported by 23andMe, a company whose name comes from the fact that", "start": 664.82, "duration": 5.56}, {"text": "humans have 23 pairs of chromosomes, and the point of the company is to help people", "start": 670.38, "duration": 4.1}, {"text": "understand what's written in your chromosomes. Now, at the minute, you can't get access to", "start": 674.48, "duration": 4.72}, {"text": "the mosquito attractiveness test, but maybe, one day in the future, you will be able to.", "start": 679.2, "duration": 4.38}, {"text": "Right now, you can access tons of information about your physical traits, about aspects of your health,", "start": 683.58, "duration": 5.12}, {"text": "and about where you DNA and, I guess, you come from. So I thought I would share my results with you.", "start": 688.7, "duration": 5.66}, {"text": "I come from all over the world as you can see from the map, but significantly more from Europe, about 95% European.", "start": 694.36, "duration": 6.36}, {"text": "You can drill down into that and see that I'm largely British and Irish, and French and German, with a bit of Scandinavian.", "start": 700.72, "duration": 5.8}, {"text": "What's interesting to me is, there's a 3.3% South Asian which is something I think my family suspected,", "start": 706.62, "duration": 7.16}, {"text": "but didn't know for sure, so it's interesting the types of information you can find out which is stored in your DNA.", "start": 713.82, "duration": 5.16}, {"text": "So, if you wanna find out about the information in your DNA, you can go to 23andme.com/veritasium.", "start": 719.08, "duration": 5.62}, {"text": "So I want to thank 23andMe for supporting Veritasium, and I want to thank you for watching.", "start": 724.88, "duration": 4.56}]