[{"text": "The Earth spins once per day.", "start": 1.4, "duration": 1.9}, {"text": "Which means that if you live at the Equator,", "start": 3.3, "duration": 1.52}, {"text": "The surface of the Earth with you on it,", "start": 4.82, "duration": 1.58}, {"text": "is moving around a thousand miles per hour to the East,", "start": 6.4, "duration": 3.02}, {"text": "relative to the centre of the Earth.", "start": 9.42, "duration": 1.78}, {"text": "Even at 45º latitude,", "start": 11.2, "duration": 2.0}, {"text": "the Earth's surface is moving 700 miles per hour to the East.", "start": 13.2, "duration": 3.34}, {"text": "So it kinda seems like it should be faster for airplanes to fly west.", "start": 16.54, "duration": 3.64}, {"text": "I mean, their destination is literally spinning towards them.", "start": 20.18, "duration": 2.92}, {"text": "At the same time however, they are spinning away from their destination.", "start": 23.1, "duration": 4.0}, {"text": "When we say the earth is going 1000 mph to the east,", "start": 27.1, "duration": 3.24}, {"text": "that means that the ground, and airplanes on the ground, and even the air above the ground are all also moving 1000 mph to the east.", "start": 30.34, "duration": 7.2}, {"text": "For an airplane to get anywhere, it has to start moving relative to the ground and through the air", "start": 37.54, "duration": 4.64}, {"text": "at something like 100 or so mph.", "start": 42.18, "duration": 2.8}, {"text": "So when it flies east, it's actually moving 1000 plus 100 mph to the east,", "start": 44.98, "duration": 4.8}, {"text": "and when it flies west, it's actually moving 1000 minus 100 mph, to the east.", "start": 49.92, "duration": 5.52}, {"text": "Yes, to go west you go east, just slower than the Earth is going east.", "start": 55.46, "duration": 3.78}, {"text": "Unless you're within ten or so miles of the poles, in which case a brisk westward walk will take you legitimately west.", "start": 59.24, "duration": 6.32}, {"text": "That said, planes do often take different amounts of time to fly the same route in different directions,", "start": 65.56, "duration": 5.28}, {"text": "because of winds in the upper atmosphere like the jetstream that they either have at their tail, or have to fly into.", "start": 70.88, "duration": 5.28}, {"text": "The prevailing direction of these winds is largely caused by the Coriolis effect,", "start": 76.16, "duration": 4.0}, {"text": "which is caused by the fact that different parts of the Earth are moving east at different speeds, which happens because the Earth is round and spinning.", "start": 80.16, "duration": 7.28}, {"text": "So, airplane travel times are influenced by the rotation of the Earth, just not in a straightforward way.", "start": 87.44, "duration": 8.0}]