[{"text": "- We had a potential brand integration with Tom Cruise, like we were gonna go to like-", "start": 2.11, "duration": 4.399}, {"text": "- Tom Cruise is here right now. Yeah, I just, from what I hear, he's one of the nicest most professional people,", "start": 8.139, "duration": 6.77}, {"text": "- I mean, I just can't say enough about how much of a special honor this is.", "start": 14.909, "duration": 3.591}, {"text": "- He's, he's right there!", "start": 18.52, "duration": 1.52}, {"text": "- He's right there, he's outside!", "start": 20.04, "duration": 2.0}, {"text": "- Tuck it, tuck it, tuck it, tuck it!", "start": 22.52, "duration": 2.24}, {"text": "- I'm just trying to be natural, I don't wanna be awkward.", "start": 27.62, "duration": 1.94}, {"text": "- Just be yourselves.", "start": 30.0, "duration": 2.0}, {"text": "- Hey!", "start": 33.66, "duration": 0.5}, {"text": "- How're you doing?", "start": 34.16, "duration": 0.64}, {"text": "- Good, how are you? I'm Jake.", "start": 34.8, "duration": 1.24}, {"text": "- Pleasure to meet you.", "start": 36.04, "duration": 0.6}, {"text": "- Nice to meet you.", "start": 36.64, "duration": 0.5}, {"text": "- Nico! Hey, Nick.", "start": 37.14, "duration": 0.88}, {"text": "- Hey, good to meet you.", "start": 38.22, "duration": 0.8}, {"text": "- Clinton! I've heard a lot about you.", "start": 39.02, "duration": 2.36}, {"text": "- How's tether going, is it good?", "start": 41.4, "duration": 2.42}, {"text": "- Got the financing yet?", "start": 44.06, "duration": 2.0}, {"text": "- We've been struggling with that a little bit.", "start": 46.06, "duration": 1.64}, {"text": "- Well, you know it takes time but you know, I'm here to help I'm a helper. Yeah, that's what I do", "start": 47.7, "duration": 3.44}, {"text": "- Help me help you!", "start": 51.42, "duration": 2.0}, {"text": "- (laughing)\n- Yeah, I mean-", "start": 53.42, "duration": 0.88}, {"text": "- we'd love for you to help us any way you can with that. \n- Well, tell me about Dobby, is Dobby causing you trouble still?", "start": 54.3, "duration": 5.04}, {"text": "- Every day.", "start": 59.34, "duration": 0.5}, {"text": "- How do you know about Dobby?", "start": 59.84, "duration": 0.98}, {"text": "- I follow everything,", "start": 60.82, "duration": 1.0}, {"text": "- I mean, I might say got my finger on the pulse, you know, I mean the zeitgeist!", "start": 61.82, "duration": 3.04}, {"text": "- (laughing) Woo!", "start": 64.86, "duration": 1.8}, {"text": "- You follow us?\n- I follow you yeah if I know everything about you.", "start": 66.66, "duration": 3.4}, {"text": "- Wait, are you subscribed to the channel?", "start": 70.06, "duration": 1.84}, {"text": "- Right, I rung the bell. \n- Yeah?", "start": 71.9, "duration": 1.52}, {"text": "- To get a little subscription plus action,\n- Yeah!", "start": 73.42, "duration": 1.8}, {"text": "- and I'm having the time of my life.", "start": 75.22, "duration": 1.24}, {"text": "It's such an honor. It's an honor and a privilege. They don't forget that that's so cool", "start": 76.46, "duration": 4.34}, {"text": "Did you see the Tom Cruise impersonation like Olympics that we did? Yes. Yes, and I heard you won. Usually you tucked your shirt", "start": 80.88, "duration": 6.12}, {"text": "Mm-hmm. Well, you know, what? Can you untuck it while I'm here cuz it's making me a little uncomfortable", "start": 87.1, "duration": 3.26}, {"text": "Sure. Yeah. Yes just right now thank you. It was just a fun thing", "start": 91.72, "duration": 3.169}, {"text": "I know I know but his past is in the past and I live in the moment. Yeah. Yes. Yeah", "start": 94.89, "duration": 3.779}, {"text": "Yeah, totally be too good. Yeah, let's let's let's uh, show me around watch it. Yeah, show me how it rail the magic. Yeah", "start": 98.67, "duration": 5.639}, {"text": "yeah, I", "start": 104.31, "duration": 2.0}, {"text": "Love water. Yes, maybe a pastrami sandwich. Thank you. So if you couldn't already tell this is not the real Tom Cruise", "start": 106.57, "duration": 5.72}, {"text": "It's actually a deep fake and here's how he made it", "start": 112.29, "duration": 2.309}, {"text": "Actually have some slight adrenaline going my heart is fluttering right now what we're trying here could get real crazy done", "start": 118.72, "duration": 7.309}, {"text": "Two words you want a Sam Neko deep fix", "start": 135.52, "duration": 2.96}, {"text": "President Trump is a total and complete", "start": 139.63, "duration": 2.0}, {"text": "Find them show me a leadership capability", "start": 142.36, "duration": 2.509}, {"text": "Deep fake is basically training a computer based on pattern and the image recognition", "start": 147.19, "duration": 3.949}, {"text": "to understand the structure of a human face in one of the byproducts of this is that you can accurately", "start": 151.39, "duration": 4.91}, {"text": "Replicate someone else's face onto another person's face. Now this gave me an idea", "start": 156.61, "duration": 4.4}, {"text": "I want to put Tom Cruise George Tom Cruise. I would put his face on a celebrity impersonator", "start": 161.01, "duration": 5.25}, {"text": "Back to normal they go and someone that can act like Tom Cruise", "start": 167.35, "duration": 2.809}, {"text": "So when that looks like Tom Cruise someone that sounds like Tom Cruise", "start": 170.16, "duration": 3.509}, {"text": "Would it be indistinguishable from the real thing", "start": 176.2, "duration": 2.0}, {"text": "Does this mean that you can put any movie star you want into your videos if these defects end up working its gonna have some?", "start": 178.36, "duration": 5.539}, {"text": "pretty big implications", "start": 183.9, "duration": 1.15}, {"text": "In the world of not only film and television but also news and media and if it doesn't look good then we got some solid", "start": 185.05, "duration": 5.689}, {"text": "Nightmare fuel coming up. So let's go see what happens", "start": 190.78, "duration": 2.899}, {"text": "Yeah, do you know any celebrity impersonators?", "start": 194.44, "duration": 3.41}, {"text": "Yeah", "start": 197.89, "duration": 0.5}, {"text": "I mean kind of funny", "start": 198.39, "duration": 1.27}, {"text": "Literally just over this weekend. Justin Bieber tweeted that he wants to take Tom Cruise in a fight in the Octagon", "start": 199.66, "duration": 5.6}, {"text": "I don't know why but this official Tom Cruise impersonator replied", "start": 205.26, "duration": 3.179}, {"text": "It was exactly like Tom Cruise battle normally fight girls Justin Bieber", "start": 208.44, "duration": 5.279}, {"text": "He looks just yeah, he's that guy from LA yes, I believe he is", "start": 216.34, "duration": 3.8}, {"text": "I think we sent a guy a DM he would respond to us. Actually not Tom Cruise being our video", "start": 220.14, "duration": 5.069}, {"text": "I'm gonna tweet you right now. All right, so I'm going to be using a program called the deep face labs", "start": 225.209, "duration": 5.49}, {"text": "It's actually free and get on now", "start": 230.7, "duration": 2.039}, {"text": "If you want to deep pics of your own they're going to need a pretty decent graphics card", "start": 232.739, "duration": 3.419}, {"text": "And you need a lot of video RAM thanks to Puget setting us up with a solid workstation here", "start": 236.159, "duration": 5.04}, {"text": "I can run these deep fakes on this computer in pretty high resolution without too much strain", "start": 241.2, "duration": 3.779}, {"text": "You want to see what kind of specs a fugitive there's a link in the description below", "start": 244.98, "duration": 3.24}, {"text": "Here is my source video of my face the more structure more", "start": 248.579, "duration": 3.99}, {"text": "Variations I can give the program with my face the more the program can learn what happened today", "start": 253.12, "duration": 5.119}, {"text": "One of the issues people have said is like hey, I baked this person", "start": 258.239, "duration": 2.91}, {"text": "But they don't blink at all and that's because they don't have any frames for to learn where the eyes are closed me", "start": 261.15, "duration": 4.829}, {"text": "Make sure you provide it with all these different poses all these different profiles and perspectives and now I'm going to be putting it on", "start": 265.979, "duration": 5.22}, {"text": "Rent here", "start": 271.199, "duration": 0.571}, {"text": "so once I'm ready to go once I have much in video clips", "start": 271.77, "duration": 2.25}, {"text": "I need to extract the faces the program's going in and actually doing some facial recognition. Here are the eyes. Here's the nose", "start": 274.02, "duration": 5.459}, {"text": "Here's the mouth just to isolate the face and a line once I've extracted the faces", "start": 279.479, "duration": 3.75}, {"text": "I need to train the program into how the faces work the faces on the left are the ground truth", "start": 283.229, "duration": 4.92}, {"text": "So speak they are my face from a picture the blurry thing next to it is a cork", "start": 288.15, "duration": 4.799}, {"text": "I'm going to iteration by iteration by iteration", "start": 292.949, "duration": 1.931}, {"text": "looking at the pictures and trying to learn and trying to match it and the closer it can get it's", "start": 294.88, "duration": 3.859}, {"text": "Artificially generated image to the actual ground truth image the better", "start": 298.84, "duration": 3.199}, {"text": "It's doing little by little it has become clearer and clearer", "start": 302.039, "duration": 3.18}, {"text": "Then we have Ren his ground truth of his face in the synthesized version his face and on the far right we see the computer", "start": 305.22, "duration": 6.089}, {"text": "Trying to recreate my face based on Ren's structure", "start": 311.31, "duration": 3.119}, {"text": "So friends making a funny face at this mouth open the computer is trying to go", "start": 314.43, "duration": 3.419}, {"text": "Okay, what would Nico's face look like with the mouth open?", "start": 317.849, "duration": 2.1}, {"text": "And it's trying to put my face into that pose", "start": 319.96, "duration": 2.329}, {"text": "Basically anytime Bryn's expressions don't match things that I've done the computer is having a hard time filling in the gaps", "start": 322.66, "duration": 5.179}, {"text": "It needs a little more training as to what that looks like so I can go back and we could try to find more pictures", "start": 327.84, "duration": 3.899}, {"text": "Of me in that pose. I could just take me pictures, you know, it should clean that up for the sake of this test", "start": 331.74, "duration": 4.049}, {"text": "I'm not too worried about that", "start": 335.789, "duration": 0.75}, {"text": "If I have any issues like this in the Tom Cruise test, I will go through and find pieces", "start": 336.539, "duration": 3.45}, {"text": "I need to fix it to make sure that it's flawless. This guy's really talented", "start": 339.99, "duration": 4.049}, {"text": "So these deep fakes are pretty sweet, right?", "start": 344.5, "duration": 2.299}, {"text": "But I wanted to let you guys in on a little secret of something that I've been doing. That's even more convincing", "start": 346.8, "duration": 5.19}, {"text": "It's called shallow fakes and shallow fakes are so simple and easy to use but it's almost like today's sponsor", "start": 352.05, "duration": 6.42}, {"text": "Squarespace it looks just like them", "start": 358.96, "duration": 2.0}, {"text": "It does five put this on I can go around and actually convince people in the studio that I'm Niko you here. Ready? Just wait", "start": 361.05, "duration": 6.529}, {"text": "Niko hey, Nick you guys might have thought that that was Niko. It's Jake", "start": 369.06, "duration": 3.98}, {"text": "Hey Christian, what's up me go. Would you mind if I told you a little some about today's sponsor Squarespace?", "start": 377.25, "duration": 5.39}, {"text": "Sure Squarespace is an all-in-one platform. It's the best way to build a business or just a website online makes me go. You're welcome", "start": 383.01, "duration": 6.799}, {"text": "What are you working on", "start": 391.41, "duration": 2.0}, {"text": "Nico you look a little pale, you know", "start": 394.11, "duration": 2.24}, {"text": "I'm still waiting for summer to come in beautiful thing about Squarespace is that you can do", "start": 396.35, "duration": 3.72}, {"text": "Simultaneous posting where if you post something on Squarespace can also show up on your Twitter and Facebook beat, isn't that cool?", "start": 400.44, "duration": 5.149}, {"text": "Yeah, I didn't actually know you can do that", "start": 405.59, "duration": 1.86}, {"text": "I think Jake learned today that you can post audio like a podcast on to Squarespace", "start": 407.45, "duration": 4.829}, {"text": "It'll just embed it and make it easy to access for all your fans. They have multiple contributors", "start": 412.31, "duration": 4.47}, {"text": "You guys could contribute to order Digital calm", "start": 416.85, "duration": 3.019}, {"text": "Hey, would you would you like to would you like to go on a one wheel ride later? I'm one wheel", "start": 419.87, "duration": 3.809}, {"text": "It's kind of batteries. But you wanna make cheese or sausage later. I'm a little full but I'll be hungry eventually cool. Hey Dean", "start": 423.68, "duration": 6.089}, {"text": "Hey how have your first few weeks been here at corridor? They've been great Nikko. Thanks", "start": 430.02, "duration": 5.18}, {"text": "Thanks for asking. Dean Squarespace allows you to own all the content that you post on your website", "start": 435.2, "duration": 5.25}, {"text": "Apparently there are some rumors out there or if you didn't own the content that you post on Squarespace that's untrue", "start": 440.52, "duration": 4.459}, {"text": "Do I look like I'd lie about that. No, no Nikko. I don't think you would", "start": 444.979, "duration": 3.42}, {"text": "There you have it Oh Jim's coming. Jen's gonna be here any minute", "start": 449.61, "duration": 3.2}, {"text": "Don't go out there Nico be careful it is I Nico", "start": 458.86, "duration": 4.16}, {"text": "It's just me", "start": 466.75, "duration": 2.0}, {"text": "If you guys are interested in creating your own", "start": 474.79, "duration": 2.0}, {"text": "Beautiful website go to Squarespace comm slash core or Cru and you get 10% off your first purchase of a URL or a website template", "start": 477.01, "duration": 7.7}, {"text": "enjoy", "start": 485.02, "duration": 2.0}, {"text": "Evan Ferrante aka not Tom Cruise is confirmed coming on was a down", "start": 487.21, "duration": 4.759}, {"text": "Oh wait, you think you can run at as much of an angle as I can?", "start": 491.97, "duration": 3.63}, {"text": "I was excited to have a celebrity impersonator in the studio. This works. It's gonna look pretty bizarre. It's gonna look like he's here", "start": 495.6, "duration": 5.309}, {"text": "Hey", "start": 502.39, "duration": 1.2}, {"text": "Vijay Niko. Yes, Kevin. Yeah Jake. What's up? Jake? Nice to meet you. Yeah", "start": 503.59, "duration": 4.069}, {"text": "When did you realize this was the thing my friend? He does a John Claude Van Damme impression. Does he do the splits?", "start": 507.69, "duration": 5.22}, {"text": "You didn't do the splits. Oh, he did that bit", "start": 512.91, "duration": 2.039}, {"text": "he said you sound and look and have the", "start": 514.95, "duration": 1.99}, {"text": "Mannerisms of the crews and he said let's like team up and meet women this way and I didn't even have glasses at the time", "start": 516.94, "duration": 5.72}, {"text": "I didn't have a wig which I do today", "start": 522.66, "duration": 1.53}, {"text": "I don't want to I don't like to break the illusion and it turned into a career. It's totally surreal", "start": 524.19, "duration": 4.35}, {"text": "I've had like a little bit of a loss of identity through the years the guy Mike Who am I you'll ever met Tom Cruise", "start": 528.55, "duration": 5.45}, {"text": "You had I didn't go to sleep that night", "start": 534.28, "duration": 2.029}, {"text": "I went I was at the Chateau as one does you know like I knew someone at another table this attorney guy", "start": 536.37, "duration": 5.1}, {"text": "He called me over. He said I heard Tom Cruise's in the building", "start": 541.47, "duration": 2.969}, {"text": "I had been in personally for eight years at that time, but my heart was racing, you know, I was getting sweaty", "start": 544.47, "duration": 3.899}, {"text": "He wasn't there like and I go back to my seat kind of resigned to the fact that I wasn't gonna meet him", "start": 548.37, "duration": 4.29}, {"text": "I just suddenly feel like this energy to the side of me", "start": 552.66, "duration": 2.579}, {"text": "He's right there, but you cannot you cannot talk to celebrities in the garden and you cannot talk to Tom Cruise", "start": 555.24, "duration": 4.71}, {"text": "He kind of gets up and like, you know, which makes people and just like it says goodbye just like this is amazing", "start": 559.99, "duration": 5.51}, {"text": "That's what I do and he leaves it's just me and my friend Jimmy in the that's it", "start": 565.5, "duration": 4.389}, {"text": "It's 2:00 in the morning and suddenly he gets a call. He said to me Tom Cruise is waiting for you in the lobby", "start": 569.889, "duration": 5.789}, {"text": "no, and I", "start": 575.679, "duration": 1.27}, {"text": "Said shut the he was and I get up out of my chair", "start": 576.949, "duration": 3.38}, {"text": "I sprint from the guard and I just sprint was this I go lobby. Yeah, he was there waiting for me", "start": 580.329, "duration": 5.19}, {"text": "It's I swear time stopped. It was like a slow turn and we it's like a cataclysmic reaction. We just like mutual appreciation", "start": 585.519, "duration": 6.869}, {"text": "Admiration we both said at the same time. It's an honor and a privilege to meet you and I", "start": 593.299, "duration": 4.7}, {"text": "Could not it was the most surreal thing ever the most exciting moment of my life", "start": 599.179, "duration": 3.679}, {"text": "Nothing else mattered except for us in that moment. We fell in love", "start": 603.129, "duration": 3.0}, {"text": "I'd like to show you the technology that we face please a little intro to the video. I'm talking about the technology. Yeah", "start": 607.279, "duration": 5.269}, {"text": "Oh my god. Thank you. And that's Tom on you", "start": 612.579, "duration": 3.0}, {"text": "Yeah, very scary Computers learning the actual structure of Tom Cruise's manners into the expressions. It's learning it", "start": 615.579, "duration": 5.969}, {"text": "Yeah, but we did a we did a Tom Cruise contest okay to do a few months back", "start": 621.549, "duration": 3.72}, {"text": "I did end up winning give you some example. Oh, yeah, what is it you do. I'll just do a little montage", "start": 625.269, "duration": 4.71}, {"text": "Let's see what it's like without any deep take right now. Let's see how close we get", "start": 629.98, "duration": 2.819}, {"text": "This is it. This is it. It's gonna make sure that here's it, you know already start to hear it in my voice", "start": 634.22, "duration": 4.699}, {"text": "I'm just gonna do a countdown 5, 4,", "start": 638.92, "duration": 3.28}, {"text": "3, 2", "start": 643.28, "duration": 2.0}, {"text": "1", "start": 645.58, "duration": 0.52}, {"text": "You don't know what it's like to be out here for you", "start": 649.12, "duration": 2.8}, {"text": "It is a pride falling up at dawn siege that I can never fully tell you", "start": 651.94, "duration": 4.289}, {"text": "That's just help me help you! Help me help you!", "start": 656.23, "duration": 4.41}, {"text": "My name is Nico Clemens Nico. Yeah, who's got a short-term memory? I shake a lot of hands you", "start": 665.3, "duration": 4.64}, {"text": "Clean let's say I've been following your work and fan, you know, you work with such incredible, you know people around you and yeah", "start": 673.279, "duration": 6.59}, {"text": "Yeah, really? I really sense your passion here run. Will you do me the honors? Here's the finger-point?", "start": 679.87, "duration": 4.589}, {"text": "It's a privileged man. It's an honor and a privilege. Yeah", "start": 685.82, "duration": 3.289}, {"text": "Dudes breathtaking I feel it too", "start": 690.2, "duration": 1.85}, {"text": "You know, I feel like you know, he's very composed", "start": 692.05, "duration": 2.099}, {"text": "But when I do it I just you know, I get I get caught up in it. I try to channel him", "start": 694.22, "duration": 3.98}, {"text": "Do we need the deep fake? I'm sure we need to", "start": 698.3, "duration": 2.27}, {"text": "Can you do better than this? I don't know", "start": 701.779, "duration": 2.0}, {"text": "You're gonna break the AI and I wasn't joking before", "start": 706.13, "duration": 3.109}, {"text": "I do have somewhat of a loss of identity through the years from doing it so much, you know, I mean", "start": 709.24, "duration": 5.219}, {"text": "There's not a day that goes by that I don't get asked to do it. I love doing it", "start": 714.459, "duration": 4.11}, {"text": "It gives me a lot of joy to do it. So look, I feel a little bit naked without the glasses", "start": 718.57, "duration": 3.69}, {"text": "I will hide behind the deep fake, but I will also merge with it", "start": 722.26, "duration": 4.049}, {"text": "I will I will become one. There comes a deep takes all it is mass. Yeah, you still need the craft", "start": 726.31, "duration": 4.589}, {"text": "You still need the inflection. You still need the mannerisms if you couldn't act and then wear that mask", "start": 730.899, "duration": 4.35}, {"text": "Yeah, that's when you reach the full character for sure. I'm really excited about it", "start": 735.47, "duration": 3.44}, {"text": "So I've done 250 thousand iterations to baking four days two days", "start": 740.7, "duration": 3.349}, {"text": "I have stillness the small problems to work out. But this is the version now and it's pretty crazy", "start": 744.05, "duration": 4.679}, {"text": "So obviously the color hasn't been matched yet", "start": 751.11, "duration": 2.36}, {"text": "It looks really good, but we're not quite there yet", "start": 755.55, "duration": 2.33}, {"text": "I think we all have like little ideas on what is making it fall short of perfection", "start": 757.88, "duration": 4.049}, {"text": "I mean the obvious things are the eyeball because face is almost too big on his face. I think that is true", "start": 761.93, "duration": 5.609}, {"text": "It's like his head shape isn't perfectly matched Tom Cruise. I mean you guys have already seen the scene in the video", "start": 767.54, "duration": 5.16}, {"text": "But yeah, we haven't made them yet. So we have a lot of shots of Tom Cruise and like some pretty complex motions", "start": 772.7, "duration": 5.609}, {"text": "so, I don't know I", "start": 778.31, "duration": 1.93}, {"text": "Just keep feeding it Tom Cruise. Source material. We I'm hungry. I'm gonna start a new model fresh here from scratch. Really", "start": 780.24, "duration": 7.25}, {"text": "I'm gonna up to the resolution of everything to where I go off memory on my card", "start": 787.49, "duration": 3.96}, {"text": "It's close I can get so you're gonna be quadrupling the resolution", "start": 791.45, "duration": 3.209}, {"text": "I think that will hire the resolution will fix the long queue", "start": 794.66, "duration": 2.13}, {"text": "But if you're going four times higher resolution, that means it's gonna take four times as much time. Yes", "start": 796.79, "duration": 5.22}, {"text": "Well, you're just gonna have a train all weekend man. You bet. It's a slow cooker. I got a Tom Cruise pot roast going", "start": 802.01, "duration": 6.659}, {"text": "All right. So these Tom Cruise cookies and baking in the oven all weekend, so they should be really nice", "start": 810.12, "duration": 5.21}, {"text": "We've invited Evan back in and I get to show them basically this full transformation here. I'm really excited", "start": 815.33, "duration": 4.5}, {"text": "You know, it's just this beautiful coming together moment. I hope he likes it", "start": 819.83, "duration": 2.969}, {"text": "Okay, there's been a lot of a lot of build-up but I feel like this is gonna exceed my expectations", "start": 822.86, "duration": 3.51}, {"text": "Oh, wow, that's Tom", "start": 830.91, "duration": 2.849}, {"text": "Wow kind of a blank stare but I like it it is uncanny", "start": 845.92, "duration": 4.309}, {"text": "Wow, this is very exciting to see it's it's a combination of terrifying but also incredibly entertaining the way the wrinkles", "start": 854.65, "duration": 6.979}, {"text": "Yeah forming on your cheeks. Yeah, it's getting the proper like folds on the cheeks", "start": 861.63, "duration": 3.84}, {"text": "And yeah, that's the knowledge but those are his teeth completely", "start": 865.47, "duration": 3.029}, {"text": "That's all never said his tongue is in there. That's his tongue. Yep. Okay. He was once your tree in the face", "start": 869.23, "duration": 4.46}, {"text": "It's not that hard to put it on new face", "start": 873.69, "duration": 1.65}, {"text": "It's like I can we could film with you for another minute here and I could have it", "start": 875.34, "duration": 3.179}, {"text": "Face Swap you by the end of the hour like I have been fighting your face near two faces. Yeah", "start": 878.8, "duration": 5.179}, {"text": "I think that really sets this apart from any other depict out there honestly is", "start": 885.76, "duration": 4.369}, {"text": "Your voice there's no deep fake for voice right now", "start": 890.8, "duration": 3.2}, {"text": "So you're giving us a voice that is elevating anything visual where that we're doing. Yeah. This is my new crutch that I lean on", "start": 894.0, "duration": 6.15}, {"text": "But I will also burden this is as far as I've come to you know becoming conjoined inside melted I", "start": 907.89, "duration": 7.699}, {"text": "Would love to hear Tom's reaction if you just if you just looked over and was just like dude no", "start": 918.39, "duration": 4.88}, {"text": "Means do you feel like if you just said it?", "start": 923.49, "duration": 2.0}, {"text": "Thank you so much for lending us some talents and skills and abilities and any all of our entire Honor privilege", "start": 925.65, "duration": 5.209}, {"text": "Hey guys Tom Cruise here back in the corridor digital studio", "start": 938.67, "duration": 3.109}, {"text": "I just wanted to say they have a", "start": 941.78, "duration": 1.84}, {"text": "Wonderful patreon, but they've got all these great people who support the videos that they make this one right here", "start": 943.62, "duration": 5.719}, {"text": "This is Wendy Deptula. Hi", "start": 949.53, "duration": 2.239}, {"text": "Thanks Wendy for supporting us on patreon and this guy right here Phillip Oxford or you are you Astro GG either way", "start": 951.96, "duration": 6.71}, {"text": "It's an honor and pleasure to meet you", "start": 958.67, "duration": 2.0}, {"text": "Hey, are you Alan L Monza? Hey", "start": 961.26, "duration": 2.629}, {"text": "Agency, are you watching the lion's head YouTube channel, cuz they support us too", "start": 965.01, "duration": 3.739}, {"text": "I will be I will be great and just remember war master, two three, six and Matt", "start": 968.75, "duration": 4.829}, {"text": "He are also great patreon supporters. Let's hear you will Robertson, uh", "start": 973.77, "duration": 5.39}, {"text": "Yeah, you lot of Canadian spy or any Adolf. They all support us, too", "start": 979.68, "duration": 4.07}, {"text": "I think I'm all of them a little bit. I think I am too", "start": 983.78, "duration": 2.609}, {"text": "Hey guy, are you a radio Guerrero Mitch Polanski or glitch cube?", "start": 987.0, "duration": 3.32}, {"text": "I can't quite tell I am talking honor and pleasure to meet you. Thanks for being here. Hey guy. Hey, Tom, welcome back", "start": 990.32, "duration": 5.88}, {"text": "Alright, are you James Bailey or Raymond debat? I'm Brian and toesik. Hey, Brian. Oh, yeah", "start": 996.23, "duration": 5.34}, {"text": "Everyone on that list. So phenomenal can't say enough about it", "start": 1002.18, "duration": 2.839}, {"text": "They got me down here right finger on the pulse all that stuff hit the button", "start": 1005.17, "duration": 3.359}, {"text": "It's got the notification squad going consider supporting these guys patreon.com/scishow order quarter digital", "start": 1008.53, "duration": 5.489}]