[{"text": "Today I'm being set on fire three two", "start": 3.75, "duration": 3.529}, {"text": "So in the first stuntmen react video Eric just briefly mentioned as a side thought. Hey we should light you on fire", "start": 15.27, "duration": 5.989}, {"text": "You should light him on fire sometime. Oh, yeah, I'm down two weeks later when the video came out. He sent me a text", "start": 21.74, "duration": 4.949}, {"text": "So when are we letting go on fire? My honest first thought was absolutely let's go. Let's do it. That sounds like the best", "start": 26.689, "duration": 5.34}, {"text": "I'm so down. I thought about it. You know, I have a mom", "start": 32.029, "duration": 2.94}, {"text": "I have a dad and you know before I typed never I actually thought it would be really cool to show you guys how", "start": 34.97, "duration": 4.59}, {"text": "Stuntman pull off one of the most daring and dangerous stunts in Hollywood movies using my body as tribute to this whole thing", "start": 39.66, "duration": 6.11}, {"text": "So yeah, we have Eric here today. He let me on fire with this crew and it's a great", "start": 45.77, "duration": 3.419}, {"text": "I have no idea what to expect other than the fact that I will be lit on fire at some point today", "start": 49.19, "duration": 4.17}, {"text": "Yo, is it true that I have to like eat ice cubes before I get set on fire yeah you have to yeah ok", "start": 55.26, "duration": 5.18}, {"text": "Ok", "start": 61.59, "duration": 1.32}, {"text": "Hey Eric. Yeah, absolutely for real", "start": 62.91, "duration": 2.599}, {"text": "Dude, I was about to eat so much ice. What's up guys? I am with Eric Linden and Omid Zader", "start": 66.86, "duration": 0.5}, {"text": "These are Hollywood professional stunt man stunt coordinators. So this is your your team. We're gonna we're here to keep you safe", "start": 67.36, "duration": 4.98}, {"text": "There's a lot of different videos out there that talk about this process", "start": 76.609, "duration": 2.811}, {"text": "But I think what's really cool is we're gonna step a guy who hasn't done it through this process and keep him safe", "start": 79.469, "duration": 5.09}, {"text": "There are a lot of things involved to keep someone safe, especially sending someone on fire that's never been on fire", "start": 84.56, "duration": 4.889}, {"text": "I love that seeing people's first", "start": 89.45, "duration": 2.04}, {"text": "Reactions and just the property the fire and they learn the basics of fire how fire always moves up", "start": 91.56, "duration": 4.939}, {"text": "You want to keep it behind you away from your face? One of the safest ways is what we're gonna be doing today", "start": 96.499, "duration": 4.41}, {"text": "We're all professionals", "start": 100.909, "duration": 1.291}, {"text": "We've been brought up through the ranks and have learned trial through fire", "start": 102.2, "duration": 3.689}, {"text": "That we just want to educate you guys on what happens don't do this. It's a really bad idea people's first question", "start": 105.959, "duration": 5.33}, {"text": "Always is what does it feel like well generally like nothing you're just freezing as eric has mentioned in previous videos", "start": 111.289, "duration": 6.24}, {"text": "It's the rest of the adrenaline the gel it shouldn't feel like anything because as soon as you feel any kind of heat", "start": 117.6, "duration": 4.849}, {"text": "Well, you're kind of in trouble but it's fun if it's done correctly with the right team you guys the right thing. Yes, sir", "start": 122.45, "duration": 6.13}, {"text": "Yeah. All right. So yeah, you guys so ideally what we want to do. We want to light your arm on fire", "start": 128.58, "duration": 4.47}, {"text": "Okay, then we like to let your legs on fire. Perfect", "start": 133.06, "duration": 2.27}, {"text": "Okay, and then we like to light both arms both legs and you're back on fire", "start": 135.33, "duration": 3.96}, {"text": "When you're setting somebody on fire you got a protector through the fire", "start": 140.62, "duration": 3.38}, {"text": "Gel, but you can't just put fire gel on, you know, then you're putting fuel on to the fire. Gel", "start": 144.0, "duration": 5.04}, {"text": "Which is what actually catches on fire. Yeah, it's a it's not the fire gel itself", "start": 149.04, "duration": 4.829}, {"text": "The fire gel is just strictly like a barrier to protect you against the fire", "start": 153.97, "duration": 4.58}, {"text": "Now some of the things that we're gonna help the fire gel out with are these different layers of fire protective clothing?", "start": 158.55, "duration": 6.419}, {"text": "There's many different kinds there's there's no mechs. There's fire resistant cotton", "start": 164.97, "duration": 3.75}, {"text": "There's something called carbon acts all of it kind of has its own specific uses", "start": 168.72, "duration": 4.38}, {"text": "Ultimately, what we're gonna do for this one is we're gonna use this cotton layer two shirts for you. Yeah, okay", "start": 173.29, "duration": 5.389}, {"text": "This layer is called pbi. This is actually fireproof. Well, it does not light on fire. Well", "start": 178.83, "duration": 6.779}, {"text": "Normal, that's the weird part. That's crazy", "start": 186.91, "duration": 2.6}, {"text": "Everybody's gonna say well what if you put it in lava?", "start": 190.24, "duration": 2.149}, {"text": "Does this burn at some point? Yes it will but by that point your eyeballs melt out of your head, okay?", "start": 193.48, "duration": 6.47}, {"text": "Sweet so we don't have to worry about that. We'll never get to those type of temperatures", "start": 201.43, "duration": 4.43}, {"text": "We are gonna be lighting you on fire with the coldest possible fire that makes it that makes sense to me", "start": 205.86, "duration": 5.55}, {"text": "Keep it as safe as possible, right?", "start": 211.44, "duration": 2.0}, {"text": "Now", "start": 217.72, "duration": 1.47}, {"text": "The other component to this is going to be fire. Gel. There's many different kinds of fire. Gel", "start": 219.19, "duration": 4.91}, {"text": "We have action factories don't gel today. This is some of the best stuff in the business", "start": 224.11, "duration": 3.979}, {"text": "So that's what we're gonna use cool if you say it's all", "start": 228.09, "duration": 2.55}, {"text": "Essentially organic. Can I eat this? Yeah, wait, really?", "start": 231.19, "duration": 3.649}, {"text": "Eddie like it's kind of fresh actually", "start": 238.91, "duration": 2.0}, {"text": "Fresh nice. It's like a honey honey mint. I like that. That's nice", "start": 242.84, "duration": 3.8}, {"text": "So what we'll do is we're gonna take this and completely cover the clothes with it right on our left arm. Which one right?", "start": 246.64, "duration": 6.21}, {"text": "Ways left arm just in case", "start": 254.87, "duration": 2.45}, {"text": "You're probably gonna get cold it kind of draws the heat out of your body", "start": 261.56, "duration": 3.679}, {"text": "Okay, and then eventually we'll put it all over your head and all over everything to keep you safe", "start": 265.28, "duration": 4.399}, {"text": "Okay, and then we will put that wardrobe over top of you. So you have three layers of clothing", "start": 269.68, "duration": 5.19}, {"text": "They are all covered in fire. Gel then another layer of clothing that will be burned. I'm excited to be honest. Thank you", "start": 274.87, "duration": 6.48}, {"text": "Is it it's a nervous excitement, you know, as you can see, this is a time-consuming process", "start": 281.35, "duration": 3.869}, {"text": "Typically when we're doing this on set we need about a 45 minute heads up once our guy is completely ready in an ideal situation", "start": 286.28, "duration": 7.519}, {"text": "We walk him straight to set and light him on fire", "start": 294.169, "duration": 2.96}, {"text": "Like there's not a lot of downtime", "start": 297.169, "duration": 2.0}, {"text": "What will happen is if you wait too long?", "start": 299.18, "duration": 2.0}, {"text": "The gel I have up here will start sliding down his arm and we'll pull up", "start": 301.31, "duration": 4.549}, {"text": "Down here and I'll also do that in his legs", "start": 305.93, "duration": 2.36}, {"text": "He'll still have some gel but like the ideal system all over his body", "start": 308.29, "duration": 4.139}, {"text": "Starts to break down over time so you don't want him sitting there for three hours waiting to be settling on five", "start": 312.8, "duration": 5.15}, {"text": "I'm feeling like an extra like 10 12 pounds. Wait until your little body's going", "start": 317.95, "duration": 4.139}, {"text": "I know just like 40 pounds heavier. Feel like a ketchup packet", "start": 322.09, "duration": 3.42}, {"text": "Pull this out like that. Okay. So is it go ahead and pass up test the guys bourbon?", "start": 331.379, "duration": 5.029}, {"text": "Yeah, we're good just for the size of this burn more than likely it'll either a burn out or B", "start": 337.56, "duration": 5.869}, {"text": "We'll just throw a little wet rag on it cuz this is very small if anything happens to go wrong", "start": 343.43, "duration": 4.44}, {"text": "Just let me in the team handle it everybody just kind of step back. We will take care of it", "start": 347.87, "duration": 4.289}, {"text": "Make sure clean feels good. Do I need to stop drop and roll at any point you do? No, okay", "start": 352.159, "duration": 3.87}, {"text": "We will get you okay cool sauce, and so we're gonna put a little bit of fuel", "start": 356.03, "duration": 3.419}, {"text": "This is what burns awesome all a little bit for now", "start": 359.449, "duration": 3.39}, {"text": "Mel's like hot glue. He said I think so", "start": 363.419, "duration": 2.149}, {"text": "I'm on fire. Good day", "start": 373.199, "duration": 2.029}, {"text": "I feel feel pretty good. Just looking at some fire my right now so warm at all not yet", "start": 379.53, "duration": 5.61}, {"text": "So let me know if start still long. Okay, so could I cook us more over this you think it'd be positive?", "start": 385.14, "duration": 4.229}, {"text": "Nice dude, is it getting warm at all? Yeah a little bit a little bit. So that's just dissipated", "start": 397.33, "duration": 5.72}, {"text": "It's gonna warm up its fire is the thing that we want to avoid", "start": 403.05, "duration": 3.21}, {"text": "Especially when we're doing a bigger burn with you. Is it getting hot?", "start": 406.75, "duration": 3.32}, {"text": "You need to let us know when you are getting warm", "start": 410.07, "duration": 2.369}, {"text": "So we can put you out even once the fire is out if it remains hot", "start": 412.8, "duration": 4.11}, {"text": "The very heat of it could give you a burn on your skin, even though the fire is completely gone. I'd literally be cooked", "start": 417.01, "duration": 6.889}, {"text": "Yes, my bean you cooked a lot. Have you cooked?", "start": 424.06, "duration": 2.0}, {"text": "Okay, cool, man, so I don't want to like completely engulf you in flames yet", "start": 426.06, "duration": 4.35}, {"text": "Once it starts to get around your face and everything", "start": 430.41, "duration": 1.89}, {"text": "It gets to be a completely different deal if you're comfortable with it. What I'd like to do is completely prep your whole body", "start": 432.3, "duration": 5.43}, {"text": "Okay and light your legs on fire?", "start": 437.86, "duration": 1.61}, {"text": "Okay, let's let my legs on fire cuz I don't know if I'm ready for the full body yet like on it", "start": 439.47, "duration": 3.6}, {"text": "honestly, I'm like, I'm cool with that, but my whole body like both my arms my legs and my back do", "start": 443.07, "duration": 6.089}, {"text": "Look and if that's something that you're not ready for no pressure", "start": 450.7, "duration": 3.349}, {"text": "Ready yeah, let's do it. I get down to the tones you get all the girls", "start": 455.71, "duration": 5.269}, {"text": "Yeah tuition like a big for firstborn", "start": 462.97, "duration": 2.69}, {"text": "You gotta take a big scoop of this and put it on your your crotch", "start": 469.99, "duration": 3.68}, {"text": "Because I'm not doing it but you guys I oh", "start": 474.37, "duration": 2.869}, {"text": "my oh", "start": 478.24, "duration": 1.56}, {"text": "Yeah, just put it inside", "start": 479.8, "duration": 2.24}, {"text": "Doesn't so I don't want you serious, you're no 104 series I", "start": 485.2, "duration": 5.419}, {"text": "Think of a third time gotta get two of you and windows God dang it", "start": 493.33, "duration": 3.259}, {"text": "Why just that part by the way, that was completely unnecessary. It was just a message", "start": 496.59, "duration": 3.959}, {"text": "This is smelled nice and fresh", "start": 503.95, "duration": 2.119}, {"text": "This is what I'll be for Halloween, dude", "start": 508.48, "duration": 2.0}, {"text": "man", "start": 511.42, "duration": 2.0}, {"text": "I've been to the airport dude. I've been the TSA before has it been my for TSA agents at the same time. No", "start": 514.36, "duration": 6.2}, {"text": "That would be a first", "start": 521.38, "duration": 2.0}, {"text": "Yeah, dude", "start": 523.87, "duration": 2.0}, {"text": "Yes", "start": 526.75, "duration": 2.0}, {"text": "Ie breath you got in through the nose out the nose", "start": 534.34, "duration": 2.539}, {"text": "I really do feel like a salamander snapping pics then great. All right", "start": 540.7, "duration": 5.089}, {"text": "Okay, let's", "start": 547.9, "duration": 2.0}, {"text": "Chances are if you're watching this video you like moviemaking and chances are to watch a channel", "start": 550.51, "duration": 3.559}, {"text": "You're probably into visual effects", "start": 554.07, "duration": 1.23}, {"text": "Now when you're doing visual effects usually need two elements to add your footage", "start": 555.3, "duration": 3.15}, {"text": "Explosions blood splatters sparks that kind of stuff the thing is when you have to go and buy a pack of like 20 blood hits", "start": 558.67, "duration": 5.809}, {"text": "Just to use the couple. It's kind of expensive", "start": 564.48, "duration": 1.83}, {"text": "So we've teamed up with action V effects to curate what we call the battle box", "start": 566.31, "duration": 3.659}, {"text": "It's a collection of all the elements you need to do a cool action scene at an affordable price", "start": 569.97, "duration": 4.5}, {"text": "We've taken the best from each pack couple explosions a couple blood splatters a couple muzzle flashes and sparks", "start": 574.6, "duration": 5.059}, {"text": "All the good stuff and action the effects man. They just knock it out of the park with their elements", "start": 579.88, "duration": 4.429}, {"text": "They're such high quality elements. Its corridor digital calm slash battle boxes. I'll link in the description below", "start": 584.31, "duration": 4.44}, {"text": "I think you'll enjoy it if you're trying to get individual effects yourself. Let's go Mike Clint on fire", "start": 588.75, "duration": 4.53}, {"text": "Every stop talking now overall focused", "start": 595.99, "duration": 2.149}, {"text": "He's just quiet work just like incense clint's concentration. He's breathing through his nose. So harder now", "start": 598.9, "duration": 7.369}, {"text": "He's trying not to sugar and be cold. I", "start": 606.94, "duration": 3.45}, {"text": "Wonder if he's regretting it now, but either way it's too I turn back. It's only one way to warm them up", "start": 610.94, "duration": 4.07}, {"text": "we've layered him up with all the layers Reid gelled as we put each layer on make sure it's nice and thick and", "start": 615.59, "duration": 4.94}, {"text": "This rubber suit is like not necessary for this one, but we're doing anyway", "start": 620.63, "duration": 4.369}, {"text": "Just kind of help show the process", "start": 625.0, "duration": 1.54}, {"text": "The suit essentially keeps the gel in I feel like a garbage man already like a space garbage, man", "start": 626.54, "duration": 6.98}, {"text": "That's Steve, it's Steve did you do you know we're doing right now just you did like pick up some guns", "start": 638.51, "duration": 5.149}, {"text": "Okay, put these out so that place to park. I'm a considerate landlord. I am NOT", "start": 643.73, "duration": 5.57}, {"text": "Just any landlord Who am I I am", "start": 649.3, "duration": 3.119}, {"text": "Lord clearly in about ten minutes Clint is going to do his first full body burn", "start": 653.54, "duration": 5.24}, {"text": "Where is he going to do this by the way? Wait a minute", "start": 659.54, "duration": 2.929}, {"text": "Dude, seriously? Oh", "start": 663.2, "duration": 1.25}, {"text": "You're covering that we'll make sure the scorch marks are cleared away and I did it about 30 years ago", "start": 664.45, "duration": 5.64}, {"text": "And I had to put this gel on me and I did on fire while on fire jumping jacks", "start": 670.09, "duration": 4.709}, {"text": "And it looked great god, this is great", "start": 674.8, "duration": 2.94}, {"text": "You know when you're like trying to run but you can't yeah a fight but you can't that's how I feel right now dude I", "start": 682.55, "duration": 4.91}, {"text": "Feel like", "start": 689.03, "duration": 1.23}, {"text": "Frickin Chum though. What we're gonna do is we're gonna fuel both of your legs", "start": 690.26, "duration": 4.399}, {"text": "Yeah, and then we're going to go ahead and light that on fire. Okay, as you start to feel like it's warm", "start": 694.66, "duration": 4.17}, {"text": "I want you to go ahead and call it", "start": 698.83, "duration": 1.41}, {"text": "Oh, there's not a whole lot of wind in here. But once we get out there, it's gonna be a little bit different", "start": 700.24, "duration": 4.979}, {"text": "Okay, cool. Okay, everybody set", "start": 705.22, "duration": 2.34}, {"text": "Do it", "start": 710.449, "duration": 2.0}, {"text": "Kind of move around a little bit. I always liked you", "start": 718.91, "duration": 2.809}, {"text": "Yeah, yes Joe, yes people show go ahead and stand back up", "start": 735.66, "duration": 4.01}, {"text": "Like it feels nice", "start": 744.63, "duration": 1.13}, {"text": "I that can feel some warmth the slightest warmth in my legs and that's very nice for now because I am", "start": 745.76, "duration": 5.94}, {"text": "Pretty cold what I'd like to do next in the next stage of all this is we'll prep your head. Yeah", "start": 752.16, "duration": 5.84}, {"text": "This is awesome. There's a moment. Yeah, I'm not gonna forget this forget Eric brother. Gel all over my chin, dude", "start": 758.55, "duration": 5.33}, {"text": "I can't hear I'd like to light up another", "start": 763.88, "duration": 2.159}, {"text": "One arm okay, but we'll do it much bigger", "start": 766.59, "duration": 2.9}, {"text": "Yeah, and I would like you to kind of move around and feel the fire a little bit. Okay you good with that?", "start": 769.88, "duration": 5.009}, {"text": "Yeah, I'm good with that", "start": 775.01, "duration": 2.0}, {"text": "Don't move around love it", "start": 780.33, "duration": 2.0}, {"text": "Well, yeah see the wind feelin it", "start": 789.02, "duration": 4.499}, {"text": "Hotspots good anything good good. Okay good, right", "start": 799.84, "duration": 3.08}, {"text": "Now the real question is do you want to do a big?", "start": 804.22, "duration": 2.179}, {"text": "Like more fire or an or five. Do you want to do all of them? I", "start": 807.04, "duration": 4.099}, {"text": "Mean we're I didn't get suited up for nothing, dude", "start": 812.62, "duration": 2.84}, {"text": "Yeah, so we're doing yeah, we're doing it. Yeah, we're good", "start": 816.94, "duration": 2.929}, {"text": "I'm gonna touch up your face make sure that this is completely coverage everywhere and then we're gonna we're gonna go for it", "start": 819.9, "duration": 5.52}, {"text": "So what we'll do is I'll fuel you up nice and big", "start": 825.42, "duration": 2.039}, {"text": "Let's just dudes once it's just one time. Yeah. Yeah. I want you to hold your breath the entire time, okay", "start": 828.07, "duration": 4.88}, {"text": "And you will run a jog speed right down to there and then when you get to the blanket", "start": 833.68, "duration": 5.15}, {"text": "Me down and out like a superhero. Yes. It just landed. Yes, like all cool. Okay. Yeah", "start": 839.17, "duration": 5.509}, {"text": "Yeah, I can do that and we'll put you out. This is the moment of truth", "start": 844.68, "duration": 2.64}, {"text": "We've brought to you and prepared you. I'm ready man to say I'm ready", "start": 848.47, "duration": 3.589}, {"text": "Ready, three two", "start": 853.259, "duration": 2.0}, {"text": "Does anything hurt are they good good. I've gotta stand up", "start": 914.399, "duration": 4.609}, {"text": "Maybe just like right here great", "start": 924.029, "duration": 2.719}, {"text": "I have no I got feel good right now. Oh wow", "start": 930.3, "duration": 3.019}, {"text": "Grab fire man. That's the whole bag. That's everything", "start": 936.839, "duration": 3.2}, {"text": "What a fire inspectors dream the real question here is", "start": 941.73, "duration": 5.119}, {"text": "We're asking need another one", "start": 949.41, "duration": 2.0}, {"text": "One do one more some sort of variation I will light you up and say action and you kind of do a turn a", "start": 955.319, "duration": 6.619}, {"text": "Little bit of the chicken dance and then go at any point", "start": 962.519, "duration": 3.799}, {"text": "Even if you only make it three steps if you want out go down. Okay. All right. Let's go ahead three", "start": 966.319, "duration": 5.19}, {"text": "two one", "start": 972.029, "duration": 2.0}, {"text": "Hotspots, goodgoodgood", "start": 986.439, "duration": 2.0}, {"text": "Water bottles great", "start": 991.329, "duration": 2.0}, {"text": "Thanks to you. Oh, really? Good. Thank you. Good job, boys. How's your nose?", "start": 994.3, "duration": 5.269}, {"text": "You've been a safe keeping a real man those it's great. Everything's good. Yeah", "start": 999.569, "duration": 2.85}, {"text": "Killed it man, all these people came out to see you burn. I guess that's how it is, huh?", "start": 1004.8, "duration": 7.429}, {"text": "This spin is great", "start": 1018.92, "duration": 2.0}, {"text": "Man, well, I think I feel like Clint's got a profile Cougars are one. Yeah, there it is, dude", "start": 1021.5, "duration": 5.809}, {"text": "Thank you so much for dude", "start": 1030.98, "duration": 2.0}, {"text": "Okay", "start": 1035.089, "duration": 2.0}, {"text": "Have an amazing experiences. Yeah", "start": 1037.549, "duration": 2.0}, {"text": "Freakin sweet dude. It was exhilarating. Yeah", "start": 1040.52, "duration": 3.109}, {"text": "I felt like I loved being in the zone and I love it when it comes down to like super focused", "start": 1043.63, "duration": 4.949}, {"text": "I love those moments and that was definitely one of those moments for me", "start": 1048.58, "duration": 2.339}, {"text": "I felt like I could a jog like three to four times that distance, but who knows?", "start": 1050.919, "duration": 3.78}, {"text": "Maybe there's like a spike like right after I did double that distance", "start": 1054.7, "duration": 2.67}, {"text": "There's just like I am I'm on fire and I'm actually burning I had I don't know", "start": 1057.37, "duration": 3.63}, {"text": "I don't want to push the limits, you know, but I felt good like I don't feel like I'm on fire", "start": 1061.0, "duration": 4.199}, {"text": "I don't feel like I'm burning right now. I feel great work of art", "start": 1065.2, "duration": 3.33}, {"text": "That's what I call it a work of art and it went in you got two good takes and Clint is doing great", "start": 1068.6, "duration": 5.15}, {"text": "And he's wonderful. He has no PTSD that I can see", "start": 1073.75, "duration": 3.27}, {"text": "He's a happy guy. Yeah. Yeah. It's a very unique art form", "start": 1077.66, "duration": 2.839}, {"text": "It's just really cool to see you demonstrate it for us here", "start": 1080.63, "duration": 2.66}, {"text": "This was not to show you guys how to do this or how to light yourselves on fire. That's absolutely not what we wanted", "start": 1083.33, "duration": 5.839}, {"text": "We wanted to show you how to keep somebody safe", "start": 1089.169, "duration": 1.541}, {"text": "And just what how much work goes into it and how much knowledge", "start": 1090.71, "duration": 3.349}, {"text": "You need to have to be able to light somebody on fire and get them out of it safely", "start": 1094.059, "duration": 4.92}, {"text": "completely unscathed", "start": 1099.53, "duration": 0.92}, {"text": "Yeah, so thank you so much for having us and please do not try this at home by this point", "start": 1100.45, "duration": 5.7}, {"text": "you guys got me nowit, but you can follow Erik when didn't have", "start": 1106.15, "duration": 2.009}, {"text": "His website, but seriously a big thank you to you in the whole team for coming out here and helping us with this", "start": 1109.97, "duration": 6.469}, {"text": "Because I just hope that we continue to like deepen people's respect and understanding to the craft. Absolutely", "start": 1116.69, "duration": 6.109}, {"text": "Successful stunts. Nobody got hurt", "start": 1123.41, "duration": 2.3}, {"text": "It's Miller time", "start": 1126.23, "duration": 2.0}, {"text": "So if you want to light yourself on fire, but you don't have a Hollywood stunt team chances", "start": 1128.48, "duration": 3.71}, {"text": "Are you going to need visual effects?", "start": 1132.19, "duration": 1.05}, {"text": "We're gonna get that fire from you ask through your computer to me and I hear you there you get the battle box", "start": 1133.24, "duration": 5.52}, {"text": "it's a collection of all of our favorite elements through action the effects everything we use from explosions to muzzle flashes to bullet hits all", "start": 1138.76, "duration": 5.88}, {"text": "Brought into one affordable package for you", "start": 1144.64, "duration": 1.71}, {"text": "We can click the link in description below and you can see each and every element", "start": 1146.35, "duration": 2.969}, {"text": "So if you're a visual effects artist just signing out. I already got a great library. I think you're gonna find this very useful", "start": 1149.42, "duration": 4.13}, {"text": "I almost forgot if you buy anything else and action the effects you can use a promo code corridor for 10% off", "start": 1153.55, "duration": 5.489}, {"text": "Please consider subscribing guys. Thank you for watching the video. I think Clint had the time of his life. See you the next one", "start": 1159.11, "duration": 5.54}]