[{"text": "Much like game of thrones before it, HBO's Westworld is an elaborate,", "start": 1.78, "duration": 4.88}, {"text": "epic puzzle box of a production that serves in the end as an excuse to explore something much smaller", "start": 6.8, "duration": 5.86}, {"text": "and much more important: Character.", "start": 12.66, "duration": 2.82}, {"text": "This is why despite the sweeping vistas, what holds everything else up are the conversations,", "start": 15.52, "duration": 4.88}, {"text": "how they're written and how they're acted. Today, I want to take a look at one conversation featuring the great Anthony Hopkins.", "start": 20.62, "duration": 6.8}, {"text": "Specifically, I want to examine how Hopkins acts the scene, how he elevates every line of dialogue to a hypnotically interesting level.", "start": 27.42, "duration": 7.46}, {"text": "You imagine I've gone mad,", "start": 35.44, "duration": 2.0}, {"text": "do you?", "start": 38.62, "duration": 1.23}, {"text": "Lost my way?", "start": 39.85, "duration": 1.49}, {"text": "We're simply concerned about the extent of the changes you're making.", "start": 41.4, "duration": 3.16}, {"text": "We want to protect your legacy.", "start": 45.25, "duration": 2.0}, {"text": "My legacy?", "start": 47.77, "duration": 1.44}, {"text": "Okay, the background of the scene is that Theresa Cullen, an operations manager of the Westworld theme park is trying to stop -", "start": 49.21, "duration": 7.19}, {"text": "or at least stall - the creation of Robert Ford, Anthony Hopkins' new storyline for the guests,", "start": 56.4, "duration": 5.08}, {"text": "a storyline that is generally wreaking chaos on things to the point of worrying the parks financiers.", "start": 61.48, "duration": 4.82}, {"text": "It's clear that Theresa feels that Ford's undertaking is just too risky,", "start": 66.43, "duration": 3.47}, {"text": "but instead of forthrightly telling him so, she puts things in euphemistic terms.", "start": 69.9, "duration": 4.84}, {"text": "We want to protect your legacy.", "start": 74.9, "duration": 2.2}, {"text": "My legacy?", "start": 77.16, "duration": 0.64}, {"text": "Okay, that pause is fully 7 seconds long and it is amazing. After reacting in disbelief at such a shameless euphemism,", "start": 84.72, "duration": 7.62}, {"text": "Hopkins, in silence, cycles through a few emotions.", "start": 92.34, "duration": 2.82}, {"text": "First, disbelief. Then a consideration of the words for a split second at their face value.", "start": 96.12, "duration": 6.06}, {"text": "Maybe he should safeguard his legacy. Maybe he shouldn't be so ambitious at his age.", "start": 102.46, "duration": 4.79}, {"text": "Then a smile and the scene will feature several shades of smile this one is kind,", "start": 107.8, "duration": 5.94}, {"text": "as kind as can be in the face of what he considers to be an attack, one that insults his intelligence.", "start": 113.74, "duration": 5.26}, {"text": "As he looks down and chuckles, the smile seems to acquire some suppressed anger.", "start": 119.0, "duration": 5.4}, {"text": "He can only bear to look at her in quick glances as he composes himself, then he fires back an antagonistic remark.", "start": 124.75, "duration": 7.669}, {"text": "You don't like this place very much. Do you?", "start": 133.33, "duration": 2.059}, {"text": "I've seen many of you come and go over the years.", "start": 136.45, "duration": 2.059}, {"text": "And I can tell the ones who enjoy the time here the ones who don't.", "start": 138.509, "duration": 4.671}, {"text": "What's impressive here is how Hopkins breaks down the dialogue as written.", "start": 143.34, "duration": 4.48}, {"text": "In interviews, Hopkins has described how he reads scripts 200 times or so to the point where the dialogue is lodged in his brain,", "start": 147.82, "duration": 6.86}, {"text": "then he steps away, lets it gestate in his mind, and when he arrives on set he relaxes himself and", "start": 154.959, "duration": 5.839}, {"text": "\"let the part play through you.\"", "start": 161.319, "duration": 1.74}, {"text": "By having such a command over the words,", "start": 163.059, "duration": 2.12}, {"text": "Hopkins is able to modulate the tempo of their delivery to get the most out of it.", "start": 165.37, "duration": 4.846}, {"text": "This sentence, for example, is sped through.", "start": 170.22, "duration": 2.88}, {"text": "\"I've seen many of you come and go over the years.\" As is the first part of the next sentence until a pause after \"who\"", "start": 173.1, "duration": 5.26}, {"text": "drawing out the word \"enjoy\" which falls right back into a speedy delivery almost slipping over the words,", "start": 178.36, "duration": 5.52}, {"text": "until the final two which, coupled with eye contact, slow down to function as an accusation.", "start": 184.15, "duration": 5.72}, {"text": "I've seen many of you come and go over the years. And I can tell the ones who enjoy the time here the ones who don't.", "start": 189.87, "duration": 7.45}, {"text": "I admire it.", "start": 197.54, "duration": 2.16}, {"text": "The audacity of it.", "start": 200.04, "duration": 1.28}, {"text": "Oh...", "start": 202.5, "duration": 0.72}, {"text": "A small interjection.", "start": 203.22, "duration": 0.87}, {"text": "But see how he opens up like a flower from the hunched position, how he releases a little tension to receive the compliment. Great touch.", "start": 204.09, "duration": 7.86}, {"text": "I came here once as a child with my parents. I think we even sat at this table.", "start": 212.19, "duration": 4.44}, {"text": "When I started working here, I realized this place wasn't something I would enjoy.", "start": 218.14, "duration": 5.08}, {"text": "Ah!", "start": 223.22, "duration": 0.5}, {"text": "And then we get a second interjection when his suspicions are confirmed followed by hunching again, and a deflated neck.", "start": 223.72, "duration": 6.8}, {"text": "Then, from this position, Hopkins launches into his key speech.", "start": 230.52, "duration": 3.48}, {"text": "In the beginning I imagined things would be", "start": 235.66, "duration": 2.449}, {"text": "perfectly balanced.", "start": 239.41, "duration": 2.0}, {"text": "Even had a bet with my partner, Arnold, to that effect", "start": 241.72, "duration": 3.64}, {"text": "He made a hundred hopeful storylines. Of course, almost no one took us up on them. I lost the bet.", "start": 245.56, "duration": 5.6}, {"text": "Arnold always held a somewhat dim view of people. He preferred the hosts.", "start": 252.94, "duration": 5.239}, {"text": "He begged me not to let you people in. The money men.", "start": 259.12, "duration": 3.98}, {"text": "Delos.", "start": 263.1, "duration": 0.98}, {"text": "Okay, we're about to learn that this whole meeting is a threat set up by Hopkins.", "start": 264.08, "duration": 4.22}, {"text": "And to signal that, Hopkins incrementally dials up the menace across three terms that specify who he's threatening.", "start": 268.4, "duration": 6.52}, {"text": "\"You people.\" \"Money men.\" \"Delos.\"", "start": 274.92, "duration": 2.66}, {"text": "Listen to it again. He begged me not to let you people in.", "start": 277.58, "duration": 2.7}, {"text": "The money men.", "start": 280.88, "duration": 1.41}, {"text": "Delos.", "start": 282.29, "duration": 1.41}, {"text": "I told him it'd be fine. That you didn't understand what you were paying for.", "start": 283.7, "duration": 3.199}, {"text": "It's not a business venture, not a theme park,", "start": 287.57, "duration": 2.389}, {"text": "but an entire world.", "start": 291.38, "duration": 2.0}, {"text": "We designed every inch of it,", "start": 294.74, "duration": 2.0}, {"text": "every blade of grass.", "start": 299.499, "duration": 2.0}, {"text": "In here we were gods,", "start": 304.85, "duration": 2.0}, {"text": "and you", "start": 307.68, "duration": 2.0}, {"text": "were merely our guests.", "start": 309.84, "duration": 1.98}, {"text": "Watching this the first time it was here that it struck me. How crucial Ford's personality is to the functioning of the series.", "start": 311.82, "duration": 6.649}, {"text": "I mean, Westworld is, in many ways, a ridiculous idea both as a theme park and as a TV show.", "start": 318.64, "duration": 5.96}, {"text": "To work, the conceit had to be mapped, reflected, justified in the complex desires and ambitions of its creators.", "start": 324.76, "duration": 8.38}, {"text": "The writers have achieved that in Ford,", "start": 333.14, "duration": 1.82}, {"text": "But it's Hopkins who really brings these things to life.", "start": 334.97, "duration": 3.125}, {"text": "And how did that work out for Arnold?", "start": 338.095, "duration": 2.065}, {"text": "Oh, sadly,", "start": 341.13, "duration": 1.32}, {"text": "he lost his perspective.", "start": 342.45, "duration": 2.0}, {"text": "He went Mad.", "start": 344.79, "duration": 2.0}, {"text": "I haven't, as you well know, I have always seen things", "start": 347.88, "duration": 4.789}, {"text": "very clearly.", "start": 354.0, "duration": 1.53}, {"text": "The threat now explicit, Hopkins colors the rest of the scene with a sinister glee.", "start": 355.53, "duration": 5.41}, {"text": "This is the table I sat at with my parents.", "start": 361.06, "duration": 2.44}, {"text": "We know everything about our guests, don't we? As we know everything about our employees.", "start": 364.7, "duration": 4.64}, {"text": "From here on out he presses his advantage, not with force, but with comfort, with a smile.", "start": 369.5, "duration": 5.66}, {"text": "No longer needing to convince Teresa of his dominance,", "start": 375.28, "duration": 3.04}, {"text": "Hopkins dances into different attitudes for a couple of seconds before falling back into that smile.", "start": 378.42, "duration": 5.62}, {"text": "Like right here, where he's matter-of-fact.", "start": 384.45, "duration": 2.181}, {"text": "We know everything about our guests, don't we? As we know everything about our employees.", "start": 386.64, "duration": 4.76}, {"text": "Or here where he's concerned.", "start": 391.8, "duration": 1.639}, {"text": "I do hope you will be careful with Bernard.", "start": 393.44, "duration": 3.28}, {"text": "Or here where he's genuinely caring as his eyes wander off for a moment too.", "start": 396.88, "duration": 5.4}, {"text": "He has a- a sensitive disposition.", "start": 402.54, "duration": 3.4}, {"text": "The producers of this show are smart to keep the camera fixed on Hopkins' face.", "start": 406.9, "duration": 4.489}, {"text": "His ability, learned across many decades, to convey such a web of feeling and suggest such a", "start": 411.64, "duration": 6.769}, {"text": "universe of feeling within about a character we know little about", "start": 418.57, "duration": 4.01}, {"text": "expands the entire show's range and strengthens its persuasive power as a piece of art.", "start": 423.49, "duration": 5.449}, {"text": "That's what a great actor can do.", "start": 429.24, "duration": 2.0}, {"text": "He can give words and images or a short scene like this a volcanic energy with a quiet look.", "start": 431.24, "duration": 8.08}, {"text": "In Anthony Hopkins' hands, in his eyes, Westworld isn't just a reflection of its creators personality,", "start": 439.32, "duration": 7.12}, {"text": "It's a self-portrait. You can tell the board that my narrative will be completed on time,", "start": 446.8, "duration": 5.637}, {"text": "and it won't be a retrospective as I'm sure you have all feared.", "start": 452.44, "duration": 5.18}, {"text": "I'm not the sentimental type.", "start": 465.76, "duration": 2.0}, {"text": "Hey, everybody there is a new nerdwriter video every Wednesday,", "start": 478.73, "duration": 3.169}, {"text": "so if you click right there you'll subscribe to this channel and get all the videos.", "start": 481.9, "duration": 3.39}, {"text": "Sorry I've been so irregular with my posting recently. I've been in Italy.", "start": 485.48, "duration": 3.319}, {"text": "It's been crazy.", "start": 488.8, "duration": 0.51}, {"text": "But also been writing a couple speeches for the Singapore writers festival which I'll be at in a couple weeks.", "start": 489.31, "duration": 3.869}, {"text": "Um, and so that's been taking a lot of my time. I have to shout out a channel that I really love called Wisecrack.", "start": 493.52, "duration": 5.0}, {"text": "Uh, they do video essays like me 8-bit Philosophy, earthling cinema, stuff like that. They just did something on Bojack Horseman,", "start": 498.95, "duration": 5.0}, {"text": "which is a show I love and the video was great too, so I'll link that below. Check that out.", "start": 503.99, "duration": 3.98}, {"text": "Thanks guys for watching. I'll see everybody next Wednesday hopefully!", "start": 508.22, "duration": 3.889}]