[{"text": "Warfare is often like a game of rock-paper-scissors.", "start": 3.94, "duration": 2.72}, {"text": "For every new weapon developed, a counter weapon follows; each player needs to carefully", "start": 6.7, "duration": 4.4}, {"text": "balance and ensure their opponent do not develop a power play which has no counter.", "start": 11.17, "duration": 3.799}, {"text": "But with the start of the cold war, and the invention of the nuclear bomb, this ever-evolving game of rock-paper-scissors", "start": 15.06, "duration": 5.64}, {"text": "has deteriorated into a game where each player stock piles rocks, and develops new ways to hurl them at their opponent.", "start": 20.7, "duration": 5.76}, {"text": "Technology has only recently progressed far enough to develop a legitimate countermeasure like the Terminal High Altitude", "start": 26.89, "duration": 5.209}, {"text": "Area Defense System, aka THAAD, by the US.", "start": 32.439, "duration": 3.08}, {"text": "Today we're going to investigate how this technology works and how likely it is to stop a nuclear threat against the United States", "start": 36.429, "duration": 6.65}, {"text": "With North Korea's recent", "start": 44.319, "duration": 1.531}, {"text": "thermal nuclear hydrogen bomb tests and the continued experimentation of short and long range missiles, the world has been on edge.", "start": 45.85, "duration": 6.739}, {"text": "South Korea has even deployed both THAAD and Patriot systems despite push back from China. So how do we stop a hypothetical", "start": 52.92, "duration": 6.8}, {"text": "ICBM incoming from North Korea?", "start": 59.72, "duration": 2.4}, {"text": "Countermeasures have been developed by many of the world's powers, though they are not as sophisticated as perhaps you would expect, and that's for two", "start": 62.92, "duration": 6.29}, {"text": "reasons. One, because in 1972 the United States and Soviet Union", "start": 69.219, "duration": 4.43}, {"text": "signed an Anti-Ballistic Missile treaty which was designed to limit the development and deployment of these", "start": 73.96, "duration": 5.26}, {"text": "defensive countermeasures, and the US only withdrew from the treaty to protect the US", "start": 79.22, "duration": 4.48}, {"text": "from nuclear blackmail from rogue states like Iran And North Korea and two,", "start": 84.2, "duration": 3.04}, {"text": "because IBCMs are really, really, hard to intercept. To counter these threats,", "start": 87.759, "duration": 4.25}, {"text": "the US has contracted the top Military engineering groups to develop and maintain an integrated Ballistic Missile Defense System, or", "start": 92.429, "duration": 6.81}, {"text": "BNDS. The system integrates independent short, medium, and long Range Missile defense systems, such as Patriot,", "start": 99.729, "duration": 6.8}, {"text": "AEGIS, and THAAD into one communication network. They are integrated and supported by a battery of land and sea-based sensors,", "start": 106.749, "duration": 7.07}, {"text": "such as infrared satellites and X-Band radar. But all have a common communication line to the command center.", "start": 113.95, "duration": 5.54}, {"text": "This allows new radar systems or mobile Navy vessels with sensors and interceptors to be seamlessly incorporated if they are in the region.", "start": 119.89, "duration": 7.219}, {"text": "There are three main phases of an ICBM, the boost phase,", "start": 127.569, "duration": 3.08}, {"text": "Mid-Course phase, and Terminal phase. Each phase have different challenges in terms of interception.", "start": 130.899, "duration": 5.03}, {"text": "During the boost phase, the US would first detect heat signatures from a launch with infrared satellites, and communicate this to the Command Center.", "start": 136.39, "duration": 6.41}, {"text": "Regional radar would pick up the missiles and provide accurate tracking. All of this data is processed, and a trajectory", "start": 143.41, "duration": 5.539}, {"text": "probability map Is built and continuously updated throughout the course of the flight.", "start": 149.35, "duration": 3.5}, {"text": "Interception at this point is not likely as the target is in enemy airspace, and most", "start": 153.52, "duration": 4.039}, {"text": "interceptors are not fast enough to reach the target before it enters the Mid-Course phase in the upper atmosphere", "start": 157.72, "duration": 4.85}, {"text": "in space. With the two or three stage", "start": 162.64, "duration": 2.3}, {"text": "ICBM the boost phase can last under ten minutes, and propel the vehicle to an altitude of around", "start": 165.13, "duration": 4.429}, {"text": "1,200 Kilometers above the surface of the Earth,", "start": 170.29, "duration": 2.269}, {"text": "or three times higher than the orbit of the", "start": 172.87, "duration": 2.24}, {"text": "International Space Station. At this point the projectile can be traveling as fast as seven kilometers per second, or twenty to twenty-five times the speed", "start": 175.18, "duration": 7.67}, {"text": "of sound,", "start": 182.85, "duration": 0.79}, {"text": "meaning a capable missile can travel halfway around the planet in about 45 minutes or less. If AEGIS sea-based or other ground-based", "start": 183.64, "duration": 7.099}, {"text": "interceptors are in range, short to intermediate range missiles", "start": 190.93, "duration": 2.75}, {"text": "targeting Japan, South Korea, or Guam can be intercepted by the AEGIS kinetic kill vehicle,", "start": 194.08, "duration": 4.97}, {"text": "meaning It physically intercepts the warheads with a kinetic impact. It accomplishes this with thrusters which allow it to maneuver in the final phase of engagement.", "start": 199.42, "duration": 7.789}, {"text": "This is not an easy task as the system must attempt", "start": 207.37, "duration": 2.929}, {"text": "to discriminate threats within the threat cloud the trek cloud consists of active warheads", "start": 210.3, "duration": 4.44}, {"text": "Decoys and debris in the case of North Korea it's unlikely multiple warheads would be used due to the size and weight", "start": 214.86, "duration": 6.14}, {"text": "constraints, but some primitive decoys are more than likely.", "start": 221.08, "duration": 2.42}, {"text": "The terminal phase is when the warheads begin to re-enter the atmosphere", "start": 223.959, "duration": 3.08}, {"text": "towards their targets. The Terminal High-Altitude Area Defense or THAAD is a long-range missile", "start": 227.29, "duration": 5.299}, {"text": "defense system that targets missiles at this stage with installations on the west coast of the United States,", "start": 232.84, "duration": 5.119}, {"text": "Alaska, Guam, and more recently South Korea.", "start": 238.239, "duration": 2.9}, {"text": "Similar to the Aegis the THAAD kill vehicle is a kinetic kill vehicle with four miniature boosters to control the projector", "start": 241.6, "duration": 5.899}, {"text": "During recent tests, this platform has been successful", "start": 247.959, "duration": 3.08}, {"text": "But an engineer's work is never complete. The US was working on a new interceptor dubbed the MKV or Multiple Kill Vehicle.", "start": 251.65, "duration": 7.19}, {"text": "incorporating a more advanced version of the Aerojet around a central launcher with Multiple Kill Vehicles that can independently", "start": 259.5, "duration": 5.48}, {"text": "intercept multiple warheads. It was later replaced by a similar multi-object kill vehicle as a contracted collaboration between", "start": 265.0, "duration": 6.98}, {"text": "Raytheon, Boeing, and Lockheed Martin.", "start": 272.42, "duration": 2.18}, {"text": "No system is perfect especially ones with such tight tolerances of success", "start": 274.76, "duration": 3.42}, {"text": "Considering the lack of active threat stress testing it's likely the BMDS will not have more than a 50/50 success rate per missile", "start": 278.5, "duration": 7.25}, {"text": "Against a threat like North Korea", "start": 286.0, "duration": 1.74}, {"text": "multiple interceptors will make an attempt and it's highly probable the US will succeed in taking it out. And if North Korea decided to attack Seoul,", "start": 287.74, "duration": 6.98}, {"text": "It's much more likely that they would be able to overwhelm their defenses", "start": 294.82, "duration": 3.18}, {"text": "against the threats such as Russia things don't look so good as hundreds of missiles equipped with ten warheads each", "start": 298.72, "duration": 5.64}, {"text": "Independently target different cities. The chance of a single warhead making a pass is high. Russian technology is simply superior to North Korea's.", "start": 304.93, "duration": 7.57}, {"text": "New hypersonic warheads are being developed that can change their direction", "start": 312.5, "duration": 3.0}, {"text": "mid-flight making predictive tracking almost impossible. Even if the ballistic missile defenses are 100% accurate there are simply more", "start": 316.0, "duration": 7.429}, {"text": "warheads than interceptors making the BMDS only a limited capability system. Luckily North Korea is a limited capability threat", "start": 323.59, "duration": 7.91}, {"text": "You may have admired some of the footage i used in this video like this, this, this, and this", "start": 332.02, "duration": 5.09}, {"text": "They all came from StoryBlocks.com My channel literally would not have been possible without their service", "start": 337.33, "duration": 5.57}, {"text": "When I began this channel I planned to animate everything but that is simply way", "start": 343.24, "duration": 4.01}, {"text": "too much work, so i began looking for a stock footage site that would have suitable footage to use in places that did not need", "start": 347.25, "duration": 6.299}, {"text": "animation and that's where Story Blocks came in. Story Blocks is the first and only stock media company", "start": 353.68, "duration": 5.209}, {"text": "offering unlimited free downloads of member library content for a modest annual fee of", "start": 359.04, "duration": 4.46}, {"text": "$149 dollars. I use up to 20 or more videos in each episode", "start": 363.72, "duration": 4.44}, {"text": "That would have cost upwards of $1000 without their service. This service is enabling so many channels like mine to exist I", "start": 368.53, "duration": 6.979}, {"text": "really can't recommend them enough and they have stock images and audio too", "start": 375.73, "duration": 3.469}, {"text": "you can try out their service for free for seven days by going to StoryBlocks.com/RealEngineering", "start": 379.3, "duration": 5.88}, {"text": "As always, thanks for watching and thank you to all my Patreon supporters", "start": 385.46, "duration": 3.02}, {"text": "for making this channel possible", "start": 388.74, "duration": 1.56}, {"text": "If you'd like to see more from me the links from my social media accounts are below on making efforts to post more", "start": 390.31, "duration": 5.389}, {"text": "educational content on my Instagram account, so check that out if you're interested.", "start": 395.8, "duration": 3.32}]