[{"text": "This video was made possible by Hover. Buy\nyour custom domain and email for 10% off at", "start": 0.59, "duration": 4.64}, {"text": "hover.com/HAI.\nWell, well, well, look what episode it is—HAI", "start": 5.23, "duration": 7.12}, {"text": "#100. I have finally disproven those strangely\nspecific haters who said I would never make", "start": 12.35, "duration": 5.0}, {"text": "more than 99 medium quality, slightly funny,\nslightly interesting videos on a nondescript", "start": 17.35, "duration": 4.11}, {"text": "grouping of subjects. Well, look at me now.\nAnyway, over the past 99 videos there have", "start": 21.46, "duration": 5.46}, {"text": "been literally hundreds of potential topics\nthat we decided not to do because, even as", "start": 26.92, "duration": 4.261}, {"text": "good we are at stretching out topics, they\ncouldn’t possibly fill up a full five minutes.", "start": 31.181, "duration": 5.139}, {"text": "As there’s no better way to celebrate 99\nof the same format of videos than something", "start": 36.32, "duration": 3.37}, {"text": "different, we’re going to cover as many\nas possible of those today. Welcome to Quarter", "start": 39.69, "duration": 5.32}, {"text": "as Interesting.\nSpeaking of quarters, let’s start with the", "start": 45.01, "duration": 2.69}, {"text": "land that doesn’t have any—Australia.\nBack in the 1930’s in Australia’s empty", "start": 47.7, "duration": 4.64}, {"text": "bit, there were lots of farmers and emus.\nNow, farmers and emu’s go together like", "start": 52.34, "duration": 5.25}, {"text": "fish sticks and frosting—poorly. The emu’s\nwould break fences, eat crops, they were just", "start": 57.59, "duration": 5.18}, {"text": "all around destructive and so the Australians,\nin keeping with their role as upside down", "start": 62.77, "duration": 4.599}, {"text": "Americans, decided to declare war… against\nthe emus. Basically, the army was sent out", "start": 67.369, "duration": 5.441}, {"text": "with machine guns, ammunition, and orders\nto kill as many emus’ as possible. Beyond", "start": 72.81, "duration": 4.419}, {"text": "that, it’s pretty much a normal war story\nexcept for the opponent being emu’s and", "start": 77.229, "duration": 3.6}, {"text": "in the end, the army actually lost because\nhave you even seen an emu? Now imagine tens", "start": 80.829, "duration": 3.981}, {"text": "of thousands of those. This is overall one\nof these, “great title, ok topic,” kinda", "start": 84.81, "duration": 5.03}, {"text": "videos which is why, despite receiving literally\nhundreds of requests for this, that’s all", "start": 89.84, "duration": 4.989}, {"text": "you get. Also, there’s a Sam O’Nella Video\non it so just go watch that.", "start": 94.829, "duration": 3.43}, {"text": "But let’s transition to Australia’s old,\nsenile father: the United Kingdom of Great", "start": 98.259, "duration": 4.261}, {"text": "Britain and probably Northern Ireland depending\non when you’re watching this. Two of the", "start": 102.52, "duration": 3.51}, {"text": "UK’s greatest loves are tea and football—the\nnon-moon-landing country kind. Now, when a", "start": 106.03, "duration": 5.21}, {"text": "child in born in the UK they are immediately\nissued an electric kettle—it’s a requirement", "start": 111.24, "duration": 4.679}, {"text": "for living there. These mythical devices are\nable to bring water to a boil in a matter", "start": 115.919, "duration": 4.18}, {"text": "of seconds which is crucial for improving\nthe country’s tcct statistics—that’s", "start": 120.099, "duration": 3.19}, {"text": "tea craving to consumption time. The problem,\nthough, is that these kettles use a lot of", "start": 123.289, "duration": 5.81}, {"text": "electricity and therefore, if a lot of people\nwant tea at the same time, the power grid", "start": 129.099, "duration": 4.692}, {"text": "has to predict and adjust to this in order\nto avoid a blackout. Of course, when everyone", "start": 133.791, "duration": 4.959}, {"text": "wants tea is when a football match finishes.\nThe biggest instance of this was in 1990 when", "start": 138.75, "duration": 5.879}, {"text": "England played West Germany in the World Cup\nsemi-final. After the shootout was finished,", "start": 144.629, "duration": 4.381}, {"text": "in which England lost, everyone watching the\nmatch in England went and turned on their", "start": 149.01, "duration": 3.65}, {"text": "kettles to make an anger tea and there was\na huge electricity surge of 2800 MegaWatts—equivalent", "start": 152.66, "duration": 5.859}, {"text": "to 1.1 million kettles being turned on simultaneously.\nIn the past this was a real concern for power", "start": 158.519, "duration": 6.36}, {"text": "grids during big TV events and so they had\nto develop techniques to quickly generate", "start": 164.879, "duration": 3.86}, {"text": "power in response but nowadays, it’s supposedly\nless of an issue as more and more of the country", "start": 168.739, "duration": 4.7}, {"text": "switches to watching Half as Interesting videos\nat any time they want—among other online", "start": 173.439, "duration": 4.5}, {"text": "video things.\nThis also wasn’t an issue back in the 1890’s—partially", "start": 177.939, "duration": 4.101}, {"text": "because not many people were watching TV,\npartially because time, as a concept, was", "start": 182.04, "duration": 4.29}, {"text": "iffy. The iPhones of the time didn’t set\nthe time automatically so people had to somehow", "start": 186.33, "duration": 4.31}, {"text": "get the accurate time from public clocks.\nIn Greenwich, England there were a few solutions", "start": 190.64, "duration": 4.47}, {"text": "to this. One was a ball at the top of the\nGreenwich Observatory that would drop at 1:00", "start": 195.11, "duration": 4.4}, {"text": "pm exactly but not everyone could see this.\nOne was a series of telegraph signals that", "start": 199.51, "duration": 4.539}, {"text": "would go off at certain times per day but\nnot everyone had a telegraph station. The", "start": 204.049, "duration": 4.082}, {"text": "third solution was to buy the time from a\nlady named Ruth Belville. Every morning, she", "start": 208.131, "duration": 5.169}, {"text": "would set her super-accurate pocket-watch\nto the accurate time of the Greenwich Observatory", "start": 213.3, "duration": 3.96}, {"text": "and then go around the town by horse and buggy\nto give the accurate time to those who subscribed", "start": 217.26, "duration": 4.339}, {"text": "to her service. I’d say, with having already\nfigured out how to subscript-ionize time,", "start": 221.599, "duration": 4.151}, {"text": "that she was ahead of her time, but as we\nknow, she was right on ti…ahh shut up me.", "start": 225.75, "duration": 5.209}, {"text": "But let’s transition to England’s favorite\nhexagon—France. If you want to get from", "start": 230.959, "duration": 4.64}, {"text": "the beautiful city of Nantes to the beautiful\nisland of Noirmoutier you have two choices—you", "start": 235.599, "duration": 4.98}, {"text": "can take the bridge like a boring oatmeal\neating dude or you can drive through the friggin", "start": 240.579, "duration": 4.52}, {"text": "ocean like you’re the prophet Moses back\nfrom the dead to enable slightly more convenient", "start": 245.099, "duration": 3.9}, {"text": "underwater road routes. The under ocean road\nin question is the Passage du Gois which is,", "start": 248.999, "duration": 4.89}, {"text": "and I can’t stress this enough, literally\nunderwater—at least for part of the day.", "start": 253.889, "duration": 5.111}, {"text": "You see, the coast of France has some of the\nlargest tides in the world with this particular", "start": 259.0, "duration": 4.65}, {"text": "area usually seeing about a 20 foot or 6 meter\ndifference between high and low tide. That’s", "start": 263.65, "duration": 4.78}, {"text": "enough to completely reveal this road at low\ntide. Cars are only allowed to drive on it", "start": 268.43, "duration": 4.68}, {"text": "for the 90 minutes before and after each low\ntide making its usage limited, but it can", "start": 273.11, "duration": 4.851}, {"text": "save about a whole ten or so minutes in comparison\nto taking the bridge when coming from the", "start": 277.961, "duration": 4.579}, {"text": "north.\nBut let’s now head west and then south to", "start": 282.54, "duration": 2.52}, {"text": "talk about one of the battles of the American\nCivil War. More south… more south… like,", "start": 285.06, "duration": 6.139}, {"text": "beyond the sofa on the porch kinda south…\nyeah, there. Now, I’m no rocket scientist,", "start": 291.199, "duration": 4.611}, {"text": "but based off what I know about South America,\nit is not the America in which the movie took", "start": 295.81, "duration": 4.669}, {"text": "place. So why was there an American civil\nwar battle there? Well, this is a quick one:", "start": 300.479, "duration": 4.701}, {"text": "basically, off the coast of Brazil there chilled\na Union boat, that was the OG US, and in came", "start": 305.18, "duration": 4.94}, {"text": "a Pacific-bound Confederate boat, those were\nthe breakaway bad guys. Both stopped in this", "start": 310.12, "duration": 4.86}, {"text": "Brazilian port. Upon seeing the bad guy boat,\nthe union boat sent a letter over basically", "start": 314.98, "duration": 4.8}, {"text": "saying, “u wot m8,” to which the confederate\nboat responded, “I’m just trying to get", "start": 319.78, "duration": 3.5}, {"text": "repaired and leave,” to which the union\nboat responded, “boom,” as it fired its", "start": 323.28, "duration": 3.81}, {"text": "cannons at it in the middle of the night.\nThose cannonballs missed but then they exchanged", "start": 327.09, "duration": 4.28}, {"text": "musket fire, the Union boat rammed the confederate\none, boarded it, and won. The Brazilians understandably", "start": 331.37, "duration": 5.329}, {"text": "were not pleased about the US having a battle\non their turf, but the US, surprisingly, didn’t", "start": 336.699, "duration": 4.69}, {"text": "care even though the unprovoked attack was,\nlike, full-on, without-a-doubt illegal but", "start": 341.389, "duration": 4.631}, {"text": "anyway, that’s why there was a US Civil\nWar Battle in South America.", "start": 346.02, "duration": 4.53}, {"text": "Now, if you ever become a mid-to-late 1800’s\nnaval captain, you’ll know that one thing", "start": 350.55, "duration": 5.049}, {"text": "that you’ll desperately need is respect.\nWell, I guarantee you the best way to get", "start": 355.599, "duration": 5.331}, {"text": "your sailors to respect you is to have a professional-looking\nemail address at a custom domain. Nothing", "start": 360.93, "duration": 5.54}, {"text": "screams, “in control,” like captain@lookatmyhat.cool.\nThat email, or really any email using their", "start": 366.47, "duration": 6.259}, {"text": "over 400 domain extensions, can be yours in\nabout 120 seconds by going to hover.com/HAI.", "start": 372.729, "duration": 7.521}, {"text": "You can also, of course, just buy a domain\nfrom Hover as they’re the best place to", "start": 380.25, "duration": 3.82}, {"text": "buy your corner of the internet before someone\nelse steals your domain name. Whether its", "start": 384.07, "duration": 4.21}, {"text": "an email or a domain, you can get 10% off\nyour first purchase by going to hover.com/HAI", "start": 388.28, "duration": 5.72}, {"text": "and you’ll be supporting the show while\nyou’re at it.", "start": 394.0, "duration": 1.18}]