[{"text": "This video is sponsored by VRV. For a limited time, go to \nVRV.co/circletoonsHD to get an ad free 30 day free trial of VRV Premium.", "start": 0.02, "duration": 7.52}, {"text": "But more on them at the end of this video!", "start": 7.54, "duration": 2.38}, {"text": "The Legend of Zelda Breath of the wild is a game made by Nintendo about two and a half years ago,", "start": 9.92, "duration": 4.299}, {"text": "But I never got to really review it, so here I am!", "start": 14.22, "duration": 3.02}, {"text": "Wow, circle this is so embarrassing for you. No one's even gonna care about your review now.", "start": 17.24, "duration": 4.9}, {"text": "Well the way I see it is we both paid $60 for the same game,", "start": 22.14, "duration": 3.75}, {"text": "You rushed it to complete your review in the first week, but I enjoyed it like a fine wine. And by that", "start": 25.89, "duration": 5.34}, {"text": "I mean I was.. I was too lazy [wheeze]", "start": 31.23, "duration": 2.0}, {"text": "to beat it.. Well, maybe lazy isn't the right word to use.", "start": 33.309, "duration": 2.63}, {"text": "I'd rather use:", "start": 35.94, "duration": 1.119}, {"text": "intimidated by its incredible amount of content.", "start": 37.06, "duration": 2.34}, {"text": "When I started breath the wild, I made sure I was gonna do two things. One: do everything by myself, and two:", "start": 39.4, "duration": 5.62}, {"text": "never look anything up on the internet at all. I went like 30 hours without knowing you could cut down trees!", "start": 45.12, "duration": 7.26}, {"text": "W  H  A  T", "start": 52.78, "duration": 0.88}, {"text": "I am so glad I chose to play this game totally blind, because it made everything that happened an actual discovery, and it felt like a real adventure.", "start": 53.66, "duration": 7.74}, {"text": "The first time I saw that", "start": 61.4, "duration": 1.1}, {"text": "MASSIVE FLYING YELLOW DRAGON", "start": 62.5, "duration": 1.82}, {"text": "I nearly had a heart attack. And that is exactly what breath of the wild does the best.", "start": 64.32, "duration": 4.38}, {"text": "Past Zelda games are formulaic and same-y. And trust me, I've played a ton of Zelda games and I do love them,", "start": 68.7, "duration": 4.95}, {"text": "but that's just a fact. Breath of the Wild takes that normal Zelda formula, and", "start": 73.65, "duration": 3.85}, {"text": "absolutely demolishes it.", "start": 77.56, "duration": 1.24}, {"text": "Instead of giving a set goal and pattern of tasks you have to follow,", "start": 78.8, "duration": 3.6}, {"text": "it just pushes you out in the open and says, \"Alright kid,", "start": 82.4, "duration": 2.2}, {"text": "you think you're so good at video games, go be a f###ing gamer. Huh? Go kill Ganon, loser! Figure it out your damn self,", "start": 84.6, "duration": 5.42}, {"text": "I'm not holding your hand anymore,\"", "start": 90.02, "duration": 1.48}, {"text": "The game is so open in fact, if you truly hate yourself, you can walk up straight to Ganon's front door and kill him.", "start": 91.5, "duration": 5.84}, {"text": "I mean, it's gonna be basically impossible, but that's your choice. You can do that!", "start": 97.34, "duration": 3.44}, {"text": "[Evil Laughter] Link will never save Princess Zelda!", "start": 100.78, "duration": 4.34}, {"text": "Umm.. So, uh, hey, I'm here to, uh, save the princess.. \"What? How did you get in?\"", "start": 105.12, "duration": 5.76}, {"text": "Yeah, it was kind of annoying. I had to walk through your front gate. There were a few angry Robo spiders, but I made my way here.", "start": 110.96, "duration": 5.82}, {"text": "So, um hand her over.", "start": 116.88, "duration": 1.12}, {"text": "But because I don't have a death wish, I chose not to walk straight into Ganon's doom lair.", "start": 118.12, "duration": 4.7}, {"text": "I chose to actually adventure on and see what was waiting for me in this huge map.", "start": 122.94, "duration": 4.12}, {"text": "Gee, oh my god,", "start": 127.06, "duration": 1.06}, {"text": "This thing is ridiculous.", "start": 128.22, "duration": 1.24}, {"text": "There are over 100 shrines in this game, and each one is different than the last.", "start": 129.46, "duration": 3.66}, {"text": "Some might have you face off against a powerful enemy, while others might have you do something STUPID like carry an ice cube", "start": 133.18, "duration": 5.14}, {"text": "up a gauntlet of fire.", "start": 138.32, "duration": 1.22}, {"text": "[Heavy Breathing]", "start": 139.54, "duration": 0.9}, {"text": "Don't you melt on me! DON'T YOU MELT ON ME!", "start": 140.44, "duration": 2.4}, {"text": "These shrines kind of work as mini dungeons that always keep the game super fresh.", "start": 142.84, "duration": 3.62}, {"text": "Because they glow orange, and the draw distance in this game is ridiculous,", "start": 146.48, "duration": 3.84}, {"text": "There's always that moment when you're paragliding or climbing up a mountain where you go, \"Huh.. heck saving the princess,", "start": 150.32, "duration": 5.3}, {"text": "I'mma go check out that", "start": 155.62, "duration": 1.0}, {"text": "There could be the most simple quest, like an old lady going, \"Hehhh, Adventurer,", "start": 156.7, "duration": 3.92}, {"text": "I need an herb to finish my pie,\"", "start": 160.62, "duration": 2.82}, {"text": "And I would come back 40 days later with 20 Korok Seeds, a new helmet, and a new sword.", "start": 163.48, "duration": 4.96}, {"text": "Now, this experience isn't really new to RPGs, but it's new to as Zelda game.", "start": 168.56, "duration": 4.04}, {"text": "[Weird Noises] But wait a minute, Breath Of The Wild isn't an RPG! It's an action adventure game. [Weird Noises]", "start": 172.76, "duration": 5.34}, {"text": "Which is true, but when you have a Zelda game that's totally open world with collectables, and upgrades, and side quests, and main quests,", "start": 178.1, "duration": 6.52}, {"text": "I'm gonna compare it to games that are also like that.", "start": 184.62, "duration": 2.19}, {"text": "I want to say this is the best Zelda game ever made, but it's not really a Zelda game.", "start": 186.81, "duration": 3.93}, {"text": "I mean, yeah, it's got your Gannons, and your Zeldas, and your Master Swords and your [burp]", "start": 190.74, "duration": 4.48}, {"text": "Octoroks, but never have you had this overwhelming sense of freedom.", "start": 195.38, "duration": 4.16}, {"text": "And not just in its layout or quest structure, but in how you handle every situation.", "start": 199.54, "duration": 4.42}, {"text": "The game gives you a huge toolbox of things to use,", "start": 203.98, "duration": 2.8}, {"text": "and rules for those tools. And the game always tries to follow its own rules no matter which way you use them.", "start": 206.78, "duration": 4.92}, {"text": "For example, you could fight mobs in a thunderstorm normally by swinging your sword at 'em,", "start": 211.7, "duration": 4.62}, {"text": "maybe throw in a few bombs.", "start": 216.33, "duration": 0.96}, {"text": "OR..", "start": 217.29, "duration": 0.61}, {"text": "You could be an ABSOLUTE Chad, drop that sword from your inventory, pull out your magnet powers, float in the air, wait for thunder to hit it,", "start": 217.9, "duration": 6.82}, {"text": "then drop the sword on top of them, causing them to die to lightning. [Laugh] Like, it's amazing!", "start": 224.72, "duration": 5.34}, {"text": "And like I said before, I played this game totally blind; and figuring out these things for yourself is so rewarding.", "start": 230.06, "duration": 5.82}, {"text": "If you haven't played breath the wild already, I highly recommend you play blind like I did.", "start": 235.88, "duration": 4.68}, {"text": "Personally, I try to play every single player game blind, because half the fun for me is discovering stuff on my own instead of", "start": 240.62, "duration": 5.88}, {"text": "going online and googling it.", "start": 246.5, "duration": 1.5}, {"text": "With games like Fallout or Skyrim, I enjoyed going to that next mysterious area instead of just googling,", "start": 248.0, "duration": 5.1}, {"text": "\"Um, how do I get the most powerful sword?\" and maybe that's just the Dungeons & Dragons lover inside of me;", "start": 253.1, "duration": 5.76}, {"text": "I like to ask my own question and get my own answers. These are adventure games,", "start": 258.87, "duration": 3.51}, {"text": "So go out there and adventure. Explore! Don't follow a guide on how you should", "start": 262.38, "duration": 4.42}, {"text": "be exploring or experiencing the game. Shigeru Miyamoto once said that he took heavy", "start": 266.8, "duration": 3.94}, {"text": "inspiration from the forests and caves he used to explore as a kid when developing the first Zelda game.", "start": 270.76, "duration": 4.92}, {"text": "So I truly feel that playing breath of the wild without any guides or walkthroughs", "start": 275.76, "duration": 3.92}, {"text": "is the best way to capture that sense of exploration and mystery that he was trying to create.", "start": 279.68, "duration": 4.68}, {"text": "But also if you play this game blind,", "start": 284.36, "duration": 1.7}, {"text": "you don't realize how SCARY Ganon is, and then when you're on the final battle you realize that he's a", "start": 286.06, "duration": 3.94}, {"text": "TERRIBLE MONSTER", "start": 290.0, "duration": 1.12}, {"text": "mixed with a demon and a cockroach you piss yourself!", "start": 291.18, "duration": 2.5}, {"text": "[Nervous Laughter]", "start": 293.68, "duration": 1.12}, {"text": "..or was that just me?", "start": 294.8, "duration": 1.54}, {"text": "I want to give another huge shout-out to VRV for sponsoring this video.", "start": 296.42, "duration": 2.88}, {"text": "VRV is an awesome service that you can watch your favorite animes and web shows on your", "start": 299.4, "duration": 3.62}, {"text": "XBOX, PlayStation, IOS, Android, frickin'", "start": 303.02, "duration": 2.42}, {"text": "EVERYTHING at any time you want. If you haven't already, you've got to check out bravest warriors.", "start": 305.44, "duration": 4.02}, {"text": "It's exclusive on VRV, and it's one of my favorite shows of all time.", "start": 309.46, "duration": 3.46}, {"text": "You can even watch those offline without an internet connection with VRV Premium, if you sync your episodes ahead of time,", "start": 312.92, "duration": 4.92}, {"text": "so you can watch it later. With VRV Premium, you also get unlimited access to the best must-have channels;", "start": 317.84, "duration": 4.94}, {"text": "you get first access to that content, and you get that content ad free.", "start": 322.78, "duration": 3.779}, {"text": "So guys, I can't recommend this enough. Go to VRV.co/circletoonsHD, or click the link in my description below", "start": 326.56, "duration": 5.46}, {"text": "to get a 30-day free trial of VRV \npremium. This service is amazing,", "start": 332.02, "duration": 4.02}, {"text": "And thank you guys so much for sponsoring this video.", "start": 336.04, "duration": 2.4}, {"text": "See you guys in the next one!", "start": 338.44, "duration": 1.2}, {"text": "Peace out! :D", "start": 339.64, "duration": 1.02}]