[{"text": "When I was taking this script around, and -and because it's a love story between a mother and a daughter,", "start": 0.06, "duration": 4.11}, {"text": "I remember every -every man I talked to who", "start": 4.17, "duration": 3.299}, {"text": "was raised with sisters or, who had a daughter...", "start": 7.689, "duration": 3.199}, {"text": "said \"I know this. That's my wife and my daughter.\" or \"That's my sister or my mom.\" And guys who didn't,", "start": 11.019, "duration": 5.3}, {"text": "as they said \"I don't... Do women fight like this?\"", "start": 16.42, "duration": 2.93}, {"text": "Like, ohh...", "start": 19.35, "duration": 1.39}, {"text": "...you've never seen this, because why would you know that this is what this relationship is?", "start": 20.74, "duration": 7.1}, {"text": "[Ripley]: This is Ripley, last survivor of the Nostromo...", "start": 33.78, "duration": 4.74}, {"text": "...signing off.", "start": 39.52, "duration": 1.72}, {"text": "The movie \"Alien\" provides a fascinating case study", "start": 41.24, "duration": 2.38}, {"text": "into how women are typically written.", "start": 43.84, "duration": 1.82}, {"text": "In an early draft of the script, the screenwriter wrote that the crew is unisex and all parts are interchangeable", "start": 45.66, "duration": 4.78}, {"text": "for men or women. The character of Ripley can't really reinforce stereotypes", "start": 50.44, "duration": 3.56}, {"text": "about women, because the writer did not have a woman in mind in the first place.", "start": 54.16, "duration": 3.58}, {"text": "In many ways, a largely genderless hero", "start": 57.74, "duration": 2.16}, {"text": "is a great character to have in a critically acclaimed, Hollywood blockbuster.", "start": 59.9, "duration": 3.9}, {"text": "There's something cathartic about not having to think about gender in a main character.", "start": 63.8, "duration": 3.86}, {"text": "Writing without a woman in mind means a writer can", "start": 67.66, "duration": 2.08}, {"text": "explore universal human experiences, without worrying about falling into stereotype.", "start": 69.75, "duration": 4.68}, {"text": "It's definitely fun and exciting to see a character who doesn't get treated differently because she's a woman.", "start": 74.43, "duration": 5.07}, {"text": "She is a well-written character with qualities not associated with any particular gender.", "start": 79.5, "duration": 4.64}, {"text": "Ripley in \"Alien\" is a strong woman character,", "start": 84.14, "duration": 2.4}, {"text": "because gender plays a very little role, and her strengths could just as easily exist in a masculine character.", "start": 86.64, "duration": 5.88}, {"text": "Ripley is just one of the many valid ways to approach writing women.", "start": 92.52, "duration": 3.72}, {"text": "She plays out the fantasy that gender can be ignored and that leads to a great movie with a great lead...", "start": 96.24, "duration": 4.769}, {"text": "...but a big strength of film is its ability to tell different human experiences,", "start": 101.009, "duration": 4.671}, {"text": "and the real world is usually much different than Ripley's.  Your gender plays a huge part in your identity.", "start": 105.68, "duration": 4.57}, {"text": "There's nothing wrong with a movie that explores a character without exploring their gender,", "start": 110.25, "duration": 3.869}, {"text": "but a movie that incorporates gender into the story can lead to moving and diverse character arcs.", "start": 114.119, "duration": 5.099}, {"text": "[Hannibal Lector]: Good evening, Clarice.", "start": 119.3, "duration": 1.76}, {"text": "Maybe the best example of writing women with gender at the forefront is Clarice Starling in \"Silence of the Lambs.\"", "start": 121.06, "duration": 4.94}, {"text": "She stands out in the masculine dominated world of the FBI, and she is rarely taken seriously by her masculine", "start": 126.16, "duration": 6.54}, {"text": "counterparts. Most guys either subtly check her out or blatantly hit on her.", "start": 132.7, "duration": 3.64}, {"text": "Frederic Chilton thinks she was only assigned to interview Lector because she's a pretty girl.", "start": 136.49, "duration": 3.779}, {"text": "[Starling]: I graduated from UVA doctor, it is not a Charm School.", "start": 140.48, "duration": 3.04}, {"text": "[Professor]: Good, then you should be able to remember the rules.", "start": 143.52, "duration": 2.32}, {"text": "Perhaps the moments that emphasize her gender the most are the subjective point of view shots of men gazing at her.", "start": 146.13, "duration": 5.029}, {"text": "They are always looking either in contempt or attraction,", "start": 151.16, "duration": 2.639}, {"text": "clearly marking her as an outsider and, there's more to pointing out her gender than just to show sexism in the workplace.", "start": 154.04, "duration": 5.66}, {"text": "Her gender has clearly shaped parts of her character arc.", "start": 159.7, "duration": 3.1}, {"text": "She personally identifies with the women abducted by Buffalo Bill.  Seeing the wake of one of the girls gives her a flashback of her father's death.", "start": 162.8, "duration": 7.28}, {"text": "The opening shot of the movie has Clarice pulling herself up a hill, and her goal in the movie is", "start": 170.08, "duration": 4.44}, {"text": "to save the captured girls from holes they cannot pull themselves out of.", "start": 174.53, "duration": 3.66}, {"text": "[Lector]: What did you do?", "start": 179.04, "duration": 2.0}, {"text": "[Starling, whispering]: I went... downstairs...", "start": 181.32, "duration": 3.22}, {"text": "...I crept up into the barn.", "start": 185.3, "duration": 2.0}, {"text": "I was so scared to look inside, but I had to.", "start": 188.16, "duration": 2.92}, {"text": "[Lector]: What did you see Clarice, what did you see?", "start": 192.26, "duration": 3.1}, {"text": "[Starling]: Lambs.", "start": 196.06, "duration": 1.5}, {"text": "[Whispering]: They were screaming.", "start": 198.48, "duration": 1.28}, {"text": "[Woman yelling]: Just get me out of here!\n*Dog barking*", "start": 199.96, "duration": 1.88}, {"text": "[Lector]: You ran away?", "start": 201.84, "duration": 1.62}, {"text": "*Dog whimpering*", "start": 203.46, "duration": 1.3}, {"text": "[Starling]: No.", "start": 204.76, "duration": 2.0}, {"text": "[Starling]: Catherine...", "start": 206.76, "duration": 0.92}, {"text": "*Dog still whimpering*", "start": 207.68, "duration": 0.58}, {"text": "...I'm gonna get you out of there, but right now you listen to me.", "start": 208.26, "duration": 1.92}, {"text": "The climactic finale of the movie is the ultimate visual link between the Buffalo Bill", "start": 210.18, "duration": 4.5}, {"text": "abductions, and the men looking down on Clarice. In Buffalo Bill's lair,", "start": 214.8, "duration": 3.47}, {"text": "he watches over her while she's unable to see him.", "start": 218.27, "duration": 2.71}, {"text": "[Lector]: Don't you feel eyes moving over your body, Clarice?", "start": 220.98, "duration": 3.26}, {"text": "Of course, this scene is creepy and", "start": 224.76, "duration": 1.74}, {"text": "incredible all on its own, but it also means more because she is a woman and because we have already inhabited her", "start": 226.5, "duration": 5.75}, {"text": "perspective, as a woman in a world where men glare at her and objectify her.", "start": 232.38, "duration": 3.649}, {"text": "She has a universal journey of triumph against adversity,", "start": 236.04, "duration": 3.1}, {"text": "but the obstacles in her path are shaped by the fact that she is a woman. If she were played by a man, the movie", "start": 239.14, "duration": 5.04}, {"text": "would feel drastically different. Unlike Ripley an \"Alien,\" Starling's gender elevates", "start": 244.2, "duration": 4.22}, {"text": "the emotional payoff of the movie. Starling's gender is a key component of her character arc.", "start": 248.42, "duration": 4.5}, {"text": "It's a realistic, grounded and important story, but a movie starring a woman doesn't always have to focus on the struggles of being a woman.", "start": 252.92, "duration": 6.389}, {"text": "The bride in \"Kill Bill\" is certainly not genderless. Her story begins when she's shot at her own wedding while pregnant. Immediately", "start": 264.81, "duration": 5.88}, {"text": "after waking from a coma, she goes on her quest for revenge on her assailant, her former lover Bill. The bride embodies the character", "start": 270.759, "duration": 6.44}, {"text": "traits of a traditional masculine hero. Revenge is a classic staple of drama and a common plot line for narratives typically starring men.", "start": 277.2, "duration": 6.9}, {"text": "In contrast, \"Alien\" and \"Silence of the Lambs\" have more in common with a survival narrative. Ripley survives an invasion of an alien monster...", "start": 284.1, "duration": 6.38}, {"text": "...Starling does choose to confront the villain herself,. but much of her story involves surviving events that are out of her control.", "start": 290.86, "duration": 6.05}, {"text": "She has to withstand the gaze of other men,", "start": 296.919, "duration": 2.42}, {"text": "especially in the climax when she's blind to the villain staring right at her. With \"Kill Bill,\"", "start": 299.41, "duration": 4.429}, {"text": "the story is completely driven by the hero. Her journey is not a situation", "start": 303.84, "duration": 4.019}, {"text": "she's thrust into, but rather a conscious plan", "start": 307.86, "duration": 2.429}, {"text": "she devised for herself. This quest for revenge", "start": 310.289, "duration": 2.37}, {"text": "echoes the popular storylines of old American westerns, where heroes decide to reconcile some past trauma. Like Ripley in Alien,", "start": 312.82, "duration": 7.489}, {"text": "she fulfills a fantasy of transcending her gender...", "start": 320.31, "duration": 2.83}, {"text": "...but instead of being genderless like Ripley, the bride fulfills the fantasy of being the action hero archetype,", "start": 323.14, "duration": 5.509}, {"text": "traditionally associated with a man. The bride does not asked gender-neutral; she acts in a masculine way, just like the male heroes before her.", "start": 328.99, "duration": 7.04}, {"text": "She's aggressive; She takes charge of the story and she gets her revenge. \"Kill Bill\" fulfills", "start": 336.03, "duration": 4.709}, {"text": "the fantasy that a female character can act like a male hero. The movie gives a fresh perspective on writing women.", "start": 340.74, "duration": 5.669}, {"text": "She is never a victim in this movie. When men wrong her,", "start": 346.409, "duration": 2.67}, {"text": "she always fights back immediately. Starling had to tolerate the men in her life,", "start": 349.08, "duration": 4.05}, {"text": "but the bride doesn't have to. Like the characters before her, she's tapping into the", "start": 353.13, "duration": 3.869}, {"text": "universal fantasy of being able to right every wrong. The trade-off is that this movie does not seem to tap into a distinctly feminine experience.", "start": 357.06, "duration": 7.44}, {"text": "What I mean by that is, her near-death feels like this symbolic death of a delicate, more feminine side of her.", "start": 364.5, "duration": 5.62}, {"text": "As appropriate and badass as this transformation might be, there does seem to be a part of the female experience", "start": 370.12, "duration": 5.42}, {"text": "missing in this story. All three of these movies write women with some element of a masculine", "start": 376.0, "duration": 4.609}, {"text": "perspective. \"Alien\" is a movie where the characters could have been played by men.", "start": 380.889, "duration": 3.32}, {"text": "\"The Silence of the Lambs\" has Clarice interacting almost exclusively with men, and \"Kill Bill\" has a woman playing a masculine role.", "start": 384.21, "duration": 6.269}, {"text": "It's also worth noting that all of these movies were written and directed by men.", "start": 390.479, "duration": 3.52}, {"text": "So, it makes sense that there are some masculine elements in each of them.", "start": 394.0, "duration": 3.539}, {"text": "Maybe the last piece of the puzzle is a movie that embraces an experience exclusive to women.", "start": 397.539, "duration": 4.5}, {"text": "[Marion]: You're not even worth state tuition Christine.", "start": 402.04, "duration": 2.2}, {"text": "[Ladybird]: My name is Lady Bird!", "start": 404.24, "duration": 1.3}, {"text": "[Marion]: *stammers* Well,", "start": 405.56, "duration": 0.5}, {"text": "actually, it's not. And, it's ridiculous...", "start": 406.06, "duration": 2.0}, {"text": "Unlike most coming-of-age movies Christine's romantic interests in \"Lady Bird\" are fleeting and unimportant.", "start": 408.14, "duration": 4.399}, {"text": "She paints over her crushes' names before moving out... a visual reminder that she has completely moved on. And, those", "start": 412.539, "duration": 5.4}, {"text": "relationships do not have a permanent effect on her. The relationship with her mother is explored with much more detail.", "start": 418.009, "duration": 4.91}, {"text": "The opening shot instantly shows us the movie's emotional core. In the script, Greta Gerwig describes this opening shot as \"a modern-day", "start": 423.08, "duration": 6.739}, {"text": "romantic Mary Cassatt ripoff painting of motherhood.\"", "start": 429.819, "duration": 3.0}, {"text": "Mary Cassatt was an impressionist painter known for her images of women in social and private life. Unlike many painters at that time, Cassat", "start": 432.83, "duration": 6.89}, {"text": "consistently portrayed her women with a dignity that suggested deeper, more intimate views of her characters. People", "start": 439.94, "duration": 5.719}, {"text": "look at Cassatt's paintings and relate to the mother-child interactions in their familiar activities.", "start": 445.659, "duration": 4.77}, {"text": "The thoughtful expressions of many of her subjects gives them a certain intellectual look, like there's more than meets the eye.", "start": 450.43, "duration": 5.309}, {"text": "I think a Greta Gerwig wants to capture that exact spirit in this movie. \"Lady Bird\" gives an incredible", "start": 455.86, "duration": 5.1}, {"text": "look at the complicated relationship", "start": 460.96, "duration": 1.269}, {"text": "between two women. Who would have thought a mother's opinion on the clothes her daughter tries on could have so many layers?", "start": 462.229, "duration": 5.39}, {"text": "[Marion]: I want you to be...", "start": 467.62, "duration": 2.0}, {"text": "...the very best version of yourself, that you can be.", "start": 469.9, "duration": 3.1}, {"text": "[Ladybird]: What if this is the best version?", "start": 474.16, "duration": 2.0}, {"text": "This scene ends with the mom trying to think of what to say, and cutting to the next scene before she's able to. Gerwig noted", "start": 476.98, "duration": 5.8}, {"text": "that Lady Bird and her mother are most intimate when they are unconscious in the first frame.", "start": 482.8, "duration": 4.14}, {"text": "We will never see them be this close to each other for the rest of the film. Ironically,", "start": 486.94, "duration": 3.779}, {"text": "they also look extremely similar, which Gerwig", "start": 490.719, "duration": 2.16}, {"text": "reinforces in the match cuts of them driving. Despite their similarities, these characters try to be as different from each other as possible.", "start": 493.039, "duration": 6.02}, {"text": "It's this complicated back-and-forth relationship that makes their scenes so full of depth.", "start": 499.06, "duration": 4.48}, {"text": "[Ladybird]: You are so infuriating!", "start": 503.54, "duration": 1.32}, {"text": "[Marion]: Please stop yelling.", "start": 504.86, "duration": 0.7}, {"text": "[Ladybird]: I'm not yelling.", "start": 505.56, "duration": 1.12}, {"text": "[Ladybird]: *Gasps* Ohh, thats perfect.", "start": 506.68, "duration": 1.92}, {"text": "[Marion]: Do you love it?", "start": 508.6, "duration": 0.84}, {"text": "The characters are imperfect, and most importantly vulnerable. While there's value in the female badasses like Kill Bill,", "start": 509.44, "duration": 5.28}, {"text": "there's also a strength in embracing the weaknesses and faults a person can have. It's about covering the entire spectrum of human experience,", "start": 514.76, "duration": 7.19}, {"text": "where a female can act a masculine in one movie and feminine in another. Women directors and writers can give an honest and relatable depiction", "start": 521.95, "duration": 6.51}, {"text": "of women experiences in addition to the fantasies of FBI", "start": 528.46, "duration": 2.969}, {"text": "Agents, space explorers, and assassins. and it's important that all these kinds of characters exist for women.", "start": 531.56, "duration": 5.21}, {"text": "Each of these characters gives us a different look into the human experience", "start": 536.77, "duration": 3.029}, {"text": "Maybe a well-written character played by a woman challenges you to think a little differently.", "start": 539.81, "duration": 3.679}, {"text": "Maybe they challenge you to look without gender or to see women from a new perspective. If it works, it works.", "start": 543.68, "duration": 4.94}, {"text": "There's no wrong way to write women.", "start": 548.72, "duration": 2.0}, {"text": "At the end of the day, the great part about cinema is how it gives us a window into worlds", "start": 551.18, "duration": 4.61}, {"text": "we wouldn't have seen on our own. Combine that with the connectivity of the Internet, and the possibilities are endless.", "start": 555.79, "duration": 4.739}, {"text": "If you're looking to expand your understanding across many different subjects,", "start": 560.89, "duration": 3.45}, {"text": "then I highly recommend the award-winning documentaries on CuriosityStream.", "start": 564.34, "duration": 3.959}, {"text": "CuriosityStream is a subscription streaming service founded by John Hendricks, the founder of the Discovery Channel.", "start": 568.67, "duration": 5.21}, {"text": "It offers over 2000 documentaries and nonfiction titles, from some of the world's best filmmakers.", "start": 574.0, "duration": 5.07}, {"text": "They have a great series on Viking women that goes in-depth on the experience of women in the masculine culture", "start": 579.07, "duration": 5.59}, {"text": "they lived in. Go to CuriosityStream.com/nowyouseeit for unlimited access to the world's top", "start": 584.68, "duration": 4.92}, {"text": "documentaries and nonfiction series. Enter the promo code \"nowyouseeit\"", "start": 589.68, "duration": 3.24}, {"text": "when prompted during the signup process, and your membership is completely free for the first 30 days.", "start": 592.92, "duration": 4.84}, {"text": "♪ [Outro music] ♪", "start": 597.76, "duration": 4.88}]