[{"text": "It’s a cool and quiet April evening at Oscarsborg fortress.", "start": 0.56, "duration": 4.0}, {"text": "Colonel Birger Eriksen of the Norwegian Army takes his time, strolling down the pathway", "start": 4.66, "duration": 5.1}, {"text": "and looking as thick mist slowly descends down the nearby hills that encompassed the Oslofjord.", "start": 9.76, "duration": 5.68}, {"text": "The colonel is just about to end his regular inspection before going to have some well deserved rest.", "start": 15.56, "duration": 4.64}, {"text": "The calm atmosphere is suddenly spurred into energy, as one of his officers catches up to him and gasps his report:", "start": 20.34, "duration": 6.96}, {"text": "A flotilla of enemy warships has breached into the fjord some sixty kilometres to the south,", "start": 27.44, "duration": 5.2}, {"text": "bringing war to Norway.", "start": 32.64, "duration": 2.28}, {"text": "This video is sponsored by World of Warships Blitz", "start": 36.86, "duration": 3.46}, {"text": "Tactical sea combat awaits, in the free to play World of Warships Blitz.", "start": 40.42, "duration": 3.8}, {"text": "Available via the App Store and Google Play, World of Warships Blitz lets you take to the seas as the commander of your very own battle-fleet.", "start": 44.22, "duration": 7.4}, {"text": "What’s more, as of the end of this month the game now boasts a new, fast and deadly addition to your armada, The German Destroyers!", "start": 51.74, "duration": 8.42}, {"text": "For the admiral who embodies the word, Blitz. Support our channel by clicking the link in the description below,", "start": 60.24, "duration": 6.16}, {"text": "install the game and upon reaching level 3 you will receive your very own German Destroyer,", "start": 66.4, "duration": 4.82}, {"text": "the G101 with forward firing torpedo capabilities!", "start": 71.34, "duration": 5.16}, {"text": "It is the middle of December of the year 1939.", "start": 85.42, "duration": 3.28}, {"text": "After the successful invasion of Poland a couple of months earlier,", "start": 88.92, "duration": 3.44}, {"text": "the German High Command focuses on replenishing material and manpower losses,", "start": 92.42, "duration": 4.68}, {"text": "in addition to sketching out plans for the following year’s campaign to the West.", "start": 97.24, "duration": 4.06}, {"text": "At the same time, German leaders also become increasingly aware", "start": 101.66, "duration": 3.76}, {"text": "of the British readiness to infringe on the neutrality of Norway and Sweden", "start": 105.42, "duration": 4.48}, {"text": "in the event of any hostile German activity in the area.", "start": 110.06, "duration": 3.86}, {"text": "Such British action would not only curb the potential of the Kriegsmarine", "start": 114.44, "duration": 3.96}, {"text": "by capturing some strategic naval bases on the Norwegian coast,", "start": 118.6, "duration": 3.48}, {"text": "but also be a severe blow to the German war economy.", "start": 122.26, "duration": 3.2}, {"text": "Due to insufficient domestic supply,", "start": 125.6, "duration": 2.22}, {"text": "the German industry was heavily dependent on shipments of Swedish iron ore being moved through the ports of Luleå and Narvik.", "start": 128.0, "duration": 7.14}, {"text": "Thus, the German planners were urged to lay out another offensive operation, but this time to the North.", "start": 135.6, "duration": 7.32}, {"text": "Though initially of relatively low priority, the German invasion plan picked up momentum in mid February of the next year,", "start": 143.36, "duration": 7.42}, {"text": "when the British destroyer flotilla intercepted the German oil tanker Altmark in the Norwegian fjord,", "start": 150.9, "duration": 5.62}, {"text": "and freed three hundred British prisoners of war previously captured by the Kriegsmarine on the southern Atlantic.", "start": 156.52, "duration": 6.38}, {"text": "This incident, where both allied and axis forces violated Norwegian neutrality,", "start": 163.32, "duration": 5.5}, {"text": "convinced Hitler that the British threat to German interests in the region was real,", "start": 169.04, "duration": 5.08}, {"text": "and so an invasion of Norway was given top priority.", "start": 174.26, "duration": 3.5}, {"text": "In the beginning of April, the preparation period was over.", "start": 178.32, "duration": 3.08}, {"text": "The invading force was organized into six battle groups to perform amphibious assaults on six primary targets,", "start": 181.66, "duration": 7.1}, {"text": "among them, the capital city of Oslo.", "start": 188.9, "duration": 3.12}, {"text": "Here the main German objective was to capture King Haakon alongside the Norwegian Cabinet", "start": 192.34, "duration": 5.22}, {"text": "in a surprise strike and subsequently install a puppet government in place of the old one.", "start": 197.56, "duration": 5.9}, {"text": "The nautical path to the Norwegian capital led through the Oslofjord, a 100 km long inlet naturally divided into two sections.", "start": 203.76, "duration": 9.6}, {"text": "The entrance to the inner part of the fjord was guarded by Oscarsborg,", "start": 213.64, "duration": 4.18}, {"text": "a 19th century coastal fortress with its main defensive facilities located on two small islets,", "start": 217.82, "duration": 6.4}, {"text": "and equipped with three Krupp-manufactured 28 cm coastal defense guns,", "start": 224.32, "duration": 5.18}, {"text": "which were, just like the entire fortress, well past their prime.", "start": 229.5, "duration": 4.7}, {"text": "A few supporting batteries armed with 15 cm and smaller caliber guns were situated nearby on the mainland.", "start": 234.62, "duration": 7.18}, {"text": "In addition, by 1940 Oscarsborg served primarily as a training facility and was only supplied with limited troops.", "start": 242.04, "duration": 8.96}, {"text": "In the night between the 8th and 9th of April, Oscarsborg’s commander,", "start": 251.42, "duration": 4.44}, {"text": "65-year-old colonel Birger Eriksen received an urgent message that an unidentified group of warships forced their way into the fjord,", "start": 255.86, "duration": 9.42}, {"text": "past the outer fortifications.", "start": 265.28, "duration": 2.26}, {"text": "He immediately ordered the raising of the alarm and the manning of the guns.", "start": 267.84, "duration": 4.26}, {"text": "Despite having three loaded artillery pieces at his disposal, he had barely enough trained men to crew two of them,", "start": 272.42, "duration": 7.46}, {"text": "as he had only received a few hundred fresh conscripts just seven days before.", "start": 279.88, "duration": 5.34}, {"text": "The night was calm and foggy, only occasionally lit up by beams cast by the searchlights.", "start": 285.74, "duration": 5.48}, {"text": "As time passed by painfully slow,", "start": 291.44, "duration": 2.16}, {"text": "the Norwegian crew patiently waited until enemy warships loomed out of the fog.", "start": 293.86, "duration": 5.2}, {"text": "At 4:20 in the morning, Norwegian searchlights picked up the silhouette of the first ship steaming towards them from a few kilometres away.", "start": 299.56, "duration": 8.24}, {"text": "It was the time for colonel Eriksen to decide whether to engage, or to let them through.", "start": 308.08, "duration": 5.24}, {"text": "It wasn’t an easy decision to make, as he could only guess at whether the invaders were British or German.", "start": 313.48, "duration": 6.82}, {"text": "He was well aware of Norway’s neutrality,", "start": 320.56, "duration": 2.44}, {"text": "but he also knew that the Norwegian government leaned towards joining the British side in the event of Norway becoming involved in the war.", "start": 323.0, "duration": 7.9}, {"text": "Enemy warships were drawing closer, past the 2 kilometer mark. Gunnery officers watched the old commander carefully.", "start": 331.34, "duration": 7.56}, {"text": "That was when colonel Eriksen, hesitating no longer, gave the order saying:", "start": 339.18, "duration": 5.28}, {"text": "”Either I will be decorated, or I will be court-martialed. Fire!”.", "start": 344.6, "duration": 4.88}, {"text": "The first high caliber gun roared, lighting up the surroundings for a brief moment.", "start": 349.78, "duration": 4.62}, {"text": "The high-explosive shell hit one of the masts crippling the main rangefinder and setting the midship on fire.", "start": 354.6, "duration": 7.02}, {"text": "Giving the enemy no time to react,", "start": 361.86, "duration": 2.08}, {"text": "the second gun thundered, striking near the aircraft hangar and igniting a second major fire.", "start": 364.02, "duration": 6.34}, {"text": "Though the defenders did not learn this straight away,", "start": 370.48, "duration": 2.94}, {"text": "the ship they had shelled was the Blücher , the German brand new Admiral Hipper class heavy cruiser,", "start": 373.52, "duration": 6.46}, {"text": "and the flagship of the taskforce dispatched to attack Oslo.", "start": 380.16, "duration": 4.14}, {"text": "The fires quickly spread on board the Blücher, detonating some of the infantry explosives she carried,", "start": 384.64, "duration": 5.76}, {"text": "while Norwegian mainland batteries scored additional  hits on the German heavy cruiser as she steamed forward.", "start": 390.46, "duration": 6.42}, {"text": "The second ship in the line, another heavy cruiser, the Lützow,", "start": 397.2, "duration": 3.84}, {"text": "was soon hit several times by Norwegian medium caliber artillery causing serious damage and forcing her,", "start": 401.18, "duration": 6.68}, {"text": "and the rest of the task force, to reverse their course and escape the fjord.", "start": 407.94, "duration": 4.94}, {"text": "Meanwhile the Blücher, with violent fires raging onboard,", "start": 413.24, "duration": 3.84}, {"text": "had already passed the main Norwegian battery and was just about to encounter another, unexpected disaster.", "start": 417.18, "duration": 7.38}, {"text": "The Germans were well informed regarding the Oscarsborg defensive instalations,", "start": 424.98, "duration": 4.48}, {"text": "but deemed them mostly harmless on account of the instalations being primarily used as a training facility.", "start": 429.62, "duration": 6.74}, {"text": "What the Germans weren’t aware of, however,", "start": 436.56, "duration": 2.18}, {"text": "was the underground torpedo battery, Oscarsborg’s secret weapon,", "start": 438.9, "duration": 4.26}, {"text": "equipped with forty-year-old Whitehead torpedoes of Austro-Hungarian manufacture.", "start": 443.32, "duration": 5.88}, {"text": "Though nobody was sure if this obsolete armament would work as intended,", "start": 449.5, "duration": 4.38}, {"text": "the retired commander of the battery, captain Anderssen, ordered that they be fired anyway.", "start": 454.06, "duration": 6.08}, {"text": "The first torpedo hit the bow section of the German cruiser, causing only some minor damage.", "start": 460.5, "duration": 5.26}, {"text": "But the aim of the second torpedo was better adjusted,", "start": 465.98, "duration": 3.06}, {"text": "and the projectile hit midship, roughly where one of the 28 cm shells had struck a couple of minutes earlier.", "start": 469.22, "duration": 7.2}, {"text": "The Blücher started to take water, causing her to list heavily to the port side.", "start": 476.8, "duration": 4.84}, {"text": "Firefighting teams struggled to contain the fire, and soon, flames reached the ship’s secondary ammunition magazines.", "start": 481.64, "duration": 6.94}, {"text": "Yet another violent explosion damaged the structure of the German cruiser.", "start": 488.58, "duration": 4.44}, {"text": "With no other choice, the task force commander onboard the Blücher gave the order to abandon the sinking ship.", "start": 493.08, "duration": 6.64}, {"text": "Three hours later, in the early morning of the 9th of April, the Blücher capsized and went down to the bottom of the Oslofjord,", "start": 499.88, "duration": 7.78}, {"text": "taking with her the bodies of between five hundred and a thousand sailors and invading troops.", "start": 507.82, "duration": 6.2}, {"text": "Despite the setback in Oslofjord, the German war machine continued to move forward against Norway.", "start": 514.56, "duration": 6.04}, {"text": "Oscarsborg was the subject of heavy bombing from the Luftwaffe later that day, forcing colonel Eriksen to eventually surrender the fortress.", "start": 520.8, "duration": 8.16}, {"text": "The invading troops landed further south, in considerable distance from the capital, but out of the range of Norwegian coastal defenses.", "start": 529.08, "duration": 8.14}, {"text": "The unexpected resistance mounted by the crew of the Oscarsborg fortress not only destroyed one of the bigger and newest warships of the Kriegsmarine,", "start": 537.68, "duration": 9.2}, {"text": "but crucially delayed the German invasion of Oslo by several precious hours,", "start": 546.88, "duration": 5.36}, {"text": "during which, with national gold reserve secured, the royal family and the Norwegian cabinet were able to escape north,", "start": 552.46, "duration": 7.56}, {"text": "where they could mount the defence of their homeland for the next two months.", "start": 560.02, "duration": 5.3}]