[{"text": "Oooh", "start": 0.18, "duration": 1.04}, {"text": "Ken: Ooh *wheeze*", "start": 1.3, "duration": 1.0}, {"text": "Both: Oooooh", "start": 2.82, "duration": 1.12}, {"text": "We are back baby Skyblock part 2, where's your monstrosity of a cobblestone generator?", "start": 4.08, "duration": 6.84}, {"text": "What happen' to it", "start": 10.92, "duration": 0.74}, {"text": "Well someone pushed you off wait, that was me. So now we have to restart", "start": 11.68, "duration": 5.64}, {"text": "We have to start over again! Noooo!", "start": 18.1, "duration": 2.32}, {"text": "How do we do it, I can't, we can't remake that.", "start": 20.5, "duration": 2.78}, {"text": "But this time we do it and we do it right Ken", "start": 23.3, "duration": 2.72}, {"text": "Look, I kept telling you last episode.", "start": 26.1, "duration": 2.04}, {"text": "NO YOU DON'T! *arguing*", "start": 28.14, "duration": 1.48}, {"text": "All you have to do look, break the ice, make the water flow", "start": 29.74, "duration": 4.52}, {"text": "We gotta go down see right here you broke the extra block no, it needs to be one in between you smacker. Yeah. Yeah. Yeah", "start": 34.96, "duration": 6.74}, {"text": "Wait, how do we do this?", "start": 42.42, "duration": 2.5}, {"text": "Perfect", "start": 54.19, "duration": 1.889}, {"text": "Yeah", "start": 56.079, "duration": 2.0}, {"text": "That took us 17 minutes last episode 17", "start": 58.21, "duration": 4.369}, {"text": "But don't forget that we said how to do it right the very start of the whole video it just took us 24", "start": 64.6, "duration": 4.94}, {"text": "I actually some some kids recognize me and they were like, where did you post your sky block? I'm like you want more of that", "start": 69.58, "duration": 7.039}, {"text": "I was like, do you have it like if so how to make a cobblestone generator and then they were like, I don't know", "start": 81.22, "duration": 5.419}, {"text": "I'm like, okay cool. No one actually. Nobody actually knows they just like", "start": 86.64, "duration": 3.9}, {"text": "Now now we make here you get one pickaxe - oh, yes", "start": 92.68, "duration": 4.279}, {"text": "Senpai, let's mine the freaked out of this", "start": 98.079, "duration": 2.93}, {"text": "Yeah, I don't know why I thought it would wake up with two of us. That makes enough", "start": 101.86, "duration": 3.799}, {"text": "Yeah", "start": 106.509, "duration": 2.0}, {"text": "Thank you for for me we're speedrunning this there you go alright", "start": 109.93, "duration": 4.43}, {"text": "Yeah, can she believe a Smee but here takes a kit?", "start": 114.36, "duration": 3.779}, {"text": "What what's wrong would have to invent new swear words because minecraft", "start": 118.96, "duration": 4.099}, {"text": "Well, you start using the word flip. What the flip?", "start": 124.149, "duration": 2.18}, {"text": "Can't dig the dirt, you know, that'd be bad. Okay don't like craps down to pick this up or something", "start": 127.569, "duration": 4.73}, {"text": "Oh my god, you're still back. I am. Okay. Well, I can't ever pick up stuff", "start": 132.97, "duration": 3.72}, {"text": "I won't burn myself a lot. You can get like the right spot. You know, this is", "start": 136.69, "duration": 3.119}, {"text": "Like an art okay wait, I'll do it. I'll do it because I think it's easier for me to grab them", "start": 140.69, "duration": 4.339}, {"text": "Yeah, I guess yeah the desync that's what I blame", "start": 145.25, "duration": 3.139}, {"text": "Anybody using the using the precious dirt to make a bridge right now. Are you serious? I need I need a baby", "start": 148.91, "duration": 5.929}, {"text": "Are you serious? I need", "start": 155.06, "duration": 2.0}, {"text": "You using the dirt right now. We need to get back to where we were", "start": 157.07, "duration": 3.769}, {"text": "When we get over there, we're gonna have to like make a farm or something. We I can't believe you right now", "start": 161.66, "duration": 5.089}, {"text": "Like am I crazy? But I think our cobblestone generator was actually better", "start": 167.27, "duration": 3.919}, {"text": "it was", "start": 172.55, "duration": 2.0}, {"text": "Weirdly enough you could actually catch it without it. You didn't have to worry about breaking your dirt or anything", "start": 174.62, "duration": 4.79}, {"text": "You just used to went to town. Yeah, I'll put the stuff in years. It's easier I could", "start": 179.41, "duration": 4.739}, {"text": "Never seen the memes they shouldn't there wasn't good news. I just thought however almost like this are you doing more like yet?", "start": 184.7, "duration": 6.889}, {"text": "All right, but we did it the good way. Yeah, but did you see ours though? How good it was?", "start": 191.59, "duration": 5.58}, {"text": "So what are we supposed to do next? It's like what we'll see Ken. We'll see okay", "start": 197.18, "duration": 4.67}, {"text": "Well me okay, cuz I'll see more blocks out here", "start": 201.88, "duration": 2.88}, {"text": "I mean technically we can make infinite blocks now, so there has to be some other mechanic to it, right? All right", "start": 204.76, "duration": 5.669}, {"text": "Well, I mean don't we just after we get the cobblestone you're pretty much this guy's survivor, right? It's gotta use what we have", "start": 210.43, "duration": 4.98}, {"text": "I don't know. What's the point of Skyblock really? We've already beaten it. I miss our cobblestone generator", "start": 215.41, "duration": 5.16}, {"text": "So much", "start": 221.12, "duration": 2.0}, {"text": "You can never recreate art", "start": 223.22, "duration": 2.0}, {"text": "That's a problem. All right, we're good bing-bing-bing-bing", "start": 226.28, "duration": 4.01}, {"text": "Whoa, I know how you and bridges are don't start with something else. Geez. Hey, hey stop stop right there criminal", "start": 232.07, "duration": 6.529}, {"text": "Criminal scum no screaming bong Bing you got to do the that one. Okay, cool", "start": 239.18, "duration": 6.08}, {"text": "We made it. I put bucket there wait, so we have obsidian. That means we have to go to the nether realm next eventually", "start": 245.47, "duration": 6.029}, {"text": "Yeah, that's oh", "start": 251.5, "duration": 1.57}, {"text": "That's awesome. There's a whole lesson, right?", "start": 253.07, "duration": 2.599}, {"text": "Okay, so that means we need flint and steel", "start": 259.95, "duration": 2.51}, {"text": "What are we get? How are we gonna get Wow look first off", "start": 263.1, "duration": 5.0}, {"text": "How are we gonna survive, but I need to eat something eventually. I'm gonna die eat me. Oh,", "start": 268.17, "duration": 5.089}, {"text": "Well, we have character we have a character so we can make a cactus spawn", "start": 275.46, "duration": 3.019}, {"text": "Hey Oh, actually we have melon we can make melon spawn", "start": 278.58, "duration": 2.57}, {"text": "Oh, so now it's going to go grab like all the dirt from over there, right?", "start": 281.15, "duration": 2.969}, {"text": "Okay, so I have melon melon and then I plant Madeline but then I have to make it. Oh my god, this is awesome", "start": 284.22, "duration": 6.589}, {"text": "We need to like dig up all the dirt right in like an hour. I really shouldn't have wasted all the way", "start": 291.2, "duration": 4.739}, {"text": "Not only would we ask okay", "start": 296.88, "duration": 2.179}, {"text": "Give me one I got one. I got one. It's gonna live right here kid. See we", "start": 307.95, "duration": 5.54}, {"text": "Can we use the one water that we have to make like a infinite water pool?", "start": 314.16, "duration": 3.17}, {"text": "Are you able to do that out of just one block of water? No you need for you", "start": 317.33, "duration": 4.289}, {"text": "can I make make like like", "start": 321.62, "duration": 1.59}, {"text": "I don't know like two spots and like put it down and pick it up and put it down the other spot real quick", "start": 323.21, "duration": 3.599}, {"text": "No, you can't man sucks. So does your you and your no, sorry. Okay be rude", "start": 326.81, "duration": 6.3}, {"text": "how do I make I", "start": 333.33, "duration": 2.0}, {"text": "Got it. Somehow I got it. Okay, cool. I don't know why I made it in stone. What a waste. Okay, so but", "start": 335.91, "duration": 5.75}, {"text": "I'm gonna say is we got this whole block here. There's like three down of dads", "start": 342.51, "duration": 3.83}, {"text": "Okay, so now we plan to Medellin", "start": 351.57, "duration": 2.0}, {"text": "Anyway, well just say yes spread this dirty out here, right? Oh wait, this is not a melon gross", "start": 354.12, "duration": 5.15}, {"text": "Dang it. Were you waiting to me? Well", "start": 359.55, "duration": 2.359}, {"text": "We have all this dirt beneath us, we're not using we need to spread all this out, right?", "start": 363.78, "duration": 3.56}, {"text": "So you're like dig down and get it all damn your big brain. Okay, because I have to say before you hear me. I", "start": 367.34, "duration": 5.279}, {"text": "am spread out spread a", "start": 373.92, "duration": 2.0}, {"text": "Problem", "start": 377.52, "duration": 2.0}, {"text": "I have an idea we should spread out as much as possible", "start": 382.77, "duration": 2.929}, {"text": "Oh, good thinking. Yeah. Yeah. So how deep this is go three. There's a", "start": 386.39, "duration": 5.279}, {"text": "Mmmm, I don't know how we get the very bottom pieces though without them falling off maybe", "start": 392.22, "duration": 4.13}, {"text": "Do everything. It's getting bigger. I like it. Yeah. Yeah, I like what he gets bigger. Wait. I can't we're playing minecraft", "start": 397.5, "duration": 7.699}, {"text": "minecraft sake ah", "start": 406.38, "duration": 2.0}, {"text": "Just play", "start": 409.62, "duration": 2.0}, {"text": "We need to pick the lava back up so we can dig around and I don't know is the answer", "start": 413.01, "duration": 3.439}, {"text": "When will you have to use our big brains magnet then do we have to like, oh dang it. I lost one", "start": 416.82, "duration": 5.69}, {"text": "Sorry, I'm sorry", "start": 423.9, "duration": 2.0}, {"text": "I'm sorry", "start": 426.6, "duration": 1.1}, {"text": "Oh my goodness your mom. Okay, we're gonna it's over playthrough over. No", "start": 427.7, "duration": 3.779}, {"text": "I'm worried about more trees. Don't worry. I got you more tree. Yeah", "start": 432.06, "duration": 2.959}, {"text": "You know if we started planting trees, then we would actually have like epic trees right now", "start": 436.32, "duration": 4.609}, {"text": "but no do we want to let me such a pain to get enough cobblestone and go under this so we don't drop any and", "start": 440.93, "duration": 6.119}, {"text": "Make the most of our space that we have. Yeah, we are moving everything from the bottom up", "start": 447.389, "duration": 4.399}, {"text": "We just move everything from the top down so that way we don't worry about the bottom blocks falling into the void now", "start": 451.789, "duration": 4.32}, {"text": "That's a bigger brain. Yeah", "start": 456.11, "duration": 2.0}, {"text": "I", "start": 458.58, "duration": 2.0}, {"text": "Think it's too late for that now though. We should know that before a cobblestone generator will work out with it", "start": 461.4, "duration": 5.63}, {"text": "What if we make cobblestones? Well, we still need turn the darkness for the farming if we make cobblestone", "start": 467.03, "duration": 5.19}, {"text": "I don't have a pick anymore since that not me off", "start": 472.22, "duration": 2.0}, {"text": "Oh, oh", "start": 475.56, "duration": 2.0}, {"text": "The water Oh garsh. I think we have some good space. Yeah last night. We party started perfect or anything gamers, but", "start": 478.169, "duration": 7.4}, {"text": "Do it pro gameplay. Wait retching how the Frick did we get flint and steel. Ah,", "start": 486.33, "duration": 6.8}, {"text": "I see a question big brain big", "start": 494.28, "duration": 2.6}, {"text": "Yeah", "start": 497.25, "duration": 0.539}, {"text": "We use the lava to open the nether or maybe it's like in the if I go dig through the sand blue", "start": 497.789, "duration": 5.48}, {"text": "I already have obsidian. So I", "start": 503.27, "duration": 2.1}, {"text": "Don't know. Oh, yeah, maybe there's something in the sand. That's a good idea. Yeah big brain. I need more trees. Come on. I appreciate", "start": 506.039, "duration": 7.01}, {"text": "Yeah", "start": 517.209, "duration": 2.0}, {"text": "I've dug down and then", "start": 519.729, "duration": 2.0}, {"text": "bid 100", "start": 522.039, "duration": 2.0}, {"text": "You find anything don't look out there. What what happened? Oh you see the island at all", "start": 524.26, "duration": 6.829}, {"text": "Okay, okay, this is another test 11 the chest is still there we don't need to win well, what about our cactus", "start": 538.48, "duration": 5.72}, {"text": "Okay, don't touch the sand because it'll all fall for some reason I'm concede really okay give me the pumpkin Hey", "start": 547.69, "duration": 7.969}, {"text": "Yeah, just grab it do we need the sand though? I don't know", "start": 556.69, "duration": 3.229}, {"text": "I'm sorry. I didn't know you freaked up and I never forgive Africa fer. I", "start": 565.329, "duration": 5.24}, {"text": "Just realize we can't actually probably build", "start": 572.47, "duration": 2.059}, {"text": "Downwards like you said, look, I'm doing it. I'm doing it. Can you grab my block? Give it back?", "start": 575.2, "duration": 4.669}, {"text": "I'll call the cops my bad. Sorry, I'm sorry. I'm sorry. Sorry", "start": 580.269, "duration": 4.19}, {"text": "My best forgive is not an excuse", "start": 585.13, "duration": 2.359}, {"text": "I'll yell as many times as I want", "start": 590.2, "duration": 2.0}, {"text": "All right. Okay. We are maximizing our efforts", "start": 593.23, "duration": 3.53}, {"text": "yeah, I'd be careful this block right here if you want to get unless you want to get a", "start": 596.92, "duration": 2.72}, {"text": "Lavage to pick the lava back up something get the. Mm-hmm. Then we can't put it under there. We have to leave these here", "start": 600.52, "duration": 5.239}, {"text": "Leave those little fritters. Ah", "start": 606.579, "duration": 2.0}, {"text": "I mean I made up see I just I tell you this", "start": 609.82, "duration": 3.5}, {"text": "We're really gonna cure", "start": 616.24, "duration": 2.0}, {"text": "Like we're just focused on you know, just doing the stuff", "start": 619.81, "duration": 3.08}, {"text": "That's so much on what we're actually saying to each other. Uh", "start": 623.8, "duration": 3.289}, {"text": "So if I if I pull this one out, it'll make the water go everywhere", "start": 627.88, "duration": 3.44}, {"text": "I'm just I'm just worried that we're gonna need that stand for something", "start": 631.68, "duration": 3.149}, {"text": "How do we get the yeah, well, you should have thought about that before you find it", "start": 634.87, "duration": 4.039}, {"text": "It was gonna fall because I took two boxes Sam. I didn't I didn't think this island was gonna fall listen to yourself", "start": 638.91, "duration": 7.65}, {"text": "Who thinks the hallways gonna fall everyone who knows minecraft?", "start": 647.23, "duration": 4.13}, {"text": "Oh, just like I just like I try to tell you how to make a cobblestone", "start": 651.36, "duration": 4.05}, {"text": "cobblestone", "start": 656.17, "duration": 1.2}, {"text": "Whatever generator for three years. No one listens. Oh, here we are. Oh my god. I can't believe you", "start": 657.37, "duration": 7.64}, {"text": "You tried to kill me", "start": 678.13, "duration": 2.0}, {"text": "I guess if you get hungry just follow from da Oh", "start": 682.33, "duration": 2.809}, {"text": "Ever need to make melons. You're making the water go everywhere. Look at you. That's what she said", "start": 685.75, "duration": 5.179}, {"text": "Why would you say that? I don't know why this tree not grow", "start": 691.57, "duration": 4.01}, {"text": "Why does the grass not come Bank? Oh", "start": 697.54, "duration": 2.12}, {"text": "God I feel the Commons can they're coming back", "start": 701.95, "duration": 2.839}, {"text": "I think I can feel people typing right now. No. Oh", "start": 706.33, "duration": 4.399}, {"text": "Do you have your pickaxe still I think I put it here. Okay great. Threw me off the edge", "start": 714.37, "duration": 4.07}, {"text": "I don't have anything and then yeah, we'll get some more sticks here. Oh dude, if we put it here it actually work", "start": 718.44, "duration": 5.609}, {"text": "No, no, it doesn't work at all. Can your homies get some more saplings?", "start": 724.08, "duration": 4.349}, {"text": "But why hey I called a block good meat didn't get me", "start": 728.7, "duration": 3.75}, {"text": "me", "start": 733.42, "duration": 2.0}, {"text": "Me so good play Minecraft use me small me make", "start": 736.69, "duration": 5.96}, {"text": "Sand off all whoo. Whoo, did you get any more trees? No", "start": 745.54, "duration": 4.16}, {"text": "We actually just have one dream one tree. It's that's is it grow?", "start": 750.55, "duration": 4.4}, {"text": "Gotta pray that this one actually gives us more we're gonna rat tree real fast. Oh my god. I'm so confused. What is happening?", "start": 755.5, "duration": 6.169}, {"text": "I don't know. This should be turning", "start": 761.67, "duration": 2.0}, {"text": "This should be turning epic. You got a hoe it did you know it? Okay plant pumpkin here", "start": 764.11, "duration": 5.3}, {"text": "In the middle", "start": 771.58, "duration": 2.0}, {"text": "Okay. Oh, I'm king Megara. I had more than just that one", "start": 773.68, "duration": 3.44}, {"text": "Now that's all we had but a will grow don't worry. It's the next that we go like in another. All right. Ah,", "start": 778.0, "duration": 5.389}, {"text": "Don't further. No, I don't see I don't see anything. What are you sand for you can make glass with sin", "start": 783.969, "duration": 6.559}, {"text": "Well, yeah, we need glass. Maybe I just okay. I'm not here. What is your big brain? Tell you can my big brain", "start": 790.779, "duration": 6.2}, {"text": "Tells me let's see. I", "start": 797.529, "duration": 2.0}, {"text": "Hope not really usage we can make it a TNT", "start": 807.729, "duration": 3.47}, {"text": "gunpowder", "start": 812.049, "duration": 1.11}, {"text": "Sandstone glass look at our beautiful building my god no-one's ever progress this hard a falling block again", "start": 813.159, "duration": 7.04}, {"text": "I don't think it matters. You hear that gamers", "start": 820.199, "duration": 2.219}, {"text": "Ken thinks the sand doesn't matter Oh soon as you got a big youtube", "start": 822.549, "duration": 4.309}, {"text": "Please go ahead and throw this off on me because when it does matter BIC", "start": 826.859, "duration": 3.0}, {"text": "Shut up, you stop it. Alright now we progress because I'm I don't know what else good this point", "start": 830.919, "duration": 5.869}, {"text": "Oh, maybe we can lit the oh, I got it. I got it. I got it Ken big brain", "start": 836.789, "duration": 4.559}, {"text": "Don't don't look up anything big brain big brain. Alright, I got it. I got it. Lava the lava would lit dead portal", "start": 841.349, "duration": 5.94}, {"text": "Let me let me just stop you right there", "start": 847.289, "duration": 1.66}, {"text": "Yeah, we're on to about 15 minutes ago and I say hey do we gotta use the lava?", "start": 848.949, "duration": 4.64}, {"text": "Well do it", "start": 855.609, "duration": 2.0}, {"text": "Where do we build the portal vein? Ah?", "start": 858.849, "duration": 2.0}, {"text": "Here. Well can ya we could be we we got play a cobblestone. We can do it anywhere right? We don't use cobblestone", "start": 861.579, "duration": 4.909}, {"text": "wob", "start": 867.129, "duration": 1.29}, {"text": "Between how much does it take you get tin, but wait, do we do you think cuz oh god my brain my big brain", "start": 868.419, "duration": 6.799}, {"text": "Okay, fine. Okay, we put it here. The only reason I'm hesitant is because you're supposed to be the minecraft pro I am", "start": 875.259, "duration": 7.13}, {"text": "Thanks, bro. You think I'm pro? I mean, you played a lot more than I have lately. That's for damn. Sure", "start": 882.939, "duration": 4.459}, {"text": "No, no. No, I play very this is gonna be a portal", "start": 887.799, "duration": 4.849}, {"text": "I'm saving us money Ken. I couldn't possibly understand if I got you. Yeah, yeah", "start": 892.769, "duration": 4.799}, {"text": "Bro, that's right. I am yeah, wait how many blocks you got left?", "start": 899.559, "duration": 4.25}, {"text": "Frick yeah only cowards build obsidians with rui", "start": 905.07, "duration": 3.469}, {"text": "Hurry, okay, so you only like pickup the LOB and like throw it over there in there or something", "start": 909.12, "duration": 3.89}, {"text": "Yeah, we're gonna we're gonna make the love of throw out over there", "start": 913.11, "duration": 3.14}, {"text": "Okay, I will be the lava boy you I was just gonna say you are the designated lover boy. Oh", "start": 916.25, "duration": 5.609}, {"text": "I'm glad you had that idea. I'm so excited. Okay, it's lava time. Damn. I'm so smart for thinking about that", "start": 922.62, "duration": 5.51}, {"text": "We should use the lava. Yeah, you're like just a genius and it's that part out where I said it", "start": 928.13, "duration": 4.049}, {"text": "Where do I just throw it in here? Yeah. Yeah. Yeah", "start": 933.45, "duration": 2.839}, {"text": "Don't drop the bucket I", "start": 938.46, "duration": 2.0}, {"text": "Just I just I", "start": 945.15, "duration": 2.0}, {"text": "All right attempt to attempt to what a great that day you had", "start": 951.63, "duration": 4.28}, {"text": "Okay, maybe needs to flow from a higher spot like this", "start": 956.19, "duration": 3.89}, {"text": "Pumpkin the pumpkin the pumpkin shave the pumpkin. Oh", "start": 964.59, "duration": 4.699}, {"text": "It's so tiny did you know you put it work did he work? Oh it worked look. Yeah, you can go go cuz I", "start": 970.92, "duration": 7.369}, {"text": "Okay epic time enjoy. What is this? Do we make a different block?", "start": 979.35, "duration": 3.71}, {"text": "How do we lit the portal? This is hot. This surely has to be how the forefathers did it of Minecraft", "start": 984.42, "duration": 6.32}, {"text": "I got it you drop it here", "start": 990.74, "duration": 2.0}, {"text": "What the Frick how are you doing", "start": 996.21, "duration": 1.98}, {"text": "We can't even get the tree to grow we can't get the tree to grow we can't get the portal open the sand", "start": 998.19, "duration": 6.47}, {"text": "Thing out there fell Oh", "start": 1005.0, "duration": 2.0}, {"text": "our pumpkins", "start": 1007.31, "duration": 1.98}, {"text": "watered wait", "start": 1009.29, "duration": 1.89}, {"text": "It's not getting hydrated here. Is it hard rain in the can't tell I don't think it is", "start": 1011.18, "duration": 4.489}, {"text": "I think this game is buggy, and I don't like it anymore", "start": 1015.67, "duration": 3.36}, {"text": "This do you think you need the cactus or something?", "start": 1019.76, "duration": 2.809}, {"text": "What the heck we'll use a cactus. I'll ever talk back about cactus", "start": 1023.24, "duration": 5.599}, {"text": "alright", "start": 1030.339, "duration": 2.0}, {"text": "Wait, I actually haven't good stuff. Well now I can die", "start": 1032.56, "duration": 3.649}, {"text": "When you forget to write your last will if you if you look up Skyblock, there's like a list of challenges", "start": 1042.88, "duration": 5.27}, {"text": "It's like stuff to do like stuff to challenge yourself to do because this cow block is literally just you know", "start": 1048.15, "duration": 5.28}, {"text": "The two blocks that's it. Everything else is just gonna make it on your own right? So there's no more islands", "start": 1053.43, "duration": 4.5}, {"text": "I don't think so. I think that's it", "start": 1057.93, "duration": 2.189}, {"text": "They just get too and then they're like, good luck", "start": 1060.25, "duration": 2.15}, {"text": "If you get to the second island so you can get food and actually survive then you spread the dirt out and then from there", "start": 1062.41, "duration": 4.88}, {"text": "You're just like you're just surviving until you can go to the nether and do whatever in there", "start": 1067.29, "duration": 3.359}, {"text": "But how would you go to the nether? I don't know. That's I don't know how you do it", "start": 1070.65, "duration": 3.51}, {"text": "Oh, I got it Oh big brain big brain big brain. Oh my god big brain big brain. I'm so excited about that", "start": 1074.19, "duration": 7.35}, {"text": "Oh, you're gonna burn the wood. Yeah. Yeah. Yeah. Oh", "start": 1081.54, "duration": 3.449}, {"text": "Wow, that is huge brain. How did your brain get so big?", "start": 1085.72, "duration": 3.349}, {"text": "Minecraft what?", "start": 1090.88, "duration": 2.0}, {"text": "Pop rock five right brain food. Are you are you eating the big brain food? Thank you", "start": 1094.6, "duration": 5.06}, {"text": "Are you eating the G fuel straight up and ready there actually do you feel?", "start": 1099.69, "duration": 3.09}, {"text": "Alright great. Let's do it. I'm doing ready. I'm going lit. How do I lit it then without it like just disappearing", "start": 1107.02, "duration": 5.419}, {"text": "Uh, I mean, yeah, but it was a mob but, you know, just put it next to it little love tap and it work", "start": 1112.44, "duration": 6.63}, {"text": "It's just I do not. Is this wood way. I think you have to wait for like a", "start": 1119.41, "duration": 4.279}, {"text": "Lava flip to hit the thing. Really? Yeah big brain, I guess one. Nope. Oh, it's flipping. Yeah. Yeah, it's get away", "start": 1124.3, "duration": 7.459}, {"text": "Nothing's working the seeds grow", "start": 1132.88, "duration": 2.0}, {"text": "grow grow", "start": 1135.61, "duration": 2.0}, {"text": "Do we have to like, but nothing's happening", "start": 1139.15, "duration": 4.309}, {"text": "What you read or something no", "start": 1145.24, "duration": 3.589}, {"text": "Sides can't explain this I think we need a different method. Yeah, I think it's gonna work, right?", "start": 1150.31, "duration": 4.88}, {"text": "Okay, I needs to go like like the lava needs to like go", "start": 1155.41, "duration": 4.699}, {"text": "What are you doing? What is this? Like it needs to go", "start": 1160.93, "duration": 3.439}, {"text": "Help me my brain", "start": 1165.4, "duration": 2.0}, {"text": "I want to alarm you eating what melon grew melons gone. No, what did you do?", "start": 1175.72, "duration": 7.07}, {"text": "Well, I definitely didn't do that and look down and it was gone", "start": 1184.24, "duration": 3.349}, {"text": "Your big brains of the next level right I have no idea what's going on", "start": 1202.78, "duration": 2.809}, {"text": "Are you just trying to get this small brains? Don't talk to big brains. Oh", "start": 1205.59, "duration": 3.75}, {"text": "Dang it", "start": 1210.13, "duration": 1.68}, {"text": "amazing", "start": 1211.81, "duration": 1.2}, {"text": "This is a good idea though", "start": 1213.01, "duration": 2.0}, {"text": "10 just watch I am I'm watching. Let's see it. I mean at this point, we're pretty much gonna die", "start": 1215.11, "duration": 6.26}, {"text": "Yeah, I can no don't speak like that. We ice. Keep turning back in the ice", "start": 1221.62, "duration": 6.17}, {"text": "It's not water anymore. What is happening? Alright, we have a problem Kim. It's a really big problem. Yeah, okay", "start": 1227.79, "duration": 5.969}, {"text": "I'll try and explain it for a small brain. Okay, okay play a week", "start": 1233.76, "duration": 3.089}, {"text": "The Lama needs to flow on this level. We built that I built him sitting him too too far down", "start": 1237.79, "duration": 6.14}, {"text": "So we need to lower everything", "start": 1243.97, "duration": 2.0}, {"text": "And the only way to do that is if I jump off and I place the block while falling big brain", "start": 1247.51, "duration": 7.01}, {"text": "Why don't we just like make some water go over the edge lights?", "start": 1254.77, "duration": 2.63}, {"text": "freakin", "start": 1258.13, "duration": 2.0}, {"text": "I heard that one big brain. Yeah. Oh", "start": 1267.73, "duration": 5.58}, {"text": "So big very nice. Very nice", "start": 1276.11, "duration": 2.0}, {"text": "Okay. All right. There's hope in the world. Okay. So now the Louisville will flow here the", "start": 1279.17, "duration": 5.15}, {"text": "Thing will be here. It will be burning Oh", "start": 1284.9, "duration": 2.54}, {"text": "A big where's the llama?", "start": 1288.02, "duration": 2.239}, {"text": "What where's the llama you had it?", "start": 1291.26, "duration": 2.359}, {"text": "Off the edge of the lobbyists game so no that big brain wait don't burn me alive", "start": 1297.26, "duration": 5.27}, {"text": "What", "start": 1305.81, "duration": 2.0}, {"text": "What is today's", "start": 1312.71, "duration": 2.0}, {"text": "We have to start over it", "start": 1315.89, "duration": 2.0}, {"text": "Because we're just running ahead of everything. Are you kidding me? You need to", "start": 1318.59, "duration": 3.739}, {"text": "Do you need to move the lava? I don't know is it's flowing", "start": 1322.88, "duration": 2.63}, {"text": "How do you do it, why is it flowing", "start": 1327.53, "duration": 2.359}, {"text": "It is flowing underneath how the Frick is it's not burning its magic wood", "start": 1329.89, "duration": 4.05}, {"text": "If if you just throw the LOB on top of the wood, will it work or will it just disappear burn?", "start": 1333.94, "duration": 4.65}, {"text": "What is this wood made out of?", "start": 1339.71, "duration": 2.0}, {"text": "Huh big break", "start": 1344.03, "duration": 3.05}, {"text": "Okay, big brain", "start": 1350.93, "duration": 1.8}, {"text": "Though the bucket down or something before you die with it. I", "start": 1352.73, "duration": 3.17}, {"text": "Have a big brain right now. Yeah", "start": 1356.96, "duration": 2.0}, {"text": "I'm gonna finish to eat", "start": 1359.54, "duration": 2.0}, {"text": "More lava means more flipper dippers right you go. Try me more lava more lava, we may use it here", "start": 1362.57, "duration": 5.869}, {"text": "We should probably protect little tree. I mean we already lost melon", "start": 1368.47, "duration": 3.78}, {"text": "Oh, sorry, okay. Well eventually something should catch on fire, right? Yeah. This is this is big", "start": 1379.34, "duration": 6.949}, {"text": "Oh, I see it. Oh that was close. Well place more wood so that it's more likely to catch on fire, right?", "start": 1386.29, "duration": 6.089}, {"text": "Are you okay? Yeah, I'm fine. Okay, so ice I put the random and then once they're on fire", "start": 1393.5, "duration": 6.71}, {"text": "We'll connect them Christian mark everything", "start": 1400.21, "duration": 2.639}, {"text": "my big brain tells me is that kind of like what you did like dig the two out and then just put", "start": 1402.85, "duration": 3.75}, {"text": "Would over the top of it and then just wait Ritz. I like flip up and hit it burn. That makes sense. Mm-hmm", "start": 1406.72, "duration": 5.489}, {"text": "Like where I am w habla and then the blocks directly above it the wood. Oh", "start": 1412.88, "duration": 3.86}, {"text": "That hit it on it are you kidding me? I'm just burning they look like I'm burning to you", "start": 1419.15, "duration": 4.46}, {"text": "Okay, I have a new idea. I don't feel so good. I have a big brain. It--", "start": 1423.74, "duration": 3.829}, {"text": "Okay, cuz go in the would go on the would", "start": 1428.51, "duration": 2.0}, {"text": "Gonna get you're fine go jump on the wood bird birds my body Oh,", "start": 1436.79, "duration": 4.219}, {"text": "Sad just burn but you are burning white. Haha. Okay new idea we burn tree that's", "start": 1441.95, "duration": 7.069}, {"text": "Crazy, why does tree not grow we did bone meal for tree?", "start": 1449.78, "duration": 3.53}, {"text": "I guess", "start": 1453.31, "duration": 0.37}, {"text": "You know we could get bone meal if we actually had like enough surface area to her bad gas bond that we could like", "start": 1453.68, "duration": 4.369}, {"text": "The bad guys dropped for it. Oh my god. I have a big brain idea boy", "start": 1458.93, "duration": 4.04}, {"text": "Bad guys can only spawn when there is no when there's light darkness so we should make a platform over there", "start": 1465.74, "duration": 7.219}, {"text": "And cover it with from light so get brain. So they oh my god big brain. Let's do it. Yeah", "start": 1473.66, "duration": 6.38}, {"text": "Yeah, that's big brain. Thinking big brain. Third good I have the water here. So we need to make a cobblestone generator", "start": 1480.04, "duration": 7.56}, {"text": "My god, yeah", "start": 1488.3, "duration": 2.0}, {"text": "You see how big this lavas right now. We can make all the cobblestone. Oh", "start": 1491.0, "duration": 3.41}, {"text": "It works yeah, nice perfect right there. That's the sweet spot Betty's back baby baby's back", "start": 1501.92, "duration": 5.93}, {"text": "If you like get down here in the water and catch it all. Oh my god, this is", "start": 1508.4, "duration": 4.16}, {"text": "Great eventually, we're gonna run out of tools a big rain", "start": 1520.91, "duration": 3.469}, {"text": "It will catch on fire when we're not looking it's like milk it only burns when you're not looking", "start": 1528.02, "duration": 4.97}, {"text": "What what did you say to me?", "start": 1533.24, "duration": 2.0}, {"text": "I can't wait for all the Minecraft kids with small brains to tell us what we're doing wrong. Yeah small brain", "start": 1539.14, "duration": 6.63}, {"text": "It's gonna be something like, you know, you got to put the lava this way to make it burn or something. Wait. Why?", "start": 1545.77, "duration": 4.949}, {"text": "I don't know like water and lava are just weird. Okay?", "start": 1550.72, "duration": 2.31}, {"text": "Nobody understands how they work like magnets except big brain people", "start": 1553.58, "duration": 3.5}, {"text": "Under this", "start": 1560.15, "duration": 2.0}, {"text": "Jump in the water. Don't lose all the cobblestone. Please. Put it down. Nobody there. What are you doing?", "start": 1562.19, "duration": 5.48}, {"text": "Well, what else don't muscle to put it down it you'll be a jump off and like do it magical", "start": 1567.67, "duration": 4.379}, {"text": "Anyway, I just down here so we can start like building downward because you know", "start": 1574.37, "duration": 3.65}, {"text": "Kenta what? We just need to kill them. They", "start": 1579.5, "duration": 3.049}, {"text": "Spawn first. Yeah, but monsters can't spawn their BIOS. The point was that we build it on the other side", "start": 1583.669, "duration": 4.76}, {"text": "You know how I supposed to build it under?", "start": 1588.429, "duration": 2.0}, {"text": "Build that only island built like a if it needs to be a 5 by 5 squared", "start": 1595.52, "duration": 4.609}, {"text": "I know here's them on the island. The other Island. No, I was not there. It doesn't exist", "start": 1600.13, "duration": 5.339}, {"text": "We'll make one. I just need 10 blocks", "start": 1605.71, "duration": 3.03}, {"text": "Give me a block so I can start jumping off and making it, you know, or you know", "start": 1608.96, "duration": 3.32}, {"text": "It can it's becoming more and more clear", "start": 1612.28, "duration": 2.459}, {"text": "Throughout this playthrough that you're not actually big brain. Are you serious? Are you are you are you serious right now? I'll say it", "start": 1615.26, "duration": 6.589}, {"text": "I'll say it then I'll say oh, we need 50 cobblestone my brain just made out. That's quick math exit", "start": 1621.85, "duration": 5.52}, {"text": "My brain is pretty small cuttings build up. Yeah, I'm an idiot", "start": 1627.37, "duration": 2.28}, {"text": "The whole time like I need to build down I have to build down but don't talk to me. Okay be great", "start": 1631.13, "duration": 5.27}, {"text": "Okay, we need safety", "start": 1636.679, "duration": 1.801}, {"text": "Table stones dude, and we're running out of pickaxes", "start": 1638.48, "duration": 2.9}, {"text": "No", "start": 1642.95, "duration": 2.0}, {"text": "All you have to do run through the lava and and hit their water but you picked the water up oh wait", "start": 1649.46, "duration": 5.959}, {"text": "No, you put it back down didn't I can see? Yeah", "start": 1655.419, "duration": 2.0}, {"text": "Big brain candy to build me a bridge because I can't lose the bucket. Can I build you a bridge? He says Jesus Christ", "start": 1660.23, "duration": 7.38}, {"text": "You jump to that. Thanks, babe. We do the water just so we can make blocks quicker over there", "start": 1668.49, "duration": 5.329}, {"text": "yeah, the colorful generator moving the cobblestone generator is", "start": 1674.03, "duration": 4.17}, {"text": "mobile", "start": 1679.17, "duration": 2.0}, {"text": "God", "start": 1685.35, "duration": 1.23}, {"text": "Tree doesn't grow because maybe you're treating tree like garbage. I love tree. I love I want to see this generator. You're gonna make", "start": 1686.58, "duration": 7.219}, {"text": "Don't mess up our one block of water cuz I get back I wall run Ken. Oh", "start": 1695.76, "duration": 5.659}, {"text": "Stop it before it's too strong you get more lava. Oh, no you Pig you live again?", "start": 1706.77, "duration": 3.739}, {"text": "You want some dude? Look how much we made. Oh", "start": 1711.59, "duration": 2.16}, {"text": "No, no, wait, wait. Wait, it's the", "start": 1714.39, "duration": 2.239}, {"text": "Water", "start": 1720.03, "duration": 2.0}, {"text": "It's all we have now, I don't think you even have that long run Oh", "start": 1739.77, "duration": 5.149}, {"text": "Tree will never grow. This is sky blog. It's the best", "start": 1750.06, "duration": 4.58}, {"text": "Pro-gamers here. She oniy how it's done. Yeah, let's just read there. It's no problem. Oh", "start": 1755.97, "duration": 4.309}, {"text": "Yeah, dare dare, we come back in the future to try to finish this smash like if you wanna stay", "start": 1761.28, "duration": 6.32}, {"text": "for more big brains", "start": 1768.87, "duration": 2.0}, {"text": "Smash like if you have a big brain, then we'll see you next time. Oh, please god. No", "start": 1772.74, "duration": 5.179}, {"text": "What you never played super simulator", "start": 1778.86, "duration": 3.049}, {"text": "You know, it's fun right? I'm not supposed to give my opinion", "start": 1783.399, "duration": 4.16}, {"text": "But give it a try and then you can tell me if it's good or not not convinced yet. Okay", "start": 1788.499, "duration": 6.23}, {"text": "I'll cut you a deal the game is available for free and that's a great price", "start": 1795.039, "duration": 5.54}]