[{"text": "If you picked up a videogame at random, chances are the main character will be a gruff older man who's really good at killing things.", "start": 2.62, "duration": 6.74}, {"text": "But increasingly, chances are they'll be a gruff older man", "start": 11.469, "duration": 3.11}, {"text": "who's really good at killing things and is also a father.", "start": 14.58, "duration": 3.54}, {"text": "Whether it's BioShock Infinite, God of War, Heavy Rain, Red Dead Redemption,", "start": 18.12, "duration": 4.439}, {"text": "Dishonored, Grand Theft Auto 5, The Walking Dead, Witcher 3 Wild Hunt or the Last of Us, video games have become", "start": 23.289, "duration": 6.47}, {"text": "obsessed with the idea of fatherhood. In a 2010 Kotaku article, Stephen Totilo  dubbed this phenomenon the daddening of", "start": 30.25, "duration": 7.34}, {"text": "videogames. \"Where is all this dad stuff coming from?\" he asks.", "start": 37.809, "duration": 3.47}, {"text": "\"Is it the aging of gamers and the developers who make games?\" Perhaps. Today", "start": 41.28, "duration": 4.319}, {"text": "the average age of a gamer is not 13, but 31. And Neil Druckmann,", "start": 45.6, "duration": 3.63}, {"text": "the creative director of The Last of Us, has talked about how becoming a father", "start": 49.23, "duration": 3.599}, {"text": "influenced the design of the game. But more important than why it's happening is the revolutionary effect", "start": 53.199, "duration": 5.12}, {"text": "it can have on video game storytelling. When Totilo wrote that article in 2010,", "start": 58.32, "duration": 5.099}, {"text": "he said that the games taught him that being a father is mostly about caring for someone who is fairly helpless.", "start": 63.42, "duration": 6.059}, {"text": "But many games have come out since then where that isn't really the case, where the child character isn't", "start": 69.479, "duration": 5.459}, {"text": "helpless and the stories are about the parents reacting to that. The results are games that rethink how to portray fatherhood and by extension...", "start": 75.22, "duration": 7.669}, {"text": "masculinity. Today I want to look at two of the most", "start": 83.439, "duration": 2.39}, {"text": "significant and revolutionary games in this canon: The Last of Us and The Witcher 3 Wild Hunt. Why those two games", "start": 86.11, "duration": 6.409}, {"text": "specifically? Well, because in many ways they're in conversation with one another. Both feature a grizzled violent male", "start": 92.619, "duration": 6.2}, {"text": "protagonist who can also be caring and responsible.", "start": 99.1, "duration": 2.51}, {"text": "Both are about this character's", "start": 101.799, "duration": 1.771}, {"text": "relationship with a surrogate daughter who is special in some way and has been sheltered all her life and most importantly both have nearly the", "start": 103.57, "duration": 7.069}, {"text": "exact same ending.", "start": 110.71, "duration": 2.089}, {"text": "Part One. Spoiler warning! The Last of Us takes place in a post-apocalyptic world", "start": 115.29, "duration": 4.37}, {"text": "ravaged by killer fungus that turns people into mushroom zombies. You play as Joel, a man who lost his daughter at the beginning of", "start": 120.03, "duration": 6.889}, {"text": "the apocalypse and is still", "start": 126.92, "duration": 1.3}, {"text": "emotionally traumatized over that loss. During the game you travel across America in an attempt to deliver Ellie to a laboratory.", "start": 128.22, "duration": 6.08}, {"text": "Ellie is a super special teenage girl with a unique biology", "start": 134.4, "duration": 3.29}, {"text": "that makes her immune to the fungus. Which means she might be the only one who can save the world if scientists can develop a", "start": 137.79, "duration": 6.079}, {"text": "cure from her DNA. But after a long, long, long journey where the two characters form a", "start": 143.87, "duration": 5.73}, {"text": "father-daughter bond, Joel learns that Ellie will die during the procedure. And so the main character but not the player is", "start": 149.91, "duration": 6.529}, {"text": "confronted with a choice between keeping the person they love alive or saving the world.", "start": 156.84, "duration": 4.91}, {"text": "The Witcher 3 takes place in the fantasy world of The Continent which is ravaged by war.", "start": 162.24, "duration": 5.149}, {"text": "You play as Geralt of Rivia whose surrogate daughter Ciri is missing. During the game,", "start": 168.05, "duration": 4.47}, {"text": "you travel across the world in an attempt to find her. Ciri is a super special", "start": 172.52, "duration": 4.259}, {"text": "20-something girl with a unique biology that makes her the only one capable of saving the world from the White Frost.", "start": 177.0, "duration": 5.449}, {"text": "But after a long, long, long, long, long, long, long, long,", "start": 182.66, "duration": 3.0}, {"text": "journey, Geralt finally finds Ciri but learns that she may die in her attempt to stop the apocalypse.", "start": 186.12, "duration": 4.76}, {"text": "And so the main character but not the player is confronted with a choice between", "start": 190.92, "duration": 4.31}, {"text": "keeping the person they love alive or saving the world. The difference between the two narratives", "start": 195.6, "duration": 5.209}, {"text": "is this: the protagonists make the opposite choice.", "start": 200.82, "duration": 4.16}, {"text": "Part Two: The Last of Us and Violence. In the finale of the Last of Us", "start": 205.769, "duration": 4.64}, {"text": "Joel mows down waves of soldiers, storms into the hospital room where they are operating on Ellie,", "start": 210.47, "duration": 4.199}, {"text": "murders the doctors and leaves with her. He then lies to Ellie about the entire thing!", "start": 214.89, "duration": 3.919}, {"text": "\"They've stopped looking for a cure.\" The final moments of the game reveal Joel to be", "start": 218.81, "duration": 4.169}, {"text": "psychotically possessive and entirely ego driven. The Last of Us is a very episodic story but each episode is in a way about", "start": 223.35, "duration": 7.879}, {"text": "contextualizing this decision that Joel makes at the climax. So let's go through them", "start": 231.93, "duration": 4.49}, {"text": "In the first episode of the story, Tess", "start": 239.079, "duration": 2.0}, {"text": "sacrifices herself so that Joel and Ellie can survive. Together, her and Joel have led amoral lives", "start": 241.18, "duration": 5.059}, {"text": "and she's hoping that she can redeem herself by helping Ellie.", "start": 246.239, "duration": 2.97}, {"text": "This is one path that Joel could take at the end of the game instead of sacrificing", "start": 249.209, "duration": 4.529}, {"text": "his life asTess does, he could sacrifice what he wants most in order to do something that would benefit the world at large. In", "start": 253.9, "duration": 7.04}, {"text": "contrast of this is Bill, a grumpy old man who lives alone and who tells Joel that", "start": 261.009, "duration": 4.34}, {"text": "relationships are a burden that no one can afford in the apocalypse. Survival is more important than happiness.", "start": 265.449, "duration": 5.39}, {"text": "\"Once upon a time, I had somebody that I cared about...", "start": 271.72, "duration": 3.589}, {"text": "partner, somebody I had to look after.", "start": 279.25, "duration": 2.929}, {"text": "And in this world that sort of shit's good for one thing...", "start": 284.59, "duration": 2.69}, {"text": "get you killed!", "start": 287.979, "duration": 1.981}, {"text": "So, you know what I did? Wisen the fuck up! I realized it's got to be just me!\"", "start": 289.96, "duration": 4.639}, {"text": "We also run into Joel's brother, Tommy, who disagrees with both of those previous characters.", "start": 294.82, "duration": 4.789}, {"text": "Tommy used to be a Firefly, a group rebelling against military oppression", "start": 299.61, "duration": 3.929}, {"text": "but he has left that idealistic life behind and now only cares about taking care of his family and friends.", "start": 303.539, "duration": 5.4}, {"text": "\"This isn't for me, Tommy. This is for your damn cause!\" \n\"My cause is my family now!\" In a twisted way,", "start": 308.94, "duration": 6.059}, {"text": "this is the same decision that Joel is making at the end of the game because Joel can't make the same decision that Tess made.", "start": 315.0, "duration": 6.0}, {"text": "Like Tommy, he can no longer sacrifice his own needs for the needs of the world because he has been unable to follow Bill's advice.", "start": 321.0, "duration": 5.82}, {"text": "He loves Ellie like a daughter despite himself. That relationship parallels the one between Henry and his brother Sam.", "start": 327.12, "duration": 5.85}, {"text": "You've got an older guardian and a younger ward and what happens to Henry is what Joel fears will happen to him. Henry and Joel", "start": 332.97, "duration": 6.75}, {"text": "have a lot in common. Like Joel, Henry is willing to do anything to keep the person he is responsible for alive.", "start": 339.74, "duration": 6.48}, {"text": "\"Okay, we gotta get him up!\"", "start": 353.14, "duration": 2.0}, {"text": "\"I'm sorry...", "start": 356.68, "duration": 0.5}, {"text": "we're leaving!\"\n \"What?\"", "start": 358.34, "duration": 1.64}, {"text": "But ultimately, at the end of the episode, he fails when Sam gets infected and Henry's response to this is to immediately commit", "start": 359.98, "duration": 7.429}, {"text": "suicide. The episode implies that Joel might make the same decision if Ellie dies.", "start": 367.6, "duration": 4.639}, {"text": "In fact, by throwing himself against the well-armed Fireflies,", "start": 372.24, "duration": 2.94}, {"text": "he is already acting suicidally. For both Henry and Joel, life just isn't worth living without the people", "start": 375.18, "duration": 5.97}, {"text": "they love. Underlying all of these episodes are questions about what the correct use of", "start": 381.15, "duration": 4.83}, {"text": "violence is, who it should be directed against and what is worth fighting for.", "start": 386.23, "duration": 3.589}, {"text": "Do you use violence to protect yourself only or those you care about or humanity at large? And nowhere is that", "start": 390.03, "duration": 5.67}, {"text": "exploration of violence more overt than in the penultimate chapter when Joel and Ellie come into conflict with a group of cannibals.", "start": 396.07, "duration": 6.35}, {"text": "The cannibals are led by David, a character who is a sort of dark mirror of Joel. In an article about the game, Bertand Lucat", "start": 402.52, "duration": 7.25}, {"text": "pointed out that games where the protagonist is a father will often have another character who is not necessarily an antagonist", "start": 409.93, "duration": 6.68}, {"text": "but who represent what that game thinks of as bad fatherhood.", "start": 416.61, "duration": 3.509}, {"text": "He calls these characters", "start": 420.12, "duration": 1.72}, {"text": "anti-fathers. Anti-fathers define acceptable or positive models of paternity in opposite to the warped, flawed or otherwise", "start": 421.84, "duration": 7.1}, {"text": "extreme models of patriarchal behavior that they display. Basically, the anti-fathers are so terrible that just by their presence we", "start": 429.04, "duration": 7.759}, {"text": "understand what being a good dad looks like. David is clearly framed as a fatherly figure.", "start": 436.9, "duration": 5.12}, {"text": "Especially when he first meets Ellie. He presents himself as wise and kind and looking out for her interests.", "start": 442.51, "duration": 5.479}, {"text": "It's only later that his brand of fatherhood is revealed to be totally domineering and abusive. As a cannibal,", "start": 448.0, "duration": 5.63}, {"text": "David is obviously a man who uses violence", "start": 453.63, "duration": 2.07}, {"text": "improperly, but the game contrasts his actions with Joel so that we're questioning what Joel is doing as well.", "start": 456.1, "duration": 5.6}, {"text": "I mean his last lines before being killed are these...", "start": 461.73, "duration": 2.85}, {"text": "\"You think you know me? Huh?", "start": 464.58, "duration": 2.0}, {"text": "Well let me tell something, you have no idea what I'm capable of!\"", "start": 466.78, "duration": 5.14}, {"text": "It's telling that Joel immediately steps into frame here because that line could have been said by him. It", "start": 472.54, "duration": 5.42}, {"text": "foreshadows the unspeakable act that he'll commit later on. Like David, Joel's fatherly kindness is an act: they are both monstrous!", "start": 478.16, "duration": 7.07}, {"text": "It's also an important scene because violence has catalyzed every major development in Joel and Ellie's relationship.", "start": 485.24, "duration": 5.84}, {"text": "Joel starts treating her as capable only after she first kills a man to save his life. This conversation... \"You're right.", "start": 491.08, "duration": 6.539}, {"text": "You're not my daughter.", "start": 500.0, "duration": 2.0}, {"text": "And I sure as hell ain't your dad.", "start": 503.999, "duration": 2.0}, {"text": "We are going our separate ways!\"", "start": 507.639, "duration": 2.0}, {"text": "\"Get it together!\"", "start": 510.129, "duration": 1.861}, {"text": "is immediately followed by an attack and that's immediately followed by them getting on the same page again.", "start": 511.99, "duration": 4.489}, {"text": "The violence seems to have solved the conflict between them and reminded Joel why he cares for her and it's this moment that finally cements", "start": 516.479, "duration": 6.989}, {"text": "Joel as Ellie's father figure.", "start": 523.469, "duration": 2.099}, {"text": "\"It's me! It's me! It's me! Look! Look! It's me!\"", "start": 525.568, "duration": 2.0}, {"text": "The great potential of the daddening of video games is that it opens up this space where you can take these", "start": 529.269, "duration": 5.48}, {"text": "hyper-masculine characters these giant cliches and", "start": 535.329, "duration": 2.39}, {"text": "soften them up a bit. Have them care for someone else instead of just being violent. The Last of Us does open that door a", "start": 538.24, "duration": 6.109}, {"text": "bit, Joel is masculine in every moment of the game", "start": 544.35, "duration": 2.88}, {"text": "but his masculinity also allows for caretaking and empathy. And Ellie isn't helpless but is clearly capable of handling herself and making her own", "start": 547.23, "duration": 7.83}, {"text": "decisions, at least until the very end when it slams that door closed, when Joel rips away any chance for Ellie to make her own", "start": 555.22, "duration": 7.28}, {"text": "decisions and the relationship becomes a toxic and manipulative one. Framing fatherhood", "start": 562.66, "duration": 4.94}, {"text": "solely through violence makes this relationship entirely about power. All the early episodes with Tessa, Bill, Tommy, Henry,", "start": 567.6, "duration": 7.229}, {"text": "they're all about Joel figuring out what he wants out of this relationship and out of life and not really about what Ellie wants. The", "start": 574.93, "duration": 6.529}, {"text": "ending simply makes that relationship explicit. They are not equals in Joel's mind. On the other hand...", "start": 581.459, "duration": 6.15}, {"text": "Part Three: The Witcher and", "start": 590.23, "duration": 2.0}, {"text": "Empathy\nThe Witcher 3 is an enormous incredible game that's about so many different things", "start": 592.75, "duration": 4.669}, {"text": "it's impossible to fully put your arms around it.", "start": 597.42, "duration": 2.28}, {"text": "But the most important through line for me is how it allows Geralt to be a positive and supportive father figure.", "start": 599.71, "duration": 6.349}, {"text": "It's what makes Geralt a unique character in the landscape of video game dads.", "start": 606.06, "duration": 4.35}, {"text": "I mean, on a superficial level, he is the epitome of a male power fantasy. It's like oh, yeah. Look at this guy", "start": 610.41, "duration": 6.809}, {"text": "He's so strong. He can kill anyone or anything. He's got like a hundred scars", "start": 617.22, "duration": 4.469}, {"text": "He gets to dress like a samurai and nobody minds! His voice sounds like he chugs gravel", "start": 621.69, "duration": 5.01}, {"text": "He gets to solve crimes like Batman. He has enhanced senses like Wolverine and he has sex with practically every woman", "start": 626.7, "duration": 6.029}, {"text": "He meets like James Bond, don't you want to be him?", "start": 632.73, "duration": 2.28}, {"text": "Well, not exactly. It would have been very easy for the developers to make a game with this character", "start": 635.11, "duration": 5.33}, {"text": "That was merely a juvenile power fantasy. Instead,", "start": 640.44, "duration": 3.03}, {"text": "the world is constantly taking Geralt down a peg. Because of his status as a Witcher, people treat him like dirt and", "start": 643.47, "duration": 6.359}, {"text": "constantly harass him. \"Witcher!", "start": 650.38, "duration": 2.0}, {"text": "Never thought the Baron would stoop to hiring a monster slayer!\" Unlike many fantasy protagonists,", "start": 652.9, "duration": 5.089}, {"text": "he's not a legendary hero or the chosen one to save the world.", "start": 657.99, "duration": 3.3}, {"text": "He's just a guy! So, the game isn't about the player getting to vicariously feel like the most important person in the universe.", "start": 661.42, "duration": 6.439}, {"text": "Where Joel would lash out at anyone who challenged him, you can play Geralt in a way where he always remains restrained.", "start": 668.23, "duration": 6.41}, {"text": "It's impossible to emasculate him because he doesn't take the bait.", "start": 674.64, "duration": 3.659}, {"text": "It's why he feels more masculine and mature than many of his counterparts.", "start": 678.37, "duration": 3.98}, {"text": "The most important example of this is at the game's", "start": 682.35, "duration": 2.07}, {"text": "brilliant climax where Geralt, unlike Joel, stands aside as his daughter chooses to save the world - even though she might die!", "start": 684.67, "duration": 7.099}, {"text": "There are three endings to the game and in one of them Ciri doesn't survive. In his grief, Geralt then goes on a", "start": 691.81, "duration": 5.989}, {"text": "suicidal mission to kill the one remaining secondary villain in the story. It's the Henry episode all over again!", "start": 697.96, "duration": 5.599}, {"text": "The father can't live with the guilt of letting his child die and it's the bleakest of the three endings.", "start": 703.56, "duration": 5.28}, {"text": "But the ending the player gets", "start": 708.84, "duration": 1.63}, {"text": "depends entirely on how Geralt treats Ciri during the final stretch of the game and it's here that the game makes its ideology", "start": 710.47, "duration": 6.079}, {"text": "about what fatherhood is explicit. In five key moments Ciri will struggle to cope with the pressure", "start": 716.83, "duration": 5.929}, {"text": "of being the chosen one and Geralt can try to help her. If he is patronizing,", "start": 723.059, "duration": 3.96}, {"text": "controlling, greedy or insensitive, then Ciri will lose faith in herself at the climax and will not survive. If instead Geralt is", "start": 727.719, "duration": 7.4}, {"text": "supportive, emotionally intelligent,", "start": 735.369, "duration": 2.0}, {"text": "confident in her abilities and empathetic, then the player will get one of two endings where Ciri does survive.", "start": 737.769, "duration": 4.759}, {"text": "These are actually really easy to screw up", "start": 742.529, "duration": 2.19}, {"text": "if you're coming into them thinking that Geralt must act like an authority figure as someone who's only interested in having Ciri fulfill her", "start": 744.719, "duration": 6.24}, {"text": "responsibilities. So how do you make the right choices and more importantly, how does the game guide you in making those choices?", "start": 751.329, "duration": 6.079}, {"text": "Well, in The Witcher 3 Geralt is constantly meeting other fathers who have different methods of raising their children", "start": 757.629, "duration": 6.44}, {"text": "which tie directly into the choices Geralt makes concerning Ciri. For instance, at one point in the game", "start": 764.169, "duration": 5.869}, {"text": "Ciri has to meet with the lodge of sorceresses.", "start": 770.039, "duration": 2.0}, {"text": "Geralt can either be an overly protective father figure by", "start": 772.719, "duration": 2.93}, {"text": "accompanying her to the meeting or he can choose to demonstrate confidence in her by letting her go alone.", "start": 775.809, "duration": 4.489}, {"text": "If the player lets her go alone,", "start": 780.369, "duration": 1.91}, {"text": "it might be because they've been influenced by the example set by Kraken Crate.", "start": 782.279, "duration": 4.08}, {"text": "This character is the head of a noble house in the Kingdom of", "start": 786.359, "duration": 4.02}, {"text": "Skellika.  His two children are candidates to become the next monarch and while he initially bemoans how headstrong they both", "start": 790.509, "duration": 7.19}, {"text": "are he is ultimately confident in their abilities.", "start": 797.699, "duration": 3.269}, {"text": "This includes his daughter Saris who you can help become queen. And if the player", "start": 800.969, "duration": 5.4}, {"text": "Geralt and Kraken Crate all believed that she's capable of ruling a country,", "start": 806.649, "duration": 3.83}, {"text": "then you should also be able to believe that the equally headstrong Ciri can handle one meeting on her own.", "start": 810.639, "duration": 5.809}, {"text": "The other two major father figures that Geralt encounters are", "start": 816.519, "duration": 3.169}, {"text": "anti-fathers, much like David in the Last of Us. Like David", "start": 819.969, "duration": 3.26}, {"text": "they are both the leaders of societies and also like David they are both men of violence.", "start": 823.229, "duration": 5.34}, {"text": "So let's talk about the bloody baron.", "start": 828.569, "duration": 2.219}, {"text": "During the search for Ciri, Geralt encounters Philip Stenger who has set himself up as the Baron in war-torn", "start": 831.009, "duration": 5.299}, {"text": "Belen. Philip is also searching for missing loved ones, his wife and daughter, and during her time with him", "start": 836.559, "duration": 5.45}, {"text": "you learn that he is a drunk, violent,", "start": 842.009, "duration": 2.07}, {"text": "abusive and neglectful father.", "start": 844.599, "duration": 1.74}, {"text": "He's just every bad dad trope rolled up into one. His daughter, Tamara, has virtually no positive memories of him.", "start": 846.339, "duration": 6.919}, {"text": "\"My earliest memories are of a drunken father lying under the stairs caked in mud and clutching a bottle. Next dozen years...", "start": 853.699, "duration": 6.09}, {"text": "pretty much the same!\"", "start": 860.549, "duration": 1.38}, {"text": "She's filled with resentment over her father's", "start": 861.929, "duration": 2.48}, {"text": "absences and abuses and acts recklessly as a way to rebel against him. In many of his scenes, Philip is remorseful about his crimes", "start": 864.6, "duration": 6.949}, {"text": "but he's never absolved of the harm he has caused. \"Tell him one gesture could never make up for a ruined childhood!\"", "start": 871.549, "duration": 6.33}, {"text": "He provides a stark warning for Geralt and for the player about the", "start": 877.879, "duration": 3.57}, {"text": "consequences of the misuse of", "start": 881.669, "duration": 1.53}, {"text": "violence and of neglecting the needs of your children. If the player remembers the bloody baron then they might make the right decision during this", "start": 883.199, "duration": 6.919}, {"text": "scene when Ciri is frustrated by her inability to control her magical powers. If Geralt tells her to relax he basically", "start": 890.119, "duration": 6.6}, {"text": "dismisses and diminishes her concerns and in the scene that follows they struggle to communicate with one another.", "start": 897.149, "duration": 5.209}, {"text": "\"Yes,", "start": 903.089, "duration": 1.65}, {"text": "pull me another!\"", "start": 904.739, "duration": 2.0}, {"text": "The fact that they're getting drunk is also reminiscent of the bloody baron's drinking.", "start": 913.2, "duration": 4.07}, {"text": "But if Geralt chooses the other option", "start": 917.27, "duration": 2.22}, {"text": "then the two have a snowball fight and Ciri returns to her studies with newfound vigor.", "start": 919.49, "duration": 4.349}, {"text": "She gets what Tamara never did, a father who was present and pays attention to her.", "start": 923.91, "duration": 5.27}, {"text": "The other major anti-father at the game is Tywin Lannister. Sorry! Amir von Emrys", "start": 929.34, "duration": 5.39}, {"text": "They're both played by Charles Dance and are essentially the same character! Amir is the Emperor of Milfgaard", "start": 934.76, "duration": 5.04}, {"text": "and Ciri is his heir. Throughout the game", "start": 939.99, "duration": 2.419}, {"text": "he wants Geralt to find Ciri and return her to him so that she can fulfill her aristocratic duties", "start": 942.41, "duration": 4.5}, {"text": "and", "start": 946.91, "duration": 0.31}, {"text": "if the players remember Amir during one of the critical choices with Ciri then they might make the right choice. At one point in", "start": 947.22, "duration": 6.02}, {"text": "the game Ciri feels betrayed by one of her closest friends Avila who she realizes", "start": 953.24, "duration": 4.529}, {"text": "doesn't actually", "start": 958.11, "duration": 0.87}, {"text": "care about her. Avila just wants Ciri to fulfill her grand destiny in the same way that her actual father wants her to fulfill", "start": 958.98, "duration": 6.02}, {"text": "her royal destiny. When this happens, Geralt can tell her to stay calm", "start": 965.04, "duration": 3.739}, {"text": "but it's definitely something that Amir would do since he is an incredibly cold and emotionless", "start": 968.78, "duration": 4.32}, {"text": "character who demands total decorum from everyone around him. That choice leads to a scene where Geralt puts a necklace on Ciri", "start": 973.38, "duration": 6.05}, {"text": "that is a reminder of her duties. The framing of the scene definitely makes it feel like Geralt is attempting to", "start": 979.43, "duration": 5.579}, {"text": "control Ciri's actions in the same way that Avila and Amir were. If Gerald chooses the other option then they go completely", "start": 985.29, "duration": 5.75}, {"text": "against decorum and vent their anger together by wrecking a Avila's secret lair.", "start": 991.2, "duration": 3.86}, {"text": "So", "start": 995.06, "duration": 0.55}, {"text": "if the player is paying close attention to how each of the other father figures in the story are framed, then they'll be prepared to", "start": 995.61, "duration": 5.929}, {"text": "emotionally support Ciri at these key moments in ways", "start": 1001.73, "duration": 2.84}, {"text": "They might not have expected", "start": 1004.57, "duration": 1.48}, {"text": "were the right ways to act when they started playing the game. If you make the right call the majority of the time then Ciri", "start": 1006.05, "duration": 5.869}, {"text": "will survive the climactic battle at the end and you'll get one of two endings: in one Ciri becomes a Witcher alongside Geralt and in", "start": 1011.92, "duration": 6.719}, {"text": "the other Ciri chooses to go back to Nilfgaard and become Empress. For me,", "start": 1018.64, "duration": 4.08}, {"text": "this has always been the most fitting ending of the story even though it's definitely not the", "start": 1022.72, "duration": 4.499}, {"text": "happiest. Geralt must once again step aside and allow Ciri to make her own decisions, even though it's not what he wants.", "start": 1027.38, "duration": 6.349}, {"text": "\"Is this what you want?\"", "start": 1033.88, "duration": 1.89}, {"text": "\"Yes.", "start": 1035.77, "duration": 1.75}, {"text": "You're not trying to stop me.", "start": 1037.52, "duration": 2.0}, {"text": "Take me to the Blue Mountains by force?\"", "start": 1039.929, "duration": 2.0}, {"text": "\"I traveled half the world to find you. I never intended to force anything on you.\"", "start": 1042.54, "duration": 4.579}, {"text": "\"I know.\" By saving her life, but losing her company this ending gives consequence to Geralt's actions.", "start": 1048.48, "duration": 5.54}, {"text": "He's making the right choices regardless how painful", "start": 1054.02, "duration": 2.64}, {"text": "it may be for him and in contrast to nearly every other game made during the daddening of video games, The Witcher 3 presents", "start": 1056.66, "duration": 6.029}, {"text": "fatherhood as something that is about being supportive and empathetic, about", "start": 1062.82, "duration": 3.41}, {"text": "inspiring confidence and offering advice and in the end knowing that there's only so much you can do. Eventually, you have to let go.", "start": 1066.3, "duration": 6.649}, {"text": "Conclusions and", "start": 1074.49, "duration": 1.2}, {"text": "Caveats. If you've been paying attention to the critical discourse around video games for any length of time", "start": 1075.69, "duration": 5.03}, {"text": "then you'll know that there is a", "start": 1080.82, "duration": 1.71}, {"text": "let's call it a", "start": 1082.53, "duration": 1.2}, {"text": "resistance to any", "start": 1083.73, "duration": 1.23}, {"text": "discussion of gender roles in the medium. But in The Last of Us and The Witcher 3 we have two games where the story is", "start": 1084.96, "duration": 6.05}, {"text": "so", "start": 1091.01, "duration": 0.669}, {"text": "inextricably bound up and playing with the notions of fatherhood and masculinity that it's almost impossible to say anything about them without dipping your toes", "start": 1091.679, "duration": 7.31}, {"text": "into discussions of those topics. And more importantly here, we have two games that appeal to a male audience but are in many places", "start": 1098.99, "duration": 5.91}, {"text": "revolutionary in their depictions of masculinity now that doesn't mean they don't have shortcomings.", "start": 1105.54, "duration": 3.949}, {"text": "There is much that could be said about the sexualization of", "start": 1109.49, "duration": 2.489}, {"text": "all of the female characters in The Witcher and the constant brutalizing of women in the story. Things that could", "start": 1112.44, "duration": 5.66}, {"text": "potentially undermine what the game is trying to do in other areas.", "start": 1118.29, "duration": 3.079}, {"text": "That's a topic that would easily double the length of this essay. In contrast, Neil Druckmann has said he wanted to make a game with", "start": 1121.37, "duration": 5.369}, {"text": "a badass heroine who wasn't sexualized and", "start": 1126.74, "duration": 2.64}, {"text": "largely succeeded at delivering on that. But in short, while video games have been dominated by hyper masculine", "start": 1129.66, "duration": 6.049}, {"text": "protagonists, a new wave of games have featured fathers as the main playable character. Among those games, The Last of Us and The Witcher 3", "start": 1135.99, "duration": 7.01}, {"text": "use those tropes to explore new definitions of masculinity, ones which open up spaces for equal relationships instead of relationships", "start": 1143.16, "duration": 7.13}, {"text": "where one person is in the dominant position. Of the two, The Last of Us", "start": 1150.29, "duration": 3.479}, {"text": "only teases us with that possibility and makes it an explicit part of its tragedy that it is not achieved at the end.", "start": 1153.83, "duration": 5.43}, {"text": "Whereas in The Witcher, the relationship between Geralt and Siri is one of gaming's best examples of a truly positive and mutually respectful", "start": 1159.39, "duration": 7.849}, {"text": "father/daughter", "start": 1167.58, "duration": 1.02}, {"text": "relationship and that more than anything else is what makes the Witcher such an important game.", "start": 1168.6, "duration": 4.88}, {"text": "Like a lot of people The Witcher 3 was the first piece of Witcher media I ever encountered which is a little strange", "start": 1177.779, "duration": 6.14}, {"text": "considering that it is", "start": 1184.23, "duration": 1.559}, {"text": "chronologically, not only the conclusion to a series of games, but to the book series as well. While putting this essay together", "start": 1185.789, "duration": 5.39}, {"text": "I started listening to the books on Audible, the sponsor of this video.", "start": 1191.179, "duration": 3.69}, {"text": "Typically,", "start": 1195.179, "duration": 0.5}, {"text": "I only ever listened to nonfiction audiobooks because I find it hard to follow along with the story if it's a piece of fiction", "start": 1195.679, "duration": 5.52}, {"text": "intended with page", "start": 1201.51, "duration": 1.08}, {"text": "but", "start": 1202.59, "duration": 0.6}, {"text": "surprisingly I had no trouble listening to the narration by Peter Kenney and I think it's because he uses very distinct voices for each character", "start": 1203.19, "duration": 6.949}, {"text": "so you're never", "start": 1210.139, "duration": 0.79}, {"text": "confused about who's speaking.", "start": 1210.929, "duration": 1.401}, {"text": "If you want to listen to the book series that inspired these games or any audiobooks at all then go to audible.com/justwrite", "start": 1212.33, "duration": 6.059}, {"text": "or text justwrite to 500-500 you'll get three months of Audible for just $4.95 per month.", "start": 1218.789, "duration": 6.53}, {"text": "So it's like getting three months for the price of one. Thanks for watching everyone and again a big", "start": 1225.32, "duration": 4.5}, {"text": "thank you to my patrons on Patreon for supporting this channel and for patiently waiting for this video! Keep writing everyone!", "start": 1229.82, "duration": 5.94}]