[{"text": "This video was made possible by Squarespace.\nStart building your website for free at squarespace.com/wendover", "start": 0.52, "duration": 6.04}, {"text": "and then when you’re ready to launch, use\nthe code “wendover” for 10% off.", "start": 6.56, "duration": 4.35}, {"text": "If you were just dropped in this place with\nno prior knowledge, where would you guess", "start": 10.91, "duration": 4.07}, {"text": "you were? Maybe Florida or California o r\nHawaii—somewhere tropical but this is definitely", "start": 14.98, "duration": 6.54}, {"text": "the US. It just looks like the US. From the\nstyle of signs to the way the roads look to", "start": 21.52, "duration": 5.48}, {"text": "the stores that line the streets, you can\ntell it’s the US but it’s not Florida,", "start": 27.0, "duration": 4.59}, {"text": "it’s not California, it’s not Hawaii,\nit’s not even on this side of the world.", "start": 31.59, "duration": 6.04}, {"text": "It’s America’s most isolated territory.\nIt’s Guam.", "start": 37.63, "duration": 4.16}, {"text": "The United States has five inhabited territories—the\nUS Virgin Islands, Puerto Rico, American Samoa,", "start": 41.79, "duration": 5.9}, {"text": "the Northern Mariana Islands, and Guam itself.\nGuam is the furthest of these five from the", "start": 47.69, "duration": 4.51}, {"text": "continental US—nearly 8,000 miles away from\nWashington, DC—making it the most isolated.", "start": 52.2, "duration": 6.65}, {"text": "Beijing, Delhi, Cape Town, and Buenos Aires\nare all closer to DC than Guam is and yet", "start": 58.85, "duration": 6.209}, {"text": "the island is a fully fledged territory of\nthe US. It is the US. Guam has been inhabited", "start": 65.059, "duration": 6.611}, {"text": "for thousands of years by the native Chamorro\npeople until the 1500s when it was first claimed", "start": 71.67, "duration": 4.739}, {"text": "as a territory by Spain. Centuries later,\nafter the US’ victory in the Spanish-American", "start": 76.409, "duration": 4.541}, {"text": "war, the territory was ceded to the United\nStates along with Puerto Rico and the Philippines.", "start": 80.95, "duration": 4.579}, {"text": "Aside from a brief and brutal Japanese occupation\nduring World War Two, the island has remained", "start": 85.529, "duration": 4.57}, {"text": "part of the US ever since. Many Americans\nhad never even heard of Guam until summer", "start": 90.099, "duration": 5.321}, {"text": "2017. That was when North Korean leader Kim\nJong-un threatened to launch a ballistic missile", "start": 95.42, "duration": 5.17}, {"text": "at Guam. The threats may have since subsided,\nbut the effects of that summer have not.", "start": 100.59, "duration": 5.51}, {"text": "The island stretches less than 30 miles from\ntop to bottom which makes it smaller than", "start": 106.1, "duration": 3.729}, {"text": "every other US state and territory and yet\nit packs more than 160,000 people into that", "start": 109.829, "duration": 5.82}, {"text": "small size. In fact, it’s more densely populated\nthan all but five US states or territories.", "start": 115.649, "duration": 6.571}, {"text": "Meanwhile, it is by far the most developed\nplace in Micronesia. To put it in perspective,", "start": 122.22, "duration": 5.879}, {"text": "Guam’s neighboring islands, the Northern\nMariana Islands, which are also part of the", "start": 128.099, "duration": 3.501}, {"text": "US, have a GDP per capita of $16,800 while\nGuam’s is more than $35,000. Kiribati, meanwhile,", "start": 131.6, "duration": 7.48}, {"text": "the most populous county in Micronesia, has\na GDP per capita of $1,500. Guam is an outpost", "start": 139.08, "duration": 8.62}, {"text": "of the modern, developed world in one of the\npoorest regions of the world. Its location", "start": 147.7, "duration": 5.08}, {"text": "though, is its greatest asset. It’s economy\nexists because of where it is.", "start": 152.78, "duration": 5.49}, {"text": "The island is three hours from Tokyo, four\nhours from Seoul, and five hours from Hong", "start": 158.27, "duration": 4.54}, {"text": "Kong. It’s close to Asia but it is still\nthe US—unequivocally. You see American license", "start": 162.81, "duration": 6.18}, {"text": "plates, American school buses, American-style\nambulances, they have US post offices, they", "start": 168.99, "duration": 3.71}, {"text": "use the US dollar, they have American stores,\nAmerican hotels, US National Parks, US airlines.", "start": 172.7, "duration": 5.46}, {"text": "There is no compromise on the American-ness\nof Guam because it is the US. They fly the", "start": 178.16, "duration": 6.59}, {"text": "US flag and for tourists, this is a draw.\nInstead of flying seven hours to Hawaii or", "start": 184.75, "duration": 5.1}, {"text": "ten hours to California, Japanese tourists\ncan and do just fly three hours to Guam in", "start": 189.85, "duration": 5.11}, {"text": "order to visit the US. The malls, which look\nidentical to any in Virginia or Kansas or", "start": 194.96, "duration": 5.28}, {"text": "anywhere else in the US, are hugely popular\nwith Asian tourists as they can buy American", "start": 200.24, "duration": 4.69}, {"text": "goods for a fraction of what they would cost\nin Asia. About 1.5 million people visit the", "start": 204.93, "duration": 5.25}, {"text": "island of 160 thousand each year, but what’s\nnot good for tourism is missile threats. “Last", "start": 210.18, "duration": 6.44}, {"text": "summer when they were playing ‘who’s missile’s\nbigger’ we were the ones who suffered, you", "start": 216.62, "duration": 8.66}, {"text": "know, our tourism took a huge nosedive that\nmonth of August. We never saw so many news", "start": 225.28, "duration": 7.84}, {"text": "agencies coming to Guam from countries that\ndidn’t even realize we existed because all", "start": 233.12, "duration": 7.02}, {"text": "of a sudden Kim Jung Un was threatening the\nAmerican territory in the Pacific.” (17:39)", "start": 240.14, "duration": 5.67}, {"text": "This is Benjamin Cruz, speaker of the Guam\nLegislature. As he said, the island’s economy", "start": 245.81, "duration": 4.81}, {"text": "suffered immensely from the North Korean missile\nthreat. Many visitors of Guam come as parts", "start": 250.62, "duration": 4.561}, {"text": "of school groups or corporate retreats and\nthese groups in particular almost universally", "start": 255.181, "duration": 4.428}, {"text": "cancelled their trips. “We lost, I mean,\nalmost all of Japan stopped coming. I mean,", "start": 259.609, "duration": 9.711}, {"text": "everybody was afraid to come, the only ones\nthat were coming were the news media.” (28:00)", "start": 269.32, "duration": 4.599}, {"text": "Fortunately, the effects were partially mitigated\nby an increase in visitors from South Korea", "start": 273.919, "duration": 4.47}, {"text": "who were less worried about missile threats\nsince its a reality they live every day back", "start": 278.389, "duration": 3.911}, {"text": "home, but for an island so centered around\ntourism, being dragged into politics is never", "start": 282.3, "duration": 5.22}, {"text": "good.\nDespite being part of the US, though, Guam", "start": 287.52, "duration": 3.09}, {"text": "functions politically differently from every\nother part of the US. Benjamin Cruz, along", "start": 290.61, "duration": 5.04}, {"text": "with the 14 other senators, are the lawmakers\nof Guam. They can legislate just like any", "start": 295.65, "duration": 4.81}, {"text": "state legislature, but the main political\ndifference for Guam is at the federal level.", "start": 300.46, "duration": 4.47}, {"text": "All the US federal laws, the ones made in\nWashington for the whole country, all those", "start": 304.93, "duration": 4.479}, {"text": "laws apply in Guam. What Guam doesn’t get\nthough, is a vote. Their congressional representatives", "start": 309.409, "duration": 6.12}, {"text": "don’t get a vote so by extension, the people\nof Guam can't vote on the laws that apply", "start": 315.529, "duration": 4.92}, {"text": "to them. In addition, unlike Washington, DC,\nwhich also does’t receive a vote in Congress,", "start": 320.449, "duration": 5.331}, {"text": "Guam, along with the other US territories,\nis not able to vote for their president—the", "start": 325.78, "duration": 4.62}, {"text": "US president. This presents an issue not only\nbecause of the lapse in democracy, but also", "start": 330.4, "duration": 5.06}, {"text": "because many US laws that may make sense for\nthe continental United States just don’t", "start": 335.46, "duration": 4.91}, {"text": "for a territory on the other side of the world.\n“We’d like to be able to invite people", "start": 340.37, "duration": 6.319}, {"text": "to the island and industries and not have\nto worry about whether the SEC would approve", "start": 346.689, "duration": 7.84}, {"text": "it or the FCC would approve it. We’d like\nto be able to have control over our skies", "start": 354.529, "duration": 6.51}, {"text": "so we can invite airlines to fly in without\nhaving to clear with FAA on whether or not", "start": 361.039, "duration": 6.97}, {"text": "this airline or that airline can or cannot\nfly.” (13:10) The process for a foreign", "start": 368.009, "duration": 4.93}, {"text": "airline of gaining approval to fly to the\nUS is often long and laborious and there are", "start": 372.939, "duration": 4.16}, {"text": "a number of special security and immigration\nrules for flights to the US. This isn’t", "start": 377.099, "duration": 4.25}, {"text": "a problem for large, intercontinental airlines\nor Mexican or Canadian ones for whom flights", "start": 381.349, "duration": 4.661}, {"text": "to the US represent a large part of their\nmarket, but for small regional Asian carriers,", "start": 386.01, "duration": 4.239}, {"text": "they might pass on flights to Guam just to\navoid having to gain FAA approval.", "start": 390.249, "duration": 5.09}, {"text": "Another issue for Guam is the Jones Act. This\nlaw prevents foreign built, owned, or operated", "start": 395.339, "duration": 4.761}, {"text": "ships from carrying cargo or passengers between\nUS ports. This may make sense within the continental", "start": 400.1, "duration": 5.539}, {"text": "United States. Just as you wouldn’t want\na foreign airline flying domestic cargo routes", "start": 405.639, "duration": 4.15}, {"text": "you wouldn’t want a foreign shipping company\ntaking over cargo routes like Houston to Charleston", "start": 409.789, "duration": 4.16}, {"text": "or Seattle to Oakland but Guam is a different\nstory. Cargo ships generally make many stops", "start": 413.949, "duration": 5.321}, {"text": "along their routes so it would be perfectly\nnormal for a Taiwanese ship, for example,", "start": 419.27, "duration": 4.229}, {"text": "to go from Oakland to Hawaii to Guam to Osaka\nto Taipei but it can’t because then it’d", "start": 423.499, "duration": 5.381}, {"text": "be transporting goods between US ports. Instead,\nonly US ships can bring goods from the US,", "start": 428.88, "duration": 6.2}, {"text": "where most of Guam’s goods come from, to\nGuam. Other US territories like American Samoa", "start": 435.08, "duration": 5.08}, {"text": "and the Northern Mariana Islands are exempt\nfrom this rule but Guam is still subject to", "start": 440.16, "duration": 4.3}, {"text": "it which makes shipping to the island more\nexpensive.", "start": 444.46, "duration": 3.14}, {"text": "Despite the issues the US federal government\nmay cause, the people of Guam are in no hurry", "start": 447.6, "duration": 4.52}, {"text": "to distance themselves from it. “I think\nif you were to ask a majority of the people", "start": 452.12, "duration": 6.349}, {"text": "on the island they would like to have a closer\nunion with the United States and some may", "start": 458.469, "duration": 7.271}, {"text": "even want statehood. In fact, a majority of\nthem would like to see statehood.” (5:00)", "start": 465.74, "duration": 6.56}, {"text": "In many ways, Guam is one of the most patriotic\nareas in the US. The US military freed Guam", "start": 472.3, "duration": 5.94}, {"text": "from a brutal and deadly Japanese occupation\nduring World War Two which many of the older", "start": 478.24, "duration": 4.829}, {"text": "residents still remember. The younger residents,\nmeanwhile, quite often work for the US. “Just", "start": 483.069, "duration": 6.02}, {"text": "about every family on this island, I’m sure\nalmost every family on this island had at", "start": 489.089, "duration": 5.85}, {"text": "least one member of their family serve in\nthe military.” (11:40) One out of eight", "start": 494.939, "duration": 3.801}, {"text": "residents of Guam serve or have served in\nthe US armed forces. It has a higher enlistment", "start": 498.74, "duration": 5.609}, {"text": "rate than any US state but this is helped\nby the fact that a quarter of the island is", "start": 504.349, "duration": 5.46}, {"text": "US military bases. The island is one of the\nUS military’s most strategic assets. Of", "start": 509.809, "duration": 5.382}, {"text": "course the US has plenty of bases in Japan\nand South Korea but Guam is US soil less than", "start": 515.191, "duration": 5.299}, {"text": "four hours away from North Korea, the East\nChina Sea, and the South China Sea—all possible", "start": 520.49, "duration": 4.8}, {"text": "flash-points for US conflict. The US military\nis the single largest employer on Guam and", "start": 525.29, "duration": 5.24}, {"text": "its economy depends on the military. While\ntourism may have suffered recently, the military", "start": 530.53, "duration": 4.831}, {"text": "business is good. The number of military personnel\nstationed on Guam is slated to more than double", "start": 535.361, "duration": 4.909}, {"text": "in the coming decade which will no doubt stimulate\nthe economy. This doesn’t come without concern,", "start": 540.27, "duration": 4.76}, {"text": "Guam only has so much land, but all factors\nconsidered, Guam is on the rise.", "start": 545.03, "duration": 5.11}, {"text": "Guam is truly a unique place. Plenty of countries\nhave territories far away from their mainland", "start": 550.14, "duration": 5.25}, {"text": "but few are as developed and as similar to\nthe rest of the country as Guam. If Guam was", "start": 555.39, "duration": 4.7}, {"text": "just off the coast of the US mainland it would\nbe totally unremarkable—just another piece", "start": 560.09, "duration": 4.66}, {"text": "of the US that looks and acts like the rest\nof the US—but it’s not. It’s on the", "start": 564.75, "duration": 4.43}, {"text": "other side of the world. Guam is a relic of\ncolonialism but today it’s a thriving, developed", "start": 569.18, "duration": 5.38}, {"text": "place. It may not get treated like the US\neven by its own government, but in all other", "start": 574.56, "duration": 5.16}, {"text": "ways, Guam is the United States.\nOne aspect of Guam’s story that this video", "start": 579.72, "duration": 5.08}, {"text": "didn’t cover is how they’re trying to\ngrow their local, small businesses in order", "start": 584.8, "duration": 3.36}, {"text": "to make the economy more self-sustaining.\nSquarespace also helps with this. They help", "start": 588.16, "duration": 4.77}, {"text": "small businesses make what was previously\nonly available for huge companies—a great,", "start": 592.93, "duration": 4.79}, {"text": "beautifully designed, professional-looking\nwebsite. Small businesses aren’t necessary", "start": 597.72, "duration": 4.02}, {"text": "physical stores. Whatever you do, whether\nit be photography, podcasting, youtubing,", "start": 601.74, "duration": 4.89}, {"text": "anything you hope to make money from is a\nbusiness and so you need to make sure people", "start": 606.63, "duration": 3.56}, {"text": "can find you. If you’re anything like me,\nthe first place you go to find something is", "start": 610.19, "duration": 3.75}, {"text": "the internet so it’s absolutely crucial\nto have a great looking website since that’s", "start": 613.94, "duration": 4.13}, {"text": "your first impression. With their beautiful\ndesigner templates, customizable website builder,", "start": 618.07, "duration": 3.99}, {"text": "fantastic 24/7 customer support, and reasonable\nprices, Squarespace is absolutely the best", "start": 622.06, "duration": 4.75}, {"text": "place to build your web presence. Best of\nall, you can try out Squarespace for free", "start": 626.81, "duration": 4.27}, {"text": "by going to squarespace.com/Wendover and then,\nwhen you’re ready to launch, you can get", "start": 631.08, "duration": 4.38}, {"text": "10% off only by using the code “wendover”\nat checkout. Squarespace is a great supporter", "start": 635.46, "duration": 4.97}, {"text": "of the show and makes ambitious videos like\nthis, which was filmed on location in Guam,", "start": 640.43, "duration": 4.47}, {"text": "possible so please do at least check them\nout at squarespace.com/Wendover. Also, for", "start": 644.9, "duration": 5.61}, {"text": "those of you still here, I want to mention\nthat there’s a behind-the-scenes video on", "start": 650.51, "duration": 3.42}, {"text": "my personal channel of Brian from Real Engineering,\nJoseph from Real Life Lore, and myself filming", "start": 653.93, "duration": 4.63}, {"text": "this video on location in Guam. Thanks for\nwatching and we’ll see you again in three", "start": 658.56, "duration": 4.49}, {"text": "weeks for another Wendover Productions video.", "start": 663.05, "duration": 2.15}]