[{"text": "Welcome back", "start": 0.1, "duration": 0.84}, {"text": "I wanted to cover the topic of whether employees at Facebook are depressed.", "start": 1.12, "duration": 4.08}, {"text": "and as an ex google ex facebook tech lead, I feel that I may be qualified to talk about this", "start": 5.4, "duration": 4.72}, {"text": "From the outside, you may be seeing people with free food, free coffee, ice cream, good pay. And you think", "start": 10.3, "duration": 5.16}, {"text": "they must be living their dream life, what do they have to complain about?", "start": 15.68, "duration": 2.8}, {"text": "whereas in reality, a lot of them are slaves", "start": 18.48, "duration": 2.88}, {"text": "and for some people, this may be a little hard to believe", "start": 21.36, "duration": 2.44}, {"text": "but it's no secret in the tech industry", "start": 24.0, "duration": 1.96}, {"text": "we have reinstitutionalized slavery and this is largely through the   h1b visa process.", "start": 26.12, "duration": 5.52}, {"text": "the way it should work is you bring in high-skilled labor from overseas", "start": 31.8, "duration": 2.94}, {"text": "that you can not access within the united states", "start": 34.94, "duration": 2.12}, {"text": "once you bring them in you're supposed to treat them well, respect them", "start": 37.06, "duration": 2.68}, {"text": "because they're so hard to get", "start": 39.92, "duration": 1.24}, {"text": "however, most silicon valley tech companies have found loopholes to bring in", "start": 41.2, "duration": 3.76}, {"text": "cheap labor  that they can use and abuse", "start": 45.08, "duration": 2.04}, {"text": "once these workers are brought in they're entirely under your control and", "start": 47.14, "duration": 3.0}, {"text": "if they underperform for any reason you can just fire them and they will face deportation", "start": 50.26, "duration": 5.36}, {"text": "so for the worker, their choice is they either do exactly as you say or they can be deported.", "start": 55.78, "duration": 4.54}, {"text": "their entire livelihood could be messed up", "start": 60.42, "duration": 2.44}, {"text": "you can pay them less for them to work even inside on weekends.", "start": 62.96, "duration": 2.42}, {"text": "there's really nothing they can do about it", "start": 65.4, "duration": 2.48}, {"text": "if you work in silicon valley this should be no mystery at all to you.", "start": 67.92, "duration": 2.92}, {"text": "many companies as you walk inside their walls.", "start": 70.84, "duration": 2.28}, {"text": "if feels like you've gone a 3rd- world country like a factory of wage slaves.", "start": 73.12, "duration": 4.12}, {"text": "And managers know they can abuse these workers to their heart's content and just milk every last ounce of blood from these people.", "start": 77.32, "duration": 6.38}, {"text": "I never told this story but back when I was working at Groupon, the real reason that I quit was because it was one of these wage-slaves factory firms.", "start": 83.8, "duration": 7.0}, {"text": "they have an office over in PaloAlto but as soon as I entered I noticed that everybody there was either Indian or Chinese", "start": 90.9, "duration": 6.34}, {"text": "that's where most of these h1b visa workers are coming from", "start": 97.44, "duration": 2.92}, {"text": "and the manager showed absolutely no respect", "start": 100.44, "duration": 2.68}, {"text": "I remember one of my coworkers kept asking our manager to file some visa application paperwork", "start": 103.22, "duration": 5.04}, {"text": "and the manager kept delaying and delaying and missed the deadline intentionally I believe", "start": 108.32, "duration": 4.76}, {"text": "and so this is really all about control.", "start": 113.18, "duration": 2.16}, {"text": "as an American citizen myself, I have had the freedom to quit many jobs myself.", "start": 115.48, "duration": 3.84}, {"text": "but my colleagues have not been so fortunate.", "start": 119.44, "duration": 2.08}, {"text": "they have just been forced to sleep away in the company", "start": 121.52, "duration": 2.54}, {"text": "surrounded by free food which really just disguises the issue at hand", "start": 124.28, "duration": 3.98}, {"text": "a lot of silicon valley tech companies they're using a tactic of hire and fire, slash and burn, rinse and repeat.", "start": 128.4, "duration": 7.58}, {"text": "so the big innovation in tech over the past decade has not been React.js some javascript framework or API", "start": 136.06, "duration": 7.02}, {"text": "it's been the reintroduction of modernized slavery.", "start": 143.26, "duration": 3.14}, {"text": "and you know this is a lose-lose situation. because American jobs are being displaced", "start": 146.4, "duration": 4.16}, {"text": "high-skilled workers from overseas are not able to get in on the visas and get the respect that they deserve", "start": 150.7, "duration": 5.24}, {"text": "and anybody who's able to get in on an h1b skilled or not is treated like garbage.", "start": 156.08, "duration": 4.82}, {"text": "see there's no talent shortage. tech companies have just invented some BS interview game as a way to filter out American candidates and give priority to cheap labor from overseas that they can have absolute control over.", "start": 161.42, "duration": 10.64}, {"text": "it's funny that tech companies are always complaining about diversity. there's not enough women in tech, not enough black people in tech.", "start": 183.72, "duration": 6.36}, {"text": "you know the fact is there's plenty of diversity out there. the problem is that they're not immigrants you can control and underpay", "start": 190.18, "duration": 5.5}, {"text": "facebook became really big really quickly and still doing everything that we can to catch up and make sure we are getting that balance right.", "start": 195.86, "duration": 9.26}, {"text": "meanwhile, the middle class of American is probably being wiped out", "start": 205.22, "duration": 3.1}, {"text": "companies know if you join them you'll probably quit within a year or two. they much rather hire immigrants who they can hold down to for many years and have that control over and just force them to work as much as they want.", "start": 208.48, "duration": 11.04}]