[{"text": "April 30th,", "start": 0.03, "duration": 1.66}, {"text": "1494, Cuba. It's the second voyage of the Genoese mariner Christopher Columbus.", "start": 1.69, "duration": 5.27}, {"text": "He's returned to the Caribbean to take gold and slaves.", "start": 7.06, "duration": 2.69}, {"text": "But also to build a colony, and on orders of Queen Isabella of Spain", "start": 9.75, "duration": 4.83}, {"text": "he's brought along one of the key tools of Spanish colonialism. They trot ashore, squealing in the surf.", "start": 14.769, "duration": 5.689}, {"text": "They are a fundamental element of Spanish settlement, a potent military asset, and a biological weapon without peer.", "start": 20.46, "duration": 6.21}, {"text": "Eight pigs come ashore on the Cuban beach. Their descendants will ravage the Americas for centuries.", "start": 27.64, "duration": 7.579}, {"text": "We're talking about pigs, baby!", "start": 35.8, "duration": 2.0}, {"text": "God, I love this show.", "start": 38.14, "duration": 2.0}, {"text": "This episode is sponsored by World of Tanks.", "start": 46.0, "duration": 2.509}, {"text": "Download the game for free at extratanks.com and use the invite code Extratanks1 to claim your $15 starter pack.", "start": 48.82, "duration": 6.68}, {"text": "The Spanish invasion and the", "start": 55.989, "duration": 2.0}, {"text": "colonization of the Americas wouldn't have been possible, without a few non-human allies, and though horses are the animal most associated with Spanish colonialism", "start": 58.03, "duration": 7.849}, {"text": "there was another animal just as important, the domestic pig.", "start": 66.06, "duration": 3.989}, {"text": "Pigs traveled with the Spanish almost everywhere they settled. Pork was a staple of their diet, since it survived", "start": 70.659, "duration": 5.81}, {"text": "well in the rocky Spanish terrain, and since most expeditions provisioned themselves in the pig-heavy Canary Islands,", "start": 76.47, "duration": 5.759}, {"text": "it was a logical animal to bring. Pigs were almost the perfect animal to keep aboard ship. Yes,", "start": 82.229, "duration": 5.76}, {"text": "they were dirty, sure,", "start": 87.99, "duration": 1.36}, {"text": "but they were more compact than cows, and while cows sheep and goats needed grassy fields, pigs needed, whatever!?", "start": 89.35, "duration": 6.83}, {"text": "They were omnivorous, so they could live off of table scraps, agricultural byproducts, or even human waste, if that was all that was available.", "start": 96.759, "duration": 6.8}, {"text": "So not only did that make them easy to keep aboard ship, but they could adapt to almost any environment once they arrived.", "start": 103.56, "duration": 6.629}, {"text": "Plus,", "start": 110.59, "duration": 0.5}, {"text": "their short reproductive cycle and large litters meant they could multiply relatively quickly, turning even a few hogs into a", "start": 111.09, "duration": 6.54}, {"text": "self-sustaining population, and", "start": 117.909, "duration": 1.771}, {"text": "they were hardy. The shock of an ocean voyage rendered most farm animals sterile for a year after arrival,", "start": 119.68, "duration": 5.989}, {"text": "but pigs could just, well, keep making more pigs.", "start": 125.68, "duration": 3.98}, {"text": "In fact, the pigs were so hardy that they didn't even need humans to raise them. The Spanish regularly released breeding pairs on Caribbean islands,", "start": 130.42, "duration": 7.71}, {"text": "confident that when they returned months, or years later, there would be a large herd of wild pigs ready to feed a colony,", "start": 138.38, "duration": 5.899}, {"text": "resupply a ship, or keep any unfortunate castaways alive.", "start": 144.62, "duration": 3.11}, {"text": "They were essentially the perfect colonial animal, a living build-a-settlement set,", "start": 148.1, "duration": 5.809}, {"text": "with versatility beyond peer. When smoked or salted, pork lasted almost", "start": 154.16, "duration": 3.739}, {"text": "indefinitely, and pork products greased the wheels of Spanish society, and I mean that literally because during this period", "start": 158.239, "duration": 6.47}, {"text": "anything with wheels only worked if its axles were well lubricated with pork grease, and pork fat", "start": 164.959, "duration": 5.21}, {"text": "provided the key ingredient in products from soap, to candles, to lantern oil, and many types of medicine.", "start": 170.54, "duration": 5.36}, {"text": "Pig organs were the plastic containers of their day,", "start": 176.06, "duration": 2.479}, {"text": "both air and waterproof,", "start": 178.54, "duration": 1.029}, {"text": "used to make everything from balloons, to inflatable sports balls, to water skins, and paint containers.", "start": 179.569, "duration": 6.02}, {"text": "Hogs hair even made the best quality artist brushes in the Renaissance, and this New World would need", "start": 185.69, "duration": 5.539}, {"text": "artists to paint all of the cathedrals these conquistadors planned to build.", "start": 191.33, "duration": 3.679}, {"text": "So as the Spanish established settlements in the Caribbean, Central America, and South America, more and more pigs", "start": 195.29, "duration": 5.96}, {"text": "traveled with them, and the results were nothing less than", "start": 201.41, "duration": 3.139}, {"text": "catastrophic.", "start": 205.16, "duration": 1.109}, {"text": "20 years after Columbus arrived in Cuba with his 8 pigs the governor of Cuba wrote to the Spanish crown,", "start": 206.269, "duration": 5.54}, {"text": "reporting that there were 30,000 hogs on the island.", "start": 212.299, "duration": 2.809}, {"text": "Now this may be an exaggeration, but reports from the Caribbean frequently mentioned the sheer number of the beasts,", "start": 215.15, "duration": 5.99}, {"text": "and locals had also discovered a love for pork, and therefore increasingly raised the creatures themselves,", "start": 221.51, "duration": 5.66}, {"text": "and then there were the escapees. See what also sets pigs apart is their intelligence.", "start": 227.6, "duration": 5.389}, {"text": "Smarter than even dogs, today's research shows that pigs can plan, think, and even, play computer games,", "start": 233.45, "duration": 6.229}, {"text": "that makes them talented escape artists, and within years of Spanish settlement hordes of pigs were living wild on the Caribbean islands, with no", "start": 240.17, "duration": 8.0}, {"text": "natural predators and perfectly suited to the native environment.", "start": 248.17, "duration": 2.759}, {"text": "They particularly thrived on native fruits which had evolved no defenses against large mammals, since there were no large mammals in their islands original ecosystems.", "start": 251.48, "duration": 7.999}, {"text": "Huh, fair point, Zoe. Well, Rob knows history like no one else and I read it like a champ if I do say so myself.", "start": 261.109, "duration": 5.86}, {"text": "Ecological systems are a bit out of our range of expertise.", "start": 267.699, "duration": 2.81}, {"text": "You know, I really wish we knew an ecology expert who could explain why pigs completely wrecked native ecosystems.", "start": 270.51, "duration": 5.969}, {"text": "[crumbling sound]", "start": 276.48, "duration": 3.46}, {"text": "[pig squeals] Ahhh, what in the day two-pig-in-the-city..!?", "start": 279.94, "duration": 4.06}, {"text": "TierZoo: Ask and ye shall receive, Matt.\nMatt: Hey TierZoo. I'm so happy you're here!", "start": 284.16, "duration": 4.86}, {"text": "Matt: But why did you have to bore a hole through my wall right there? Haha up top zinger! No? I'll, nope, okay,", "start": 289.02, "duration": 6.0}, {"text": "Matt: I'll just put that back.\nTierzoo: Because it sounded like you wanted to know more about the specific attributes that made hogs OP throughout history.", "start": 295.2, "duration": 5.88}, {"text": "Matt: Oh, I do want that very much. But I also didn't really want to have to redraw that white wall.", "start": 301.08, "duration": 4.3}, {"text": "Matt: Sorry, Nick!", "start": 305.56, "duration": 0.96}, {"text": "TierZoo: In that case Once you're done with this video come check out my video over on my channel", "start": 306.88, "duration": 3.5}, {"text": "TierZoo: TierZoo where we'll discuss all the base stats, special abilities, and unique traits, that have given pigs a competitive edge across all of the", "start": 310.48, "duration": 7.04}, {"text": "Game of Life's different expansions, from the Anthropocene's wild boar to the Eocene's 'hell pig'", "start": 317.52, "duration": 5.02}, {"text": "Matt: Yeah! Wait? What is a 'hell pig'?", "start": 322.54, "duration": 3.12}, {"text": "[Rumbling steps]\nMatt: Huh...", "start": 325.66, "duration": 2.36}, {"text": "[Deep pig squeal]", "start": 328.02, "duration": 2.02}, {"text": "TierZoo: You'll have to come watch the video to find out. See you over there everyone. Let's roll, Digby.", "start": 330.16, "duration": 3.96}, {"text": "[Rumbling steps]", "start": 334.12, "duration": 1.22}, {"text": "Matt: Thanks TierZoo! Oh man, it's always nice when friends stop by. Where was I? Oh, yeah,", "start": 335.34, "duration": 5.32}, {"text": "resistant to snake venom, a thick hide that shrugs off most attackers, and the ability to devastate native plants and wildlife,", "start": 341.08, "duration": 5.9}, {"text": "that's our friend the pig.", "start": 347.289, "duration": 1.921}, {"text": "Within decades wild pigs were destroying Caribbean ecosystems driving native plants and animals to the brink of extinction.", "start": 349.21, "duration": 6.679}, {"text": "This in turn had dire consequences for the native people, whose ways of life depended on those plants and animals.", "start": 356.229, "duration": 6.47}, {"text": "But the damage was not confined to the islands, in 1539,", "start": 362.8, "duration": 3.77}, {"text": "Conquistador Hernando de Soto landed in what's now Florida. Determined to set off west and explore this new continent. He brought with him:", "start": 367.06, "duration": 7.309}, {"text": "13 pigs. The start, he hoped, of a new farming settlement.", "start": 374.64, "duration": 3.38}, {"text": "In fact, he was so protective of these animals that he refused to let his soldiers eat them,", "start": 378.18, "duration": 5.4}, {"text": "and instead they built rafts for the beasts whenever the expedition crossed the river.", "start": 383.8, "duration": 4.26}, {"text": "Three years later, when de Soto's men secretly dropped his corpse in the Mississippi River,", "start": 388.2, "duration": 4.62}, {"text": "which is a long and separate story involving claiming to be a sun god, those 13 pigs had turned into 700,", "start": 393.0, "duration": 6.34}, {"text": "and that's not counting those that soldiers ate, or that escaped, forming a population of feral hogs that are still to this day causing", "start": 399.72, "duration": 7.72}, {"text": "ecological damage in the United States. In fact in many places like in the American Southwest,", "start": 407.74, "duration": 4.55}, {"text": "conquistadors reported that populations of feral pigs actually arrived before they did. What that meant", "start": 413.05, "duration": 5.6}, {"text": "was that a biological invasion preceded the Spanish one. Groups of unfamiliar animals", "start": 418.65, "duration": 4.83}, {"text": "destroyed native environments,", "start": 423.85, "duration": 1.47}, {"text": "disrupting local wildlife and the societies that depended on them. More damaging still was the fact that this wave of unfamiliar animals", "start": 425.32, "duration": 6.799}, {"text": "also carried unfamiliar diseases. Pigs can catch and carry a number of diseases that can transfer to humans,", "start": 432.49, "duration": 6.35}, {"text": "most notably the flu and their bacteria and parasites", "start": 438.84, "duration": 3.119}, {"text": "contaminate any river lake they defecate in.", "start": 442.51, "duration": 2.209}, {"text": "The result was an epidemic. A century after De Soto stealthy funeral on the river, a French expedition entered the Mississippi Valley to find a", "start": 445.24, "duration": 7.76}, {"text": "population one-tenth the size of what De Soto described. The cities, the villages,", "start": 453.19, "duration": 5.389}, {"text": "all wiped out. Was that from pig-borne diseases? Maybe, but it's impossible to be sure.", "start": 458.8, "duration": 5.15}, {"text": "But the pigs use as a tool of conquest was no accident because they were also a military asset.", "start": 464.46, "duration": 5.84}, {"text": "A mobile food source that could be herded behind the troops pigs served an essential logistical role in the campaigns that toppled the largest empires of the Americas.", "start": 470.48, "duration": 8.38}, {"text": "Cortes brought thousands of pigs with him when he toppled the Aztec empire,", "start": 479.68, "duration": 3.71}, {"text": "and Francisco Pizarro, who ironically might have been a swine herd early in life,", "start": 483.7, "duration": 3.619}, {"text": "marched into the Andes with a great herd of hogs at his back.", "start": 487.81, "duration": 3.38}, {"text": "Determined to strip the Inca Empire of its treasure, which leads us nicely to the fact that next week", "start": 491.59, "duration": 5.869}, {"text": "we're going to start our five-part series on the rise and fall of the Inca Empire.", "start": 497.46, "duration": 4.619}, {"text": "Spoiler Alert: there gonna be lots of mummies and finally,", "start": 502.78, "duration": 3.76}, {"text": "thanks again to TierZoo for paying us a visit, lending us their ecological expertise,", "start": 506.54, "duration": 3.42}, {"text": "and reminding us that history is more than just about humans.", "start": 510.12, "duration": 3.52}, {"text": "I'm gonna head over to their channel to learn more about pig pecking orders.", "start": 513.659, "duration": 3.42}, {"text": "By I guess just going through this precarious hog hole here.", "start": 517.08, "duration": 3.539}, {"text": "Ah, but you! You just to be safe should click the link in the description below and I'll see you over there.", "start": 520.74, "duration": 5.369}, {"text": "Actually, let's race, ready, go!", "start": 526.56, "duration": 2.9}, {"text": "I'm okay!", "start": 531.22, "duration": 1.74}, {"text": "Um, catch you soon!", "start": 532.96, "duration": 1.83}, {"text": "Once again,", "start": 534.79, "duration": 0.83}, {"text": "thank you to World of Tanks for sponsoring this episode.", "start": 535.62, "duration": 2.07}, {"text": "With realistic combat situations, continuous updates, and over 500 vehicles to choose from, you can really go 'hog wild'.", "start": 538.1, "duration": 6.9}, {"text": "Now, that that pig joke not worked for you? Okay. Well just be sure to keep your bore evacuator clean. tank jokes", "start": 545.44, "duration": 6.1}, {"text": "Tank jokes, we got them.", "start": 551.54, "duration": 1.74}, {"text": "Oh boy. That was bad. Quick! Ah, show the game!", "start": 553.46, "duration": 2.54}, {"text": "So if that looks up your alley,", "start": 561.22, "duration": 1.71}, {"text": "download the game for free at extratanks.com and use the invite code EXTRATANKS1 to claim your $15 starter pack.", "start": 562.93, "duration": 6.59}, {"text": "Special thanks to educational tier patrons Ahmed Ziad Turk and Joseph Blaim.", "start": 571.3, "duration": 4.19}, {"text": "You", "start": 590.63, "duration": 2.0}]