[{"text": "I'm the type of person who gets addicted to activities once I develop an interest in them.", "start": 4.82, "duration": 5.14}, {"text": "And no, I don't mean substance abuse, and if you are in that situation, please consider getting some help if necessary.", "start": 9.98, "duration": 5.54}, {"text": "But yeah, I can't ever really do anything... *casually*.", "start": 16.2, "duration": 3.64}, {"text": "I either don't like something and avoid it completely,", "start": 20.02, "duration": 2.32}, {"text": "Or I love it and obsessively indulge in the activity until my family and friends find me disheveled in my room after not seeing--", "start": 22.62, "duration": 6.42}, {"text": "or hearing for me for days, and the only word that can communicate are, \"I'm out of instant noodles\".", "start": 29.04, "duration": 4.56}, {"text": "That's kind of what happened when I first got into Dance Dance Revolution.", "start": 34.06, "duration": 3.86}, {"text": "I initially thought it looked dumb and didn't look all that fun or challenging.", "start": 37.92, "duration": 4.22}, {"text": "And then one year, my family and I went to Disney World,  and during the day", "start": 42.3, "duration": 3.2}, {"text": "we stopped by an arcade in one of the amusement parks, and there was a Disney-themed DDR machine.", "start": 45.5, "duration": 4.76}, {"text": "And these two dudes were playing a relatively difficult song, at the time.", "start": 50.54, "duration": 3.86}, {"text": "I say at the time because the most difficult songs these days", "start": 54.42, "duration": 3.24}, {"text": "are only possible if you vibrate from arrow to arrow. (lol)", "start": 57.76, "duration": 2.8}, {"text": "I was so impressed by how they were both playing in sync,", "start": 60.92, "duration": 2.84}, {"text": "And how fast their feet were moving!", "start": 63.76, "duration": 1.62}, {"text": "Later that year, I asked my parents for a Playstation 2,", "start": 65.38, "duration": 2.9}, {"text": "and the DDR game and the crappy soft mats.. (-_-)", "start": 68.28, "duration": 3.48}, {"text": "And you guys know what I'm talking about.", "start": 71.76, "duration": 2.0}, {"text": "I skipped the beginner difficulty and started off on light because I wanted to be hardcore P-RONTO!", "start": 74.0, "duration": 5.14}, {"text": "One day, I found this video online, way before the YouTube days, and if you're an old-school DDR player you might remember", "start": 79.22, "duration": 5.44}, {"text": "\"JSB versus Reflex\" playing the legend of Max on heavy.", "start": 84.68, "duration": 4.12}, {"text": "And it might be less impressive now,", "start": 88.88, "duration": 1.66}, {"text": "But godDAYUM, watching that made me realize how hardcore DDR could be.", "start": 90.54, "duration": 4.88}, {"text": "And then I saw this other player named \"Sketch\" do  Paranoia Survivor Max Oni (Challenge), which was considered the hardest song at that time.", "start": 95.42, "duration": 6.76}, {"text": "He did it backwards, and I was like holy shhh*t, and at that point on DDR became a part of my life.", "start": 102.72, "duration": 6.04}, {"text": "It was a game addiction that my parents didn't mind because at least I was being active.", "start": 109.0, "duration": 4.72}, {"text": "When it comes to music, I've gone through numerous phases growing up.", "start": 113.78, "duration": 3.58}, {"text": "When I was a kid, I listened to a lot of rock and its subgenres.", "start": 117.36, "duration": 3.28}, {"text": "In high school, I listened to more hip-hop. (did he just dab? ugh Dom srsly)", "start": 120.64, "duration": 2.58}, {"text": "When I was in university, It was a mixture of dubstep, Electro house, and some K-Pop.", "start": 123.28, "duration": 4.28}, {"text": "And now it's pretty much an amalgamation of all of that, plus Japanese and anime music, which has kind of been in my life", "start": 127.74, "duration": 5.5}, {"text": "the entire time. I like to think I don't have a specific genre of music that I would call my \"favorite\".", "start": 133.34, "duration": 4.98}, {"text": "I tend to just hear something that I like and have it on repeat for 12 days straight, or until I find a new", "start": 138.32, "duration": 5.32}, {"text": "song that would repeat the cycle.", "start": 143.64, "duration": 1.66}, {"text": "Music is quite timeless for me, and certain songs contain specific memories embedded within it.", "start": 145.44, "duration": 4.44}, {"text": "Maybe I played a song and repeat to make myself feel better after a breakup,", "start": 150.06, "duration": 3.44}, {"text": "or sometimes to make myself feel worse depending on whether I was feeling masochistic that day;", "start": 153.5, "duration": 4.3}, {"text": "Maybe it was my power song that helped me get to be final assignments when I was in university,", "start": 157.9, "duration": 4.399}, {"text": "Or maybe it was a song that helped put me to sleep for those nights of Insomnia", "start": 162.3, "duration": 3.94}, {"text": "One hobby I recently picked up was knitting, and it's now become a part of my daily routine.", "start": 166.24, "duration": 4.18}, {"text": "Apparently they teach you these things as a kid, and I guess I just missed out on it or never thought I'd enjoy it.", "start": 171.0, "duration": 5.34}, {"text": "As mundane of an activity as it can be, I sometimes enjoy repetitive actions that contribute towards a larger product.", "start": 176.82, "duration": 6.16}, {"text": "I know some of you are saying,\"HAH! Knitting?", "start": 183.0, "duration": 2.82}, {"text": "How about a more manly pastime like football, or weightlifting, or drinking BEER? YEA! TESTOSTERONE!!1!\"", "start": 185.84, "duration": 6.66}, {"text": "You know, one day, you're gonna be stranded in the middle of nowhere", "start": 192.84, "duration": 2.36}, {"text": "And it'll just be us two with a ball of yarn and the frigid night approaching.", "start": 195.21, "duration": 3.569}, {"text": "Don't come to me when your nipples start stabbing holes through your shirt from the cold my shoulder turning away.", "start": 198.88, "duration": 4.56}, {"text": "Here's a football. You can skin it and keep your ego warm.", "start": 203.92, "duration": 3.1}, {"text": "Netflix and knit! LET'S GO!", "start": 207.52, "duration": 2.0}, {"text": "Circling back from DDR, I think video games are probably the worst for me when it comes to addictions,", "start": 209.52, "duration": 5.4}, {"text": "whether they're on PC, console or even mobile. And I'm sure it's the same for a lot of you.", "start": 214.92, "duration": 5.66}, {"text": "Let me just have a look-see here and, uh, give you guys a sample of how much time I've spend on video games.", "start": 220.58, "duration": 5.3}, {"text": "And don't think of this as a challenge for you to share how much more you've played the game.", "start": 225.88, "duration": 3.84}, {"text": "I'm well aware that some of you see less daylight than I do.", "start": 229.72, "duration": 3.26}, {"text": "ARK:Survival Evolved- 249 hours, and I did all that in a month.", "start": 233.2, "duration": 4.96}, {"text": "GTA V- 244 hours.", "start": 238.16, "duration": 2.92}, {"text": "Team Fortress 2- 383 hours.", "start": 241.08, "duration": 3.7}, {"text": "League of Legends- 835 hours.", "start": 244.78, "duration": 3.72}, {"text": "Maple St-- (I'm genuinely curious as to what this game is)", "start": 248.8, "duration": 1.99}, {"text": "W-We don't speak of that.", "start": 251.28, "duration": 1.42}, {"text": "\"Why? What's there?\"", "start": 252.86, "duration": 1.18}, {"text": "Nothing. Those days are behind us. And we don't look back.", "start": 254.24, "duration": 4.12}, {"text": "(is it some exclusively Canadian role-play game? That's my guess :T)", "start": 259.0, "duration": 0.78}, {"text": "\"Okay.\"", "start": 260.74, "duration": 1.04}, {"text": "That's just a tease of the amount of gaming I've done. If there was a way I could calculate how much I played Smash,", "start": 261.94, "duration": 4.74}, {"text": "I'd include it, but you get the picture. I ain't no filthy casual! And I know some of you are giving me that concerning tone:", "start": 266.68, "duration": 6.5}, {"text": "\"Oh My GoD dOm! You're wasting your life away  with ViDeO gAmEs.", "start": 273.24, "duration": 5.14}, {"text": "Why don't you do something more PrOdUcTiVe.\" And my rebuttal to that is, video games are productive!", "start": 278.48, "duration": 6.74}, {"text": "I'm sure other debaters could put it into better words,", "start": 285.22, "duration": 2.6}, {"text": "but I believe video games have shaped a good chunk of who I am today.", "start": 287.84, "duration": 3.56}, {"text": "From the captivating stories to the mental exercises that video games have provided for me,", "start": 291.64, "duration": 4.7}, {"text": "I can't say that they've ever been a waste of time...", "start": 296.44, "duration": 2.8}, {"text": "...except Cookie Clicker.", "start": 299.24, "duration": 1.08}, {"text": "Oh my goodness, the grandmas.", "start": 300.96, "duration": 2.48}, {"text": "And I've met so many great people through video games with the convenience of online multiplayer capabilities.", "start": 303.44, "duration": 4.68}, {"text": "What better way to bond and become closer with people than to play together and work towards a similar goal?", "start": 308.54, "duration": 4.91}, {"text": "I'll be it, virtual.", "start": 313.45, "duration": 1.93}, {"text": "Unless of course you're playing with elitist prepubescent strangers who only get massive erections from dominating other players in a game,", "start": 315.38, "duration": 6.34}, {"text": "And any deviation from that justifies their rage and insults towards your mother.", "start": 321.94, "duration": 4.18}, {"text": "*cOuGh* solo queue", "start": 326.12, "duration": 1.34}, {"text": "But no matter how much I indulge in it, I think drawing an animation will be an addiction I'll never get over (thank goodness)", "start": 327.98, "duration": 5.48}, {"text": "I mean, of course, there will be times when I'll get tired from working on projects,", "start": 333.46, "duration": 3.64}, {"text": "And have the occasional writer's and artist's block that might take me days or weeks to overcome.", "start": 337.1, "duration": 5.09}, {"text": "But whenever I get back into the working mood; whenever I put that pencil to the paper, or stylus to the tablet,", "start": 342.19, "duration": 5.76}, {"text": "I remember why I enjoy animating so much and just having that ability to create.", "start": 347.95, "duration": 4.229}, {"text": "This whole time, I've been calling them addictions, but really they're just synonymous to hobbies.", "start": 352.76, "duration": 5.299}, {"text": "But I guess for something to become a hobby, you first have to immerse yourself in it with enthusiastic devotion.", "start": 358.31, "duration": 5.54}, {"text": "And if you're lacking that passion for what you do, then, isn't that considered a waste of time?", "start": 364.1, "duration": 6.02}, {"text": "Know what else is addicting? Collecting a bunch of anime merch via Loot Anime!", "start": 372.96, "duration": 4.06}, {"text": "And it's convenient because it gets delivered straight to you every month.", "start": 377.62, "duration": 3.14}, {"text": "If you guys head over to lootcrate.com/Domics (link below) you can enter the code Domics,", "start": 381.12, "duration": 5.16}, {"text": "D-O-M-I-C-S, to get 10% on new subs.", "start": 386.28, "duration": 3.68}, {"text": "And then it'll be $25 for the following months. For every crate you can get up to 8 items ranging from:", "start": 390.28, "duration": 5.98}, {"text": "apparel, manga, posters, figurines, and more.", "start": 396.26, "duration": 3.32}, {"text": "I recently got my cutting-edge themed crate featuring a berserk sword letter opener, a Gin Tama wall scroll, the first volume of Sword Art Online Progressive,", "start": 400.02, "duration": 9.2}, {"text": "Bleach lounge pants, and a You-May  blade charm. (I know I spelled these wrong. I don't watch anime, sorry)", "start": 409.22, "duration": 2.84}, {"text": "Unfortunately these were last month's items,", "start": 412.06, "duration": 2.68}, {"text": "but don't fret! You can look forward to this month's galaxy-themed crate, featuring items from Sailor Moon, Cowboy Bebop,", "start": 414.75, "duration": 6.299}, {"text": "Robo Tech and Space Patrol Luluco, and you have until the 27th at  9p.m. PST to order.", "start": 421.46, "duration": 6.78}, {"text": "Once again, that's lootcrate.com/Domics with the code \"Domics\" to save 10% on new subscriptions.", "start": 428.24, "duration": 6.36}, {"text": "Link in the description!", "start": 434.6, "duration": 1.42}, {"text": "Eeeenjoy!", "start": 436.02, "duration": 1.22}]