[{"text": "When you look up at the night sky, and if\nyou happen to live far from city lights, you", "start": 3.02, "duration": 4.18}, {"text": "can see thousands of stars. It seems like\nthe sky is crammed shoulder to shoulder with", "start": 7.21, "duration": 4.44}, {"text": "them. And you’re only seeing the tiniest\nfraction of stars there are; billions more", "start": 11.65, "duration": 4.78}, {"text": "exist that are too faint to see with just\nyour eyes.", "start": 16.43, "duration": 2.74}, {"text": "As you ponder this incredible number, a natural\nthought arises: Are there planets circling", "start": 19.17, "duration": 4.69}, {"text": "those stars, too? And are any of them like\nEarth?", "start": 23.86, "duration": 3.13}, {"text": "People just like you and me have wondered\nabout this for thousands of years. And right", "start": 26.99, "duration": 4.0}, {"text": "now, today, we can answer that question.", "start": 30.99, "duration": 2.82}, {"text": "And the answer is: yes.", "start": 33.81, "duration": 2.0}, {"text": "Our Sun is orbited by a lovely array of planets.\nAnd they’re wildly diverse — big, small,", "start": 46.76, "duration": 5.44}, {"text": "airless, rocky, gaseous, hot, cold, and more.\nThat makes you think that maybe forming planets", "start": 52.2, "duration": 5.57}, {"text": "is easy, with so many varieties to choose\nfrom. Even if making planets is hard, there", "start": 57.77, "duration": 4.8}, {"text": "are so many stars in the sky that it’s hard\nto believe our Sun is the only one that’s", "start": 62.57, "duration": 4.48}, {"text": "been able to pull this trick off.", "start": 67.05, "duration": 1.67}, {"text": "Astronomers have fretted over this for a long\ntime, but trying to find such planets is hard.", "start": 68.72, "duration": 5.14}, {"text": "The biggest problem is, any such planets would\nbe faint, far away, and sitting right on top", "start": 73.86, "duration": 5.12}, {"text": "of their parent star. Being able to see one\nin a telescope would be like trying to spot", "start": 78.99, "duration": 3.86}, {"text": "a firefly sitting next to searchlight.", "start": 82.85, "duration": 2.32}, {"text": "So if you can’t spot a planet like that\ndirectly, maybe you can spot it indirectly.", "start": 85.17, "duration": 4.62}, {"text": "Imagine two kids, one big and one small, facing\neach other. They clasp hands and start to", "start": 89.79, "duration": 5.43}, {"text": "spin around. As they do, the little kid, who\nweighs less, will make a big circle, and the", "start": 95.229, "duration": 5.8}, {"text": "bigger kid will make a small circle.", "start": 101.029, "duration": 2.02}, {"text": "The same would be true of a star and planet.\nAs the planet orbits the star, it makes a", "start": 103.049, "duration": 4.351}, {"text": "big circle (or ellipse). But the planet has\ngravity, too, and it tugs on the star. That", "start": 107.409, "duration": 4.8}, {"text": "means the star will make a small circle—what’s\ncalled reflexive motion.", "start": 112.209, "duration": 3.88}, {"text": "For a long time, astronomers looked really\nhard for this motion in nearby stars.", "start": 116.089, "duration": 4.5}, {"text": "But it turns out that indirect effect is also too small to\nsee. There were a few false alarms, but no real planets.", "start": 120.589, "duration": 6.231}, {"text": "Then, in 1992, everything changed. Astronomers\nAleksander Wolszczan and Dale Frail made a", "start": 126.82, "duration": 6.32}, {"text": "shocking announcement: They found not just\none planet, but two orbiting a pulsar, the", "start": 133.15, "duration": 6.16}, {"text": "dead remnant of a star that had exploded.", "start": 139.31, "duration": 2.35}, {"text": "This was really bizarre: When a star explodes,\nit’s a catastrophic event that should destabilize", "start": 141.66, "duration": 5.56}, {"text": "any orbiting planets. It’s the LAST place anyone would\nhave thought to find them. However, follow up work", "start": 147.23, "duration": 5.01}, {"text": "quickly confirmed that the planets did indeed exist,\nand in fact a third one was found a few years later.", "start": 152.24, "duration": 5.78}, {"text": "The first true alien planets had been found.\nOfficially, we call them exoplanets, which,", "start": 158.02, "duration": 5.08}, {"text": "you have to admit, is pretty cool.", "start": 163.1, "duration": 2.06}, {"text": "While this was an incredible discovery, it\nwas still a little unsatisfying.", "start": 165.16, "duration": 4.2}, {"text": "For one thing, pulsars are really weird, and for\nanother it looked like those planets may have", "start": 169.36, "duration": 4.34}, {"text": "formed around the pulsar after the supernova explosion,\nfrom the material left over from the catastrophe.", "start": 173.7, "duration": 5.36}, {"text": "That’s nothing at all like our own solar\nsystem. And that still left the question open:", "start": 179.06, "duration": 4.4}, {"text": "Are there exoplanets orbiting SUN-LIKE stars?", "start": 183.46, "duration": 3.22}, {"text": "We didn’t have to wait long to find out.", "start": 186.68, "duration": 2.12}, {"text": "In 1995, Swiss astronomers Michel Mayor and\nDidier Queloz made a big announcement: They", "start": 188.8, "duration": 5.36}, {"text": "had found a planet orbiting the star 51 Peg, a star\nvery much like the Sun just 50 light years away.", "start": 194.16, "duration": 6.16}, {"text": "How did they do it? Well, remember those two\nkids holding hands and circling each other?", "start": 200.32, "duration": 4.74}, {"text": "Even though the wiggling back and forth of\nthe star is too small to measure, that doesn’t", "start": 205.06, "duration": 4.2}, {"text": "mean the effect is undetectable.", "start": 209.26, "duration": 1.78}, {"text": "As the host star of the exoplanets makes its\nlittle circle, sometimes it’s headed toward", "start": 211.04, "duration": 4.36}, {"text": "us, and sometimes away. That means that its\nlight will undergo a Doppler shift, and that", "start": 215.4, "duration": 4.94}, {"text": "CAN be detected. It’s not a big shift, and\ntakes some pretty fancy equipment to see it,", "start": 220.349, "duration": 4.48}, {"text": "but it’s measurable. That’s how Mayor\nand Queroz found their planet.", "start": 224.829, "duration": 3.56}, {"text": "And the planet they found, called 51 Peg b,\nis weird.", "start": 228.389, "duration": 3.791}, {"text": "For one thing, the orbital period turns out\nto be just a little over 4.23 days. That’s", "start": 232.189, "duration": 4.551}, {"text": "right, I said DAYS. That means the planet\nis seriously close to its parent star, just", "start": 236.75, "duration": 5.37}, {"text": "8 million km out. Compare that to Mercury,\nwhich is on average 55 million km from the Sun.", "start": 242.12, "duration": 6.1}, {"text": "Not only that, but the amount of Doppler shift\nin the star is related to the mass of the", "start": 248.22, "duration": 3.82}, {"text": "planet; a more massive planet pulls harder\non the star, making it move more quickly.", "start": 252.04, "duration": 4.28}, {"text": "They found the planet was at least half the\nmass of Jupiter, and probably more.", "start": 256.32, "duration": 4.16}, {"text": "That was a problem. According to planetary\nformation models, that wasn’t possible!", "start": 260.48, "duration": 4.8}, {"text": "You can’t form a planet that big that close\nto a star.", "start": 265.28, "duration": 3.18}, {"text": "Well, it turns out the models are probably\nright. The planet DIDN’T form that close.", "start": 268.46, "duration": 4.24}, {"text": "It probably formed farther out, just like\nJupiter did. And like Jupiter, it then moved,", "start": 272.7, "duration": 4.7}, {"text": "migrated inward toward the star as it interacted\nwith the disk of planet-forming material around", "start": 277.4, "duration": 4.98}, {"text": "the star. In our solar system, Jupiter didn’t\nget very far in its inward motion – it’s", "start": 282.389, "duration": 4.74}, {"text": "thought that interactions with Saturn put the brakes\non that, and pulled Jupiter out to where it is now.", "start": 287.129, "duration": 4.391}, {"text": "Apparently 51 Peg b didn’t have its own\nversion of Saturn pulling on it. Its inward", "start": 291.52, "duration": 4.899}, {"text": "spiral continued until it ran out of disk\nmaterial to interact with, which was very", "start": 296.419, "duration": 4.321}, {"text": "close indeed to the star. We call planets\nlike that “hot Jupiters”.", "start": 300.74, "duration": 3.59}, {"text": "Once 51 Peg b was found, other teams began\nlooking for short-period planets, and within", "start": 304.33, "duration": 5.299}, {"text": "a few years several more had been found, many\nof them hot Jupiters just like 51 Peg b.", "start": 309.629, "duration": 4.951}, {"text": "Now mind you, at first there was a LOT of\ndoubt and skepticism in the community about", "start": 314.58, "duration": 4.319}, {"text": "these exoplanets discoveries. A lot of other\nphenomena could masquerade as planets, like", "start": 318.899, "duration": 4.61}, {"text": "starspots, or pulsating stars, or background\nstars messing up the measurements.", "start": 323.509, "duration": 4.22}, {"text": "Scientists discussed these possibilities vociferously\n— as well they should. Science is all about", "start": 327.729, "duration": 5.4}, {"text": "not fooling ourselves. A good scientist WANTS\nother scientists to try to poke holes in their", "start": 333.129, "duration": 5.35}, {"text": "ideas. It’s disappointing to be wrong, but\nif we are we want to know.", "start": 338.479, "duration": 4.131}, {"text": "That all changed in 1999. A planet called\nHD 209458b had been discovered on a very short", "start": 342.61, "duration": 6.959}, {"text": "orbit around its star, taking just 3.5 days.\nAs luck would have it, from Earth we see the", "start": 349.569, "duration": 5.791}, {"text": "planet’s orbit edge-on. That means once per\norbit it passes directly in front of its star.", "start": 355.36, "duration": 5.04}, {"text": "This event is called a transit, and when the\nplanet transits the star it blocks a little", "start": 360.4, "duration": 4.699}, {"text": "bit of the star’s light, and that means\nwe can detect a dip in the star’s brightness.", "start": 365.099, "duration": 4.49}, {"text": "And sure enough, that dip was found. HD 209458b\nwas the first independent confirmation of", "start": 369.589, "duration": 5.91}, {"text": "an exoplanet, and pretty much everyone was\non the bandwagon after that.", "start": 375.499, "duration": 3.73}, {"text": "The beauty of transiting exoplanets is that the\namount of starlight blocked tells you how", "start": 379.229, "duration": 4.011}, {"text": "big the planet is; a big planet blocks more\nlight. If we know the planets’ mass from", "start": 383.24, "duration": 4.789}, {"text": "the star’s Doppler shift, we can use the\nplanet’s size to calculate its density.", "start": 388.029, "duration": 4.62}, {"text": "This is important: A gas giant like Jupiter\nhas a low density, and a rocky metallic planet", "start": 392.649, "duration": 4.571}, {"text": "like Earth has a very high density. Without even\nbeing able to see the planet directly, we", "start": 397.22, "duration": 5.2}, {"text": "can already start to determine what it’s\nlike physically.", "start": 402.42, "duration": 2.44}, {"text": "In 2009, NASA launched a space-based telescope\nnamed Kepler, designed specifically to stare", "start": 404.86, "duration": 5.779}, {"text": "at 150,000 stars to detect that telltale dip\nin light indicating exoplanet transits.", "start": 410.639, "duration": 5.74}, {"text": "And oh my, did it work. By early 2015, Kepler\nfound its 1000th confirmed exoplanet, and", "start": 416.38, "duration": 6.16}, {"text": "there are 500 more confirmed from ground-based\ntelescopes. That’s more than 1500 planets!", "start": 422.54, "duration": 5.98}, {"text": "And we have well over 3000 more candidates\nfrom Kepler awaiting confirmation.", "start": 428.52, "duration": 4.46}, {"text": "All these planets have been found using indirect\nmethods. What about actually seeing them,", "start": 432.98, "duration": 4.731}, {"text": "getting photos of them? That’s hard, because planets\nare so faint. But it’s not impossible.", "start": 437.711, "duration": 5.48}, {"text": "In 2004, the first picture of an exoplanet\nwas released: 2M1207b, a planet with five", "start": 443.2, "duration": 7.06}, {"text": "times the mass of Jupiter. It orbits a brown\ndwarf, a peculiar kind of low mass star that", "start": 450.27, "duration": 4.759}, {"text": "we’ll learn more about in a future episode.\nIt’s a young system, which makes it easier", "start": 455.029, "duration": 3.38}, {"text": "to see: The planet is still glowing hot from\nits formation, and it appears a lot brighter", "start": 458.409, "duration": 4.78}, {"text": "using a telescope that can see in the infrared.", "start": 463.189, "duration": 2.88}, {"text": "About a dozen other planets have been seen\nthis way, too. My favorite is the planet orbiting", "start": 466.069, "duration": 4.11}, {"text": "the star Beta Pictoris. It has seven times\nthe mass of Jupiter, and orbits the star in", "start": 470.179, "duration": 4.48}, {"text": "about 20 years—and we’ve actually seen\nit move! Images taken a few years apart actually", "start": 474.659, "duration": 5.81}, {"text": "show the planet in different positions around the\nstar, confirming its orbital motion. That is incredible.", "start": 480.469, "duration": 6.291}, {"text": "Taking photos of these planets is still a\ndaunting task, which is why so few have been", "start": 486.76, "duration": 3.92}, {"text": "seen. But we’re getting better at this,\nand as new technology comes along we’ll", "start": 490.689, "duration": 3.96}, {"text": "get more pictures of exoplanets and learn\neven more about them.", "start": 494.649, "duration": 3.4}, {"text": "The sheer variety of exoplanets is staggering.\nHot Jupiters are the easiest to find, because", "start": 498.049, "duration": 5.051}, {"text": "they’re massive and fast, making their signal\neasier to detect. But as the techniques have", "start": 503.1, "duration": 4.08}, {"text": "improved, planets of lower mass have been\nseen; the smallest exoplanet found is smaller", "start": 507.189, "duration": 5.241}, {"text": "than Mercury, and not much bigger than Earth’s\nMoon. We’ve seen planets bigger than Earth", "start": 512.43, "duration": 4.669}, {"text": "but smaller than Neptune, called “Super\nEarths”. About 500 multiple planet systems", "start": 517.099, "duration": 4.591}, {"text": "have been found, too, including one with seven\nplanets.", "start": 521.69, "duration": 3.269}, {"text": "We’ve found them around every kind of star,\ntoo. Exoplanets have been detected around", "start": 524.959, "duration": 4.5}, {"text": "stars like the Sun as well as tiny, cool red\ndwarfs; hot, massive blue stars; and even", "start": 529.459, "duration": 4.971}, {"text": "red giants, stars nearing the ends of their\nlives. One exoplanet system announced in 2015", "start": 534.43, "duration": 5.079}, {"text": "is incredibly old; the host star is 11 billion\nyears old! When our solar system was just", "start": 539.509, "duration": 5.89}, {"text": "beginning to form, these planets were already over\nsix billion years old—older than our solar system is now.", "start": 545.399, "duration": 6.5}, {"text": "We’ve even seen planets orbiting binary\nstars, making Star Wars seem a lot closer", "start": 551.9, "duration": 5.02}, {"text": "to home than being in a galaxy far, far away.", "start": 556.92, "duration": 2.719}, {"text": "We’ve seen so many exoplanets now that we\ncan extrapolate a bit and get some numbers.", "start": 559.639, "duration": 4.24}, {"text": "The results are staggering: In our galaxy\nalone, there may be hundreds of billions of", "start": 563.879, "duration": 5.34}, {"text": "planets. In fact, planets may outnumber stars\nin the sky.", "start": 569.22, "duration": 4.14}, {"text": "Now, if we’ve seen planets as big as Jupiter,\nand as small as Mercury, then we must have", "start": 573.36, "duration": 5.08}, {"text": "seen planets around the same size as Earth,\nright?", "start": 578.44, "duration": 2.4}, {"text": "Yes. Yes, we have. We’ve actually found\nhundreds of them so far, it looks like making", "start": 580.84, "duration": 5.48}, {"text": "planets the same size as ours is pretty easy\nfor stars to do.", "start": 586.329, "duration": 3.82}, {"text": "But Earth-SIZED is one thing. Earth-LIKE is\nanother. How many of these planets might actually", "start": 590.149, "duration": 4.96}, {"text": "be habitable? That is, at the right distance\nfrom their star to have Earth-like conditions,", "start": 595.109, "duration": 4.851}, {"text": "where liquid water could exist on their surface?", "start": 599.97, "duration": 2.19}, {"text": "We’re not sure. But from what we’ve seen\nso far, it looks like the galaxy may have", "start": 602.16, "duration": 4.26}, {"text": "more than 10 billion Earth-like planets.", "start": 606.42, "duration": 2.78}, {"text": "Ten. Billion. And maybe a lot more than that.", "start": 609.2, "duration": 3.68}, {"text": "Now I want to be careful here: We don’t\nknow what kind of atmospheres these planets", "start": 612.88, "duration": 4.06}, {"text": "will have, or what they’re composed of.\nDo the planets have magnetic fields strong", "start": 616.949, "duration": 3.81}, {"text": "enough to prevent solar wind from eroding\naway their atmosphere? Do they even have an", "start": 620.759, "duration": 3.94}, {"text": "atmosphere, let alone liquid water?", "start": 624.7, "duration": 2.04}, {"text": "We don’t know. But still, there are a LOT of\nplanets out there. There could very well be a twin", "start": 626.74, "duration": 5.7}, {"text": "of Earth orbiting a star not too far away. And over the\nwhole galaxy? We could be part of a very large family.", "start": 632.44, "duration": 6.72}, {"text": "After all this time, we finally have an answer to one of\nthe biggest questions we’ve ever asked in astronomy:", "start": 639.16, "duration": 5.88}, {"text": "The sky is filled with planets.", "start": 645.04, "duration": 2.799}, {"text": "Today you learned that planets orbiting other\nstars exist and can be detected with a variety", "start": 647.839, "duration": 4.141}, {"text": "of methods. Nearly 2000 have been found so\nfar. The most successful method is using transits,", "start": 651.98, "duration": 5.76}, {"text": "where a planet physically passes in front\nof its parent star, producing a measurable", "start": 657.74, "duration": 3.81}, {"text": "dip in the star’s light. Another way is to measure\nthe Doppler shift in a star’s light due", "start": 661.55, "duration": 4.399}, {"text": "to reflexive motion as the planet orbits.\nExoplanets appear to orbit nearly every kind", "start": 665.949, "duration": 4.69}, {"text": "of star, and we’ve even found planets that\nare the same size as Earth. We think there", "start": 670.639, "duration": 4.601}, {"text": "may be many billions of Earth-like planets\nin our galaxy.", "start": 675.24, "duration": 3.44}, {"text": "Crash Course Astronomy is produced in association\nwith PBS Digital Studios. Head over to their", "start": 678.68, "duration": 4.219}, {"text": "YouTube channel to catch even more awesome\nvideos. This episode was written by me, Phil", "start": 682.9, "duration": 4.86}, {"text": "Plait. The script was edited by Blake de Pastino,\nand our consultant is Dr. Michelle Thaller.", "start": 687.76, "duration": 4.36}, {"text": "It was directed by Nicholas Jenkins, edited\nby Nicole Sweeney, the sound designer is Michael", "start": 692.129, "duration": 4.78}, {"text": "Aranda, and the graphics team is Thought Café.", "start": 696.909, "duration": 2.411}]