[{"text": "Hey everyone! Today I've got a product that's a lot of things,", "start": 8.36, "duration": 6.22}, {"text": "it's cool, it's fun, it's brilliantly designed and well made- but it also has a dark side,", "start": 14.58, "duration": 4.92}, {"text": "dangerous tech from a dystopian near future with a user-friendly interface", "start": 19.5, "duration": 4.3}, {"text": "that can let anyone with a laptop or smartphone do serious harm to others.", "start": 23.8, "duration": 5.14}, {"text": "I'm going to set it up, discuss what's awesome about it, what bothers me, and how", "start": 28.94, "duration": 5.02}, {"text": "I think it could be handled better.", "start": 33.96, "duration": 2.2}, {"text": "First, build quality is fantastic, it's a block of aluminum.", "start": 36.16, "duration": 4.3}, {"text": "Very high quality, nothing feels cheap.", "start": 40.46, "duration": 2.48}, {"text": "I'd buy from WikedLasers in the future just based on the build quality here.", "start": 42.94, "duration": 4.42}, {"text": "The app runs on your phone or computer, needs to be tethered with a cable", "start": 47.36, "duration": 5.18}, {"text": "but I can live with that. There is no Linux version which is a disappointment.", "start": 52.54, "duration": 6.28}, {"text": "Once you're in the app they really give you your money's worth.", "start": 58.82, "duration": 3.38}, {"text": "Just page after page of functions and features. The games are my favorite,", "start": 62.2, "duration": 6.18}, {"text": "I'm not a huge fan of 8-bit games but I absolutely love the vector graphics aesthetics of the Lasercube games.", "start": 68.38, "duration": 8.14}, {"text": "They are basic but perfect for parties.", "start": 76.68, "duration": 3.22}, {"text": "I could absolutely see pointing this at the side of a building", "start": 79.9, "duration": 4.7}, {"text": "or just hanging a sheet between some trees for people to play.", "start": 84.6, "duration": 3.86}, {"text": "There's a great variety included as well.", "start": 88.74, "duration": 3.14}, {"text": "Same with patterns, just a huge number to keep things interesting and exciting at a party.", "start": 91.88, "duration": 6.0}, {"text": "Hardware and software- just top marks for quality and execution.", "start": 98.02, "duration": 5.56}, {"text": "Here, let's take a look with a bit less light so you can see it clearly.", "start": 103.58, "duration": 5.1}, {"text": "So if you want to use the cube, of course, you have to download the app first.", "start": 108.68, "duration": 6.3}, {"text": "You can download it in the Google Play store,", "start": 114.98, "duration": 2.74}, {"text": "or you can download their PC version\nfrom their web page.", "start": 117.72, "duration": 3.7}, {"text": "So we are on their web page, it's called WickedLaser and then you click Cube and scroll down", "start": 121.42, "duration": 6.34}, {"text": "and you can see get it on Google Play, download app for Windows,", "start": 127.76, "duration": 6.04}, {"text": "download app for Mac OS and then below there are a lot of other reviewers have a reviewed the laser cube.", "start": 133.8, "duration": 7.72}, {"text": "You can go check it out.", "start": 141.52, "duration": 5.58}, {"text": "Now let's go to their setup guide.", "start": 147.1, "duration": 4.18}, {"text": "So when you go to the WickedLaser start page they will give you a LaserCube setup and operation guide", "start": 151.28, "duration": 7.8}, {"text": "and then just go down and this is their Quick Start Guide", "start": 159.28, "duration": 3.6}, {"text": "you can also download user manuals for PC.", "start": 162.88, "duration": 3.3}, {"text": "Okay, let's open it I already have app over here.", "start": 166.18, "duration": 4.92}, {"text": "So you can see they have all these lists of the functions that you can use", "start": 171.1, "duration": 6.14}, {"text": "they have abstracts, visualizers, dancers, animation.", "start": 177.24, "duration": 3.58}, {"text": "They are all about the patterns you can see, for parties at home or a rave party whatever.", "start": 181.12, "duration": 6.8}, {"text": "You can do tons of things but first, you have to make sure the laser is on.", "start": 187.92, "duration": 5.3}, {"text": "So here you can see the laser at the corner is on right now.", "start": 193.7, "duration": 4.26}, {"text": "Okay, you can see on the wall I have this giant pattern. It's called fractal and you can lock the effect.", "start": 197.96, "duration": 10.88}, {"text": "This is just a microphone because you can also use your voice to control the pattern", "start": 210.16, "duration": 6.6}, {"text": "but that's the other thing.", "start": 216.76, "duration": 3.0}, {"text": "I already set the power to 65 because  I\nwant you to see better so the power is 65.", "start": 219.76, "duration": 6.4}, {"text": "Hue, color,  zoom. You zoom in to make\nit bigger you can enlarge the area", "start": 226.16, "duration": 7.26}, {"text": "or you can make it smaller like this.", "start": 233.44, "duration": 2.56}, {"text": "Of course, if it's this small you can not see anything.", "start": 236.0, "duration": 2.88}, {"text": "So I have to zoom in and let you see better,", "start": 238.88, "duration": 4.46}, {"text": "So that you can see it better.", "start": 243.8, "duration": 1.46}, {"text": "Circle Arc", "start": 245.26, "duration": 1.34}, {"text": "So on the wall you can see it's turning and turning.", "start": 248.7, "duration": 5.18}, {"text": "I will choose another pattern. Wavy, so I\njust select Wavy and now it's kind of", "start": 254.0, "duration": 5.24}, {"text": "distorted and waving on the wall.", "start": 259.24, "duration": 3.44}, {"text": "Color Drop.", "start": 262.68, "duration": 1.44}, {"text": "They have huge selection for you to choose.", "start": 268.6, "duration": 3.72}, {"text": "So basically on this list, you're going to select the patterns.", "start": 272.32, "duration": 8.76}, {"text": "And then on the other list on the right one,", "start": 281.08, "duration": 3.32}, {"text": "you're going to select how it's going to form its shape", "start": 284.4, "duration": 3.8}, {"text": "and how it will change its shape.", "start": 288.2, "duration": 2.72}, {"text": "Let me show you more like this one looks like all the waves, are waving on the wall", "start": 290.92, "duration": 7.36}, {"text": "Like a strong beat on the drums.", "start": 298.52, "duration": 3.48}, {"text": "I can move Gong B to the next order as it can play by orders and you can drag them to different orders", "start": 302.0, "duration": 10.1}, {"text": "So, dancers, that should be interesting.", "start": 312.54, "duration": 3.4}, {"text": "See?", "start": 315.94, "duration": 2.06}, {"text": "Okay, animation let's see what's in animation.", "start": 318.34, "duration": 3.7}, {"text": "It is waving money at me right now.", "start": 322.76, "duration": 1.98}, {"text": "Okay, I like this.", "start": 324.74, "duration": 1.94}, {"text": "Games, this should be fun. Games? Yes, you can play games with the Lasercube.", "start": 330.94, "duration": 6.2}, {"text": "Let me show you how I play games.", "start": 337.14, "duration": 1.7}, {"text": "Okay, laser frog.", "start": 338.84, "duration": 4.24}, {"text": "So the frog is me", "start": 343.56, "duration": 3.08}, {"text": "and I have to go go go, oh", "start": 346.64, "duration": 2.02}, {"text": "And you cannot touch, you can not let it\nhit the boat. If you bump into the boat, it dies.", "start": 348.66, "duration": 6.96}, {"text": "So I go, no good, no go go go. okay now I am jumping, and jump", "start": 355.76, "duration": 14.44}, {"text": "Oh shit!", "start": 370.21, "duration": 1.45}, {"text": "So I die, I go back and I go go go\ngo oh shit", "start": 371.66, "duration": 5.3}, {"text": "Go go go", "start": 376.96, "duration": 3.02}, {"text": "I don't know why I die so I don't know how to get a higher level", "start": 379.98, "duration": 5.16}, {"text": "because that's the highest is I can get", "start": 385.14, "duration": 6.16}, {"text": "Let us go into clock.", "start": 391.3, "duration": 3.58}, {"text": "Chinese really?", "start": 394.88, "duration": 1.46}, {"text": "Oh, they do have a clock written in Chinese. 19:41, 54, 55, 56,", "start": 396.34, "duration": 9.68}, {"text": "3D, what time is it now? Now it's 7:42.", "start": 406.02, "duration": 7.24}, {"text": "Flower?", "start": 413.26, "duration": 3.16}, {"text": "Youtube", "start": 416.42, "duration": 1.5}, {"text": "Subscribers? So you can log in to your twitch account, your youtube account and your Twitter account.", "start": 418.26, "duration": 7.58}, {"text": "They can connect with it.", "start": 426.0, "duration": 1.32}, {"text": "Beam Show.", "start": 427.32, "duration": 1.34}, {"text": "Multiple effects.", "start": 432.54, "duration": 2.24}, {"text": "Let's draw something and see this is what\nI drew this morning.", "start": 436.72, "duration": 3.5}, {"text": "Click it.", "start": 440.22, "duration": 1.6}, {"text": "I am going to draw the draw a small mountain", "start": 441.82, "duration": 4.6}, {"text": "This does not look like mountain at all.", "start": 447.34, "duration": 2.48}, {"text": "So I drew a little mountain and a rock.", "start": 455.98, "duration": 3.52}, {"text": "So it does come with not just dancing but also music.", "start": 463.34, "duration": 4.58}, {"text": "Let me turn the sound on.", "start": 469.56, "duration": 2.68}, {"text": "You can choose the mode, now it is set to staff you can choose circle.", "start": 478.46, "duration": 6.36}, {"text": "So now it's showing \"Please subscribe to my channel, thank you so much for your support.\"", "start": 494.5, "duration": 9.7}, {"text": "I can choose random color, wavy", "start": 506.24, "duration": 8.86}, {"text": "spiral", "start": 518.98, "duration": 1.98}, {"text": "smoke", "start": 524.3, "duration": 2.04}, {"text": "and that is the text function.", "start": 531.86, "duration": 2.84}, {"text": "This video is made possible by the generous support of JLCPCB.", "start": 534.7, "duration": 4.52}, {"text": "China's largest PCB manufacturer,", "start": 539.22, "duration": 2.44}, {"text": "with JLC, you can have PCB manufactured in under 24 hours all while you track the process in real-time.", "start": 541.66, "duration": 7.6}, {"text": "Prototype board starts at just 2 dollars in\nany color, check the description box for more info.", "start": 549.26, "duration": 5.36}, {"text": "One of the best ways to support me is to support the companies that fund this channel.", "start": 554.62, "duration": 3.98}, {"text": "Now on to the tricky bits, some things are meant to go together.", "start": 558.6, "duration": 5.06}, {"text": "Like macaroni and cheese", "start": 563.66, "duration": 1.86}, {"text": "Some things not.", "start": 565.52, "duration": 1.08}, {"text": "Like engraving lasers and visual effect\nlasers.", "start": 566.6, "duration": 3.62}, {"text": "In engineering and design, there is a class of errors called mode errors.", "start": 570.22, "duration": 4.84}, {"text": "Mode errors do kill people in the real world.", "start": 575.06, "duration": 3.0}, {"text": "Air Inter Flight 148 went down and killed 87 people because the pilot read the mode on one display wrong.", "start": 578.06, "duration": 8.16}, {"text": "I have a link to a whole discussion of this in the description box, worth a read- it's really good.", "start": 586.22, "duration": 5.88}, {"text": "Mode errors are not just an interface issue though,", "start": 592.1, "duration": 3.4}, {"text": "they can be made worse by having a machine with functions that are directly at odds with each other.", "start": 595.5, "duration": 6.28}, {"text": "Like in one mode the Lasercube generates beautiful patterns and games you can watch, play and dance to.", "start": 601.78, "duration": 7.28}, {"text": "Change modes and those same patterns will burn your retinas out of your skull and permanently blind you.", "start": 609.06, "duration": 7.38}, {"text": "Yes, you can party or engrave- with the exact same laser, just in different modes,", "start": 616.44, "duration": 7.9}, {"text": "modes which will never be accidentally changed by a drunk or incompetent DJ.", "start": 624.34, "duration": 4.96}, {"text": "Like happened in Russia back in 2008 when 30 party-goers were", "start": 629.3, "duration": 4.76}, {"text": "80% blinded by a laser accidentally pointed too low.", "start": 634.06, "duration": 4.56}, {"text": "That was 10 years ago, imagine how much smaller and powerful lasers are now.", "start": 638.62, "duration": 6.04}, {"text": "As is, fresh out of the box the Lasercube is a horrible accident waiting to happen.", "start": 644.66, "duration": 5.88}, {"text": "The next problem is about two steps away from being a whole lot more dangerous.", "start": 650.54, "duration": 6.3}, {"text": "Blinding lasers have been an issue for a few years now.", "start": 656.96, "duration": 4.06}, {"text": "What's been keeping them from being a more serious problem is they require a human operator,", "start": 661.02, "duration": 5.24}, {"text": "and it's hard to target well with a laser pointer", "start": 666.26, "duration": 2.84}, {"text": "although it is still incredibly dangerous and not something to play around with.", "start": 669.1, "duration": 5.08}, {"text": "They've shown up at protests but so far damage has been minimal.", "start": 674.18, "duration": 4.9}, {"text": "Controlling the beam has always been possible, but it's a few pretty technical steps", "start": 679.08, "duration": 6.74}, {"text": "and not really something the average member of the public will be able to do.", "start": 685.82, "duration": 4.54}, {"text": "Once you have compact, low-cost beam control with an easy to access API- that all changes.", "start": 690.56, "duration": 7.62}, {"text": "Eye tracking is just a few lines Python code and galvos are lightning fast and can be incredibly accurate.", "start": 698.38, "duration": 6.98}, {"text": "You can't out blink or out move them.", "start": 705.36, "duration": 2.46}, {"text": "For $500 you have an unmanned set up the size of a rice cooker", "start": 707.82, "duration": 4.48}, {"text": "that can potentially permanently blind dozens of people before they even know what's happening.", "start": 712.32, "duration": 5.58}, {"text": "Of course like many types of weapons autonomous or remotely operated blinding lasers like this", "start": 717.92, "duration": 6.24}, {"text": "have always been possible.", "start": 724.26, "duration": 1.98}, {"text": "It's just never been so cheap and so short a technical leap.", "start": 726.24, "duration": 3.92}, {"text": "It's also scalable, want to blind hundreds or thousands?", "start": 730.32, "duration": 4.26}, {"text": "Brand the forehead of every person at an event with an indelible symbol or QR code in seconds?", "start": 734.7, "duration": 6.22}, {"text": "Just put it on the end of a 100w laser tube like this.", "start": 741.16, "duration": 3.36}, {"text": "You can even mount it in your trunk and drive through downtown.", "start": 744.52, "duration": 3.1}, {"text": "With an IR laser no one will even know what's causing the damage.", "start": 747.62, "duration": 4.06}, {"text": "This tech, made cheap and easy to code is horrifically dangerous in the wrong hands.", "start": 751.68, "duration": 5.58}, {"text": "I can build it with what I have right here in maybe two days.", "start": 757.26, "duration": 4.32}, {"text": "But it would be pretty reasonable for the authorities to object to me having something like that sitting around", "start": 761.58, "duration": 6.08}, {"text": "so so I'll pass.", "start": 767.66, "duration": 1.04}, {"text": "Targeted blinding lasers are also incredibly difficult to defend against.", "start": 768.7, "duration": 4.52}, {"text": "You've got bit of a Gorgon's head only you can't use a reflective surface.", "start": 773.38, "duration": 5.72}, {"text": "Protective glasses need to be on the same frequency as the laser light and", "start": 779.1, "duration": 5.02}, {"text": "even then can't protect against a sustained high wattage beam tracking a single point.", "start": 784.12, "duration": 6.14}, {"text": "Best bet is FPV goggles with a built in camera pass-though like these,", "start": 790.26, "duration": 5.3}, {"text": "and hope the lasers are not mounted on a racing drone or otherwise hard to target.", "start": 795.56, "duration": 6.1}, {"text": "While it seems like something that just engraves wood could not be that harmful,", "start": 801.74, "duration": 4.9}, {"text": "it's technically speaking a very short step.", "start": 806.64, "duration": 3.08}, {"text": "Once you add near perfect automatic targeting you're dealing", "start": 809.98, "duration": 4.5}, {"text": "with a powerful weapon that violates international agreements", "start": 814.48, "duration": 3.66}, {"text": "for blinding lasers and for autonomous weapons.", "start": 818.14, "duration": 3.34}, {"text": "I'm not anti-gun. They are just a tool with appropriate users and appropriate uses.", "start": 821.72, "duration": 5.94}, {"text": "One of my favorite YouTube channels is Forgotten Weapons", "start": 827.94, "duration": 3.7}, {"text": "because I feel their history holds countless lessons.", "start": 831.64, "duration": 3.94}, {"text": "I think one of those lessons is the use of autonomous weapons", "start": 835.7, "duration": 3.84}, {"text": "and weapons designed to indiscriminately maim,", "start": 839.54, "duration": 3.34}, {"text": "like blinding lasers or butterfly mines that can harm innocent civilians", "start": 842.88, "duration": 4.62}, {"text": "who stumble across them, puts you on the wrong side of history.", "start": 847.5, "duration": 3.54}, {"text": "Proliferation and development of these should be something we all agree on.", "start": 851.04, "duration": 4.86}, {"text": "As far as what's on my table right now?", "start": 855.9, "duration": 2.9}, {"text": "The Lasercube as is? What can be done about it?", "start": 858.8, "duration": 3.52}, {"text": "At the absolute minimum I'd want to see a passive IR sensor on the front of the Lasercube", "start": 862.32, "duration": 6.06}, {"text": "to prevent beam activation when people are in the beam path.", "start": 868.38, "duration": 4.2}, {"text": "The Xiaomi laser projector has this feature.", "start": 872.58, "duration": 2.94}, {"text": "Even still, who can blame WickedLasers for combining a bunch of cutting edge technologies", "start": 875.52, "duration": 5.82}, {"text": "and trying to sell an innovative product?", "start": 881.34, "duration": 2.54}, {"text": "Lasers are getting cheaper, galvos are getting cheaper,", "start": 884.08, "duration": 3.94}, {"text": "code to control this is getting so simple a child can get eye tracking up and running in hour.", "start": 888.02, "duration": 6.32}, {"text": "That's no one's fault. You can't put the genie back in the bottle,", "start": 894.34, "duration": 3.66}, {"text": "but when developing new hardware with such destructive potential it is vital to be conscientious.", "start": 898.0, "duration": 7.58}, {"text": "I am delighted by the build quality and the play and party modes of the Lasercube,", "start": 905.58, "duration": 5.98}, {"text": "but horrified by how little thought went into making it safe.", "start": 911.56, "duration": 4.12}, {"text": "I'd love to see WickedLasers go back to the drawing board make something of this quality- but single-mode,", "start": 915.7, "duration": 6.96}, {"text": "safe for the consumer and with some reasonable steps taken in hardware to make misuse more difficult.", "start": 922.66, "duration": 8.8}, {"text": "That's it for today, what do you think? Is the Lasercube safe?", "start": 931.56, "duration": 3.56}, {"text": "If not can it be made safe? Autonomous blinding lasers,", "start": 935.12, "duration": 4.66}, {"text": "are they a threat to public safety and how would you handle it?", "start": 939.78, "duration": 4.18}, {"text": "Let me know in the comments section", "start": 943.96, "duration": 1.78}, {"text": "and remember, if I can do it, anyone can do it, and that's not always a good thing.", "start": 945.74, "duration": 6.22}]