[{"text": "This video was made in partnership with Curiosity stream.", "start": 0.03, "duration": 2.94}, {"text": "Every game goes through a development process, and Outside is no exception.", "start": 14.74, "duration": 3.94}, {"text": "During the game's early access alpha stage, It was mostly just a chemistry simulator.", "start": 18.68, "duration": 3.939}, {"text": "There wasn't too much interesting content, and you could only play as single-cell builds at the time.", "start": 22.62, "duration": 4.34}, {"text": "Once the devs finished work on the first multicellular classes, the game started to pick up some steam.", "start": 26.96, "duration": 4.54}, {"text": "They released an open beta for the game which received so much attention in such a short time that it became known as the Cambrian explosion.", "start": 31.74, "duration": 6.62}, {"text": "So, today we're going to talk about the meta during Earth's beta, and also discuss the most important abilities and stats at that time.", "start": 38.7, "duration": 6.0}, {"text": "So, during the Cambrian meta, the devs hadn't released the terrestrial expansion pack yet.", "start": 45.039, "duration": 3.95}, {"text": "So at the time, gameplay took place entirely within the marine biome.", "start": 49.0, "duration": 4.26}, {"text": "There also wasn't much in the way of mobility, intelligence or stealth yet,", "start": 53.26, "duration": 3.96}, {"text": "as those stats weren't considered very useful by the player base until more advanced techniques were discovered.", "start": 57.22, "duration": 4.4}, {"text": "This doesn't mean there wasn't a bunch of diverse builds to choose from though. Not at all.", "start": 61.68, "duration": 3.96}, {"text": "The Cambrian meta was dominated by arthropod builds.", "start": 65.64, "duration": 3.02}, {"text": "Arthropods had two perks that gave them a huge early lead in the story of Earth's meta game.", "start": 68.66, "duration": 4.44}, {"text": "The first was an exoskeleton.", "start": 73.1, "duration": 1.94}, {"text": "Offensive strategies weren't too advanced at the time", "start": 75.04, "duration": 2.2}, {"text": "so all you needed in order to shrug off most attacks was decent armor.", "start": 77.24, "duration": 4.12}, {"text": "The second thing is that arthropods were among the first builds to unlock more advanced eyes.", "start": 81.36, "duration": 4.5}, {"text": "Most players had simple light-sensitive eyes during the Cambrian.", "start": 85.86, "duration": 3.6}, {"text": "But compound eyes granted crucial accuracy bonuses, the best in the game until camera style eyes were unlocked later.", "start": 89.46, "duration": 6.22}, {"text": "One of the most popular arthropod builds of the time was the trilobite.", "start": 95.74, "duration": 3.86}, {"text": "It didn't have anything too spectacular about it in terms of abilities but it was very easy to play,", "start": 99.6, "duration": 4.18}, {"text": "making it a great beginner pick at a time where just about everyone was a beginner at the game.", "start": 103.78, "duration": 3.83}, {"text": "It had solid defensive stats because of its thick carapace armor, making it very difficult to deal damage to.", "start": 107.71, "duration": 5.33}, {"text": "Players did eventually learn how to get past their defenses, though. And at that point trilobite dropped in viability.", "start": 113.44, "duration": 6.32}, {"text": "I'd place them in low C tier.", "start": 120.02, "duration": 1.56}, {"text": "The meta during the Cambrian explosion advanced so rapidly that the truly low tier builds weren't around long enough to be remembered,", "start": 121.58, "duration": 5.7}, {"text": "so they really aren't worth talking about.", "start": 127.28, "duration": 1.94}, {"text": "Next up on the tier list is Hallucigenia,", "start": 129.3, "duration": 2.28}, {"text": "one of the few builds that wasn't running a carapace shell as part of its build.", "start": 131.58, "duration": 3.76}, {"text": "Instead, Hallucigenia players opted for a different type of defense:", "start": 135.34, "duration": 3.12}, {"text": "Instead, Hallucigenia players opted for a different type of defense: spikes.", "start": 138.46, "duration": 1.2}, {"text": "Spikes are the perfect defense against tough armored opponents", "start": 139.66, "duration": 3.14}, {"text": "because focusing all of your force into a single point can often be enough to pierce armor, even when your character is relatively weak otherwise.", "start": 142.8, "duration": 7.58}, {"text": "This is why piercing type weapons dominate the insect meta today.", "start": 150.38, "duration": 2.8}, {"text": "Slash and crush type weapons would easily be forwarded by chitin armor,", "start": 153.18, "duration": 3.6}, {"text": "but piercing damage is super effective.", "start": 156.82, "duration": 2.58}, {"text": "Anyways, even though this is a great strategy,", "start": 159.4, "duration": 2.0}, {"text": "Hallucigenia wasn't really any sort of threat and could be easily ignored by other players due to Its small size and low mobility.", "start": 161.88, "duration": 5.6}, {"text": "So it's only in high C tier.", "start": 167.48, "duration": 2.14}, {"text": "While this build did eventually fall out of the meta, a non spiked version of it is still run by some loyal velvet worms mains today", "start": 169.78, "duration": 6.76}, {"text": "and this build even has a projectile attack.", "start": 176.54, "duration": 2.2}, {"text": "In B tier, we have one of my personal favorite ancient builds:", "start": 179.64, "duration": 2.76}, {"text": "In B tier, we have one of my personal favorite ancient builds: Opabinia", "start": 182.4, "duration": 1.12}, {"text": "Opabinia was one of the first grappler builds to find any significant success in the game  and it's no surprise why.", "start": 183.52, "duration": 5.58}, {"text": "The meta at the time was heavily defense based", "start": 189.1, "duration": 3.08}, {"text": "and grapplers are always perfectly suited to dealing damage to a blocking opponent.", "start": 192.18, "duration": 3.34}, {"text": "The key to its success was its trunk, an attribute seen surprisingly few times across all the different expansions that have come and gone.", "start": 195.66, "duration": 6.88}, {"text": "Opabinia's trunk gave it an excellent grab with extended range, making it perfect for grabbing smaller players and preventing their escape in spite of their heavy armor.", "start": 202.56, "duration": 7.72}, {"text": "It also had excellent perception skills because he speced into compound eyes with five eyes giving it full 360-degree vision.", "start": 210.28, "duration": 7.46}, {"text": "With that said, its mobility wasn't stellar and had little in terms of defense.", "start": 217.74, "duration": 4.1}, {"text": "So it had basically no options if a player from a higher weight class attacked it.", "start": 221.84, "duration": 3.44}, {"text": "Unfortunately after they suffered heavy losses and starts to fall out of the meta,", "start": 225.78, "duration": 3.24}, {"text": "Opabinia mains started to spec into heavier defenses to compensate and just kept doubling down", "start": 229.12, "duration": 5.04}, {"text": "until they'd sacrificed size, power and uniqueness in order to become some of the most resilient", "start": 234.16, "duration": 5.1}, {"text": "yet useless low tiers in the whole game:", "start": 239.26, "duration": 2.4}, {"text": "yet useless low tiers in the whole game: tardigrades.", "start": 241.66, "duration": 1.14}, {"text": "So B tier is as high as Opabinia ever got.", "start": 242.8, "duration": 3.32}, {"text": "In A tier, we have the only mobility based build that existed during the Cambrian:", "start": 246.12, "duration": 3.7}, {"text": "In A tier, we have the only mobility based build that existed during the Cambrian: Haikouichthys.", "start": 249.82, "duration": 1.34}, {"text": "Haikouichthys was the first fish the devs ever added to the game, and it offered a lot of advantages over his arthropod competitors", "start": 251.17, "duration": 6.229}, {"text": "Instead of compound eyes which could see in all directions,", "start": 257.82, "duration": 2.94}, {"text": "Haikouichthys had the first camera type eyes- which didn't have 360 revision, but in exchange were better at focusing", "start": 260.76, "duration": 6.74}, {"text": "letting them see through camouflage and track targets more effectively.", "start": 267.54, "duration": 3.58}, {"text": "In addition to their eyes, their internal skeleton give them much more flexibility than builds with an exoskeleton head,", "start": 271.12, "duration": 5.24}, {"text": "allowing them to change directions faster to evade attacks.", "start": 276.36, "duration": 3.2}, {"text": "Haikouichthys was extremely small, putting it barely outside the microscopic weight class.", "start": 279.56, "duration": 4.38}, {"text": "However, the potential of this build only improved from here.", "start": 284.06, "duration": 3.04}, {"text": "Fish have been a meta staple in literally every single expansion and it all started here.", "start": 287.1, "duration": 5.48}, {"text": "While they weren't top-tier yet, they gain top tier status pretty quickly after the game released.", "start": 292.58, "duration": 3.94}, {"text": "This build's potential could not be overestimated", "start": 296.52, "duration": 2.64}, {"text": "especially considering that a future fish build eventually unlocked the legs attribute and was able to enter the terrestrial servers.", "start": 299.16, "duration": 6.14}, {"text": "But in the Cambrian, there were no match for the top-tier:", "start": 305.3, "duration": 3.12}, {"text": "But in the Cambrian, there were no match for the top-tier: anomalocaris", "start": 308.42, "duration": 1.64}, {"text": "The anomalocaris build was the first in the game's history to achieve top tier status.", "start": 310.06, "duration": 4.18}, {"text": "Nothing could match its power and defense at the time.", "start": 314.24, "duration": 2.66}, {"text": "It could deflect just about any attack thrown at it because of its armor,", "start": 317.46, "duration": 2.74}, {"text": "while at the same time having a strong enough power stat to crack most other players' armor.", "start": 320.2, "duration": 4.98}, {"text": "If it couldn't crack their armor,", "start": 325.32, "duration": 1.54}, {"text": "It could use its tendrils to grab or flip its opponent, allowing it to attack their weak point for massive damage.", "start": 326.86, "duration": 5.68}, {"text": "Its only real threat was other anomalocaris players because they could hit hard enough to crack their armor.", "start": 332.54, "duration": 5.24}, {"text": "Anomalocaris also had the most advanced compound eyes of any build at the time, rivaling that of present-day dragonflies.", "start": 337.78, "duration": 6.72}, {"text": "This gave them an edge when other players finally started specing into stealth abilities.", "start": 344.5, "duration": 4.14}, {"text": "Anomalocaris was such an oppressive force that it ended up getting banned in the game's very first balance patch", "start": 348.64, "duration": 5.32}, {"text": "which opened up several new niches and allowed fish, mollusks and other arthropods to diversify their strategies.", "start": 353.96, "duration": 5.1}, {"text": "So yeah , that's what Earth's meta looked like during the open beta.", "start": 359.38, "duration": 3.7}, {"text": "The meta progressed quite rapidly after that, with the devs adding the terrestrial DLC and with various players unlocking crazy new OP abilities like flight.", "start": 363.08, "duration": 8.0}, {"text": "Be sure to subscribe so you don't miss future episodes discussing the broken builds of the Ordovician, Silurian and Devonian DLC updates.", "start": 371.08, "duration": 8.079}, {"text": "By the way, the source footage for this video is from two amazing prehistory documentaries.", "start": 379.72, "duration": 3.74}, {"text": "I'm sure many of you familiar with one of them: BBC's walking with monsters", "start": 383.46, "duration": 3.92}, {"text": "The other is a new one called Leaps in evolution", "start": 387.38, "duration": 2.9}, {"text": "which details the evolution of sight starting from the earliest life on earth all the way through to today.", "start": 390.28, "duration": 5.7}, {"text": "It features some of the best CGI ancient arthropods ever made so I highly recommend watching it.", "start": 395.98, "duration": 5.32}, {"text": "Both of these awesome documentaries are available right now on Curiositystream, my favorite streaming service.", "start": 401.3, "duration": 4.98}, {"text": "There are over 2400 documentaries on there so there's plenty more to binge once they're done with Leaps in evolution.", "start": 406.28, "duration": 5.04}, {"text": "The subscription is only $2.99 a month,", "start": 411.32, "duration": 1.74}, {"text": "but if you go to curiositystream.com/tierzoo, you can get a full month free.", "start": 413.06, "duration": 4.28}, {"text": "And in doing so, you'll be supporting both my channel and good educational content in general.", "start": 417.34, "duration": 4.22}, {"text": "Thanks so much for watching and thanks, especially to our patrons on Patreon.", "start": 421.78, "duration": 3.24}, {"text": "Until next time, good luck out there.", "start": 425.02, "duration": 2.4}]