[{"text": "It's never gonna work you can't make a potato camera potatoes are meant for one thing only eating", "start": 0.03, "duration": 5.879}, {"text": "Wren check out this picture. I just took it's one of my favorites take down how a potato or something actually I did", "start": 8.5, "duration": 6.529}, {"text": "So there's this saying on the Internet. When you see a really bad picture you go what you take that on your potato?", "start": 16.15, "duration": 4.219}, {"text": "Well, I want to answer that question. Yes, I did", "start": 20.369, "duration": 2.7}, {"text": "I've never actually tried to make a camera before it sounds really complicated", "start": 23.07, "duration": 2.699}, {"text": "But the thing is if I use film it makes my life a little bit easier", "start": 25.869, "duration": 3.83}, {"text": "So here's the challenge take an actual potato", "start": 29.859, "duration": 2.39}, {"text": "Carve it out so that you have a film spot inside where your film can sit and you slap a lens on the front", "start": 32.559, "duration": 4.55}, {"text": "Can I actually make a working potato camera? Let's find out", "start": 37.329, "duration": 4.25}, {"text": "There's a whole range of tests that we have to do here. I think at the end of the day what's probably gonna happen?", "start": 42.219, "duration": 3.74}, {"text": "We're gonna build the camera. We're going to keep it in a bag or a box. Until it's time to take a picture", "start": 45.96, "duration": 4.079}, {"text": "at which point we'll just take it out, expose it, put it back. Keep it quick. We also got lots of problems", "start": 50.07, "duration": 4.2}, {"text": "We're gonna have to deal with one light if any light gets into this potato when it has film in it", "start": 54.27, "duration": 4.799}, {"text": "It's going to ruin the film. It's gonna expose it", "start": 59.07, "duration": 1.59}, {"text": "We need to cut one of these open and see if light can travel through a potato. I'm thinking it can yeah", "start": 60.66, "duration": 4.859}, {"text": "That's a lot of light", "start": 66.31, "duration": 2.0}, {"text": "How do you want to deal with this? I kind of don't want to spray paint it black", "start": 68.53, "duration": 2.809}, {"text": "I don't think it'll adhere or dry I agree", "start": 71.34, "duration": 2.04}, {"text": "You know what might work, build a little 3d printed chamber and just keep this in to open. Mm-hmm", "start": 73.56, "duration": 4.8}, {"text": "How did that take a print anything probably do it quick. Let's try it", "start": 78.39, "duration": 3.119}, {"text": "Let's do it time to do some 3d modeling combining new technology with old potatoes and PLA printers", "start": 81.509, "duration": 6.15}, {"text": "I'm have a chamber for the film ideally to you know, be ideal to like Messing like this film backing 38 millimeters tall", "start": 88.479, "duration": 7.13}, {"text": "yeah, so 50 millimeters wide so this", "start": 95.86, "duration": 2.569}, {"text": "muffled screams", "start": 98.429, "duration": 2.0}, {"text": "Test test test test test", "start": 103.119, "duration": 2.0}, {"text": "Muffled screams", "start": 105.119, "duration": 1.661}, {"text": "You guys ready to get", "start": 106.78, "duration": 1.92}, {"text": "Smoked there we go. That's it. You just cover the top with gaff tape me a little big", "start": 108.7, "duration": 4.879}, {"text": "We'll see what happens. If you do let's go smaller. Rather get smaller than too big. I don't know", "start": 113.579, "duration": 4.74}, {"text": "Because it's like how big is it? It's like 40 40 millimeters tall film is 36 doesn't go so much play Nick", "start": 119.649, "duration": 6.47}, {"text": "I'm a doing man. We're gonna take some", "start": 126.119, "duration": 1.75}, {"text": "Here we go", "start": 127.869, "duration": 2.0}, {"text": "Then we get into the mechanics of this thing where the lens is gonna sit", "start": 133.209, "duration": 2.63}, {"text": "chop that flat and we'll kind of carve out a little bit of a hole that old lens will fit in we're gonna take the", "start": 135.91, "duration": 4.819}, {"text": "Top of the tato and chop that like this. It's gonna lift the top off carve out a spot inside now", "start": 140.73, "duration": 4.919}, {"text": "The thing is we need be able to roll the film through here", "start": 145.649, "duration": 1.731}, {"text": "We'll have a film gate and then it'll go down here into a chamber or the film can go so cold around town here in", "start": 147.56, "duration": 5.42}, {"text": "LA you think you'd be able to find a place?", "start": 152.98, "duration": 1.46}, {"text": "I can do whatever you want for film but no films dead apparently", "start": 154.44, "duration": 2.489}, {"text": "So the best we could find was a shop that would do nine inch strips of film", "start": 156.93, "duration": 4.38}, {"text": "So we bought a couple 35 millimeter film Louis. We're going got to do nine inch strips at a time now", "start": 161.31, "duration": 4.38}, {"text": "It's kind of a waste. We only do one picture per nine inch strips", "start": 165.69, "duration": 2.459}, {"text": "So Nick and I are challenging ourselves", "start": 168.15, "duration": 1.809}, {"text": "To make it so you do multiple exposures on one strip of film rolling the film through in the film gate", "start": 169.959, "duration": 5.0}, {"text": "How do we know if we can fit the film in there simple how big it's known 24 by 36 mm", "start": 174.959, "duration": 4.559}, {"text": "See, how wide the step is. Oh, it's perfect. This is like exactly the same size", "start": 179.519, "duration": 4.08}, {"text": "Wow who thought they would have standardize tape rolls and film the same size. All right, so we need nine inches", "start": 184.45, "duration": 5.3}, {"text": "Vegan camera imagine that there's a hole cut in this balsa wood and here's our film roll", "start": 190.66, "duration": 4.069}, {"text": "We're gonna go in the back open it up move the film one ring for its. Theoretically this should all work out", "start": 194.95, "duration": 7.129}, {"text": "Eh, okay. Look at that some focus", "start": 202.139, "duration": 2.37}, {"text": "Yeah", "start": 205.06, "duration": 1.109}, {"text": "Yeah, the little proof of concept build seems to be working when aiwei's? a real test to do here", "start": 206.169, "duration": 4.85}, {"text": "Going good to be back. Finally. It's been too long went through my second year in college in San Francisco", "start": 214.19, "duration": 5.869}, {"text": "Whose great year got to live with my best friends. Lots of Adventure is great times, but I also", "start": 220.19, "duration": 4.849}, {"text": "Shot my very own spider-man short film which I will now be editing", "start": 225.83, "duration": 4.669}, {"text": "Here, which is pretty exciting. So basically I've been wanting to make a spider-man movie for as long as I can", "start": 231.049, "duration": 5.12}, {"text": "Remember, I grew up watching the Sam Raimi spider-man movies. Probably my biggest inspirations so good. Don't watch the spider-man 3", "start": 236.17, "duration": 6.239}, {"text": "One of my pet peeves is just bring that movie. I hate that movie so much. It's definitely its own movie", "start": 243.319, "duration": 5.63}, {"text": "I wrote a script for a spider-man short last year and I've been working on getting it made thankfully", "start": 248.95, "duration": 5.669}, {"text": "I had put together a teaser that is already on my Instagram showed that to Jake had some of the effects in it he was", "start": 254.62, "duration": 5.369}, {"text": "Impressed he showed it to Sam and Nico they were into it", "start": 259.989, "duration": 3.089}, {"text": "And so they gave me the budget to make this short film all on my own in San Francisco", "start": 263.08, "duration": 4.98}, {"text": "There were two big challenges with this project one. It's a period piece", "start": 268.06, "duration": 3.989}, {"text": "it's set in the 1960s which for a short film is very difficult because", "start": 272.05, "duration": 5.22}, {"text": "Costuming takes a lot of money, you know, it's really hard to get that many extras to fill a background to make you know", "start": 277.849, "duration": 5.57}, {"text": "the space feel realistic part of how we're going to fix that is through lots and lots of visual effects like", "start": 283.419, "duration": 5.55}, {"text": "So many the other challenge was putting spider-man in a movie because obviously that comes with a lot of challenges", "start": 290.32, "duration": 6.86}, {"text": "You know acrobatics the costume took many many hours to create made it from scratch", "start": 297.37, "duration": 5.66}, {"text": "Couldn't get a stunt double. So thankfully we have visual effects right now", "start": 303.4, "duration": 3.44}, {"text": "I'm working on creating Spiderman from the ground up and CGI a lot of its gonna be hand animating", "start": 306.84, "duration": 6.449}, {"text": "Which is really tough mostly the swinging sequences because you can't really film someone", "start": 313.29, "duration": 4.98}, {"text": "swinging in between buildings to like see how their movements look", "start": 318.58, "duration": 2.989}, {"text": "Hopefully I can finish this before the end of June which is when it's due. So, I guess we'll see", "start": 321.7, "duration": 5.63}, {"text": "Yeah, it's gonna be tough. I'm gonna be working. Some late hours. Probably definitely lots of pressure. Lots of big shoes to fill right?", "start": 327.4, "duration": 7.22}, {"text": "It's not gonna help me with baby wanna help my mom man, you're spider-man 3 pin", "start": 339.82, "duration": 6.589}, {"text": "It's pretty good there the windows just fine - time to carve out master potato and", "start": 356.289, "duration": 4.07}, {"text": "Ideas, this is where a film will go a lot of being better. Dang. Look at that. Great", "start": 360.879, "duration": 3.65}, {"text": "Do you think this will be able to compete with the red maybe only in terms of", "start": 366.37, "duration": 3.919}, {"text": "Style like the Reds all black with like cool skulls and this is all like yellow with like cool", "start": 371.02, "duration": 4.79}, {"text": "smells", "start": 376.569, "duration": 2.0}, {"text": "Hey you think this is just an ordinary potato think again", "start": 379.36, "duration": 2.69}, {"text": "Kato camera. All right. So I finished hollowing out the potato this fits in there nice and snug and that's gonna protect an image", "start": 382.93, "duration": 6.589}, {"text": "Hopefully into our film. All right, so the potato construction is done", "start": 389.65, "duration": 3.169}, {"text": "We're ready to throw the film chamber in there take our pictures, but I want to make sure this lens is working", "start": 392.83, "duration": 5.449}, {"text": "We're gonna put this on a real camera. We're gonna get a sense of exposure", "start": 398.279, "duration": 2.49}, {"text": "What settings should we be at because we need to have to stop down a fair amount", "start": 400.77, "duration": 3.059}, {"text": "well", "start": 403.87, "duration": 0.5}, {"text": "We're sure we can do is we can control the aperture of this lens and the tighter the aperture the more things are in focus", "start": 404.37, "duration": 4.709}, {"text": "We can't see or shooting you can only point the potato at it and hope it comes out beautifully so set the aperture to around", "start": 409.12, "duration": 5.509}, {"text": "F11 and then we know our film is 100", "start": 414.849, "duration": 2.63}, {"text": "Iso so we put this lens on real camera when we stop it down to 11 and we set the cameras ISO to 100", "start": 417.58, "duration": 5.149}, {"text": "Then we should get a reading for the shutter speed how long we need to take our lens cap off and then put it back", "start": 422.86, "duration": 4.549}, {"text": "On to take our picture here at 1/4 of a second. It's a perfect exposure in here", "start": 427.409, "duration": 3.72}, {"text": "It's a potato camera", "start": 431.919, "duration": 2.0}, {"text": "I think this is gonna work", "start": 435.129, "duration": 1.19}, {"text": "I have a Raider load some film in this son of a look at my new camera is where I think it does", "start": 436.319, "duration": 5.76}, {"text": "So we'll have the lens cap on it's time to take a picture and just take it off and put it back on", "start": 442.75, "duration": 3.529}, {"text": "Blurry we have these a tripod", "start": 449.5, "duration": 2.729}, {"text": "Think having a Toledo", "start": 453.56, "duration": 1.949}, {"text": "Existence there's more of a priority than whether or not is blurry man. That reason just there is doubt in my potato camera", "start": 455.509, "duration": 4.94}, {"text": "It's never gonna work ever you can't make a potato camera. You know what you should give up now", "start": 460.449, "duration": 5.19}, {"text": "Potatoes are meant for one thing. Only eating is gonna get popular and there's gonna be another famine. Ah isn't there", "start": 466.819, "duration": 5.06}, {"text": "so we have one more big challenge ahead of us for to get this to work thing is if any light hits the", "start": 472.639, "duration": 5.119}, {"text": "Undeveloped film it ruins it straight up. So we need to be in a pitch-black room", "start": 477.889, "duration": 3.44}, {"text": "Let me cut the film into nine inch strips", "start": 481.43, "duration": 1.85}, {"text": "We need to stay in that pitch-black room when you load it into here and make sure it's love it correctly", "start": 483.28, "duration": 3.72}, {"text": "We get it all sealed up. We can't let any light leak into this potato if that happens", "start": 487.0, "duration": 3.869}, {"text": "The film is ruined traditionally in dark rooms. They have a light with a red of a certain wavelength. It doesn't expose the film", "start": 490.87, "duration": 5.399}, {"text": "I thought I'd feel ups you light might work, but we decided not to risk it. We're gonna go extra safe", "start": 496.27, "duration": 3.6}, {"text": "I'm going to use an infrared camera and be in pitch blackness for this to work. Okay?", "start": 499.87, "duration": 3.239}, {"text": "Just gotta memorize everything is", "start": 504.639, "duration": 2.0}, {"text": "You get plates everything beforehand. Here we go", "start": 507.65, "duration": 2.75}, {"text": "I can't see anything. There's some low in the dark things on the ceiling apparently, dude", "start": 511.37, "duration": 4.58}, {"text": "Should we turn on the light to take this bit better?", "start": 516.22, "duration": 2.9}, {"text": "That's not good to breathe", "start": 528.2, "duration": 5.58}, {"text": "I Recently retired from corridor digital and moved to Fiji because this episode is brought to you by Squarespace", "start": 539.22, "duration": 5.66}, {"text": "Squarespace is so easy to use that. I just quit and move to a faraway Island", "start": 545.2, "duration": 4.98}, {"text": "It's so easy. I make websites for everybody here in Fiji Squarespace has beautiful award-winning templates", "start": 550.439, "duration": 6.59}, {"text": "Meaning you don't need to know anything about color in order to use their website. Do you see that?", "start": 557.189, "duration": 4.22}, {"text": "Do you see those surfers down there?", "start": 561.41, "duration": 2.0}, {"text": "Hey guys", "start": 563.639, "duration": 1.021}, {"text": "Yeah", "start": 564.66, "duration": 0.5}, {"text": "They're having a great time because you know why Squarespace is flexible for any kind of website", "start": 565.16, "duration": 4.71}, {"text": "Meaning that if you're a surfer a Frank over there", "start": 570.3, "duration": 2.69}, {"text": "Hey, I see you crazy animal don't think you're going anywhere", "start": 573.72, "duration": 3.619}, {"text": "Squarespace has an all-in-one platform. Meaning there's nothing to install patch or upgrade ever", "start": 578.25, "duration": 4.369}, {"text": "Do you feel that ocean breeze", "start": 585.899, "duration": 2.0}, {"text": "That's what they're 24/7 award-winning customer service feels like so great", "start": 588.3, "duration": 4.25}, {"text": "Remember you can get $10 off your first purchase by going to squirt space.com forward slash corridor crew right now. You'll thank me. Later", "start": 592.769, "duration": 7.64}, {"text": "cannonball", "start": 601.17, "duration": 2.0}, {"text": "Now make sure we don't over expose the film go down", "start": 612.75, "duration": 4.009}, {"text": "But Spencer died in a train accident 20 years ago", "start": 618.3, "duration": 2.72}, {"text": "Kill those lights", "start": 622.62, "duration": 2.0}, {"text": "All right ready seal, okay, I'm gonna turn on the light go for it. Let's do it. Yeah, don't move", "start": 635.12, "duration": 7.46}, {"text": "Okay, that's it now, I did one I need to advance the film so I need to open this up again and do that", "start": 646.689, "duration": 6.02}, {"text": "If we get any image if you can even make out a human I'll be happy that would be successful", "start": 666.97, "duration": 5.179}, {"text": "If there's any actual yeah, even if it's blurry, even though we've been really careful. There's probably a 30% chance", "start": 672.79, "duration": 6.32}, {"text": "We're actually gonna get something 30% chance, but something will actually get anything. Yeah", "start": 679.11, "duration": 4.679}, {"text": "These black squares are the exposures. Oh man. There's a ghost to them see people", "start": 702.189, "duration": 4.89}, {"text": "Like these ghostly people something lorries happen right there. It only works totally", "start": 708.079, "duration": 5.69}, {"text": "Holy $&!% when they developed it, they didn't think it worked. Okay. There's a Slenderman That's a really good Slendy right there we have all the negatives here", "start": 719.419, "duration": 11.48}, {"text": "So now we need to do is scan them in and inverse the colors so you can see what the images look like", "start": 730.899, "duration": 4.739}, {"text": "Nice gate. It's probably super blurry and out of focus", "start": 736.609, "duration": 2.239}, {"text": "Probably oh my god that totally worked", "start": 739.549, "duration": 2.15}, {"text": "There's actually people", "start": 743.599, "duration": 2.0}, {"text": "I'm not sure who that was. I think that's you. Yeah, I think this is Gabe. I'm believe gaben Peter. I think yeah", "start": 751.009, "duration": 6.409}, {"text": "Yeah", "start": 757.699, "duration": 0.5}, {"text": "I think there might even double imprints like here this photo might have been in one of these", "start": 758.199, "duration": 4.019}, {"text": "When I was laying on top of it something we did like double expose which is kind of cool actually", "start": 762.319, "duration": 4.459}, {"text": "Yeah, you can actually see the logo the indigo print slow going game yeah", "start": 768.439, "duration": 5.299}, {"text": "That's Jake and Christian. I am their arms fricking boss mode dude. Definitely out of focus", "start": 775.099, "duration": 5.21}, {"text": "Yeah!", "start": 782.809, "duration": 1.53}, {"text": "Believe I can see you're right. Yeah, I can see. Yeah, I can see it here", "start": 784.339, "duration": 2.659}, {"text": "Well, you can see the light switch. You can see the door to the conduit box. This is a really spooky woman", "start": 786.999, "duration": 4.559}, {"text": "That's like zone that looks like album art or a dark. Ambient", "start": 792.139, "duration": 4.729}, {"text": "So that's you Clint. And that's", "start": 797.569, "duration": 2.0}, {"text": "Yeah, oh yeah", "start": 800.82, "duration": 2.0}, {"text": "Oh, who is this Oh, who's this someone with a gun? No this with an axe or holy intern scanner. That's Christian", "start": 803.1, "duration": 6.95}, {"text": "Yeah doing is I'm classic Christian pose that work virtually. Well, it's in focus. Actually. This makes me", "start": 810.06, "duration": 5.359}, {"text": "Feel like foggy if you stand back and blurrier eyes, you can see his camo shorts. Yep", "start": 819.6, "duration": 4.489}, {"text": "You see white shoes white socks and his arms conflict. Yeah, that's really good. Oh wow", "start": 824.13, "duration": 6.139}, {"text": "I'm super in focus freakin Slenderman over here, dude. Hey, who's this?", "start": 830.269, "duration": 4.53}, {"text": "That's definitely me a manly just cuz I remember specifically doing that pose that cheek. Yeah, that's Jake. Definitely Jay", "start": 834.8, "duration": 7.469}, {"text": "Let's definitely Jake these ones. Actually these ones are almost perfect", "start": 842.269, "duration": 2.64}, {"text": "To be honest with you exposure wise like kind of about as good as it gets", "start": 844.91, "duration": 3.33}, {"text": "So potato camera does exactly what we thought it would do which is take crappy", "start": 848.579, "duration": 4.88}, {"text": "But still visible pictures kind of work like we got these weird ghostly figures which is actually exactly what I was hoping for", "start": 853.459, "duration": 6.809}]