[{"text": "Somewhere inside of every raindrop is a tiny impurity – a touch of salt, a speck of soot,", "start": 1.1, "duration": 5.56}, {"text": "a grain of clay – that’s absolutely crucial\nto the raindrop’s existence. In fact, without", "start": 6.66, "duration": 5.1}, {"text": "these microscopic pieces of dirt, there would\nbe no rain, because water vapor can’t condense", "start": 11.76, "duration": 4.7}, {"text": "into droplets on its own.\nWhich is kind of weird, because water molecules", "start": 16.46, "duration": 3.91}, {"text": "like each other – if they didn’t, they\nwouldn’t cling to each other like this!", "start": 20.37, "duration": 4.02}, {"text": "And in the air, vaporized water molecules\ncollide and stick together all the time – but", "start": 24.39, "duration": 4.53}, {"text": "they also break apart all the time, thanks\nto bond-breaking heat energy. Only when the air cools down", "start": 28.92, "duration": 5.38}, {"text": "past a certain point – called the dew point\n– does this breaking-apart slow down enough", "start": 34.3, "duration": 4.849}, {"text": "for little clusters of water molecules to\ngrow into droplets.", "start": 39.149, "duration": 3.19}, {"text": "But actually, that’s only true if the cluster\nis big to start with. If it’s too small,", "start": 42.339, "duration": 5.13}, {"text": "its surface is so curved that the molecules\non the outside have few neighbors to bond", "start": 47.469, "duration": 5.32}, {"text": "to, which makes them easy to break off, so\nthe cluster as a whole has higher chances", "start": 52.789, "duration": 4.11}, {"text": "of losing molecules than gaining them, even\nbelow the dew point.", "start": 56.899, "duration": 3.98}, {"text": "Which means that up until that critical size,\na cluster’s odds of shrinking are much better", "start": 60.879, "duration": 4.74}, {"text": "than its odds of growing. Unfortunately, that\ncritical size is 150 million molecules. And", "start": 65.619, "duration": 6.301}, {"text": "while there are millions of five-molecule\nclusters in a golf-ball sized volume of air", "start": 71.92, "duration": 4.33}, {"text": "at dew point, odds are that only one of those\nclusters will grow to a size of ten. And you’d", "start": 76.25, "duration": 4.939}, {"text": "need a golf ball of air ten million miles\nacross to find one 50-molecule cluster! Which,", "start": 81.189, "duration": 6.341}, {"text": "basically, means that clusters of water molecules\nnever get to 150 million on their own.", "start": 87.53, "duration": 5.649}, {"text": "Fortunately, they don’t have to – they\ncan start off at that critical size by condensing", "start": 93.179, "duration": 4.9}, {"text": "onto one of the gadjillions of little pieces\nof dirt floating in our atmosphere, and then", "start": 98.079, "duration": 4.201}, {"text": "grow and grow until they’re a droplet in\na raincloud. So, ultimately, it’s these", "start": 102.28, "duration": 4.629}, {"text": "little pieces of dirt, surrounded by water,\nthat make life possible on our big piece of", "start": 106.909, "duration": 4.911}, {"text": "dirt surrounded by water.", "start": 111.82, "duration": 7.0}]