[{"text": "In a world of plain black boxes with no RGB, one man", "start": 0.06, "duration": 5.61}, {"text": "Risks it all to show five of the most insane", "start": 5.83, "duration": 3.349}, {"text": "cases that money can buy and", "start": 9.73, "duration": 2.33}, {"text": "It's brought to you by Ifixit. Ifixit protec toolkit gives you the tools you need to tackle any", "start": 12.61, "duration": 5.749}, {"text": "Electronics repair challenge visit ifixit.com/linus at the link below to get yours today", "start": 18.52, "duration": 5.629}, {"text": "Okay, don't get me wrong. I'm a huge fan of the understated", "start": 33.68, "duration": 3.77}, {"text": "Monochrome aesthetic with maybe a sprinkle of color here or there, but today", "start": 37.97, "duration": 4.669}, {"text": "today is about the outliers the biggest the boldest and", "start": 43.37, "duration": 4.7}, {"text": "Arguably, subjectively, the beautifulest monstrosities that you can actually", "start": 49.22, "duration": 4.879}, {"text": "Buy for your next PC build so no one offs", "start": 54.8, "duration": 4.579}, {"text": "Let's kick things off with the deep cool. Oh", "start": 59.9, "duration": 2.959}, {"text": "Tristellar to make something truly unique you basically need to step out of the", "start": 64.67, "duration": 7.01}, {"text": "Standard form factor. I mean all boxes look somewhat alike do they not? So deep cool", "start": 72.02, "duration": 5.84}, {"text": "Amongst others here today took that challenge very seriously as the name implies the TriStellar has three", "start": 78.56, "duration": 7.22}, {"text": "isolated chambers arranged in sort of an", "start": 86.06, "duration": 2.63}, {"text": "Arrowhead style with a metal hub in the middle that serves to route cables between the compartments", "start": 89.63, "duration": 6.139}, {"text": "The exterior panels have a rough kind of like", "start": 96.02, "duration": 2.6}, {"text": "Gunmetal finish that gives them a very industrial look and feel and they just slide off whenever you need to perform maintenance", "start": 99.32, "duration": 7.01}, {"text": "So each chamber holds something different.. So starting at the top. You've got mounting for your GPU via a PCI Express", "start": 107.09, "duration": 7.64}, {"text": "Extension and up to three SSDs with some sexy tempered glass to show them all off", "start": 115.28, "duration": 6.169}, {"text": "Then the left chamber holds your power supply", "start": 121.64, "duration": 2.51}, {"text": "An optional two hard drives and a five and a quarter inch bay if you still live in 2005", "start": 124.97, "duration": 6.019}, {"text": "Finally the last compartment contains an ITX motherboard with either a low-profile CPU cooler or a single", "start": 131.569, "duration": 7.61}, {"text": "120 millimeter liquid cooler", "start": 139.73, "duration": 2.0}, {"text": "Thanks to this fan mount", "start": 141.83, "duration": 2.089}, {"text": "Now each of the wings comes with a 90 millimeter fan in the front and is designed to act like a mini wind tunnel so", "start": 144.319, "duration": 7.49}, {"text": "I would probably stick with a blower style GPU cooler in this case that is if you can afford one.. It is", "start": 151.81, "duration": 7.47}, {"text": "350 bucks.. Now for our next trick the ThermalTake tower", "start": 160.22, "duration": 4.279}, {"text": "900 may actually not feature an overly unique form factor, but it's still more than earns it's", "start": 165.2, "duration": 7.1}, {"text": "insane designation", "start": 172.819, "duration": 1.621}, {"text": "Thanks to the sheer magnitude of both its capacity and size which are sort of the same thing this thing is so big", "start": 174.44, "duration": 7.58}, {"text": "That my wife can literally fit inside of it with the motherboard tray removed", "start": 182.39, "duration": 5.809}, {"text": "I couldn't make this stuff up", "start": 188.2, "duration": 2.0}, {"text": "Anyway, the white version that we have here in the office has a powder-coated steel exterior and more tempered glass", "start": 190.34, "duration": 6.29}, {"text": "then you have probably ever seen on a single case at least for now and", "start": 197.6, "duration": 6.049}, {"text": "This robust construction lends to its over 50 pound", "start": 203.989, "duration": 4.7}, {"text": "Dry weight, I mean you seriously need two people to move this thing around once. It's full of hardware", "start": 209.9, "duration": 6.41}, {"text": "lots and lots of hardware the Tower 900 can hold 2", "start": 216.83, "duration": 5.569}, {"text": "quad", "start": 223.13, "duration": 1.889}, {"text": "140 millimeter extra thick radiators like what", "start": 225.019, "duration": 3.529}, {"text": "We've got here and even has adequate room for fans on both", "start": 228.549, "duration": 4.529}, {"text": "sides of it if you're a total airflow nut. The motherboard tray fits up to an e ATX board and quad", "start": 233.66, "duration": 7.279}, {"text": "GPUs although that last ones not really a thing anymore at least for gamers and", "start": 241.22, "duration": 4.97}, {"text": "surprisingly the 900 actually costs barely more than it weighs at", "start": 246.95, "duration": 4.61}, {"text": "220 dollars", "start": 252.769, "duration": 1.381}, {"text": "Following in the \"size matters footsteps\" of our last case is the also by Thermaltake core", "start": 254.15, "duration": 6.11}, {"text": "P7 now in its default form here, you can see, it just looks like one of those fancy", "start": 260.45, "duration": 5.089}, {"text": " ", "start": 265.539, "duration": 0.88}, {"text": "showcase cases that's just kind of like a", "start": 266.419, "duration": 2.059}, {"text": "Slab of metal that you put a bunch of stuff on and then a tempered glass cover in front for effect", "start": 269.06, "duration": 5.39}, {"text": "but", "start": 274.45, "duration": 0.55}, {"text": "No", "start": 275.0, "duration": 0.5}, {"text": "my friends this case has much more to offer it can be upright like a test bench it can be on the wall or", "start": 275.5, "duration": 6.779}, {"text": "in its final form which we're calling panoramic mode you just install these extra included panels and", "start": 282.59, "duration": 6.829}, {"text": "The case turns into this crazy", "start": 289.7, "duration": 2.389}, {"text": "open", "start": 293.36, "duration": 1.23}, {"text": "Concept setup thing that you can", "start": 294.59, "duration": 2.17}, {"text": "You can choose for different angles for depending on what you like to change the look of your case and your build", "start": 297.13, "duration": 7.519}, {"text": "I mean customization is king right? The p7 also has a ton of radiator mounting with space for 3", "start": 304.68, "duration": 7.679}, {"text": "quad", "start": 312.97, "duration": 1.259}, {"text": "120 millimeter radiators in", "start": 314.229, "duration": 2.0}, {"text": "Panoramic mode here, and you can even vertically mount your GPUs. Yes, that is GPUs", "start": 316.6, "duration": 5.779}, {"text": "Plural, but if water cooling or our fancy GPU mounting isn't really your thing the case", "start": 322.93, "duration": 5.089}, {"text": "also has plenty to offer for normal people with space for up to eight hard drives or SSDs and", "start": 328.02, "duration": 4.649}, {"text": "Of course like the tower 900 full ATX board compatibility. This one will cost you 300 bucks", "start": 332.83, "duration": 7.369}, {"text": "Alright, so you've likely seen part one of our course err slate build and don't worry", "start": 340.72, "duration": 5.149}, {"text": "We will be finishing that up soon TM, but the slate fit our", "start": 345.87, "duration": 4.47}, {"text": "Insanity descriptor so well that we needed to include it here", "start": 351.07, "duration": 3.619}, {"text": "And I know it's fundamentally just a big black box, but what makes this case crazy is the?", "start": 354.69, "duration": 7.589}, {"text": "Ridiculous amount of tempered glass. This glass it's gonna be huge", "start": 362.889, "duration": 5.3}, {"text": "It's curved, and you won't even believe it", "start": 368.37, "duration": 2.7}, {"text": "And it's no slouch when it comes to hardware capacity either in fact, It has the most", "start": 371.07, "duration": 5.88}, {"text": "capacity out of A N Y case we've looked at so far. The most.", "start": 377.47, "duration": 5.75}, {"text": "You can mount 8 SSDs, 5 hard drives, 5 graphics cards, 2 motherboards, 2 power supplies", "start": 383.65, "duration": 7.1}, {"text": "2 quadruple", "start": 391.03, "duration": 1.8}, {"text": "120 millimeter radiators , a triple 140 millimeter radiator and", "start": 392.83, "duration": 3.589}, {"text": "24 fans to cool it all off", "start": 397.57, "duration": 2.929}, {"text": "Oh, and did I mention that it has RGB front i/o because yeah, it has RGB front i/o", "start": 400.5, "duration": 7.859}, {"text": "Now sadly this 40 pound behemoth is not on the market yet, but we are hoping to see it sometime soon and", "start": 408.97, "duration": 7.309}, {"text": "Hopefully for under 500 bucks because damn it Corsair, the world needs this", "start": 416.83, "duration": 5.42}, {"text": "bringing us", "start": 423.039, "duration": 1.411}, {"text": "to our final case", "start": 424.45, "duration": 2.0}, {"text": "But okay the most insane case", "start": 426.949, "duration": 2.959}, {"text": "The most insane thing I", "start": 430.55, "duration": 2.989}, {"text": "Think I have ever seen, Meet the Zadak 511 Helicarrier", "start": 434.059, "duration": 4.88}, {"text": "we aren't sure how many of them exist or how many will be made, but it is technically a", "start": 438.949, "duration": 6.169}, {"text": "production model and therefore qualifies for this video so all right", "start": 445.699, "duration": 5.419}, {"text": "Where do we start with this thing?", "start": 451.58, "duration": 2.389}, {"text": "Not by opening it. That's for sure. So it did include toy jets you know yeah", "start": 454.909, "duration": 5.6}, {"text": "but it didn't include instructions, so we're gonna have to take their word for it that it contains a", "start": 461.36, "duration": 5.209}, {"text": "6950X and an Asus Strix", "start": 467.149, "duration": 2.18}, {"text": "GTX 1080 that", "start": 469.849, "duration": 2.0}, {"text": "actually that story doesn't really check out at all because this is an MSI motherboard and", "start": 472.519, "duration": 4.64}, {"text": "You know what whatever..I'm sure if you order one you can get it with whatever you want inside", "start": 478.159, "duration": 4.279}, {"text": "Let's focus on what we can see from the outside", "start": 482.629, "duration": 2.75}, {"text": "The entire case is plumbed up for the integrated liquid cooling system", "start": 486.169, "duration": 5.209}, {"text": "With coolant lines visible on the sides here and over here, and it's got four", "start": 491.719, "duration": 5.929}, {"text": "single", "start": 498.229, "duration": 1.261}, {"text": "120 millimeter radiators here here here and here", "start": 499.49, "duration": 4.729}, {"text": "the whole thing is made out of machined aluminum and", "start": 504.979, "duration": 3.2}, {"text": "Plexi and weighs so much that it requires two people to move it", "start": 508.579, "duration": 5.239}, {"text": "Io is fairly standard and positioned at the back..", "start": 513.849, "duration": 2.7}, {"text": "But don't be fooled into thinking that you can just put it on your desk and fire it up", "start": 516.829, "duration": 4.64}, {"text": "The power cord can only be inserted into the bottom once", "start": 521.569, "duration": 4.46}, {"text": "It's mounted on the included display stand but once you get it in there you can power this thing up by", "start": 526.029, "duration": 6.6}, {"text": "Sliding your finger down a capacitive strip at the front whoa", "start": 532.79, "duration": 4.429}, {"text": "Is that a thing of beauty or what?", "start": 537.98, "duration": 2.239}, {"text": "so it lights up these LED lights down both runways and", "start": 540.889, "duration": 5.15}, {"text": "And also add some blue accent lighting to the bottom now", "start": 546.529, "duration": 3.53}, {"text": "I wouldn't blame you guys for having decided by this point in the video that you need one of these", "start": 550.06, "duration": 5.94}, {"text": "Two which all I can say is", "start": 556.55, "duration": 2.0}, {"text": "Too frickin bad cuz unless you've got a cool", "start": 559.61, "duration": 2.63}, {"text": "$20,000 burning a hole in your pocket, You're just going to have to live without it", "start": 564.2, "duration": 4.429}, {"text": "But what you don't have to live without is TunnelBear, the simple VPN app that makes it easy to browse", "start": 569.99, "duration": 5.66}, {"text": "Privately and enjoy a more open Internet. With TunnelBear turned on, your network connection is secured and your online", "start": 575.84, "duration": 5.959}, {"text": "Activity is kept private from your internet provider", "start": 582.05, "duration": 2.09}, {"text": "Advertisers or anyone else looking to track you or profit from your data", "start": 585.05, "duration": 3.77}, {"text": "TunnelBear has a top rated privacy policy and does not log your activity", "start": 588.92, "duration": 3.26}, {"text": "and you can try TunnelBear for free with no credit card required at TunnelBear.com", "start": 592.4, "duration": 5.51}, {"text": "/ltt. We're gonna have that linked below", "start": 598.4, "duration": 2.599}, {"text": "So, thanks for watching guys if this video sucked", "start": 602.54, "duration": 2.42}, {"text": "You know what to do.", "start": 604.96, "duration": 0.93}, {"text": "But if it was awesome get subscribed , Hit that like button and check out the link to where to buy the stuff we featured in", "start": 605.89, "duration": 5.039}, {"text": "the video description", "start": 610.93, "duration": 1.12}, {"text": "Also, link down. There's our merch store, which has cool shirts like this one and our community forum", "start": 612.05, "duration": 4.369}, {"text": "which you should totally join. And let us know in the comments if you want to see a dedicated video taking a closer look at", "start": 616.42, "duration": 5.52}, {"text": "This guy, I'm kind of tempted at this point", "start": 621.94, "duration": 2.0}, {"text": "It is pretty sexerific...", "start": 624.38, "duration": 0.5}, {"text": " ", "start": 624.88, "duration": 1.5}]