[{"text": "Hey guys, today we're going to be taking a look at some big game snacks.", "start": 0.0, "duration": 3.1}, {"text": "Courtesy of my sponsor, SimpliSafe. Simply Safe is an easy to use, economical", "start": 3.2, "duration": 2.3}, {"text": "modular, intuitive, and totally customisable home security system.", "start": 5.6, "duration": 4.78}, {"text": "one that is, even as we speak making me feel more secure here, on the mean streets of New York City.", "start": 10.38, "duration": 6.12}, {"text": "More on that later, for now, let's get down to basics.", "start": 16.5, "duration": 1.34}, {"text": "(Intro music)", "start": 17.84, "duration": 10.56}, {"text": "Alright folks, first, lets address chicken wings, So delicious but so messy.", "start": 33.0, "duration": 4.84}, {"text": "That's why we're going to try our hand at making chicken wing lollipops.", "start": 37.84, "duration": 2.7}, {"text": "Which is a simple enough process. Let's start with the drumette.", "start": 40.54, "duration": 3.34}, {"text": "We're going to cut off the bottom of the drumette. Then using a small knife like a paring knife,", "start": 43.88, "duration": 4.14}, {"text": "We're going to scrape the meat and skin down to the other end of the drumette.", "start": 48.02, "duration": 3.64}, {"text": "Then, trim of any excess skin or sinew and push the meat down with your hands.", "start": 51.66, "duration": 3.38}, {"text": "All delicious imagery, I know. (laugh)", "start": 55.46, "duration": 1.6}, {"text": "And there you have it, with just a few seconds of extra effort.", "start": 57.06, "duration": 2.54}, {"text": "A much easier to eat chicken wing.", "start": 59.6, "duration": 1.7}, {"text": "Next up we have the wingettes, which are just a little bit more challenging,", "start": 61.3, "duration": 2.9}, {"text": "because we have to remove the bones altogether.", "start": 64.2, "duration": 2.0}, {"text": "we're going to start by cutting off the joint where the bones meat", "start": 66.52, "duration": 2.78}, {"text": "and then sliding the meat down both the bones, trying to isolate and separate the smaller bone.", "start": 69.3, "duration": 4.66}, {"text": "pulling it away from the rest of the wingette once you're able, and snipping between the two bones to", "start": 73.96, "duration": 4.2}, {"text": "remove it entirely. then we just gotta push the meat down the larger bone and rinse and repeat with", "start": 78.16, "duration": 4.62}, {"text": "the rest of our wings, just remember that your fellow sports fans will thank you for your consideration", "start": 82.78, "duration": 4.14}, {"text": "then making buffalo sauce is easy. 2 parts Frank's Red Hot to", "start": 86.98, "duration": 3.84}, {"text": "1 part melted unsalted butter. Whisk together and taste for tastiness, and there you go.", "start": 90.82, "duration": 4.16}, {"text": "next up , in a large pot over medium-high heat, we're  bringing 1 quart of vegetable or peanut oil", "start": 94.98, "duration": 4.64}, {"text": "to 375 degrees Fahrenheit and dropping our wings inside.", "start": 99.62, "duration": 2.68}, {"text": "Once everybody's in the hot tub and the  bubbles are turned on high,", "start": 102.3, "duration": 4.0}, {"text": "we're going to agitate every few minutes or so for ten minutes", "start": 106.3, "duration": 2.84}, {"text": "until the wings are cooked through and the skin is browned and crisp.", "start": 109.14, "duration": 3.062}, {"text": "We are then draining those on a wire rack for about five minutes, just to get all the excess oil off", "start": 112.202, "duration": 4.438}, {"text": "before we toss with our sauce.", "start": 116.64, "duration": 2.0}, {"text": "in an as large as possible of a bowl they go, all with a healthy glug of our buffalo sauce", "start": 118.64, "duration": 5.4}, {"text": "toss to combine- this is one of the essential parts of wing making, make sure you used", "start": 124.04, "duration": 3.16}, {"text": "enough sauce. There is no such thing as too much sauce", "start": 127.2, "duration": 2.58}, {"text": "toss again, and plate up. And there you have it, buffalo wings purpose  built for the big game.", "start": 129.78, "duration": 3.96}, {"text": "They can be eaten with one hand, so you can keep your other hand free for cheering", "start": 133.74, "duration": 2.4}, {"text": "or jeering or whipping your teammate with a sweaty towel.", "start": 137.84, "duration": 4.08}, {"text": "Jokes aside, these things are amazing. You can eat 'em in one bite if you wanna be real monster about it.", "start": 141.92, "duration": 3.16}, {"text": "But now it's time for some real carnage. Candied bacon.", "start": 145.08, "duration": 3.18}, {"text": "Or how i learned to stop worrying and love the cholesterol.", "start": 148.26, "duration": 3.76}, {"text": "first we are lining a sheet pan with some aluminum foil.", "start": 152.02, "duration": 2.82}, {"text": "topping with a wire rack lightly coated with nonstick spray", "start": 154.84, "duration": 1.9}, {"text": "shingling our bacon on top it. we want to use nice and thick cut bacon and not let any slices overlap.", "start": 156.74, "duration": 5.74}, {"text": "we're then going to give everybody a brush down with maple syrup and a good hearty sprinkling", "start": 162.48, "duration": 3.72}, {"text": "of light brown sugar", "start": 166.2, "duration": 1.8}, {"text": "we are then plunking into a 350 degree Fahrenheit oven for about ten minutes before removing", "start": 168.0, "duration": 4.54}, {"text": "and flipping each slice.", "start": 172.54, "duration": 2.54}, {"text": "we want to make sure our boys get a nice even, allover tan.", "start": 175.08, "duration": 3.02}, {"text": "so, after flipping, we are going to brush them down again once more with maple syrup and sprinkle 'em down", "start": 178.1, "duration": 3.58}, {"text": "once more with brown sugar.", "start": 181.68, "duration": 2.52}, {"text": "If you really are worried about the calories, you can always serve this with a nice, light arugula salad", "start": 184.2, "duration": 4.1}, {"text": "with shaved fennel as a sick, sick joke.", "start": 188.3, "duration": 1.6}, {"text": "Anyway, we are returning these to the oven for another ten minutes and flipping every five minutes,", "start": 189.9, "duration": 5.9}, {"text": "until we have nice, reddish mahogany, flexible but crispy bacon.", "start": 195.84, "duration": 4.4}, {"text": "We're going to let these cool completely for at least 30 minutes,", "start": 200.24, "duration": 3.16}, {"text": "which is going to allow our slabs of bacon to stiffen and reward us with some true pork candy.", "start": 203.4, "duration": 5.08}, {"text": "make two strips of bacon per person, and see if this stuff survives past the first quarter.", "start": 208.48, "duration": 5.5}, {"text": "I'm not even sure mine is going to make it to the end of this shot.", "start": 213.98, "duration": 1.8}, {"text": "This stuff is pure evil and I love it.", "start": 215.78, "duration": 1.46}, {"text": "Ok, so we've covered savory, we've covered savory-sweet, now onto just sweet.", "start": 217.24, "duration": 1.68}, {"text": "Take in the form of bite-sized churros, which starts with something that's pretty much choux pastry.", "start": 219.9, "duration": 5.7}, {"text": "In a small saucepan, we're combining 1 cup of water, 1/2 a stick of butter, 3 tablespoons dark brown sugar", "start": 225.6, "duration": 4.36}, {"text": "and a pinch of salt. we're bringing that to a boil, taking it off the heat, and adding 1 cup of all-purpose flour.", "start": 229.96, "duration": 4.82}, {"text": "Mixing vigorously until a stiff ball of dough forms.", "start": 235.66, "duration": 3.5}, {"text": "then, to this dough we are adding 2 medium beaten eggs.", "start": 239.16, "duration": 3.64}, {"text": "Mixing slowly at first and then vigorously again, until a smooth and pasty batter forms.", "start": 242.82, "duration": 5.62}, {"text": "That we are going to load into a pastry bag fitted with a large, decorative star shaped tip.", "start": 248.44, "duration": 2.9}, {"text": "Let's just do a pointless test squeeze on our hand here. Perfect.", "start": 251.34, "duration": 3.76}, {"text": "Then, into some oil measuring about 375 degrees Fahrenheit we are snipping small pieces of the dough into the oil,", "start": 255.28, "duration": 6.42}, {"text": "letting fry for about 2 minutes, and flipping constantly until deep golden brown.", "start": 261.7, "duration": 3.72}, {"text": "We are then extracting immediately onto  some paper towels to drain and tossing in some cinnamon sugar,", "start": 265.42, "duration": 4.96}, {"text": "that we are making from a little cinnamon and a whole lotta sugar.", "start": 270.38, "duration": 2.82}, {"text": "Maybe about a tablespoon of cinnamon to a cup of sugar.", "start": 273.2, "duration": 2.2}, {"text": "gently and quickly toss to combine, and plate up with a sauce of your choice. I'm going with caramel.", "start": 275.4, "duration": 5.08}, {"text": "These churros are so good that no mere walls or locking doors can protect them from all the", "start": 280.48, "duration": 5.22}, {"text": "snack-seeking marauders on the streets.", "start": 285.7, "duration": 1.76}, {"text": "And speaking of seamless segues into product sponsorships,", "start": 287.46, "duration": 3.2}, {"text": "Simply Safe can keep you, your family, and your snacks safe.", "start": 290.66, "duration": 2.34}, {"text": "It's super easy to set up, I set mine up in like in 15 minutes.", "start": 293.0, "duration": 3.72}, {"text": "Its totally customizable, you can add as many motion sensors, fire detectors, and entryway sensors as you like.", "start": 296.72, "duration": 4.68}, {"text": "Along with other accessories like panic buttons, key fobs, glass break detectors,  freeze detectors,", "start": 301.4, "duration": 5.04}, {"text": "water detectors, and a whole bunch of other stuff. It's all monitored by professionals 24/7", "start": 306.44, "duration": 5.38}, {"text": "who will call you or the police if necessary. It will still work if you lose power, wifi, or if the system is attacked,", "start": 311.82, "duration": 4.4}, {"text": "so if you're like me, and you're  tired of  protecting your home with nothing more than cast-iron pans, microplanes,", "start": 316.22, "duration": 6.34}, {"text": "and creme brulee torches, you might want to think about protecting your home with SimpliSafe.", "start": 322.56, "duration": 3.3}, {"text": "I know that I will be proudly displaying this yard sign in my imaginary yard.", "start": 325.86, "duration": 3.0}]