[{"text": "So you bought yourself an ergonomic keyboard spending not only hundreds of dollars,", "start": 0.03, "duration": 4.319}, {"text": "But also countless hours trying to master typing on the darn thing. But like that's fine.", "start": 4.35, "duration": 5.339}, {"text": "I guess right you can't put a price on health.", "start": 9.69, "duration": 2.37}, {"text": "But hold on a minute!", "start": 13.0, "duration": 1.769}, {"text": "What happens when you're not at your regular desk?", "start": 14.769, "duration": 3.05}, {"text": "Most of the ergonomic keyboards that we've tested have been large and cumbersome enough that you wouldn't want to travel with them.", "start": 18.16, "duration": 6.68}, {"text": "So what you're just doomed to aggravate your repetitive strain injury?", "start": 25.029, "duration": 3.98}, {"text": "Haha, no my friends for there is a light at the end of your carpal tunnel.", "start": 29.47, "duration": 5.69}, {"text": "Introducing... Yogitype!", "start": 36.219, "duration": 2.0}, {"text": "The foldable ergonomic keyboard.", "start": 38.739, "duration": 2.389}, {"text": "But is this thing a direct path to keyboard nirvana, or is it more like downward dogs*it.", "start": 42.18, "duration": 6.9}, {"text": "Speaking of nirvana today's video is brought to you by TunnelBear. TunnelBear makes really, really", "start": 50.22, "duration": 5.38}, {"text": "simple privacy apps so people can enjoy a more open Internet. Try TunnelBear for free at tunnelbear.com/ltt", "start": 55.86, "duration": 7.26}, {"text": "[Intro] - Song : Lazlo Supernova", "start": 65.12, "duration": 7.28}, {"text": "The Yogitype comes in a bougie carrying case that will absolutely make people want to be your friend, and", "start": 72.64, "duration": 4.94}, {"text": "Inside you'll find the base, wrist pads and the keypad set up is a snap.", "start": 77.78, "duration": 4.79}, {"text": "At first it might seem like you're typing upside-down or something. Since you're looking at the underside of the keyboard as you type.", "start": 82.97, "duration": 7.94}, {"text": "But actually the Yogitype is kind of like the safe type keyboard that we *clicks* checked out before.", "start": 91.28, "duration": 6.139}, {"text": "except on steroids", "start": 98.0, "duration": 1.77}, {"text": "The main idea of having a vertically standing keyboard like this is to prevent what's called pronation.", "start": 99.77, "duration": 6.319}, {"text": "That's when the two bones in your forearm crisscross, pinching tissue and blood vessels", "start": 106.46, "duration": 5.51}, {"text": "Of course though having the keys on the side makes them harder to see.", "start": 112.36, "duration": 4.52}, {"text": "And let's be honest even the touchiest of touch typists will look at the keyboard,", "start": 116.92, "duration": 5.86}, {"text": "sometimes. But instead of janky rearview mirrors the inward angle of the key modules allowed Yogitype's creators to implement a", "start": 123.64, "duration": 7.76}, {"text": "much more elegant visual aid colored LEDs", "start": 131.41, "duration": 3.389}, {"text": "And you can even switch them off if you prefer.", "start": 134.799, "duration": 3.27}, {"text": "And this angle has some economic benefits as well helping with extension and finger relaxation.", "start": 138.07, "duration": 6.989}, {"text": "Speaking of relaxation the included wrist pads are...", "start": 145.78, "duration": 3.1}, {"text": "Super cushy. Easy to adjust and the best part is they slide so they don't inhibit your natural movements.", "start": 149.14, "duration": 7.78}, {"text": "This is so much better than having to hold your arms up the whole time like on the safe type.", "start": 157.12, "duration": 5.78}, {"text": "My only gripe is that you can't adjust their height, and I think that they're a little bit, too", "start": 163.46, "duration": 5.0}, {"text": "Tall to fully alleviate the last economic pitfall. Ulnar Deviation", "start": 168.78, "duration": 4.08}, {"text": "Okay, so this is all quite positive so far, but what's it like to actually type on this thing?", "start": 174.11, "duration": 5.719}, {"text": "Well at first it wasn't too bad since they've got tactile guides for both your index", "start": 180.799, "duration": 5.39}, {"text": "and pinky fingers. As well as this sort of inexplicable one on the", "start": 186.19, "duration": 4.35}, {"text": "8-key. And most of the keys are in the same relative position as they are on a regular keyboard", "start": 190.97, "duration": 6.019}, {"text": "Most of them. I mean, hey I get it this is ten keyless board and there's no room for keys on the foldable base", "start": 198.139, "duration": 7.12}, {"text": "so you're just gonna have to get used to the more obscure keys like home and end,", "start": 205.26, "duration": 5.729}, {"text": "Having new homes on the end.", "start": 211.12, "duration": 2.449}, {"text": "But what about non-obscure keys? They moved the apostrophe key to no man's land and", "start": 214.269, "duration": 6.08}, {"text": "Backspace. a key that I use a lot more than I'd like to admit, though", "start": 221.23, "duration": 4.369}, {"text": "Probably still less than I should has been moved to right beside the P key which means that when you make a mistake", "start": 225.879, "duration": 6.65}, {"text": "Typing on this strange new keyboard you have to rectify it by using your pinky in unfamiliar territory", "start": 232.84, "duration": 6.44}, {"text": "Which often leads to making even more mistakes making you so", "start": 239.28, "duration": 3.68}, {"text": "unproductive that you just end up putting the Yogitype in a bin under your desk for two weeks while you review other stuff", "start": 242.96, "duration": 5.68}, {"text": "But Linus, backspace has to go somewhere doesn't it? Well, of course it does and", "start": 249.43, "duration": 5.029}, {"text": "My vote is to take over some of that spacebar real estate this would not only flatten the learning curve", "start": 254.95, "duration": 6.02}, {"text": "but also make it more ergonomic since you have way more power up here than you do with your little finger,", "start": 260.97, "duration": 6.269}, {"text": "but I'm actually not going to stop there as is the space keys are positioned to be pressed with the base of your finger", "start": 267.76, "duration": 6.169}, {"text": "Which works, and it's actually kind of innovative", "start": 273.93, "duration": 2.459}, {"text": "But it does disrupt your index fingers ability to continue typing so our", "start": 276.42, "duration": 5.6}, {"text": "Preference would be to strike the space and backspace keys with the thumb like you do on the Kinesis advantage - or the erga docks", "start": 282.04, "duration": 7.7}, {"text": "Except that these bloody joysticks are in the way not that thumb sticks are a bad idea", "start": 290.44, "duration": 6.06}, {"text": "Inherently, so these are for controlling the mouse cursor page scrolling and right and left clicks", "start": 296.5, "duration": 5.72}, {"text": "You can even switch between left and right-handed mouse configurations right on the board", "start": 302.289, "duration": 4.79}, {"text": "And I'm positive that there are some users out there who need to be able to do that from a neutral position", "start": 307.08, "duration": 6.22}, {"text": "The problem is that the mouse is effectively unusable it has crazy", "start": 313.68, "duration": 5.26}, {"text": "Acceleration unruly steering, and I'm not sure if our right stick is broken", "start": 319.38, "duration": 4.54}, {"text": "But we had trouble moving it at all without highlighting everything if they insist on keeping the onboard mouse I would suggest", "start": 323.92, "duration": 7.36}, {"text": "replacing the joysticks with", "start": 331.599, "duration": 2.0}, {"text": "Marble-sized trackball or something like how cool would that be. One last complaint.", "start": 333.94, "duration": 4.549}, {"text": "Did anybody else notice that the keys on this side are staggered", "start": 339.34, "duration": 4.28}, {"text": "and the keys on this side are all aligned", "start": 344.46, "duration": 2.46}, {"text": "WTF?", "start": 347.86, "duration": 1.78}, {"text": "(Oh, Linus)", "start": 350.0, "duration": 0.88}, {"text": "Anyway", "start": 351.64, "duration": 1.1}, {"text": "Should you buy this keyboard then at about a three hundred and fifty dollars? It's $60 more than the", "start": 353.34, "duration": 7.2}, {"text": "Awful SafeType, but is better in just about every way including the switches. This one is way less mushy", "start": 361.119, "duration": 6.89}, {"text": "Though with that said the Advantage 2 is the same price", "start": 368.5, "duration": 3.8}, {"text": "is mechanical and though it doesn't fold up", "start": 372.74, "duration": 3.099}, {"text": "It is portable in the sense that all the macros and the layouts that you program onto", "start": 375.839, "duration": 5.22}, {"text": "it are saved on board so", "start": 381.06, "duration": 3.26}, {"text": "I wouldn't say that it sucks", "start": 385.14, "duration": 2.0}, {"text": "but the Yogitype has enough small things wrong with it at this point that giving it our full endorsement would be", "start": 387.46, "duration": 6.56}, {"text": "a bit of a stretch", "start": 394.42, "duration": 2.0}, {"text": "Which can't be said about Squarespace! Squarespace is the place to go to build your own beautiful", "start": 397.329, "duration": 6.77}, {"text": "Functional website they've got 24/7 support via live chat and email, they've got tons of great features including", "start": 404.739, "duration": 7.339}, {"text": "Lots of gorgeous templates the ability to use commerce on any website they all come with a free online store", "start": 412.839, "duration": 6.77}, {"text": "They've got their logo designer", "start": 419.619, "duration": 1.97}, {"text": "they've got cover pages a feature that allows you to set up a beautiful one-page online presence in minutes and", "start": 421.589, "duration": 5.13}, {"text": "The ability to publish content in Apple news format directly from the Squarespace blog", "start": 426.879, "duration": 5.72}, {"text": "It's all easily managed in the cloud and their sites are super reliable that's not actually in my talking points", "start": 432.72, "duration": 6.1}, {"text": "That's just my personal experience with Squarespace. So head over to squarespace.com/ltt", "start": 439.2, "duration": 7.02}, {"text": "and use code ltt to get 10% off your first purchase. Why not have a website go try it out today", "start": 446.42, "duration": 7.4}, {"text": "So thanks for watching guys if this video sucked", "start": 454.34, "duration": 2.02}, {"text": "You know what to do?", "start": 456.36, "duration": 0.599}, {"text": "But if it's awesome", "start": 456.96, "duration": 0.879}, {"text": "Hit that like button get subscribed or maybe consider checking out where to buy the stuff. We featured at the link in the video description", "start": 457.84, "duration": 5.92}, {"text": "Also linked down there's our merch store, which has cool shirts like this one and our community forum, which should totally join", "start": 463.98, "duration": 6.26}]