[{"text": "If it's 37°C outside and our internal body temperature is 37°C,", "start": 0.0, "duration": 4.02}, {"text": "why are we hot?", "start": 4.359, "duration": 1.23}, {"text": "Why do fans help us feel cooler?", "start": 5.589, "duration": 2.711}, {"text": "This may sound obvious, but it's not. How does sweating help us", "start": 8.3, "duration": 3.249}, {"text": "cool down, and I mean how does the fact that our body produces droplets of water", "start": 11.55, "duration": 4.229}, {"text": "allow us to cool down? During the heat wave, you've sent me a lot of", "start": 16.119, "duration": 4.37}, {"text": "heat-related questions you wanted me to address in a video.", "start": 20.59, "duration": 3.65}, {"text": "Honestly I thought that the answers were obvious", "start": 24.24, "duration": 1.529}, {"text": "until I looked into it and actually learned a few things.", "start": 26.26, "duration": 3.08}, {"text": "I hope you will too. Here are the answers to three of your questions.", "start": 29.84, "duration": 4.68}, {"text": "This video is", "start": 34.68, "duration": 0.5}, {"text": "sponsored by NordVPN, more information about this at the end of the video.", "start": 35.26, "duration": 3.74}, {"text": "Why do we get hot when it's 37°C outside when that's the human body's temperature?", "start": 39.46, "duration": 5.1}, {"text": "Our internal temperature ranges between 36.1 and 37.8°C.", "start": 44.56, "duration": 2.9}, {"text": "But that doesn't mean that the air should be at this temperature for us to feel comfortable.", "start": 47.46, "duration": 5.4}, {"text": "In fact, for humans to be neither hot nor cold but just right, it is necessary for the difference between the heat", "start": 52.989, "duration": 5.959}, {"text": "that we generate to live (linked to muscular activity, to digestion, etc)", "start": 59.17, "duration": 3.81}, {"text": "and the heat we lose to our environment,", "start": 62.98, "duration": 2.179}, {"text": "to be at 37°C. And it turns out that we generate so much heat that according to this article,", "start": 65.32, "duration": 6.709}, {"text": "this balance is struck when the outside temperature", "start": 72.39, "duration": 2.129}, {"text": "is around 21°C, not 37. Take this number with a grain of salt,", "start": 74.89, "duration": 5.419}, {"text": "as each person produces more or less heat. Women especially", "start": 80.67, "duration": 3.269}, {"text": "tend to be more comfortable in an environment slightly above 21°C.", "start": 84.07, "duration": 4.03}, {"text": "The question of an optimal temperature", "start": 88.1, "duration": 1.749}, {"text": "isn't simple; that will be the subject of a future video.", "start": 89.979, "duration": 2.779}, {"text": "Temperature is often above 21°C in the summertime, which means that we produce too much heat compared to what we", "start": 92.939, "duration": 5.49}, {"text": "release in the outside air; we risk overheating.", "start": 98.43, "duration": 2.07}, {"text": "Ideally, we would produce as little heat as possible, hence the existence", "start": 100.5, "duration": 4.739}, {"text": "of naps which allow us to remain at a low effort level,", "start": 105.369, "duration": 2.45}, {"text": "or we could evacuate the extra heat.", "start": 108.1, "duration": 2.42}, {"text": "And for this purpose, we have 4 four main tactics: convection, conduction, radiation and perspiration.", "start": 110.52, "duration": 4.349}, {"text": "I won't go into all of them, but here's the first one.", "start": 115.14, "duration": 2.43}, {"text": "Why does a fan makes us feel cool?", "start": 117.82, "duration": 3.52}, {"text": "That's the question that seems simple but ultimately isn't.", "start": 121.34, "duration": 2.74}, {"text": "The question is well formulated because", "start": 124.08, "duration": 1.319}, {"text": "technically", "start": 125.399, "duration": 1.711}, {"text": "a fan doesn't help cool down a room, it warms it up.", "start": 127.11, "duration": 2.36}, {"text": "It's an electrical device that makes a current flow and releases heat.", "start": 129.619, "duration": 3.263}, {"text": "So if you're not in the room", "start": 132.882, "duration": 1.387}, {"text": "turn off the fan, it's only going to heat up the air.", "start": 134.42, "duration": 2.0}, {"text": "On the other hand if you receive air from a fan, then you can have a perception of freshness thanks to", "start": 136.43, "duration": 4.86}, {"text": "what you probably already know, convection. The air that's in contact with your skin gets", "start": 141.45, "duration": 5.21}, {"text": "heated and moist from your sweat", "start": 146.88, "duration": 2.92}, {"text": "and so your heat escapes from your body which cools you down, great.", "start": 149.8, "duration": 3.58}, {"text": "But only to a certain extent. If the air is static, heat exchange", "start": 153.63, "duration": 3.199}, {"text": "stops when it reaches equilibrium.", "start": 156.99, "duration": 2.35}, {"text": "When there is a gust of wind or air from a fan, this hot and humid layer", "start": 159.34, "duration": 3.01}, {"text": "is swept away and replaced by a new layer of air,", "start": 162.51, "duration": 2.84}, {"text": "to which you once again", "start": 165.54, "duration": 1.59}, {"text": "will transfer some of your body heat.", "start": 167.13, "duration": 2.69}, {"text": "That's how you cool down with a fan,", "start": 169.82, "duration": 2.099}, {"text": "by heating and humidifying air that is constantly getting renewed.", "start": 172.02, "duration": 3.9}, {"text": "Except that if the air is extremely hot, warmer than your skin,", "start": 175.92, "duration": 2.659}, {"text": "this effect is completely reversed.", "start": 178.88, "duration": 1.08}, {"text": "If you keep sending hot air towards your skin, you'll be receiving air that's", "start": 179.96, "duration": 3.479}, {"text": "warmer than your skin and heat exchange will work the wrong way around, with your body heating up.", "start": 183.66, "duration": 5.029}, {"text": "The World Health Organization clearly distinguishes", "start": 189.06, "duration": 2.37}, {"text": "the use of a fan when ambient temperature is below or above the temperature of the skin (about 35°C).", "start": 191.43, "duration": 6.71}, {"text": "Above 35°C,", "start": 198.18, "duration": 0.86}, {"text": "they recommend not to send air directly to your skin", "start": 199.04, "duration": 3.22}, {"text": "and to drink plenty of water. Why drink a lot of water? Because by chasing air away", "start": 202.26, "duration": 2.899}, {"text": "we increase the evaporation of our perspiration, so we need to", "start": 205.16, "duration": 2.609}, {"text": "compensate by drinking a little more.", "start": 208.049, "duration": 2.111}, {"text": "Yes, but several other research articles have appeared in recent years, which are in disagreement", "start": 210.16, "duration": 4.299}, {"text": "with the recommendations of the WHO. And a 2012 systematic review", "start": 214.62, "duration": 2.779}, {"text": "called Cochrane Review concluded that... they didn't know where they stood.", "start": 217.65, "duration": 5.089}, {"text": "Although there is still no consensus on the use of a fan above 35°C,", "start": 222.89, "duration": 4.097}, {"text": "which seems a little crazy,", "start": 226.987, "duration": 1.093}, {"text": "some studies seem to agree on the matter of older people.", "start": 228.14, "duration": 3.7}, {"text": "During heat waves and extreme humidity, the use of a fan", "start": 231.84, "duration": 2.45}, {"text": "increases physiological stress in the elderly and not in young adults.", "start": 234.6, "duration": 3.889}, {"text": "The reason for this being that the heat regulation capabilities of the elderly", "start": 239.04, "duration": 3.5}, {"text": "are less good, they sweat less and have less ability to adjust the diameter of their blood vessels at the extremities", "start": 242.85, "duration": 5.779}, {"text": "which is one of the physiological adjustments", "start": 248.97, "duration": 1.95}, {"text": "that allows us to increase our heat loss.", "start": 250.92, "duration": 3.12}, {"text": "So, when the air temperature exceeds 35°C, the elderly should", "start": 254.04, "duration": 3.169}, {"text": "follow the WHO recommendations. But if you are not an elderly person,", "start": 257.519, "duration": 3.41}, {"text": "what should you do when it's over 35°C? Well honestly, I don't know.", "start": 261.12, "duration": 4.88}, {"text": "So I propose to work around the problem by using another way to lower your temperature even more efficiently,", "start": 266.06, "duration": 5.26}, {"text": "much more efficiently than using a fan;", "start": 271.32, "duration": 1.78}, {"text": "drink drink drink drink drink--water of course.", "start": 273.44, "duration": 3.4}, {"text": "Why drink? Because it allows us to enjoy another cooling mechanism,", "start": 276.84, "duration": 4.06}, {"text": "evaporation. How does perspiration help to evacuate body temperature?", "start": 281.52, "duration": 4.309}, {"text": "Sweating is our most efficient cooling system is by far.", "start": 286.44, "duration": 4.14}, {"text": "That's why you're told to drink non-stop during a heat wave.", "start": 290.58, "duration": 1.819}, {"text": "You can lose up to two liters of water per hour, so you have to compensate that loss by drinking.", "start": 292.61, "duration": 4.444}, {"text": "But how does sweating", "start": 297.06, "duration": 2.16}, {"text": "reduce our internal heat?", "start": 299.22, "duration": 1.56}, {"text": "Think about it for two seconds because it's really not so obvious.", "start": 300.78, "duration": 3.38}, {"text": "It isn't perspiration itself that allows the body to cool down,", "start": 304.16, "duration": 2.94}, {"text": "but evaporation.", "start": 307.37, "duration": 1.65}, {"text": "If you wipe your sweat, if it runs to the ground or if it ends up in your clothes", "start": 309.02, "duration": 4.05}, {"text": "these drops of sweat probably didn't contribute to cooling you down.", "start": 313.29, "duration": 5.359}, {"text": "Only the evaporation of your sweat from the skin, meaning its", "start": 319.229, "duration": 2.39}, {"text": "steam liquid transformation, allows you to lower your temperature.", "start": 321.72, "duration": 4.72}, {"text": "So in the summertime, you should dress lightly to increase your surface", "start": 326.44, "duration": 3.95}, {"text": "of evaporation, which most of you probably already do. Sweating from your pores", "start": 330.39, "duration": 4.759}, {"text": "isn't what matters, it's the evaporation that counts because evaporation uses energy.", "start": 335.24, "duration": 4.35}, {"text": "Energy that comes from our internal heat.", "start": 340.2, "duration": 2.119}, {"text": "Our skin and the sweat drop are both at the same temperature", "start": 342.75, "duration": 3.109}, {"text": "and you know what temperature really is, it reflects the thermal agitation of the molecules.", "start": 345.96, "duration": 2.0}, {"text": "The more they jiggle,", "start": 347.96, "duration": 3.54}, {"text": "the hotter it is. When it's hot, let's say the molecules are twerking", "start": 351.81, "duration": 3.529}, {"text": "and when it's cold, they're doing Tai Chi.", "start": 355.44, "duration": 3.38}, {"text": "And in the middle of the heat wave the molecules twerk", "start": 358.82, "duration": 2.19}, {"text": "and breakdance all at once. In their liquid state, these molecules of water, since sweat is mostly water,", "start": 361.11, "duration": 4.75}, {"text": "are all linked to each other.", "start": 365.86, "duration": 1.27}, {"text": "They twerk while holding hands, if you will.", "start": 367.31, "duration": 2.13}, {"text": "If they weren't linked, if they didn't 'hold hands', then these free molecules would be vapor.", "start": 369.59, "duration": 4.86}, {"text": "This is what distinguishes a liquid from vapor. With thermal agitation,", "start": 374.66, "duration": 3.389}, {"text": "some molecules will get so agitated that they'll break the bonds that hold them to the rest of the group", "start": 378.24, "duration": 4.73}, {"text": "and then become steam. But in order to escape from the rest of the liquid,", "start": 383.12, "duration": 3.239}, {"text": "they need to absorb energy from their environment. This energy is the heat they take away from us", "start": 386.56, "duration": 4.529}, {"text": "and that's good. And if our skin's heat is used to evaporate our sweat", "start": 391.34, "duration": 4.489}, {"text": "it's good that this heat is removed from our body.", "start": 395.96, "duration": 2.869}, {"text": "We get cooler. Where it gets complicated is that for sweat to evaporate, it must have somewhere to go.", "start": 398.96, "duration": 5.42}, {"text": "When the air is very humid, water has a lot more difficulty evaporating because the atmosphere is already saturated, and that's one of the reasons", "start": 404.54, "duration": 5.809}, {"text": "why humid heat is much more difficult to tolerate than dry heat at equal temperatures.", "start": 410.35, "duration": 6.149}, {"text": "Our perspiration evaporates very little and therefore cools us only a little.", "start": 416.78, "duration": 3.32}, {"text": "These were the questions you asked.", "start": 420.169, "duration": 3.451}, {"text": "If you also want to send me a question I will tell you how to do it right after this message.", "start": 423.62, "duration": 4.129}, {"text": "This video was sponsored by NordVPN. I'm very happy to have them as my first private sponsor", "start": 431.74, "duration": 5.309}, {"text": "because I've been using their services for over a year.", "start": 437.15, "duration": 2.72}, {"text": "No, I did not subscribe just last month to do the promo, I use it for real. I will give you the 2", "start": 440.36, "duration": 5.15}, {"text": "main reasons why I use it and you can evaluate", "start": 445.51, "duration": 2.609}, {"text": "whether subscribing to NordVPN is interesting for you.", "start": 448.37, "duration": 3.23}, {"text": "My first reason is to secure my Internet connection. I'm often on the move to film, so I'm often using public WiFi networks.", "start": 451.669, "duration": 6.77}, {"text": "There's always a risk of data theft in this situation, someone could", "start": 458.44, "duration": 3.419}, {"text": "intercept the data I'm sending on the Internet.", "start": 461.93, "duration": 2.149}, {"text": "To avoid this, you have to encrypt the connection and that's what NordVPN does, which is pretty reassuring.", "start": 464.21, "duration": 4.88}, {"text": "The second reason is to have access to online services that are geolocated.", "start": 469.69, "duration": 2.88}, {"text": "You can choose one of the 61 countries where they have servers, which tells the rest of the Internet", "start": 473.06, "duration": 6.799}, {"text": "that you are connected from that country, when that's not true.", "start": 480.02, "duration": 3.2}, {"text": "I am a French expat living in Canada so I often connect to a French server to watch YouTube videos or replays that are", "start": 483.65, "duration": 6.17}, {"text": "available only in France. So rather than crossing the Atlantic I'll just", "start": 489.95, "duration": 2.75}, {"text": "turn on the VPN.", "start": 493.19, "duration": 1.08}, {"text": "By the way, I recommend you watch a comedy show that I love called Baroness von Sketch.", "start": 494.27, "duration": 4.99}, {"text": "Some episodes are on YouTube if you want to try it out", "start": 499.26, "duration": 2.17}, {"text": "but the whole show is available only in Canada, so you can either cross the Atlantic--which is good too, we have", "start": 501.43, "duration": 6.0}, {"text": "beautiful forests and beautiful lakes here--or you can use", "start": 507.8, "duration": 2.0}, {"text": "NordVPN. If my reasons convinced you then you can subscribe by going to NordVPN.com/Scilabus", "start": 509.95, "duration": 5.82}, {"text": "It will grant you a 75% discount if you take a three-year subscription which amounts to", "start": 515.87, "duration": 5.549}, {"text": "2.99 US dollars and with the conversion that's below 3 euros per month. And if you enter the code", "start": 521.94, "duration": 5.0}, {"text": "Scilabus you will also get 1 month for free. If like me, you have many devices that connect to the Internet,", "start": 527.16, "duration": 4.82}, {"text": "NordVPN also allows the simultaneous use of six devices.", "start": 532.08, "duration": 3.829}, {"text": "In short, go to NordVPN.com/Scilabus and use the code Scilabus and poof! Your Internet will be more secure.", "start": 536.79, "duration": 6.229}, {"text": "As I've been getting more and more suggestions and requests for video topics from you, I've created a", "start": 546.39, "duration": 4.279}, {"text": "form to centralize all your requests.", "start": 550.8, "duration": 2.09}, {"text": "The link is in the description. That doesn't mean that all future videos will be answers to your questions", "start": 553.16, "duration": 5.07}, {"text": "especially because I already have a ton of topics to cover, but if I can cover a question in a video like this one,", "start": 558.959, "duration": 5.809}, {"text": "why not. I hope you enjoyed this video, we only scratched the surface", "start": 565.41, "duration": 2.989}, {"text": "of the subject, it's much more complex than it seems and we could do a whole series of videos just about this.", "start": 568.56, "duration": 5.539}, {"text": "If you suffer from the heat, I've put the official recommendations on how best to protect yourself in the description.", "start": 574.16, "duration": 5.88}, {"text": "I'll see you again next time and I wish you a nice summer. See you soon, bye.", "start": 580.44, "duration": 5.029}]