[{"text": "Hey, hey, man", "start": 0.66, "duration": 1.46}, {"text": "Something bothering you?", "start": 2.62, "duration": 1.7}, {"text": "Well now that Erased is done. I have nothing to watch.", "start": 4.32, "duration": 4.02}, {"text": "Oh c'mon, don't be silly. That's the beauty of crunchyroll. There is always something to watch", "start": 8.56, "duration": 6.38}, {"text": "Like what?", "start": 16.2, "duration": 1.46}, {"text": "Well you and everyone can check out this season's new lineup of quite promising animes like KiznAiver", "start": 17.66, "duration": 5.24}, {"text": "Bungo stray dogs and Re: ZERO with yet another free trial by using the link crunchyroll.com/domics", "start": 22.9, "duration": 6.72}, {"text": "Whoa awesome!!", "start": 29.7, "duration": 1.88}, {"text": "YEAH!!", "start": 31.58, "duration": 1.96}, {"text": "I still miss erased though. Yeah. It was a pretty good anime. Wasn't it? I mean can you believe the killer was-", "start": 34.09, "duration": 6.799}, {"text": "MUSIC/INTRO (Domics)", "start": 40.889, "duration": 3.211}, {"text": "Back in senior year of high school. I had just recently broken up, but, well dumped by my Ex at the time (rip)", "start": 45.96, "duration": 6.9}, {"text": "Jessica, I mean as much as I didn't deserve someone like her", "start": 53.11, "duration": 3.349}, {"text": "I was still sad you know being dumped just does something to you and your self-esteem", "start": 56.46, "duration": 5.25}, {"text": "And I definitely needed something new to keep me occupied and help me move on", "start": 61.71, "duration": 4.11}, {"text": "I did have Taekwondo but my other Ex was still also there I had video games", "start": 66.34, "duration": 5.569}, {"text": "But that also got pretty lonely at times (relatable)", "start": 71.909, "duration": 2.411}, {"text": "I really just wanted to surround myself with people which was kind of odd coming from an introvert (0_o)", "start": 74.32, "duration": 5.06}, {"text": "So I decided to join a sports team", "start": 79.38, "duration": 3.0}, {"text": "Yeah", "start": 83.02, "duration": 1.169}, {"text": "While I like playing certain sports, I never really thought I was good enough to be part of a team", "start": 84.22, "duration": 4.5}, {"text": "Especially in America where they take sports like EXTREMELY SERIOUSLY (Over dramatized)", "start": 88.78, "duration": 3.86}, {"text": "on top of that my short height", "start": 93.3, "duration": 1.98}, {"text": "Definitely put me at a disadvantage in many aspects as much as I want to believe you when you tell me nonsense Dom", "start": 95.29, "duration": 5.809}, {"text": "You could do anything if you put your mind into it. I'm just being honest and realistic (dat face tho)", "start": 101.1, "duration": 4.47}, {"text": "I'm not the main", "start": 106.03, "duration": 1.29}, {"text": "Protagonist of some sports anime where I have some sort of dormant hidden talent that can only be awakened through a 24 episode Arc", "start": 107.32, "duration": 6.439}, {"text": "Anyway, I checked out which teams were available and I decided to join the track team", "start": 114.25, "duration": 4.219}, {"text": "it was a simple concept sport you literally just have to run (duh)", "start": 119.02, "duration": 4.52}, {"text": "I Might have been heavily influenced by all the animes", "start": 123.939, "duration": 2.75}, {"text": "I watched as a kid, but just being able to move really fast appealed to me by the way don't run", "start": 126.689, "duration": 6.571}, {"text": "like this -.-", "start": 133.38, "duration": 0.74}, {"text": "I had a kid tried to run like this on the team and my coach totally roasted them and ruined their dreams of being Hokage", "start": 134.12, "duration": 5.489}, {"text": "This wasn't my first time doing track anyway, so I thought it would be fun to do it again", "start": 140.25, "duration": 4.1}, {"text": "There was however this connotation that if you did track it was because you didn't make the cut from another sports team", "start": 144.51, "duration": 6.529}, {"text": "but it was kind of obvious who joined the team because they", "start": 151.17, "duration": 2.63}, {"text": "Genuinely liked track and those who joined just because their friends didn't wanted to hang out late after school", "start": 153.93, "duration": 4.669}, {"text": "Anyway, I signed up and the first practice was a week later", "start": 159.63, "duration": 3.41}, {"text": "I show up and see a few familiar faces some of which were my friends", "start": 163.04, "duration": 3.69}, {"text": "So I was glad that I had people to talk to but there were some familiar faces that I did not particularly find appealing", "start": 166.73, "duration": 6.329}, {"text": "My Ex along with buttface McGee that. She started seeing soon after we broke up and by soon", "start": 173.64, "duration": 5.7}, {"text": "I mean like days like not even a week", "start": 179.34, "duration": 2.8}, {"text": "WHY ARE YOU TESTING ME!!!", "start": 182.66, "duration": 2.18}, {"text": "So I had to deal with that and it was funny because I knew that they knew that I was uncomfortable seeing them together", "start": 185.55, "duration": 7.13}, {"text": "So they tried super hard to like be subtle about their relationship like when we had to stretch", "start": 192.93, "duration": 5.21}, {"text": "They purposefully like be away from each other or if we have to do certain running activities they try to be in separate groups", "start": 198.14, "duration": 5.909}, {"text": "But whether it was out of respect and understanding for me", "start": 204.66, "duration": 2.899}, {"text": "Or I don't know fear that only lasted like 2 or 3 practices until they decided to just do whatever they want in", "start": 207.56, "duration": 6.72}, {"text": "Hindsight. I guess it was kind of a good thing that they were there", "start": 214.74, "duration": 3.169}, {"text": "I saw them as rivals that motivated me to push myself to my limits and after a while", "start": 217.91, "duration": 4.32}, {"text": "it stopped being about trying to beat them but more about trying to build my self-discipline", "start": 222.23, "duration": 4.409}, {"text": "I mean, I still didn't enjoy their presence, but after a while. You kind of just stopped minding it", "start": 226.64, "duration": 6.75}, {"text": "Track was a great outlet for me and helped me get my mind off a lot of things it also helped me boost my confidence", "start": 233.91, "duration": 5.269}, {"text": "Because whenever we went to track meets. I was pretty much always the shortest kid on the track", "start": 239.22, "duration": 4.85}, {"text": "It's pretty damn intimidating being there on the starting line", "start": 244.23, "duration": 3.109}, {"text": "And you look at your competitors towering over you with their long", "start": 247.34, "duration": 3.089}, {"text": "Lamppost looking ass limbs like you know one of their strides equal like three of yours (lmao)", "start": 250.77, "duration": 4.639}, {"text": "But you can still compete with them on even grounds", "start": 255.41, "duration": 2.549}, {"text": "But one of my fondest memories in my time during track was when my coach asked me to be the anchor leg for the four", "start": 257.97, "duration": 6.05}, {"text": "By four hundred meter relay, which is basically the person who runs the last stretch now", "start": 264.02, "duration": 4.85}, {"text": "I wasn't the fastest sprinter on the team", "start": 268.87, "duration": 2.609}, {"text": "I can admit that much but my coach did see how much my times improved over the weeks and practice and thought I could handle", "start": 271.48, "duration": 5.85}, {"text": "this responsibility", "start": 277.33, "duration": 1.69}, {"text": "as much of an honor as it was", "start": 279.02, "duration": 2.0}, {"text": "Bricks were coming out of my butthole because I was so nervous and worried that I'd let the team down (nice)", "start": 281.15, "duration": 4.639}, {"text": "*GUNSHOT", "start": 285.789, "duration": 2.0}, {"text": "Oh jeez okay, we can do this. Okay. Come on Steven give us a strong start yeah", "start": 287.84, "duration": 6.199}, {"text": "okay, okay, you're last but", "start": 294.64, "duration": 2.02}, {"text": "That's okay cuz cuz Mark's gonna pick it up from there. We're not that far behind (3rd). Yeah", "start": 297.32, "duration": 5.28}, {"text": "Okay, okay, okay. Good good", "start": 303.26, "duration": 3.02}, {"text": "Okay, second is good. Okay. Let's go. Let's go mark. Yeah", "start": 306.98, "duration": 4.519}, {"text": "Okay, okay after Daniel. Okay? It's me", "start": 313.28, "duration": 2.9}, {"text": "Okay, no worries Daniel's a boost. Okay. He'll get us a good lead. Come on. Come on. Come on", "start": 317.3, "duration": 7.399}, {"text": "Okay, okay. Don't don't focus on the lead. Okay, just just make just make the smooth transition and", "start": 325.64, "duration": 6.529}, {"text": "GO!!!!", "start": 334.01, "duration": 2.0}, {"text": "And I just frickin went full ham adrenaline Super Saiyan Captain Falcon mode", "start": 337.73, "duration": 4.579}, {"text": "I bolted it and ran as fast as my short Hamster legs could go", "start": 342.31, "duration": 3.24}, {"text": "Final hundred meters last stretch there was no one in front of me", "start": 346.16, "duration": 3.529}, {"text": "I was so surprised and in such disbelief that I just had to peek and one thing our coach told us never to do was", "start": 349.69, "duration": 6.119}, {"text": "Look back, but I did I think and there may be two guys on my tail just that oh crap", "start": 355.81, "duration": 6.18}, {"text": "This is pretty close realization. Gave me the extra boost to summon up. Whatever energy. I had left and expand my lead gap", "start": 361.99, "duration": 6.72}, {"text": "We won.", "start": 369.62, "duration": 2.02}, {"text": "Well not the whole track meet", "start": 371.64, "duration": 1.21}, {"text": "But we won that specific event and while it may seem like a small accomplishment for some it meant a huge deal for me. #Achievement", "start": 372.85, "duration": 7.11}, {"text": "So I guess moral of the story is if you're trying to decide", "start": 381.48, "duration": 2.959}, {"text": "What sports team to join pick the one with your accident or someone you hate", "start": 384.44, "duration": 3.93}, {"text": "I don't know just looking at them will piss you off so much that you'll be able to run like Sonic", "start": 388.37, "duration": 4.5}, {"text": "Also, just following up on what I mentioned earlier you guys can sign up for a 30 day free trial of crunchyroll premium", "start": 394.5, "duration": 5.51}, {"text": "By going to crunchyroll.com/domics or by clicking on the link in the description", "start": 400.01, "duration": 4.17}, {"text": "What does premium membership get you? unlimited anime,Manga and drama titles.", "start": 404.4, "duration": 4.94}, {"text": "Newest episodes as soon as one hour after airing in Japan", "start": 409.74, "duration": 2.839}, {"text": "professionally subtitled episodes", "start": 413.46, "duration": 2.0}, {"text": "Advertisement free and in 1080p and on top of that the app is available on pretty much every device", "start": 415.56, "duration": 5.509}, {"text": "Thanks again to crunchyroll for sponsoring this video. Hope you all enjoy your anime marathons :)", "start": 421.77, "duration": 4.339}]