[{"text": "This episode is sponsored by Skillshare", "start": 0.0, "duration": 2.0}, {"text": "If you've watched this channel for a while, one thing should be pretty clear,", "start": 11.66, "duration": 3.322}, {"text": "there are a lot of builds", "start": 14.982, "duration": 1.078}, {"text": "which can dish out tons of damage in a short time to any players that lower their guard. While there's a solid", "start": 16.07, "duration": 4.799}, {"text": "chunk of players that subscribe to the \"best defense is an overwhelming offense\" strategy, there's also a decent number who", "start": 20.869, "duration": 5.55}, {"text": "make erecting an excellent defense their main mission.", "start": 26.42, "duration": 2.619}, {"text": "Investing the bulk of their evolution points into armor and resistances. This type of strategy is often referred to as 'Turtling' and for good reason.", "start": 29.039, "duration": 7.07}, {"text": "Turtles pioneered the defense build, being the first vertebrate to incorporate a shell into its build successfully;", "start": 36.42, "duration": 5.8}, {"text": "however, the idea that turtles all have the same game plan, would be far from the truth.", "start": 42.22, "duration": 4.52}, {"text": "They're a diverse faction with many low tier and high tier members. So today we're going through the turtle tier list", "start": 46.74, "duration": 5.62}, {"text": "Turtles are divided into two main groups:", "start": 52.68, "duration": 2.5}, {"text": "the side-neck turtles, and the hidden-neck turtles.", "start": 55.18, "duration": 2.62}, {"text": "This refers to the way the player positions their head when they activate their defense mode stance.", "start": 57.8, "duration": 4.7}, {"text": "Hidden-neck turtles retract their head and neck directly into their bodies,", "start": 62.5, "duration": 3.3}, {"text": "while side neck turtles tuck their head to the side. This may seem arbitrary, but to me it's a huge difference.", "start": 65.8, "duration": 5.64}, {"text": "Because in my opinion, side necks are at a huge disadvantage because putting your neck off to the side leaves your weak point very exposed.", "start": 71.44, "duration": 7.24}, {"text": "The neck is one of the most well known weak points in the game;", "start": 78.68, "duration": 2.979}, {"text": "every DPS main knows to go for the throat if possible,", "start": 81.66, "duration": 2.96}, {"text": "so by leaving it exposed, you're placing yourself in serious danger.", "start": 84.62, "duration": 4.12}, {"text": "Side neck players are aware of this drawback and have two different ways they try to compensate.", "start": 88.74, "duration": 4.22}, {"text": "The first is by putting more points into the shell skill tree, extending the shell forward.", "start": 92.96, "duration": 4.82}, {"text": "This makes it much less likely that an imprecise attack will land on the turtles neck.", "start": 97.78, "duration": 3.86}, {"text": "The second way is just to throw caution to the wind and decide that if you can't protect your neck, you may as well get some use out of it.", "start": 101.64, "duration": 6.56}, {"text": "Taking a page from the snake players guide book, these ambitious turtle mains choose to invest their points into the neck itself as opposed to the shell.", "start": 108.2, "duration": 7.7}, {"text": "This grants them an impressive tether grab, and allows them to reach around barriers while hunting.", "start": 115.9, "duration": 5.34}, {"text": "A common strategy for this build is to bury yourself into the lake bed and use your snake-like neck to attack any fish that enters your zone of control.", "start": 121.24, "duration": 7.28}, {"text": "Do i think this is the best strategy?", "start": 128.52, "duration": 1.34}, {"text": "Well, no. A lot of counterplay options exist and your neck is even more vulnerable than the regular side neck turtles.", "start": 130.2, "duration": 6.82}, {"text": "So in general I think if you're going for a turtle build, choose the other option: hidden neck turtles.", "start": 137.02, "duration": 5.06}, {"text": "Hidden neck turtles can completely conceal their weak points by retreating into their shell.", "start": 142.08, "duration": 4.26}, {"text": "This grants a massive defense bonus making it difficult for aggressors to deal any damage to you at all,", "start": 146.34, "duration": 5.08}, {"text": "let alone land a critical hit.", "start": 151.6, "duration": 1.96}, {"text": "Along with the isopod and armadillo, this is the best offensive move any one player could use.", "start": 153.56, "duration": 5.08}, {"text": "All of the remaining turtles on this list use this ability.", "start": 159.06, "duration": 3.44}, {"text": "Softshell turtles are the next build on our list. This is a very unique take on the turtle build.", "start": 162.62, "duration": 4.78}, {"text": "Most of the time you'd assume that a turtle players highest stat would be their defense, while their lowest would be mobility", "start": 167.4, "duration": 5.74}, {"text": "but for soft-shells, it's quite the contrary.", "start": 173.14, "duration": 2.4}, {"text": "They've got only average defense having used some of those points to give themselves an above average mobility instead.", "start": 175.82, "duration": 5.96}, {"text": "Their bodies are extremely flat granting them a powerful mobility bonus in water.", "start": 181.78, "duration": 4.0}, {"text": "While they definitely don't have the strongest bite attack on the list,", "start": 185.78, "duration": 2.76}, {"text": "a softshell turtle can deal a solid amount of damage with their bite;", "start": 188.56, "duration": 3.52}, {"text": "enough to pierce the defenses of snails fish and crustaceans.", "start": 192.08, "duration": 3.54}, {"text": "Freshwater turtles, such as softshells, tend to have great matchups against other aquatic builds", "start": 195.62, "duration": 4.94}, {"text": "and so their biggest enemies tend to be things coming from outside the river or pond,", "start": 200.56, "duration": 3.8}, {"text": "such as a heron or a raccoon, and so the longer a turtle can stay underwater the better off they are.", "start": 204.56, "duration": 5.84}, {"text": "This is why many of the current builds put a few points into oxygen extraction, allowing them to absorb oxygen from the water through the tissue on the inside of their mouths.", "start": 210.4, "duration": 8.58}, {"text": "This extends the time a turtle can remain submerged, increasing it from only about a half-hour up to potentially weeks.", "start": 218.98, "duration": 6.64}, {"text": "All these abilities are great but I can't overlook these massive sacrifices to defense that the softshell turtles have to deal with,", "start": 225.62, "duration": 6.08}, {"text": "so to me, these guys end up on the border of c and d tier.", "start": 231.7, "duration": 3.64}, {"text": "Now, not all turtles are locked into the aquatic biome.", "start": 235.34, "duration": 2.76}, {"text": "Next rung up on the tier list is for a turtle which abandons the aquatic play-style for a terrestrial one; the tortoise.", "start": 238.1, "duration": 6.66}, {"text": "Tortoises take the characteristically high and low traits of a turtle to the absolute extreme;", "start": 244.76, "duration": 4.58}, {"text": "defenses through the roof to the point where brute force is almost completely useless. It can even block attacks from all types of cats", "start": 249.59, "duration": 6.8}, {"text": "which as we know are some of the most overpowered builds in the game.", "start": 256.48, "duration": 3.28}, {"text": "It's for this reason that these players dominate the high scores for total game time on a single character.", "start": 259.76, "duration": 4.88}, {"text": "Now of course this level of defense comes at a cost and in this case it's a severe reduction in speed.", "start": 264.64, "duration": 5.46}, {"text": "But even more so a reduction in intelligence.", "start": 270.1, "duration": 2.94}, {"text": "because of this, most can't really do well as hunters and have to go for the herbivore play-style, but", "start": 273.04, "duration": 4.42}, {"text": "don't be fooled, they've got the same powerful bite attack that other turtles do", "start": 277.48, "duration": 3.42}, {"text": "and can do a surprising amount of damage to any player who underestimates them.", "start": 280.9, "duration": 3.28}, {"text": "Speaking of bites, if dealing massive damage with a bite appeals to you as a player, then the snapping turtle build is for you.", "start": 284.18, "duration": 6.12}, {"text": "These guys break into A tier by opting for a high power level.", "start": 290.34, "duration": 3.64}, {"text": "They aren't as abysmally slow as tortoises are, but they're not speed demons by any means,", "start": 293.98, "duration": 4.34}, {"text": "so in order to eliminate their targets they opt for the bait and punish strategy.", "start": 298.32, "duration": 3.84}, {"text": "They've got solid stealth, butwhat really helps them is their lure ability. This rare and powerful ability allows the user to disguise themselves as loot,", "start": 302.16, "duration": 7.82}, {"text": "which I think we can all agree can be pretty irresistible at times.", "start": 309.98, "duration": 3.24}, {"text": "Because they function as ambush predators with great offense but have low to medium mobility,", "start": 313.22, "duration": 4.56}, {"text": "they actually occupy a similar niche in water as vipers do on land,", "start": 317.78, "duration": 4.16}, {"text": "and so I think it's only fair that they earn the same rating of low A tier.", "start": 321.94, "duration": 3.44}, {"text": "And now for the real standout;", "start": 325.86, "duration": 1.52}, {"text": "the turtle who's brave enough to take a build normally only viable in ponds and rivers and takes it out to a much more competitive server, the sea turtle.", "start": 327.38, "duration": 7.96}, {"text": "Sea turtles are proof that even in a server full of power and intelligence peers defense tanks can still be a completely viable option.", "start": 335.34, "duration": 6.8}, {"text": "By specking into the omnivore play-style as opposed to obligate herbivore or carnivore, they never really need to pick fights that they can't win,", "start": 342.14, "duration": 6.9}, {"text": "they can always just eat plants while waiting for the next easy opportunity to score a high XP kill.", "start": 349.04, "duration": 4.42}, {"text": "This kind of build is a pretty cookie cutter survivalist, savager build, which would already be solid on its own;", "start": 353.46, "duration": 4.74}, {"text": "however, where sea turtles really shine is their additional defense points placed not into physical resistance,", "start": 358.2, "duration": 5.54}, {"text": "but into venom resistance.", "start": 363.74, "duration": 1.64}, {"text": "The venom of a jellyfish has the potential to one-shot just about anything,", "start": 365.38, "duration": 3.54}, {"text": "but sea turtle players have recognized that aside from venom and stealth they're almost completely defenseless,", "start": 368.92, "duration": 5.26}, {"text": "and so by taking the venom resistance perk, they've got an almost completely uncontested source of XP.", "start": 374.18, "duration": 5.16}, {"text": "Now, I don't want you to think that sea turtles are easy mode,", "start": 379.34, "duration": 3.24}, {"text": "because they live in the ocean there are players with a high enough physical attack force to pierce their shell.", "start": 382.58, "duration": 4.9}, {"text": "The tiger sharks' serrated teeth are specifically evolved to cut through armor,", "start": 387.48, "duration": 4.24}, {"text": "and so a sea turtle needs to rely not on their armor but on their size and shape in relation to the shark's mouth.", "start": 391.72, "duration": 5.54}, {"text": "Shark players can only pierce armor if they secure a grab, and so by facing the ungrabable face of their shell towards the shark,", "start": 397.26, "duration": 6.5}, {"text": "it can repel a strike that would otherwise be a game-ender for them.", "start": 403.76, "duration": 2.94}, {"text": "The fact that sea turtles have any good defensive options at all is a testament to the excellence of this build, and it earns the rank of A+ tier.", "start": 407.08, "duration": 7.22}, {"text": "So, why aren't any turtles in s tier? Well for this build, as well as all other turtles, there are", "start": 414.3, "duration": 4.529}, {"text": "some very good counter play options that can be nightmares for turtle players.", "start": 418.829, "duration": 3.291}, {"text": "The turtle's main weakness is intelligence based strategies; using creative and critical thinking to bypass armor is the best way to crush any defense build.", "start": 422.12, "duration": 7.9}, {"text": "For example a tortoise may be resistant to all forms of physical strike,", "start": 430.02, "duration": 3.86}, {"text": "but even they cannot defend against the physics engine of the game,", "start": 433.88, "duration": 2.96}, {"text": "and so an experienced bird player won't waste any time attacking it, but will instead carry it high into the sky and let gravity do the work.", "start": 436.84, "duration": 6.7}, {"text": "In the case of a sea turtle", "start": 443.64, "duration": 1.4}, {"text": "while one shark may not be able to land a grab because of the turtles defensive posture,", "start": 445.04, "duration": 4.08}, {"text": "any form of coordinated multi-directional attack will be unblockable for solo turtle main.", "start": 449.12, "duration": 4.7}, {"text": "The last thing worth considering is that a turtle must make it past the extremely vulnerable early- game in order to reach a stage where its armor can do its job.", "start": 453.82, "duration": 7.38}, {"text": "Safety numbers can mitigate this to an extent but it's definitely not the best strategy when it comes to avoiding griefers.", "start": 461.2, "duration": 5.1}, {"text": "The best way to deal with this is to have experienced players guard the low-level ones,", "start": 466.3, "duration": 3.94}, {"text": "but doing so requires an intelligence level that turtles sadly just don't have.", "start": 470.24, "duration": 3.52}, {"text": "In fact turtles have such lowintelligence stat that a tortoise with its brain removed can still function relatively normally for a", "start": 473.76, "duration": 6.02}, {"text": "while. So with that in mind I can't give turtles a top tier spot. It's definitely a build worth checking out though. \n(PROMOTION INC.)", "start": 479.789, "duration": 6.15}, {"text": "Unlike some other stats intelligence is pretty easy to buff for example if you've watched this channel for a", "start": 485.94, "duration": 4.44}, {"text": "while you've probably seen the quality of various things go up. I've had some support from", "start": 490.38, "duration": 3.659}, {"text": "fans for things like icons and graphics, but I'm also boosting my", "start": 494.039, "duration": 3.45}, {"text": "own stats on skillshare the online learning community with thousands of classes", "start": 497.49, "duration": 3.69}, {"text": "like this one on graphic design.", "start": 501.18, "duration": 1.45}, {"text": "An annual subscription is less than $10 a month but skillshare is offering the first two months for only 99 cents to the first", "start": 502.63, "duration": 6.469}, {"text": "1337 people who sign up using the link in the description. (Thanks for watching <3)", "start": 509.1, "duration": 3.479}, {"text": "(Remember to thank the people who make the captions by like subscribing to them or just say thanks to them in the comments, it's a hobby that eats up a lot of time.", "start": 512.579, "duration": 2.0}]