[{"text": "Mr. Beat presents", "start": 0.0, "duration": 1.44}, {"text": "Supreme Court Briefs", "start": 1.44, "duration": 2.32}, {"text": "New London, Connecticut\n1997", "start": 3.76, "duration": 4.16}, {"text": "Susette Kelo drives by a run down house along the Thames (Tames) River that has been for sale for awhile.", "start": 7.92, "duration": 6.64}, {"text": "Even though the house is run down, she falls in love with it and buys it.", "start": 14.56, "duration": 3.84}, {"text": "She spends months completely renovating the 107-year old Victorian-style cottage, painting it pink.", "start": 18.4, "duration": 7.68}, {"text": "The house had a great view of the water, and was in a working-class neighborhood called Fort Trumbull.", "start": 26.08, "duration": 5.84}, {"text": "Unfortunately, the neighborhood had been in decline for years, as there were few decent paying jobs nearby.", "start": 31.92, "duration": 6.56}, {"text": "But Susette didn’t care. She loved her little pink house and its view of the harbor.", "start": 38.48, "duration": 5.04}, {"text": "She soon met a dude named Tim LeBlanc, who helped her do exterior work on the house.", "start": 43.52, "duration": 5.44}, {"text": "Eventually the two would get married and live there together.", "start": 48.96, "duration": 3.12}, {"text": "But then, in January 1998, real estate agents began knocking on her door, offering lots of money to buy her house on behalf of “an unnamed buyer.”", "start": 52.08, "duration": 11.12}, {"text": "Kelo was suspicious, and turned down all offers.", "start": 63.2, "duration": 2.72}, {"text": "However, agents began to tell her if she didn’t sell her house, she would be forced out of her home by the city due to something called “eminent domain.”", "start": 65.92, "duration": 9.12}, {"text": "Eminent domain, you say? What the heck is that?", "start": 75.04, "duration": 2.96}, {"text": "Eminent domain is the right for a government to just take private property for public use.", "start": 78.0, "duration": 5.52}, {"text": "In other words, if the government thinks it is in the best interest of all its citizens, it can kick you out of your house.", "start": 83.52, "duration": 6.56}, {"text": "Both the Takings Clause of the Fifth Amendment and the 14th Amendment of the U.S. Constitution say the government can use eminent domain, but it just requires “just compensation.”", "start": 90.16, "duration": 11.28}, {"text": "For more about eminent domain, be sure to check out my friend Dave’s video dedicated to the topic over on his channel City Beautiful. Hey Dave!", "start": 101.44, "duration": 7.18}, {"text": "Dave: Yeah?", "start": 108.62, "duration": 0.5}, {"text": "Mr. Beat: So, it's a weird coincidence that we both decided to cover this topic at the same time. Am I right? hahaha", "start": 109.12, "duration": 5.52}, {"text": "Dave: No, it's not. We planned to do it this way.", "start": 114.64, "duration": 4.08}, {"text": "Mr. Beat: We did?", "start": 118.72, "duration": 1.12}, {"text": "Why would we do that?", "start": 120.08, "duration": 1.52}, {"text": "Dave: You know, to cross-promote our channels.", "start": 121.6, "duration": 2.72}, {"text": "Mr. Beat: Why would you want to promote my horrible channel?", "start": 124.32, "duration": 3.84}, {"text": "Anyway, Susette Kelo didn’t care how much money New London was offering her.", "start": 128.72, "duration": 5.12}, {"text": "She loved her little pink house, and wasn’t going anywhere.", "start": 133.84, "duration": 3.04}, {"text": "Neither were 14 other Fort Trumbull residents. They decided to fight.", "start": 136.88, "duration": 5.92}, {"text": "Wait a second, why was New London trying to kick them out?", "start": 142.8, "duration": 2.8}, {"text": "Well Pfizer, a multinational pharmaceutical corporation, was opening a new facility in New London, right next to the Fort Trumbull neighborhood.", "start": 145.6, "duration": 8.64}, {"text": "Part of the deal were plans to “fix up” Fort Trumbull, including building a new hotel, conference center, and fancy housing for the scientists working at Pfizer.", "start": 154.24, "duration": 10.24}, {"text": "This would require major government help. $73 million in help.", "start": 164.48, "duration": 4.64}, {"text": "Yep, the state of Connecticut would pitch in $73 million to kick out the Fort Trumbull residents, demolish their homes, and update the area with new roads and utilities.", "start": 169.12, "duration": 12.08}, {"text": "Once Kelo and the other Fort Trumbull residents who didn’t want to leave their homes found out about this, they sued the city.", "start": 181.2, "duration": 6.24}, {"text": "Meanwhile, an organization called the New London Development Corporation, or NLDC, was already demolishing homes.", "start": 187.44, "duration": 7.6}, {"text": "By the time of the trial, which went to the New London Superior Court in July 2001, the NLDC already had acquired around 80 buildings and destroyed most of them.", "start": 195.04, "duration": 10.64}, {"text": "Pfizer had also already built their facility.", "start": 205.68, "duration": 2.88}, {"text": "The Institute for Justice, a libertarian-leaning nonprofit law firm, agreed to represent Kelo and the others.", "start": 208.56, "duration": 6.72}, {"text": "Scott Bullock, the lead lawyer for them, later said: “We got involved because what was going on was an outrageous abuse of power.", "start": 215.28, "duration": 8.24}, {"text": "There was so little respect shown for these people. The city wanted to take an entire neighborhood and make it anew.\"", "start": 223.52, "duration": 6.4}, {"text": "Bullock argued that eminent domain didn’t apply in this case, since ultimately the purpose was profits for private developers.", "start": 229.92, "duration": 9.2}, {"text": "In other words, New London taking over Fort Trumbull didn’t qualify as something that would benefit the entire community.", "start": 239.12, "duration": 6.48}, {"text": "In March 2002, the New London Superior Court basically said some could stay but others had to go.", "start": 245.6, "duration": 6.4}, {"text": "Both sides were not happy, so both sides appealed.", "start": 252.0, "duration": 2.64}, {"text": "In late 2002, Kelo’s husband, Tim LeBlanc, was in a horrible car accident and went into a coma for two weeks.", "start": 254.64, "duration": 7.76}, {"text": "Now there were two fights for Kelo. While he was still in the hospital, the Connecticut Supreme Court began hearing the appeal.", "start": 262.4, "duration": 6.72}, {"text": "While things were looking up for LeBlanc as he slowly recovered, things were looking down for staying in the little pink house because in March 2004, the Connecticut Supreme Court said New London’s use of eminent domain was ok.", "start": 269.12, "duration": 12.56}, {"text": "Kelo and the others appealed again to the Supreme Court, who agreed to hear the case on September 28, 2004.", "start": 281.68, "duration": 7.92}, {"text": "It was rare for the Court to take on an eminent domain case, by the way.", "start": 289.6, "duration": 3.68}, {"text": "Kelo and LeBlanc, as well as many of the other neighbors, were present at oral arguments in February 2005.", "start": 293.28, "duration": 7.36}, {"text": "By this time, Kelo had become well known to the country, and a sort of symbol of the fight against unjust eminent domain.", "start": 300.64, "duration": 7.92}, {"text": "It seemed like everyone was on her side.", "start": 308.56, "duration": 1.92}, {"text": "However, the Court was not. On June 23rd, they announced they had sided with New London.", "start": 310.48, "duration": 6.08}, {"text": "It was a close one. 5-4.", "start": 316.56, "duration": 1.68}, {"text": "Justice John Paul Stevens argued that eminent domain in this case had a “public purpose” because it meant creating jobs in a city that had high unemployment.", "start": 318.24, "duration": 11.92}, {"text": "“Promoting economic development is a traditional and long-accepted function of government.”", "start": 330.16, "duration": 5.36}, {"text": "The dissent argued that this use of eminent domain was basically Robin Hood in reverse- taking from the poor to give to the rich.", "start": 335.52, "duration": 7.92}, {"text": "In her dissent, Justice Sandra Day O’Connor argued the decision got rid of “any distinction between private and public use of property - and thereby effectively delete(d) the words ‘for public use’ from the Takings Clause of the Fifth Amendment.”", "start": 343.44, "duration": 15.04}, {"text": "This was a controversial decision, to say the least.", "start": 358.48, "duration": 2.8}, {"text": "It made people mad on both sides of the political spectrum.", "start": 361.28, "duration": 3.52}, {"text": "In one poll, 99% of respondents disagreed with the decision.", "start": 364.8, "duration": 4.72}, {"text": "On the one-year anniversary of the decision, President George W. Bush issued an executive order that told the federal government to limit its use of eminent domain.", "start": 369.52, "duration": 9.28}, {"text": "Although Kelo and the others kept fighting for awhile, eventually they all settled with New London for reportedly lots of money.", "start": 378.8, "duration": 7.84}, {"text": "Kelo’s house wasn’t demolished after all. In fact, you can visit it today.", "start": 386.64, "duration": 5.28}, {"text": "In 2008, Kelo sold the house for $1 to a dude named Avner Gregory, who moved the house across town.", "start": 391.92, "duration": 8.08}, {"text": "Today it’s a museum. Kelo moved to a different town.", "start": 400.0, "duration": 4.08}, {"text": "Around that time, the economy was crap since it was The Great Recession, and Pfizer had shut down its New London facility.", "start": 404.08, "duration": 7.28}, {"text": "So ironically, by the time New London had finally cleared the Fort Trumbull neighborhood, it no longer had plans to redevelop it.", "start": 411.36, "duration": 9.52}, {"text": "For the past 10 years, the former neighborhood has been abandoned, home to feral cats.", "start": 420.88, "duration": 6.88}, {"text": "So uh...yeah...they were kicked out for nothing.", "start": 427.76, "duration": 3.92}, {"text": "However, Kelo v. New London had a big impact. It led to a huge nationwide backlash against eminent domain.", "start": 431.68, "duration": 8.88}, {"text": "It caused 45 of the 50 states to change their eminent domain laws, and today the fight continues.", "start": 440.56, "duration": 6.16}, {"text": "In 2017, a film called Little Pink House further raised awareness of the case.", "start": 446.72, "duration": 6.0}, {"text": "And I’d argue that Susette Kelo may have lost the battle, but she certainly didn’t lose the war.", "start": 452.72, "duration": 5.28}, {"text": "She remains a hero to many Americans in the fight against unjust eminent domain.", "start": 458.0, "duration": 5.04}, {"text": "I’ll see you for the next Supreme Court case, jury!", "start": 466.56, "duration": 3.52}, {"text": "So what do YOU think? Do you agree with the Court?", "start": 470.08, "duration": 4.32}, {"text": "What do YOU think about eminent domain?", "start": 474.4, "duration": 1.68}, {"text": "Let me know in the comments below.", "start": 476.08, "duration": 1.36}, {"text": "Also, there's this book that I used for research for this video", "start": 477.44, "duration": 3.28}, {"text": "called Little Pink House, A True Story of Defiance and Courage, by Jeff Benedict.", "start": 480.72, "duration": 5.36}, {"text": "This is the book the movie I was telling you about was based off of.", "start": 486.08, "duration": 3.36}, {"text": "If you want to buy this book, I put a link to it in the description of this video.", "start": 489.44, "duration": 3.28}, {"text": "And don’t forget, this video is a collaboration with my friend Dave and his channel City Beautiful.", "start": 492.72, "duration": 4.72}, {"text": "Check out his video about the impact of eminent domain.", "start": 497.44, "duration": 2.8}, {"text": "And now it's time for my monthly shout out to my Patreon supporters", "start": 500.24, "duration": 3.76}, {"text": "especially my Patreon supporter Eric B. Wolman.", "start": 504.0, "duration": 3.12}, {"text": "And all these patrons, are at least at the Grover Cleveland level or higher", "start": 507.12, "duration": 3.84}, {"text": "which means they donate at least $15 or more a month.", "start": 510.96, "duration": 2.56}, {"text": "So I've got Austin Rudolph, Elcaspar", "start": 513.52, "duration": 2.88}, {"text": "Flabby, JoJo's Dogtail", "start": 516.4, "duration": 2.4}, {"text": "Matt Standish, Nick Everett", "start": 518.8, "duration": 2.72}, {"text": "Pillerstiller Bahn Ruthington", "start": 521.52, "duration": 1.92}, {"text": "Sean Conant, Andrew Schneider", "start": 523.44, "duration": 2.4}, {"text": "John Johnson, Kenneth", "start": 525.84, "duration": 2.0}, {"text": "President Storm, and Zackary F. Parker", "start": 527.84, "duration": 3.2}, {"text": "one of my newer ones. Thank you so much guys. And thank YOU for watching, yo.", "start": 531.04, "duration": 3.44}]