[{"text": "Okay, let's just get this out there right now, I know", "start": 0.03, "duration": 2.0}, {"text": "This is weird you probably watch this channel because you want to see slow motion phenomenon of like", "start": 2.409, "duration": 4.43}, {"text": "bullets hitting stuff and fracture mechanics and water drops bouncing and animals squirting things", "start": 7.24, "duration": 5.899}, {"text": "Whatever you're into", "start": 13.139, "duration": 1.33}, {"text": "But this", "start": 14.469, "duration": 1.56}, {"text": "is crazy.", "start": 16.029, "duration": 0.721}, {"text": "Most people think \"Oh look, the cute little nerds set up the dominoes, and they knock them down, and everyone claps and it's great.\" No.", "start": 16.75, "duration": 5.869}, {"text": "This is different than that. I was naive enough to think that I was gonna set up a high-speed camera, point 'em at dominoes,", "start": 22.869, "duration": 6.2}, {"text": "I was gonna set 'em up knock 'em down, vary the spacing and the type of floor it was on and I was going to", "start": 29.07, "duration": 6.029}, {"text": "transcend the knowledge of dominoes instantly, you were gonna get smarter every day, and we were gonna go about our merry way.", "start": 35.62, "duration": 5.64}, {"text": "But no. Look me in the eyes.", "start": 41.56, "duration": 2.06}, {"text": "This has broken me.", "start": 44.82, "duration": 1.46}, {"text": "I do not understand dominoes.", "start": 46.44, "duration": 2.42}, {"text": "The reason this's broken me is because I've been sitting here doing all this math to determine the gap", "start": 48.86, "duration": 4.98}, {"text": "Necessary in order for this red Domino's weight to always knock over the blue one, but when I set up with my calipers", "start": 54.0, "duration": 5.64}, {"text": "It doesn't work, and if you think about it the same people that taught me how to do this math", "start": 59.64, "duration": 4.44}, {"text": "Also told me if I needed to I could assume a cow is a sphere in a vacuum", "start": 64.089, "duration": 5.06}, {"text": "Paper physics can only get you so far. If there's anything I've learned from my job as an engineer. It's that", "start": 69.48, "duration": 5.88}, {"text": "There's no replacement for actual real-world testing", "start": 75.36, "duration": 2.88}, {"text": "if we want to make observations of the exact times these Dominoes hit down to the millisecond", "start": 78.24, "duration": 4.54}, {"text": "It's really hard to do it from a camera like this the reason is look over here", "start": 82.8, "duration": 3.94}, {"text": "You can see the inside of this Domino, and then the inside of this one and somewhere in the middle it changes", "start": 86.74, "duration": 4.94}, {"text": "So if we want to get a shot where we get all this data", "start": 91.68, "duration": 3.569}, {"text": "We have to have a moving camera not only that but a moving camera that is", "start": 95.56, "duration": 4.61}, {"text": "Perfectly timed right here in the middle so we can see when this edge hits this edge", "start": 100.329, "duration": 4.67}, {"text": "Which means we're gonna have to time it perfectly", "start": 105.13, "duration": 2.0}, {"text": "With the wave of Dominoes as it runs along the track do I want to keep making videos on smarter every day about Dominoes", "start": 107.32, "duration": 6.349}, {"text": "Yeah, if that's what it takes to find the answer. Yes, that's what I want to do", "start": 113.86, "duration": 3.529}, {"text": "This is about not quitting so now we're gonna give Domino's the respect they deserve and we're going hardcore mode", "start": 118.03, "duration": 5.43}, {"text": "We're at fifteen millimeters", "start": 127.44, "duration": 2.0}, {"text": "The second one over here", "start": 134.72, "duration": 2.0}, {"text": "Welcome to hardcore mode...", "start": 139.32, "duration": 1.16}, {"text": "It's the same as before only I try harder so here we go we're gonna build stuff", "start": 140.48, "duration": 4.74}, {"text": "And we're gonna do experiments, and we're not gonna quit, and there's a twist at the end of this video. Let's do it", "start": 145.22, "duration": 5.07}, {"text": "Okay, this is Trent. He is the contraption fabricator that I talk about on the patreon page, and this is my cousin Hayden, hey Hayden", "start": 150.44, "duration": 7.259}, {"text": "okay, so this is a high speed camera on a skid and", "start": 158.34, "duration": 4.91}, {"text": "Trent made this, good job Trent and we are about to try to pace", "start": 164.43, "duration": 4.369}, {"text": "These dominoes so that we can tell the difference between a hardwood floor, and you know a surface that's grippy. Okay ready ?", "start": 170.13, "duration": 7.369}, {"text": "That looked awesome, oh it outran us it moves a lot faster than the wood floor, and I'm so used to the wood floor", "start": 179.46, "duration": 5.599}, {"text": "He's frustrated. I know well enough to know when he's frustrated. He's frustrated. You miss that one", "start": 185.06, "duration": 3.57}, {"text": "Are you frustrated Trent?", "start": 190.02, "duration": 2.0}, {"text": "No all right we're going to figure out exactly how to nail this we're gonna get all the dominoes in frame as they fall", "start": 192.75, "duration": 7.399}, {"text": "So we can gather the timing data and figure out what steady state velocity is it took some practice because sometimes the dominoes would outrun us", "start": 200.149, "duration": 6.971}, {"text": "And sometimes we outran them", "start": 212.66, "duration": 2.64}, {"text": "So I keep messing up the high speed which means Hayden has to keep set up dominoes", "start": 221.89, "duration": 3.47}, {"text": "Which means up if we're gonna my half-court shot", "start": 227.05, "duration": 2.0}, {"text": "We got it. It'll work, it'll work this data", "start": 233.8, "duration": 3.05}, {"text": "This is the first good run we got on felt", "start": 238.51, "duration": 2.66}, {"text": "Watch closely and you can see that the bottoms are trying to slide out from under the Domino", "start": 241.51, "duration": 4.369}, {"text": "But it digs into the felt and stops", "start": 245.88, "duration": 2.0}, {"text": "I think we got it do that one more time", "start": 261.289, "duration": 2.54}, {"text": "I feel really good about that. Oh, we did pretty good Hayden Hayden", "start": 266.75, "duration": 5.539}, {"text": "We got it, that's the one right", "start": 275.689, "duration": 2.36}, {"text": "This is the best run we got on hardwood if you look at the bottom you can see that", "start": 280.31, "duration": 4.399}, {"text": "It's slipping out from under the Domino makes it rotate around its center of gravity and also if you look at the top you can", "start": 284.71, "duration": 5.669}, {"text": "See that they're not hitting square on", "start": 290.379, "duration": 2.0}, {"text": "So which one is faster", "start": 323.06, "duration": 1.1}, {"text": "We've got hardwood on the bottom that slips and we got filth up top that doesn't slip and Trent and I both felt felt", "start": 324.16, "duration": 5.399}, {"text": "Was faster so how do we know we have to like quantify this?", "start": 329.69, "duration": 3.859}, {"text": "The answer is brute force science to figure this out", "start": 334.06, "duration": 3.419}, {"text": "We did a ton of runs mostly filmed at 5,000 frames per second the goal is to figure out exactly", "start": 337.479, "duration": 4.59}, {"text": "What millisecond each individual impact occurs which made for over a hundred and twenty thousand frames of data to reduce?", "start": 342.41, "duration": 6.41}, {"text": "Your boy here has too many kids and too many jobs to reduce that much data", "start": 349.009, "duration": 4.279}, {"text": "So I blasted out a spreadsheet template to everywhere that smartereveryday touches the Internet I compared you guys against each other Twitter", "start": 353.289, "duration": 7.29}, {"text": "Got it done fastest people follow me on Instagram and snapchat got it done quickly", "start": 360.58, "duration": 3.269}, {"text": "Facebook helped surprisingly the physics subreddit wasn't interested in doing physics that day the smartereveryday subreddit was great and accurate but", "start": 364.19, "duration": 7.22}, {"text": "Patreon was by far and away the most accurate source, which makes sense because these are the best people in the world", "start": 371.96, "duration": 5.959}, {"text": "There's a reason I gave each social media outlet its own spreadsheet. It's called the wisdom of the crowd here", "start": 377.99, "duration": 5.899}, {"text": "You can see exactly what frame each individual chose at the impact point and the average of those selections", "start": 383.889, "duration": 5.339}, {"text": "These averages were then graphed for each individual video file and there you have it if you average all the runs together it appears that", "start": 389.599, "duration": 6.53}, {"text": "The non slipping felt is faster than the slipping hardwood before I go into why I think it's faster", "start": 396.13, "duration": 5.339}, {"text": "I'm gonna let grant from the YouTube channel three blue one brown take a crack at it because this dude is", "start": 401.47, "duration": 4.41}, {"text": "fantastic at reducing super complex mathematical systems down to quick little YouTube bytes", "start": 406.31, "duration": 5.69}, {"text": "It's amazing you should check his channel out anyway go for it grant", "start": 412.18, "duration": 2.76}, {"text": "Hey, Destin its grant, so I wouldn't haven't looked at some of the data that you sent and here", "start": 414.94, "duration": 4.319}, {"text": "I'm just gonna pull up two examples one of them with Domino's on felt the other on hardwood", "start": 419.259, "duration": 4.529}, {"text": "and these are just the plots of the average velocity of each individual Domino as they fall and", "start": 423.789, "duration": 5.04}, {"text": "Obviously the first thing that stands out is just how chaotic this is right", "start": 429.349, "duration": 3.05}, {"text": "they're super jaggedy and I think some of that might just be that the", "start": 432.4, "duration": 3.059}, {"text": "Distances between each Domino were probably a little bit variable right that's probably not perfect", "start": 435.65, "duration": 4.609}, {"text": "But the way that we were computing those velocities kind of assumed that that distance was a constant", "start": 440.33, "duration": 4.91}, {"text": "So one pretty simple thing I did to just kind of smooth out this data is rather than graphing each", "start": 445.759, "duration": 5.06}, {"text": "Individual velocity point take a look at the previous 20 different velocities", "start": 451.159, "duration": 4.01}, {"text": "And then average all of those and that way if we look at the moving average", "start": 455.169, "duration": 4.02}, {"text": "It should hopefully kind of smooth out any of the small variations and things like distances between dominoes so when you do that", "start": 459.19, "duration": 6.029}, {"text": "It does look like that in general filth is a little bit faster than hardwood, right?", "start": 465.47, "duration": 4.279}, {"text": "But that's not always consistently true like here if we look at the last few Falls", "start": 469.82, "duration": 3.38}, {"text": "It seems like the hardwood sort of catches up with it, and this is just two examples", "start": 473.2, "duration": 3.239}, {"text": "But I saw this in a lot of the other ones so if you just look at the overall average", "start": 476.44, "duration": 3.96}, {"text": "Velocity felt definitely does look faster, but it wouldn't be comfortable saying that it's consistently faster", "start": 480.59, "duration": 5.419}, {"text": "I think there's probably a lot of other variables at play here that sometimes might pull hardwood ahead grants", "start": 486.01, "duration": 4.709}, {"text": "Channel is amazing you should really go check it out, but you gotta skimmed over the chaotic part of the graph and for me", "start": 490.72, "duration": 5.279}, {"text": "that's the most fun part when you track a rocket with a radar you get a general idea of the", "start": 496.0, "duration": 4.71}, {"text": "Acceleration profile by looking at the distance versus time plot", "start": 500.9, "duration": 2.869}, {"text": "But the magic is over here in the noise", "start": 504.2, "duration": 2.149}, {"text": "When a rocket makes a correction usually that shows up as a perturbation in the raw data", "start": 506.63, "duration": 3.77}, {"text": "And I'm seeing perturbations in this data", "start": 510.44, "duration": 2.33}, {"text": "and there seems to be an actual pattern here a", "start": 512.77, "duration": 2.88}, {"text": "Natural undulation of the curve initially I didn't have enough Domino setup to determine a steady state velocity", "start": 516.02, "duration": 5.9}, {"text": "But now I'm wondering if there. Even is a steady state velocity because if you look at the data", "start": 521.92, "duration": 3.989}, {"text": "It goes faster and slower over and over again. I think this might be happening for two reasons number one", "start": 525.91, "duration": 5.94}, {"text": "You can see little twists", "start": 531.85, "duration": 1.93}, {"text": "You can see that the Domino's aren't hitting each other", "start": 533.78, "duration": 2.51}, {"text": "Square and in fact the twist gets worse and worse and slower and slower until it gets so slow that the pushers behind it fall", "start": 536.36, "duration": 6.95}, {"text": "Down and straighten them back out this slam down is that velocity spike that we're seeing watch this", "start": 543.31, "duration": 5.7}, {"text": "twist", "start": 549.92, "duration": 2.0}, {"text": "Things are stacking up and", "start": 552.36, "duration": 2.0}, {"text": "Slam see that spike. It's a natural cycle in the graph", "start": 554.91, "duration": 4.46}, {"text": "there's a twist a", "start": 560.58, "duration": 2.0}, {"text": "twist", "start": 562.92, "duration": 2.0}, {"text": "Twist", "start": 565.56, "duration": 2.0}, {"text": "Twist", "start": 567.75, "duration": 2.0}, {"text": "They're starting to stack up and", "start": 569.94, "duration": 2.0}, {"text": "slam", "start": 572.91, "duration": 1.26}, {"text": "The twist is energy lost in the system", "start": 574.17, "duration": 2.57}, {"text": "And the slam is the positive", "start": 576.74, "duration": 2.0}, {"text": "correction the second thing I'm seeing becomes more clear when we spread out the", "start": 578.91, "duration": 3.59}, {"text": "Domino's where each Domino hits the next one seems to determine how much it rotates versus how much it's pushed watch this", "start": 582.6, "duration": 6.8}, {"text": "When a Domino is hit down close to the center of gravity the impact will tend to?", "start": 589.65, "duration": 4.309}, {"text": "Translate the Domino forward instead of rotating it because this", "start": 594.21, "duration": 3.469}, {"text": "Translation calls it to still be upright when it hits the next one it hits it up high", "start": 597.96, "duration": 4.009}, {"text": "which makes the next one rotate faster the next one gets hit down low and you see that a", "start": 601.97, "duration": 5.01}, {"text": "back-and-forth pattern emerges", "start": 607.5, "duration": 1.68}, {"text": "I'm not really sure how this plays in but it's clear to me that where a Domino's hit on its back determines", "start": 609.18, "duration": 5.059}, {"text": "How it falls forward when you spread the Domino's out farther the effects of these phenomena are amplified even more for example watch this case", "start": 614.24, "duration": 7.979}, {"text": "one Domino in the entire chain", "start": 622.589, "duration": 2.0}, {"text": "Doesn't fall all right, so", "start": 624.9, "duration": 2.0}, {"text": "This is curious, so we see how that happen", "start": 627.63, "duration": 3.529}, {"text": "Check this case out where the chain stops altogether due to the twist error building up past the point of recovery", "start": 649.25, "duration": 6.109}, {"text": "Okay, here's the twist to all this this video is not about dominoes this video is about creating an experiment", "start": 674.4, "duration": 7.88}, {"text": "To understand what seems like a simple system at a very very", "start": 682.28, "duration": 4.35}, {"text": "Complex level now that you know what to look for you're able to see very", "start": 686.79, "duration": 3.47}, {"text": "Intricate interactions in this Domino chain right now right in front of you. There's no real direct", "start": 690.6, "duration": 4.76}, {"text": "Application so why do we do this, this is what we call basic research, and it's very very important", "start": 696.12, "duration": 7.25}, {"text": "It's not like Applied Science where you're inventing things using some technology", "start": 703.37, "duration": 4.559}, {"text": "It's about being able to", "start": 708.27, "duration": 1.86}, {"text": "understand and predict", "start": 710.13, "duration": 1.77}, {"text": "Natural phenomenon humans weren't able to go to the moon because they suddenly felt like it it started by wanting to understand how birds fly", "start": 711.9, "duration": 6.11}, {"text": "Someone had to first answer that", "start": 718.38, "duration": 1.95}, {"text": "Question before we could ever start on our way", "start": 720.33, "duration": 2.359}, {"text": "Cancer won't be cured because we walk into a lab with a lot of money and want it to go away", "start": 722.76, "duration": 4.19}, {"text": "It's gonna involve basic research like how cells work these complex", "start": 727.11, "duration": 4.729}, {"text": "Building blocks to understand the world are right there in front of us all the time", "start": 732.03, "duration": 3.65}, {"text": "But we have to make that first little push into the unknown", "start": 736.23, "duration": 3.169}, {"text": "to start the chain reaction", "start": 740.01, "duration": 1.68}, {"text": "So here's the point ask", "start": 741.69, "duration": 2.0}, {"text": "The simple questions keep an eye out for those little things that end up being building blocks that lead to the bigger stuff", "start": 743.97, "duration": 6.86}, {"text": "At work my favorite people are the ones that ask questions in meetings that might sound silly", "start": 751.17, "duration": 6.679}, {"text": "but they're not because for every 10 they ask there's one that they'll ask that'll start this chain of discovery and", "start": 757.85, "duration": 7.14}, {"text": "Pull us all towards the profound", "start": 765.3, "duration": 2.0}, {"text": "So that's the take away ask the simple questions and dare to try to answer them", "start": 767.7, "duration": 5.569}, {"text": "I'm Destin you're getting smarter every day. Have a good one all right", "start": 773.49, "duration": 4.88}, {"text": "I'm gonna travel for my day job, so sorry for the weird transition here", "start": 778.38, "duration": 3.349}, {"text": "This is the hotel room that I'm staying in I want to say. Thank you to everyone who worked on the data", "start": 781.73, "duration": 5.4}, {"text": "That was a big deal", "start": 787.13, "duration": 1.74}, {"text": "It would've taken dozens of hours", "start": 788.87, "duration": 1.98}, {"text": "So thank you everyone that did that especially the patrons who helped me fun things like Trent making the little high-speed camera cart", "start": 790.85, "duration": 6.48}, {"text": "Thank you to everyone who follows me on all the social media yet reddit Twitter Instagram obviously", "start": 797.93, "duration": 5.069}, {"text": "I'm not like an Instagram model, but I try to do intelligent stuff or at least things", "start": 802.999, "duration": 3.84}, {"text": "I'm thinking about which is normally kind of abnormal stuff, so thank you for following me on that and also", "start": 806.84, "duration": 5.76}, {"text": "Thank you for answering the call when I have that data problem if you're new here", "start": 812.6, "duration": 3.179}, {"text": "And you like the idea of crowd science feel free to consider subscribing to smarter every day", "start": 815.97, "duration": 4.7}, {"text": "To help me do stuff like this when I blast that out on social media or whatever", "start": 821.03, "duration": 3.63}, {"text": "I really appreciate the consideration for subscriptions and follows on all that stuff", "start": 824.66, "duration": 4.979}, {"text": "I'm just a dad that works for a living so whatever. Thank you anyway. I'm Destin. Thank you again. Have a good one", "start": 829.639, "duration": 7.95}, {"text": "Okay, you can do it! Trigger!", "start": 850.46, "duration": 1.64}, {"text": " ", "start": 852.1, "duration": 0.5}]