[{"text": "If you saw a wormhole in reality, it would appear round, spherical, a bit like a black hole.", "start": 1.38, "duration": 5.88}, {"text": "Light from the other side passes through and gives you a window to a faraway place.", "start": 8.12, "duration": 4.74}, {"text": "Once crossed, the other side comes fully into view with your old home now receding into that shimmering spherical window.", "start": 13.66, "duration": 6.66}, {"text": "But are wormholes real,", "start": 21.32, "duration": 1.8}, {"text": "or are they just magic disguised as physics and maths?", "start": 23.12, "duration": 3.34}, {"text": "If they are real, how do they work and where can we find them?", "start": 27.3, "duration": 3.48}, {"text": "[Kurzgesagt Intro]", "start": 31.92, "duration": 8.4}, {"text": "For most of human history,", "start": 41.28, "duration": 1.5}, {"text": "we thought space was pretty simple; a big flat stage where the events of the universe unfold.", "start": 42.78, "duration": 5.7}, {"text": "Even if you take down the set of planets and stars, there's still something left.", "start": 49.02, "duration": 4.04}, {"text": "That empty stage is space and it exists,", "start": 54.18, "duration": 3.14}, {"text": "unchanging and eternal.", "start": 57.72, "duration": 2.0}, {"text": "Einstein's theory of relativity changed that.", "start": 60.06, "duration": 2.92}, {"text": "It says that space and time make up that stage together, and they aren't the same everywhere.", "start": 63.76, "duration": 5.62}, {"text": "The things on the stage can affect the stage itself, stretching and warping it.", "start": 70.56, "duration": 4.64}, {"text": "If the old stage was like unmoving hardwood, Einstein's stage is more like a waterbed.", "start": 76.02, "duration": 5.98}, {"text": "This kind of elastic space can be bent and maybe even torn and patched together, which could make wormholes possible.", "start": 82.74, "duration": 7.02}, {"text": "Let's see what that would look like in 2D.", "start": 91.06, "duration": 2.0}, {"text": "Our universe is like a big flat sheet, bent in just the right way,", "start": 93.72, "duration": 4.6}, {"text": "wormholes could connect two very, very distant spots with a short bridge", "start": 98.32, "duration": 3.96}, {"text": "that you could cross almost instantaneously.", "start": 102.28, "duration": 2.64}, {"text": "Enabling you to travel the universe even faster than the speed of light.", "start": 104.92, "duration": 3.98}, {"text": "So, where can we find a wormhole?", "start": 109.66, "duration": 2.06}, {"text": "Presently, only on paper.", "start": 112.48, "duration": 2.0}, {"text": "General relativity says they might be possible, but that doesn't mean they have to exist.", "start": 115.0, "duration": 4.9}, {"text": "General relativity is a mathematical theory.", "start": 120.56, "duration": 2.5}, {"text": "It's a set of equations that have many possible answers, but not all maths describes reality.", "start": 123.06, "duration": 5.68}, {"text": "But they are theoretically possible and there are different kinds.", "start": 129.54, "duration": 3.68}, {"text": "EINSTEIN ROSEN BRIDGES", "start": 134.06, "duration": 2.34}, {"text": "The first kind of wormholes to be theorized were Einstein Rosen Bridges.", "start": 136.76, "duration": 4.38}, {"text": "They describe every black hole as a sort of portal to an infinite parallel universe.", "start": 141.4, "duration": 4.36}, {"text": "Let's try to picture them in 2D again.", "start": 146.24, "duration": 2.38}, {"text": "Empty space time is flat,", "start": 148.62, "duration": 1.76}, {"text": "but curved by objects on it.", "start": 150.38, "duration": 2.38}, {"text": "If we compress that object, space-time gets more curved around it.", "start": 152.76, "duration": 4.36}, {"text": "Eventually, space-time becomes so warped that it has no choice but to collapse into a black hole.", "start": 157.44, "duration": 6.04}, {"text": "A one-way barrier forms: the event horizon, which anything can enter but nothing can escape;", "start": 164.6, "duration": 6.16}, {"text": "trapped forever at the singularity at its core.", "start": 171.22, "duration": 3.1}, {"text": "But maybe there is no singularity here.", "start": 174.76, "duration": 2.44}, {"text": "One possibility is that the other side of the event horizon looks a bit like our universe again", "start": 177.62, "duration": 5.36}, {"text": "but mirrored upside down, where time runs backwards.", "start": 182.98, "duration": 4.54}, {"text": "In our universe things fall into the black hole.", "start": 187.52, "duration": 2.9}, {"text": "In the parallel universe, with backwards time,", "start": 191.3, "duration": 2.5}, {"text": "the mirror black hole is spewing things out a bit like a big bang.", "start": 193.8, "duration": 3.6}, {"text": "This is called a white hole.", "start": 197.96, "duration": 1.76}, {"text": "Unfortunately, Einstein-rosen bridges can't actually be crossed.", "start": 200.14, "duration": 3.4}, {"text": "It takes an infinite amount of time to cross over to the opposite universe and they crimp shut in the middle.", "start": 203.64, "duration": 5.42}, {"text": "If you go into a black hole, you won't become the stuff coming out of the white hole.", "start": 209.56, "duration": 4.04}, {"text": "You'll only become dead.", "start": 213.98, "duration": 1.58}, {"text": "So, to travel the cosmos in the blink of an eye, humans need a different kind of wormhole;", "start": 216.08, "duration": 5.18}, {"text": "a Traversable Wormhole.", "start": 221.26, "duration": 1.64}, {"text": "VERY OLD STRING THEORY WORMHOLES", "start": 224.66, "duration": 2.86}, {"text": "If string theory or one of its variations is the correct description of our universe,", "start": 227.88, "duration": 4.4}, {"text": "then we could be lucky and our universe might even have a tangled web of countless wormholes already.", "start": 232.36, "duration": 5.92}, {"text": "Shortly after the Big Bang,", "start": 238.96, "duration": 1.56}, {"text": "Quantum fluctuations in the universe at the smallest scales", "start": 240.52, "duration": 3.32}, {"text": "far far smaller than an atom may have created many, many", "start": 243.84, "duration": 3.86}, {"text": "traversable wormholes.", "start": 247.7, "duration": 2.12}, {"text": "Threaded through them are strings, called cosmic strings.", "start": 249.82, "duration": 3.32}, {"text": "In the first billionth of a trillionth of a second after the Big Bang, the ends of these tiny, tiny wormholes were pulled light-years apart;", "start": 253.6, "duration": 8.56}, {"text": "scattering them through the universe.", "start": 262.16, "duration": 1.64}, {"text": "If wormholes were made in the early universe,", "start": 264.6, "duration": 2.24}, {"text": "whether with cosmic strings or some other way, they could be all over; just waiting to be discovered.", "start": 266.84, "duration": 6.2}, {"text": "One might even be closer than we realize.", "start": 273.4, "duration": 2.46}, {"text": "From the outside, black holes and wormholes can look very similar;", "start": 276.82, "duration": 3.52}, {"text": "leading some physicists to suggest the supermassive black holes in the center of galaxies are actually wormholes.", "start": 280.46, "duration": 6.12}, {"text": "It will be very hard to go all the way to the center of the Milky Way to find out though, but that's okay.", "start": 287.3, "duration": 4.78}, {"text": "There might be an equally extremely hard way to get our hands on a wormhole, we could try to make one.", "start": 293.14, "duration": 5.18}, {"text": "MANMADE WORMHOLES", "start": 300.16, "duration": 2.26}, {"text": "To be traversable and useful, there are a few properties", "start": 302.72, "duration": 3.3}, {"text": "we want a wormhole to have.", "start": 306.02, "duration": 1.4}, {"text": "First, it must obviously connect to distant parts of space-time.", "start": 308.1, "duration": 3.72}, {"text": "Like your bedroom and the bathroom,", "start": 312.22, "duration": 2.24}, {"text": "or Earth and Jupiter.", "start": 315.36, "duration": 1.62}, {"text": "Second, it should not contain any event horizons, which would block two-way travel.", "start": 318.64, "duration": 4.78}, {"text": "Third, it should be sufficiently sized so that the gravitational forces don't kill human travelers.", "start": 323.88, "duration": 5.66}, {"text": "The biggest problem we have to solve, is keeping our wormholes open.", "start": 330.1, "duration": 3.22}, {"text": "No matter how we make wormholes, gravity tries to close them.", "start": 334.16, "duration": 3.48}, {"text": "Gravity wants to pinch it closed and cut the bridge; leaving only black holes at the ends.", "start": 338.32, "duration": 5.1}, {"text": "Whether it's a traversable wormhole with both ends in ours, or a wormhole to another universe,", "start": 343.86, "duration": 5.18}, {"text": "it will try to close unless we have something propping it open.", "start": 349.05, "duration": 3.509}, {"text": "For very old string theory wormholes, that's the cosmic strings job.", "start": 353.139, "duration": 4.04}, {"text": "For man-made wormholes, We need a new ingredient.", "start": 357.7, "duration": 3.12}, {"text": "Exotic matter.", "start": 361.62, "duration": 1.1}, {"text": "This isn't anything like we find on earth, or even antimatter.", "start": 363.56, "duration": 3.0}, {"text": "It's something totally new and different and exciting, with crazy properties like nothing that's ever been seen before.", "start": 367.14, "duration": 6.46}, {"text": "Exotic matter is stuff that has a negative mass.", "start": 374.62, "duration": 2.64}, {"text": "Positive mass like people and planets and everything else in the universe, is attractive because of gravity.", "start": 378.14, "duration": 4.96}, {"text": "But negative mass would be repulsive; it would push you away.", "start": 383.88, "duration": 3.2}, {"text": "This makes a kind of anti-gravity the props open our wormholes.", "start": 387.66, "duration": 4.34}, {"text": "And exotic matter must exert enormous pressure to push space-time open, greater even than the pressure of the centers of neutron stars.", "start": 392.54, "duration": 7.62}, {"text": "With exotic matter, we could weave space-time however we see fit.", "start": 401.04, "duration": 3.96}, {"text": "We may even have a candidate for this exotic matter, the vacuum of space itself.", "start": 406.84, "duration": 4.56}, {"text": "Quantum fluctuations in empty space are constantly creating pairs of particles and antiparticles,", "start": 413.06, "duration": 5.54}, {"text": "only for them to be annihilated an instant later.", "start": 418.6, "duration": 2.26}, {"text": "The vacuum of space is boiling with them, and we can already manipulate them to produce an effect similar to the negative mass we're looking for.", "start": 421.98, "duration": 8.16}, {"text": "We could use this to stabilize our wormholes.", "start": 430.78, "duration": 3.54}, {"text": "Once we're keeping it open, the ends would start together. So, we'd have to move them around to interesting places.", "start": 434.92, "duration": 6.32}, {"text": "We could start by wiring the solar system; leaving one end of each wormhole in orbit around the earth.", "start": 441.94, "duration": 5.26}, {"text": "We could flick others into deep space.", "start": 448.22, "duration": 1.94}, {"text": "The earth could be a wormhole hub for a vast interstellar human civilization spread over light-years,", "start": 450.76, "duration": 6.6}, {"text": "but only a wormhole away.", "start": 457.36, "duration": 1.96}, {"text": "However, wormholes have a dark side.", "start": 460.26, "duration": 2.36}, {"text": "Even opening a single wormhole, kind-of breaks the universe in fundamental ways, potentially creating time travel paradoxes,", "start": 463.06, "duration": 7.54}, {"text": "and violating the causal structure of the universe.", "start": 470.6, "duration": 2.6}, {"text": "Many scientists think that this not only means they should be impossible to make, but that it's impossible for them to exist at all.", "start": 474.58, "duration": 6.8}, {"text": "So, for now, we only know that wormholes exist in our hearts, and on paper in the form of equations.", "start": 482.5, "duration": 5.58}, {"text": "We know you want to know more about universe stuff, so, we're trying something new.", "start": 488.9, "duration": 4.28}, {"text": "Kurzgesagt and Brilliant are collaborating on a six-part video series about our favorite science and space things.", "start": 493.82, "duration": 5.66}, {"text": "Thanks to their help, there will be more videos on this channel in the next six months.", "start": 500.38, "duration": 4.24}, {"text": "Kurzgesagt has worked with Brilliant for a while now, and we love what they're doing.", "start": 505.56, "duration": 4.72}, {"text": "In a nutshell, Brilliant helps you to get ahead by mastering maths and science skills", "start": 510.28, "duration": 4.56}, {"text": "through actively solving challenging and fascinating problems.", "start": 514.84, "duration": 3.46}, {"text": "To support our collaboration with them, visit brilliant.org/nutshell and sign up for free today.", "start": 519.0, "duration": 5.66}, {"text": "The first 688 people that use the link", "start": 525.44, "duration": 2.5}, {"text": "will get 20% off their annual premium subscription.", "start": 527.98, "duration": 3.42}, {"text": "--FINAL SUBTITLE EDIT/READ BY: WinterPyro", "start": 541.02, "duration": 10.96}]