[{"text": "Hi! I'd like to move particles on a surface from one side to another by vibrating the surface without the gravity pulling it", "start": 0.0, "duration": 7.5}, {"text": "sideways, and I have some good idea how to do it. Let's do a flash forward to the future and see the result.", "start": 7.54, "duration": 5.4}, {"text": "F*ck. It's not working!", "start": 13.22, "duration": 1.74}, {"text": "So did it work? Don't tell me I'd like to make it.", "start": 14.96, "duration": 2.0}, {"text": "I have a good feeling about it.", "start": 17.24, "duration": 1.06}, {"text": "The whole concept is based on Chladni's vibrating plate creating figures due to standing waves.", "start": 18.3, "duration": 7.02}, {"text": "I'd like to make my own plate using a speaker as an actuator.", "start": 25.32, "duration": 3.38}, {"text": "As you know, a speaker is a magnet and a coil that when you excite the coil with an AC voltage, it vibrates at the", "start": 28.7, "duration": 6.56}, {"text": "same frequency.", "start": 35.28, "duration": 0.66}, {"text": "[Speaker buzzes at 60 Hz] AAH", "start": 35.98, "duration": 0.5}, {"text": "[Capacitor explodes] F*CK!", "start": 36.48, "duration": 1.32}, {"text": "I need another speaker. See, every speaker has its own rating. So for an 8", "start": 37.8, "duration": 4.78}, {"text": "ohm speaker like this running on 120 volt AC it needs to be rated at 1800 watts.", "start": 42.6, "duration": 5.58}, {"text": "Anyway...", "start": 48.52, "duration": 0.5}, {"text": "Let me explain Chladni's figures of it, although Physics Girl Diana explains it very well in her video you can watch.", "start": 49.02, "duration": 6.569}, {"text": "But let me see if I can do a quick summary.", "start": 55.809, "duration": 2.0}, {"text": "[calm voice] Basically, when you generate a wave in an infinite medium, it will travel forward forevah!", "start": 57.969, "duration": 7.7}, {"text": "Unless there is a change in the transmission medium, like a material change or a blockage, and the wave", "start": 66.58, "duration": 7.489}, {"text": "reflects from that change and returns.", "start": 74.83, "duration": 2.539}, {"text": "Now, the energy of the waves pass through each other like a Holy", "start": 77.98, "duration": 5.36}, {"text": "Spirit through a wall.", "start": 83.7, "duration": 1.84}, {"text": "[back to normal voice] But! The effect of the two energies acting on a single particle in the", "start": 85.54, "duration": 4.14}, {"text": "transmission medium is the sum of the two energies.", "start": 89.78, "duration": 2.92}, {"text": "For example,", "start": 92.7, "duration": 0.87}, {"text": "if you have two waves like this in a given time,", "start": 93.57, "duration": 2.519}, {"text": "the sum of the two waves at this point is positive. Here is zero, and here is negative.", "start": 96.28, "duration": 4.669}, {"text": "So when the original wave and its reflection add up, instead of a wave moving one way, you get a wave that looks", "start": 101.16, "duration": 6.56}, {"text": "stationary, which is called a standing wave with nodes and antinodes. And that's why this video is sponsored by ExpressVPN!", "start": 107.86, "duration": 7.64}, {"text": "Oh my god, I can't even integrate...", "start": 115.76, "duration": 2.4}, {"text": "Well, the thing is that I'm seeing more and more comments from my Chinese and Iranian viewers, which means that VPN is clearly working!", "start": 118.329, "duration": 7.28}, {"text": "So I'd like to promote it. If you also like a secure and non-restricted Internet experience, get three months of", "start": 125.609, "duration": 6.891}, {"text": "free service on a one-year package at expressvpn.com/electroboom", "start": 132.5, "duration": 4.24}, {"text": "after which it's less than seven dollars a month, with a 30-day money-back guarantee! [Sniffs armpit]", "start": 136.74, "duration": 6.18}, {"text": "I personally use their service, especially while travelling to secure my Wi-Fi connection among other things. Back to standing waves.", "start": 143.1, "duration": 6.859}, {"text": "We like to vibrate the string or the surface at resonance frequency, because at resonance with a tiny bit of input power,", "start": 149.959, "duration": 7.05}, {"text": "the waves add up and create massive waves.", "start": 157.14, "duration": 3.139}, {"text": "For a string, you could resonate at different frequencies with the string length at half a wavelength, a full wavelength,", "start": 160.44, "duration": 6.589}, {"text": "One and a half wavelengths and so on. These resonance frequencies depend on the speed at which the wave travels through the medium", "start": 167.28, "duration": 7.28}, {"text": "Which depend on the material, tension, weight, etc..", "start": 174.56, "duration": 3.4}, {"text": "Same thing happens in the 2D or 3D mediums. The waves", "start": 178.26, "duration": 3.66}, {"text": "Reflect from the edges and surfaces and create all sort of standing waves.", "start": 182.28, "duration": 4.639}, {"text": "I've already shown you there standing waves the microwaves generate on a cardboard box in the oven compartment.", "start": 186.92, "duration": 7.1}, {"text": "Assume this is the cross-section of a vibrating plate.", "start": 194.02, "duration": 2.1}, {"text": "If you pour sand on the plate where there are antinodes with the maximum vibration the sand jumps up and can't stay.", "start": 196.16, "duration": 7.02}, {"text": "But it settles on the nodes where the vibration is minimal and that creates the Chladni's figures.", "start": 203.28, "duration": 6.829}, {"text": "Let's make one. I'll make mine using these foam boards", "start": 210.209, "duration": 3.83}, {"text": "I bought from a dollar store and these twist-on wire connectors and a speaker, a houses speaker, which I call Nancy.", "start": 214.04, "duration": 7.74}, {"text": "[laughing] You know, Nancy Pelosi, the House's speaker.", "start": 222.08, "duration": 3.24}, {"text": "I cut my foam board into a 1 foot by 1 foot square. It's a little bit warped, but it should work.", "start": 225.9, "duration": 5.27}, {"text": "[Microphone change] I hot-glued a connector to the middle of the board.", "start": 231.17, "duration": 2.75}, {"text": "[Back to normal mic] Then I hot-glued a connector that acts as an standoff", "start": 234.18, "duration": 4.8}, {"text": "Right on top of the speaker, as level as possible.", "start": 239.02, "duration": 3.44}, {"text": "There you go. Something like this.", "start": 243.329, "duration": 2.09}, {"text": "Now, we have to drive the speaker and you can use an audio amplifier", "start": 245.85, "duration": 3.049}, {"text": "if you have one, or in my case, I have designed my own circuit a while back", "start": 248.97, "duration": 4.13}, {"text": "which I can drive from any audio jack or a function generator.", "start": 253.1, "duration": 3.089}, {"text": "Now we can attach the magnet of this speaker to a steel pan", "start": 256.53, "duration": 4.22}, {"text": "so it doesn't move around. Now, I drive the speaker using a sine wave from my function generator, trying to find out the resonance", "start": 260.75, "duration": 7.05}, {"text": "frequency of the plate. Right now it's at hundred hertz. And if I change the frequency,", "start": 267.92, "duration": 3.96}, {"text": "[Function generator beeping]", "start": 271.88, "duration": 2.0}, {"text": "You see, at around", "start": 274.3, "duration": 1.86}, {"text": "117 hertz, it becomes louder. So that's one resonance frequency, and harmonics of that would make the plate resonate.", "start": 276.16, "duration": 6.8}, {"text": "Now we pour a bunch of salt on the plate and", "start": 283.06, "duration": 2.9}, {"text": "start the speaker to see what happens.", "start": 286.1, "duration": 2.46}, {"text": "[Function generator beeps, silence, then salt rattles]", "start": 288.74, "duration": 1.82}, {"text": "Hehehe, look at that!", "start": 291.08, "duration": 2.76}, {"text": "Beautiful! It worked perfectly! See, the salt stays at the nodes of the standing wave where the plate doesn't vibrate", "start": 295.27, "duration": 7.039}, {"text": "This was at 117 hertz. Let's try other frequencies.", "start": 302.89, "duration": 3.47}, {"text": "[Piano music and salt rattling]", "start": 306.36, "duration": 5.94}, {"text": "169. There is a cloud of very tiny particles on the surface, see?", "start": 312.3, "duration": 5.56}, {"text": "360 hertz.", "start": 319.22, "duration": 1.36}, {"text": "It's interesting. It seems like these spots can hold very light particles like a cloud.", "start": 324.22, "duration": 5.32}, {"text": "519.", "start": 334.44, "duration": 1.28}, {"text": "A foam board doesn't work as good as those nice and straight metal plates they use but hey, it works well!", "start": 338.04, "duration": 5.7}, {"text": "Now that we made this,", "start": 343.9, "duration": 1.12}, {"text": "I want to see if I can move the nodes of the standing wave over the surface and move the particles with it", "start": 345.02, "duration": 5.979}, {"text": "If I can make it happen, I can even move the particles uphill. Now,", "start": 350.999, "duration": 3.69}, {"text": "here's my thought. What if I have actuators on both sides of the plate, and create my own wave and", "start": 354.689, "duration": 6.131}, {"text": "fake reflection to create my own standing waves. Hmm?", "start": 361.02, "duration": 4.379}, {"text": "Then I can vibrate one say at 100 Hertz and the other one at 101 Hertz", "start": 365.399, "duration": 4.53}, {"text": "The frequency difference results in the source waveforms to slowly shift relative to each other. See, here", "start": 369.93, "duration": 6.269}, {"text": "I have two frequencies with one hertz difference", "start": 376.199, "duration": 2.609}, {"text": "and this is the sum of the two. The frequency difference is SO small,", "start": 378.809, "duration": 3.42}, {"text": "the plate would resonate with both", "start": 382.509, "duration": 2.0}, {"text": "frequencies and, looking at their sum, the nodes of the wave would shift one way. To visualize it a bit better", "start": 384.58, "duration": 5.929}, {"text": "you can look at my video of the water levitating with strobe light. The water is", "start": 390.509, "duration": 5.011}, {"text": "vibrating at some frequency and the light is blinking at a slightly different frequency", "start": 395.6, "duration": 4.92}, {"text": "and it seems the water is moving slowly one way or the other. This time", "start": 400.74, "duration": 4.4}, {"text": "I cut a narrower piece of board and I hot glue two standoffs at the middle edges of the board and", "start": 405.149, "duration": 6.33}, {"text": "hot glue it on two speakers nice and level. Oh boy. I hope it works. Fun fact:", "start": 411.669, "duration": 5.959}, {"text": "Did you know that plates can have two or more different main harmonic resonance frequencies? For example, in this plate the wave", "start": 417.629, "duration": 7.44}, {"text": "reflects a shorter distance this way and a longer distance that way, that creates two different resonances.", "start": 425.199, "duration": 6.109}, {"text": "Did you know there are bells made to have two different frequencies? We can try this here. Here I have a glass that makes one tone.", "start": 431.309, "duration": 6.81}, {"text": "[Glass making a tone]", "start": 438.12, "duration": 0.879}, {"text": "We can see the frequency spectrum on my phone.", "start": 439.22, "duration": 2.64}, {"text": "[Glass making a tone]", "start": 441.86, "duration": 1.1}, {"text": "Only one peak at 1.1 kilohertz. Now, I added magnets to the glass as weights", "start": 442.96, "duration": 4.849}, {"text": "so it resonates slower this way and faster that way. Now if I flick the glass, you see two peaks.", "start": 447.809, "duration": 6.18}, {"text": "[Glass making more tones]", "start": 453.989, "duration": 2.571}, {"text": "Now, I have to update my audio amplifier so it can output two channels.", "start": 456.78, "duration": 3.96}, {"text": "[ow]", "start": 461.54, "duration": 1.02}, {"text": "Okay, so first we have to figure out at what frequency this plate oscillates,", "start": 462.56, "duration": 4.72}, {"text": "around 330 hertz. Now, I turn this on at 330 and that one at 331.", "start": 467.38, "duration": 5.86}, {"text": "[Pulsing, a bit distorted]", "start": 473.24, "duration": 2.62}, {"text": "Yep, you can hear it pulsing. What I mean by pulsing is that when you're adding two different frequencies", "start": 476.04, "duration": 6.59}, {"text": "they drift over each other like this,", "start": 482.63, "duration": 2.099}, {"text": "so when they are in phase, they add up,", "start": 484.83, "duration": 2.3}, {"text": "or when there are 180 degrees off, they cancel each other. And if I zoom out, you see that the resulting", "start": 487.229, "duration": 6.74}, {"text": "waveform is pulsing. The speed at which this pulsing happens is equal to the difference between the two frequencies.", "start": 494.039, "duration": 5.93}, {"text": "Now we pour salt on it.", "start": 500.52, "duration": 2.0}, {"text": "Well, it's moving around a little bit but not as I hoped. I'll just play music on it so you don't go crazy.", "start": 504.75, "duration": 6.229}, {"text": "So it's pulsing at 1 hertz right now, because the difference between the two frequencies is 1 hertz. Now,", "start": 518.96, "duration": 5.239}, {"text": "I'm gonna bring the frequencies closer so the pulsing is a slower. But the noise is killing me!", "start": 524.2, "duration": 5.489}, {"text": "Well, I was hoping for a better result,", "start": 544.62, "duration": 2.69}, {"text": "but I guess we learn through disappointment.", "start": 547.86, "duration": 2.419}, {"text": "It does move around a little bit,", "start": 550.8, "duration": 1.73}, {"text": "but I was hoping for the salt to move from one side of the plate to the other side", "start": 552.53, "duration": 4.02}, {"text": "Let me put back the square plate on the speakers and see if I get any better shapes.", "start": 560.16, "duration": 4.64}, {"text": "Okay, on the bigger plate it waves a little bit more.", "start": 565.98, "duration": 3.289}, {"text": "Just remembered that I have a piece of glass. Glass can resonate much better than a foam board. Let me replace this with that.", "start": 589.23, "duration": 6.049}, {"text": "I'm a bit afraid of resonating glass though.", "start": 595.41, "duration": 2.69}, {"text": "But the glass is much heavier for my tiny speakers to vibrate. Seems like it's making these crack lines.", "start": 598.16, "duration": 5.72}, {"text": "AAAOW", "start": 609.22, "duration": 1.18}, {"text": "Well, at least the glass didn't break but there was no waving action.", "start": 610.58, "duration": 3.56}, {"text": "I think I understand why combining two frequencies still didn't work. Yes,", "start": 614.149, "duration": 4.65}, {"text": "I have two different frequencies at each end,", "start": 618.8, "duration": 2.28}, {"text": "but that doesn't eliminate the fact that each wave also reflects from the edges of the board.", "start": 621.08, "duration": 4.799}, {"text": "So on the same line, the first source has standing waves like this and the second one like this, slightly shifted,", "start": 625.88, "duration": 6.809}, {"text": "so the salt only oscillates between these two nodes rather than a sweeping node across the board.", "start": 632.69, "duration": 5.82}, {"text": "Maybe my idea would work if there were no reflections from the edges of the board, but I don't think that's possible.", "start": 638.51, "duration": 5.519}, {"text": "Let me just glue one speaker at the center. I think it might look much better.", "start": 644.33, "duration": 3.659}, {"text": "The glass is probably too heavy for my speaker to vibrate.", "start": 647.99, "duration": 3.359}, {"text": "Yeah, the glass is too heavy for my tiny speakers, let me stick it on my subwoofer, should be able to vibrate it harder.", "start": 654.59, "duration": 7.309}, {"text": "It's interesting. I can clearly see the resonance in glass, see?", "start": 661.9, "duration": 3.9}, {"text": "It's vibrating here and there's a node around here. Then it's vibrating here. Let me increase the amplitude", "start": 665.8, "duration": 6.48}, {"text": "so the vibrations are more visible.", "start": 672.46, "duration": 2.5}, {"text": "[Glass breaking] OH SH*T", "start": 675.36, "duration": 3.44}, {"text": "Well, F*CK", "start": 679.28, "duration": 1.26}, {"text": "That definitely changed the resonance frequency of the plate. Well, I guess that's why they do it with metal plates.", "start": 680.54, "duration": 5.809}, {"text": "They don't break. Back to my two speaker setup. If I just run one of the speakers and utilize the reflection of", "start": 686.35, "duration": 7.77}, {"text": "one of the waves,", "start": 694.64, "duration": 1.8}, {"text": "at low frequency, I only create one node.", "start": 696.44, "duration": 2.929}, {"text": "As you can see here. See, with one speaker power and changing the frequency on that speaker", "start": 699.37, "duration": 5.4}, {"text": "I can push my particles forward.", "start": 704.77, "duration": 2.759}, {"text": "I can even bring it back, see?", "start": 709.13, "duration": 2.129}, {"text": "So it's possible to some extent. There are videos of holding particles in midair using standing waves, and they can move them around, too.", "start": 711.78, "duration": 7.46}, {"text": "But in their setup, they have hundreds of ultrasound speakers and by tuning them individually,", "start": 719.31, "duration": 5.75}, {"text": "they can slightly move things around. Maybe there is some good application for it", "start": 725.06, "duration": 4.199}, {"text": "But one thing that for sure works is ExpressVPN!", "start": 729.26, "duration": 2.76}, {"text": "It frees your internet access from local restrictions because you would connect through the country of your choice,", "start": 732.33, "duration": 6.38}, {"text": "which also makes your location private. It also encrypts your data.", "start": 738.71, "duration": 3.869}, {"text": "So if you have to connect to some shady Wi-Fi network,", "start": 742.58, "duration": 3.09}, {"text": "the guy next door connected to the same network won't be able to hack into your data.", "start": 745.67, "duration": 4.589}, {"text": "So, to take advantage of all these features, visit my link below to learn more and sign up. Thanks for using my link.", "start": 750.26, "duration": 6.21}]