[{"text": "This video is sponsored by Squarespace.", "start": 0.86, "duration": 3.1}, {"text": "It’s late April of the year 1091.", "start": 5.42, "duration": 3.0}, {"text": "Somewhere in southern Thrace, Emperor Alexios Komnenos rides in the vanguard of his recently assembled army,", "start": 8.64, "duration": 6.42}, {"text": "marching to challenge his enemy.", "start": 15.06, "duration": 2.38}, {"text": "A small group of riders loom in the distance, racing towards them.", "start": 17.66, "duration": 3.88}, {"text": "Alexios, squinting his eyes, recognises his own scouting party, sent to examine the area.", "start": 21.88, "duration": 6.14}, {"text": "The enemy was but a few kilometres away. Nodding to his officers, Alexios gives the order to quicken the pace.", "start": 28.32, "duration": 6.34}, {"text": "The battle was about to begin.", "start": 34.66, "duration": 2.52}, {"text": "It’s summer of the year 1086.", "start": 48.54, "duration": 3.36}, {"text": "After decades of weak rule of the Doukid dynasty and disastrous military defeats", "start": 52.0, "duration": 5.52}, {"text": "the once mighty Eastern Roman Empire is teetering at its foundations.", "start": 57.52, "duration": 4.76}, {"text": "The Imperial throne in Constantinople is held by Alexios,", "start": 62.44, "duration": 3.68}, {"text": "an emperor of the Komnenos noble family who managed to overthrow the incompetent Doukas dynasty in a bloodless coup, five years earlier.", "start": 66.12, "duration": 9.14}, {"text": "Though Alexios was considered a moderately skilled monarch,", "start": 75.82, "duration": 3.62}, {"text": "the extent of the rot within the Roman state that he had to face after his accession was enormous.", "start": 79.56, "duration": 6.66}, {"text": "The Roman economy suffered from stagnation, severe inflation and excessive spending.", "start": 86.48, "duration": 5.2}, {"text": "Moreover, the crippling defeat at Manzikert at the hands of Seljuk Turks fifteen years prior", "start": 91.84, "duration": 6.36}, {"text": "deprived the Byzantine Empire of control within the vast lands of the Anatolian Plateau,", "start": 98.3, "duration": 5.8}, {"text": "and brought to question their position as a leading power of the medieval world.", "start": 104.1, "duration": 5.2}, {"text": "But these were not the only problems facing Emperor Alexios,", "start": 109.88, "duration": 3.52}, {"text": "as he had to address the ever increasing fragmentation of his state and quell frequent rebellions threatening his reign.", "start": 113.46, "duration": 7.18}, {"text": "It seemed abundantly clear, that Alexios’s was ruling “in interesting times” on many different levels\"", "start": 120.96, "duration": 6.9}, {"text": "Despite these problems,", "start": 128.12, "duration": 1.46}, {"text": "he somehow managed to survive the first couple of years and slowly carry the Empire through this tumultuous time.", "start": 129.7, "duration": 7.4}, {"text": "Since 1087, the Eastern Roman Empire had to face increased pressure from beyond the Danube,", "start": 137.72, "duration": 5.92}, {"text": "as the nomadic tribes of the Cumans and Pechenegs, being hard pressed from the north by the rulers of Kievan Rus,", "start": 143.84, "duration": 7.26}, {"text": "frequently dared to cross the river and raid the countryside of the weakened Empire.", "start": 151.24, "duration": 5.0}, {"text": "Both tribes were of Turkic origin and in the preceding decades were often employed as mercenaries fighting against the Eastern Romans.", "start": 156.38, "duration": 8.4}, {"text": "Over the next four years, Alexios achieved little success in curbing the nomadic threat which,", "start": 165.22, "duration": 5.7}, {"text": "as the number of Cumans and Pechenegs steadily rose,", "start": 170.98, "duration": 3.24}, {"text": "became a heavy burden on the Byzantine economy.", "start": 174.22, "duration": 3.18}, {"text": "Yet the Emperor was unable to defeat the constantly rising number of raiders in a pitched battle,", "start": 177.64, "duration": 5.76}, {"text": "as it was too risky to hope that roughly twenty thousand Eastern Roman troops", "start": 183.56, "duration": 4.96}, {"text": "would be able to repel an army several times bigger, even if that number was inflated by women and children.", "start": 188.66, "duration": 7.58}, {"text": "By 1091 the Pecheneg and Cuman raiders were already roaming the countryside of Thrace,", "start": 196.86, "duration": 5.6}, {"text": "dangerously close to the capital.", "start": 202.66, "duration": 2.32}, {"text": "But luckily for Alexios in the spring of the same year he at last was presented with some good news.", "start": 205.36, "duration": 6.28}, {"text": "Fresh intelligence reports that he had received", "start": 212.02, "duration": 2.92}, {"text": "indicated that a significant wedge had recently emerged in the relationship between the Cumans and Pechenegs.", "start": 214.94, "duration": 7.48}, {"text": "Supposedly their alliance was severely strained over disagreements regarding the spoils of war and how they were divided,", "start": 222.58, "duration": 8.22}, {"text": "creating a substantial opportunity for the Byzantine Emperor.", "start": 230.8, "duration": 4.68}, {"text": "Alexios had waited a long time for such a chance.", "start": 236.02, "duration": 3.24}, {"text": "Using his diplomatic acumen and enticing promises of generous amounts of gold,", "start": 239.4, "duration": 4.94}, {"text": "he managed to turn the Cuman leaders to his side, adding roughly 40 thousand to his numbers.", "start": 244.42, "duration": 6.32}, {"text": "Of course, just like the Pechenegs, the Cumans travelled with entire families,", "start": 251.2, "duration": 4.32}, {"text": "which made the actual number of soldiers somewhat lower,", "start": 255.64, "duration": 2.92}, {"text": "but still Alexios managed to considerably increase the odds against the Pecheneg invaders.", "start": 258.66, "duration": 6.26}, {"text": "With the promise of military assistance from Cumans,", "start": 265.16, "duration": 2.94}, {"text": "Byzantines could finally plan an offensive action against the invaders.", "start": 268.1, "duration": 5.06}, {"text": "In mid April of 1091 the main body of the Pecheneg horde was seen camping in southern Thrace,", "start": 273.48, "duration": 7.56}, {"text": "not far away from the city of Ainos.", "start": 281.04, "duration": 3.1}, {"text": "Alexios had his army assembled, and upon the arrival of Cuman reinforcements", "start": 284.34, "duration": 4.58}, {"text": "he departed Constantinople to finally face the threat his people had suffered under for the past four year.", "start": 288.92, "duration": 7.44}, {"text": "In the early morning of the 29th of April, the Eastern Roman army arrived in the vicinity of the Pecheneg camp.", "start": 296.74, "duration": 7.8}, {"text": "Lack of any significant upheaval coming from the tents", "start": 304.74, "duration": 3.24}, {"text": "promised that the enemy leaders were unaware of the Byzantine troops approaching.", "start": 307.98, "duration": 4.76}, {"text": "With no hesitation, Alexios gave the command to attack,", "start": 312.98, "duration": 3.76}, {"text": "and sound of thousands of hoofbeats filled the surroundings as his men rushed to battle.", "start": 317.02, "duration": 6.64}, {"text": "Upon hearing the men yelling and horses galloping, the Pecheneg camp bustled with motion.", "start": 324.18, "duration": 5.26}, {"text": "The tribesmen grabbed their weapons and donned rudimentary sets of armour,", "start": 329.84, "duration": 4.34}, {"text": "but it was too late to form a battle line or even barely organized groups of warriors.", "start": 334.38, "duration": 6.06}, {"text": "The Byzantine army struck the camp with all its might", "start": 340.82, "duration": 3.42}, {"text": "butchering everyone who was unable to flee Roman sword or Cuman arrow.", "start": 344.28, "duration": 5.24}, {"text": "In a matter of minutes, the camp was overran", "start": 349.74, "duration": 2.92}, {"text": "and soon the last of the Pecheneg warriors who chose not to flee were added to the death toll.", "start": 352.86, "duration": 5.6}, {"text": "The Turkic tribesmen were totally unprepared for such a surprise blow at the hands of the Eastern Romans", "start": 358.78, "duration": 6.9}, {"text": "after four years of relatively easy plunder within the fertile Byzantine lands.", "start": 365.8, "duration": 6.28}, {"text": "Their force was virtually wiped out, and all of the survivors were captured and placed into imperial service.", "start": 372.54, "duration": 8.08}, {"text": "The battle, or rather the massacre, was the first meaningful victory for the Emperor Alexios Komnenos,", "start": 380.78, "duration": 7.3}, {"text": "and likely one of the precious few Byzantine victories in the last fifty years.", "start": 388.32, "duration": 6.1}, {"text": "Alexios’ ultimately successful struggle against the nomadic tribes from the other side of the Danube", "start": 394.78, "duration": 6.6}, {"text": "served as a turning point in the history of the Eastern Roman Empire.", "start": 401.5, "duration": 5.56}, {"text": "Not only had Alexios dispelled the Pecheneg threat inside the Empire,", "start": 407.38, "duration": 4.84}, {"text": "but also profoundly contributed to the later demise of the Pechenegs as an independent tribe.", "start": 412.36, "duration": 6.68}, {"text": "The Battle of Levounion was a turning point for the Byzantine Empire.", "start": 419.6, "duration": 4.58}, {"text": "Alexios proved to be able to rise to the challenge in the hour of need,", "start": 424.48, "duration": 5.18}, {"text": "and gained a much needed boost to his popularity in the wake of the battle,", "start": 429.66, "duration": 4.72}, {"text": "which certainly helped ease his later reign.", "start": 434.38, "duration": 3.12}, {"text": "The time of Alexios Komnenos on the imperial throne, although still marred with difficulties,", "start": 437.64, "duration": 5.88}, {"text": "ended the destructive streak of inept emperors and sparked a new, bright era for the Eastern Roman Empire.", "start": 443.52, "duration": 9.46}, {"text": "This video is sponsored by SquareSpace.", "start": 455.4, "duration": 2.8}, {"text": "If you’re looking for a platform to build a web-space that integrates functionality and versatility in a modular approach,", "start": 458.36, "duration": 5.64}, {"text": "then SquareSpace is the ally you’ve been looking for.", "start": 464.0, "duration": 3.06}, {"text": "With great features such as:", "start": 467.16, "duration": 1.46}, {"text": "Mail List collection and distribution to send out mass coms such as announcements and newsletters.", "start": 468.62, "duration": 4.72}, {"text": "Social Sharing that lets you ingest and send out to all major social media platforms.", "start": 473.46, "duration": 4.52}, {"text": "And our personal favorite, Integrated Analytics providing key intel on what is drawing the most attention in your web-sphere.", "start": 477.98, "duration": 7.52}, {"text": "If you’re looking to put yourself out there, create content, provide services or just want to tell your own stories,", "start": 485.5, "duration": 6.04}, {"text": "then click the link in the discretion below, visit squarespace.com/bazbattles", "start": 491.54, "duration": 5.12}, {"text": "and not only will you be supporting our channel but you will save 10% on your first purchase, helping you put yourself out there.", "start": 496.84, "duration": 7.64}]