[{"text": "This video is sponsored by World of Warships", "start": 0.3, "duration": 2.96}, {"text": "Download the game for free using the link in the description below", "start": 3.28, "duration": 3.32}, {"text": "and use the promotional code to propel your start.", "start": 6.6, "duration": 3.82}, {"text": "It's late spring of the year 1940.", "start": 13.88, "duration": 3.16}, {"text": "Following the rapid overwhelming of France and Low Countries (which gained Germany an unchallenged position in continental Europe)", "start": 17.12, "duration": 7.66}, {"text": "Hitler now attempts to knock the last major power in Europe out of the war.", "start": 24.78, "duration": 5.12}, {"text": "Yet the ensuing battle for domination over British skies", "start": 29.9, "duration": 3.76}, {"text": "proved the valour of the Royal Air Force pilots and capability of British industry,", "start": 33.66, "duration": 5.32}, {"text": "resulting in a first major defeat for the German war machine.", "start": 38.98, "duration": 5.04}, {"text": "Independent from these air operations above the English Channel and British soil,", "start": 44.02, "duration": 5.02}, {"text": "the German Kriegsmarine challenged the mighty power of the Royal Navy over its long-standing hegemony at sea.", "start": 49.04, "duration": 7.02}, {"text": "This daunting task was of vital importance to the Germans,", "start": 56.26, "duration": 3.44}, {"text": "as Great Britain (though a global power) being an island nation was heavily dependent on imported goods and raw materials.", "start": 59.76, "duration": 8.1}, {"text": "Thousands of commerce vessels crossed the Atlantic every month", "start": 68.06, "duration": 3.58}, {"text": "helping to keep the British economy running and both directly and indirectly supporting its war effort.", "start": 71.64, "duration": 5.92}, {"text": "Of course the Germans were fully aware of this vulnerability", "start": 77.82, "duration": 3.58}, {"text": "and since the war broke out in 1939 one of the main tasks of the considerably weaker, but rapidly expanding Kriegsmarine", "start": 81.52, "duration": 7.82}, {"text": "was to undermine British sea commerce and thus hinder its military industry and economic potential.", "start": 89.34, "duration": 6.52}, {"text": "This spanning sea campaign, known today as the Battle of the Atlantic, lasted for nearly six years", "start": 96.18, "duration": 6.32}, {"text": "and had a crucial impact on the war in Europe.", "start": 102.86, "duration": 3.16}, {"text": "It is to this backdrop that our story unfolds.", "start": 106.24, "duration": 3.58}, {"text": "It is the 21st March of 1941, two German battleships – the Scharnhorst and Gneisenau sail back to the port of Brest", "start": 110.64, "duration": 8.78}, {"text": "following their moderately successful sixty day long raid on Allied trading lanes.", "start": 119.42, "duration": 5.12}, {"text": "This action served two purposes:", "start": 124.64, "duration": 2.66}, {"text": "The tying down of a significant portion of the British Home Fleet with the presence of German capital ships loose on the Northern Atlantic.", "start": 127.3, "duration": 7.88}, {"text": "And also to serve as support for a small, yet deathly effective u-boat fleet", "start": 135.36, "duration": 4.84}, {"text": "which at the time was highly successful performing its mission to hunt down Allied merchant convoys crossing the Atlantic.", "start": 140.54, "duration": 7.2}, {"text": "The German Naval Command under Grand Admiral Erich Raeder was pleased with the results of the sortie,", "start": 147.96, "duration": 6.04}, {"text": "which either captured  or destroyed 22 ships and immediately decided to carry out yet another commerce raid,", "start": 154.0, "duration": 7.08}, {"text": "but this time utilizing all four modern German battleships.", "start": 161.08, "duration": 4.6}, {"text": "Such force operating on the Atlantic could pose a formidable threat not only to allied commerce convoys but even for the British Royal Navy.", "start": 165.68, "duration": 10.52}, {"text": "But this plan, dubbed \"Operation Rheinübung\" faced certain difficulties from the onset.", "start": 176.42, "duration": 6.56}, {"text": "Both Scharnhorst and Gneisenau were out of action for at least several months due to engine and torpedo damage respectively,", "start": 183.16, "duration": 7.82}, {"text": "while the newest battleship – the Tirpitz was still undergoing crew training.", "start": 191.16, "duration": 4.66}, {"text": "This meant that the only fully operational capital ship at the time", "start": 196.16, "duration": 4.72}, {"text": "was the pride of the German Navy and leading ship of her class – the Bismarck.", "start": 200.88, "duration": 5.42}, {"text": "Grand Admiral Raeder was determined to have his capital ships raiding the Atlantic convoys as soon as possible,", "start": 206.76, "duration": 6.36}, {"text": "because he wanted to avoid the expected cuts on the naval budget in light of the upcoming German invasion of the Soviet Union,", "start": 213.3, "duration": 7.72}, {"text": "where the Kriegsmarine wouldn't play any significant role.", "start": 221.02, "duration": 3.88}, {"text": "He opposed the idea of opening the Eastern Front,", "start": 224.9, "duration": 3.22}, {"text": "believing that it was United Kingdom which posed the greater threat to German hegemony in Europe.", "start": 228.12, "duration": 6.8}, {"text": "Regardless, preparations for the Bismarck's sortie into the Atlantic began.", "start": 235.36, "duration": 5.1}, {"text": "The only other serviceable ship with enough endurance for such a mission was the Prinz Eugen,", "start": 240.46, "duration": 5.62}, {"text": "an Admiral Hipper class heavy cruiser, which was subsequently added to the Bismarck's task force.", "start": 246.28, "duration": 6.6}, {"text": "Raeder appointed trustworthy admiral Gunther Lütjens to take command of \"Operation Rheinübung\" who soon raised his flag on the Bismarck.", "start": 253.04, "duration": 10.06}, {"text": "Raeder wanted to begin the operation in late April, during a new moon period and with favourable low-visibility conditions.", "start": 263.44, "duration": 7.74}, {"text": "However, due to a couple of issues with the Prinz Eugen, both ships remained in port until the middle of May.", "start": 271.34, "duration": 7.46}, {"text": "Worth mentioning is that Lütjens tried to change Raeder's mind regarding the upcoming sortie", "start": 278.94, "duration": 6.3}, {"text": "and he advised Raeder to wait until at least one of the three unavailable capital ships could join the Bismarck's mission.", "start": 285.48, "duration": 7.04}, {"text": "Lütjens, more than anyone else, was aware of the danger the sortie could spark", "start": 292.72, "duration": 4.84}, {"text": "as he had commanded Scharnhorst and Gneisenau's successful Atlantic raid months earlier.", "start": 297.62, "duration": 6.48}, {"text": "Yet Raeder was unable to yield to Lütjens’ wishes", "start": 304.1, "duration": 3.56}, {"text": "and he instead convinced Lütjens of the necessity of the presence of German capital ships on the Atlantic,", "start": 307.66, "duration": 7.1}, {"text": "even if it meant just one battleship would be involved in this operation.", "start": 314.76, "duration": 5.34}, {"text": "Late in the evening of the 18th of May, Prinz Eugen departed Gotenhafen and five hours later was followed by the Bismarck.", "start": 320.1, "duration": 8.7}, {"text": "Both ships rendezvoused in the Western Baltic, and, with the assistance of three destroyers,", "start": 328.8, "duration": 5.8}, {"text": "they steamed through the Great Belt heading to the Norwegian Sea.", "start": 334.6, "duration": 4.14}, {"text": "Yet Lütjens’ operation didn’t remain unnoticed for too long.", "start": 339.28, "duration": 4.08}, {"text": "While passing through Kattegat, the German battle group was sighted by a Swedish seaplane cruiser.", "start": 343.68, "duration": 6.44}, {"text": "A day later, while refuelling in a fjord near Bergen, was sighted by a British reconnaissance Spitfire.", "start": 350.28, "duration": 6.96}, {"text": "Lütjens expected that the British could already know that the Bismarck was off port,", "start": 357.66, "duration": 5.24}, {"text": "but the German air reconnaissance reports that he received on the 22nd of May", "start": 363.26, "duration": 4.62}, {"text": "stated that the Royal Navy ships were still anchored in Scapa Flow naval base in the Orkneys.", "start": 367.88, "duration": 6.18}, {"text": "This information possibly dispelled Lütjens doubts and he led both ships to the Denmark Strait,", "start": 374.72, "duration": 6.86}, {"text": "hoping that worsening weather would help the German ships to break out into the Atlantic unseen.", "start": 381.6, "duration": 6.96}, {"text": "In the evening of the 23rd of May, they reached the ice limit and set course along Greenland’s coast.", "start": 389.04, "duration": 7.4}, {"text": "Though the Denmark strait was officially 200 nautical miles wide, in late spring it was still considerably obstructed by pack ice,", "start": 396.58, "duration": 8.62}, {"text": "which basically halved its effective width.", "start": 405.2, "duration": 3.1}, {"text": "Soon, despite bad weather and low visibility, the German battle group encountered the HMS Suffolk,", "start": 408.3, "duration": 7.8}, {"text": "a British heavy cruiser equipped with a new type of radar that was tracking them.", "start": 416.1, "duration": 5.04}, {"text": "She soon took cover in the fog, but it was clear for Lütjens that their operation was no longer a secret", "start": 421.14, "duration": 7.02}, {"text": "and that the intelligence reports of a few days earlier were false.", "start": 428.3, "duration": 4.12}, {"text": "An hour later the Bismarck spotted another heavy cruiser to its port side –  the HMS Norfolk", "start": 432.88, "duration": 6.74}, {"text": "– and Lütjens gave the command to open fire immediately.", "start": 439.8, "duration": 4.02}, {"text": "Five salvos were fired, but none of them scored a direct hit.", "start": 444.04, "duration": 4.46}, {"text": "Despite this, the Norfolk was unable to fight on equal terms with the much stronger warship, so she set a smokescreen and retreated into the fog.", "start": 448.62, "duration": 9.5}, {"text": "Still, thanks to the Suffolk’s radar, the British cruisers were able to trace the German group.", "start": 458.6, "duration": 6.08}, {"text": "Lütjens was informed that the Bismarck’s radar was malfunctioning due to the force of the blasts from her own powerful artillery.", "start": 465.1, "duration": 7.84}, {"text": "As a result, he ordered the Prinz Eugen to take the lead.", "start": 473.1, "duration": 3.86}, {"text": "At this point, he could have tried to turn back and retreat to the Norwegian Sea,", "start": 477.2, "duration": 4.8}, {"text": "but, being encouraged by the bad weather, he decided to continue the mission and steam south west,", "start": 482.0, "duration": 6.68}, {"text": "hoping to shake off the British cruisers during the night.", "start": 488.68, "duration": 3.16}, {"text": "Lütjens anticipated that the Royal Navy’s capital ships were either too far away to intercept his task force or were still anchoring in Scapa Flow.", "start": 492.14, "duration": 9.78}, {"text": "It was a risky, but still viable, plan.", "start": 502.28, "duration": 2.96}, {"text": "Unfortunately, the bad news was still coming.", "start": 505.64, "duration": 3.44}, {"text": "Six hours later, at dawn, Prinz Eugen’s hydrophones detected the propeller noises of two ships on her port side.", "start": 509.36, "duration": 8.32}, {"text": "Lütjens expected another two British cruisers, but as these warships got closer,", "start": 517.94, "duration": 5.22}, {"text": "he realised from the size of their superstructures that heavier units were about to challenge him.", "start": 523.42, "duration": 5.78}, {"text": "Vice-admiral Lancelot Holland was approaching the German battle group with a force consisting of two capital ships in the lead:", "start": 529.66, "duration": 8.26}, {"text": "the mighty battlecruiser HMS Hood, the pride of the Royal Navy", "start": 538.22, "duration": 4.76}, {"text": "and a brand new battleship, the HMS Prince of Wales.", "start": 543.16, "duration": 4.0}, {"text": "The reason behind Holland’s aggressive course lay in the characteristics of the Hood’s armour.", "start": 547.46, "duration": 5.82}, {"text": "Though her main belt armour was thick, the deck received relatively little protection,", "start": 553.48, "duration": 5.62}, {"text": "leaving the ship vulnerable in long-distance exchanges where the plunging fire could easily penetrate the armour of her deck.", "start": 559.16, "duration": 7.6}, {"text": "Being over 12 miles away, the British ships opened fire with their forward turrets.", "start": 567.16, "duration": 5.48}, {"text": "While the Prince of Wales correctly tracked the more dangerous threat of the Bismarck,", "start": 572.88, "duration": 4.3}, {"text": "the Hood mistakenly aimed at the Prinz Eugen, which was leading the line and had quite a similar silhouette to the Bismarck’s.", "start": 577.18, "duration": 8.1}, {"text": "British initial salvoes missed and soon the Prince of Wales had to fight with malfunctioning armaments,", "start": 585.6, "duration": 6.6}, {"text": "a somewhat expected teething pain.", "start": 592.2, "duration": 2.58}, {"text": "In the meantime, the Hood’s next salvoes were much closer, throwing splinters across the Prinz Eugen’s boards.", "start": 595.06, "duration": 7.52}, {"text": "But the German guns remained silent. Lütjens was reluctant to return fire, even though it seemed that engagement was unavoidable.", "start": 602.76, "duration": 8.4}, {"text": "He still had Raeder’s orders in mind, which urged him to avoid encounters with equal British units at all costs", "start": 611.36, "duration": 7.6}, {"text": "as his primary mission was commerce raiding,", "start": 618.96, "duration": 2.96}, {"text": "but it seemed that there’s no way out.", "start": 621.92, "duration": 3.44}, {"text": "His artillery officers made a number of requests to open fire,", "start": 625.58, "duration": 3.92}, {"text": "but Lütjens first took the time to ensure that both of his ships’ armaments were aiming at the Hood", "start": 629.74, "duration": 6.0}, {"text": "and then waited until the optimal moment to strike.", "start": 635.94, "duration": 3.76}, {"text": "Eventually, the Bismarck’s guns roared in a full broadside fire followed by the Prinz Eugen’s salvo shortly thereafter.", "start": 640.04, "duration": 9.2}, {"text": "The initial fire yielded immediate results,", "start": 649.66, "duration": 2.82}, {"text": "as the Prinz Eugen scored a direct hit on the Hood with a high explosive shell causing a substantial fire on boards.", "start": 652.66, "duration": 7.8}, {"text": "At this point, the British shells of the Prince of Wales finally reached the Bismarck, penetrating her bow and causing a fuel leak.", "start": 661.02, "duration": 7.82}, {"text": "The Germans still held the advantage, firing full broadsides", "start": 669.12, "duration": 3.9}, {"text": "while the Prince of Wales used just half of her guns and the Hood still mistakenly concentrating her fire on the Prinz Eugen.", "start": 673.12, "duration": 7.8}, {"text": "Vice-admiral Holland ordered both of his ships to turn to port so all British guns could shoot at the Germans thus equalizing the encounter,", "start": 681.2, "duration": 9.08}, {"text": "but virtually a minute later the unexpected happened.", "start": 690.58, "duration": 3.74}, {"text": "From a distance just short of 9 miles, the Bismarck’s fifth salvo reached its target", "start": 694.6, "duration": 5.54}, {"text": "and one or more shells penetrated the Hood’s deck, seemingly without effect.", "start": 700.14, "duration": 5.14}, {"text": "British gunnery officers believed it was a dud,", "start": 705.54, "duration": 2.96}, {"text": "but seconds later an enormous magazine explosion tore the mighty Hood in two.", "start": 708.5, "duration": 5.8}, {"text": "The explosive effect of the Bismarck’s momentous direct hit left German sailors staring in awe,", "start": 714.46, "duration": 6.88}, {"text": "but admiral Lütjens remained calm and unmoved.", "start": 721.34, "duration": 3.68}, {"text": "Within next three minutes the blazing pride of the Royal Navy and for a long time the biggest warship of the world,", "start": 725.54, "duration": 7.64}, {"text": "disappeared from the ocean’s surface.", "start": 733.18, "duration": 2.52}, {"text": "She sunk with her entire 1,400 men crew. Just three seamen survived.", "start": 735.7, "duration": 6.0}, {"text": "But the battle didn’t end.", "start": 742.2, "duration": 1.86}, {"text": "The Prince of Wales adjusted her course to avoid the sinking wreck of the Hood", "start": 744.28, "duration": 4.2}, {"text": "and soon suffered concentrated fire from both of the German units which were both well positioned to switch targets.", "start": 748.64, "duration": 7.36}, {"text": "The distance between all opponents decreased, allowing even the Prinz Eugen to fire its secondary armament and prepare torpedo tubes.", "start": 756.12, "duration": 9.34}, {"text": "Both of Lütjens’ warships scored hits on the remaining British unit, causing medium damage.", "start": 765.64, "duration": 6.3}, {"text": "The Prince of Wales, clearly at a huge disadvantage, launched a smoke screen and began to retreat.", "start": 772.18, "duration": 6.28}, {"text": "A few more salvoes were fired by both sides as the distance between the enemies increased, but none reached their targets.", "start": 778.84, "duration": 7.46}, {"text": "The short, yet shattering Battle of the Denmark Strait thus came to an end.", "start": 786.5, "duration": 5.52}, {"text": "While the Prinz Eugen was essentially intact, not having been hit in the battle, the Bismarck was damaged.", "start": 792.48, "duration": 6.56}, {"text": "Her speed was slightly reduced due to the flooding of one of her boiler rooms and suffered a slight list to the bow and port side.", "start": 799.26, "duration": 8.06}, {"text": "What was more worrying was that one of the British shells had ruptured her bow,", "start": 807.44, "duration": 4.28}, {"text": "causing flooding of one of the forecastle tanks and causing her to slowly leak precious fuel.", "start": 811.72, "duration": 6.22}, {"text": "Lütjens was considering his options.", "start": 818.26, "duration": 2.6}, {"text": "He was aware that the British would seek revenge for the loss of their symbolic battlecruiser,", "start": 821.04, "duration": 4.98}, {"text": "but he didn’t know that the Royal Navy had employed the majority of its available warships to seek and destroy the German task force.", "start": 826.38, "duration": 8.8}, {"text": "The hunt for the Bismarck was about to begin.", "start": 835.36, "duration": 3.76}, {"text": "The hunt for the Bismarck has begun!", "start": 840.94, "duration": 2.08}, {"text": "But if you want to experience manning the bridge of some of history’s most iconic battle vessels for yourself then you should play World of Warships,", "start": 843.02, "duration": 7.88}, {"text": "a strategic military history game.", "start": 851.04, "duration": 2.16}, {"text": "Take to the seas in this free-to-play game that allows you to command your own naval fleet.", "start": 853.4, "duration": 5.94}, {"text": "Choose, upgrade and prepare your ships for tactical conflict and epic encounters.", "start": 859.5, "duration": 5.42}, {"text": "on the open waters with hundreds of ships and ever increasing customisations options.", "start": 865.1, "duration": 5.0}, {"text": "Click on the link in the description below, enter the promotional code and rule the waves.", "start": 870.48, "duration": 6.06}]