[{"text": "One of my favorite things to witness while in traffic is when someone behind me", "start": 4.9, "duration": 3.919}, {"text": "Violently switches lanes in an attempt to overtake me and those in front of me,", "start": 9.37, "duration": 4.069}, {"text": "But end up even farther back than where they started because they fail to understand that they were already in the fastest-moving lane.", "start": 13.44, "duration": 6.599}, {"text": "Granted, I don't know their emergency", "start": 20.35, "duration": 2.149}, {"text": "But, otherwise it brings me this cynical sense of joy due to their misfortune. *Sinister laugh* Am I an asshole?", "start": 22.5, "duration": 5.459}, {"text": "Oh also, when you're at a red light and the car beside you is", "start": 28.2, "duration": 2.7}, {"text": "Anticipating it at turning green so it starts inching forward to get that rolling start", "start": 30.9, "duration": 4.02}, {"text": "But then, the lights like: \"Let me hit him with that Advance Left Turn!", "start": 34.98, "duration": 3.32}, {"text": "AYEEAH!!!\"", "start": 38.3, "duration": 0.78}, {"text": "And then they're just awkwardly stuck in the middle of the intersection.", "start": 39.18, "duration": 3.0}, {"text": "OOH..", "start": 42.18, "duration": 0.5}, {"text": "Ironically, I can be guilty of this as well like those moments when you're at the checkout line", "start": 42.84, "duration": 4.8}, {"text": "And you switch to the seemingly shorter one", "start": 47.64, "duration": 2.069}, {"text": "But then there's some kind of price problem with a freaking", "start": 49.719, "duration": 2.63}, {"text": "cucumber or something and then the line you left has now advanced way past where your original spot was so then you're like screw this", "start": 52.48, "duration": 6.29}, {"text": "And you go back", "start": 58.87, "duration": 0.98}, {"text": "But then the cucumber line becomes free and now your lane is the one that stuck because the person in front of you can't get", "start": 59.85, "duration": 5.63}, {"text": "their debit card to work!!", "start": 65.48, "duration": 1.16}, {"text": "*Angry Dom*", "start": 66.64, "duration": 3.48}, {"text": "Oh boy, I sure wish I had the ability to reverse time and return to my original spot in exchange for a bit of my life span.", "start": 70.12, "duration": 6.56}, {"text": "(Damn, That sounds familiar.)", "start": 76.82, "duration": 0.5}, {"text": "It's moments like this that remind me how important patience is. Regardless if you're Christian or not", "start": 77.7, "duration": 5.279}, {"text": "Or if you practice any religion that articulates its value, patience is truly a virtue. I believe time is the most valuable", "start": 82.98, "duration": 8.0}, {"text": "Currency we have. Time is literally money. That's why we spend it. We spend time at school,", "start": 90.98, "duration": 5.7}, {"text": "We spend time at work,", "start": 96.729, "duration": 1.771}, {"text": "We spend time with friends and family, My animators and I spend time working on these videos,", "start": 98.5, "duration": 4.79}, {"text": "And you guys spend time watching them, and I greatly appreciate that. But unlike actual tangible money,", "start": 103.29, "duration": 6.089}, {"text": "We can't exactly invest time expecting to get more time back.", "start": 109.38, "duration": 3.86}, {"text": "It's not something we can put in our savings account and withdraw when we're retired", "start": 113.42, "duration": 4.34}, {"text": "Expecting to live longer and experience what we couldn't in the past. Wow, that sounds like it could be a good hypothetical. Hmm...", "start": 117.84, "duration": 6.16}, {"text": "We live in a time of immediacy and with the exponential growth of technology", "start": 124.079, "duration": 4.47}, {"text": "We're being nurtured to expect that results meet our demands right away, If not instantly it's not a negative thing", "start": 128.58, "duration": 6.74}, {"text": "I mean we have cars, because we can't all walk to work when it's a few cities away.", "start": 135.32, "duration": 4.02}, {"text": "We have cell phones, because we don't all have trained pigeons to send letters with.", "start": 139.66, "duration": 3.92}, {"text": "We have ovens and microwaves, because they ain't nobody got time to always cook with a bonfire", "start": 143.58, "duration": 4.52}, {"text": "Its all convenience. If I have Amazon Prime and it gives me the option to ship it tomorrow for free, or two days later for free", "start": 148.32, "duration": 7.48}, {"text": "What do you think I'm gonna pick?", "start": 155.94, "duration": 1.84}, {"text": "Yeah that's right, same-day shipping.", "start": 157.78, "duration": 2.02}, {"text": "I", "start": 159.96, "duration": 0.5}, {"text": "I WANT MY THING", "start": 160.46, "duration": 0.8}, {"text": "I WANT MY THING TO-DEEEHHH!!", "start": 161.26, "duration": 0.96}, {"text": "Cliche-ass Guy: BUT DOM, other people in the world are unfortunate and don't have access or can't afford these COnvenIEnceZZ!!", "start": 162.32, "duration": 7.84}, {"text": "Yeah, I know, I understand that. And I'm not making a point to undermine those people.", "start": 170.42, "duration": 4.56}, {"text": "I'm just stating where our current level of available consumer technology is, but we haven't perfected convenience yet.", "start": 174.98, "duration": 6.959}, {"text": "I don't think we ever will. We, as a species are", "start": 181.94, "duration": 3.26}, {"text": "Insatiable and there will always be something we believe we can do faster or more efficiently. And when we come across those", "start": 185.2, "duration": 6.18}, {"text": "Situations when we experience delay, that's when we start testing our patience. Like I said,", "start": 191.6, "duration": 6.42}, {"text": "\"Time expensive and valuable.\"", "start": 198.02, "duration": 2.38}, {"text": "And it's something we don't exactly earn, but possess from the beginning and slowly lose through the course of our life a lot of things", "start": 200.4, "duration": 6.52}, {"text": "are out of our control and as a result we lose some of that given time and", "start": 206.929, "duration": 4.191}, {"text": "That's okay, and accepting that it is okay. Is what patience is. I believe patience is developed through time", "start": 211.68, "duration": 6.89}, {"text": "Ironically you have to spend time to understand", "start": 219.3, "duration": 2.629}, {"text": "What being patient means it's a product of overcoming", "start": 221.93, "duration": 3.42}, {"text": "Disappointment you learn to teach yourself that when you've done all you can in a situation and it's still not going your way", "start": 225.69, "duration": 5.33}, {"text": "There's no point in being angry or sad about it", "start": 231.12, "duration": 2.779}, {"text": "I mean you'll feel a bit of stress initially", "start": 233.9, "duration": 2.19}, {"text": "But you'll come to realize that the outcome will be more or less the same", "start": 236.09, "duration": 3.119}, {"text": "Whether you're emotional or not the traffic doesn't move quicker if you honk your horn", "start": 239.34, "duration": 4.97}, {"text": "Everyone is in a mutual understanding", "start": 244.62, "duration": 1.8}, {"text": "That the point of getting on the road is to get off of it the cake won't bake faster", "start": 246.42, "duration": 5.149}, {"text": "if you set the heat higher than it should be you will just burn it and have to start over if", "start": 251.57, "duration": 4.559}, {"text": "You're seated at the back of the plane don't expect to get out first just because you unbuckled your seatbelt before the plane even landed", "start": 256.29, "duration": 6.559}, {"text": "This applies our interactions with others as well be patient with people we aren't all", "start": 262.89, "duration": 5.719}, {"text": "always on the same page", "start": 268.889, "duration": 1.4}, {"text": "And you can't expect everyone to have been exposed to the same privileges as you have you may have obvious", "start": 270.289, "duration": 5.76}, {"text": "Advantages over someone so maybe cut him some slack and let them catch up you don't contribute to anything when you stand ahead of someone", "start": 276.18, "duration": 6.829}, {"text": "And trip them when they're already behind not everything is a competition", "start": 283.009, "duration": 3.72}, {"text": "impatience only gives power to whatever current problem you have you have the thing causing you to be impatient and that", "start": 287.819, "duration": 6.32}, {"text": "Impatience fuels the thing and it becomes an infinite cycle until you decide to break it", "start": 294.3, "duration": 5.149}, {"text": "But how long are you supposed to tolerate the way when has it been too long you're probably asking", "start": 299.639, "duration": 6.709}, {"text": "Unfortunately, that's up to you and your judgment on a case-by-case", "start": 307.349, "duration": 3.2}, {"text": "Basis there really isn't a formula for it like time plus empathy over seven multiplied by ego", "start": 311.22, "duration": 6.259}, {"text": "I don't know", "start": 317.479, "duration": 0.761}, {"text": "It's more so for your mental health if things need to get done then so be it if you're waiting for the bus", "start": 318.24, "duration": 5.989}, {"text": "But it's an hour late, then there's definitely a problem", "start": 324.229, "duration": 2.79}, {"text": "Or you looked at the schedule wrong if you're waiting for your tinder date", "start": 327.09, "duration": 3.709}, {"text": "And they haven't replied to your text since breakfast either you got stood up or you might want to report a missing person", "start": 330.8, "duration": 6.0}, {"text": "If you have a driver update, and it says it's gonna take a few minutes, but it's been six hours", "start": 337.159, "duration": 4.95}, {"text": "Then that's way past being a patience issue please don't turn off your computer during installation. Nope you're holding me hostage", "start": 342.36, "duration": 7.88}, {"text": "Ain't nobody got time. Yeah, that's right. I restarted my computer when it told me not to and it works perfectly okay now", "start": 351.03, "duration": 6.919}, {"text": "This video has been brought to you by crunchyroll the leading platform for your anime needs", "start": 358.979, "duration": 4.61}, {"text": "They got anime they got manga", "start": 363.93, "duration": 2.269}, {"text": "They got drama well not not YouTube drama though like like actual dramas head on over to crunchyroll.com", "start": 366.21, "duration": 6.5}, {"text": "Slash Domics link in the description to receive a free premium membership for 14 days with premium you have access to add free", "start": 373.05, "duration": 7.429}, {"text": "1080p and", "start": 380.909, "duration": 0.961}, {"text": "Subtitle episodes and no need to be impatient because new episodes are available", "start": 381.87, "duration": 3.739}, {"text": "As soon as one hour after release in Japan and the app is available on nearly every device", "start": 385.77, "duration": 5.449}, {"text": "So be it at home or on the go yo got anime annual hands son", "start": 391.32, "duration": 4.399}, {"text": "I've really only been grinding through Dragon Ball super because childhood", "start": 395.72, "duration": 3.69}, {"text": "But I heard studio triggers darling in the Franks", "start": 399.48, "duration": 2.839}, {"text": "Frank's Fox Frank's is the hot show this season definitely you gotta check that out oh", "start": 402.51, "duration": 4.489}, {"text": "Yeah, card captures clear card is also another dive into nostalgia. What do you guys recommend?", "start": 407.04, "duration": 5.179}, {"text": "Let me know in the comments and who knows we might even pick it for a watch along once again", "start": 412.26, "duration": 4.549}, {"text": "That's crunchyroll.com slash domics link below and joy", "start": 416.81, "duration": 3.72}]