[{"text": "There's a war going on on London's streets right now. Two tribes:", "start": 0.0, "duration": 3.16}, {"text": "Two wheels versus four wheels.", "start": 3.22, "duration": 2.04}, {"text": "Bicyclists versus car-ists.", "start": 5.46, "duration": 1.96}, {"text": "Speaking personally as both a cyclist and a driver, I hate myself. But should I?", "start": 8.12, "duration": 4.22}, {"text": "Is it true that to provide infrastructure for one tribe you have to screw things up for the other?", "start": 12.34, "duration": 4.06}, {"text": "or can we learn to live side by side?", "start": 16.86, "duration": 1.76}, {"text": "or one behind the other? Or weaving in and out of each other?", "start": 18.96, "duration": 3.1}, {"text": "( ♫ ♫ ♫ )", "start": 23.48, "duration": 1.42}, {"text": "As discussed in the previous episode, we've now got lovely Cycle Superhighways.", "start": 29.96, "duration": 3.96}, {"text": "But unfortunately, progress for cycling infrastructure has been somewhat grinding somewhat to a halt.", "start": 34.36, "duration": 4.36}, {"text": "The current mayor, Sadiq Khan, and I'm sorry to say this cos I really like him", "start": 40.12, "duration": 3.0}, {"text": "has been pretty rubbish for cycling. He's cancelled cycling projects left, right and straight down the middle.", "start": 43.44, "duration": 5.12}, {"text": "His only achievement so far has been the \"Quietways\".", "start": 48.84, "duration": 2.98}, {"text": "The Quietways are a benign and barely noticeable network of signposts and tippex", "start": 52.54, "duration": 3.52}, {"text": "guiding cyclists onto less busy roads. But it's hard to imagine who will benefit from them.", "start": 56.2, "duration": 4.1}, {"text": "Not timid new cyclists, cos they still have to share with cars,", "start": 60.54, "duration": 2.72}, {"text": "and not experienced cyclists because they won't want to go the wiggly squiggly long way round.", "start": 63.26, "duration": 3.8}, {"text": "So, why is cycling being watered down in the capital?", "start": 68.14, "duration": 2.54}, {"text": "There are several different groups whose fault it is.", "start": 71.08, "duration": 1.98}, {"text": "In order to build cycle superhighways, TfL needs the cooperation of London's 32 local boroughs.", "start": 74.02, "duration": 5.1}, {"text": "The streets belong to them, and not all of them are enthusiastic about bikes.", "start": 79.56, "duration": 3.54}, {"text": "Kensington and Chelsea, the Slytherin of the London boroughs, has been the most obstructive of them all.", "start": 83.94, "duration": 4.04}, {"text": "CS9, which in the original proposal, was meant to go all the way to central London", "start": 88.38, "duration": 3.54}, {"text": "was cut back in 2016 to stop here at Kensington Olympia.", "start": 91.96, "duration": 3.12}, {"text": "And CS3, which was originally planned to go all the way to Acton, now stops here at Lancaster Gate.", "start": 95.68, "duration": 4.36}, {"text": "Coincidence?", "start": 100.48, "duration": 1.18}, {"text": "And it's not just the boroughs halting progress.", "start": 102.5, "duration": 1.74}, {"text": "Delays and cuts are also being caused by the curious Royal Parks Commission", "start": 104.6, "duration": 3.74}, {"text": "The Royal Parks of London are technically private land belonging to the Queen, not the local boroughs.", "start": 109.16, "duration": 4.52}, {"text": "So change here has always been slow and reluctant.", "start": 113.84, "duration": 2.24}, {"text": "Elec...tricity?", "start": 116.48, "duration": 1.56}, {"text": "When the East-West Cycle Superhighway was announced, the Royal Parks dithered for so long", "start": 118.56, "duration": 3.44}, {"text": "over which way it should go through St James's Park, TfL were forced to publish this embarrassing map", "start": 122.0, "duration": 4.38}, {"text": "with the route still not decided, long after construction had started.", "start": 126.44, "duration": 2.96}, {"text": "in a further poke in the tyres to cyclists, the Royal Parks installed speed bumps in Hyde Park", "start": 130.08, "duration": 4.5}, {"text": "on what used to be a really popular cycle route, hitting cyclists where it hurts the most...", "start": 134.72, "duration": 3.88}, {"text": "their balls.", "start": 139.2, "duration": 1.5}, {"text": "AND!!! The Church of Our Lady of Grace and St. Edward in Chiswick", "start": 141.2, "duration": 2.72}, {"text": "has been calling on their parishioners to literally pray for CS9 not to be built outside their church.", "start": 144.02, "duration": 4.66}, {"text": "So why do all these groups of people hate cyclists so much? What's their beef?", "start": 150.44, "duration": 4.28}, {"text": "Why don't they like cycle lanes? What's wrong with bicycle infrastructure according to them?", "start": 155.12, "duration": 4.14}, {"text": "Why do they have a problem with bicyclists?", "start": 159.74, "duration": 2.0}, {"text": "What, for them, is the reason that cycle infrastructure is such a bad thing?", "start": 162.1, "duration": 3.32}, {"text": "They give several different reasons.", "start": 165.86, "duration": 2.0}, {"text": "This man said that a cycle path would spoil the village-like atmosphere of Chiswick.", "start": 168.52, "duration": 3.54}, {"text": "but it was hard to hear him over the roar of traffic.", "start": 172.2, "duration": 2.28}, {"text": "Shopkeepers complained that the Mini-Holland scheme, which removed car parking spaces", "start": 175.0, "duration": 3.98}, {"text": "closed off rat runs and made the streets far more cycle friendly would cause all the shops to close down.", "start": 179.04, "duration": 4.08}, {"text": "But in fact, the opposite has happened and brought the area to life. So, aaaaaaah!!", "start": 183.52, "duration": 3.8}, {"text": "- Mrs. Panhandle from West Ruislip says...\n(female voice) - Dear Unfinished London", "start": 187.56, "duration": 3.08}, {"text": "Why should the Government spend millions of pounds on cyclists, when it's us drivers who pay our road tax", "start": 190.82, "duration": 5.32}, {"text": "and cyclists pay nothing?", "start": 196.14, "duration": 2.16}, {"text": "- F**k you, Mrs. Panhandle!", "start": 199.28, "duration": 1.32}, {"text": "First of all, if that were true that would be a good thing.", "start": 201.22, "duration": 2.18}, {"text": "Cars produce way more wear and tear on roads than bikes do, and second of all, it's not true.", "start": 203.54, "duration": 4.02}, {"text": "Road tax is not there to fund roads; it's an income stream for the Treasury like any other.", "start": 208.2, "duration": 4.18}, {"text": "And they can spend it on whatever they like.", "start": 212.54, "duration": 1.5}, {"text": "You wouldn't say freeloading pedestrians don't deserve street lamps.", "start": 214.68, "duration": 2.92}, {"text": "Mrs. Panhandle's anti-cyclist attitude is sadly quite a common one. And this is not helped by the media.", "start": 218.96, "duration": 5.88}, {"text": "According to nearly every bike-related article you read about in the newspapers", "start": 225.9, "duration": 3.82}, {"text": "cyclists are dangerous and irresponsible tearaways whose fault it usually is when an accident happens.", "start": 229.82, "duration": 4.22}, {"text": "And if they choose not to wear a helmet, well they only had it coming.", "start": 234.18, "duration": 2.8}, {"text": "This really annoys me actually. The sort of people who say \"Why don't you wear a helmet?\" are usually", "start": 237.4, "duration": 3.74}, {"text": "the sort of people who've never ridden a bike in their lives, and they're only saying it because", "start": 241.14, "duration": 3.06}, {"text": "they want to absolve themselves of all responsibility for cyclists' safety on the road.", "start": 244.2, "duration": 3.46}, {"text": "If you really want to make cycling safer, instead of giving everyone a helmet, give them a piece of paper", "start": 247.7, "duration": 3.8}, {"text": "saying \"For god's sake, never ever go on the left of a lorry because that's where almost every cycle death happens.\"", "start": 251.5, "duration": 4.7}, {"text": "By all means, wear a helmet if you want to; it could save your life if you're unlucky enough", "start": 256.2, "duration": 3.26}, {"text": "to land head-first into anything, but as for making helmets compulsory it doesn't make cycling safer", "start": 259.46, "duration": 4.26}, {"text": "and if you don't believe me, look at Australia, a country where the wearing of helmets is mandatory", "start": 263.86, "duration": 3.16}, {"text": "and hardly anyone cycles, and then compare that to the Netherlands or Denmark where everyone rides a bike", "start": 267.08, "duration": 3.56}, {"text": "and no-one wears a helmet. You don't make an activity safer by discouraging people from doing it, you....", "start": 270.64, "duration": 3.8}, {"text": "Whilst it's easy to dismiss these complaints as bunkum, there is one genuine, impossible to deny disadvantage", "start": 275.78, "duration": 5.6}, {"text": "that does come with the building of cycle superhighways.", "start": 281.44, "duration": 2.4}, {"text": "*nonsense cockney vowels and glottal stops*", "start": 284.9, "duration": 2.86}, {"text": "Yes it's true, some cycle lanes, especially the good ones, do indeed take away space that used to be", "start": 304.72, "duration": 4.66}, {"text": "available for cars. But unfortunately there's nowhere else practical for these cycle lanes to go.", "start": 309.38, "duration": 4.76}, {"text": "Some audacious architects have come up with some innovative suggestions", "start": 316.76, "duration": 2.9}, {"text": "for where else to put cycle paths other than the surface streets.", "start": 320.42, "duration": 2.0}, {"text": "TfL proposed building CS3 high up on the Westway, conveniently crossing Kensington and Chelsea", "start": 323.34, "duration": 4.68}, {"text": "without having to ask their permisson. But this was cancelled in 2017", "start": 328.08, "duration": 3.44}, {"text": "because it was impractical and terrifying and no one was ever going to use it.", "start": 331.58, "duration": 3.16}, {"text": "Norman Foster, the architect responsible for Boris Island, proposed a network of elevated cyclepaths", "start": 335.12, "duration": 4.7}, {"text": "called SkyCycle, floating above London's railway lines. But this was even more unnecessarily elaborate.", "start": 339.84, "duration": 5.22}, {"text": "Not to mention phenomenally expensive.", "start": 345.36, "duration": 1.56}, {"text": "And finally, in my opinion, the underwhelming-est of them all", "start": 347.38, "duration": 2.52}, {"text": "A series of lifts around the Strand going down to disused Tube tunnels converted into cycle paths", "start": 350.06, "duration": 4.26}, {"text": "with the deeply uninspiring name \"The Underline\", which I can think of at least twelve better names than.", "start": 354.36, "duration": 4.46}, {"text": "It's not rocket science. In cities like London where the streets aren't getting any wider,", "start": 359.42, "duration": 3.62}, {"text": "cycle paths do have to go on the road.", "start": 363.14, "duration": 2.32}, {"text": "If only we could redesign London from scratch.", "start": 366.22, "duration": 2.0}, {"text": "Imagine if our streets were wide enough for cars, buses and bikes. That'd be just perfect, wouldn't it...?", "start": 368.58, "duration": 5.22}, {"text": "ouldn't it... ouldn't it... ouldn't it...?", "start": 374.24, "duration": 2.76}, {"text": "Steeeeeeevenage. 32 miles north of London", "start": 377.96, "duration": 3.32}, {"text": "A new town built from scratch in the 60s where planners weren't limited by space.", "start": 381.36, "duration": 3.54}, {"text": "There are beautiful segregated cycle paths everywhere. But look.... empty.", "start": 385.38, "duration": 5.62}, {"text": "The good people of Stevenage have no incentive to use their cycle paths. Their roads are just too acceptable.", "start": 391.58, "duration": 4.82}, {"text": "They don't get massive traffic jams even in rush hour and all the shops have got free car parking", "start": 396.74, "duration": 3.92}, {"text": "So why would they bother with the bike?", "start": 400.66, "duration": 1.78}, {"text": "What we learn from Stevenage is, you don't just have to encourage people onto their bikes -", "start": 403.08, "duration": 3.5}, {"text": "you have to encourage them out of their cars.", "start": 406.8, "duration": 1.9}, {"text": "But what's wrong with cars?", "start": 409.1, "duration": 1.24}, {"text": "I'll tell you what's wrong with cars: Cars are incredibly space inefficient. That's what's wrong with cars.", "start": 410.54, "duration": 4.12}, {"text": "Look how many people are moving through the road when they're all in their cars. Not a lot.", "start": 415.28, "duration": 3.3}, {"text": "But watch what happens if you put them on bikes. Oooh!", "start": 419.0, "duration": 2.52}, {"text": "And it's not just bikers who benefit. Every single one of those new cyclists is someone no longer", "start": 421.88, "duration": 4.1}, {"text": "taking up space on the Tube, on the bus, or in a car.", "start": 426.12, "duration": 2.78}, {"text": "Yes, even drivers benefit from cycle lanes in the long-term.", "start": 429.2, "duration": 2.96}, {"text": "There will always be people that have to drive, like delivery vans and construction traffic, and ambulances", "start": 432.58, "duration": 4.52}, {"text": "and giraffes in transit. And they'll all get where they're going much faster", "start": 437.16, "duration": 3.0}, {"text": "when the road is being used only by people that have a f***ing good excuse for being there.", "start": 440.16, "duration": 3.78}, {"text": "By the way, I haven't even been talking about pollution!", "start": 444.98, "duration": 2.22}, {"text": "It almost goes without saying that cars pollute and bikes don't. But you know what?", "start": 447.52, "duration": 3.54}, {"text": "Even if all cars were electric they'd still be just as horribly space inefficient.", "start": 451.2, "duration": 3.46}, {"text": "This isn't about air quality - it's about sustainability.", "start": 455.14, "duration": 2.54}, {"text": "But it's also about air quality.", "start": 458.22, "duration": 1.74}, {"text": "So, hurting drivers is not merely a by-product of improving cycling; it's a desired effect.", "start": 461.2, "duration": 4.18}, {"text": "Saying that a cycle scheme doesn't work because drivers are unhappy, is a bit like saying", "start": 465.86, "duration": 3.78}, {"text": "that a diet doesn't work because it's making you hungry.", "start": 469.64, "duration": 1.96}, {"text": "London is not Stevenage.", "start": 473.5, "duration": 1.38}, {"text": "Its population is expected to hit 10 million by 2030. So if we're gonna make room for everybody", "start": 475.18, "duration": 4.68}, {"text": "cycling has to become more normal than driving.", "start": 480.06, "duration": 2.34}, {"text": "That's why I'm worried that cycle progress isn't progressing - there's still loads more to do.", "start": 482.9, "duration": 3.88}, {"text": "Uh?", "start": 487.9, "duration": 0.5}, {"text": "Ahh!", "start": 489.36, "duration": 0.5}, {"text": "Wh... whassat?", "start": 491.18, "duration": 0.64}, {"text": "What the f....?", "start": 493.16, "duration": 0.54}, {"text": "*spluttering", "start": 495.0, "duration": 0.82}, {"text": "So,  to sum up, things are getting better for cycling, but not better enough.", "start": 496.8, "duration": 3.38}, {"text": "Perhaps the most troubling thing about the cycle superhighways is that name - \"Super Highways\".", "start": 500.66, "duration": 4.34}, {"text": "It makes them sound like they're the best they could possibly be, like they're rare and exceptional.", "start": 505.38, "duration": 3.8}, {"text": "Whereas if you showed them to a Dutch person, they'd just think they're normal.", "start": 509.66, "duration": 2.7}, {"text": "- In fact, they're the bare minimum.\n(laughing and speaking in Dutch)", "start": 512.84, "duration": 2.66}, {"text": "London's cycling revolution is unfinished. These cycle lanes won't realise their incredible potential", "start": 515.72, "duration": 5.0}, {"text": "until they're everywhere. The Superhighways won't be super until there's nothing super about them.", "start": 520.84, "duration": 5.38}, {"text": "*SMASH!*\n- OWWWWWW!!!!", "start": 530.94, "duration": 2.0}, {"text": "OWWW!! OWWW!!! I can't feel my legs!!!", "start": 533.16, "duration": 5.4}, {"text": "OWWW....!", "start": 539.14, "duration": 0.88}, {"text": "♫ I've always wanted a monthly subscription to Skillshare", "start": 541.46, "duration": 3.5}, {"text": "♫ A monthly Skillshare subscription's what I want.", "start": 545.5, "duration": 2.68}, {"text": "♫ The thing I want is a monthly subscription to Skillshare", "start": 549.74, "duration": 3.24}, {"text": "♫ And the thing I do to a Skillshare subscription is want.", "start": 553.84, "duration": 2.74}, {"text": "What Skillshare is, is an online learning community with more than 17,000 classes for creators.", "start": 557.64, "duration": 4.7}, {"text": "It's got videos to teach you how to do stuff like make podcasts sound really good,", "start": 562.48, "duration": 3.02}, {"text": "make animations look really good, or make music sound really good,", "start": 565.64, "duration": 2.76}, {"text": "or make your skills with operating cameras really good.", "start": 568.48, "duration": 2.12}, {"text": "Personally, I personally recommend the Skillshare video about learning video editing with Premiere Pro", "start": 570.92, "duration": 3.88}, {"text": "which I've genuinely used and it's been genuinely really useful.", "start": 575.26, "duration": 1.88}, {"text": "- Can I use Skillshare?\n- No. You haven't subscribed yet.", "start": 577.66, "duration": 2.68}, {"text": "- Oh.\n- But don't worry, subscribing only costs less than $10 per month", "start": 580.48, "duration": 3.64}, {"text": "I'm not sposed to tell you this, but if you click on the link in the description below, the first 500 of you will get", "start": 585.04, "duration": 4.78}, {"text": "Skillshare for free for the first two months.", "start": 589.82, "duration": 2.14}, {"text": "♫ Skillshare's good good good good good good good", "start": 593.18, "duration": 3.64}, {"text": "♫ good good good good good good good good good good good.", "start": 596.82, "duration": 3.5}]