[{"text": "(Dank Music Plays)", "start": 0.0, "duration": 5.44}, {"text": "I love to sleep", "start": 5.44, "duration": 1.68}, {"text": "It requires minimum effort, and you get to escape the stress and woes of reality", "start": 7.12, "duration": 4.18}, {"text": "But sometimes I really dislike the need for it", "start": 11.3, "duration": 2.66}, {"text": "Sometimes I just want to be up for 48 hours straight without having my soul leave my body in order to search for a more responsible vessel.", "start": 14.0, "duration": 7.16}, {"text": "We only have a limited time on this planet and since I can't clone myself yet to maximize my activity output", "start": 21.16, "duration": 5.12}, {"text": "I'd at least want to maximize the time I spend being conscious", "start": 26.28, "duration": 3.6}, {"text": "Do you realize how many animes and video games I could finish much quicker if I didn't need to sleep?", "start": 29.88, "duration": 4.44}, {"text": "Because honestly they're making them at a much faster rate than I can finish them", "start": 34.32, "duration": 3.8}, {"text": "(Exaggerated Voice) Anime and video games Dom? How about them animations, okay?", "start": 38.12, "duration": 4.12}, {"text": "I subscribe for my weekly videos. I demand you stop being a lazy ass and upload Daily animations!", "start": 42.24, "duration": 6.04}, {"text": "*Sniffle*", "start": 48.28, "duration": 0.78}, {"text": "*Moan*", "start": 49.06, "duration": 0.88}, {"text": "I Have rights, okay? Sometimes. I wish we were like smartphones, but we just need to plug ourselves in to recharge", "start": 49.94, "duration": 1.58}, {"text": "Sometimes I wish we were like smartphones, where we just need to plug ourselves in to recharge", "start": 51.52, "duration": 4.6}, {"text": "but not have to power down to do so", "start": 56.12, "duration": 2.24}, {"text": "Okay, people have told me that it's bad to use your phone while charging, while other sources say otherwise", "start": 58.36, "duration": 5.2}, {"text": "Internet, can you confirm? Hit me with some skeins!", "start": 63.56, "duration": 3.48}, {"text": "Sleeping positions is another thing. I've always slept on my stomach for the majority of my life because that's just the most comfortable position for", "start": 67.04, "duration": 6.42}, {"text": "Me and helps me KO the quickest", "start": 73.46, "duration": 2.62}, {"text": "A couple of years ago", "start": 76.08, "duration": 0.6}, {"text": "I started feeling some spinal pains and when I went to go see a physician and told him how I slept he was like yeah", "start": 76.68, "duration": 5.189}, {"text": "Don't don't do that", "start": 81.869, "duration": 1.18}, {"text": "And now I have to be really aware of my spine and how I sleep so I don't end up being perpendicular someday", "start": 83.049, "duration": 5.591}, {"text": "But sometimes I just don't give a damn and will sleep in my favorite position anyway the victory pose", "start": 88.66, "duration": 4.88}, {"text": "Because I like to sleep like a winner and remind myself", "start": 93.54, "duration": 2.219}, {"text": "How good we have it up here in Canada while our neighbor has to deal with this cloud fiesta", "start": 95.76, "duration": 4.7}, {"text": "And then you have dreams which most of the time you don't even have control over", "start": 100.46, "duration": 4.0}, {"text": "Well, I mean I've tried", "start": 104.46, "duration": 1.64}, {"text": "We all have", "start": 106.1, "duration": 1.72}, {"text": "I like to start my dreams by apologizing to uncle Ben and then continuing to use my superhuman powers that responsibly with little to no consequences", "start": 107.82, "duration": 7.58}, {"text": "I've had so many apocalyptic dreams of World Armageddon", "start": 115.4, "duration": 1.96}, {"text": "Where monsters and zombie hordes are a daily norm and I'm forced to kill or be killed", "start": 117.42, "duration": 4.9}, {"text": "And then I wake up, and it's like", "start": 122.32, "duration": 1.46}, {"text": "*Heavy Breathing", "start": 123.78, "duration": 4.62}, {"text": "Awwww, still boring", "start": 128.4, "duration": 1.92}, {"text": "But on the flip side I've also had surreal dreams that were so", "start": 130.32, "duration": 2.56}, {"text": "Captivating that it forced myself to continue where I left off the previous night as if it was some episodic series on Netflix. [I]", "start": 132.9, "duration": 7.38}, {"text": "I used to sleepwalk as a kid and did some of the weirdest things", "start": 140.28, "duration": 3.18}, {"text": "And I only know this because my family witnessed me in the act", "start": 143.46, "duration": 2.54}, {"text": "So I can only imagine what kind of things happen when no one was around", "start": 146.0, "duration": 3.72}, {"text": "There was one time", "start": 149.72, "duration": 0.64}, {"text": "I went to the bathroom door which was just past my sister's room", "start": 150.36, "duration": 3.58}, {"text": "My older sister just happened to be awake and caught me just standing in the hallway", "start": 154.02, "duration": 3.48}, {"text": "When she got up and asked what I was doing", "start": 157.5, "duration": 1.92}, {"text": "I just started stroking the doorframe like a genie lamp", "start": 159.42, "duration": 2.98}, {"text": "Continue doing this for a solid minute and then turned around and went back to bed", "start": 162.4, "duration": 4.72}, {"text": "Another time when we used to live in a single-story house I was in the middle of a nap and I needed to go to", "start": 167.14, "duration": 4.44}, {"text": "The bathroom, but instead of waking up and doing so I slept walked to the bathroom", "start": 171.58, "duration": 4.9}, {"text": "But because of the layout of my house", "start": 176.5, "duration": 1.68}, {"text": "I overshot the distance and ended up peeing in the kitchen into a shelf where we kept the bread", "start": 178.18, "duration": 4.52}, {"text": "My mother scream was enough to bring me back into consciousness, but I was still in the middle of my session", "start": 182.7, "duration": 4.66}, {"text": "So I panicked and made an even bigger mess", "start": 187.38, "duration": 2.58}, {"text": "And then another time which was pretty f***ing creepy, I wandered into my sister's room", "start": 189.96, "duration": 4.68}, {"text": "Again, my sister asked if I was okay", "start": 194.64, "duration": 2.06}, {"text": "But I didn't answer and just walked up to the window", "start": 196.7, "duration": 2.02}, {"text": "Started gesturing to something that seemed to be standing outside on the street and repeated \"Come back\"", "start": 198.78, "duration": 5.28}, {"text": "\"Come back\" over and over until walking away and going back to bed", "start": 204.06, "duration": 4.74}, {"text": "What the f***?", "start": 208.8, "duration": 2.36}, {"text": "Was... Was my house haunted?", "start": 211.18, "duration": 2.68}, {"text": "Snoring is a big issue for me and proof of that was my most embarrassing moment", "start": 213.88, "duration": 4.08}, {"text": "Which many of you know about", "start": 217.98, "duration": 1.9}, {"text": "I've become very self-conscious about it and tried my best not to disturb others if I ever slept over at their place", "start": 219.88, "duration": 4.94}, {"text": "Or if I had to share a hotel room with someone", "start": 224.86, "duration": 2.94}, {"text": "If there aren't any form of acoustic barriers between us,", "start": 227.8, "duration": 2.56}, {"text": "I'd sometimes wait and make sure everyone is asleep first before I went to sleep or", "start": 230.36, "duration": 4.26}, {"text": "Else the Nasal concert would await them and continue to keep them away for the duration of the night", "start": 234.62, "duration": 4.82}, {"text": "People sometimes wonder if I'm dying because I tend to emulate the kind of sound through my snore", "start": 239.48, "duration": 4.62}, {"text": "But I'm actually perfectly fine after I wake up", "start": 244.1, "duration": 2.98}, {"text": "I should probably get it checked though or maybe I got possessed by spirit for my old house", "start": 247.08, "duration": 4.74}, {"text": "And it hinders my life by messing up my breathing and transforming me into an anthropomorphic vuvuzela", "start": 251.82, "duration": 5.98}, {"text": "It's like being an annoying superhero. \"Animator by Day, Vuvuzela by Night\"", "start": 257.86, "duration": 4.86}, {"text": "It's Domics, and he's here to interrupt your sleep, but also make you concern for his health and well-being", "start": 262.74, "duration": 6.04}, {"text": "After going through my architecture program in University", "start": 268.78, "duration": 2.6}, {"text": "I truly learned the value of sleep, and how much I'd be willing to go to jail for strangling someone for interrupting a 30-minute nap", "start": 271.38, "duration": 7.02}, {"text": "School gave me a few opportunities to sleep if I wanted to maintain my GPA", "start": 278.4, "duration": 3.8}, {"text": "It came to a point where I'd have to strategize and calculate bursts of sufficient sleep, That would adequately get me through the day", "start": 282.2, "duration": 6.8}, {"text": "\"Okay, it's now 2:00 a.m.. And my class is at 8 a.m.\"", "start": 289.0, "duration": 2.98}, {"text": "It takes me two hours to commute to school in no more than one hour to eat breakfast shower and get dressed", "start": 291.98, "duration": 5.14}, {"text": "Meaning I should wake up at 5:00 a.m. That gives me three hours of sleep", "start": 297.14, "duration": 5.36}, {"text": "Just enough cycles before I go into deep sleep. I should be good", "start": 302.52, "duration": 4.52}, {"text": "Wait...", "start": 307.04, "duration": 1.44}, {"text": "What's that sound?", "start": 308.48, "duration": 5.3}, {"text": "*Sigh*", "start": 313.78, "duration": 3.32}, {"text": "Yo, take notes for me", "start": 317.1, "duration": 3.18}, {"text": "I think my biggest issue with sleep is thinking I've never done enough in the day before doing so", "start": 320.28, "duration": 5.08}, {"text": "Some days pass by so quickly that I can't even recall the events that occurred that day", "start": 325.36, "duration": 5.14}, {"text": "\"Oh crap it's 1:00 a.m.. Already, and I've only animated one scene. How did I spend five hours reading creepypasta?\"", "start": 330.5, "duration": 5.8}, {"text": "Most of the time, I'm not even aware of how far we are into the week", "start": 336.3, "duration": 3.5}, {"text": "See my philosophy is that tomorrow only comes after I wake up, the postponing sleep is the only way I can extend that today", "start": 339.8, "duration": 7.02}, {"text": "Perhaps because I'm not ready for the tomorrow", "start": 346.82, "duration": 2.98}, {"text": "Or perhaps days are filled with so much bliss that going to bed means submission,", "start": 349.8, "duration": 4.22}, {"text": "And avoiding sleep is my futile attempt at over indulging in something that need not to be kept in the present, and can only survive as", "start": 354.02, "duration": 6.06}, {"text": "a past experience and", "start": 360.08, "duration": 2.06}, {"text": "And then I remember that Final Fantasy 15 keeps getting delayed, so I guess the sooner I sleep, the sooner, it'll release", "start": 362.14, "duration": 6.78}, {"text": "Square-Enix, get your sh** together", "start": 368.92, "duration": 4.76}, {"text": "Speaking of necessities, we got food in this month's anime loot crate!", "start": 373.68, "duration": 4.6}, {"text": "Well, not actual food but, but look we got an apron from food wars so you too can wear it and only it and be", "start": 378.28, "duration": 6.52}, {"text": "Just like a [Shiki-san] [pie] and make everyone around you uncomfortable", "start": 384.8, "duration": 4.96}, {"text": "Yeah", "start": 389.76, "duration": 1.12}, {"text": "You can have rob inception by eating ramen in a ramen bowl with a picture of ramen at the bottom! And you can read the", "start": 390.88, "duration": 5.6}, {"text": "First volume of the heartwarming manga sweetness and lightning. If you guys want to receive cool", "start": 396.54, "duration": 4.34}, {"text": "affordable anime merch like this every month, you can head over to lootcrate.com/Domics (Link below) with the code Domics to get", "start": 400.979, "duration": 6.829}, {"text": "10% off on new subscriptions! After that it's only less than $25 a month for six to eight items ranging from T-shirts,", "start": 407.808, "duration": 6.872}, {"text": "Manga, posters, figurines and much more! Just remember that the cutoff to get the month's theme crate for loot anime is the", "start": 414.72, "duration": 6.6}, {"text": "27th at 9 p.m, PST", "start": 421.32, "duration": 2.6}, {"text": "Although it's too late to receive these items you can look forward to next month's theme crate, Blade. Featuring items from gintama,", "start": 423.92, "duration": 7.02}, {"text": "Berserk, Sword art online and bleach!", "start": 430.94, "duration": 3.42}, {"text": "Again, that's lootcrate.com/Domics, with the code Domics, to save 10% on you subs! Link in the description below", "start": 434.36, "duration": 6.72}, {"text": "enjoy", "start": 441.1, "duration": 0.72}, {"text": "Oh wait, this is the end. Okay bye then :D", "start": 441.82, "duration": 3.36}, {"text": "(Subtitles by Faststrawberryboy)", "start": 445.18, "duration": 6.6}]