[{"text": "The other week, I was in a car on my way to a destination", "start": 4.69, "duration": 3.229}, {"text": "Well, obviously a car is never a destination. It's a tool to go to a destination...", "start": 8.46, "duration": 6.84}, {"text": "Anyway, we hit a red and we're behind this SUV and on the rear window", "start": 15.3, "duration": 3.74}, {"text": "I see a sticker that says \"mother of a stanford alumni\", and I was like \"what what is that?", "start": 19.04, "duration": 7.06}, {"text": "What what does that mean?\" Okay, I knew what it meant,", "start": 26.26, "duration": 4.3}, {"text": "obviously the drivers son or daughter graduated from Stanford University", "start": 30.88, "duration": 4.22}, {"text": "It's just that I usually see the actual graduate students bragging about it on their own vehicles, for some reason this one", "start": 35.14, "duration": 7.82}, {"text": "Bothered me, just a little bit too much...", "start": 43.39, "duration": 1.77}, {"text": "You know why because that parent did not put it on for their friends and family", "start": 45.16, "duration": 5.06}, {"text": "And I speculate this because if they had that much level of pride their mutual's wouldn't need a sticker to be informed of that matter", "start": 50.22, "duration": 7.34}, {"text": "They would have been called on the phone or have been sent a text or been updated in person at a party", "start": 57.56, "duration": 5.46}, {"text": "\"Hey, Frankie! (ya d*ck bag), guess what? My son is a post", "start": 63.039, "duration": 3.74}, {"text": "Secondary", "start": 67.33, "duration": 1.17}, {"text": "Graduate. No, they put it on for the world to see, and I was in that world", "start": 68.5, "duration": 5.02}, {"text": "I didn't like it...", "start": 74.14, "duration": 1.2}, {"text": "Syndical Dom just just came out and immediately  HATED this parent (Oh my)", "start": 75.34, "duration": 3.08}, {"text": "From who he knows nothing about the fact that they're,", "start": 78.42, "duration": 2.28}, {"text": "Very proud of their offspring, they might have been first-generation immigrants who had to start from the bottom and their family faced through many hardships of", "start": 80.98, "duration": 1.54}, {"text": "they might have been first-generation immigrants who had to start from the bottom and their family faced through many hardships of", "start": 82.52, "duration": 5.24}, {"text": "Discrimination and whatnot, I don't know, this is just a presumptuous and rhetorical rant!", "start": 87.76, "duration": 4.74}, {"text": "BUT yeah! This was a parent shoving their kids achievement into anyone who was, unfortunately, behind them in traffic", "start": 92.5, "duration": 6.16}, {"text": "And I found it hard to believe if anyone in the world would care", "start": 98.67, "duration": 3.54}, {"text": "Do they expect someone to just be walking by and be like, (Highly exaggerated GASP)", "start": 102.34, "duration": 3.12}, {"text": "\"Ma'am, Ma'am,\"", "start": 105.46, "duration": 2.0}, {"text": "Congratulations on being a parent to your son. You should be very proud,", "start": 107.53, "duration": 4.879}, {"text": "Very proud.\"", "start": 113.1, "duration": 2.04}, {"text": "\"Oh my God,\"", "start": 115.14, "duration": 0.74}, {"text": "Thank you the stranger in the supermarket parking lot. I spent", "start": 116.26, "duration": 3.82}, {"text": "$20 on this sticker. It's about damn time someone noticed.\"", "start": 120.64, "duration": 3.919}, {"text": "I mean congratulations to your kid of course for his or her or their hard work and being in debt", "start": 124.56, "duration": 5.58}, {"text": "But I didn't care. Should have saved that", "start": 130.14, "duration": 2.52}, {"text": "$20 unless they changed the world by finding the cure for cancer or they invented a teleportation device at which", "start": 132.94, "duration": 6.139}, {"text": "They should have probably had a sticker that read,", "start": 139.08, "duration": 1.94}, {"text": "\"Mother of cancer destroyer\", or,", "start": 141.02, "duration": 2.14}, {"text": "\"Mother of the reason your long-distance relationship is now easy\"", "start": 143.32, "duration": 3.18}, {"text": "But, the way I saw it, I read it as if it was how they introduced themselves when they first meet people.", "start": 146.7, "duration": 5.6}, {"text": "\"Hello, I'm Dominic.\"", "start": 153.18, "duration": 1.44}, {"text": "\"Dominic, pleasure to meet you. Mother of a Stanford Alumni.\"", "start": 154.62, "duration": 4.0}, {"text": "\"Shut the f*** up!\"", "start": 158.62, "duration": 1.04}, {"text": "They might as well have stuck on a dick pic on their car! (Oh my)", "start": 159.66, "duration": 2.9}, {"text": "I mean of course it's more obscene, and I guess it wouldn't make sense if they were a mother", "start": 162.57, "duration": 4.799}, {"text": "But, it's like they're going, \"Yea boi, look at dat, HEHEHE.\"", "start": 167.369, "duration": 4.131}, {"text": "\"Okay, congrats on your huge dong, but NO ONE asked...\"", "start": 171.92, "duration": 3.7}, {"text": "I'm not discouraging parents from being proud of their kids", "start": 175.72, "duration": 2.66}, {"text": "I mean, isn't that the reason why half of us went to school for things we're not fully passionate about, haha haha.", "start": 178.68, "duration": 5.68}, {"text": "But yeah, no. Be proud, but calm down about it. You know?", "start": 184.92, "duration": 4.78}, {"text": "They graduated, they made it, cool. Throw a celebration, show them personally that you were proud of them!", "start": 189.84, "duration": 5.88}, {"text": "You don't have to go around clarifying to everyone that \"Hey, this, this kid right here,", "start": 195.72, "duration": 5.58}, {"text": "This university graduate,", "start": 201.46, "duration": 1.72}, {"text": "This Master's degree owner, yeah, I made him.", "start": 203.3, "duration": 3.52}, {"text": "He came out of me.\" (What about Dad?)", "start": 206.82, "duration": 1.5}, {"text": "\"Partial credit.\" (There he is)", "start": 208.32, "duration": 0.72}, {"text": "I'm sure they wanted to make you proud, but they probably didn't intend for you to shove it down everyone's throat.", "start": 209.36, "duration": 4.32}, {"text": "And if they did then okay, I guess their douchey pride runs in the family.", "start": 214.02, "duration": 3.54}, {"text": "To me, personally,", "start": 218.08, "duration": 1.86}, {"text": "My opinion,", "start": 219.94, "duration": 0.82}, {"text": "Kind of makes it seem like that's all your kid is to you.", "start": 221.42, "duration": 2.68}, {"text": "Again, a presumptuous rant.", "start": 224.1, "duration": 1.78}, {"text": "I just feel like parents need to chill a little bit with the career pressures on their kid,", "start": 226.38, "duration": 4.22}, {"text": "If you push them to pursue a path that was for their own good,", "start": 230.6, "duration": 2.68}, {"text": "Then push for that cause.", "start": 233.4, "duration": 1.88}, {"text": "Don't push for your own pride.", "start": 235.48, "duration": 2.28}, {"text": "Save $20.", "start": 238.42, "duration": 2.0}, {"text": "Hey guys this video has been brought to you by Crunchyroll!", "start": 242.68, "duration": 3.46}, {"text": "If there's anything to be proud of, it's the ability to watch high-quality anime at your disposal!", "start": 246.14, "duration": 4.06}, {"text": "If you head over to crunchyroll.com/domics", "start": 250.64, "duration": 2.72}, {"text": "Link below, you can binge on some of your favorite anime with a free premium membership for 14 days.", "start": 253.4, "duration": 5.18}, {"text": "Definitely a lot of time to catch up and be up-to-date to shows like Attack on Titan and My Hero Academia", "start": 258.84, "duration": 4.82}, {"text": "It still provides you with ad free 1080p and professionally subbed episodes as soon as an hour release after Japan", "start": 264.03, "duration": 6.66}, {"text": "Crunchyroll is also available as a convenient app on nearly every device.", "start": 271.51, "duration": 4.609}, {"text": "Once again, that's crunchyroll.com/domics ; link in the description. Enjoy!", "start": 276.12, "duration": 4.08}, {"text": "[music continues]", "start": 280.84, "duration": 12.6}, {"text": "(What's your Favorite Anime?)", "start": 293.44, "duration": 0.5}]