[{"text": "I remember when I was a kid waiting an hour for my favorite TV show to come on,", "start": 1.96, "duration": 4.06}, {"text": "which was Sharon, Lois & Bram.", "start": 6.02, "duration": 1.72}, {"text": "That felt like eternity, but as I've gotten older, everything seems to have sped up.", "start": 7.74, "duration": 5.6}, {"text": "Time is going much faster. That's something virtually everyone agrees upon.", "start": 13.8, "duration": 3.94}, {"text": "\"Yeah, I feel like- I feel like it does.\"", "start": 17.74, "duration": 1.08}, {"text": "\"Oh man, so much.\"", "start": 18.82, "duration": 1.36}, {"text": "\"Each year sort of gets faster and faster.\"", "start": 20.18, "duration": 2.0}, {"text": "But why is this? Is it just an illusion or are there good scientific reasons why time appears to go faster", "start": 22.18, "duration": 5.44}, {"text": "as we get older?", "start": 27.62, "duration": 1.04}, {"text": "Well, I'm working with the National Geographic Channel's Brain Games, a show that explores", "start": 29.04, "duration": 3.7}, {"text": "the inner workings of the human mind through experiments and interactive games to test out some", "start": 32.74, "duration": 4.66}, {"text": "theories about why this actually occurs.", "start": 37.4, "duration": 2.18}, {"text": "There is a reasonable sounding argument that says each year goes faster because it makes up a smaller fraction", "start": 39.66, "duration": 5.94}, {"text": "of your entire life.", "start": 45.6, "duration": 1.36}, {"text": "\"Let's say I was only 20. One year is only 1/20th of my age. But when I'm 67, one year is 1/67th of my age.\"", "start": 46.96, "duration": 9.08}, {"text": "This graph shows one year as a percentage of your life at each age.", "start": 56.04, "duration": 4.32}, {"text": "But what I find weird about this is if you add up the area underneath the curve, you'll find that you've already", "start": 60.36, "duration": 5.94}, {"text": "lived half of the total by age 6.", "start": 66.3, "duration": 2.84}, {"text": "So, I really don't think this is how our brains perceive time.", "start": 69.14, "duration": 3.26}, {"text": "You really think that, like, a day now is-", "start": 72.4, "duration": 2.3}, {"text": "\"Of course not.\" [laughter]", "start": 74.7, "duration": 2.46}, {"text": "I think there are better reasons why time appears to speed up as we get older.", "start": 77.16, "duration": 4.78}, {"text": "So I've come to Venice Beach to find two groups of people: The older and younger", "start": 81.94, "duration": 4.22}, {"text": "to see if their perceptions of time differ.", "start": 86.16, "duration": 2.32}, {"text": "So what I want to do is I want to set my timer going and without counting,", "start": 88.48, "duration": 4.08}, {"text": "you tell me when you think a minute is up.", "start": 92.56, "duration": 1.58}, {"text": "\"Let's go.\"", "start": 94.14, "duration": 0.5}, {"text": "Start.", "start": 94.64, "duration": 0.5}, {"text": "\"Okay.\"", "start": 95.14, "duration": 0.5}, {"text": "Everywhere around the world, when this experiment is performed, older people typically overestimate", "start": 95.64, "duration": 4.68}, {"text": "while younger people measure it quite accurately.", "start": 100.32, "duration": 2.6}, {"text": "\"Alright, probably stop?\"", "start": 102.92, "duration": 1.38}, {"text": "\"Yep.\"", "start": 104.3, "duration": 0.5}, {"text": "Wooo, one minute, two seconds.", "start": 105.42, "duration": 2.96}, {"text": "A minute and two seconds.", "start": 108.38, "duration": 1.5}, {"text": "A minute and five.", "start": 109.88, "duration": 0.88}, {"text": "As we get older, the rate at which our neurons fire, or our neuron conduction velocity, it decreases.", "start": 110.76, "duration": 6.72}, {"text": "And you can think of this firing rate a little bit like an internal clock.", "start": 117.48, "duration": 3.7}, {"text": "And so, if our internal clock is slowing down, that would make everything else, external time,", "start": 121.18, "duration": 5.78}, {"text": "seem to be speeding up.", "start": 126.96, "duration": 1.52}, {"text": "\"I'm going to tell you the time.\"", "start": 128.74, "duration": 1.28}, {"text": "Now?", "start": 130.02, "duration": 0.5}, {"text": "\"Now.\"", "start": 130.52, "duration": 0.5}, {"text": "\"One minute.\"", "start": 131.02, "duration": 0.56}, {"text": "That's it? That was one minute?", "start": 132.1, "duration": 1.76}, {"text": "\"One minute.\"", "start": 133.86, "duration": 0.56}, {"text": "Minute, seventeen seconds.", "start": 134.42, "duration": 1.54}, {"text": "\"Not bad, right?\"", "start": 135.96, "duration": 0.5}, {"text": "Not bad.", "start": 136.46, "duration": 0.56}, {"text": "\"I thought I'd be a lot closer actually, but I guess I wasn't.\"", "start": 137.02, "duration": 2.14}, {"text": "Do you want to know what it really was?", "start": 139.16, "duration": 0.98}, {"text": "One minute forty seven.", "start": 142.48, "duration": 0.96}, {"text": "\"No way, it was almost two minutes? It was actually almost two minutes.\"", "start": 143.44, "duration": 3.44}, {"text": "\"It really is amazing how fast time flies by, it really is.\"", "start": 146.88, "duration": 3.06}, {"text": "Our sense of time, or chronoception, is not like one of the standard five senses. It has no specialized", "start": 149.94, "duration": 6.56}, {"text": "receptor cells and it does not appear to be localized in just one part of the brain.", "start": 156.5, "duration": 4.9}, {"text": "Perhaps this suggests that it's not one coherent thing at all.", "start": 161.4, "duration": 4.16}, {"text": "But it does seem that our perception of time is very fundamental.", "start": 165.56, "duration": 3.24}, {"text": "Studies of rats have shown that even with their neocortex removed - that is, the higher order thinking", "start": 168.8, "duration": 5.2}, {"text": "part of their brains- They are still able to learn how to time forty seconds accurately.", "start": 174.0, "duration": 5.7}, {"text": "That's quite remarkable, and it suggests our sense of time evolved early and is one of the fundamental", "start": 179.7, "duration": 5.84}, {"text": "functions of the brain.", "start": 185.54, "duration": 1.44}, {"text": "But that doesn't mean out brains always represent time faithfully.", "start": 186.98, "duration": 3.52}, {"text": "For example, have you noticed that really good movies seem to go by much faster than they actually are?", "start": 190.5, "duration": 5.36}, {"text": "Or do you notice that your vacations fly by? There are good reasons for this.", "start": 195.86, "duration": 4.82}, {"text": "When we're focused on something, we don't notice that time is passing and that makes them feel in the moment", "start": 200.68, "duration": 5.28}, {"text": "shorter than they actually are.", "start": 205.96, "duration": 2.16}, {"text": "At its best, this results in a mental state called \"flow\". This can happen when playing sports or video games", "start": 208.12, "duration": 7.7}, {"text": "or artists when they're fully engrossed in their work or people meditating.", "start": 215.82, "duration": 3.98}, {"text": "So I would argue another reason time speeds up as we age is because we are more often engrossed in", "start": 219.8, "duration": 5.54}, {"text": "what we're doing.", "start": 225.34, "duration": 0.72}, {"text": "Another thing that appears to make time speed up is repetition. I'm going to show you a series of images", "start": 226.06, "duration": 5.42}, {"text": "and I want you to consider how long each one appears on the screen.", "start": 231.48, "duration": 3.44}, {"text": "Are you ready?", "start": 235.24, "duration": 0.96}, {"text": "Go.", "start": 236.62, "duration": 0.5}, {"text": "So which one appeared to last the longest? If you're like most people, you'd probably say the dog.", "start": 240.54, "duration": 4.68}, {"text": "But all of those images actually appeared on screen fore the same length of time. The dog seemed longer", "start": 245.5, "duration": 4.8}, {"text": "because it was novel and therefore, your brain had to invest more energy in processing it.", "start": 250.3, "duration": 4.54}, {"text": "What's remarkable is that our sense of how long something is - or subjective duration-", "start": 254.84, "duration": 5.08}, {"text": "It correlates highly with how much energy we're using in our brains. Now, if you study how much energy people", "start": 259.92, "duration": 6.22}, {"text": "use in their brains over the course of their lifetime, you'll find that it peaks around age five.", "start": 266.14, "duration": 4.84}, {"text": "If you think about it, this kind of makes sense because when you're a kid, almost everything is novel to you.", "start": 270.98, "duration": 5.06}, {"text": "And therefore, your brain needs to use more energy, fully 66% of your resting energy intake.", "start": 276.04, "duration": 5.96}, {"text": "That's used by the brain because of all the novel experiences and that must, at least in part,", "start": 282.0, "duration": 5.38}, {"text": "explain why time appears to go more slowly.", "start": 287.38, "duration": 2.68}, {"text": "So, what can we do to slow time down? Well, studies have shown that being afraid increases our perception", "start": 290.06, "duration": 8.3}, {"text": "of time.", "start": 298.36, "duration": 0.72}, {"text": "When arachnophobes were forced to stare at spiders for 45 seconds - Yes, this is a real experiment -", "start": 299.36, "duration": 6.56}, {"text": "Those arachnophobes judged that experience as lasting much longer than 45 seconds,", "start": 305.92, "duration": 4.56}, {"text": "as you would kind of expect.", "start": 310.48, "duration": 1.84}, {"text": "Plus, experiments involving skydivers or people falling showed that they judged their experience to last", "start": 312.32, "duration": 5.88}, {"text": "much longer than it actually is.", "start": 318.2, "duration": 2.16}, {"text": "Another time when time appears to pass slowly is when you're bored.", "start": 320.36, "duration": 3.94}, {"text": "\"You know, when you're waiting and waiting, that's all you think about, so it seems like time drags forever.\"", "start": 324.3, "duration": 5.4}, {"text": "Since there is so little to focus on, you are acutely aware of just how much time is passing,", "start": 329.7, "duration": 5.3}, {"text": "and so these boring moments drag on and on.", "start": 335.0, "duration": 2.8}, {"text": "So, if you really want to slow down your experience of time, you could scare yourself, take up extreme sports,", "start": 337.8, "duration": 5.78}, {"text": "get into accidents and intersperse all of that with periods of boredom.", "start": 343.58, "duration": 3.92}, {"text": "But this viewpoint ignores one important fact, which is that we don't experience time as just one thing.", "start": 347.7, "duration": 6.96}, {"text": "We think about time as it passe, but also as it has passed before, when we remember it.", "start": 355.32, "duration": 5.6}, {"text": "And those two ways of looking at time, they don't align.", "start": 361.62, "duration": 3.68}, {"text": "So for example, holidays, they feel like they go by really fast, but when you think back upon them,", "start": 365.3, "duration": 5.38}, {"text": "they last a long time.", "start": 370.68, "duration": 1.82}, {"text": "That's because you had a lot of novel experiences and your brain formed a lot of memories.", "start": 372.88, "duration": 3.88}, {"text": "And it judges the duration of that vacation by the number of memories that were formed.", "start": 376.88, "duration": 5.46}, {"text": "All that novelty means lots of memories means it feels like it took a long time, but in the moment, it felt fast.", "start": 382.34, "duration": 6.52}, {"text": "This is the paradox, the great paradox, of our perception of time.", "start": 389.3, "duration": 4.4}, {"text": "If you want time to go slowly, there are a lot of things you can expose yourself to that will slow time down,", "start": 394.02, "duration": 6.12}, {"text": "but they won't necessarily be pleasant.", "start": 400.14, "duration": 2.04}, {"text": "So maybe the happiest life and the longest remembered life is one where time really seems to fly.", "start": 402.46, "duration": 7.38}, {"text": "It's like Einstein said, \"Put your hand on a stove for a minute and it'll feel like an hour.", "start": 410.5, "duration": 5.3}, {"text": "But sit next to a pretty girl for an hour and it'll feel like a minute.\"", "start": 415.8, "duration": 4.56}, {"text": "So, what would you like your life to feel like?", "start": 420.88, "duration": 3.04}, {"text": "I want to thank the National Geographic Channel for sponsoring this episode of Veritasium.", "start": 427.68, "duration": 4.28}, {"text": "And if you want to introduce more novelty into your life, than you should check out their series, \"Brain Games\"", "start": 431.96, "duration": 4.76}, {"text": "The new season begins February 14th at 9/8 Central. And this season, they have an episode about", "start": 436.72, "duration": 5.3}, {"text": "all of your senses, including your sense of time, chronoception.", "start": 442.02, "duration": 3.6}, {"text": "So if you want to find out more, than check out the link to their website in the description.", "start": 445.96, "duration": 4.02}, {"text": "And thank you for watching.", "start": 450.28, "duration": 1.84}, {"text": "Did that feel like that lasted long?", "start": 458.8, "duration": 1.24}]