[{"text": "This video is made possible by squarespace .Start building your website for free at squarespace.com/rll", "start": 0.6, "duration": 5.14}, {"text": "and then when you're ready to launch use the code rll to get 10 percent off at  checkout.", "start": 5.76, "duration": 5.22}, {"text": "Never before in all of human history has there existed as many people at one time as today.", "start": 10.98, "duration": 5.92}, {"text": "The most recent population estimates conducted in October 2018 have concluded that 7.7 billion of us exist across the planet", "start": 16.92, "duration": 9.42}, {"text": "60 percent of us are living in Asia.Another 16 percent of us are living in Africa.", "start": 26.34, "duration": 4.78}, {"text": "10 percent are living in Europe,while only 7.5 percent of us live in North America", "start": 31.12, "duration": 4.72}, {"text": "And 5.5 percent of us live in South America", "start": 35.84, "duration": 2.24}, {"text": "But when you go back in time to 1800 and see that the world population was only 1 billion people back then,it begs the question as to why so many more people exist today than existed in the past.", "start": 38.08, "duration": 12.6}, {"text": "How many more people can we expect to have in the future, and what kind of problems might that bring along", "start": 50.68, "duration": 6.34}, {"text": "To answer these questions,it's important to look back through history for some context.", "start": 57.18, "duration": 3.54}, {"text": "The last time the world population shrunk was the period between 1200 and 1400;largely due to the Mongol conquest in Asia and the Black Death in Europe", "start": 60.92, "duration": 8.74}, {"text": "Which killed of up to half of that continent's population", "start": 69.66, "duration": 3.26}, {"text": "In 1340,the world population stood at around 450 million people.", "start": 73.08, "duration": 5.04}, {"text": "But by 1400 it had dwindled down to just 350 million", "start": 78.36, "duration": 4.12}, {"text": "It took the entire world nearly 2 centuries to gain back its pre-1340 population.", "start": 82.48, "duration": 5.86}, {"text": "But from 1500 on,the population has been continously growing", "start": 88.34, "duration": 4.9}, {"text": "It was slow,at first.Humanity first reached half a billion people sometime in the 16th century.", "start": 93.24, "duration": 5.72}, {"text": "And didn't achieve a full billion until 1804", "start": 98.96, "duration": 3.2}, {"text": "It took us over 200,000 years of human history to reach 1 billion people being alive at the same time.", "start": 102.38, "duration": 7.72}, {"text": "But the next billion would happen much more rapidly.", "start": 110.1, "duration": 2.78}, {"text": "2,000,000,000 people was achieved only 123 years later,in 1927.", "start": 113.18, "duration": 5.24}, {"text": "And then,it took only 33 more years to hit 3,000,000,000", "start": 118.6, "duration": 3.54}, {"text": "And 14 years from there to hit 4 billion", "start": 122.14, "duration": 2.36}, {"text": "By 2024,the world population will likely hit 8 billion.", "start": 124.94, "duration": 3.76}, {"text": "So clearly,based on this graph, something during the 19 and 20th centuries that caused our population to explode", "start": 129.12, "duration": 6.96}, {"text": "But if you look carefully you can actually notice three major population jumps over the span of the past few thousand years.", "start": 136.08, "duration": 7.0}, {"text": "This most recent one just happens to be the largest", "start": 143.08, "duration": 1.9}, {"text": "Each of these jumps coincides with a major leap in technology.", "start": 144.98, "duration": 3.62}, {"text": "The first,was the toolmaking revolution.", "start": 148.6, "duration": 1.92}, {"text": "Which allowed  primitive humans to hunt more efficiently and give them greater  access to higher calorie foods,like animal meat.", "start": 150.52, "duration": 6.54}, {"text": "An increase in the amount of high calorie food led to a gradual population boom for the species.", "start": 157.06, "duration": 4.66}, {"text": "The second population jump happened during the time of the agricultural revolution,10 thousand years ago.", "start": 161.72, "duration": 4.88}, {"text": "When humans first began to transition away from hunting and gathering and towards farming", "start": 166.6, "duration": 4.94}, {"text": "This even further increased the amount of food available,and therefore allowed for the development of cities and civilizations,which of course meant more people.", "start": 172.36, "duration": 7.0}, {"text": "The final,and most significant leap though,was the industrial revolution.", "start": 179.36, "duration": 4.06}]