[{"text": "hhhhhHHHHHIIi everyone, my name's Majira.", "start": 0.909, "duration": 2.891}, {"text": "I just like - grabbed my chest in an interesting way", "start": 3.8, "duration": 3.3}, {"text": "Which is really ironic because of what this video is about", "start": 7.2, "duration": 3.6}, {"text": "Hi, so sorry to interrupt", "start": 10.96, "duration": 1.34}, {"text": "Also, I'm being really quiet cuz I'm literally sitting in my friend's closet at 3 in the morning", "start": 12.3, "duration": 4.89}, {"text": "And I don't want them to hear me talking about this. But anyway, this video is sponsored by Nomad Complex", "start": 17.19, "duration": 4.649}, {"text": "Nomad Complex is a furry owned and operated clothing brand from Vancouver Canada with some awesome t-shirts tanks bandannas and way more", "start": 21.839, "duration": 7.161}, {"text": "Right now they really need your help. They are running a Kickstarter featuring an underwear line made specifically for the furry fandom", "start": 29.0, "duration": 5.529}, {"text": "They have a bunch of cool designs, which you can see on the screen right now", "start": 34.53, "duration": 2.549}, {"text": "They're amazing for wearing under and over your fursuit because they're designs to be comfortable and breathable", "start": 37.079, "duration": 4.41}, {"text": "They're both light and moisture wicking so they stay completely dry even after hours of fursuit and hey -  they're heccin cyoot", "start": 41.489, "duration": 6.27}, {"text": "I love working with furry companies and supporting furry companies, and because of that I will be giving away a pair to two random commentors on this video", "start": 47.76, "duration": 5.62}, {"text": "So leave a comment down below for a chance to win and also tell your friends and let's get this thing going", "start": 53.56, "duration": 4.5}, {"text": "So yaay", "start": 58.38, "duration": 0.6}, {"text": "Thank you, Nomad Complex for sponsoring this video (a link to the Kickstarter is in the description down below)", "start": 58.98, "duration": 4.829}, {"text": "Ok back to the story and also I'm gonna stop being loud because my friend could probably hear me, it's awkward", "start": 63.879, "duration": 5.93}, {"text": "So I'm back with another story and let me tell you this is a crazy one and this story lasted over the span of like", "start": 69.82, "duration": 6.439}, {"text": "Two months and it's a story of how somebody broke my ribs while I was first shooting at a furry convention", "start": 76.259, "duration": 6.39}, {"text": "That's only like 20% clickbait. Also, it's just like a quick warning. I do talk about alcohol in the story very briefly", "start": 82.78, "duration": 6.229}, {"text": "And if that's something that bothers you, I'm sorry", "start": 89.009, "duration": 2.31}, {"text": "I have a lot of other videos you can go check one of those out", "start": 91.32, "duration": 2.459}, {"text": "So anyway, it all started at Texas very fiesta 2018 and it's the first kind of 2018", "start": 93.78, "duration": 5.37}, {"text": "so I'm really excited and also it was my first tff and a lot of my friends were going to be there and I was", "start": 99.15, "duration": 5.159}, {"text": "rooming with a lot of really cool people", "start": 104.31, "duration": 1.169}, {"text": "I was rooming with Jesse ray Kaiser fuse so I got to see FM on", "start": 105.479, "duration": 3.81}, {"text": "Wednesday and I didn't really pursue it or anything and on Thursday. I didn't pursue it until I'd say 9:10 p.m", "start": 109.36, "duration": 5.75}, {"text": "at night and Thursday before", "start": 115.24, "duration": 1.589}, {"text": "Pursuing me and a couple of my friends were in the room just having some drinks because it was the evening. I'm 21", "start": 116.829, "duration": 5.27}, {"text": "We wanted to get a little tipsy so I get tipsy kind of quickly made my friends decide", "start": 122.1, "duration": 3.839}, {"text": "It's time to get in first and go to the lobby and just walk around and at this point it's nighttime", "start": 125.939, "duration": 3.87}, {"text": "It's like 9:10 p.m. I get off the elevator and immediately a couple people recognize me come up to me", "start": 129.81, "duration": 4.74}, {"text": "Come say hi", "start": 134.55, "duration": 0.57}, {"text": "This first guy who comes up to me gives me a hug and he like hugs me in this perfect way around my back", "start": 135.12, "duration": 5.639}, {"text": "I'm like kind of weird. I like it when people crack my back", "start": 140.76, "duration": 3.09}, {"text": "So I guess my back was like stiff or something because he hugged me and my mind instantly just said hey", "start": 144.49, "duration": 5.239}, {"text": "Can you crack my back to this stranger?", "start": 149.73, "duration": 2.88}, {"text": "So I asked him to just squeeze", "start": 152.61, "duration": 1.41}, {"text": "you know my back around around this area and just squeeze so he does it in my back crack's I'm like", "start": 154.02, "duration": 5.519}, {"text": "Yes, good cuz I'm like a weirdo and I like when my I don't know why I'm even going into this. I'm sorry", "start": 159.54, "duration": 6.36}, {"text": "I'm oh you guys are learning how weird I am and I don't like that", "start": 165.9, "duration": 2.79}, {"text": "So I guess I'm like fully loosened up now", "start": 168.69, "duration": 2.009}, {"text": "Righty the first suit so now I'm ready to go party in the lobby", "start": 170.83, "duration": 2.539}, {"text": "And as I'm walking away, this guy comes up to me", "start": 173.37, "duration": 2.22}, {"text": "He was fairly buff and he tells me he's very excited to see me", "start": 175.59, "duration": 2.82}, {"text": "He likes my videos and he asked me for a hug", "start": 178.41, "duration": 1.68}, {"text": "I said I guess and he goes in for a hug", "start": 180.09, "duration": 1.53}, {"text": "So my assumption is he watched how the last people hugged me and thought that it would be okay to do the same thing", "start": 181.62, "duration": 5.13}, {"text": "However, this guy was taller and quite buff and he hugged me around to my chest not around my back and he squeezed me", "start": 186.78, "duration": 6.809}, {"text": "Quite hard and I just feel a", "start": 195.31, "duration": 2.059}, {"text": "Pop in my chest on my right side and it felt really weird so he lets go and I don't feel any pain", "start": 197.53, "duration": 5.54}, {"text": "So I think okay, it's fine. Maybe like my back cracked again or something. For some reason. I'm obsessed with my back cracking", "start": 203.07, "duration": 6.029}, {"text": "I'm sorry. I'm so weird. Just like feels good. Yeah. Oh", "start": 209.1, "duration": 3.629}, {"text": "That felt good. Let's to a library. I do not blame this guy at all. I have no ill will against this guy", "start": 213.549, "duration": 4.94}, {"text": "I know he had good intentions. He did not mean to hurt me", "start": 218.489, "duration": 2.7}, {"text": "I don't even think he knows that he hurt me and if you're watching this, please don't be upset", "start": 221.19, "duration": 3.449}, {"text": "It's fine and I didn't even know that he did hurt me because I wasn't feeling any pain at the moment what the night was", "start": 224.739, "duration": 5.779}, {"text": "So young it was so young s tonight goes on", "start": 230.519, "duration": 3.0}, {"text": "I started to become a little bit more sober and I start to notice that my lower chest on my right side", "start": 233.519, "duration": 5.64}, {"text": "Does it really feel very good and I didn't really think too much of it. I kind of just tweeted something like hey guys", "start": 239.16, "duration": 5.94}, {"text": "I entered myself. Please be gentle with me tomorrow and went to bed after that", "start": 245.63, "duration": 3.99}, {"text": "I woke up and when I sat up out of bed, oh my god, I felt the chest pain and it didn't feel good", "start": 249.62, "duration": 6.389}, {"text": "I start to explain to my hotel roommates what happened and one of them I think it was raised but the mind of abuse he", "start": 256.01, "duration": 5.91}, {"text": "Just says something along the lines of oh, yeah ribs can break really easily. I internally start to panic. I'm like, oh my god", "start": 261.92, "duration": 5.819}, {"text": "It's only Friday now ready had to go to the hospital. The con is already over me", "start": 267.74, "duration": 2.91}, {"text": "Like I just got here. I flew here from Ohio and I went all the way to Texas and I broke my rib", "start": 270.65, "duration": 4.44}, {"text": "But then Raines asked me if there's a bruise on my chest and I check", "start": 275.12, "duration": 3.15}, {"text": "No Bruce, so then I stop panicking I think okay. I'm probably fine. There's no bruise", "start": 279.06, "duration": 5.179}, {"text": "Maybe I just like brained my rib or something. I don't even know if that's possible", "start": 284.24, "duration": 3.36}, {"text": "But I was convincing myself of it my first suit around to my full suit", "start": 287.6, "duration": 3.239}, {"text": "but I only get gentle hugs and then when I woke up on Saturday it was", "start": 290.84, "duration": 3.6}, {"text": "Way worse Jesse and Reis. We're trying to get me to go to the dealer's room with them", "start": 295.11, "duration": 4.129}, {"text": "But I just could not sit up and get out of bed", "start": 299.24, "duration": 3.059}, {"text": "so I call up my friend Dixie and I'm like hey, do you have any painkillers like", "start": 302.3, "duration": 3.99}, {"text": "I'm in a lot of pain and she comes to my room and she brings me some ibuprofen", "start": 306.84, "duration": 4.04}, {"text": "Or something like that, and it makes the pain barely", "start": 311.01, "duration": 3.019}, {"text": "Bearable enough to sit up get out of bed and be a moderately functional for the rest of the day", "start": 314.58, "duration": 5.779}, {"text": "I did not wear my full suit for the rest of the convention", "start": 320.36, "duration": 2.97}, {"text": "I only wore my kick my head and my paws and I was giving everyone the", "start": 323.33, "duration": 4.38}, {"text": "gentlest of hugs and someone tried to lift me up at one point and I literally screamed at them because that is not what I", "start": 327.9, "duration": 5.63}, {"text": "Needed at that moment and it was just like every day. I was waking up in the pain felt worse", "start": 333.53, "duration": 4.529}, {"text": "I woke up Sunday. It was worse needed to take ibuprofen woke up Monday. It was worse needed to take more ibuprofen", "start": 338.06, "duration": 5.399}, {"text": "So Monday I flew home", "start": 343.5, "duration": 1.67}, {"text": "I got home in the evening went to bed on my back might I add because I could not sleep on my side because it", "start": 345.17, "duration": 5.85}, {"text": "was too painful", "start": 351.02, "duration": 0.43}, {"text": "Which was really annoying because I always sleep on my side", "start": 351.45, "duration": 3.289}, {"text": "But now since this I kind of become so used to sleeping on my back that I'd like to don't sleep on my side anymore", "start": 354.74, "duration": 5.28}, {"text": "But that's a whole other tangent. So I wake up on Tuesday at my house and I go to the emergency room", "start": 360.02, "duration": 4.889}, {"text": "So at the ER I had to awkwardly explain to the nurse how I hurt myself", "start": 364.91, "duration": 3.809}, {"text": "so the give me scans and x-rays and all that stuff and if you", "start": 368.99, "duration": 2.94}, {"text": "Hours of this they tell me that I have what is called a chest contusion", "start": 372.15, "duration": 3.029}, {"text": "I'm at risk of fluid building up in my lungs just thinking about this literally makes me so uncomfortable", "start": 375.18, "duration": 5.13}, {"text": "Like are you okay babies? Like are you okay ribs?", "start": 380.41, "duration": 3.619}, {"text": "They give me this like reasoning device that I have to breathe through ten times every hour that I'm awake for about a week", "start": 384.03, "duration": 5.369}, {"text": "They also put me on something called vault Aaron which I'm pretty sure it's just like a high dosed painkiller. Keep in mind", "start": 389.4, "duration": 6.179}, {"text": "I'm being prescribed a painkiller because I was hugged too hard", "start": 395.58, "duration": 3.33}, {"text": "I take the pills for about a week and a half and when I ran out the pain was still happening and I called my", "start": 398.91, "duration": 4.529}, {"text": "Doctor and I'm like, hey, I'm still in a lot of pain", "start": 403.44, "duration": 2.339}, {"text": "Can you like give me more and he asked me to come in for a visit so I go to the doctor?", "start": 405.78, "duration": 4.47}, {"text": "I tell him what's up, and he prescribes me with prednisone her read news zone", "start": 410.25, "duration": 4.829}, {"text": "If you don't know prednisone is a steroid that they usually give to people who have been in car accidents or have a severe allergic", "start": 415.08, "duration": 6.899}, {"text": "reactions and I'm being given prednisone because of a hug a", "start": 422.47, "duration": 4.609}, {"text": "Hug, so the reason he's putting me on prednisone is because my healing has plateaued which means like it's not healing anymore", "start": 429.1, "duration": 6.349}, {"text": "It's kind of just staying at its current state or whatever. My doctor goes on to explain side-effects which included things like severe anxiety", "start": 435.45, "duration": 6.9}, {"text": "excessive hunger", "start": 442.96, "duration": 1.29}, {"text": "Insomnia and also best of all possibly feeling things crawling around under my skin", "start": 444.25, "duration": 6.169}, {"text": "I started taking them and immediately I'm hungry non-stop", "start": 450.48, "duration": 3.059}, {"text": "I'm making food runs at 7:00 in the morning my sleep schedule got so bad that I was going to bed at 1:00 p.m", "start": 453.54, "duration": 5.699}, {"text": "And waking up at 9:00 p.m", "start": 459.52, "duration": 1.64}, {"text": "And I was so hungry all the freaking time that I gained five pounds on prednisone", "start": 461.16, "duration": 5.309}, {"text": "I had so much the boat light. It was kind of nice. So I stopped the meds about two and a half weeks ago", "start": 466.47, "duration": 4.859}, {"text": "I'm feeling a lot better. I don't have any pain in my chest anymore", "start": 471.33, "duration": 2.94}, {"text": "I'm able to do normal things and not eating 800 meals a day, but please if you take away anything from hearing this story", "start": 474.27, "duration": 6.929}, {"text": "Please don't hug me too hard. But anyway, that's about it for this story. I hope you guys liked it", "start": 481.2, "duration": 4.5}, {"text": "And once again, I have no ill will towards mr", "start": 485.7, "duration": 2.279}, {"text": "Bob dude, honestly, if anything like I want to take you out for a drink because you're giving me video content right now", "start": 487.98, "duration": 5.01}, {"text": "Thank you all so much for watching and I'll see you all in my next video", "start": 492.99, "duration": 4.529}, {"text": "Also as a reminder check out the Nomad complex Kickstarter, there are a lot of prizes you can get ok. See you guys next week", "start": 499.34, "duration": 5.149}]