[{"text": "This is a mousetrap car.", "start": 0.0, "duration": 2.36}, {"text": "They're common for competitions in high school physics classes", "start": 6.24, "duration": 2.88}, {"text": "Just like the egg drop challenge or building toothpick bridges. The goal is to build a car that travels the furthest or goes the", "start": 9.12, "duration": 6.09}, {"text": "Fastest, but in either case the only power provided to move the car is from a single", "start": 15.28, "duration": 5.16}, {"text": "mousetrap. So today", "start": 20.86, "duration": 1.46}, {"text": "I'm going to show you how to win first place by building some cars with the", "start": 22.32, "duration": 3.03}, {"text": "World-record holder. Then we're gonna go to the West Coast Championships to see all these principles in action, and wait don't leave! I know that", "start": 25.44, "duration": 6.96}, {"text": "99.7% of you have never, nor will ever make one of these,", "start": 32.4, "duration": 3.92}, {"text": "but I will break down in simple terms", "start": 36.329, "duration": 1.591}, {"text": "how I know this car will go twice as far as this one,", "start": 37.92, "duration": 2.49}, {"text": "and then I'll prove it. And then we'll discuss why you see these", "start": 40.41, "duration": 2.459}, {"text": "DVD wheels so often, but do they work? And why do some winning cars have wheels that look like this?", "start": 42.94, "duration": 4.939}, {"text": "But before we fly all the way out the Texas to meet the world record holder,", "start": 47.879, "duration": 2.909}, {"text": "I need to lay the foundation for the one overarching", "start": 50.789, "duration": 2.43}, {"text": "fundamental physics principle behind the mousetrap car.", "start": 53.46, "duration": 2.76}, {"text": "It's called mechanical advantage and to do that", "start": 56.28, "duration": 2.52}, {"text": "I'm gonna need my niece and nephews. \"Imma bet you guys I could lift my car off the ground", "start": 58.8, "duration": 4.82}, {"text": "using just my pinkies. If I can't do it, you can have this crisp Benjamin", "start": 63.62, "duration": 4.26}, {"text": "but if I can, you guys have to buy me ice cream. Deal?\"", "start": 68.26, "duration": 4.62}, {"text": "\"I said nothing else but your Pinky!\"", "start": 76.18, "duration": 1.8}, {"text": "\"I am using just my pinkies. \"No just your pinkies.\" \"That's what I'm doing!\"", "start": 78.02, "duration": 4.78}, {"text": "\"This is really good you guys. Thank you.\"", "start": 85.06, "duration": 2.94}, {"text": "If you're willing to move a greater distance.", "start": 88.44, "duration": 1.76}, {"text": "You're able to reduce the amount of force and by a proportional amount.", "start": 90.2, "duration": 3.239}, {"text": "I can't lift 500 pounds worth of car one time.", "start": 93.44, "duration": 3.06}, {"text": "But I could lift 10 pounds 50 times. A mechanical advantage is the ratio of the output force over the input force.", "start": 96.5, "duration": 6.5}, {"text": "So in this case it's 50. That means my hand had to travel 50 times further than just lifting the car in one shot.", "start": 103.0, "duration": 6.54}, {"text": "But the weight was 50 times less, so it was totally worth it. This principle of mechanical advantage is everywhere.", "start": 109.54, "duration": 6.06}, {"text": "Let's take a look at a few examples.", "start": 115.61, "duration": 1.45}, {"text": "If I have 4 pulleys that means I have to pull the rope down 4 times further than the dumbbell goes up.", "start": 117.06, "duration": 4.97}, {"text": "But in exchange, it feels four times lighter, so this has a mechanical advantage of 4. For the ramp", "start": 122.03, "duration": 5.09}, {"text": "you look at the ratio of the length to the height. Your mechanical advantage therefore is 2.2. And that means", "start": 127.12, "duration": 4.56}, {"text": "I have to travel a little further,", "start": 131.689, "duration": 1.171}, {"text": "But the brick should feel 2.2 times lighter", "start": 132.86, "duration": 2.72}, {"text": "pulling up the ramp versus just pulling the brick straight up. And sure enough if you measure each with a scale", "start": 135.58, "duration": 4.78}, {"text": "This is exactly what you see. If you think about it a screw is just a ramp", "start": 140.36, "duration": 4.06}, {"text": "wrapped around a nail. So here", "start": 144.42, "duration": 1.61}, {"text": "you look at this has traveled around the thread and divided by the space in between the threads to get a mechanical advantage of 9", "start": 146.03, "duration": 5.279}, {"text": "And as you know if you really want to multiply your force use a ratchet wrench", "start": 151.309, "duration": 3.511}, {"text": "Now that is since your hand travels for one full rotation is 300 times longer", "start": 154.82, "duration": 3.88}, {"text": "than the distance the screw moves vertically between one thread the total mechanical advantage is 300", "start": 158.7, "duration": 4.48}, {"text": "It's like a really long short ramp", "start": 163.19, "duration": 1.95}, {"text": "So if this scale reads 6 pounds the actual clamping force would be", "start": 165.14, "duration": 3.48}, {"text": "300 times more or nearly a ton", "start": 168.62, "duration": 2.24}, {"text": "And with wheels and axles it's the same story since this wheel diameter is twice what this one is as you could probably guess by", "start": 170.94, "duration": 6.35}, {"text": "now this weight weighs twice as much so now we're balanced with a mechanical advantage of 2", "start": 177.29, "duration": 5.339}, {"text": "And you'll also notice if I move this, the lesser weight travels twice as far and finally we have levers", "start": 182.63, "duration": 6.479}, {"text": "Which is where we started with my niece and nephews, here if you compare the ratio of the distances from the pivot point we have", "start": 189.11, "duration": 5.19}, {"text": "A mechanical advantage of 4 which of course means I have to move this end four times further", "start": 194.3, "duration": 5.14}, {"text": "But it's super easy because it's 1/4 the weight on this side, and in all of these examples", "start": 199.44, "duration": 4.379}, {"text": "Which you see everywhere around us you trade lower force for more distance travelled", "start": 203.819, "duration": 5.029}, {"text": "This is how humans built amazing things before all these fancy machines with engines came around", "start": 208.848, "duration": 5.292}, {"text": "Human muscles are totally strong enough as long as you're willing to spend a little more distance to do the task, and so this principle", "start": 214.14, "duration": 6.66}, {"text": "Mechanical advantage is at play over and over again with the mousetrap cars only in reverse. It works both ways in other words", "start": 220.8, "duration": 6.28}, {"text": "I don't want the full force of the spring acting over this tiny distance to act directly on the wheels or they would spin out", "start": 227.08, "duration": 6.52}, {"text": "That would be a very inefficient", "start": 234.02, "duration": 1.44}, {"text": "Transfer of energy from the spring, so we use", "start": 235.47, "duration": 2.17}, {"text": "mechanical advantage and make the main lever arm 15 times longer than the spring lever arm, and then the wheel diameter is", "start": 237.74, "duration": 5.98}, {"text": "24 times bigger than the wheel axle so then if we multiply them our total mechanical advantage is 1 over", "start": 243.72, "duration": 5.26}, {"text": "360. That means the force is 360 times less right here on the output at the wheels to the floor", "start": 249.0, "duration": 6.3}, {"text": "Versus right here on the input on the spring. It also means it will travel", "start": 255.42, "duration": 3.54}, {"text": "360 times further than the distance this spring arm rotates", "start": 259.0, "duration": 3.96}, {"text": "alright, so that's enough of a foundation for now let's go to Texas and meet up with my buddy Al, to build some racecars", "start": 262.96, "duration": 4.9}, {"text": "Not only is he the mousetrap car world record holder,", "start": 276.52, "duration": 2.22}, {"text": "but he also kind of started the whole thing, and", "start": 278.74, "duration": 2.52}, {"text": "he was Texas high school physics teacher of the year, and since my dream job is to one day switch from working as an engineer", "start": 281.26, "duration": 4.86}, {"text": "In the private sector, to go teach high school physics somewhere. I made him show me all his cool demos.", "start": 286.12, "duration": 4.14}, {"text": "I came up with this idea back in", "start": 292.36, "duration": 1.94}, {"text": "1991 and since that time I have literally built", "start": 294.3, "duration": 4.66}, {"text": "thousands and thousands of mousetrap cars myself", "start": 298.98, "duration": 2.58}, {"text": "I've seen every possible engineering design you could ever come up with", "start": 301.56, "duration": 3.74}, {"text": "There's lots of different variations for rules for a mousetrap car race. Let's talk about how to build the best", "start": 305.3, "duration": 4.18}, {"text": "Long-distance car first for our testing we started with three identical cars the only difference was the length of the lever arm", "start": 309.58, "duration": 6.1}, {"text": "So one was short one was medium, and one was long, and I've calculated each of their mechanical advantages", "start": 315.699, "duration": 5.52}, {"text": "Which you can see written here and given what we know about mechanical advantage. What do you think is about to happen?", "start": 321.22, "duration": 5.46}, {"text": "As you might have guessed the short lever arm car takes a strong early lead this makes sense because it has the largest", "start": 328.42, "duration": 5.9}, {"text": "mechanical advantage therefore the highest force", "start": 334.43, "duration": 2.0}, {"text": "Where the wheels and ground meet the downside is that it's a short-lived burst and the medium and long lever arm cars pass it once?", "start": 336.5, "duration": 6.679}, {"text": "It's quickly used up all its energy", "start": 343.18, "duration": 2.0}, {"text": "In the end this is how far they each", "start": 346.86, "duration": 1.9}, {"text": "traveled with the longest lever arm car going the", "start": 348.889, "duration": 2.3}, {"text": "slowest", "start": 351.259, "duration": 0.541}, {"text": "but making it all the way to 30 feet this brings up the first principle for the long distance car to win you want the", "start": 351.8, "duration": 5.86}, {"text": "smallest possible force over the longest possible", "start": 357.72, "duration": 3.08}, {"text": "Distance in other words the smallest fraction for mechanical advantage possible. You want your car to be barely creeping forward", "start": 360.8, "duration": 6.88}, {"text": "To waste as little energy as possible", "start": 367.68, "duration": 2.08}, {"text": "You could think of the total energy of the spring as this amount of water in this cup and then this cup represents", "start": 369.76, "duration": 5.44}, {"text": "the amount of energy that's passed on to your car to move it forward if you just quickly dump it all the energy", "start": 375.32, "duration": 5.269}, {"text": "a ton spills and splashes out this will be due to losses from extra heat generated or even drag force from the wind which is proportional", "start": 381.289, "duration": 6.8}, {"text": "To your velocity squared, but if you do it slowly and more controlled much more energy", "start": 388.089, "duration": 5.611}, {"text": "Goes to actually moving your car forward the next thing we tested was adding", "start": 395.76, "duration": 3.88}, {"text": "Graphite to the axles on all three of the cars, and then we raced them", "start": 399.72, "duration": 4.02}, {"text": "This made a huge difference and now they went this far", "start": 405.2, "duration": 2.96}, {"text": "Again the longest lever arm car one because it was the slowest but this shows the importance of dealing with friction", "start": 408.16, "duration": 5.44}, {"text": "It's definitely your biggest enemy with these cars and the friction comes from two spots", "start": 413.7, "duration": 4.279}, {"text": "You have the rolling friction between the wheels and the ground and then the biggie is", "start": 417.98, "duration": 3.899}, {"text": "between their axles and the car body", "start": 421.95, "duration": 2.0}, {"text": "This is why we put the lubricating graphite powder there and to take our testing a step further", "start": 423.96, "duration": 3.8}, {"text": "we took the long lever arm car and", "start": 427.76, "duration": 1.78}, {"text": "Added ball bearings in place of the graphite and that set a new record for us at 50 feet so if you only have one", "start": 429.54, "duration": 5.66}, {"text": "hour to make your car", "start": 435.2, "duration": 0.75}, {"text": "And you want to have a good showing you can use a long lever arm like this in conjunction with the CD wheels", "start": 435.95, "duration": 4.919}, {"text": "To give you a mechanical advantage of about one over", "start": 441.0, "duration": 2.869}, {"text": "360 and then use ball bearings at the axles or just apply some graphite and you're gonna do pretty well", "start": 444.27, "duration": 5.149}, {"text": "Next we figured if long lever arms make it travel slower and therefore further. We should do a super long lever arm", "start": 449.85, "duration": 7.73}, {"text": "But it only made it to here which was worse than even the short lever arm car the problem was that it didn't Coast very", "start": 459.84, "duration": 6.92}, {"text": "Well because we had to make it really big, which means it's more. Heavy, which means more friction", "start": 466.76, "duration": 4.44}, {"text": "You know this already intuitively because it's harder to push a heavy object on a table than a light object because there's more friction", "start": 471.2, "duration": 7.06}, {"text": "Resisting you so principle three is to make it lightweight", "start": 478.28, "duration": 2.72}, {"text": "I love this example though because it shows you that you need to balance these principles if you take any one of them too far", "start": 481.0, "duration": 5.4}, {"text": "Then another principle will creep in and start penalizing you. It's an optimization problem", "start": 486.4, "duration": 4.2}, {"text": "And that's what makes the mousetrap racers such a great project", "start": 490.62, "duration": 3.17}, {"text": "That's also why testing is so important so tweaking and testing different things like Allen", "start": 493.79, "duration": 4.25}, {"text": "and I did is", "start": 498.04, "duration": 0.88}, {"text": "critical for honing in on the sweet spot for your specific design next we tried this big wheel design which is a popular approach the", "start": 498.92, "duration": 7.38}, {"text": "Strategy here is the wheel is", "start": 506.3, "duration": 1.42}, {"text": "56 times larger than the wheel axle so when you combine it with the lever arm you get a built in mechanical advantage of one", "start": 507.72, "duration": 6.86}, {"text": "Over 840 and that's the equivalent of a lever arm", "start": 514.58, "duration": 2.959}, {"text": "That's two and a half feet long", "start": 517.539, "duration": 1.6}, {"text": "But without needing the big heavy car. That seems like a good deal and as such it was our best car yet", "start": 519.14, "duration": 5.6}, {"text": "And made it all the way to here. The downside is that it takes energy to get a big wheel like that", "start": 524.88, "duration": 4.66}, {"text": "rotating it's called rotational inertia", "start": 529.61, "duration": 1.56}, {"text": "Here's a demo I built to showcase his principle. These two wheels are", "start": 531.17, "duration": 3.199}, {"text": "identical except this one has the steel weights placed at the outer edge of the wheel", "start": 534.46, "duration": 3.48}, {"text": "Versus near the axle this means it has a higher", "start": 537.94, "duration": 2.66}, {"text": "Rotational inertia so when we spin them both identically the one on the right starts spinning faster", "start": 540.68, "duration": 4.73}, {"text": "And will reach a higher max speed, but the one on the Left will Coast for longer by having bigger", "start": 545.41, "duration": 5.039}, {"text": "Heavy wheels you're basically using them as a temporary storage for your energy", "start": 550.449, "duration": 3.869}, {"text": "And then you give it back during the coasting phase the problem with this is anytime you transfer energy", "start": 554.319, "duration": 5.34}, {"text": "You lose some going back to the cups a little splashes out each time you pour it no matter", "start": 559.66, "duration": 5.07}, {"text": "How slowly you do it?", "start": 564.73, "duration": 1.18}, {"text": "So instead of pouring your spring energy into a big cup and then eventually getting it back in the coasting phase. It's better", "start": 565.91, "duration": 6.349}, {"text": "Just to have reasonable size wheels and just have one slow pour directly near the final cup of making your car move", "start": 572.259, "duration": 5.309}, {"text": "Additionally big wheels like this can be hard to steer so principle four is to reduce rotational inertia", "start": 578.089, "duration": 5.479}, {"text": "This is also why you see people do this to their wheels sometimes", "start": 583.639, "duration": 2.809}, {"text": "It's an effort to keep the wheels large in diameter to get that built-in mechanical advantage", "start": 586.579, "duration": 4.19}, {"text": "But to make them wait less to reduce the energy given to rotational inertia", "start": 590.769, "duration": 3.351}, {"text": "so the final test we ran was Al's world record car which travelled an", "start": 594.12, "duration": 3.62}, {"text": "Astounding 600 feet when he set the record he did some crazy things like using jeweler's bearings on the axles", "start": 597.74, "duration": 5.74}, {"text": "But the real secret is this pulley here in the middle if we look at the ratios and calculate the mechanical advantage from the lever", "start": 603.49, "duration": 6.0}, {"text": "To the pulley to the wheels we're looking at one over four thousand six hundred and eight it's the equivalent of a 16-foot", "start": 609.49, "duration": 6.55}, {"text": "Lever arm or back wheel four and a half feet in diameter", "start": 616.04, "duration": 3.18}, {"text": "But without the downside of the extra weight or wasted rotational inertia", "start": 619.22, "duration": 3.56}, {"text": "This thing barely crawls along it's hard to even see the spring lever arm moving as this back spins", "start": 622.78, "duration": 5.54}, {"text": "It's really hard to beat a design like this", "start": 628.32, "duration": 2.42}, {"text": "And now we'll quickly go through the speed car principle since most of the same principles apply the biggest difference is this time we want", "start": 630.74, "duration": 6.12}, {"text": "To access all the energy from the spring in a short burst right at the beginning", "start": 636.86, "duration": 3.92}, {"text": "Because the finish line is only 15 feet away", "start": 640.78, "duration": 1.96}, {"text": "So it doesn't make sense to have a really small mechanical advantage like the pulley car", "start": 642.78, "duration": 4.28}, {"text": "Here we want it much closer to the direct force of the spring itself", "start": 647.06, "duration": 3.3}, {"text": "Which would be mechanical advantage of one, the problem is if we did that the wheels would slip so you basically want to incrementally", "start": 650.36, "duration": 6.3}, {"text": "Increase your mechanical advantage by making your rear", "start": 656.66, "duration": 2.66}, {"text": "axle thicker and thicker with tape until your rear wheels start to slip slipping is bad of course because that's waste of energy because your", "start": 659.38, "duration": 6.65}, {"text": "Wheel is spinning without actually moving your car forward", "start": 666.03, "duration": 2.279}, {"text": "It's helpful to zoom in and use the slow-mo on your phone to see if your wheels are slipping or not this means having good", "start": 668.31, "duration": 4.92}, {"text": "Traction on your rear wheels is important because means you can have higher forces", "start": 673.23, "duration": 4.2}, {"text": "Before you start to slip these squishy foam wheels work great", "start": 677.56, "duration": 3.11}, {"text": "And just like with the distance car", "start": 680.67, "duration": 1.54}, {"text": "Reducing friction by using bearings or graphite will definitely help as well making it lightweight because Newton's second law teaches us that heavier things are", "start": 682.21, "duration": 7.369}, {"text": "Harder to accelerate just like you throw a baseball further", "start": 689.58, "duration": 2.66}, {"text": "than a heavy bowling ball and", "start": 692.24, "duration": 1.52}, {"text": "Smaller diameter wheels not only help by keeping your mechanical advantage closer to one but you don't have time to give energy to these big", "start": 693.76, "duration": 6.83}, {"text": "Wheels and then get it back through coasting you want all that spring energy to go directly into making your car go forward", "start": 700.59, "duration": 6.69}, {"text": "Okay, so those are the basic principles before we head to the west coast mousetrap car championships, I'll just mention", "start": 707.29, "duration": 6.14}, {"text": "I put a list of 10 practical quick build tips in the video description for example", "start": 713.43, "duration": 4.17}, {"text": "You should soak your bearings in", "start": 717.6, "duration": 1.92}, {"text": "WD-40 to remove all the grease. The grease is useful if the bearings are actually seeing a lot of load", "start": 719.53, "duration": 4.729}, {"text": "But since these cars weigh next to nothing", "start": 724.26, "duration": 2.0}, {"text": "It's only gonna slow you down", "start": 726.49, "duration": 1.64}, {"text": "I should also mentioned that my buddy Al has an amazing website called www.docfizzix.com or you can buy all the parts", "start": 728.13, "duration": 5.22}, {"text": "I show today to experiment and come up with your own unique design. I also put that link below here we go", "start": 733.35, "duration": 5.89}, {"text": "For this competition the objective was to travel forward 15 feet", "start": 749.62, "duration": 3.2}, {"text": "And then returned back and stopped as close to the exact same spot you started in the least amount of time those moves may seem", "start": 752.82, "duration": 6.06}, {"text": "Complicated but you can switch from forward to reverse", "start": 758.94, "duration": 2.28}, {"text": "by simply switching the direction you wrap up your axle halfway through and you can stop at a certain point by using a wing nut", "start": 761.27, "duration": 6.079}, {"text": "On a threaded axle so given the rules your design choices should foster both speed and precision about half the designs relied on", "start": 767.349, "duration": 7.191}, {"text": "Preconceived notions and use CD wheels which are a real bad choice here because you're not looking for distance", "start": 774.54, "duration": 5.02}, {"text": "They have more rotational inertia and poor traction", "start": 779.56, "duration": 2.549}, {"text": "The winning team car which I won't show here because the finals are next month really focused on precision", "start": 782.32, "duration": 4.44}, {"text": "They use ball bearings small foam wheels and they made their car body out of", "start": 786.76, "duration": 3.9}, {"text": "Aluminum it weighs more than balsa wood, so it did cost more energy to friction", "start": 790.76, "duration": 2.989}, {"text": "But there's plenty of energy in the spring for only traveling thirty feet", "start": 793.75, "duration": 3.39}, {"text": "So it was worth the trade-off for the extra rigidity and repeatability they also told me they tested and tweaked their design for six months", "start": 797.14, "duration": 6.149}, {"text": "It's just awesome to hang out and see all the various design approaches", "start": 805.58, "duration": 3.5}, {"text": "Hopefully you learn enough by now to give you a solid foundation for your own unique design", "start": 809.24, "duration": 4.04}, {"text": "So you can build, test, tweak like crazy, and then dominate the competition", "start": 813.53, "duration": 5.209}, {"text": "I spend way too much time making these dumb videos", "start": 822.65, "duration": 2.959}, {"text": "But I can't help it since I sort of get obsessed because I'm passionate about the content", "start": 825.609, "duration": 3.771}, {"text": "Skillshare.com not only help make this video possible", "start": 829.38, "duration": 2.02}, {"text": "But their site is full of people just like me except on any topic imaginable", "start": 831.4, "duration": 4.5}, {"text": "Take graphic designer, Aaron Draplin from Portland, Oregon, for example", "start": 835.9, "duration": 3.08}, {"text": "This guy is a savant who became famous for his amazing logo work and design philosophy", "start": 838.99, "duration": 4.02}, {"text": "He's a great teacher, and he's hilarious", "start": 843.01, "duration": 1.6}, {"text": "I learned a ton from going through his course. SkillShare is less than $10 a month for their premium membership", "start": 844.61, "duration": 4.82}, {"text": "And that gives you full access to all of their classes and the first thousand people to click the link in the video description", "start": 849.43, "duration": 4.289}, {"text": "Get two months to try it out for $0.99 so if you appreciate the work", "start": 853.79, "duration": 3.62}, {"text": "I put into these videos and you want to learn more from people who are passionate about what they do", "start": 857.41, "duration": 4.039}, {"text": "Click the link below to get started. Thanks for watching.", "start": 861.639, "duration": 2.48}]