[{"text": "It's Saturday morning, so we're hanging out I'm excited for this Wednesday's cartoon, but for right now. We got this guy here Whooooo!", "start": 0.06, "duration": 6.72}, {"text": "This if you don't know is Brian Hull", "start": 7.33, "duration": 2.12}, {"text": "I'm an impressionist on YouTube you probably seen my videos of the guy", "start": 16.18, "duration": 3.17}, {"text": "Who's saying let it go with all the Disney characters and winne the pooh you almost got it almost", "start": 19.35, "duration": 4.379}, {"text": "But I'm surprised I don't have any honey here (Oh My God) my agent said that'll be honey. Where is it? Alright I'm getting you honey.", "start": 26.92, "duration": 5.6}, {"text": "I got honey you guys", "start": 34.12, "duration": 2.0}, {"text": "Oh wow the because project it goes to a good cause, that's for you", "start": 36.28, "duration": 2.81}, {"text": "Whoo!", "start": 39.85, "duration": 1.29}, {"text": "Honey!", "start": 41.14, "duration": 1.439}, {"text": "The episode's over, I gave you the honey like what else do I do?", "start": 42.579, "duration": 2.0}, {"text": "So the challenge we are doing today is the whose voice is it anyway challenge animation edition (yeah!) in this bowl here", "start": 46.3, "duration": 6.2}, {"text": "we have a bunch of different characters from movies and", "start": 52.5, "duration": 2.909}, {"text": "TV shows all animated we got our friend off-camera who's gonna play these in the first one of us to guess the voice", "start": 55.989, "duration": 7.369}, {"text": "Wins a point all right just so you guys know I have no idea. What's on these papers", "start": 63.67, "duration": 4.849}, {"text": "Uh.. Brian doesn't know it's on these papers all right play the clip", "start": 69.52, "duration": 3.26}, {"text": "Miss Frizzle", "start": 77.02, "duration": 2.0}, {"text": "Lisa Simpson noooooooooooooooo! You got it! Ohhhhh!", "start": 79.21, "duration": 2.0}, {"text": "That's one point for Brian Hull you're gonna win this alright you ready for the next one?", "start": 82.84, "duration": 4.73}, {"text": "I'm ready for the next night one. We're ready play clip number two... Oh", "start": 87.57, "duration": 2.819}, {"text": "Oh! Donald Duck! Donald oh Definitely Donald Donald Donald Duck! I've got one. That's all I need I stopped for a second because it didn't sound like", "start": 93.009, "duration": 7.04}, {"text": "Just let me enjoy this moment. Can you do Donald Duck?", "start": 100.93, "duration": 2.779}, {"text": "I love this let's do number three alright, a laser gun!", "start": 110.649, "duration": 4.37}, {"text": "Sounds like Disney Channel Fisher", "start": 118.85, "duration": 2.0}, {"text": "Is it like rocket power", "start": 123.92, "duration": 2.0}, {"text": "Yoga balls, that's gotta be Kermit I know this voice. I know this voice", "start": 130.429, "duration": 3.17}, {"text": "Is it Arthur is it uhhhhh no I know this one is it loud house? Is it cory in the house", "start": 134.39, "duration": 5.75}, {"text": "Is it miss Frizzle?", "start": 141.26, "duration": 2.0}, {"text": "Is it a kid it's Definitel-Oh! It's Fin", "start": 143.39, "duration": 2.66}, {"text": "from Adventure Time!", "start": 147.38, "duration": 1.29}, {"text": "All right, let's do number four and number four so it's uh two to one two one, two one", "start": 148.67, "duration": 1.71}, {"text": "I still have a chance I'm doing way better than I thought I would", "start": 150.38, "duration": 5.689}, {"text": "Oh oh oh oh oh oh!", "start": 156.55, "duration": 3.479}, {"text": "It's Carmen, its Carmen. Oh! I love that show", "start": 162.38, "duration": 1.109}, {"text": "It's Carmen, its Carmen. Oh, I love that show", "start": 163.489, "duration": 3.8}, {"text": "Oh Dora, Dora the Explorer", "start": 167.87, "duration": 2.66}, {"text": "I'm kind of embarrassed how quickly I got that.. ha ha ha ha", "start": 173.78, "duration": 2.0}, {"text": "Yeah uh, we got time for one more. Alright. Let's do another one let's do another one, last one. This is either gonna", "start": 179.33, "duration": 2.539}, {"text": "Give you the the crushing victory that I imagined or we'll have to go to sudden death, sudden death", "start": 182.66, "duration": 5.149}, {"text": "Here comes, okay...", "start": 189.17, "duration": 6.379}, {"text": "Now that's Ms. Frizzle!", "start": 196.04, "duration": 2.0}, {"text": "Ended up being the last one", "start": 199.489, "duration": 2.0}, {"text": "Talk about fair justice, give me that honey!", "start": 209.51, "duration": 2.0}, {"text": "Can't believe this I'm really impressed, well you won the challenge Brian, yaaaaaaaaaaaaaaaaaaaaay woooooooooooooooooooh", "start": 216.019, "duration": 4.64}, {"text": "Can't believe this I'm really impressed well you won the challenge Bryan yeah", "start": 222.89, "duration": 4.339}, {"text": "As much candy from here as you want  you alright before you go", "start": 228.62, "duration": 2.089}, {"text": "I have a bunch of questions just answer them as fast as you can rapid-fire don't think about it favorite videogame uh...", "start": 232.01, "duration": 3.839}, {"text": "(what?) favorite movie", "start": 236.4, "duration": 6.44}, {"text": "Lion KIng, ooh I like that one", "start": 244.26, "duration": 2.0}, {"text": "When you're little what did you want to be when you grew up? A paleontologist I know it's weird, I was a weird kid", "start": 247.379, "duration": 2.0}, {"text": "My iPhone or Android? iPhone juggling or magic? juggling", "start": 250.53, "duration": 7.339}, {"text": "Special talent that you have that no one knows about I'm double-jointed", "start": 260.4, "duration": 4.279}, {"text": "I can bend my fingers all the way to the back of my hand d-do it well do it okay...", "start": 265.59, "duration": 3.799}, {"text": "Ok I'm gonna warn everybody now. It's kind of gross and some people find it weird, but like oh", "start": 271.02, "duration": 3.86}, {"text": "And yeah, can you do that with all of them?", "start": 274.88, "duration": 3.059}, {"text": "I've never even showed my fans this really yeah, they've never seen that Alex Clark exclusive", "start": 281.699, "duration": 2.089}, {"text": "I've never really showed my fans this really yeah, they've never seen that Alex Clinic exclusive", "start": 287.28, "duration": 4.73}, {"text": "Yeah, I feel like you could make an ASMR video just of that sound", "start": 292.01, "duration": 3.239}, {"text": "All right, Brian's awesome. Isn't he I have a few more questions with him, but first", "start": 296.099, "duration": 4.1}, {"text": "today's awesome incredible finds our compliments of our friends at squarespace.com/alex", "start": 300.199, "duration": 5.04}, {"text": "today's awesome incredible finds our compliments of our friends at squarespace.com", "start": 305.27, "duration": 3.57}, {"text": "Slash Alex Squarespace as you know is one of the easiest and fastest ways to build your own website online", "start": 310.169, "duration": 5.0}, {"text": "We just launched our brand new website with blogs a spot for your fan art and all sorts of other stuff to connect with you", "start": 315.389, "duration": 5.27}, {"text": "It was real, for a simpleton like me it worked, so to support more", "start": 320.66, "duration": 3.0}, {"text": "Animations the channel or just to build your own website like many Clark has already have definitely check out squarespace.com/alex", "start": 323.66, "duration": 5.639}, {"text": "Today's first awesome animation is for spider-man into the spider verse", "start": 329.3, "duration": 3.48}, {"text": "I checked it out and oooh we get a brand new spider-man! I'm excited to have a Spidey", "start": 332.88, "duration": 5.029}, {"text": "Slash Alex today's first awesome animation is for spider-man into the spider virus", "start": 338.46, "duration": 4.07}, {"text": "I checked it out at all we get a brand new spider-man. I'm excited to have a Spidey", "start": 342.53, "duration": 4.949}, {"text": "That's not Peter Parker think it's gonna be good and just the fact alone that they want full-on", "start": 347.479, "duration": 4.89}, {"text": "And they're so creative so different so unique definitely check them out", "start": 352.47, "duration": 5.359}, {"text": "I don't know if you're watching the Nickelodeon shorts, but they put them all up on their Facebook page", "start": 357.83, "duration": 4.44}, {"text": "And they're so creative so 4.in so unique definitely check them out", "start": 362.27, "duration": 3.89}, {"text": "They got tons on there also congrats the sugar she voices the baby sister", "start": 366.16, "duration": 3.75}, {"text": "She just hit 900k released a video with a QA can't wait to watch that myself and the last awesome animation", "start": 369.91, "duration": 6.119}, {"text": "That's all the awesome stuff. I got for ya this week. If you got something definitely", "start": 376.03, "duration": 1.66}, {"text": "Let me know down in the comments and for right now. Let's get back to Brian most famous person you've ever met?", "start": 377.69, "duration": 6.259}, {"text": "Um probably Neil Patrick Harris. Now I've heard. He's like the nicest", "start": 383.949, "duration": 3.24}, {"text": "Let me know down in the comments and for right now. Let's get back to Brian most famous person you've ever met", "start": 387.19, "duration": 5.459}, {"text": "He was super nice since last question as brief as you can summarize how we met. We met at playlist live", "start": 393.5, "duration": 3.889}, {"text": "Famous person out there it was your impression of that the same", "start": 398.0, "duration": 2.929}, {"text": "We were just kind of.. somebody told you about me wasn't it like somebody had been said like oh you do cartoons", "start": 400.93, "duration": 7.019}, {"text": "Last year over in Orlando mmm-hmm", "start": 408.47, "duration": 2.209}, {"text": "He does like all these cartoon impressions and does voices so you came up to me and said hey somebody said I need to talk", "start": 411.169, "duration": 6.98}, {"text": "You need to go talk to this guy", "start": 418.15, "duration": 0.81}, {"text": "He does like all these cartoon impressions and those voices so you came up to me and said hey somebody said I need to talk", "start": 418.96, "duration": 5.22}, {"text": "So that's how we met, everyone's like industry collab and then he did the Winne the Pooh voice and I freaked out like", "start": 424.18, "duration": 1.889}, {"text": "Oh really", "start": 426.069, "duration": 0.6}, {"text": "So uh that was all we have for you guys today. Thanks for hanging out. Thank you Brian, for coming over", "start": 426.669, "duration": 6.42}, {"text": "I'm it's Alex Clark, and we'll see you somewhere, okay byeeee", "start": 433.22, "duration": 2.869}, {"text": "-Subscribe-", "start": 437.389, "duration": 5.93}, {"text": "Oh, well, um my name is um Brian Hull", "start": 443.33, "duration": 3.11}, {"text": "Well I do um like Oh My God!", "start": 458.289, "duration": 2.0}]