[{"text": "This part of the episode is brought to you in part by NordVPN.", "start": 0.06, "duration": 3.4}, {"text": "What better way to prepare for the upcoming video game streaming war than with a VPN?", "start": 3.46, "duration": 4.5}, {"text": "NordVPN encrypts your data so it can't be seen by ISP's, potential hackers, or game companies.", "start": 7.98, "duration": 5.3}, {"text": "For a limited time, get 70% off a three-year plan at NordVPN.com/stopskeletons.", "start": 13.3, "duration": 6.26}, {"text": "This special offer makes your subscription just 3 dollars and 49 cents a month,", "start": 19.56, "duration": 3.64}, {"text": "so you can browse securely on up to six devices at once!", "start": 23.2, "duration": 3.52}, {"text": "I'm in Ireland! Honest!", "start": 26.72, "duration": 1.86}, {"text": "And for a short time, use code 'STOPSKELETONS' at checkout to get an extra month for free!", "start": 28.58, "duration": 4.62}, {"text": "Link in the description below, try out a 30-day money-back guarantee", "start": 33.2, "duration": 3.66}, {"text": "at NordVPN.com/stopskeletons, and the offer code 'STOPSKELETONS'.", "start": 36.86, "duration": 4.68}, {"text": "Thanks to NordVPN for sponsoring this part of the episode.", "start": 41.54, "duration": 2.64}, {"text": "It is Doom season, folks! It's almost the holidays,", "start": 44.32, "duration": 3.24}, {"text": "and my hype for the big followup to Doom's utterly fantastic 2016 reboot, Doom Eternal, is at a peak level!", "start": 47.56, "duration": 6.36}, {"text": "And then when Bethesda surprise-released ports of Ultimate Doom, Doom II, and Doom 3", "start": 53.92, "duration": 4.12}, {"text": "on the Switch, PS4, and Xbox One to celebrate the series' 25th anniversary,", "start": 58.04, "duration": 4.5}, {"text": "my little Cyberdemon heart almost couldn't take it,", "start": 62.54, "duration": 2.42}, {"text": "and then, a few months later, they announced a re-release of Doom 64,", "start": 64.96, "duration": 4.04}, {"text": "it's the best one!! IT'S ABOUT TIME!!", "start": 69.0, "duration": 2.74}, {"text": "However.", "start": 71.8, "duration": 0.78}, {"text": "In typical Doom port fashion, these ports to modern consoles still weren't without issues.", "start": 72.86, "duration": 5.38}, {"text": "Yeah, you'd think it'd be impossible to screw up Classic Doom in 2019,", "start": 78.24, "duration": 3.92}, {"text": "but Bethesda somehow found a way.", "start": 82.16, "duration": 2.28}, {"text": "Still, all this made me think of a time", "start": 84.5, "duration": 1.7}, {"text": "when the console hardware limitations that kneecapped Doom ports... vanished!", "start": 86.2, "duration": 5.3}, {"text": "I've covered many console ports of Doom over the years, I've seen it all,", "start": 91.5, "duration": 3.88}, {"text": "I've seen terrible framerate, missing campaign levels, awful/amazing music...", "start": 95.38, "duration": 4.94}, {"text": "[grating synthesizer buzz]", "start": 100.32, "duration": 3.12}, {"text": "But for this episode, we move to an era where all of that changed!", "start": 103.44, "duration": 4.0}, {"text": "Or, where it should've.", "start": 107.44, "duration": 1.84}, {"text": "These ports may not be weird, ambitious or unnecessary on their own,", "start": 109.36, "duration": 3.58}, {"text": "but what is weird and unnecessary is how some of them still botched it!", "start": 112.94, "duration": 3.54}, {"text": "That perfect PC Doom is still a struggle on consoles!", "start": 116.48, "duration": 4.08}, {"text": "Welcome back to Punching Weight, and get ready to rip and tear,", "start": 120.6, "duration": 3.1}, {"text": "this is Doom Ports 3!", "start": 123.8, "duration": 2.24}, {"text": "Oh, and it's not Doom 3 ports, it's actually...", "start": 126.44, "duration": 2.62}, {"text": "... we're gonna be talking about Doom 3 a lot.", "start": 129.06, "duration": 1.42}, {"text": "But we're not gonna be talking about Doom 3 actually in this video,", "start": 130.6, "duration": 3.52}, {"text": "It'll make sense by the end, I swear.", "start": 134.26, "duration": 1.92}, {"text": "Uh... let's go!", "start": 136.18, "duration": 1.16}, {"text": "We start with Doom 3 Limited Collector's Edition for the Xbox!", "start": 144.7, "duration": 4.26}, {"text": "I've owned this game since it came out in April 2005,", "start": 148.98, "duration": 3.2}, {"text": "not because it's an interesting and ambitious port of Doom 3, no,", "start": 152.18, "duration": 3.44}, {"text": "the reason I hunted this game down was because it had Ultimate Doom and Doom II.", "start": 155.62, "duration": 4.16}, {"text": "And I do mean THIS version, Vanilla Xbox Doom 3 did NOT have Classic Doom, for some reason.", "start": 159.78, "duration": 5.48}, {"text": "Now, that alone was all I needed,", "start": 165.26, "duration": 2.0}, {"text": "but what I didn't realize at the time was how important this release was!", "start": 167.26, "duration": 4.28}, {"text": "This would be THE first time these games would appear on consoles in their entirety!", "start": 171.56, "duration": 4.86}, {"text": "Every single console port of Doom until this point had levels missing or slimmed down,", "start": 176.44, "duration": 5.82}, {"text": "a different soundtrack, and only a few had any multiplayer to speak of!", "start": 182.26, "duration": 3.74}, {"text": "For over a decade, Doom had not been fully represented in the console space,", "start": 186.0, "duration": 4.02}, {"text": "but that finally changed in 2005!", "start": 190.02, "duration": 2.44}, {"text": "Made by Vicarious Visions, this port of Doom 3 is interesting in its own right,", "start": 192.52, "duration": 4.3}, {"text": "but again, we're saving that discussion for another time.", "start": 196.82, "duration": 2.2}, {"text": "Truth be told, this is still the only version of Doom 3 I've ever played,", "start": 199.02, "duration": 4.12}, {"text": "so I got some catching up to do.", "start": 203.24, "duration": 1.42}, {"text": "I think what's most impressive is that, well,", "start": 204.7, "duration": 2.14}, {"text": "beyond being the first time all levels from Thy Flesh Consumed", "start": 206.84, "duration": 3.06}, {"text": "and larger Doom II levels like the Industrial Zone and The Chasm appeared unbroken on consoles,", "start": 209.9, "duration": 4.54}, {"text": "it also has two exclusive new levels: Sewers and Betray,", "start": 214.44, "duration": 3.76}, {"text": "both of which are pretty big, and a decent amount to chew on!", "start": 218.2, "duration": 2.66}, {"text": "Sewers, accessed from E1M1 in Doom 1, in particular is almost too long,", "start": 220.86, "duration": 4.86}, {"text": "but I tend to not enjoy the more sprawling Doom levels,", "start": 225.78, "duration": 2.62}, {"text": "and the titular sewer area of this level is quite the maze!", "start": 228.4, "duration": 3.6}, {"text": "Betray, accessed from Level 2 on Doom II, is a puzzle of small rooms linked together with warps.", "start": 232.02, "duration": 5.12}, {"text": "I liked it more than Sewers, plus it had a couple 'o Wolfenstein guards, which was fun.", "start": 237.16, "duration": 3.28}, {"text": "These levels are a really cool addition, but they're too easy to miss!", "start": 240.48, "duration": 3.22}, {"text": "They're accessed my activating random walls.", "start": 243.7, "duration": 2.42}, {"text": "I didn't even know they were there until researching for this video!", "start": 246.12, "duration": 2.74}, {"text": "Tch. And just when I thought I couldn't learn anything more about Doom!", "start": 248.86, "duration": 2.94}, {"text": "But enough about the levels, how does it actually play?", "start": 251.86, "duration": 2.76}, {"text": "Once you get past how weirdly dark it is,", "start": 254.68, "duration": 2.26}, {"text": "- I mean, Doom's already kind of a dark game, but what's goin' on here? -", "start": 256.94, "duration": 3.12}, {"text": "I'd say it plays about as well as the PC version!", "start": 260.06, "duration": 2.4}, {"text": "Solid framerate, good controls...", "start": 262.46, "duration": 1.8}, {"text": "... okay, actually, the controls are a little odd:", "start": 264.26, "duration": 2.1}, {"text": "The A button doesn't open doors, instead it's \"Repeat Info\",", "start": 266.36, "duration": 3.08}, {"text": "in case you need to remember you just picked up a shotgun?", "start": 269.44, "duration": 2.7}, {"text": "Why is such an important button used for such a useless thing?", "start": 272.14, "duration": 2.94}, {"text": "And Map is D-pad up? Another weird choice.", "start": 275.08, "duration": 3.18}, {"text": "Why's there no button customization?", "start": 278.26, "duration": 1.8}, {"text": "Turning on God Mode is pushing Activate three times while holding Run,", "start": 280.06, "duration": 3.4}, {"text": "which I constantly did accidentally, it was kind of annoying,", "start": 283.46, "duration": 3.12}, {"text": "and overall, the audio is a little muffled?", "start": 286.58, "duration": 2.88}, {"text": "[slightly low-quality, clipping sounds of carnage]", "start": 289.46, "duration": 4.3}, {"text": "But these are all really small things, and man, I played the hell out of this back in the day,", "start": 293.78, "duration": 3.92}, {"text": "plus, it had co-op and multiplayer, though just local, but it was still pretty cool!", "start": 297.7, "duration": 4.3}, {"text": "But again, this is only the steel case version of Doom 3, however, there was an alternative:", "start": 302.04, "duration": 4.5}, {"text": "The Doom 3 expansion pack, Resurrection of Evil, was released six months later,", "start": 306.54, "duration": 3.8}, {"text": "and all Xbox versions have The Ultimate Doom, Doom II, the two extra levels, plus the Master Levels for Doom II,", "start": 310.38, "duration": 6.5}, {"text": "making this the more complete package, depending on how you were looking at it.", "start": 316.88, "duration": 3.52}, {"text": "I did not realize that at the time, I probably would've been happier with this one,", "start": 320.4, "duration": 4.66}, {"text": "but I don't think I could've waited that long.", "start": 325.06, "duration": 2.04}, {"text": "I needed my Doom! I needed it.", "start": 327.32, "duration": 1.8}, {"text": "I had a problem. I still have that problem.", "start": 329.12, "duration": 1.96}, {"text": "The Master Levels for Doom II is an awesome get for this package, they are some hardcore levels!", "start": 331.94, "duration": 5.16}, {"text": "And I'd like to say that this was their first time ever appearing on consoles, but that's actually not true!", "start": 337.1, "duration": 4.72}, {"text": "There's also Final Doom for the PS1, a game built on a house of lies,", "start": 341.82, "duration": 3.68}, {"text": "with about half of it being made up of Doom II Master Levels.", "start": 345.5, "duration": 3.3}, {"text": "I mean, how you gonna call a game \"Final Doom\",", "start": 348.88, "duration": 2.24}, {"text": "but you only got six levels from The Plutonia Experiment?! C'mon!", "start": 351.12, "duration": 2.92}, {"text": "Plus, it runs worse than the Custom PlayStation Edition, overall it's kind of a fascinating mess,", "start": 354.1, "duration": 5.28}, {"text": "but anyway, this is at least the first time console players could play Doom II Master Levels at a decent framerate.", "start": 359.38, "duration": 5.56}, {"text": "Doom 3: Resurrection of Evil was developed by Nerve Software,", "start": 364.98, "duration": 3.34}, {"text": "a company founded by former id Software employees,", "start": 368.32, "duration": 2.34}, {"text": "who would handle most Doom console ports from here on out!", "start": 370.66, "duration": 3.32}, {"text": "Everything here runs and controls as well as it did on the Limited Collector's Edition,", "start": 373.98, "duration": 3.92}, {"text": "and more than likely shares a lot of the same code.", "start": 377.9, "duration": 2.1}, {"text": "The two bonus levels and the Master Levels are great additions,", "start": 380.06, "duration": 2.72}, {"text": "but future Doom II re-releases would instead have a different bonus episode, No Rest for the Living!", "start": 382.78, "duration": 5.12}, {"text": "These maps were designed by Nerve, and first appeared on the XBLA version of Doom II,", "start": 387.98, "duration": 4.84}, {"text": "and then later on the Doom 3 BFG Edition, which also features Ultimate Doom for good measure.", "start": 392.82, "duration": 5.08}, {"text": "At this point, we've now moved on to a new console port of Doom,", "start": 397.9, "duration": 3.64}, {"text": "you can think of it as two slightly different versions split across five games.", "start": 401.54, "duration": 4.2}, {"text": "The XBLA/BFG iteration of Classic Doom is basically a slight improvement over the OG Xbox version,", "start": 405.82, "duration": 5.8}, {"text": "with brighter graphics, a smoother look, splitscreen and online multiplayer, and better controls!", "start": 411.62, "duration": 4.92}, {"text": "Still no button customization, but it's no biggie here.", "start": 416.54, "duration": 2.82}, {"text": "I think I'd like No Rest for the Living more than the Master Levels,", "start": 419.36, "duration": 3.18}, {"text": "it's only nine levels, but they're huge and pretty well made!", "start": 422.54, "duration": 3.42}, {"text": "Apparently they're so huge and packed with enemies, they couldn't run on the original 90's engine,", "start": 425.96, "duration": 4.96}, {"text": "so it's Classic Doom, but without limits! I love that kinda stuff!", "start": 430.92, "duration": 3.62}, {"text": "Toss in the fact that these XBLA/BFG games are the only Doom ports with online multiplayer,", "start": 434.58, "duration": 5.18}, {"text": "- that's still true, by the way -", "start": 439.76, "duration": 1.6}, {"text": "and you could make the case that these are the best console ports of Doom and Doom II.", "start": 441.36, "duration": 4.3}, {"text": "The BFG Edition was also the first time any Doom action came to the PlayStation since the PlayStation 1!", "start": 445.72, "duration": 6.58}, {"text": "But bringing it all back to where we started, I'm pretty disappointed", "start": 452.44, "duration": 3.98}, {"text": "that the Nerve-developed 25th Anniversary ports of Doom and Doom II are rife with a LOT of minor issues.", "start": 456.42, "duration": 5.78}, {"text": "Like, a LOT. It's a bit- bit of a trainwreck.", "start": 462.2, "duration": 2.98}, {"text": "In retrospect, there was trouble right away with these ports,", "start": 465.24, "duration": 2.78}, {"text": "even in the launch announcement trailer, they screwed up the orders of Doom I and II!", "start": 468.02, "duration": 4.12}, {"text": "Like, you thought we weren't gonna notice that after the Doom I logo, you show Level 2 from Doom II?", "start": 472.14, "duration": 5.2}, {"text": "And after the Doom II logo, you show E2M1 of Doom I?", "start": 477.34, "duration": 3.3}, {"text": "Slayers Club, my big toe! Don't @ me!", "start": 480.66, "duration": 3.04}, {"text": "Now, to be fair, this was just the trailer at QuakeCon, they fixed it with the other trailers, but still!", "start": 483.74, "duration": 4.68}, {"text": "Doom on Switch? Portable Classic Doom?! Insta-purchase, right?", "start": 488.52, "duration": 3.72}, {"text": "Well, minutes after launch, social media exploded with grim news:", "start": 492.42, "duration": 4.38}, {"text": "An internet connection and registering to BethesdaNet were required to play, on all systems.", "start": 496.8, "duration": 6.02}, {"text": "It was basically DRM on one of the most DRM-free video games in existence.", "start": 502.82, "duration": 5.46}, {"text": "Bethesda claims it wasn't to enforce DRM, and someone's not getting the company memos,", "start": 508.3, "duration": 4.64}, {"text": "because the port of Doom 3, which was ported instead by Panic Button, never had these issues.", "start": 512.94, "duration": 4.68}, {"text": "It was apparently a way to get people to join their proprietary Slayers Club,", "start": 517.62, "duration": 3.8}, {"text": "which... Hey! Don't @ me!", "start": 521.42, "duration": 1.96}, {"text": "Wait, no, please DO @ me, because I put hundreds of hours into the Doom 32X port in the 90's!", "start": 523.48, "duration": 5.54}, {"text": "I'm already part of the OG Slayers Club anyway!", "start": 529.18, "duration": 2.44}, {"text": "DRM or not, it still took Bethesda three weeks to patch out this requirement,", "start": 531.78, "duration": 4.52}, {"text": "and it's still prompted on startup,", "start": 536.3, "duration": 1.72}, {"text": "and if you're playing offline, it hassles you for an internet connection three times.", "start": 538.02, "duration": 4.18}, {"text": "Dude, should I just get my GBA instead?", "start": 542.86, "duration": 1.78}, {"text": "Okay, but what about the actual gameplay itself? Let's talk about the game.", "start": 544.66, "duration": 3.42}, {"text": "I went all-in on the Switch port, because you know I'm all about Doom on the go,", "start": 548.08, "duration": 3.42}, {"text": "so I can't speak for PlayStation or Xbox, but I can say these are some pretty solid ports of Doom!", "start": 551.5, "duration": 5.6}, {"text": "All the levels, all the monsters, it's all here! But still with the few baffling issues!", "start": 557.1, "duration": 4.88}, {"text": "The Switch version apparently has dropped frames when docked, though not enough for me to notice,", "start": 562.04, "duration": 4.58}, {"text": "and I wasn't a huge fan of playing with Joy-Cons, movement felt better on a Pro Controller,", "start": 566.62, "duration": 4.38}, {"text": "which is a bummer because I bought this for portability!", "start": 571.0, "duration": 2.66}, {"text": "And it crashes sometimes when you put it into Sleep Mode, I mean, c'mon guys!", "start": 573.68, "duration": 3.3}, {"text": "We actually got footage of it happening earlier when we were setting it up! Roll it!", "start": 576.98, "duration": 3.52}, {"text": "We're trying to set up right now! And it froze on me!", "start": 580.7, "duration": 3.34}, {"text": "GRACE: It froze?!\nDEREK: [stammering] It fr- it's fr-", "start": 584.24, "duration": 1.54}, {"text": "We haven't even set up- the mic isn't even on yet,", "start": 585.78, "duration": 1.96}, {"text": "I'm still setting up the set- It's still frozen!", "start": 587.74, "duration": 2.1}, {"text": "It's like... why you messin' up my portable Doom?!", "start": 590.44, "duration": 2.24}, {"text": "I just wanna play portable Doom!", "start": 592.92, "duration": 1.56}, {"text": "C'mon, guys!", "start": 595.04, "duration": 1.02}, {"text": "For some reason there's a level select for Master Levels, but not for Doom I or Doom II.", "start": 596.14, "duration": 4.62}, {"text": "This is a small complaint, but I would've really loved the option to just jump right to the Tower of Babel", "start": 600.88, "duration": 4.28}, {"text": "and start trading rockets with the Cyberdemon!", "start": 605.16, "duration": 1.96}, {"text": "There's been a lot of hubbub about the music, and it's true, at the time of producing this video,", "start": 607.2, "duration": 4.42}, {"text": "the music in these 25th Anniversary ports is a bit slower than the PC original.", "start": 611.62, "duration": 4.38}, {"text": "Now, my favorite version of Doom is the PlayStation 1 port,", "start": 616.02, "duration": 2.82}, {"text": "which doesn't have any of this music, so I didn't even notice at first!", "start": 618.84, "duration": 2.96}, {"text": "But it turns out I should have noticed a long time ago,", "start": 621.8, "duration": 2.6}, {"text": "because this is how the music plays in every port Nerve has ever done!", "start": 624.4, "duration": 3.92}, {"text": "Switch:", "start": 628.32, "duration": 0.5}, {"text": "[E1M1 theme playing at a slower tempo]", "start": 628.82, "duration": 4.8}, {"text": "XBLA:", "start": 633.62, "duration": 0.8}, {"text": "[E1M1 theme playing slightly slow, and with low quality instruments]", "start": 634.42, "duration": 4.58}, {"text": "Original Xbox:", "start": 639.0, "duration": 0.92}, {"text": "[E1M1 theme playing at a slower tempo]", "start": 639.92, "duration": 4.72}, {"text": "I compared them all, the music is slower in every single one!", "start": 644.64, "duration": 3.2}, {"text": "What I did notice was the inaccurate lighting:", "start": 647.84, "duration": 2.54}, {"text": "My favorite jumpscare in E1M3 is ruined, et cetera,", "start": 650.42, "duration": 3.22}, {"text": "This strange lighting also appeared in the BFG versions.", "start": 653.64, "duration": 3.06}, {"text": "Now apparently, these two issues are going to be patched out eventually,", "start": 656.7, "duration": 3.1}, {"text": "but seriously, what the Cacodemon?!", "start": 659.8, "duration": 1.98}, {"text": "Update: On September 26th, two months after launch, they did release a patch,", "start": 661.94, "duration": 5.06}, {"text": "but it was a patch for fixes that shouldn't have needed fixes in the first place!", "start": 667.0, "duration": 3.92}, {"text": "These are, again, very small issues, but re-releasing Doom ports should have been a slam dunk!", "start": 670.92, "duration": 5.02}, {"text": "Previously Doom ports were just extras, bonus content,", "start": 675.94, "duration": 2.96}, {"text": "but these are to celebrate the series' 25th anniversary, and to build hype for a new game!", "start": 678.9, "duration": 4.84}, {"text": "This was the time to finally get it right!", "start": 683.8, "duration": 2.72}, {"text": "I don't think they have any plans to fix other issues, like the stretched-out aspect ratio,", "start": 686.52, "duration": 3.78}, {"text": "but to be honest, that one doesn't bother me.", "start": 690.3, "duration": 2.04}, {"text": "Thicc Cacodemons are valid too, y'all!", "start": 692.4, "duration": 2.06}, {"text": "Mm, that demon's thicc! Dummy thicc demons, now I'm talkin'.", "start": 694.52, "duration": 3.4}, {"text": "In terms of other content, there's no online multiplayer, just splitscreen, which is kinda disappointing.", "start": 697.94, "duration": 5.06}, {"text": "These two ports have all episodes of Doom, and even the Master Levels of Doom II,", "start": 703.0, "duration": 3.64}, {"text": "however, I guess this shouldn't be considered the be-all end-all of Doom.", "start": 706.64, "duration": 3.68}, {"text": "It's missing all the console-exclusive levels,", "start": 710.32, "duration": 2.18}, {"text": "plus there's been nary a whisper about Final Doom - no big surprise there,", "start": 712.5, "duration": 3.94}, {"text": "but what's odd to me is the omission of No Rest For The Living, which was even made by the same people!", "start": 716.44, "duration": 4.96}, {"text": "I feel like I... yeah, I'm being extra-negative on these ports,", "start": 721.44, "duration": 3.36}, {"text": "but I just can't understand how Bethesda is making these kinds of mistakes,", "start": 724.8, "duration": 3.46}, {"text": "and I'll tell you this: It makes me worried for the Doom 64 port.", "start": 728.26, "duration": 3.54}, {"text": "So with no place else left to go, it was time to check out the iPhone ports!", "start": 731.8, "duration": 3.96}, {"text": "Yep, it had to happen, it's time for Punching Weight to go mobile!", "start": 736.3, "duration": 3.9}, {"text": "You thought I was kidding when I said I love portable Doom,", "start": 740.3, "duration": 2.52}, {"text": "I need that ultimate portable experience!", "start": 742.82, "duration": 2.48}, {"text": "And actually, Doom on iOS is not a new thing,", "start": 745.36, "duration": 3.1}, {"text": "originally it came out in 2009, ported by John Carmack himself,", "start": 748.48, "duration": 4.02}, {"text": "coincidentally right before id Software was purchased by Bethesda.", "start": 752.56, "duration": 3.4}, {"text": "I slept on that version though, and then 2017's iOS 11 update made it unplayable.", "start": 755.96, "duration": 5.22}, {"text": "Same for Doom RPG I and II.", "start": 761.3, "duration": 1.98}, {"text": "Sleepin' on mobile ports... gotta fix that.", "start": 763.44, "duration": 2.4}, {"text": "But before you get too depressed about that, Doom is back, baby!", "start": 766.04, "duration": 3.78}, {"text": "Released alongside all these new console ports, plus this is the first time Doom II came to iOS!", "start": 769.88, "duration": 5.38}, {"text": "And of course, because this is iOS, we have to contend with touch controls.", "start": 775.3, "duration": 3.76}, {"text": "Now, touch controls are why I avoid most mobile ports, it just never works,", "start": 779.12, "duration": 5.12}, {"text": "but the touch controls in the 25th Anniversary Doom and Doom II on iOS are... borderline unplayable.", "start": 784.28, "duration": 6.62}, {"text": "Strafing is mapped to the left screen, while turning and firing is mapped to the right,", "start": 790.9, "duration": 3.7}, {"text": "it tries to emulate a controller setup.", "start": 794.6, "duration": 2.6}, {"text": "Movement is hard enough thanks to a bit of a delay,", "start": 797.22, "duration": 2.46}, {"text": "but mapping your look and shoot to the same side was a huge mistake,", "start": 799.68, "duration": 3.6}, {"text": "making precise aiming an incredible struggle!", "start": 803.28, "duration": 2.58}, {"text": "Double-tapping is supposed to auto-fire so you can shoot while turning,", "start": 805.92, "duration": 3.02}, {"text": "but I had a hell of a time getting it to work!", "start": 808.94, "duration": 1.8}, {"text": "And of course, there's no controller customization.", "start": 810.74, "duration": 2.58}, {"text": "It's worth noting that these controls are different from Carmack's original version,", "start": 813.32, "duration": 3.78}, {"text": "which also had multiplayer network via Wi-Fi and Bluetooth! Where the heck did that go?!", "start": 817.1, "duration": 4.66}, {"text": "To be fair, the problem of how to translate a game like Doom to touch controls is fascinating,", "start": 821.8, "duration": 5.36}, {"text": "but Bethesda changing up the controls is basically a tacit admission that they still hadn't nailed it.", "start": 827.16, "duration": 5.44}, {"text": "According to Reddit, both iOS Dooms have support for mobile controllers like Nimbus, so there's that.", "start": 832.6, "duration": 5.28}, {"text": "All I know is playing with touch screen is a nightmare.", "start": 837.9, "duration": 2.58}, {"text": "Oh, and at startup you're still asked to join BethesdaNet.", "start": 840.54, "duration": 2.7}, {"text": "Thanks, I hate it.", "start": 843.42, "duration": 1.38}, {"text": "So yep! Another horribly compromised port of Doom, the Circle of Life continues!", "start": 845.42, "duration": 5.22}, {"text": "Is this about as good as it could get on a smartphone?", "start": 850.66, "duration": 2.44}, {"text": "... I guess I'm not the best person to ask, but how about this:", "start": 853.18, "duration": 3.06}, {"text": "I have played the Saturn and 3DO ports for multiple hours,", "start": 856.26, "duration": 4.0}, {"text": "I've played a LOT of bad Doom,", "start": 860.26, "duration": 2.72}, {"text": "BUT I've never rage-quit Doom before iOS.", "start": 862.98, "duration": 3.66}, {"text": "Is that its own recommendation? [scoff] I dunno.", "start": 866.68, "duration": 2.9}, {"text": "Pull out your smartphones, friends, and play the worst version of Doom I've ever experienced!", "start": 869.66, "duration": 4.76}, {"text": "[Grace chuckles off-screen]", "start": 874.6, "duration": 3.88}, {"text": "Can I stop?\n[Grace chuckles off-screen]", "start": 878.48, "duration": 0.66}, {"text": "GRACE: Yeah, you can stop. [laughing]\nDEREK: Okay.", "start": 879.14, "duration": 2.26}, {"text": "That's enough Doom... for now.", "start": 881.92, "duration": 2.08}, {"text": "2019 has become a banner year for Doom,", "start": 884.02, "duration": 2.64}, {"text": "we'll definitely be back when they release the re-release of Doom 64,", "start": 886.66, "duration": 4.4}, {"text": "and oh snap, will it run as shockingly good as Doom 2016 did?", "start": 891.06, "duration": 4.1}, {"text": "You're gonna want to hit that subscribe button and ring the bell,", "start": 895.28, "duration": 2.14}, {"text": "because we got a lot of great stuff planned for the next few months,", "start": 897.42, "duration": 2.92}, {"text": "Also, we got new T-shirts and other merch,", "start": 900.4, "duration": 2.34}, {"text": "and of course, the specialest possible thanks to our Patreon supporters", "start": 902.74, "duration": 3.68}, {"text": "who make sure we'll still be able to make videos", "start": 906.42, "duration": 2.36}, {"text": "even if YouTube finds some ridiculous, random reason to shut down or hide the channel.", "start": 908.96, "duration": 4.26}, {"text": "Join their ranks, see your name here, or hey...", "start": 913.3, "duration": 2.54}, {"text": "Just keep watching, and thanks so much for watching,", "start": 916.06, "duration": 2.3}, {"text": "I'm Derek Alexander, this is Stop Skeletons From Fighting, and we'll see you again real soon.", "start": 918.36, "duration": 3.88}]