[{"text": "This video is brought to you by Squarespace website online store marketing tools analytics the go-to", "start": 0.06, "duration": 6.33}, {"text": "Platform when you want to learn your business or create a beautiful", "start": 6.79, "duration": 2.63}, {"text": "website like I am doing at the moment so more on this later, but for now, let's wok", "start": 9.82, "duration": 6.05}, {"text": "Hey guys salut, this is Alex. Welcome back to the mini BBQ Wok series if you remember where in the previous episode we", "start": 16.68, "duration": 7.58}, {"text": "Seasoned a wok properly, you know in this episode. I want to build myself a nice little", "start": 27.04, "duration": 4.96}, {"text": "BBQ outdoor wok station if you want and believe it or not, I'm not gonna make something like completely over engineer deep inside", "start": 32.0, "duration": 7.14}, {"text": "I want to be a simple person, but life just you know", "start": 39.149, "duration": 3.09}, {"text": "Whatever and believe it or not this time, I want to I want to make something that is easy for you guys to replicate", "start": 43.12, "duration": 5.66}, {"text": "It's something that wouldn't just stay a YouTube video that you guys could bring along in your garden", "start": 48.78, "duration": 6.689}, {"text": "You see i'm a good guy after all", "start": 55.469, "duration": 2.0}, {"text": "Instead of starting from scratch. I want to start with a contraption that will help us", "start": 58.96, "duration": 5.33}, {"text": " ", "start": 64.29, "duration": 0.729}, {"text": "Speed up the process. So this is a chimney starter", "start": 65.019, "duration": 3.44}, {"text": "It can double up as a wok station", "start": 69.04, "duration": 3.86}, {"text": "in fact, I got the idea reading an article on serious eats.com by", "start": 72.9, "duration": 4.529}, {"text": "Kenji Lopez he basicically places his chimney starter inside his barbecue and place the wok on top of it", "start": 78.22, "duration": 7.669}, {"text": "Now, I think this design is a good start", "start": 85.89, "duration": 2.0}, {"text": "But there definitely are a few flaws with this. First of all stir-frying things is basically", "start": 88.39, "duration": 5.239}, {"text": "shaking things vigorously so you've got high chances of just", "start": 94.45, "duration": 3.62}, {"text": "tipping the whole thing off. And that's another problem which is managing the airflow with this design at the moment", "start": 98.65, "duration": 6.109}, {"text": "You have to lift", "start": 104.759, "duration": 0.97}, {"text": "The wok in order for the oxygen to be able to flow and then you put it back and put it back up", "start": 105.729, "duration": 4.94}, {"text": "It's just not practical right? So I thought of a very simple design. Let me show you what I thought of.", "start": 110.67, "duration": 6.629}, {"text": "So basically would go like this like the chimney starter would be held in place by", "start": 119.02, "duration": 4.819}, {"text": "poles anchored in the ground or sealed into", "start": 124.63, "duration": 3.409}, {"text": "Concrete's and then on top of it you would have like a walker ring that would sit maybe an inch", "start": 128.31, "duration": 5.75}, {"text": "Above the very top and that would allow", "start": 134.459, "duration": 2.839}, {"text": "for great air flow. air would come from underneath", "start": 137.67, "duration": 3.44}, {"text": "Would go through the chimney and then it would prevent the fire from dying because of the air intake", "start": 141.329, "duration": 6.59}, {"text": "here and here and there as well and that is basically my plan to turn a", "start": 147.989, "duration": 5.089}, {"text": "chimney starter into a wok station", "start": 153.989, "duration": 3.29}, {"text": "So I'm gonna go online buy a few things like the chimney starter rope ring brackets and nuts and bolts and whatnot", "start": 157.439, "duration": 6.23}, {"text": "We catch up just afterwards.", "start": 163.68, "duration": 2.0}, {"text": "I Finally got everything I ordered in the mail today", "start": 169.65, "duration": 3.919}, {"text": "So I've got my a barbecue chimney with me wok ring that I wanted. I'm thinking about mounting", "start": 174.0, "duration": 6.799}, {"text": "It maybe upside down instead of down side up", "start": 180.799, "duration": 3.389}, {"text": "I am now heading to my parents house because basically they have a lovely little", "start": 184.189, "duration": 4.05}, {"text": "garden", "start": 188.489, "duration": 0.5}, {"text": "And now the whole setup is very clear in my mind the way I should mount the chimney and the walk ring on top", "start": 188.989, "duration": 5.52}, {"text": "It's very clear. The only thing that is not", "start": 194.579, "duration": 2.51}, {"text": "defined yet is how to mount this somewhere like poles or", "start": 197.879, "duration": 3.38}, {"text": "Stuck in between bricks and also that it doesn't move around when I", "start": 202.919, "duration": 3.56}, {"text": "Stir-fry I because basically I'm not worried about safety that much I'm mostly worried about my moves not being perfect", "start": 206.97, "duration": 6.889}, {"text": "Not even joking. So I guess with that in mind", "start": 215.34, "duration": 2.359}, {"text": "I'm gonna make a quick pit stop at the local hardware store just to see if I can come up with any", "start": 217.699, "duration": 5.88}, {"text": "Solution for that before I reach my my parents house. So let's just do this", "start": 224.43, "duration": 4.639}, {"text": "Yes, here we are let's make this", "start": 254.84, "duration": 2.269}, {"text": "Usually my projects in real life are quite", "start": 287.04, "duration": 2.64}, {"text": "Far away from my my my designs on paper. But this time I would say that it's very honest", "start": 290.64, "duration": 5.68}, {"text": "So basically at the moment, I'm trying to see which height would feel the most comfortable like this feels quite natural", "start": 299.92, "duration": 6.96}, {"text": "Well as much as I enjoy this design it looks like a rocket it deserves to be light up properly so", "start": 334.689, "duration": 7.16}, {"text": "so he floor has been littered by repeat the floor has been littered", "start": 359.11, "duration": 4.099}, {"text": "Don't have all the ingredients. I need to make a pop of stuff fine", "start": 364.36, "duration": 2.809}, {"text": "But at least I can try to toss a few things. I can't wait to start", "start": 367.3, "duration": 4.099}, {"text": "right So basically a", "start": 375.759, "duration": 1.83}, {"text": "Popular wok station should sear things very quickly 50 seconds 60 seconds", "start": 377.589, "duration": 5.66}, {"text": "maybe max that it should make the droplets of oil catch on fire that", "start": 383.249, "duration": 5.22}, {"text": "slightly burned slightly toasted almost", "start": 388.839, "duration": 3.02}, {"text": "caramelized and charred", "start": 392.589, "duration": 1.92}, {"text": "Aroma is so specific to a wok cooking. In fact, it's called wok hei wok hei wok hei", "start": 394.509, "duration": 6.41}, {"text": "in China it's the breath of the wok. I made a miniseries about this in the past", "start": 400.919, "duration": 6.719}, {"text": "I'll put a link but in the meantime, honestly, I can't wait", "start": 407.639, "duration": 2.76}, {"text": "To start and just stir-fry these carrots as bowing as they might look I'm gonna enjoy this", "start": 410.949, "duration": 6.229}, {"text": "Now before we actually start cooking the stir-fry, I I need to mention something obviously", "start": 417.849, "duration": 3.919}, {"text": "I'm taking full responsibility for my own person", "start": 421.769, "duration": 2.67}, {"text": "And I think basically at home you should always do the same only do stuff if you think they are safe enough", "start": 424.439, "duration": 6.059}, {"text": "Okay, that being said let's stir-fry like a like like a lunatic", "start": 430.499, "duration": 3.839}, {"text": "Very nice, Crunchy, Colorful!", "start": 454.24, "duration": 2.64}, {"text": " ", "start": 456.88, "duration": 0.95}, {"text": "Shad. Yes", "start": 457.83, "duration": 1.769}, {"text": "But I don't get the burnt aroma that I was looking for", "start": 459.6, "duration": 3.12}, {"text": "the whole idea works for sure", "start": 463.72, "duration": 2.56}, {"text": "conveniency", "start": 466.289, "duration": 1.321}, {"text": "well It's... it's okay but the fact that you have to bolt it down to be set and unset afterwards", "start": 467.61, "duration": 5.929}, {"text": "But if you guys have in mind something that could be both stable and convenient", "start": 473.539, "duration": 5.46}, {"text": "Please let me know in the comments down below next the heat is good", "start": 479.0, "duration": 4.229}, {"text": "But we are lacking a flame and that's a problem that I need to wrap my head around so in the end this is what I suggest", "start": 483.229, "duration": 6.809}, {"text": "Next time I'm gonna come up with a solution that is bolder", "start": 490.979, "duration": 3.44}, {"text": "Okay", "start": 494.43, "duration": 0.5}, {"text": "and I'm gonna make a real proper stir-fry with noodle or rice and plenty different vegetables on a hopefully more powerful", "start": 494.93, "duration": 6.6}, {"text": "Wok station that's a bold promise, but I wanna make it bold", "start": 504.9, "duration": 3.919}, {"text": "Mmm, well, I think that's it for this episode", "start": 510.389, "duration": 2.689}, {"text": "I will definitely catch up with you in the next one", "start": 513.079, "duration": 2.31}, {"text": "If you enjoyed this journey", "start": 515.64, "duration": 1.67}, {"text": "If you enjoyed the build the project and the mini wok", "start": 517.31, "duration": 3.75}, {"text": "Barbecue series, and please give this video a big thumbs up like it and spread that everywhere", "start": 521.25, "duration": 4.729}, {"text": "You know how it works spread this like butter on all on a nonstick wok at least for this series only so until then", "start": 525.98, "duration": 6.059}, {"text": "Bye bye salut", "start": 532.04, "duration": 2.0}, {"text": "And now a quick word about our sponsor for this video Squarespace", "start": 534.45, "duration": 3.649}, {"text": "So in my opinion coding a website from scratch these days that doesn't make any more sense", "start": 538.29, "duration": 4.429}, {"text": "Like with Squarespace I'm able to create an online stuff on my own personal website in a matter of minutes", "start": 543.24, "duration": 6.559}, {"text": "Like I'm still working on it at the moment, but but that's a good project of mine", "start": 550.02, "duration": 3.859}, {"text": "But I will be able to gather all the merch in one place and with Squarespace not only is that easy and straightforward?", "start": 553.88, "duration": 6.989}, {"text": "But it's also just my zaber like they have plenty", "start": 561.27, "duration": 3.049}, {"text": "different templates on Squarespace", "start": 564.99, "duration": 1.849}, {"text": "you know classic modern contemporary and", "start": 566.839, "duration": 2.58}, {"text": "The beauty of all these is that they are compliant even with the laptop or with the mobile", "start": 569.85, "duration": 4.91}, {"text": "It just looks great", "start": 574.94, "duration": 1.33}, {"text": "every time now another feature that I found to be really cool on square space that comes that you can also buy a", "start": 576.27, "duration": 5.54}, {"text": "Domain on top of creating your own website, which makes the whole process just less painful and more", "start": 581.91, "duration": 5.6}, {"text": "Natural it's ok", "start": 588.09, "duration": 1.04}, {"text": "So check out Squarespace does come for a free trial and when you're ready to launch your own", "start": 589.13, "duration": 4.139}, {"text": "Personal website when you're ready to take the leap of faith. Just go to", "start": 593.43, "duration": 4.19}, {"text": "Squarespace that come slash a French guy and get 10% off. Your first purchase will be a website of a domain", "start": 597.84, "duration": 6.77}, {"text": "Thank you Squarespace for sponsoring this video", "start": 604.74, "duration": 2.599}]