[{"text": "I am going to tell you about a remarkable man who led an extraordinary life,", "start": 0.0, "duration": 2.97}, {"text": "in this video which has been sponsored by Audible, but more of that later. His name was John Renton", "start": 3.549, "duration": 6.2}, {"text": "well, that was his official name actually almost everyone called him Jack Renton and he later became known as", "start": 9.75, "duration": 4.5}, {"text": "The White Headhunter", "start": 14.76, "duration": 2.58}, {"text": "Now Jack was born in the Orkneys", "start": 17.4, "duration": 2.2}, {"text": "What's that? You don't know where the Orkneys are. Ah fair enough. Why should you ? Well, the Orkneys are small", "start": 20.16, "duration": 5.54}, {"text": "Windswept islands surrounded by the cold seas north of Britain and well Jack didn't want to spend his entire life there", "start": 26.62, "duration": 6.86}, {"text": "He wanted to go out get out there and and and have adventures and see the world", "start": 33.48, "duration": 3.72}, {"text": "Well, he certainly had adventures", "start": 37.2, "duration": 1.69}, {"text": "So he went to Liverpool and signed on to become the crewman of a Windjammer and he went to Hong Kong and he went to", "start": 38.89, "duration": 6.229}, {"text": "San Francisco and he got drugged by his landlord", "start": 45.22, "duration": 5.22}, {"text": "He woke up with two other shanghaied men", "start": 50.6, "duration": 2.98}, {"text": "Aboard a Boston registered ship bound for McKean island. Now McKean island is in the middle of flipping nowhere.", "start": 54.16, "duration": 7.16}, {"text": "It's in the Pacific about 5000 miles into the Pacific and it's tiny I tell you about half a mile wide and", "start": 61.32, "duration": 6.869}, {"text": "Why would anyone want to go to this uninhabited little speck in the middle of nowhere?", "start": 68.5, "duration": 4.94}, {"text": "Well, from the sea it looks like a normal island -", "start": 74.1, "duration": 2.76}, {"text": "fairly lush. it's surrounded by vegetation - but you only have to walk about 50 yards inland and you come across a weird", "start": 76.86, "duration": 5.98}, {"text": "lifeless moonscape of poo. That's right !", "start": 84.04, "duration": 3.529}, {"text": "Guano -  you see if you are this small island in the middle of flipping nowhere", "start": 87.939, "duration": 4.7}, {"text": "then you're going to be very popular with birds who quite like to have a rest every now and again and", "start": 92.64, "duration": 4.319}, {"text": "So what does a bird do?  Well they poo, and after many centuries of birds landing there and pooing everywhere,", "start": 97.21, "duration": 6.319}, {"text": "tens of feet of guano had built up and this was actually quite valuable stuff. It was fertilizer.", "start": 103.96, "duration": 6.439}, {"text": "Some people will tell you that it was used for its saltpetre in the manufacture of gunpowder. These people are wrong. They're actually much", "start": 110.409, "duration": 5.75}, {"text": "more efficient ways of getting saltpetre", "start": 116.74, "duration": 1.85}, {"text": "No, it was just used for fertilizer", "start": 118.59, "duration": 1.77}, {"text": "But it was really good. It must have been really good fertilizer, much better than than pig or cow dung", "start": 120.36, "duration": 5.459}, {"text": "Which you might think would be perfectly adequate, but it was worthwhile", "start": 126.159, "duration": 2.84}, {"text": "Sending ships way out into the middle of nowhere to load up with", "start": 129.849, "duration": 3.15}, {"text": "cargos of this horrible poo.", "start": 133.94, "duration": 2.389}, {"text": "It was particularly good in", "start": 137.06, "duration": 2.0}, {"text": "Enriching the soils of places that had the rather weak soils", "start": 139.25, "duration": 2.96}, {"text": "Where you're trying to colonize - places the middle of nowhere where the soils aren't terrific", "start": 142.21, "duration": 3.3}, {"text": "desert islands and so forth and enrich them with guano and and maybe you can get economy running.", "start": 145.54, "duration": 4.919}, {"text": "Well ! Guano was in demand and so there were ships that went out to places like McKean Island and", "start": 150.46, "duration": 5.19}, {"text": "That was the work now to do they went to the island. They landed, they loaded up the ship with guano,", "start": 156.26, "duration": 4.129}, {"text": "holding their noses presumably a lot of the time and", "start": 161.39, "duration": 2.0}, {"text": "then the bosun of the ship approached Renton and his two shanghaied colleagues and said,", "start": 164.54, "duration": 5.209}, {"text": "\"I don't think this ship is seaworthy.", "start": 171.35, "duration": 2.479}, {"text": "Seriously, I don't think this this is going to get to where it's bound if we get hit by a serious storm or anything like that,", "start": 174.8, "duration": 6.68}, {"text": "I can see this ship going down", "start": 181.48, "duration": 1.92}, {"text": "It's in terrible condition and I can't persuade the captain of this. So I", "start": 183.4, "duration": 5.819}, {"text": "don't want to die in a big", "start": 189.47, "duration": 2.0}, {"text": "diluting puddle of poo in the middle of the Pacific, so", "start": 191.78, "duration": 3.8}, {"text": "I reckon the four of us could", "start": 196.52, "duration": 2.0}, {"text": "probably crew a small boat. Why don't we load up one of the ships small boats and just get out of here", "start": 198.8, "duration": 6.56}, {"text": "What do you say ?\" For Renton and his two shanghaied colleagues this of course was more than just avoiding the disaster of a potentially", "start": 205.36, "duration": 5.909}, {"text": "unseaworthy ship but it was also a way of escape, so they were all for it. Now the officers would patrol deck", "start": 211.64, "duration": 5.959}, {"text": "so it was quite obvious that these officers knew that people might try to desert and", "start": 217.64, "duration": 4.819}, {"text": "they reckoned they had about a two-minute gap to load loads of stuff onto one of the boats and", "start": 223.13, "duration": 5.119}, {"text": "get out of there and this they then did.  They didn't have a huge amount of stuff loaded on the boat", "start": 228.8, "duration": 4.699}, {"text": "But never mind, they could just get out of there quickly. That was the main thing and", "start": 233.5, "duration": 3.21}, {"text": "for the first three days,", "start": 237.65, "duration": 1.16}, {"text": "they had a good breeze and they put a lot of distance between themselves and the ship that they were deserting.", "start": 238.81, "duration": 5.07}, {"text": "Unfortunately, they were then becalmed and so they then had to row", "start": 244.73, "duration": 2.539}, {"text": "their supplies ran out rather quickly", "start": 248.27, "duration": 3.11}, {"text": "unfortunately and", "start": 252.2, "duration": 2.0}, {"text": "They started well losing weight and getting weaker. The bones started showing through on the rib cages", "start": 254.21, "duration": 5.18}, {"text": "now after drifting for about 17 days", "start": 260.69, "duration": 4.349}, {"text": "they were so starved that talk turned to cannibalism and", "start": 265.979, "duration": 4.58}, {"text": "There was a democratic meeting held now", "start": 270.99, "duration": 2.6}, {"text": "You know democracy is that you? Yes! Democracy is five wolves and a sheep deciding what to have for lunch", "start": 273.59, "duration": 5.729}, {"text": "So there were three", "start": 279.9, "duration": 1.68}, {"text": "Americans and", "start": 281.58, "duration": 1.649}, {"text": "Renton who was definitely the plumpest", "start": 283.229, "duration": 2.27}, {"text": "So I think you can guess how that vote went and it seems that it was just about when they were", "start": 285.93, "duration": 6.47}, {"text": "Going in for the kill to kill him that Oh", "start": 293.039, "duration": 2.57}, {"text": "Timely a tiger shark was sighted but how to get the tiger shark to come closer to the boat ?", "start": 295.949, "duration": 6.17}, {"text": "It was up to Renton again", "start": 303.24, "duration": 1.34}, {"text": "He sat on the side of the boat and dangled his feet in the water temptingly", "start": 304.58, "duration": 4.079}, {"text": "Little small fish came over and nibbled his toes, but he wasn't interested", "start": 308.94, "duration": 3.409}, {"text": "He wanted the tiger shark which eventually came in and yes", "start": 312.479, "duration": 3.44}, {"text": "they were able to bash it with oars and clubbed it and stabbed it with everything they had and they managed to subdue and", "start": 315.919, "duration": 5.76}, {"text": "Finally kill the tiger shark so feel they had some that's some food", "start": 322.139, "duration": 4.16}, {"text": "They could cut a load of steaks of it and get cooking that some cooking gear aboard the boat and this was fine at first", "start": 326.3, "duration": 6.54}, {"text": "Whew what a relief got some food in this not terribly nice. But hey, it's it's food", "start": 333.15, "duration": 4.1}, {"text": "They didn't actually get to eat most of the shark. Most of the shark was eaten by other sharks", "start": 337.83, "duration": 4.339}, {"text": "They had to lash it to the outside of the boat. And well other sharks came along and they had most of it but", "start": 342.169, "duration": 5.52}, {"text": "They are also able to cut off cut out a lot of steaks off it and dry them in the Sun for use later. Oh", "start": 348.24, "duration": 4.97}, {"text": "That would have worked where the work had it then not rained and these dried steaks got wet and then they rotted", "start": 353.759, "duration": 6.89}, {"text": "But then they were all they had to eat so they had the rotten shark steaks and they were horribly", "start": 361.229, "duration": 5.69}, {"text": "Horribly, sick throwing up all over the shop and they drifted for", "start": 367.65, "duration": 4.759}, {"text": "35 days now there were moments of hope and there were terrifying moments for instance", "start": 373.259, "duration": 6.35}, {"text": "they were hit by a storm that raged all through the night and they only had the", "start": 379.61, "duration": 4.14}, {"text": "phosphorescence on the waves to steer by so they could keep themselves bow on to the wave and avoid being swamped and", "start": 384.21, "duration": 6.529}, {"text": "That of course you imagined took a huge amount of energy out of them", "start": 391.71, "duration": 3.139}, {"text": "And so they were exhausted after that would see clouds on the horizon think yes", "start": 394.849, "duration": 4.0}, {"text": "Yes land that's head toward those clouds because if you've got a cloudless sky over a smooth", "start": 398.849, "duration": 4.89}, {"text": "seascape if you see a cloud that's a reasonable indicator of land because the the moisture holding water over the", "start": 403.96, "duration": 5.059}, {"text": "The warm sea is forced when it comes over the land a bit high and then it condenses", "start": 409.15, "duration": 4.549}, {"text": "in fact, perhaps forms a cloud and that's an indicator but no, sometimes it's just a cloud and", "start": 413.699, "duration": 4.38}, {"text": "Their hopes were dashed again and again", "start": 418.99, "duration": 2.0}, {"text": "but after 35 days, they sighted land yes act or land they could see land it was just over there, but unfortunately", "start": 421.779, "duration": 7.91}, {"text": "Renton was the only one who was strong enough to row the others all they could do was lie there and hope", "start": 430.719, "duration": 5.09}, {"text": "Presumably shouting the occasional bit of encouragement to Renton like \"Row harder!\"", "start": 436.21, "duration": 4.22}, {"text": "So he rowed towards the island", "start": 441.43, "duration": 2.239}, {"text": "but then darkness fell before he got there and it seems that their hopes had been dashed but then in the early", "start": 444.189, "duration": 5.75}, {"text": "Glimmer of dawn they're able to see that they hadn't drifted too far. And yes, they were still within sight of that land and Renton rowed.", "start": 450.04, "duration": 8.02}, {"text": "He rowed towards that land", "start": 458.06, "duration": 2.36}, {"text": "as hard as he possibly could but it was surrounded by reefs with crashing waves and even when he found gaps through", "start": 460.62, "duration": 5.72}, {"text": "The reefs they were strong offshore currents which were pushing him out and though he tried to row against the currents", "start": 466.349, "duration": 5.52}, {"text": "They started defeating him, but he gritted his teeth. And remember that he was British and rowed for all he was worth and", "start": 471.87, "duration": 6.419}, {"text": "still", "start": 478.87, "duration": 1.62}, {"text": "Failed to land. He was pushed back out to sea by the offshore currents and darkness fell again", "start": 480.49, "duration": 6.44}, {"text": "The next day he was extremely weak, but they were still within sight of land and in sight of what's this?", "start": 488.409, "duration": 7.07}, {"text": "now", "start": 496.419, "duration": 2.0}, {"text": "There were there are thousands and thousands of islands in the Pacific but there were three in this period that were given a very", "start": 498.61, "duration": 7.039}, {"text": "Wide berth by sailors, they were known about you. Don't go there because there are cannibals and headhunters and they'll just kill you", "start": 506.02, "duration": 6.709}, {"text": "But that's just three out of thousands", "start": 512.86, "duration": 2.119}, {"text": "This island was one of those three. War canoes came out", "start": 515.56, "duration": 4.94}, {"text": "Towards them they were too weak to do anything much", "start": 521.019, "duration": 2.299}, {"text": "The war canoes came round up to them the natives with black teeth Spears and clubs", "start": 523.319, "duration": 4.619}, {"text": "lept aboard and just ignore the men and started looting see what they had first and", "start": 528.13, "duration": 4.349}, {"text": "Then they towed the boat and its contents all the way to the land dragged it up onto the shore", "start": 532.699, "duration": 5.15}, {"text": "dumped the men onto the beach and", "start": 538.189, "duration": 2.0}, {"text": "I'm guessing to the disappointment of Renton and his colleagues", "start": 541.1, "duration": 2.719}, {"text": "smashed up the boat", "start": 544.37, "duration": 1.62}, {"text": "So Renton seeing them smash up the boat was and I'm putting thoughts into his mind here", "start": 545.99, "duration": 5.69}, {"text": "But I'm just imagining it thinking something along the lines of. Oh great. I'm not going to escape now", "start": 551.68, "duration": 4.859}, {"text": "Why did the natives smash up the boat?", "start": 556.91, "duration": 2.359}, {"text": "Because the boat was held together with nails and nails were made out of iron which was a miracle", "start": 559.79, "duration": 4.52}, {"text": "Material and this was their way of getting hold of some iron. Wow, it's held together with with nails guys", "start": 565.43, "duration": 5.149}, {"text": "Smash smash smash great we've got some nails", "start": 570.649, "duration": 2.239}, {"text": "Oh sorry did you want that boat? Bit late now", "start": 573.5, "duration": 2.359}, {"text": "Now the emaciated man was so emaciated that people shrank from them in horror who was something", "start": 576.319, "duration": 6.02}, {"text": "No, quite rather right about these guys. It seems that they were thinking", "start": 582.98, "duration": 3.229}, {"text": "but there were curiosities and people did feed the little tip bits and and just tried to see how they would behave and", "start": 586.97, "duration": 6.619}, {"text": "One man who was particularly nice to them and fed them more than most started in a private moment signaling to them", "start": 594.259, "duration": 7.7}, {"text": "Something like that", "start": 611.75, "duration": 1.19}, {"text": "I can't imagine that maybe the thumbs up", "start": 612.94, "duration": 1.83}, {"text": "It's not Universal probably isn't but he was trying to signal that if you stay here those people", "start": 614.77, "duration": 4.769}, {"text": "Will kill you whereas if you come with me in my canoe, maybe you'll live", "start": 619.82, "duration": 4.25}, {"text": "Renton thought that that was preferable to waiting around and seeing what would happen there", "start": 624.74, "duration": 3.95}, {"text": "So he got into the man's canoe and was paddled away", "start": 628.73, "duration": 3.17}, {"text": "Leaving the Americans", "start": 632.42, "duration": 1.8}, {"text": "behind and he was taken to a", "start": 634.22, "duration": 3.11}, {"text": "coastal village not very far away and", "start": 637.91, "duration": 2.059}, {"text": "He was introduced to his new life", "start": 640.52, "duration": 2.389}, {"text": "he have actually been bought he was now a slave of the big man, who'd bought them from the people who -", "start": 644.21, "duration": 7.25}, {"text": "salvaged him from the boat and", "start": 651.89, "duration": 2.269}, {"text": "This was to be his life", "start": 655.43, "duration": 2.0}, {"text": "For well, he didn't know how long and neither will you! Until I latter tell you", "start": 657.98, "duration": 4.34}, {"text": "It was a sort of a feudal society", "start": 663.32, "duration": 1.91}, {"text": "There were these big men as they were called sort of bit like chieftains, but it wasn't such an official hereditary title like that", "start": 665.23, "duration": 6.45}, {"text": "They were just powerful men who threw general success in their lives and", "start": 671.82, "duration": 5.22}, {"text": "a strong network of obligations got a lot of people supporting them and", "start": 677.84, "duration": 4.78}, {"text": "This big man. Kibou had a prize. He had Renton here the white man and all the skills and", "start": 683.93, "duration": 7.669}, {"text": "mystique and kudos that goes with that", "start": 692.15, "duration": 2.119}, {"text": "A good talented slave can be a very valuable thing and an exotic slave", "start": 695.53, "duration": 3.989}, {"text": "was the talk of the village, forest, bush whatever.", "start": 700.22, "duration": 4.04}, {"text": "I was gonna say talk of the town, but it wasn't really a town. There were off the coast lots of small artificial", "start": 704.4, "duration": 6.0}, {"text": "Islands and these were inhabited by the dispossessed: slaves, runaways people who are escaping from feuds and so forth", "start": 710.9, "duration": 8.6}, {"text": "and the minimum size was", "start": 719.5, "duration": 1.84}, {"text": "3 huts: 1 for the man, 1 for his family and one for his fishing kit which gives you some idea of", "start": 721.34, "duration": 5.18}, {"text": "the order of precedence and importance in this society", "start": 727.22, "duration": 4.24}, {"text": "The biggest dwellings were", "start": 731.46, "duration": 4.08}, {"text": "the biggest some", "start": 735.55, "duration": 1.92}, {"text": "built-up areas if you like we're about", "start": 737.47, "duration": 2.0}, {"text": "200 people within a stockade but quite often it was just three huts on the little island. Anyway, that was where he was and", "start": 739.93, "duration": 6.889}, {"text": "It was a feudal society it was slave owning and you had these obligations and they also went on raids", "start": 748.72, "duration": 5.9}, {"text": "Against the the bush people of the interior as well as rival villages along the coast", "start": 755.32, "duration": 4.49}, {"text": "It was quite a different world, he was brought into he was rather shy they were largely naked most of the time and", "start": 762.91, "duration": 5.929}, {"text": "He didn't like to take his his clothes off particularly on his trousers", "start": 770.26, "duration": 4.07}, {"text": "And in fact, they didn't get him to take his trousers off until they gave him his own pool to bathe in", "start": 774.33, "duration": 4.02}, {"text": "But he made himself", "start": 778.93, "duration": 1.44}, {"text": "Reasonably popular one of the things that he did a lot was play with the kids then I imagine that's always a a good way", "start": 780.37, "duration": 4.729}, {"text": "To ingratiate yourself with a new society play with the kids and he taught them football", "start": 785.1, "duration": 3.75}, {"text": "Would you believe? and in about six months he learnt the language", "start": 789.22, "duration": 3.679}, {"text": "Although I imagine that if you learn the language largely through talking to kids maybe you then sound like a", "start": 794.47, "duration": 4.7}, {"text": "Child when you speak which may be and into the charm", "start": 799.33, "duration": 3.23}, {"text": "Anyway, it seems that you won people over he ended up becoming the cook to about five local quite powerful men", "start": 802.75, "duration": 6.17}, {"text": "He didn't like being a cook though. He wanted to be something", "start": 808.92, "duration": 3.059}, {"text": "Bigger better and more useful than that", "start": 812.5, "duration": 2.06}, {"text": "Why were these islands quite so hostile", "start": 817.45, "duration": 3.44}, {"text": "Well, one of the reasons was things that happened 200 years ago the first people to get there in the 1500 about the 1560s were", "start": 821.65, "duration": 7.669}, {"text": "The Spanish and the Spanish were there to get gold! Because they'd heard rumors supposedly", "start": 829.32, "duration": 5.13}, {"text": "They were told by other Islanders who were perhaps on I'm trying to get rid of them", "start": 834.45, "duration": 2.82}, {"text": "Oh, yeah, there there's lots of gold in islands that are that way. Could you please go now?", "start": 837.27, "duration": 3.63}, {"text": "so they named them the Solomon Islands because of King Solomon King Solomon's Mines right because there's gold there so they believed", "start": 841.9, "duration": 7.4}, {"text": "wrongly", "start": 849.91, "duration": 1.68}, {"text": "But the idea was lodged in their heads and so Spanish sent out expeditions that were largely composed of soldiers", "start": 851.59, "duration": 5.72}, {"text": "They were gonna go out there", "start": 857.32, "duration": 1.62}, {"text": "Conquer an area, mine gold and get rich and bat aside anyone who tried to stop them. They introduced disease", "start": 858.94, "duration": 6.86}, {"text": "One of the reasons that sailors spread disease quite so effectively is that they were not exactly", "start": 866.67, "duration": 4.979}, {"text": "the elites of their society people who volunteer to go on these", "start": 871.899, "duration": 3.38}, {"text": "god-awful voyages and these horrendous cramped", "start": 875.86, "duration": 2.599}, {"text": "uncomfortable and just", "start": 879.61, "duration": 2.0}, {"text": "Just the ships of the period. We're just not pleasant places to be in and you'd be in there with no women for", "start": 882.009, "duration": 5.33}, {"text": "many many months years even", "start": 888.279, "duration": 2.059}, {"text": "and you're quite likely to die out there and there's no sun block, you know, so you could get terrible sunburn so", "start": 890.86, "duration": 5.899}, {"text": "They weren't exactly the elite to their societies. They were quite often the diseased dregs of society and", "start": 897.37, "duration": 4.729}, {"text": "So they became associated with death", "start": 903.13, "duration": 2.479}, {"text": "they killed people too to get the gold which wasn't there and they introduced disease and they had guns and so we're", "start": 905.709, "duration": 6.71}, {"text": "where the Spanish went went also death and then", "start": 912.519, "duration": 3.89}, {"text": "Considered but when the Spanish went back to Spain", "start": 917.8, "duration": 3.019}, {"text": "That their grasp of longitude was so bad that were on their maps that these islands were were replaced", "start": 921.85, "duration": 6.14}, {"text": "2,000 miles out", "start": 928.72, "duration": 1.34}, {"text": "That's a massive navigation error by the 1790s the British were turning up because by that stage they had the Harrison watch", "start": 930.06, "duration": 7.679}, {"text": "Now the Harrison watch was essentially a very accurate watch and it it it solved the the problem of longitude", "start": 938.35, "duration": 6.53}, {"text": "There was a price offered this is because big story on its own actually", "start": 946.269, "duration": 3.59}, {"text": "But essentially a lot of people were saying we should do it", "start": 949.899, "duration": 2.03}, {"text": "Well observe a observe asians of the sun or the planets and so forth", "start": 951.93, "duration": 3.209}, {"text": "But trying to do that from the deck of a moving ship is very difficult in any way", "start": 955.139, "duration": 3.179}, {"text": "Accurate watches turned out to be the solution to the longitude problem", "start": 958.87, "duration": 2.899}, {"text": "And so a british ship came along", "start": 963.43, "duration": 2.929}, {"text": "but that didn't go entirely well because", "start": 967.3, "duration": 2.0}, {"text": "well, the british ship got attacked by war canoes because they all remember the spanish and the british ship had lots of cannons on and", "start": 969.579, "duration": 5.84}, {"text": "So the british ship defended itself boom and you can imagine that's no great way to ingratiate yourself either and so they weren't tremendously in favor", "start": 975.42, "duration": 7.5}, {"text": "and then for the next thirty years it was whalers coming along and they again, whalers they're not the nicest", "start": 982.92, "duration": 5.32}, {"text": "Best people to encounter in the world peep, the sort of people who who end up on whaling ships are not the elite", "start": 988.87, "duration": 6.919}, {"text": "Educated well-meaning classes generally there again. They're the dregs of society who end up on the", "start": 996.639, "duration": 5.41}, {"text": "Whaling ships so", "start": 1003.95, "duration": 2.0}, {"text": "That largely explains the degree of hostility to the white man now", "start": 1006.02, "duration": 4.339}, {"text": "This feudal society. It would their black tit by the way the black teeth", "start": 1011.54, "duration": 3.889}, {"text": "The natives had black teeth because they went to an awful lot of", "start": 1016.58, "duration": 3.169}, {"text": "Effort to get black teeth, it wasn't that their their teeth had rotted because they didn't look after him", "start": 1020.45, "duration": 4.1}, {"text": "No", "start": 1024.55, "duration": 0.12}, {"text": "He actually mixed up a paste and put it on the teeth", "start": 1024.67, "duration": 3.479}, {"text": "And then he had to they have to have their mouths propped open", "start": 1028.15, "duration": 2.91}, {"text": "There's stuff to dry on their teeth, but like three or four days", "start": 1031.06, "duration": 3.269}, {"text": "To stain the teeth black. I have no reason to believe that renton stained his teeth black so he would've been an exception", "start": 1035.42, "duration": 6.289}, {"text": "It was a place with that guard owls that were they were trained to hoot if enemies were sighted", "start": 1043.28, "duration": 7.88}, {"text": "and", "start": 1051.68, "duration": 1.05}, {"text": "They had animism. They were particularly into spirits the nanu then your nanu was a spirit", "start": 1052.73, "duration": 6.92}, {"text": "Oh, I didn't say when the men were brought ashore in the first place. They slept for a full day and a full night and", "start": 1059.65, "duration": 7.109}, {"text": "One possible explanation that enters my head is something else I learned about these people", "start": 1067.64, "duration": 3.8}, {"text": "which is that they they believe that you should never shake someone awake because", "start": 1071.6, "duration": 4.04}, {"text": "The Nano your spirit your soul if you like that's in you it leaves your body", "start": 1076.04, "duration": 4.729}, {"text": "When you're asleep because that's what dreams are", "start": 1081.35, "duration": 2.27}, {"text": "So if someone were to shake you awake", "start": 1084.5, "duration": 2.0}, {"text": "They'd wake your body when your spirit was away and the two would be separated and that would be a disaster", "start": 1086.93, "duration": 4.729}, {"text": "So instead what you do is you speak the person's name and if they don't stir", "start": 1092.09, "duration": 3.859}, {"text": "You just leave them", "start": 1097.19, "duration": 1.16}, {"text": "But if they do stir that's because the nanu heard its name and returned to the body and then you wake up safely", "start": 1098.35, "duration": 5.729}, {"text": "But of course the natives wouldn't have known these renton or his colleagues names so they just left them there perhaps that's the reason", "start": 1104.75, "duration": 6.92}, {"text": "Or maybe it was just laziness anyway", "start": 1112.61, "duration": 2.119}, {"text": "So there's Renton and he's trying to make himself useful", "start": 1116.42, "duration": 3.289}, {"text": "in this in this strange world and and get used to", "start": 1120.41, "duration": 3.049}, {"text": "All the customs and there are an awful lot of custom. There is a correct way of doing absolutely", "start": 1123.86, "duration": 4.94}, {"text": "everything how do you hold a spear in the", "start": 1129.44, "duration": 2.24}, {"text": "Of a superior and inferior family member someone who lent you that spear and so forth. There's a particular way of doing absolutely everything", "start": 1132.18, "duration": 6.599}, {"text": "In some ways though. It was quite a free society", "start": 1139.84, "duration": 2.0}, {"text": "They believed that there was a God and that the God created the world and the God created", "start": 1142.81, "duration": 4.01}, {"text": "The etiquette the rituals the way of doing everything and that thank God then", "start": 1147.28, "duration": 3.41}, {"text": "satback goes in job was done", "start": 1151.45, "duration": 2.029}, {"text": "He didn't need people to serve him well worship", "start": 1154.6, "duration": 3.17}, {"text": "He didn't need worshipers because he's a God and", "start": 1158.65, "duration": 2.0}, {"text": "didn't want to serve Him because that's what dead people do the spirits of the dead serve the God that the ring don't I mean", "start": 1160.69, "duration": 4.819}, {"text": "We don't do any where is he? We can't see him anywhere. There's nothing. No, he we're not serving him", "start": 1165.67, "duration": 4.069}, {"text": "So we're free to do whatever we like really", "start": 1170.14, "duration": 2.0}, {"text": "They were very friendly these people", "start": 1172.69, "duration": 2.299}, {"text": "However, they were very friendly because they lived in the world with a constant fear of", "start": 1175.72, "duration": 5.239}, {"text": "savage retribution", "start": 1181.63, "duration": 2.0}, {"text": "Whenever they lost hairs", "start": 1184.54, "duration": 1.67}, {"text": "Or they cliped their nails or they excreted they would be very careful", "start": 1186.21, "duration": 4.38}, {"text": "To gather up everything and make sure that nobody else got hold of it they in every house", "start": 1190.87, "duration": 5.51}, {"text": "There was an incinerator for burning nail clippings and hair and poo and just everything like poo apparently was was particularly", "start": 1196.38, "duration": 6.089}, {"text": "Important you don't want someone to get hold of a bit of you not particularly a poo because what they could do to curse you", "start": 1203.08, "duration": 5.899}, {"text": "Was take a bit of you to one of their ancestral heads", "start": 1209.41, "duration": 5.059}, {"text": "Speak your name and get the ancestral head to curse you and then something bad would happen to you and everything bad that", "start": 1214.93, "duration": 7.88}, {"text": "happened to anyone", "start": 1223.15, "duration": 2.0}, {"text": "Absolutely regardless was somebody's fault if someone had if a coconut landed on someone's head", "start": 1225.28, "duration": 5.839}, {"text": "Somebody was responsible and someone will get blamed", "start": 1231.67, "duration": 3.41}, {"text": "and", "start": 1235.9, "duration": 1.35}, {"text": "It seems that their believes the natives beliefs in these things were so powerful that", "start": 1237.25, "duration": 5.18}, {"text": "if someone had been", "start": 1242.83, "duration": 1.44}, {"text": "Named in a ceremony as guilty for some reason or something they would", "start": 1244.27, "duration": 3.56}, {"text": "Just collapse with shame and perhaps not eat and starve and with her way to death", "start": 1247.9, "duration": 4.369}, {"text": "Rented himself wrote a memoir and in the memoir. He's a bit contradictory", "start": 1252.64, "duration": 4.19}, {"text": "sometimes he says that I've don't it is just loaded were suspicious and superstitious nonsense, but he also", "start": 1256.84, "duration": 5.32}, {"text": "recorded having seen", "start": 1263.16, "duration": 1.8}, {"text": "Lights leave a dead body and go into one of the huts and then he heard screams coming from that house", "start": 1264.96, "duration": 6.229}, {"text": "So why did he believe the star war didn t difficult to say but why would you want?", "start": 1271.19, "duration": 5.219}, {"text": "To be a headhunter. Why would you want these ancestral heads? Well,", "start": 1277.2, "duration": 3.109}, {"text": "Because the head was the seat of Mana. It's a fairly common oceanic word. Which means", "start": 1280.89, "duration": 6.32}, {"text": "that the power if you like of your of your soul of your life essence or whatever and it resided in the head and if", "start": 1287.88, "duration": 5.45}, {"text": "You could kill people and take their heads", "start": 1293.33, "duration": 2.0}, {"text": "Then you could give your chieftain that that head and achieved in loads of heads would have all the manor of all those defeated", "start": 1295.41, "duration": 6.469}, {"text": "Enemies and would become so much more powerful as a result", "start": 1302.79, "duration": 2.959}, {"text": "People started confiding in Renton", "start": 1308.22, "duration": 3.109}, {"text": "He seemed to be the go-to man when if you had something to admit to why did they confide in Renton?", "start": 1311.33, "duration": 5.849}, {"text": "Because he had no ancestral head", "start": 1318.06, "duration": 2.75}, {"text": "He was safe to confide in because he couldn't curse you. He had no power. He had no Mana", "start": 1321.54, "duration": 5.0}, {"text": "He had no heads you see so it was safe to tell him stuff", "start": 1326.54, "duration": 4.17}, {"text": "So that was another way perhaps that he made himself popular. He was the he was the guy to tell your secrets to", "start": 1330.81, "duration": 6.14}, {"text": "And he couldn't he couldn't tell anything else because well you didn't speak the languages of the other islands. He only speaks ours so", "start": 1337.74, "duration": 7.55}, {"text": "Renton made himself pretty useful and", "start": 1347.01, "duration": 2.239}, {"text": "he noticed that", "start": 1350.28, "duration": 2.0}, {"text": "We noted a number of things", "start": 1353.07, "duration": 2.0}, {"text": "He noticed for instance that there were", "start": 1355.14, "duration": 2.54}, {"text": "some really quite good mortise and tenon joints and dovetail joints and drilled holes with pegs in in the", "start": 1358.08, "duration": 6.26}, {"text": "Carpentry in their houses where he lived but in other villages there there it was just lashed together with with ropes", "start": 1364.5, "duration": 6.08}, {"text": "Why was that then eventually he found out?", "start": 1371.01, "duration": 3.05}, {"text": "40 years before him another white man", "start": 1374.67, "duration": 2.839}, {"text": "Had been shipwrecked there and had ended up becoming a slave like Renton in this same village and he had great", "start": 1377.88, "duration": 6.47}, {"text": "Carpentry skills and that explained all this carpentry", "start": 1384.63, "duration": 3.53}, {"text": "He had revolutionised carpentry in the region and made quite a name for himself and so much so that other villages thought", "start": 1388.16, "duration": 6.56}, {"text": "Well, actually he's quite like this guy because he seems pretty ace", "start": 1394.72, "duration": 3.719}, {"text": "And another village made a better offer come to us and we won't treat you like a slave", "start": 1399.02, "duration": 4.849}, {"text": "We'll give you better food and you won't be slave. It'll be great. Come to us think he got a better offer", "start": 1403.87, "duration": 4.35}, {"text": "So he thought great. I got a better offer. I'm I'm making my way in the world. Okay fair enough", "start": 1408.71, "duration": 3.829}, {"text": "The trouble was that that led to a huge amount of loss of face for the village, but they came up with a solution", "start": 1413.57, "duration": 7.28}, {"text": "They ambushed him and killed him. There you go. So they didn't lose face. They didn't", "start": 1421.37, "duration": 5.75}, {"text": "Have the carpenter anymore, but nobody else did either so that was fair", "start": 1427.79, "duration": 3.619}, {"text": "I'm learning this you can imagine that Renton was a little concerned. Ah, so I", "start": 1432.65, "duration": 4.969}, {"text": "Can't even escape", "start": 1438.2, "duration": 2.0}, {"text": "Through you know through making my way in the world in the normal way", "start": 1440.48, "duration": 3.08}, {"text": "I can't I can't turn there's no sort of social advancement Here. I am I'm more stuck than even I previously thought", "start": 1443.56, "duration": 7.049}, {"text": "Now they were", "start": 1452.24, "duration": 2.0}, {"text": "Raiders these people they would go on on raids in", "start": 1454.25, "duration": 2.9}, {"text": "war canoes typically are holding about 40 men and", "start": 1457.79, "duration": 3.02}, {"text": "The preparations for these were pretty we're pretty nasty. One of the things they do is sacrifice", "start": 1461.78, "duration": 5.27}, {"text": "someone and put them in an uncorked canoe and wait for the", "start": 1467.6, "duration": 3.979}, {"text": "body to to ooze", "start": 1472.01, "duration": 1.68}, {"text": "Various oozing and they these would drip out of the canoe and be caught in a train that they would then make", "start": 1473.69, "duration": 6.289}, {"text": "arrowheads which were designed specifically to break off in a wound and they would dip these in the the ooze", "start": 1480.38, "duration": 6.08}, {"text": "Which would then be this was biological warfare? You can get tetanus and all sorts of nasties off that", "start": 1486.53, "duration": 5.119}, {"text": "And this was part of their preparation for going", "start": 1492.2, "duration": 3.709}, {"text": "To war now. He helped that his rent and helped in the making of one of the canoes. It took him two months", "start": 1497.06, "duration": 5.78}, {"text": "He didn't actually know what the canoe was for", "start": 1502.94, "duration": 2.419}, {"text": "But he was pretty alarmed when it came to inaugurate the the launching of this canoe", "start": 1506.21, "duration": 7.039}, {"text": "There was a big feast", "start": 1513.5, "duration": 1.89}, {"text": "Okay", "start": 1515.39, "duration": 0.5}, {"text": "Nothing too alarming so far and then everyone gathered and a man dressed in sort of fish costume", "start": 1515.89, "duration": 7.219}, {"text": "Appeared and everyone showed fear and it didn't look like it was mocking the ritual fear. This look like", "start": 1523.6, "duration": 5.959}, {"text": "actual fear of this guy", "start": 1530.17, "duration": 1.49}, {"text": "they shrank battey back in terror, but they also watched fascinated as he walked around the press of people and then he eventually", "start": 1531.66, "duration": 7.26}, {"text": "Picked out a slave girl who was then immediately set upon and killed by the crowd", "start": 1539.8, "duration": 5.3}, {"text": "She was the sacrifice for this war canoe and Renton", "start": 1545.56, "duration": 4.969}, {"text": "It is reasonable to imagine thought okay, right. These people are just nuts. I've got to get out of here, but how", "start": 1551.95, "duration": 7.25}, {"text": "They won't allow me to go", "start": 1560.08, "duration": 2.0}, {"text": "But he saw an opportunity because there was a big feast that night", "start": 1563.5, "duration": 3.619}, {"text": "For the the ceremony of the launching of the crew of the canoe and at that time you thought right", "start": 1567.58, "duration": 4.909}, {"text": "like if I if I steal a little fishing canoe I can put some stuff aboard it and paddle away to", "start": 1572.68, "duration": 6.049}, {"text": "Somewhere else. There must be a trading station", "start": 1580.03, "duration": 2.81}, {"text": "There must be a trading station because a while ago I was on a logging expedition and someone put a steel axe into my hand", "start": 1582.84, "duration": 7.529}, {"text": "Where the hell did that come from? They must have some trading connection with other islands", "start": 1591.4, "duration": 5.66}, {"text": "There must be a trading post somewhere that trades indirectly with this place if I can find that", "start": 1597.06, "duration": 5.189}, {"text": "Trading post it can't be very far away then. Maybe I'll be able to", "start": 1602.56, "duration": 4.099}, {"text": "Wait there until the ship comes along and I don't know I'll work at that when I get there", "start": 1607.33, "duration": 3.709}, {"text": "But I need to get to that sort of place", "start": 1611.04, "duration": 2.0}, {"text": "so we thought right what do I put? So he put a club and six Spears and some food and", "start": 1613.42, "duration": 5.449}, {"text": "Didn't have much time. He packed his little canoe and set off into the darkness", "start": 1619.09, "duration": 4.639}, {"text": "now he knew", "start": 1624.52, "duration": 2.0}, {"text": "Roughly where to go to get this trading post", "start": 1627.13, "duration": 2.599}, {"text": "But he also knew that he would have to get past an enemy rival village", "start": 1630.61, "duration": 4.73}, {"text": "An enemy rival village, how is he going to do this? Well, he was gonna have to paddle very very hard", "start": 1637.0, "duration": 4.1}, {"text": "You'd have to get all the way past it at night. You might think well, then we just go out to sea", "start": 1641.1, "duration": 4.289}, {"text": "well, you don't want to go out straight out to sea because", "start": 1645.39, "duration": 2.0}, {"text": "You have no idea where you are. Once this is at night. Don't forget", "start": 1647.86, "duration": 3.38}, {"text": "You'll just get lost", "start": 1652.27, "duration": 2.0}, {"text": "That's not gonna work besides. There's a reef that's almost impenetrable that goes around the main island", "start": 1654.33, "duration": 4.919}, {"text": "There's a channel only about 100 yards wide. He's gonna have to stick to that", "start": 1659.47, "duration": 3.439}, {"text": "No, he's just gonna have to paddle and get past that rival", "start": 1663.12, "duration": 2.55}, {"text": "Village and then maybe find a break in the reef and then break out in daylight", "start": 1667.75, "duration": 3.83}, {"text": "To the other island where there is all going. Well this trading post", "start": 1672.1, "duration": 3.739}, {"text": "So he paddled all night, but when the light came up", "start": 1676.39, "duration": 3.5}, {"text": "He found that he was short of his target ahead of him still was the enemy village. How was he gonna get past?", "start": 1681.25, "duration": 6.41}, {"text": "Well, you thought maybe I just brought it out. I mean I've got long hair now", "start": 1688.9, "duration": 3.65}, {"text": "I'm very tanned from a distance I could pass for a native", "start": 1692.55, "duration": 2.28}, {"text": "I'm just a bloke in a canoe", "start": 1694.9, "duration": 1.79}, {"text": "Maybe if I just you know, just paddle saunter by they're just going about their normal activities in the morning", "start": 1696.69, "duration": 5.429}, {"text": "They wouldn't have any particular reason to be looking out for me", "start": 1702.12, "duration": 2.369}, {"text": "I think I could probably get away with it and it's my best chance of my carving or anything else to do and I can't", "start": 1704.49, "duration": 4.02}, {"text": "go back, I can't go back because they kill people for just even changing jobs, but the idea of", "start": 1708.51, "duration": 5.04}, {"text": "Leaving the village without permission when I'm a slave", "start": 1714.67, "duration": 2.449}, {"text": "And I just stolen someone's boat and all this kit. No, there's no they will definitely kill me if I go back", "start": 1717.67, "duration": 6.02}, {"text": "So there's only forward now", "start": 1723.69, "duration": 2.0}, {"text": "okay, so", "start": 1726.28, "duration": 1.77}, {"text": "he tries to do he tries to", "start": 1728.05, "duration": 2.0}, {"text": "do", "start": 1731.08, "duration": 2.0}, {"text": "It seems to be going well at first but then he loses his nerve but he sees a mangrove mangrove swamp", "start": 1733.84, "duration": 4.819}, {"text": "Did I hide in there?", "start": 1738.66, "duration": 1.21}, {"text": "Maybe no one saw me", "start": 1739.87, "duration": 1.31}, {"text": "I can wait in there and then", "start": 1741.18, "duration": 1.42}, {"text": "Maybe I could wait all day and strike out tomorrow and give it another go right so I'll do that, but no he heard", "start": 1742.6, "duration": 5.239}, {"text": "The blast of a war conch and war canoes being launched that was quick", "start": 1748.51, "duration": 4.97}, {"text": "He thought and he soon heard voices shouting into the mangrove swamp come out or we'll come in and kill you", "start": 1753.51, "duration": 7.2}, {"text": "so", "start": 1761.26, "duration": 2.0}, {"text": "He came out and", "start": 1763.57, "duration": 1.8}, {"text": "they dragged him out of his little canoe and they took him to the beach and they threw him down onto the beach and they", "start": 1765.37, "duration": 7.55}, {"text": "Clubbed him", "start": 1773.14, "duration": 2.0}, {"text": "Somewhere later", "start": 1778.9, "duration": 2.0}, {"text": "He awoke to find himself lying on the beach very", "start": 1782.48, "duration": 3.349}, {"text": "Thoroughly tied up at the feet of a lot of natives who were very heavily armed who were talking about", "start": 1786.02, "duration": 6.26}, {"text": "Killing him", "start": 1793.28, "duration": 1.98}, {"text": "This was not a good moment, but it's a great moment to break for like the message of", "start": 1795.26, "duration": 5.509}, {"text": "my sponsor which is audible now all the more just in case you don't know is a massive website which sells", "start": 1802.01, "duration": 7.009}, {"text": "Audiobooks and if you were to be so so cunning us to type in", "start": 1809.75, "duration": 4.25}, {"text": "Www.a or text linda beige - 500 - 500 then", "start": 1817.31, "duration": 4.13}, {"text": "You could take advantage of an offer they have which is a 30-day free trial and one free book free book", "start": 1821.99, "duration": 6.109}, {"text": "That's yours to own forever indeed. All the books that you get through and through audible", "start": 1828.1, "duration": 4.439}, {"text": "Are yours forever to keep it's like buying a book. It's yours. It's not a streaming service", "start": 1832.54, "duration": 3.63}, {"text": "It's not that you're not renting", "start": 1837.02, "duration": 1.38}, {"text": "It's that you own the stuff that you buy and whilst you remember you get 30% off", "start": 1838.4, "duration": 5.66}, {"text": "purchase of other books and and", "start": 1844.55, "duration": 2.18}, {"text": "There's some Cajun Elfriede anyway", "start": 1847.28, "duration": 2.0}, {"text": "You can get one free book if you you go to", "start": 1849.8, "duration": 2.51}, {"text": "Www.google.com", "start": 1854.72, "duration": 1.56}, {"text": "stroke Lindy bait or text 500 Linda beige - 500", "start": 1856.28, "duration": 3.71}, {"text": "501 book there", "start": 1861.08, "duration": 1.61}, {"text": "I notice which caught my eyes mutiny on the bounty at Paradise in Chains actually", "start": 1862.69, "duration": 5.28}, {"text": "sir paradise in changes the main can come title mutiny on the bounty and the founding of", "start": 1867.97, "duration": 5.16}, {"text": "Australia", "start": 1873.92, "duration": 1.2}, {"text": "Now you've probably heard of mutiny on the bounty and you've probably heard a lot of rubbish that isn't true", "start": 1875.12, "duration": 5.449}, {"text": "They keep making films about it that historically very inaccurate", "start": 1880.57, "duration": 2.489}, {"text": "they'll always tell you that Fletcher Christian was just such a hero and Captain Bligh was nothing but a but a", "start": 1883.06, "duration": 5.19}, {"text": "puffed up villain there was in fact a Fletcher Christian if", "start": 1888.38, "duration": 3.979}, {"text": "Historical evidence is to be used instead", "start": 1893.06, "duration": 2.15}, {"text": "It was a bit of a git actually and Captain Bligh was a very long serving", "start": 1895.21, "duration": 4.349}, {"text": "Successful sea captain who couldn't possibly have had the very long", "start": 1899.81, "duration": 3.29}, {"text": "And successful career that he had and earned the respect of so many people that he did if he'd been just a puffed up villain", "start": 1903.47, "duration": 6.439}, {"text": "Anyway, so you could listen to that book and learn far more about new the bounty bounty and all that goes with it", "start": 1910.52, "duration": 6.65}, {"text": "and the founding of Australia", "start": 1917.17, "duration": 1.32}, {"text": "Which will also be a little bit more relevant", "start": 1918.49, "duration": 2.0}, {"text": "When you listen to the some of the stuff that I got to say in the moment", "start": 1920.72, "duration": 2.63}, {"text": "So there you go now back to the story now there it there's a man", "start": 1923.35, "duration": 4.139}, {"text": "lying on the beach", "start": 1928.58, "duration": 1.71}, {"text": "thinking", "start": 1930.29, "duration": 1.53}, {"text": "Well, this is it. Then I just I'm wondering exactly what method they're going to have of killing me", "start": 1931.82, "duration": 5.689}, {"text": "But then he heard that they were", "start": 1937.61, "duration": 2.0}, {"text": "Also discussing an alternative to killing him which was ransoming him and he heard more canoes turned up. Oh, maybe I'm", "start": 1940.13, "duration": 7.94}, {"text": "Valuable enough that they're gonna try to sell me to somebody else. Maybe there was a parley happening in canoes offshore and", "start": 1948.68, "duration": 6.739}, {"text": "You know", "start": 1956.33, "duration": 0.56}, {"text": "There was just a little glimmer of hope maybe", "start": 1956.89, "duration": 2.16}, {"text": "someone else will come along and take me away from all this because otherwise I'm certainly dead aren't I well he was grabbed and", "start": 1959.39, "duration": 6.68}, {"text": "unceremoniously dumped at the feet of", "start": 1967.1, "duration": 2.0}, {"text": "Kapu yes", "start": 1970.64, "duration": 2.0}, {"text": "the big man", "start": 1973.04, "duration": 1.65}, {"text": "From the village who owned him already", "start": 1974.69, "duration": 2.329}, {"text": "Yeah, the man he was trying to escape from he's dumped at his feet and kibou does not look happy", "start": 1978.02, "duration": 7.369}, {"text": "He is loaded onto a canoe and", "start": 1987.08, "duration": 2.299}, {"text": "Paddled away in the silence", "start": 1990.35, "duration": 2.059}, {"text": "It's a long paddle back to the village", "start": 1993.2, "duration": 3.079}, {"text": "the silence was", "start": 1997.07, "duration": 2.0}, {"text": "terrible and yet", "start": 1999.44, "duration": 2.0}, {"text": "punctuated by", "start": 2001.75, "duration": 2.0}, {"text": "Giggles did he just hear a giggle then? No, that wasn't a giggle more silence", "start": 2003.97, "duration": 5.269}, {"text": "That was definitely a giggle that time", "start": 2010.0, "duration": 2.0}, {"text": "But this went unexplained. They took him all the way back to the village and he thought huh, right? Well, I can't escape now", "start": 2012.76, "duration": 7.01}, {"text": "so again, I'm just gonna be killed by different people and", "start": 2021.01, "duration": 3.29}, {"text": "He was put on his feet in front of", "start": 2025.27, "duration": 2.69}, {"text": "everyone who was smiling and laughing and cheering and waving and so forth and", "start": 2028.39, "duration": 6.32}, {"text": "Kapoor looked rather well have anything happy and", "start": 2035.38, "duration": 3.44}, {"text": "He was freed of his bonds and kibou then made a speech saying that", "start": 2039.4, "duration": 5.719}, {"text": "They had built this war canoe to go on a raid against that other village", "start": 2046.63, "duration": 4.45}, {"text": "which of course was why the village was on high-alert because it's a bit of a dead giveaways and if you", "start": 2051.87, "duration": 4.549}, {"text": "Do a massive ceremony saying we're about to go raiding and you're the next bit anyway", "start": 2056.61, "duration": 3.589}, {"text": "So that's one of the reasons Renton was was spotted so quickly", "start": 2060.419, "duration": 2.9}, {"text": "and I've just been told that they", "start": 2064.23, "duration": 2.959}, {"text": "Thought that he just found out yesterday", "start": 2068.52, "duration": 2.6}, {"text": "Yesterday he found out that the three white men that were left back at that other village all died", "start": 2072.12, "duration": 5.989}, {"text": "We of course, we're going to toughen him up toughen him up by by sending him on a RAID with us", "start": 2079.11, "duration": 5.689}, {"text": "He was going to come in our canoe, but that wasn't enough for our Jack Renton", "start": 2084.8, "duration": 4.949}, {"text": "Oh, no", "start": 2089.929, "duration": 0.451}, {"text": "No on learning that his three colleagues had been killed he set off for vengeance on his own", "start": 2090.38, "duration": 7.379}, {"text": "Yes", "start": 2098.04, "duration": 0.51}, {"text": "He took six Spears and a club and he canoed straight to their village", "start": 2098.55, "duration": 5.239}, {"text": "Even the night before we were going to raid it. He had to get there first. This man is a hero", "start": 2104.01, "duration": 7.37}, {"text": "Close shave! Yeah close shave!", "start": 2114.09, "duration": 2.119}, {"text": "so he was now welcomed back into the bosom of", "start": 2116.94, "duration": 3.229}, {"text": "of the village he was still a slave but now he was a hero slave with people patting you on the back and", "start": 2120.87, "duration": 6.229}, {"text": "Showing him just so much more respect", "start": 2127.56, "duration": 2.179}, {"text": "Wow", "start": 2129.83, "duration": 0.61}, {"text": "what a guy he was going to take vengeance for three people all on his own that gets an entire village for", "start": 2130.44, "duration": 5.78}, {"text": "This man Renton is clearly someone to be reckoned with maybe he'd make a good head hunter", "start": 2136.59, "duration": 4.429}, {"text": "Kibou had decided that he had no intention of paying the ransom that he had promised to pay for", "start": 2142.56, "duration": 6.619}, {"text": "For Renton instead. He was going to raid that village because you know what that village is said to him. Take this hothead back", "start": 2149.37, "duration": 7.159}, {"text": "They'd said and and teach him how to fight. Okay?", "start": 2156.53, "duration": 2.969}, {"text": "Let's teach him how to fight now", "start": 2160.11, "duration": 2.0}, {"text": "Renton was not terribly skilled, but he was big and muscular and so it was thought that he'd make a good Spearman", "start": 2162.66, "duration": 5.78}, {"text": "Essentially they had two troop types spearmen and archers", "start": 2169.02, "duration": 2.929}, {"text": "the artists incidentally had no fletchings on their arrows which I find really odd because you'd think that's a really easy thing to event and", "start": 2172.71, "duration": 7.52}, {"text": "You have to you know, one person would have to workout fletchings", "start": 2180.57, "duration": 3.659}, {"text": "You think that the the idea if you stick fletchings on your arrows?", "start": 2184.23, "duration": 3.06}, {"text": "would spread like wildfire really quickly and then everyone would have fletchings on their arrows, but no", "start": 2187.69, "duration": 3.769}, {"text": "Even though it was their prime missile with but they had no fletchings on their hours", "start": 2191.98, "duration": 2.93}, {"text": "so their arrows weren't really very accurate and I saw a documentary a few years ago about very similar tribesmen from Vanuatu and", "start": 2194.91, "duration": 6.359}, {"text": "They had no fletchings on their arrows today", "start": 2201.58, "duration": 2.3}, {"text": "They had no fletchings on their arrow and they were taken to an archery club in Britain and show if you stick fletchings on the arrow", "start": 2203.88, "duration": 5.579}, {"text": "They go straight and they saw this and oh, yeah, they go straight", "start": 2209.46, "duration": 2.76}, {"text": "I mean you'd think that but anyway, they had no fletchings on their arrows", "start": 2212.22, "duration": 3.63}, {"text": "the spearmen were armed with a few Spears a club and a four foot rectangular shield in the left hand and", "start": 2216.31, "duration": 5.899}, {"text": "To those those are the two troop types and they practiced they rehearsed for battle they had", "start": 2222.52, "duration": 5.81}, {"text": "Cork tipped spears and cork tip arrows and so forth for for mock battles", "start": 2229.06, "duration": 4.37}, {"text": "but these were this was battle practice which struck Renton there's a little bit odd because he'd never actually", "start": 2233.43, "duration": 4.559}, {"text": "Known him all the stories. He'd heard he'd never actually heard of a pitched battle", "start": 2238.27, "duration": 4.489}, {"text": "It raids were almost always orchestrated so that the attackers would attack in overwhelming numbers or it would be an ambush or something", "start": 2242.76, "duration": 7.35}, {"text": "There were reports by other anthropologists in these same islands of seeing", "start": 2250.9, "duration": 3.469}, {"text": "small", "start": 2254.77, "duration": 0.6}, {"text": "sleeping villages being attacked by vast numbers of troops who were just go in and clubbed all the men and steal all the women well,", "start": 2255.37, "duration": 5.78}, {"text": "anyway, they trained for battle and", "start": 2261.79, "duration": 2.57}, {"text": "He was put into a canoe given three bodyguards to make absolutely sure that he lived because they couldn't they couldn't", "start": 2264.88, "duration": 7.669}, {"text": "live with the loss of face if their", "start": 2273.01, "duration": 2.51}, {"text": "Starman went down in this raid that was being put on for his benefit and in vengeance", "start": 2275.89, "duration": 4.909}, {"text": "But for his friends because this guy's one of us now", "start": 2280.8, "duration": 2.76}, {"text": "So if he's one of us those guys, they're sort of one of us. So we owe in vengeance for them", "start": 2283.56, "duration": 5.489}, {"text": "The group avenges the individual let's do this", "start": 2289.05, "duration": 2.429}, {"text": "So off they went", "start": 2293.59, "duration": 2.0}, {"text": "Three war canoes of 40 men", "start": 2295.75, "duration": 2.3}, {"text": "Lots of men paddling and one steersman in each one when they got there six novices were left behind to guard the canoes", "start": 2299.11, "duration": 6.619}, {"text": "that's presumably two per canoe a twenty men were given the the task of stealing the enemy's canoes thus cutting off their retreat and the", "start": 2305.73, "duration": 7.53}, {"text": "just", "start": 2313.509, "duration": 1.0}, {"text": "Killing an in they went and Renton was with with the the killing group", "start": 2314.509, "duration": 4.04}, {"text": "The accounts of this raid say that one man held 20 of theirs at bay just with an aggressive", "start": 2320.119, "duration": 6.949}, {"text": "Glare, which actually I find perfectly believable", "start": 2327.769, "duration": 2.0}, {"text": "I can believe that that that that would work. It didn't work with very long", "start": 2330.259, "duration": 3.53}, {"text": "Someone sneaked up behind him and that was the end of him", "start": 2333.789, "duration": 2.429}, {"text": "But for a while he held 20 back just by looking at them in a come on then", "start": 2336.219, "duration": 4.05}, {"text": "\"I know something you don't!\" sort of way", "start": 2340.269, "duration": 2.0}, {"text": "the raid was very successful and", "start": 2343.279, "duration": 2.33}, {"text": "They got their loot and they went they went back home having shown that lot given them a lesson. These were not wars of conquest", "start": 2346.549, "duration": 7.52}, {"text": "These were Wars of vengeance generally", "start": 2354.859, "duration": 2.449}, {"text": "There was a constant low-level war of", "start": 2357.309, "duration": 2.31}, {"text": "feuds and counter feuds going on and", "start": 2360.079, "duration": 2.0}, {"text": "These would drag on for ages until the amount of killing was about equal on the two sides", "start": 2362.359, "duration": 4.129}, {"text": "And then that was when Wars tended to to fizzle out", "start": 2366.489, "duration": 2.699}, {"text": "So", "start": 2372.049, "duration": 1.47}, {"text": "The raid was successful and so now hooray he's he's he's the hero of the hour", "start": 2373.519, "duration": 5.51}, {"text": "and", "start": 2379.669, "duration": 1.23}, {"text": "a", "start": 2380.899, "duration": 2.0}, {"text": "Letter arrived a letter arrived for Renton it had taken many months to get to him nobody in the area", "start": 2382.939, "duration": 7.43}, {"text": "Read or even really understood what writing was or even most of them believed in in writing", "start": 2391.009, "duration": 5.929}, {"text": "Renton would tell stories about his his life in the bigger wider world and almost nobody believed him", "start": 2397.639, "duration": 6.35}, {"text": "With one exception he had a chaperone", "start": 2404.419, "duration": 2.18}, {"text": "Called quest Sula and the chaperone did sort of believe him", "start": 2407.479, "duration": 3.919}, {"text": "Although not completely because the chaperone interestingly thought \"Okay. If this is all true then, how do you make iron?\"", "start": 2411.4, "duration": 6.9}, {"text": "He couldn't understand", "start": 2418.3, "duration": 1.22}, {"text": "Why don't you tell us how you make iron because the world they were from was a world in which absolutely everything", "start": 2419.529, "duration": 5.699}, {"text": "That was made", "start": 2425.569, "duration": 1.38}, {"text": "people knew how to make if you had a bow people knew how to make bows spears people knew how to make suppose Spears huts", "start": 2426.949, "duration": 4.969}, {"text": "people knew how to make huts and", "start": 2431.919, "duration": 2.0}, {"text": "so if he was from the world of iron", "start": 2434.059, "duration": 1.67}, {"text": "He would know how to make iron because people know how to make everything", "start": 2435.729, "duration": 2.52}, {"text": "don't they the concept of there being things in the world that you didn't know how to make", "start": 2438.249, "duration": 4.139}, {"text": "But you just accepted that somehow somebody else made them and then you bought them off the was alien", "start": 2442.489, "duration": 5.0}, {"text": "They also had some strange ideas about about the white man. For instance. Why is he trading?", "start": 2448.28, "duration": 5.179}, {"text": "Why did he come here in these ships and trade? Well, the explanation is quite simple. He has no land of his own", "start": 2453.46, "duration": 5.58}, {"text": "so he's forced to roam the Seas in these boats and to trade for stuff all the time because he has no left if you", "start": 2459.04, "duration": 5.55}, {"text": "Had land you'd live on the land surely wouldn't you you'd do that, and then you'd be happy doing that", "start": 2464.59, "duration": 4.139}, {"text": "Wouldn't you? these white men are different", "start": 2468.73, "duration": 2.0}, {"text": "Anyway", "start": 2472.34, "duration": 1.56}, {"text": "qui, sulla learned a little bit of English and", "start": 2473.9, "duration": 2.75}, {"text": "became very firm friends with Renton and they were very similar in a lot of ways similar height and build and similar intelligence and and", "start": 2477.86, "duration": 6.77}, {"text": "Humor and so forth they became very firm friends and a certain amount of trust was built up with with qui. Sulla", "start": 2485.3, "duration": 5.869}, {"text": "now", "start": 2492.44, "duration": 2.0}, {"text": "Sandalwood", "start": 2495.41, "duration": 1.47}, {"text": "Sandalwood logging was coming to an end. That was one of the big trades in the area", "start": 2496.88, "duration": 3.679}, {"text": "They were sandalwood ships, but the area was now largely logged out of sandalwood", "start": 2500.56, "duration": 4.709}, {"text": "So there are these ships then that needed something else to do and they started recruiting", "start": 2505.27, "duration": 4.02}, {"text": "Why were they recruiting because Australia had demand for laborers?", "start": 2509.54, "duration": 3.709}, {"text": "during the American Civil War", "start": 2513.89, "duration": 1.89}, {"text": "the price of cotton shot through the roof", "start": 2515.78, "duration": 1.88}, {"text": "I think you can understand why and so it became very lucrative to grow cotton in places like Australia and the Cotton's reasonably easy to", "start": 2517.66, "duration": 5.91}, {"text": "grow, but sugar cane which is another thing they had to go to growing is much more difficult and very", "start": 2523.57, "duration": 4.409}, {"text": "labor-intensive and they just couldn't get the workers the white men in in Australia just wouldn't work for those sort of low wages and", "start": 2528.53, "duration": 6.649}, {"text": "nasty conditions and long contracts, but maybe they could get", "start": 2535.79, "duration": 3.949}, {"text": "Recruits from places like the Solomon islands. So recruitment ships ex-sandalwood ships were sent out to recruit", "start": 2540.35, "duration": 6.529}, {"text": "They were called recruitment ships and a lot of them did indeed", "start": 2547.1, "duration": 3.289}, {"text": "recruit what some of them did though was something that became known as black birding it was", "start": 2550.85, "duration": 6.439}, {"text": "recruiting and that you were getting", "start": 2557.81, "duration": 2.0}, {"text": "Workers aboard your ship but it wasn't voluntary. It was done by force or by trickery and", "start": 2560.3, "duration": 6.889}, {"text": "The process of black birding went on for long enough that something like", "start": 2569.27, "duration": 4.189}, {"text": "4,000 Solomon Islanders were black birdied but over a five-year period between about", "start": 2574.64, "duration": 3.83}, {"text": "1865 and 1870", "start": 2579.23, "duration": 2.0}, {"text": "Nobody knows exactly what the total numbers of people black birded are but reasonably large", "start": 2581.63, "duration": 4.339}, {"text": "And I don't want you to think by the way that \"Oh people were different then it was it was accepted behavior\"", "start": 2586.67, "duration": 6.529}, {"text": "No, no, it wasn't these people were scoundrels and it was known that they were scoundrels", "start": 2593.63, "duration": 5.719}, {"text": "There were all sorts of regulations and inspectors", "start": 2599.39, "duration": 2.959}, {"text": "Put in place to make sure that they didn't flout the regulations. There was a system in place", "start": 2603.049, "duration": 4.52}, {"text": "There were laws. You were not supposed to do this and when some of the sea captains", "start": 2607.569, "duration": 5.331}, {"text": "Floated those laws and that horror stories about that some of the things that they did", "start": 2613.12, "duration": 4.02}, {"text": "Became known the general the British public were absolutely baying for these sea captain's blood. It was an outrage", "start": 2617.749, "duration": 6.35}, {"text": "So don't don't try to excuse this with oh, you know people were different back then", "start": 2624.859, "duration": 4.339}, {"text": "No, no some of these guys some of these black burgers were absolute out-and-out villains for instance", "start": 2629.199, "duration": 6.33}, {"text": "There was a Henry Ross Lewin", "start": 2635.529, "duration": 2.0}, {"text": "One of the things he liked to do was pretend to be a bishop and he would invite people", "start": 2639.829, "duration": 3.32}, {"text": "Onto his ship because he knew that missionaries were quite respected and then sail off with them. Yeah", "start": 2643.4, "duration": 6.26}, {"text": "that was one of his favorite tactics so and though and", "start": 2650.329, "duration": 3.379}, {"text": "regulations like how many people you could put on a ship and how much space each passenger had to have", "start": 2653.929, "duration": 4.22}, {"text": "These regulations were set down in law and there are inspectors, but he just floated the regulations", "start": 2658.219, "duration": 5.45}, {"text": "Um worse though was another captain called James Murray. He was a doctor. Dr", "start": 2663.799, "duration": 4.489}, {"text": "James Murray who was known for other things drugging his patients for his own nefarious ends", "start": 2668.289, "duration": 5.37}, {"text": "And then he was an absolute", "start": 2674.809, "duration": 2.0}, {"text": "Maniac this guy he would for instance set out", "start": 2677.269, "duration": 2.719}, {"text": "trade goods on the deck of his ship and", "start": 2680.39, "duration": 2.179}, {"text": "People would canoe out from from their islands to have a look at the goods and then he would put to hold some goods out", "start": 2682.789, "duration": 6.83}, {"text": "Over the edge of his ship and then let them drop and it'd be full of pig iron", "start": 2689.9, "duration": 2.869}, {"text": "Which would then smash through the canoe capsizing it", "start": 2692.769, "duration": 3.9}, {"text": "And perhaps killing a few people lost this was happening and then he would \"Oh no!", "start": 2697.009, "duration": 3.979}, {"text": "Oh what a terrible accident\" rescued the people out of the water and then sail off with them", "start": 2700.989, "duration": 4.8}, {"text": "But this guy's a maniac", "start": 2706.339, "duration": 1.581}, {"text": "I mean some of the accounts said that he would occasionally just kill some of the passengers on board for the hell it", "start": 2707.92, "duration": 4.77}, {"text": "and you", "start": 2713.27, "duration": 1.05}, {"text": "Can't put it down to a racism because he was he was being horrendous with everybody he would for instance", "start": 2714.32, "duration": 5.0}, {"text": "He advertised at one point he advertised for pioneers to go on colonize", "start": 2719.32, "duration": 3.84}, {"text": "an island in the Pacific and he got a load of people on his ship and then after getting off", "start": 2723.92, "duration": 4.879}, {"text": "Out to sea, he said Oh, what were actually doing is recruiting", "start": 2729.23, "duration": 2.81}, {"text": "Sorry, we're what we're not pi what he would just trick anyone into doing what he wanted on one voyage he put some passengers", "start": 2733.04, "duration": 7.79}, {"text": "Aboard a ship because it lent an air of respectability", "start": 2740.83, "duration": 2.55}, {"text": "Legitimacy to to what he was doing. I'm a passenger carrier. Oh, yes. Yes you I've stroll about deck will serve your tea and", "start": 2744.17, "duration": 5.329}, {"text": "Having sailed away these passengers were no longer used to him", "start": 2750.32, "duration": 3.08}, {"text": "And so he abandoned them on an island when another ship came by later", "start": 2753.4, "duration": 3.479}, {"text": "It was found that all the men had been killed by the natives", "start": 2756.88, "duration": 2.369}, {"text": "the guy was an absolute maniac the ship the voyage that actually put", "start": 2760.73, "duration": 4.4}, {"text": "It was the beginning of the end for this was the voyage of a ship called the Perry", "start": 2765.5, "duration": 3.08}, {"text": "The Perry set off from Fiji with lots of people aboard including lots of these black birded", "start": 2769.07, "duration": 5.6}, {"text": "Workers who really did not want to be there", "start": 2775.4, "duration": 2.0}, {"text": "And they rebelled and they took over the ship now on the previous occasion", "start": 2777.92, "duration": 3.679}, {"text": "When a lot of natives were taken over the ship. They just killed everyone", "start": 2781.6, "duration": 3.0}, {"text": "But then they had no one who could sail the ship and so that didn't end well for them, but these were slightly cleverer", "start": 2784.76, "duration": 6.62}, {"text": "They killed everyone", "start": 2791.72, "duration": 2.0}, {"text": "Apart from one vigie and a sailor who then threw himself overboard", "start": 2793.79, "duration": 3.59}, {"text": "So the result was the same the people most of the people being killed had no idea why they were being killed", "start": 2797.51, "duration": 5.66}, {"text": "They didn't know anything about the circumstances of these natives", "start": 2803.17, "duration": 2.159}, {"text": "They'd seen plenty of natives aboard ships before and have never been the problem before so they just thought there were more", "start": 2805.33, "duration": 3.81}, {"text": "Native workers going back and forth between their their various native islands", "start": 2809.36, "duration": 3.349}, {"text": "But no these guys had been black birdied and they wanted out", "start": 2813.23, "duration": 3.2}, {"text": "Then what happened aboard the Perry is a stuff of absolute nightmares", "start": 2817.64, "duration": 4.099}, {"text": "It was a very long.they derivative for I think 35 days about 1,800 miles", "start": 2821.74, "duration": 4.92}, {"text": "And they were from lots of different islands. They spoke different", "start": 2827.3, "duration": 2.179}, {"text": "languages and", "start": 2830.39, "duration": 1.62}, {"text": "Some of the other daily divided the monks group took tribal lines and some of these tribes are quite well armed and others weren't", "start": 2832.01, "duration": 6.35}, {"text": "which you can imagine was not so good for the ones that weren't terribly well armed and", "start": 2838.52, "duration": 3.12}, {"text": "They started running out of food after a while and cannibalism became rife, but you weren't supposed to eat members of your own tribe", "start": 2841.89, "duration": 6.589}, {"text": "So if you had weapons you could then eat members of another tribe", "start": 2848.48, "duration": 3.27}, {"text": "But if you didn't have weapons you could then have to break a taboo, which is a another oceanic word", "start": 2851.75, "duration": 4.83}, {"text": "And eat one of your own which you didn't want it. It was horrendous and", "start": 2857.52, "duration": 4.669}, {"text": "then came across", "start": 2862.74, "duration": 1.56}, {"text": "HMS basilisk. No, there's a hell of a name HMS basilisk. It's called a great name for ship I think and", "start": 2864.3, "duration": 4.939}, {"text": "they were", "start": 2870.06, "duration": 0.63}, {"text": "rescued and taken aboard but no one spoke their language and they were they were treated as well as they could be treated their they", "start": 2870.69, "duration": 5.12}, {"text": "Were fed and so forth, but no one could talk to them didn't really know what the hell was going on", "start": 2875.81, "duration": 3.149}, {"text": "but they could see from looking at the ship that something utterly horrendous had happened and", "start": 2878.97, "duration": 5.719}, {"text": "they", "start": 2885.75, "duration": 1.29}, {"text": "Took them back to Fiji which seemed a reasonable thing to do", "start": 2887.04, "duration": 3.35}, {"text": "Except when these black brilliant men saw that they were back where they started back on Fiji. They thought okay, right", "start": 2891.0, "duration": 6.649}, {"text": "So, you know, we've killed all these people we've escaped when we must be they're gonna kill us so they ran for it", "start": 2897.65, "duration": 6.0}, {"text": "An interpreter was sought and found", "start": 2904.26, "duration": 2.0}, {"text": "The men were tracked down", "start": 2906.6, "duration": 1.86}, {"text": "and", "start": 2908.46, "duration": 1.17}, {"text": "Given huge amounts of compensation they were completely bewildered", "start": 2909.63, "duration": 2.779}, {"text": "They thought they're all gonna be killed and then suddenly the white man starts handing them loads and loads of stuff including", "start": 2912.41, "duration": 4.53}, {"text": "Really good stuff, like axes of steel axe was just about the most prized thing", "start": 2917.4, "duration": 4.31}, {"text": "In Renton's village a steel axe Wow steel axe was 20 times more efficient than a stone axe", "start": 2922.62, "duration": 5.0}, {"text": "It took to chop down a big tree", "start": 2927.62, "duration": 2.279}, {"text": "We're renton was took four days with a stone axe", "start": 2930.41, "duration": 3.39}, {"text": "How steel axe and then they were giving them rifles not just in an old-fashioned muskets", "start": 2934.17, "duration": 4.46}, {"text": "they were giving them schneider rifles who the Carroll why are they giving us all this stuff and you eventually", "start": 2938.63, "duration": 6.569}, {"text": "it was explained to them that the guy who Blackbird did them was a criminal and", "start": 2946.11, "duration": 4.669}, {"text": "You know the white men the white men do have laws", "start": 2952.05, "duration": 3.139}, {"text": "anyway, so when the voice the parry became well known there there was another big public outcry a big crackdown and did some of the", "start": 2955.98, "duration": 6.86}, {"text": "Things which turned out to be maybe not misguided. It's too big a topic really to deal with in this video there the australian started", "start": 2962.84, "duration": 7.439}, {"text": "The selling of guns to natives and they also tried later banning headhunting. I", "start": 2970.96, "duration": 3.78}, {"text": "Anyway, black birding eventually came to an end. Thank goodness", "start": 2975.5, "duration": 4.25}, {"text": "But it's relevant. Why was one hell of a digression. It was relevant to this", "start": 2980.809, "duration": 4.76}, {"text": "Video because it's in this time that black birding is happening now", "start": 2986.24, "duration": 4.31}, {"text": "After another successful raid", "start": 2992.69, "duration": 2.0}, {"text": "Kubu is worried because the enemy is starting to get hold of rifles", "start": 2995.96, "duration": 5.239}, {"text": "The standard contract by the way, was you you work for three years in australia", "start": 3001.839, "duration": 3.86}, {"text": "and then you go home with good compensation including very often a rifle and you thought right we need some rifles because if they", "start": 3005.7, "duration": 7.8}, {"text": "Tried to get vengeance for what? We've just done they're likely to take vengeance using rifles", "start": 3014.02, "duration": 4.25}, {"text": "So we be the get some rifles quick. So I", "start": 3018.27, "duration": 2.369}, {"text": "can use my influence to get permission to cull porpoises and with a", "start": 3021.49, "duration": 4.52}, {"text": "porpoise skull get loads of porpoise teeth and then we'll be able to trade those for rifles. Yeah. This is my plan", "start": 3026.41, "duration": 6.56}, {"text": "Let's do it. So they", "start": 3032.97, "duration": 2.0}, {"text": "put stones into", "start": 3035.5, "duration": 2.0}, {"text": "bamboo sticks and", "start": 3037.51, "duration": 1.26}, {"text": "the surface of the water and drove a load of porpoises into the shallows and then sang to them and really nice to them and", "start": 3038.77, "duration": 6.589}, {"text": "led them to", "start": 3045.46, "duration": 1.29}, {"text": "The shore where the women were waiting there with hidden knives behind their backs, and then the deed was done", "start": 3046.75, "duration": 5.659}, {"text": "So they had lots of porpoise teeth and they took an expedition out to this extraordinary place. That was a", "start": 3053.109, "duration": 5.81}, {"text": "manageable journey away", "start": 3059.95, "duration": 1.71}, {"text": "We're very very fat chieftain who looked must have looked quite a character", "start": 3061.66, "duration": 4.969}, {"text": "he wore a an English stovepipe hat and a", "start": 3066.63, "duration": 3.78}, {"text": "German naval jacket and", "start": 3070.93, "duration": 2.0}, {"text": "Nothing else and he lived in these you could call them treehouses", "start": 3073.21, "duration": 3.709}, {"text": "But they were more like forts really. They were over a hundred feet high up", "start": 3076.92, "duration": 3.449}, {"text": "In the trees, and they had really thick floors that were musket-proof", "start": 3080.829, "duration": 4.55}, {"text": "So they were there were treehouse come", "start": 3086.109, "duration": 1.861}, {"text": "Fortresses if you like and eventually they got up into one of these houses and they were able to talk to him", "start": 3087.97, "duration": 4.189}, {"text": "But there were problems", "start": 3093.88, "duration": 2.0}, {"text": "You see this guy was now doing really well trading with the white man and porpoise teeth? He had no use for porpoise teeth", "start": 3096.0, "duration": 8.26}, {"text": "The white man's not interested in porpoise teeth. He wants stuff that he can use to trade with the white man. And", "start": 3104.4, "duration": 4.46}, {"text": "His currency was people and when he clapped eyes on Renton", "start": 3109.51, "duration": 4.969}, {"text": "Chu he thought wow this Renton guy is going to be worth a mint", "start": 3115.03, "duration": 4.4}, {"text": "renton found that this", "start": 3120.22, "duration": 2.0}, {"text": "Chieftain this fat stovepipe hat wearing chieftain", "start": 3122.65, "duration": 2.839}, {"text": "Spoke English and he started conversing with him in English and striking a deal, but he'll come back in a week", "start": 3125.92, "duration": 6.619}, {"text": "Arrange for a ship in a week's time. I'll come back. I'll get on the ship. You'll get loads of compensation", "start": 3132.76, "duration": 5.57}, {"text": "It'll be a sweet deal. Can we do this?", "start": 3138.33, "duration": 2.0}, {"text": "unfortunately", "start": 3141.07, "duration": 1.47}, {"text": "quite Sula", "start": 3142.54, "duration": 1.5}, {"text": "overheard and knew enough English that he understood that some deal was being struck and that", "start": 3144.04, "duration": 5.689}, {"text": "Renton was trying to escape and he tipped off kibou", "start": 3149.92, "duration": 3.079}, {"text": "So Renton realized I'm gonna have to get out really really quick", "start": 3154.69, "duration": 3.38}, {"text": "I can't hang about. Kabo's not gonna give me permission", "start": 3158.07, "duration": 2.159}, {"text": "He wrote a message on a plank of wood, which somehow he was able to get to some", "start": 3160.57, "duration": 5.179}, {"text": "British naval crew that said I've been stranded here for five years", "start": 3166.66, "duration": 3.199}, {"text": "He'd actually been stranded there for seven and a half years which shows that you know, Hey time flies when you're head hunting", "start": 3169.9, "duration": 5.869}, {"text": "But I suppose you know, he was it's a tropical area of the world, you know, he was used to seasons", "start": 3176.68, "duration": 4.339}, {"text": "So anyway, he was two and a half years out how long he'd been there", "start": 3181.02, "duration": 4.89}, {"text": "and a meeting for the next day was set up but", "start": 3186.73, "duration": 3.44}, {"text": "He couldn't get away from Kabu Kabu", "start": 3190.48, "duration": 2.12}, {"text": "Wouldn't let him go and wouldn't let him go alone. And no one would go with him. Not even quite sulla", "start": 3192.67, "duration": 5.569}, {"text": "And there was a tense moment with the ship there", "start": 3199.27, "duration": 3.439}, {"text": "He's trying to strike a deal with the the chieftain trying to strike a deal with his owner trying to strike a deal", "start": 3202.72, "duration": 6.469}, {"text": "He saw an opportunity at one moment", "start": 3209.5, "duration": 2.51}, {"text": "He just got close enough to the ship and he just left onto the side of the Borden's", "start": 3212.01, "duration": 3.39}, {"text": "Of the other ship and scrambled up the side and was onto the deck into the welcoming arms of Royal Navy personnel", "start": 3215.83, "duration": 5.78}, {"text": "He had it seemed", "start": 3223.24, "duration": 1.95}, {"text": "finally escaped", "start": 3225.19, "duration": 2.0}, {"text": "the next day kibou met him and", "start": 3227.2, "duration": 2.69}, {"text": "Did not recognize him he'd had his hair cut. He was wearing clothes", "start": 3230.5, "duration": 3.469}, {"text": "He stood differently and he was speaking in English with the they're Englishmen. He just seemed to be one of them", "start": 3233.97, "duration": 4.89}, {"text": "Who was this man? Kibou didn't recognize him", "start": 3238.86, "duration": 2.04}, {"text": "He went off to Australia", "start": 3242.2, "duration": 2.0}, {"text": "and it was able to sell his story to the newspapers and he got a job as a", "start": 3245.08, "duration": 5.209}, {"text": "Recruiter you might not think he would he would go into that line of work", "start": 3251.56, "duration": 2.78}, {"text": "But he did and he was actually a very good recruiter who who changed the way recruiting was done. He said for instance", "start": 3254.34, "duration": 5.459}, {"text": "No, no, you've got to compensate the chieftain state that yes", "start": 3259.84, "duration": 3.709}, {"text": "They're sending out all their worst guys because they want to lose there any of their guys", "start": 3263.55, "duration": 3.18}, {"text": "They said you know what don't want lose their best guys", "start": 3266.73, "duration": 1.68}, {"text": "You've got to give the chieftains really good compensation. Then they're gonna be happy to deal with you see in", "start": 3268.41, "duration": 6.06}, {"text": "Our culture we think if you're interviewing someone for a job, you're just you're just dealing with that person", "start": 3275.47, "duration": 4.55}, {"text": "You don't have you don't have to deal with that person's chief or mother or whatever you're dealing with that person", "start": 3280.02, "duration": 5.189}, {"text": "But it's different in these islands", "start": 3285.21, "duration": 2.219}, {"text": "He said, okay", "start": 3287.43, "duration": 0.36}, {"text": "You've got to do things differently people start doing things his way and it all started working a bit better but interestingly", "start": 3287.79, "duration": 5.04}, {"text": "He never went back to recruit on his own Island", "start": 3292.83, "duration": 2.52}, {"text": "Why is this well?", "start": 3295.99, "duration": 2.0}, {"text": "We don't know but it's reasonable to speculate that", "start": 3298.45, "duration": 2.989}, {"text": "He was ashamed of some of the things that you might have done on that island. You see his account", "start": 3301.44, "duration": 4.379}, {"text": "Doesn't tally brilliantly with the oral history account", "start": 3306.94, "duration": 3.53}, {"text": "which is quite a good oral history account and", "start": 3310.51, "duration": 2.629}, {"text": "the oral history account says he went on at least six raids and killed quite a few people and had a wife and", "start": 3313.42, "duration": 6.56}, {"text": "It's reasonable to imagine that he didn't want the civilized world finding out about those aspects of his story", "start": 3321.04, "duration": 6.41}, {"text": "And that is perhaps why he avoided going back to his his own?", "start": 3327.45, "duration": 4.5}, {"text": "his own Island", "start": 3332.77, "duration": 1.62}, {"text": "Oral history. For instance. I should explain another lie aggression. Here it comes or this was actually far more efficient than you might imagine", "start": 3334.39, "duration": 5.84}, {"text": "You may think that there's Chinese whispers happening all the time", "start": 3341.35, "duration": 2.51}, {"text": "This story just gets bandied about and people tell this story over and over again elaborating", "start": 3343.86, "duration": 4.05}, {"text": "It's simplifying it making it more convenient getting it to fit with other stories and so forth. That's not how they did it", "start": 3347.91, "duration": 5.129}, {"text": "they took oral history far more seriously than that", "start": 3353.16, "duration": 2.969}, {"text": "A Grandparent would tell a grandchild", "start": 3357.73, "duration": 2.0}, {"text": "skipping a generation", "start": 3360.01, "duration": 1.53}, {"text": "Therefore you have a smaller number of iterations. Well half the number of iterations doing it that way", "start": 3361.54, "duration": 5.06}, {"text": "They would pick the most intelligent grand child and in a ceremony they would tell that", "start": 3366.96, "duration": 4.329}, {"text": "grandchild the definitive version of the story and they would do it in the presence of the skull of the person being talked about or", "start": 3371.839, "duration": 7.729}, {"text": "Some other ancestor who also knew the story", "start": 3379.569, "duration": 2.91}, {"text": "So it was very important to get things right in front of the skull because the spirits would be listening", "start": 3382.549, "duration": 5.36}, {"text": "And then that grandchild would be the sole owner of that story and would have the official version", "start": 3388.73, "duration": 6.5}, {"text": "that was just just one copy removed from the from the actual happening and", "start": 3395.39, "duration": 4.04}, {"text": "Though that", "start": 3401.329, "duration": 0.99}, {"text": "That owner of the story might tell loads of other people", "start": 3402.319, "duration": 3.11}, {"text": "Whenever the official version is sought they would go back to that owner of the story", "start": 3405.559, "duration": 4.76}, {"text": "so", "start": 3410.839, "duration": 1.26}, {"text": "The records that were good enough to create to recreate entire", "start": 3412.099, "duration": 5.209}, {"text": "Genealogical records going back a few generations quite a few generations", "start": 3417.68, "duration": 3.8}, {"text": "Anyway that the two don't quite match up the oral history and and Renton's account", "start": 3422.21, "duration": 4.399}, {"text": "anyway, Renton became quite successful in year enough passage money to get passage back to", "start": 3426.609, "duration": 5.37}, {"text": "To Britain and there he was celebrated. He didn't have to look for work for a year, but he was actually quite shy and publicity", "start": 3432.859, "duration": 7.76}, {"text": "He avoided publicity a lot and didn't like hated public speaking didn't want to do that", "start": 3441.44, "duration": 4.489}, {"text": "He did go back to the Orkneys. His own family did not recognize him", "start": 3446.119, "duration": 4.31}, {"text": "He was cited doing something very strange when he would go for a swim. Which off the Orkneys is brave", "start": 3451.73, "duration": 5.719}, {"text": "He would lie down on the surface of the water and crawl along top of it in this very strange manner", "start": 3458.869, "duration": 6.86}, {"text": "You see something they get wrong in a lot of movies. Is that a lot of swimming strokes that we think are?", "start": 3466.039, "duration": 5.39}, {"text": "Just like standard normal are actually quite recent at least recent in the world of the white man", "start": 3471.529, "duration": 7.25}, {"text": "The first crawl as far as I know that was ever witnessed in Britain was in", "start": 3479.41, "duration": 3.57}, {"text": "1844 in London some American Indians were doing knock crawl quite as we know it today the kick was different and so forth but a", "start": 3483.859, "duration": 7.189}, {"text": "splashy version of that sort of thing", "start": 3491.299, "duration": 2.15}, {"text": "And though it was quite fast", "start": 3494.42, "duration": 1.669}, {"text": "It wasn't taken up and this business where you put your head under the water. They come up with a head", "start": 3496.089, "duration": 5.58}, {"text": "For a few strokes and come up again. That's a modern thing as well", "start": 3502.22, "duration": 3.62}, {"text": "You look at film of even Olympic contenders from from the early days of the Olympics and that's the day Oscar swam head up", "start": 3505.87, "duration": 5.25}, {"text": "Anyway, so renton it seems was the first", "start": 3511.73, "duration": 3.26}, {"text": "White man in the in in in britain or europe ever to swim the crawl", "start": 3515.84, "duration": 5.209}, {"text": "but his crawl didn't catch on instead another man called Frank Wickham who was a very similar man to Renton and he was also", "start": 3521.05, "duration": 7.739}, {"text": "Shipwrecked in the Solem islands about 20 years after Renton and he also became quite a success. He married a local woman", "start": 3529.46, "duration": 7.79}, {"text": "He had a son called Alec and he traded", "start": 3537.25, "duration": 2.55}, {"text": "got a rich enough through trading that he was able to send Alec to boarding school in Australia and", "start": 3540.44, "duration": 4.97}, {"text": "Alec went out there and boy could that kids swim he represented Australia in swimming", "start": 3545.66, "duration": 6.049}, {"text": "He held the record that stood until World War one", "start": 3551.71, "duration": 2.76}, {"text": "He also had the high diving record and till he broke his neck, but it wasn't fatal", "start": 3554.66, "duration": 5.209}, {"text": "but at the end of his high diving I also", "start": 3559.87, "duration": 2.099}, {"text": "Introduced skin-diving to Australia and it was his crawl relatedly called the Australian crawl that actually caught on", "start": 3562.46, "duration": 6.83}, {"text": "But Renton was there first", "start": 3570.05, "duration": 2.389}, {"text": "Dancing dancing. No swimming that the crawl and", "start": 3573.53, "duration": 2.87}, {"text": "Anyway, so I wrapped this story up because I did the digressions are really mounting up now, aren't they? So Renton has", "start": 3578.54, "duration": 6.739}, {"text": "Still have itchy feet and he went back. He went back to the Pacific and he became a recruiter again", "start": 3585.95, "duration": 6.38}, {"text": "Obviously, he wasn't content with life back in the Orkneys quite a bit colder for one thing", "start": 3593.0, "duration": 4.76}, {"text": "and", "start": 3598.82, "duration": 2.0}, {"text": "One day", "start": 3600.98, "duration": 1.29}, {"text": "He was in a boat that was men to be covering another boat", "start": 3602.27, "duration": 2.929}, {"text": "The standard process was you sent one boat in to do the deal whilst another boat", "start": 3605.2, "duration": 3.989}, {"text": "Hung back a bit with a load of guys with guns in it to make sure that everything's going to go off safely", "start": 3609.26, "duration": 5.689}, {"text": "but the the the", "start": 3615.71, "duration": 2.0}, {"text": "Natives were signalling to his boat to gone go over and join them and", "start": 3618.47, "duration": 3.53}, {"text": "Renton was looking at these natives and seeing how they were signalling to each other and seeing how", "start": 3622.37, "duration": 5.599}, {"text": "He could see that Vati that guy's in charge not that guy who's doing the talking and he could understand some of the words", "start": 3628.43, "duration": 5.899}, {"text": "Being said and he said no don't don't go over there spoiling for a fight. They're trying to that", "start": 3634.54, "duration": 4.5}, {"text": "They're just the devices what they want to fight? Seriously. They're just about to kick off don't go over there", "start": 3639.11, "duration": 4.309}, {"text": "And Renton was told not to be such an old woman and the vote went over there", "start": 3643.42, "duration": 5.49}, {"text": "It was an ambush a fight ensued some people got away, but Renton didn't Renton was killed", "start": 3649.16, "duration": 7.549}, {"text": "When news of Renton's death reached the village where kibou lived", "start": 3657.68, "duration": 4.46}, {"text": "There was tremendous mourning", "start": 3662.9, "duration": 2.86}, {"text": "There was great wailing", "start": 3665.92, "duration": 1.8}, {"text": "300 pigs were sacrificed in his honor and for three days straight they told tales of", "start": 3667.73, "duration": 6.38}, {"text": "the white gente when the white headhunter Jack Renton and", "start": 3674.48, "duration": 4.82}, {"text": "There was a relic we House built for him that acted as a shrine to his memory", "start": 3680.42, "duration": 4.97}, {"text": "You can't see it today because it burnt down in", "start": 3686.18, "duration": 2.72}, {"text": "1963 so there you go. Ladies and gentlemen, I give you the extraordinary tale of Jack Renton", "start": 3690.26, "duration": 7.669}]