[{"text": "(Yannick:) This video is brought to you by Storyblocks video", "start": 0.03, "duration": 2.55}, {"text": "hello guys Yannick here for Cinecom.net and welcome to another copycat Friday a", "start": 3.07, "duration": 5.93}, {"text": "series where we recreate effects from famous movies and", "start": 9.25, "duration": 3.08}, {"text": "music videos and today we are having a look at an artist who's really blowing up lately", "start": 12.759, "duration": 4.64}, {"text": "Lil Nas X. His previous song Old Town Road was everywhere", "start": 17.92, "duration": 4.369}, {"text": "It is so popular that even John Rambo uses it in its latest movie trailer and let's be honest", "start": 22.289, "duration": 5.79}, {"text": "It's kind of weird hearing that song with a super killing machine stabbing and shooting everybody", "start": 28.21, "duration": 5.599}, {"text": "But we are not here today for Old Town Road. No today. We are going to tackle a new song, Panini", "start": 34.329, "duration": 5.69}, {"text": "And yeah, it's again really catchy. But this time it also has a clip fully loaded with awesome effects", "start": 40.02, "duration": 6.329}, {"text": "And from this clip we are going to recreate the hologram effect", "start": 46.35, "duration": 2.88}, {"text": "You can see throughout the whole video for this", "start": 49.23, "duration": 2.189}, {"text": "We are going to use After Effects as this will give you more options to make it realistic", "start": 51.42, "duration": 3.869}, {"text": "but first, let's look a little bit more into Holograms and", "start": 55.449, "duration": 3.02}, {"text": "into our sponsor Storyblocks video Storyblocks video is an online library full of video assets that keeps on expanding I can really", "start": 58.539, "duration": 7.88}, {"text": "Say that we use Storyblocks video for almost every project and has helped us numerous times", "start": 66.42, "duration": 4.559}, {"text": "We use it for After Effects templates, transitions, stock footage", "start": 71.32, "duration": 3.739}, {"text": "which you can find in 4k and", "start": 75.159, "duration": 1.681}, {"text": "So much more and the best thing about Storyblocks video is that you can download an unlimited amount of assets for one single price", "start": 76.84, "duration": 7.069}, {"text": "Per year, so if you want to start downloading right away, you can check out the first link in the description bellow now", "start": 84.04, "duration": 6.619}, {"text": "what is a hologram really after some researching I can say that the hologram is an image created by a", "start": 90.759, "duration": 5.72}, {"text": "Photographic projection of a recording of a light-field rather than an image formed by some sort of lens", "start": 96.7, "duration": 5.029}, {"text": "Okay, I guess but let me simplify that for you", "start": 103.54, "duration": 2.75}, {"text": "A hologram is a 3D projection of light that exists really in the space and is visible to everyone without the need of 3D glasses", "start": 106.29, "duration": 7.109}, {"text": "Which is pretty cool", "start": 113.77, "duration": 1.129}, {"text": "also", "start": 114.899, "duration": 0.481}, {"text": "I hope that science will perfect this technology one day so that we can use it in our daily lives", "start": 115.38, "duration": 4.769}, {"text": "Like video calling or maybe even gaming but I have to say that we already have come quite far. Let me take you back to", "start": 120.34, "duration": 6.8}, {"text": "1860 where the first holographic elements were used by John Henry Pepper back then", "start": 127.69, "duration": 4.309}, {"text": "He invented an illusionary trait called Pepper's Ghost", "start": 132.22, "duration": 2.1}, {"text": "And this trick is the foundation of holography to explain the trick really short", "start": 134.42, "duration": 4.76}, {"text": "It worked with using the reflective properties of a glass wall placed on a stage", "start": 139.18, "duration": 4.079}, {"text": "This glass wall was placed in an angle so that it could reflect everything from the area beneath it", "start": 143.6, "duration": 4.879}, {"text": "Then when turning on the light in the lower laying area", "start": 148.76, "duration": 2.66}, {"text": "You could see the reflections on the glass wall creating a hologram the technology at that time was mind-blowing", "start": 151.42, "duration": 5.82}, {"text": "But it had restrictions due to weak light sources such as oil lamps and candles the images appeared were only faintly", "start": 157.55, "duration": 7.369}, {"text": "Recognizable or very transparent for that reason mainly ghosts were shown", "start": 165.23, "duration": 4.82}, {"text": "Which also led to the naming of Pepper's Ghost now that we know where holography originated", "start": 170.05, "duration": 4.949}, {"text": "Let's have a look at the first film that used Holograms in their story", "start": 175.01, "duration": 3.349}, {"text": "And guess what guys it's again Star Wars A New Hope damn", "start": 178.36, "duration": 4.559}, {"text": "It's really getting to me how groundbreaking Star Wars really was and how did they do it?", "start": 183.32, "duration": 5.149}, {"text": "Well, as you can see here, they film the objects", "start": 188.51, "duration": 2.93}, {"text": "They want as Holograms in a black environment then afterwards they could blend them in with the original shot", "start": 191.44, "duration": 5.489}, {"text": "Super simple. We are also going to use some sort of blending technique, but with some extra effects, however,", "start": 197.51, "duration": 5.779}, {"text": "There's also a very easy way to create your own DIY hologram, but this has a huge size restriction", "start": 203.48, "duration": 6.529}, {"text": "So not something we can use but I'll leave you a link to the DIY hologram tutorial in the description below now in current films", "start": 210.01, "duration": 7.769}, {"text": "Holograms are ever present you can see them in the typical whole-body Holograms, but also in different shapes and styles for example", "start": 218.03, "duration": 6.86}, {"text": "Here Holograms are used in the HUD's of the Iron Man suit", "start": 225.41, "duration": 2.779}, {"text": "these typical Holograms represent the Iron Man's vital signs and fun fact", "start": 228.83, "duration": 4.789}, {"text": "We did a Cinebattle recently about recreating the Iron Man HUD's within one hour", "start": 233.63, "duration": 4.88}, {"text": "So if you haven't seen that go to the description below and find that link ok", "start": 238.61, "duration": 4.97}, {"text": "I think we can say that we have talked enough about Holograms. So let's jump into it", "start": 243.58, "duration": 4.83}, {"text": "(Jordy:) Here we have it guys a great set that Yannick built", "start": 265.18, "duration": 2.69}, {"text": "So what we have right here are just some movable walls and that way we could create a hallway up there", "start": 268.06, "duration": 5.569}, {"text": "We've got the Aperture 120 D's and over them", "start": 273.629, "duration": 4.05}, {"text": "We can find space lights, which is just a soft fabric around them now", "start": 277.68, "duration": 4.559}, {"text": "That way we have like a clean soft lighting over the entire hall because we've got two of them", "start": 282.24, "duration": 4.26}, {"text": "But we don't want to shine the light onto the walls because that way everything will be flat. So that's why Yannick crafts these", "start": 286.69, "duration": 5.959}, {"text": "Black, what are they called?", "start": 293.229, "duration": 1.581}, {"text": "Like cuts cut fingers around it so that you cut the light", "start": 294.81, "duration": 3.179}, {"text": "also", "start": 298.24, "duration": 0.5}, {"text": "if you have like highly reflective elements in your scenery such as these things right here and make sure to extra flag that off and", "start": 298.74, "duration": 7.559}, {"text": "Yannick place this flag above these", "start": 306.52, "duration": 2.69}, {"text": "Elements to do so and that way the hallway's lit and not too much the walls", "start": 309.639, "duration": 4.489}, {"text": "then when your Holograms pop up bang", "start": 314.259, "duration": 2.029}, {"text": "We've got a light for that because holograms is basically light so it has to reflect light unto the subject", "start": 316.289, "duration": 6.24}, {"text": "and of course on the scenery itself, so that's why we've got a light over there which we can control through a remote and", "start": 322.53, "duration": 6.119}, {"text": "We also have one over there the same remote. That's basically it furthermore", "start": 329.38, "duration": 4.369}, {"text": "we also have smoke in this room as you can see that is just done through a simple haze machine here around the corner and", "start": 333.75, "duration": 6.479}, {"text": "That smoke is gonna make sure that we have some more drama", "start": 340.3, "duration": 2.69}, {"text": "Going on into the set. But also that the entire scene looks more soft. You know that we got more depth more dynamic into", "start": 343.69, "duration": 6.769}, {"text": "The scenery. Yeah, that's that's basically it", "start": 351.069, "duration": 3.649}, {"text": "Did I do a good job? Yannick? (Yannick:) Yeah, Jordy you forgot the practical lights behind you (Jordy:) practical lights", "start": 355.36, "duration": 5.899}, {"text": "Oh, yeah, I forgot the practical lights. You also have practical lights the back", "start": 361.259, "duration": 3.149}, {"text": "Practical lights are basically lights that can be visible in your shots such as the lights hanging over there", "start": 365.5, "duration": 5.629}, {"text": "We also have like a little fireplace with a lumie inside", "start": 371.129, "duration": 2.97}, {"text": "Yeah, it's just pretty cool because these lights get extra depth to your shot", "start": 374.279, "duration": 3.6}, {"text": "Definitely if you get them sitting in the back", "start": 377.879, "duration": 2.0}, {"text": "Practical lights can also be things like a a decorative light that you have standing in your living room", "start": 380.02, "duration": 4.73}, {"text": "Anything like that place that in your background and instantly, you've got a ton of more depth in your shot", "start": 385.06, "duration": 5.299}, {"text": "Really cool technique and you can play around with any color that you like (Yannick:) now for the movement", "start": 390.669, "duration": 4.369}, {"text": "We went handheld Jordy walked behind me and followed me to the end", "start": 395.039, "duration": 3.54}, {"text": "It took into account where the Holograms would be and made sure that would be enough space for them", "start": 398.76, "duration": 4.649}, {"text": "We use handheld motion to make it more dynamic, but you can also shoot it from a tripod", "start": 403.45, "duration": 4.73}, {"text": "This will make everything much easier and post-production now for the green-screen", "start": 408.18, "duration": 3.69}, {"text": "It's quite simple just place your actor who is going to be the hologram in front of the green screen", "start": 411.87, "duration": 4.409}, {"text": "More or less match the lighting of the hallway and film him", "start": 416.68, "duration": 3.079}, {"text": "This is exactly what Lil Nas did as you can see here in behind the scenes", "start": 419.95, "duration": 3.98}, {"text": "Like him you can add last detail by making the actor jump up a little to make the hologram pop up more realistic", "start": 424.06, "duration": 6.44}, {"text": "I know that we went very fast over the green-screen part", "start": 430.5, "duration": 2.94}, {"text": "but if you want to learn more about this", "start": 433.45, "duration": 1.97}, {"text": "I'll leave a playlist linked in the description below full of videos where we explain everything in detail", "start": 435.42, "duration": 5.1}, {"text": "Ok now, let's jump into After Effects", "start": 441.07, "duration": 2.57}, {"text": "the first thing we are going to do is place the background shot on track number 1 and on track number 2 you can place", "start": 443.8, "duration": 5.569}, {"text": "The green screen shots now key out the green from the hologram and let's start with the tracking of the background shots", "start": 449.37, "duration": 5.52}, {"text": "Of course if you use it, right?", "start": 454.89, "duration": 1.53}, {"text": "But you can skip this part", "start": 456.42, "duration": 1.6}, {"text": "But if you use handheld motion just like us you need to track like I said", "start": 458.02, "duration": 4.369}, {"text": "Select the background layer and go to the tracker panel here", "start": 462.64, "duration": 3.26}, {"text": "You can select the track camera button and let After Effects to its thing when the tracking is done look for the point", "start": 465.9, "duration": 5.579}, {"text": "Where the hologram is supposed to jump up and here you can hover over the track points to select the place", "start": 471.48, "duration": 5.01}, {"text": "You want your hologram at if you don't see that many track points", "start": 476.49, "duration": 3.119}, {"text": "this means that After Effects doesn't have enough information to work with so always make sure that you have a lot of structure in your", "start": 479.67, "duration": 6.239}, {"text": "Scene now right-click on the wanted points and select set ground plane and origin after", "start": 485.91, "duration": 4.92}, {"text": "This you can go to the effects control panel and create a camera", "start": 491.05, "duration": 3.589}, {"text": "The whole shot is now completely tracked, and it's time to create the hologram", "start": 494.64, "duration": 3.57}, {"text": "Look, the first thing you now need to do is pre-comp the hologram layer, of course", "start": 498.21, "duration": 4.589}, {"text": "Don't forget to enable the option", "start": 502.8, "duration": 1.45}, {"text": "move all attributes into a new", "start": 504.25, "duration": 2.0}, {"text": "composition now go into the pre-comp layer and add the glow effect from the effects library in the effects control panel you can now", "start": 506.29, "duration": 6.5}, {"text": "Play around with these settings", "start": 512.79, "duration": 1.51}, {"text": "We decreased the glow threshold and the glow", "start": 514.3, "duration": 2.179}, {"text": "Intensity then increase the glow radius and set the glow colors to the A and B color option now in the lower settings you can", "start": 516.61, "duration": 6.59}, {"text": "Change the color A and B to something you want", "start": 523.2, "duration": 2.099}, {"text": "This will already give you a very nice glowy effect the next effect", "start": 525.7, "duration": 3.679}, {"text": "You can add is a turbulent displace for the settings of this effect", "start": 529.38, "duration": 3.54}, {"text": "You can change the displacement to horizontal displacement", "start": 532.92, "duration": 2.579}, {"text": "After this increase the amount to around 60 and decrease the size to around 5", "start": 535.84, "duration": 4.489}, {"text": "This effect will make the edge glitch a little but we still need to add some movement into the glitch", "start": 540.33, "duration": 4.859}, {"text": "So enable the animation for the evolution and animate it from 0 to 3x over the entire length of the clip next", "start": 545.5, "duration": 6.979}, {"text": "We are going to give Jordy more of an old TV", "start": 552.48, "duration": 2.16}, {"text": "Look, this is easily done by the bad TV - old preset", "start": 554.64, "duration": 3.539}, {"text": "If you want you can dial into the settings to tweak it to your likings", "start": 558.18, "duration": 3.9}, {"text": "Last you add the opacity flash preset to the actors clip", "start": 562.21, "duration": 2.899}, {"text": "Now this preset automates the opacity flashing from 0 to 100 through some codes, which is too much", "start": 565.21, "duration": 7.099}, {"text": "so we are going to change one value in that code in the linear line change the to 0 to 60 and this will make sure", "start": 572.53, "duration": 6.169}, {"text": "That 60 is the lowest that the opacity will go ok", "start": 578.7, "duration": 3.479}, {"text": "Jordy already looks like a real hologram. Now, let's make him fly in which is really easy", "start": 582.45, "duration": 5.309}, {"text": "Just look for the CC Ball Action effect and drag that to the hologram clip in the effects panel", "start": 587.76, "duration": 5.549}, {"text": "Make sure that the CC Ball effect is above the glow effect", "start": 593.31, "duration": 2.85}, {"text": "now in the beginning of the hologram clip set the scatter to around 70 and", "start": 596.41, "duration": 4.25}, {"text": "Enable the animation for it then go further in time and set the scatter to 0 after", "start": 600.73, "duration": 4.82}, {"text": "All these effects go back to the main comp and make the hologram pre-comp a 3D layer by enabling this box", "start": 605.8, "duration": 6.049}, {"text": "After Effects will now do something strange with the position rotation and scale of the layer", "start": 612.07, "duration": 4.52}, {"text": "So let's adjust them until the hologram sits perfectly in place", "start": 616.63, "duration": 3.41}, {"text": "You can also enable the animation for the position of the hologram clip and move it down out of the screen then go further in", "start": 620.05, "duration": 6.049}, {"text": "Time and animate the hologram back up and it's that easy", "start": 626.1, "duration": 3.27}, {"text": "Just enable the motion blur and bam Jordy is a hologram", "start": 629.65, "duration": 3.739}, {"text": "But the only thing that is missing now is some text", "start": 633.67, "duration": 2.629}, {"text": "We recreated the cylinder text from Lil Nas' video as an example", "start": 636.37, "duration": 3.59}, {"text": "You can easily do this with the CC Cylinder effect within After Effects", "start": 639.96, "duration": 4.049}, {"text": "But you can also apply the hologram techniques and effects to a flat 3D text or maybe even logos", "start": 644.38, "duration": 5.51}, {"text": "You can go as creative as you want", "start": 650.02, "duration": 2.119}, {"text": "Last week. We went to IBC and now the only thing that Jordy can talk about is gear", "start": 653.8, "duration": 4.88}, {"text": "I don't want to talk about gear. Let's talk about some money. I want to race", "start": 658.68, "duration": 4.38}, {"text": "(Hologram Jordy:) Yannick have you seen the brand new Canon C500 Mark II, oh, it's gorgeous gonna get one", "start": 667.03, "duration": 4.669}, {"text": "No, no. No (Yannick:) No Jordy stop talking about gear", "start": 671.7, "duration": 3.39}, {"text": "Damn (Hologram Jordy:) Gorgeous. Oh, yeah, I love gear, I love gear so much, ah yeah, definitely", "start": 675.7, "duration": 3.82}, {"text": "Here you are, listen to me, the Sony FX9 so much better than Canon C500 Mark II (Yannick:) no Jordy, stop it (Hologram Jordy:) because its a full frame camera, and check this out", "start": 680.98, "duration": 8.66}, {"text": "(Yannick:) And that was it for today guys, I hope you enjoyed this video about Holograms and learned something new", "start": 691.96, "duration": 5.72}, {"text": "Thank you so much for watching. Thank you Storyblocks video for the support. And like always", "start": 697.99, "duration": 5.029}, {"text": "Stay creative", "start": 704.32, "duration": 2.0}]