[{"text": "This is my digital dashboard that I just made\n- it sits on the wall right next to my desk", "start": 0.11, "duration": 5.06}, {"text": "and is just “always there”. I’ve got\nthe local time, world time, well, I mean go", "start": 5.17, "duration": 5.389}, {"text": "by US west coast time, Joel should be aspleep,\nbut he’s probably not. I’ve got the weather,", "start": 10.559, "duration": 6.011}, {"text": "my upcoming video plan and to-do on here and\nin the last two weeks that I’ve been using", "start": 16.57, "duration": 5.09}, {"text": "it, it has already made my work so much more\nefficient because it totally keeps me on track.", "start": 21.66, "duration": 6.71}, {"text": "You can use this setup for everything, though.\nAs a family planner, a digital picture frame", "start": 28.37, "duration": 5.31}, {"text": "or even, with a much smaller screen, as a\ndesktop clock with your next tasks coming", "start": 33.68, "duration": 6.03}, {"text": "up. And all this is is a TV and a Raspberry\nPi, so let me show you how I built this one,", "start": 39.71, "duration": 5.98}, {"text": "how I set everything up to work smoothly from\nthe Pi and as energy efficiently as possible", "start": 45.69, "duration": 4.88}, {"text": "and what I would do different next time.", "start": 50.57, "duration": 5.77}, {"text": "So let’s go through what parts I used. First,\nthe screen. This is a 43”, 4K LED TV from", "start": 56.34, "duration": 5.91}, {"text": "JVC. It’s really amazing how cheap TVs have\nbecome just in the last two years - and the", "start": 62.25, "duration": 6.19}, {"text": "price difference between 1080p and 4K models\nhas also shrunk to almost zero, so getting", "start": 68.44, "duration": 6.23}, {"text": "the higher-resolution model was a no-brainer\nas it makes especially smaller text so much", "start": 74.67, "duration": 4.86}, {"text": "more readable, which means I can actually\nmake use of the large screen size and put", "start": 79.53, "duration": 4.58}, {"text": "more stuff on it. Of course, you can also\nuse an old computer screen or any other spare", "start": 84.11, "duration": 5.4}, {"text": "display, but make sure it has decent viewing\nangles, especially if you plan on mounting", "start": 89.51, "duration": 4.36}, {"text": "it in portrait, and also keep an eye on power\ndraw.", "start": 93.87, "duration": 3.8}, {"text": "I picked this exact model because it’s a\ngood bit more energy efficient than others", "start": 97.67, "duration": 3.839}, {"text": "- and since it’ll be on for 10 hours a day,\nthat does make a difference in the long run.", "start": 101.509, "duration": 5.261}, {"text": "Now, for what’s controlling this, obviously,\nit’s a Raspberry Pi - 4. The older Pis would", "start": 106.77, "duration": 5.67}, {"text": "have probably been fast enough, but don’t\nsupport 4K output over HDMI. Yes, there are", "start": 112.44, "duration": 5.1}, {"text": "a few hacks that may allow you to get 4K from\nthem, but I wanted to eliminate as many potential", "start": 117.54, "duration": 5.66}, {"text": "hiccups as possible - this should be a zero-hassle\nand -maintenance setup for me and was already", "start": 123.2, "duration": 6.22}, {"text": "enough work. I may still try an older Pi in\nthe future, though.", "start": 129.42, "duration": 3.94}, {"text": "So for the software that’s driving all this.\nThere are two, maybe three ready-to-go solutions", "start": 133.36, "duration": 4.65}, {"text": "for this. The first one, and maybe the most\nobvious one, is MagicMirror². That’s a", "start": 138.01, "duration": 5.59}, {"text": "Raspberry-Pi-native software that’s made\nto sit behind a semi-transparent, mirrored", "start": 143.6, "duration": 4.36}, {"text": "piece of glass and shine its information through\nthat mirror, creating that “mirror, mirror", "start": 147.96, "duration": 4.331}, {"text": "on the wall” illusion. MagicMirror² is\nfree and open-source and has a ton of plugins", "start": 152.291, "duration": 5.049}, {"text": "and expansions. But. First, the interface\nis optimized to just be black and white, since", "start": 157.34, "duration": 6.35}, {"text": "it’s made to shine through a mirror, and\ngetting anything to look nice without that", "start": 163.69, "duration": 4.22}, {"text": "mirror is going to take some effort. And,\nthe more severe issue for me, the way you", "start": 167.91, "duration": 5.23}, {"text": "set up MagicMirror² is by editing JSON files\nover remote desktop or through an SSH terminal.", "start": 173.14, "duration": 5.47}, {"text": "I don’t have those sort of masochistic tendencies,\nso that didn’t particularly excite me. But", "start": 178.61, "duration": 9.03}, {"text": "I tried anyways, and after digging through\nthe tons of different calendar plugins and", "start": 187.64, "duration": 4.43}, {"text": "finding the one that seems to be the go-to\npowerful option, I just gave up when I saw", "start": 192.07, "duration": 5.199}, {"text": "the 50-page-long documentation on how to write\nthe JSON that would display a shared calendar.", "start": 197.269, "duration": 5.291}, {"text": "Like, this shouldn’t be so hard. For me,\nthat’s not fun to set up, and changing anything", "start": 202.56, "duration": 5.44}, {"text": "in the future would mean re-learning the entire\nthing again.", "start": 208.0, "duration": 3.31}, {"text": "It also kind of explains that when MagPi,\nthe official Raspberry Pi Magazine, covered", "start": 211.31, "duration": 5.02}, {"text": "MagicMirror², they spent five pages explaining\nhow to build the build the wooden frame, and", "start": 216.33, "duration": 6.5}, {"text": "only one page on software. It would probably\nscare a lot of people away if they covered", "start": 222.83, "duration": 3.909}, {"text": "it more realistically - which is the other\nway around. One page on the frame, five pages", "start": 226.739, "duration": 4.151}, {"text": "on how to edit JSON files.\nThe next alternative is DAKboard, and that’s", "start": 230.89, "duration": 4.769}, {"text": "the one that I’m actually using right now.\nIt’s not an open-source software, it is", "start": 235.659, "duration": 4.22}, {"text": "a paid software-as-a-service, which I’m\nusually not a fan of, but there is a somewhat", "start": 239.879, "duration": 4.671}, {"text": "limited free version available. This project\nis not sponsored by them, I don’t even have", "start": 244.55, "duration": 4.56}, {"text": "an affiliate link for DAKboard, but there\nare affiliate links to all the hardware and", "start": 249.11, "duration": 4.799}, {"text": "tools I’m using down in the video description.\nSo, the one massive advantage that DAKboard", "start": 253.909, "duration": 5.17}, {"text": "has is that it’s entirely browser-based.\nBoth the configuration and the dashboard itself", "start": 259.079, "duration": 5.351}, {"text": "happen entirely in a browser window, which\nmeans you can use any kind of hardware for", "start": 264.43, "duration": 5.009}, {"text": "the screen setup as long as it can display\na website; and you can change and update what’s", "start": 269.439, "duration": 5.48}, {"text": "shown on the screen from any other computer\nwithout remote-desktop’ing into the Raspberry", "start": 274.919, "duration": 5.55}, {"text": "Pi or going through a console.\nIt took me all of ten minutes to get DAKBoard", "start": 280.469, "duration": 4.23}, {"text": "running, and then a bit longer to figure out\nwhat I actually wanted to have on here, where,", "start": 284.699, "duration": 5.351}, {"text": "how large, etc.\nThere is one more software that I found, and", "start": 290.05, "duration": 4.449}, {"text": "that’s Mirr-OS by glancr, which I believe\nis somewhat open-source. It’s made by a", "start": 294.499, "duration": 5.432}, {"text": "guy from Berlin, but it seemed a bit too focused\non living behind a mirror again, which means", "start": 299.931, "duration": 4.798}, {"text": "very simplified graphics, and the list of\nintegrations and features is also still quite", "start": 304.729, "duration": 6.391}, {"text": "short.", "start": 311.12, "duration": 1.0}, {"text": "With each of these solutions, there are still\na few things that I did to the Raspberry Pi", "start": 312.12, "duration": 4.389}, {"text": "OS to make it work for this application, but\nI’ll get to those towards the end of the", "start": 316.509, "duration": 4.19}, {"text": "video. But now that I knew that the software\nworked and did what I wanted it to, it was", "start": 320.699, "duration": 4.84}, {"text": "time to mount everything to the wall and to\nbuild a bezel for the screen to make it look", "start": 325.539, "duration": 4.35}, {"text": "a bit less like a failed home cinema setup.", "start": 329.889, "duration": 2.661}, {"text": "I started by installing the wall mount for\nthe TV itself. This is a standard, off-the-shelf", "start": 332.55, "duration": 5.47}, {"text": "unit, I tried to get one that was reasonably\nthin since I didn’t want the frame to stick", "start": 338.02, "duration": 3.709}, {"text": "out too far from the wall; the TV is thick\nenough as-is. Most wall mounts let you mount", "start": 341.729, "duration": 5.321}, {"text": "the TV in normal landscape orientation or\nin portrait, but if you have one that is particularly", "start": 347.05, "duration": 5.449}, {"text": "flimsy, the TV may tilt forward a bit too\nmuch for comfort. Mounts with a taller base", "start": 352.499, "duration": 5.26}, {"text": "like this one tend to be sturdier, and the\nbezel I’m still adding will help hold it", "start": 357.759, "duration": 5.08}, {"text": "in place, too.\nIn case you’re wondering, no this is not", "start": 362.839, "duration": 3.241}, {"text": "a studwall, this is not drywall, in fact,\nthis is a two-flue, brick chimney that I’m", "start": 366.08, "duration": 5.419}, {"text": "mounting this to. Usually, you should never\ndrill into a chimney, as that could allow", "start": 371.499, "duration": 3.75}, {"text": "for flue gases to escape or create a fire\nhazard, but in my case, one flue has never", "start": 375.249, "duration": 6.621}, {"text": "been used and will never be used, and already\ncarries the cables for my solar panels from", "start": 381.87, "duration": 5.029}, {"text": "the roof into the basement where the inverters\nlive, and this other flue is now double, or", "start": 386.899, "duration": 6.13}, {"text": "actually triple-lined with polymer pipe ever\nsince we upgraded to a condensing gas heater.", "start": 393.029, "duration": 4.581}, {"text": "That means, in my case, this can be treated\nlike a solid bearing wall. With the bonus", "start": 397.61, "duration": 11.229}, {"text": "feature of being able to run wires in the\nempty flu.", "start": 408.839, "duration": 20.491}, {"text": "So now that the TV was mounted, I could get\nstarted on making the wood bezel. I picked", "start": 429.33, "duration": 4.349}, {"text": "up a few pine boards as they were cheap and\nhad a nice, lively texture that would break", "start": 433.679, "duration": 4.681}, {"text": "up the sterile look of the dashboard. I started\nby joining two boards for the facia and got", "start": 438.36, "duration": 5.38}, {"text": "to cutting out the bezel area. Sure, there\nare more material-efficient ways of making", "start": 443.74, "duration": 11.989}, {"text": "a bezel like this, for example by joining\nsegments with miter cuts, but I wanted the", "start": 455.729, "duration": 5.03}, {"text": "grain to run in all the same direction", "start": 460.759, "duration": 56.481}, {"text": "in the front.\nI routed out a large lip or pocket for the", "start": 517.24, "duration": 14.339}, {"text": "TV to sit further towards the front - it only\nneeded to be this big on one side, but the", "start": 531.579, "duration": 4.541}, {"text": "spacing from the edge of the visible screen\nto the rear box-section of the wooden frame", "start": 536.12, "duration": 4.589}, {"text": "needs to be the same on all edges.\nI then added a bunch of chamfers on all sides", "start": 540.709, "duration": 4.131}, {"text": "of the bezel, for looks, but also to make\nthat second facia on top of the TV’s original", "start": 544.84, "duration": 5.539}, {"text": "bezel look as thin as possible.\nNow, just because I’m using a bunch of tools", "start": 550.379, "duration": 14.351}, {"text": "here doesn’t mean that you can’t make\na frame like this if you don’t have all", "start": 564.73, "duration": 3.45}, {"text": "of them. I’m not using any of these tools\nparticularly effectively, so all you need", "start": 568.18, "duration": 5.029}, {"text": "if you’re a bit creative is some sort of\na saw, sandpaper and wood glue. You can also", "start": 573.209, "duration": 4.94}, {"text": "get different raw materials that need less\nwork to get them into shape to make your life", "start": 578.149, "duration": 3.711}, {"text": "even easier, like thin plywood for that front\nfacia.", "start": 581.86, "duration": 11.14}, {"text": "For the back portion of the bezel, I printed\na bunch of grills to cover up some cutouts", "start": 593.0, "duration": 3.79}, {"text": "for ventilation - both the screen and the\nPi do need some airflow, but passive convection", "start": 596.79, "duration": 5.5}, {"text": "should be enough.\nThe back itself is a simple butt-joined rectangle,", "start": 602.29, "duration": 3.989}, {"text": "I added a few brad nails for strength and\nso that I could keep on working right away.", "start": 606.279, "duration": 5.221}, {"text": "The back frame then simply gets glued to the\nbezel, and after that, I was ready for a quick", "start": 611.5, "duration": 3.68}, {"text": "round of sanding and the first coat of varnish.\nI looked into using a stain first, but since", "start": 615.18, "duration": 5.32}, {"text": "I wanted an almost black color, using colored\nvarnish ended up being a simpler, more consistent", "start": 620.5, "duration": 6.23}, {"text": "and cheaper option. After a second coat of\npaint, the frame was done and ready to be", "start": 626.73, "duration": 10.57}, {"text": "mounted.", "start": 637.3, "duration": 1.979}, {"text": "Aaaaand.. I screwed up. Yeah, uh, remember\nhow I like to measure from the 10cm mark on", "start": 639.279, "duration": 7.801}, {"text": "a measuring tape so that I don’t need to\ndeal with the wiggly end? Well, turns out", "start": 647.08, "duration": 4.17}, {"text": "if you forget to subtract those 10cm from\nyour measurement, you don’t actually get", "start": 651.25, "duration": 4.17}, {"text": "the correct dimension.\nI already thought the aspect ratio looked", "start": 655.42, "duration": 3.159}, {"text": "a bit off to be 16:9, but the dimensions on\nmy sketches checked out. Ah well, at least", "start": 658.579, "duration": 6.041}, {"text": "it was easy enough to fix. I had thought about\njust tossing this frame and 3D printing one", "start": 664.62, "duration": 6.73}, {"text": "instead on that huge Raptor 2.0 printer, but\nfigured I could reuse the wooden bezel and", "start": 671.35, "duration": 5.799}, {"text": "just cut a chunk out of the top and bottom,\nglue it back together, sand it down and give", "start": 677.149, "duration": 4.451}, {"text": "it a fresh coat of paint. So that’s what\nI did, and yeah, you can still see where it", "start": 681.6, "duration": 8.33}, {"text": "got joined back together if you know what\nyou’re looking for, but if you don’t,", "start": 689.93, "duration": 4.579}, {"text": "you can’t really tell.", "start": 694.509, "duration": 3.69}, {"text": "So for mounting the frame, I used pieces of\nwhat you’d call 1x2 in the US, commonly", "start": 698.199, "duration": 4.39}, {"text": "known as Dachlatten here, and to align the\nframe to the screen, I used some double-sided", "start": 702.589, "duration": 5.851}, {"text": "tape to temporarily stick down the slat, then\nunscrewed the frame and anchored it down in", "start": 708.44, "duration": 5.389}, {"text": "that position. Worked really well! And of\ncourse, you can always fine-tune the position", "start": 713.829, "duration": 4.491}, {"text": "with a hammer. Next, I needed power, and remember\nhow I said this was a chimney? Well, that", "start": 718.32, "duration": 8.4}, {"text": "makes it easy! I fished up a wire through\nthe flute and then had a licensed electrician", "start": 726.72, "duration": 4.07}, {"text": "hook up the connections. I first thought I’d\nneed to add an extension to this frame on", "start": 730.79, "duration": 4.13}, {"text": "the bottom to hide the wiring, but it turns\nout there was enough space behind the screen", "start": 734.92, "duration": 6.079}, {"text": "to hide a full powerstrip and USB supply,\nand for the Raspberry Pi 4, well, I just taped", "start": 740.999, "duration": 5.4}, {"text": "that to the back of the TV, there’s no need\nto choke it even more with putting a printed", "start": 746.399, "duration": 3.701}, {"text": "case around it, after all, it is already enclosed\nby the frame and all. And no, for what this", "start": 750.1, "duration": 6.219}, {"text": "PI is doing, it definitely does not need a\nfan or heatsink. So back on goes the bezel,", "start": 756.319, "duration": 5.411}, {"text": "these two vent grills on the bottom and top\nalso hide the screws that mount the bezel", "start": 761.73, "duration": 3.459}, {"text": "to the wall, just to make it a bit prettier.\nI mean, it’s not like anyone is ever going", "start": 765.189, "duration": 4.621}, {"text": "to see it, but still.", "start": 769.81, "duration": 1.389}, {"text": "So how did I set up the Raspberry Pi? It all\nstarts with the standard Raspbian setup, since", "start": 771.199, "duration": 5.75}, {"text": "I use the Pi4, it’s the newest one they\noffered as of today (which is August 2019).", "start": 776.949, "duration": 5.14}, {"text": "I did all the regular things that the setup\nassistant walks you through, that is WiFi", "start": 782.089, "duration": 4.951}, {"text": "and changing the password, but after that,\nit was mostly making the Pi work smoothly", "start": 787.04, "duration": 4.399}, {"text": "in this use case. Reading off all the commands\nI used is not super fun for a video, so I’ll", "start": 791.439, "duration": 5.221}, {"text": "link the article on toms3d.org in the description\nwhere I have all the steps listed in full", "start": 796.66, "duration": 5.429}, {"text": "detail. So here’s the short version:\nFirst, I needed a way to access the PI without", "start": 802.089, "duration": 4.92}, {"text": "attaching a keyboard to it. For that, I enabled\nSSH and VNC remote access with the raspbi-config", "start": 807.009, "duration": 6.301}, {"text": "tool.\nThen, I needed a way to automatically show", "start": 813.31, "duration": 2.589}, {"text": "the DAKboard interface on boot. For that,\nI added a startup command to the LXDE desktop", "start": 815.899, "duration": 5.42}, {"text": "environment that would launch Chromium in\nfull screen. And that works really nicely.", "start": 821.319, "duration": 4.231}, {"text": "But there’s still the issue that this screen\nis rotated. Normally, you can easily configure", "start": 825.55, "duration": 5.05}, {"text": "the entire HDMI output to be rotated with\nthe boot config, but with a 4K screen, the", "start": 830.6, "duration": 5.65}, {"text": "entire image would get shifted off screen\nso that most of it is black and you’re only", "start": 836.25, "duration": 5.569}, {"text": "seeing a small slit of the image. Not great.\nSo instead I tried a few Chrome plugins that", "start": 841.819, "duration": 6.56}, {"text": "would rotate just the website. And there are\na bunch of prank plugins, but “page rotate”", "start": 848.379, "duration": 5.281}, {"text": "did exactly what I needed. However, you need\nto click it every time, which doesn’t work", "start": 853.66, "duration": 4.679}, {"text": "here, so I looked at what it did to the page\nand replicated it. Essentially, it’s creating", "start": 858.339, "duration": 6.04}, {"text": "an iframe, which is a virtual browser window\nwithin the real browser window and it’s", "start": 864.379, "duration": 5.551}, {"text": "rotating that in its entirety. Works beautifully.", "start": 869.93, "duration": 2.44}, {"text": "Next, there were two small annoyances to fix,\nand those were that the screen would go blank", "start": 872.37, "duration": 5.73}, {"text": "after 15 minutes, that’s a simple fix in\nthe desktop environment’s config, and the", "start": 878.1, "duration": 5.799}, {"text": "next one was that there’s a mouse cursor\non screen, which we definitely don’t need,", "start": 883.899, "duration": 4.201}, {"text": "and that’s fixed by installing unclutter\nand adding it to autostart.", "start": 888.1, "duration": 3.46}, {"text": "Lastly, I wanted to schedule the TV turning\non and off because, well, what’s the point", "start": 891.56, "duration": 4.62}, {"text": "of having it on during the night. So I set\nup HDMI-CEC, which lets the Pi control the", "start": 896.18, "duration": 6.29}, {"text": "TV over HDMI and turn it on and off when needed.\nMake sure you’ve got the PI plugged into", "start": 902.47, "duration": 4.919}, {"text": "an HDMI port that supports CEC for that to\nwork. For the scheduling, I used cron, the", "start": 907.389, "duration": 5.282}, {"text": "oldskool linux scheduler, so now the screen\nturns on at 8 AM and turns off at 6PM. Nice", "start": 912.671, "duration": 5.38}, {"text": "ten-hour work day, perfect.", "start": 918.051, "duration": 1.778}, {"text": "And lastly, to save a bit more energy, I turned\ndown the screen to minimum brightness, it’s", "start": 919.829, "duration": 5.01}, {"text": "still very readable at that setting and probably\nreduces power consumption by two thirds or", "start": 924.839, "duration": 4.81}, {"text": "so. That’s also one of the reasons why I\ndidn’t add a mirror in front, as I’d have", "start": 929.649, "duration": 4.191}, {"text": "to crank the brightness just to make it through\nthe mirror and then to compete with the glare", "start": 933.84, "duration": 6.01}, {"text": "on top of that. So this is good.", "start": 939.85, "duration": 2.76}, {"text": "Now, for the actual DAKboard layout, you can\ngo with the free pre-defined ones, but I wanted", "start": 942.61, "duration": 5.44}, {"text": "to try creating a custom one. Now, what you\nput in here is up to you, but here’s what", "start": 948.05, "duration": 4.06}, {"text": "I have on it. Up top, it just felt right to\nhave the local date and time, and then next", "start": 952.11, "duration": 6.159}, {"text": "to it, I have some world times for US west\ncoast, LA, east coast, New York City, Hong", "start": 958.269, "duration": 5.6}, {"text": "Kong, and Sydney, so these just always give\nme an idea of what time it is for the people", "start": 963.869, "duration": 4.571}, {"text": "that I’m talking to on Twitter or via email.\nNext up, weather, and then a calendar of the", "start": 968.44, "duration": 6.66}, {"text": "next 90 days. Right now, I’m only having\nit display my video schedule, but usually,", "start": 975.1, "duration": 5.049}, {"text": "I also have my work calendar on here with\nevents and deadlines, I just hid that for", "start": 980.149, "duration": 4.201}, {"text": "the video because that doesn’t really need\nto be public. I really enjoy having 90 days", "start": 984.35, "duration": 4.04}, {"text": "in advance here, that gives me a chance to\nfor example order stuff from Aliexpress for", "start": 988.39, "duration": 5.009}, {"text": "an upcoming build and the stuff actually getting\nhere in time.", "start": 993.399, "duration": 3.831}, {"text": "Now, down here, for now I’ve put a todo\nlist, but I’ll probably still change that", "start": 997.23, "duration": 4.66}, {"text": "around. If you have ideas of what might fit\nin here, let me know in the comments!", "start": 1001.89, "duration": 6.619}, {"text": "One of the features that DAKboard is only\nunlocking for paid users is the option to", "start": 1008.509, "duration": 4.401}, {"text": "use custom CSS to change how all this stuff\nlooks. But you can also add that feature with", "start": 1012.91, "duration": 9.049}, {"text": "a Chrome plugin that just applies the looks\nright in the browser. What I added here was", "start": 1021.959, "duration": 5.041}, {"text": "a consistent spacing in these calendar cells,\nby default they shrink and grow based on how", "start": 1027.0, "duration": 4.87}, {"text": "much information each row has, then I changed\nsome of the font sizes and added a blurry", "start": 1031.87, "duration": 6.98}, {"text": "shadow under all the text and icons to make\nit a bit more readable. And that’s it!", "start": 1038.85, "duration": 4.06}, {"text": "There are still a few things that I may add\nor change in the future, and that’s for", "start": 1042.91, "duration": 3.79}, {"text": "example power button on the side that lets\nme cleanly shut down the Pi, because if you", "start": 1046.7, "duration": 6.75}, {"text": "just jank power or switch off the mains fuse,\nyou do that too often and at some point it’s", "start": 1053.45, "duration": 4.859}, {"text": "just not going to boot up anymore. For now,\nI’ve got a copy of the SD card, so if that", "start": 1058.309, "duration": 4.861}, {"text": "ever happens, I’ll be back up and running\nfairly quickly.", "start": 1063.17, "duration": 2.78}, {"text": "It could also make sense to actually underclock\nthe Pi4, but since all that’s doing is limiting", "start": 1065.95, "duration": 5.079}, {"text": "the maximum clock and this one is idle most\nof the time anyways, I don’t think it’s", "start": 1071.029, "duration": 4.89}, {"text": "going to make much of a difference for heat\nand power draw.", "start": 1075.919, "duration": 3.591}, {"text": "But what I will try is getting an older Pi\nto output 4K - that way, I can use this Pi4", "start": 1079.51, "duration": 5.23}, {"text": "for more demanding tasks and permanently deploy\na Pi1 for the dashboard.", "start": 1084.74, "duration": 5.48}, {"text": "And if I were to build this again, I would\nprobably skip the entire TV wall mount and", "start": 1090.22, "duration": 4.47}, {"text": "just use the TV’s bezel to tape it to the\nwooden frame. There’s more than enough contact", "start": 1094.69, "duration": 6.05}, {"text": "area there, and knowing how well VHB tape\nsticks, I’d have zero doubts that it would", "start": 1100.74, "duration": 4.539}, {"text": "hold up over time. That would make aligning\nthe frame to the screen much easier and it", "start": 1105.279, "duration": 5.421}, {"text": "would also make for a slimmer build that doesn’t\nstick out as far from the wall. I’d also", "start": 1110.7, "duration": 4.16}, {"text": "drill a small hole for the infrared receiver\nin the TV to make the remote a bit less awkward", "start": 1114.86, "duration": 8.27}, {"text": "to use.\nLike I mentioned, I’ll have the software", "start": 1123.13, "duration": 2.26}, {"text": "guide linked in the description below, also\ndown there you can find the list of parts", "start": 1125.39, "duration": 4.23}, {"text": "and tools that I used if you’re looking\ninto making one yourself, and if so, let me", "start": 1129.62, "duration": 3.929}, {"text": "know in the comments what you’re thinking\nabout using it for!", "start": 1133.549, "duration": 3.681}, {"text": "And as always, if you found this video helpful,\ninteresting, entertaining, leave a like, get", "start": 1137.23, "duration": 5.93}, {"text": "subscribed, and if you’re up for it, join\nin on Patreon or through YouTube memberships", "start": 1143.16, "duration": 5.45}, {"text": "to support the channel. Thank you all so much,\nthanks for watching, and I’ll see you in", "start": 1148.61, "duration": 10.88}, {"text": "the next one.", "start": 1159.49, "duration": 5.48}]