[{"text": "Save scumming as it's commonly known is the practice of saving", "start": 0.069, "duration": 3.665}, {"text": "just before making a risky move in a game and then", "start": 3.734, "duration": 2.955}, {"text": "Reloading it until either the RNG gods \nare forever in your favour or you know", "start": 6.879, "duration": 4.73}, {"text": "All of the information that was supposed to be hidden like exactly", "start": 11.61, "duration": 2.816}, {"text": "where the enemies are for instance in order to get the perfect result", "start": 14.426, "duration": 2.943}, {"text": "Some players decry it while other players say", "start": 17.77, "duration": 2.657}, {"text": "it's inevitable and embrace it", "start": 20.427, "duration": 1.772}, {"text": "But the real question is how do we design around it?", "start": 22.24, "duration": 3.83}, {"text": "This episode is sponsored by audible start your own audiobook adventures today by visiting the link in the description below", "start": 32.259, "duration": 6.619}, {"text": "As designers one of our goals is always to make our games engaging and you know, what's not engaging", "start": 39.03, "duration": 6.42}, {"text": "reloading your game 10 times and doing the same move over and over and over again until you happen to get a critical hit and", "start": 45.969, "duration": 6.89}, {"text": "Yet if that's the optimum play pattern", "start": 52.93, "duration": 2.269}, {"text": "Especially if there's things at stake like character permadeath hitting some achievement or unlocking some new powers or equipment", "start": 55.51, "duration": 5.869}, {"text": "players are gonna feel like they have to do it and", "start": 61.57, "duration": 2.599}, {"text": "Those that refuse to play the save and reload game", "start": 64.33, "duration": 2.623}, {"text": "are going to feel punished for not doing so", "start": 66.953, "duration": 2.256}, {"text": "But before we talk about", "start": 69.549, "duration": 1.274}, {"text": "how to design around this behavior", "start": 70.823, "duration": 1.806}, {"text": "We should discuss the question", "start": 72.63, "duration": 1.661}, {"text": "that rages on fan forums everywhere", "start": 74.291, "duration": 1.938}, {"text": "Is this behavior cheating? As a designer James kind of doesn't believe in the concept of cheating and single-player games?", "start": 76.299, "duration": 7.28}, {"text": "And I'm right there with them. You're playing a single-player game for you", "start": 83.58, "duration": 3.839}, {"text": "So in that case play them any way you find satisfying now does saving and reloading all the time go against the designers intent?", "start": 87.49, "duration": 6.8}, {"text": "I mean, yeah", "start": 94.29, "duration": 1.11}, {"text": "maybe", "start": 95.4, "duration": 0.46}, {"text": "But you also don't have to read a book in the exact way the author intended for you to get the most out of it", "start": 95.86, "duration": 5.269}, {"text": "So doing away with the idea that save scumming is inherently bad or makes you a bad person for doing it", "start": 101.38, "duration": 5.419}, {"text": "We're gonna focus on how to keep your game engaging if it encourages that type of behavior", "start": 106.799, "duration": 4.17}, {"text": "But what type of games do encourage this type of behavior?", "start": 111.369, "duration": 2.779}, {"text": "Well, we've already touched on it a bit but really it's any game that has all of the following to some degree.", "start": 114.52, "duration": 5.809}, {"text": "Randomness or hidden information which makes it possible to change the outcome of an action if you reload you're safe. And", "start": 120.85, "duration": 5.629}, {"text": "incentive to reload your save such as better rewards or better clear times and it needs to be the sort of game where you can", "start": 126.969, "duration": 6.14}, {"text": "Realistically anticipate and save before events. You might want to try over and over again", "start": 133.26, "duration": 4.199}, {"text": "And if your game has all three of those things there's still one last ingredient", "start": 137.459, "duration": 4.139}, {"text": "it's gonna need to create an environment where players will reload over and over again in search of the best results: a", "start": 141.61, "duration": 5.869}, {"text": "Generous save system getting rid of any of the other parts will eliminate save scumming as a player behavior.", "start": 148.15, "duration": 5.96}, {"text": "But if you want all of those other component parts in your game namely randomness and reward for optimal performance.", "start": 154.11, "duration": 5.58}, {"text": "Then the easiest way to keep players from save scumming is", "start": 160.15, "duration": 3.02}, {"text": "Restricting when they can save and relying on a robust", "start": 163.359, "duration": 2.72}, {"text": "Infrequent autosave system and not allowing players to save freely can cure your game of save scumming and is a good start.", "start": 166.209, "duration": 6.29}, {"text": "However, restricting where players can save leads to other problems", "start": 172.78, "duration": 3.44}, {"text": "Especially of strategy games where this most frequently comes up", "start": 176.769, "duration": 2.839}, {"text": "Because no one wants to play 20 minutes of a game much less three", "start": 179.829, "duration": 3.8}, {"text": "hours of one only to find out that they lost due to a move somewhere in the middle of that time and now they have", "start": 183.7, "duration": 6.379}, {"text": "To start all over again", "start": 190.079, "duration": 1.451}, {"text": "Which means if your game only saves between missions or battles and your battles run long?", "start": 191.53, "duration": 5.479}, {"text": "You're setting your players up for frustration", "start": 197.109, "duration": 2.18}, {"text": "This can be alleviated by essentially having restore points in your save system where your game?", "start": 199.48, "duration": 5.0}, {"text": "auto-saves every move as well as whenever the player exits the game, but also", "start": 204.639, "duration": 4.01}, {"text": "holds on to a library of saves that are visible to the player that are juuuuuust", "start": 208.84, "duration": 4.1}, {"text": "Far enough apart to discourage reloading the most interesting option though", "start": 213.43, "duration": 4.699}, {"text": "If you're thinking about it from the outset of your design is to have metrics in your game", "start": 218.129, "duration": 4.199}, {"text": "Which vaguely indicate the players chance of success in a scenario in a strategy game?", "start": 222.329, "duration": 4.5}, {"text": "it might be comparing the total value of all the players units and equipment to the total value of the enemy's units and equipment or", "start": 226.829, "duration": 5.97}, {"text": "in an RPG", "start": 232.799, "duration": 0.66}, {"text": "It could be something as simple as comparing HP and MP totals and then using that information", "start": 233.459, "duration": 4.709}, {"text": "To have the game itself pick the save to reload when the player loses", "start": 238.449, "duration": 3.59}, {"text": "The game would still be saving after every move or in real-time games after short intervals", "start": 242.26, "duration": 4.939}, {"text": "But those saves would be invisible to the player and instead at the game over screen. It would ask the player", "start": 247.199, "duration": 5.79}, {"text": "Would you like to try again from here and show a screenshot of when things were still firmly in the players favor?", "start": 253.0, "duration": 5.659}, {"text": "This takes saving and reloading out of the players hands, but still gives them a non frustrating place to restart from hey", "start": 258.9, "duration": 6.869}, {"text": "But what if you don't care, that's right", "start": 265.93, "duration": 2.75}, {"text": "What if you are a hundred percent on board with save scumming and everything that entails well?", "start": 268.83, "duration": 4.679}, {"text": "Then there's a different sort of design you have to do you have to think about your game holistically to make this process", "start": 273.51, "duration": 6.119}, {"text": "enjoyable for instance", "start": 280.06, "duration": 1.46}, {"text": "You could do something small and cheeky like what?", "start": 281.52, "duration": 2.19}, {"text": "Undertale did by changing the dialogue of characters", "start": 283.78, "duration": 2.75}, {"text": "If you reload a save in order to change the outcome of an event", "start": 286.53, "duration": 3.27}, {"text": "But on a larger scale if the joy of the game is actually in always performing optimally", "start": 289.9, "duration": 5.36}, {"text": "In uncovering all of the hidden information and then utilizing that to find the best answer to whatever", "start": 295.62, "duration": 5.07}, {"text": "Challenge the game has presented you then save scumming itself is actually the intended play pattern, which can be very cool", "start": 300.82, "duration": 6.739}, {"text": "But understand that as a designer if that's what you're building for. You're essentially building a puzzle game", "start": 307.56, "duration": 5.79}, {"text": "It may have the trappings of a strategy game or an RPG and it may even use their mechanics", "start": 313.39, "duration": 4.88}, {"text": "But conceptually as the designer you have to think of each move and each scenario as a puzzle", "start": 318.28, "duration": 5.839}, {"text": "It's really a cool way of thinking", "start": 324.12, "duration": 1.62}, {"text": "I mean for an example of this just take a look at all of the awesome puzzle modes digital card games have presented us", "start": 325.74, "duration": 5.73}, {"text": "I mean that's essentially auto-saves coming right there because there's usually a save state of a single turn that reloads if you don't win", "start": 331.47, "duration": 6.66}, {"text": "So is save scumming bad I don't know is broccoli bad", "start": 338.44, "duration": 3.95}, {"text": "I mean, they're both kind of personal choices", "start": 342.39, "duration": 2.399}, {"text": "But what we're saying here is if unplanned for the type of design that can lead to save scumming can create an erroneous task that", "start": 344.89, "duration": 6.889}, {"text": "Every player feels like they have to do and can really drag down the pace of your game", "start": 351.78, "duration": 3.99}, {"text": "But like most other elements of design if you know your game encourages this behavior", "start": 355.77, "duration": 4.649}, {"text": "You can just think around it and make it as positive for the player as possible. Actually Zoe", "start": 360.42, "duration": 6.029}, {"text": "I think I can do that last line better. Let's take it back", "start": 366.45, "duration": 2.429}, {"text": "And make it as positive for the player as possible now that was game showy, okay, hold on reload reload reload", "start": 371.15, "duration": 6.269}, {"text": "And make it as badass for the player as possible, what am I in a biker gang hold on rewind do it again", "start": 379.05, "duration": 6.71}, {"text": "He has low low mass positivo posible para el jugador good that might have been better if I actually spoke Spanish. Thanks for nothing", "start": 388.02, "duration": 6.98}, {"text": "Google, translate one more time. We got this", "start": 395.0, "duration": 2.0}, {"text": "And make it as positive for the player as possible nailed it sorry show me the score", "start": 398.4, "duration": 6.17}, {"text": "Alright, I mean if the internet so, I guess that's an S ranking", "start": 405.0, "duration": 3.47}, {"text": "Just like we discussed in today's episode, there's no one right way to consume any media", "start": 411.36, "duration": 5.21}, {"text": "however", "start": 416.57, "duration": 0.49}, {"text": "I am super excited that this episode is sponsored by my favorite way to experience audiobooks", "start": 417.06, "duration": 5.6}, {"text": "audible now as you've all", "start": 423.03, "duration": 1.68}, {"text": "undoubtedly noticed I spend a lot of time talking on this channel and combine that with pesky things like eating sleeping and", "start": 424.71, "duration": 5.809}, {"text": "Socializing and I rarely find time to just sit and read", "start": 430.62, "duration": 2.63}, {"text": "however with audible I get the chance to listen to any of their countless audio titles while commuting around the city or when I take", "start": 433.35, "duration": 5.809}, {"text": "a walking break recently", "start": 439.16, "duration": 1.53}, {"text": "I've been listening to Frank Herbert's dune and William Gibson's burning chrome for our extra credits book club over on Twitch and I gotta say", "start": 440.69, "duration": 6.389}, {"text": "it's been one spice fueled cyberpunk good time and", "start": 447.08, "duration": 2.94}, {"text": "Because audible offers free and easy audio book exchanges and member credits can roll over for a year", "start": 450.24, "duration": 5.149}, {"text": "I can engage with all of their cool stuff at my own pace", "start": 455.389, "duration": 3.33}, {"text": "So if you want to start listening for yourself with a 30-day free trial and get your first", "start": 458.72, "duration": 4.769}, {"text": "Audiobook plus two audible originals for free visit audible.com slash extra credits. Oh and when you're done, let me know in the comments", "start": 463.59, "duration": 7.699}, {"text": "What's your favourite audiobook is cuz I'm always on the lookout for my next favorite. Listen. I mean, I'm listening for it", "start": 471.289, "duration": 5.691}, {"text": "Oh and reading that you get it you get it. Just t-tell me some good stuff to hear.", "start": 477.02, "duration": 3.58}]