[{"text": "This video was sponsored by Next Games and The Walking Dead: No-Man's Land. Check the link in the description to download now!", "start": 0.0, "duration": 5.67}, {"text": "They're probably gone by now.", "start": 26.96, "duration": 2.0}, {"text": "That's not good,", "start": 41.48, "duration": 1.68}, {"text": "Can you guys even believe this? This is like the 3rd time the apocalypse has happened on this channel.", "start": 43.16, "duration": 4.849}, {"text": "It's getting a little out of hand", "start": 48.47, "duration": 2.0}, {"text": "Well, I guess if I have to train to fight against some zombies then there's no better way than using the Walking Dead app game", "start": 50.659, "duration": 6.86}, {"text": "by Next Games!", "start": 57.519, "duration": 2.0}, {"text": "#SPONSORED\n#WALKINGDEAD", "start": 59.96, "duration": 2.0}, {"text": "#NEXTGAMES\n#ZOMBIES", "start": 61.96, "duration": 4.29}, {"text": "Uh... hash", "start": 67.04, "duration": 1.32}, {"text": "Hashtag", "start": 68.36, "duration": 1.38}, {"text": "Sponsored one more time.\nAnd guys, before we get started with the main video", "start": 69.74, "duration": 3.02}, {"text": "I'm here to talk to you about the Walking Dead app game by NextGames.", "start": 72.76, "duration": 3.509}, {"text": "If you're a fan of The Walking Dead show,  like I am, and you're looking for something new to play on the go then", "start": 76.43, "duration": 4.909}, {"text": "you should definitely check out the game.", "start": 81.34, "duration": 1.33}, {"text": "It's kind of like a mix between a resource management game and a tactical combat game", "start": 82.67, "duration": 4.43}, {"text": "You get to build your own camp and collect different resources and find and level up your own survivors", "start": 87.1, "duration": 4.889}, {"text": "And if you're lucky maybe you'll even get Rick Grimes", "start": 91.99, "duration": 3.72}, {"text": "THAT'S THE DREAM", "start": 96.59, "duration": 2.0}, {"text": "That never gets old, oh my god, he's actually in the game.\nYou can get Carl.", "start": 103.789, "duration": 4.31}, {"text": "After playing the game for a little bit leveling up some of my guys and taking on some of the early game missions", "start": 108.71, "duration": 5.149}, {"text": "I can actually see that the game is pretty fun. You're always getting new characters new equipment and progressing in some way.", "start": 113.859, "duration": 5.58}, {"text": "So if that's something you're into you should definitely check out the game. The download link is in the description down below.", "start": 119.439, "duration": 5.04}, {"text": "Supra Mayro Bross!?", "start": 136.91, "duration": 2.0}, {"text": "Legends off the Lost Kingdom. Oh", "start": 139.37, "duration": 2.18}, {"text": "My god, the legends are true", "start": 142.28, "duration": 2.479}, {"text": "It's the long-lost Mario game.", "start": 145.64, "duration": 2.449}, {"text": "Oh yeah, that's the stuff,", "start": 151.61, "duration": 2.0}, {"text": "It's just like I remember it", "start": 155.48, "duration": 2.0}, {"text": "When the music overlaps with the music-- that's art. That's art right there", "start": 159.14, "duration": 7.039}, {"text": "MMM It's so good!!!!!", "start": 170.59, "duration": 2.0}, {"text": "eeeeeeeh?", "start": 174.09, "duration": 3.41}, {"text": "Loss WeDo not tuch Gumba. All right, silly me. We don't touch a gumba...", "start": 186.24, "duration": 7.61}, {"text": "What's a gumba!?", "start": 195.63, "duration": 2.0}, {"text": "(Slightly cut off) It's-a me! (Very deep) Mario! *wink*", "start": 203.579, "duration": 1.83}, {"text": "Mario has been the icon of nintendo for over 30 years now, sold millions of games, been associated with a myriad of different jobs,", "start": 205.409, "duration": 7.19}, {"text": "so, of course", "start": 212.73, "duration": 0.8}, {"text": "He's also been the target of massive bootleggery. Toys, ripoffs, and especially bootleg video games. It cannot be stopped", "start": 213.53, "duration": 7.889}, {"text": "So today we're going to take a look at some of the most ridiculous Mario bootleg games on the Famicom and NES", "start": 221.97, "duration": 5.419}, {"text": "Let's be honest right out of the gate", "start": 227.939, "duration": 1.88}, {"text": "Most of these games are gonna be pretty bad because bootleggers are lazy, but I guess that's kind of why you're here", "start": 229.819, "duration": 6.809}, {"text": "Right like in this game totally not sponsored by McDonald's! McMario!!", "start": 236.659, "duration": 5.37}, {"text": "That's uh, yeah, that's Mario. All right. Oh this- this is weird", "start": 243.09, "duration": 5.419}, {"text": "I never thought I'd see the day Ronald McDonald walked up to Mario hunched over then asked Mario to retrieve his club cards for him", "start": 248.51, "duration": 6.21}, {"text": "But wait a second. There was those Mario toys at McDonald's not too long ago", "start": 254.79, "duration": 3.83}, {"text": "Maybe this was some sort of sign a premonition even of events to come", "start": 258.63, "duration": 4.13}, {"text": "Oh my god, it was headed so well, but would have got a bootleg work at any and Mario", "start": 262.82, "duration": 5.819}, {"text": "He's so good at this game. He doesn't even need help from Luigi. That's some good sprite swapping", "start": 268.639, "duration": 5.37}, {"text": "Their attention to detail is Keith to bootleggers mater. I mean, it's the kids though", "start": 274.01, "duration": 4.859}, {"text": "Nothing has really changed from the rest of the game. Just a simplistic palette swap for the main kid characters and that's about it", "start": 278.87, "duration": 5.549}, {"text": "Next up we have this one called pizza pop Mario. That sounds freaking sweet", "start": 287.639, "duration": 6.05}, {"text": "Yeah, let's go Mario", "start": 295.139, "duration": 2.0}, {"text": "Look look you got Mario, right?", "start": 301.78, "duration": 2.029}, {"text": "Okay, he's down a beet soup beats about Mario Pizza Papas actually", "start": 303.97, "duration": 5.0}, {"text": "Believe it or not a real team for the NES in Jellico system starring a random delivery kid", "start": 308.97, "duration": 4.5}, {"text": "But you see now it's got that marketing guys because we know kids love Mario and they love pizza", "start": 313.47, "duration": 4.889}, {"text": "It's the perfect match", "start": 318.36, "duration": 1.27}, {"text": "The goal of the game is to reach the end of the stage deliver your pizza and avoid things hurting you he got falling pods", "start": 319.63, "duration": 5.959}, {"text": "Construction workers and lots of guests. They never go away. It's like some sort of infestation has taken over", "start": 325.84, "duration": 6.049}, {"text": "You know, I don't think the people I'm delivering this pizza to are gonna appreciate that", "start": 331.9, "duration": 3.619}, {"text": "It was used to abuse feral cats in this city, but I guess the less they know the better though. My lips are sealed", "start": 335.52, "duration": 6.119}, {"text": "on", "start": 342.18, "duration": 1.06}, {"text": "Second thought I don't think this guy cares much", "start": 343.24, "duration": 2.0}, {"text": "I don't really understand why I'm jumping up the side of the building", "start": 345.24, "duration": 3.27}, {"text": "Are there stairs are the stairs inside the building not good enough for you. This game is pretty zany", "start": 348.51, "duration": 5.489}, {"text": "I mean you fight mobsters on the roof with your pizza", "start": 354.0, "duration": 3.239}, {"text": "It's the heritage story of Mario when he was a young lad out in the world making his way", "start": 357.699, "duration": 5.149}, {"text": "Going from the pizza pop Prentice to the pizza pop master", "start": 363.01, "duration": 3.619}, {"text": "And I mean, this is obviously a real Mario game guys, and if you don't even believe me just read the title on the cartridge", "start": 366.63, "duration": 7.739}, {"text": "Merry pizza pop. Oh", "start": 375.4, "duration": 2.0}, {"text": "It seems like a mistake", "start": 379.21, "duration": 2.0}, {"text": "Next up we have one of my favorites in a pretty famous bootleg called Samari", "start": 385.27, "duration": 4.49}, {"text": "Oh", "start": 397.7, "duration": 1.45}, {"text": "I remember", "start": 399.15, "duration": 2.0}, {"text": "Samara can you guess can you guess what the game is trying to be?", "start": 401.49, "duration": 4.729}, {"text": "Whoa, this is weird. I'm getting some like really crazy early 90s cool dude flashbacks right now", "start": 407.1, "duration": 6.5}, {"text": "You guys never get those what other games do I know you you collect the Rings?", "start": 414.21, "duration": 4.309}, {"text": "Spinning the ball. Then you go to the little roof you loop that's always fun. Are you try doing it kind of works?", "start": 418.86, "duration": 6.739}, {"text": "So if you cannot already tell basically this game is just a demake of the original sonic but with Mario", "start": 426.21, "duration": 7.519}, {"text": "Okay, but why now does someone even come up with an idea like this", "start": 435.36, "duration": 3.98}, {"text": "Do you think the person was just sitting around?", "start": 439.34, "duration": 1.77}, {"text": "It was just like an epiphany struck them - still not one but two different properties, but somehow make it worse", "start": 441.11, "duration": 6.239}, {"text": "Okay, here's the deal. We need a new idea a fresh idea", "start": 448.17, "duration": 4.97}, {"text": "toad", "start": 453.99, "duration": 2.0}, {"text": "Dr. Ham ham", "start": 456.66, "duration": 2.0}, {"text": "You guys are obviously hip with the kids so show me what you get", "start": 461.94, "duration": 4.309}, {"text": "That's just super mario world totally. Mommy told us just a Mario game", "start": 467.55, "duration": 4.759}, {"text": "Dr. Ham ham", "start": 473.58, "duration": 2.0}, {"text": "Let's not leaving a new idea that's just sonic. No it's not good enough Mario Sonic", "start": 478.389, "duration": 7.04}, {"text": "Wait a second Oh, oh my god. We just have to", "start": 488.99, "duration": 6.35}, {"text": "And we'll put it on the end yes that still sells", "start": 507.79, "duration": 2.66}, {"text": "well\nI honestly think that one of my favorite parts of the game isn't the game itself", "start": 510.45, "duration": 4.2}, {"text": "But the plot description on the Wikipedia article the plot", "start": 514.65, "duration": 3.179}, {"text": "What was the plot of me getting stuck in that pit for like 15 minutes that one?", "start": 518.169, "duration": 4.82}, {"text": "Let me just actually say for the record that there is no plot when you press the start button. It just starts", "start": 523.39, "duration": 5.419}, {"text": "So whatever all this is", "start": 529.03, "duration": 2.269}, {"text": "It's all made up the plot of Sumari borrows heavily from that of the first sonic title", "start": 531.52, "duration": 5.719}, {"text": "Samari the adventure an Italian plumber with distinct visual similarities to Mario", "start": 537.73, "duration": 4.79}, {"text": "Okay gonna have to stop you right there distinct visual similarities. That's Mario", "start": 542.62, "duration": 4.609}, {"text": "He still has the M on his head has become lost in his plumbing pipes and has emerged in Sonic's world", "start": 547.57, "duration": 7.07}, {"text": "Wait, don't you think you mean we arrived in a world with distinct visual similarities a Sonic's world don't want to get sued", "start": 554.68, "duration": 5.539}, {"text": "So I guess it's okay to be in Sonic's world, but you don't speak Mario's name. That's not Mario", "start": 560.29, "duration": 4.64}, {"text": "That's Samari the adventurer show some respect", "start": 564.93, "duration": 2.91}, {"text": "Remember the name I think we can all agree though that the one redeeming quality of this game is Samaras Vox cycle", "start": 568.03, "duration": 6.169}, {"text": "It's like a cartoon or something", "start": 574.21, "duration": 2.0}, {"text": "The game progresses through the same stages as the original Sonic and he faced off against Robotnik at the end of each stage like you", "start": 578.29, "duration": 5.66}, {"text": "Would in any other Sonic game? All right, we finally made to the end Robotnik defeated by so Murray", "start": 583.95, "duration": 5.94}, {"text": "Venture dang man. That was so good", "start": 590.47, "duration": 3.77}, {"text": "Somewhere deep in the mystical lands of", "start": 598.21, "duration": 2.449}, {"text": "Like like China or something", "start": 601.3, "duration": 2.48}, {"text": "Probably there lies an infamous Mario bootleg cartridge that contains not one but seven", "start": 603.78, "duration": 6.929}, {"text": "Dude seven whole games that is pizza poppin", "start": 612.97, "duration": 3.469}, {"text": "Never say that again", "start": 617.47, "duration": 2.0}, {"text": "Okay. Yes. There is a cartridge out there with seven different Mario games on it and according to this list", "start": 619.779, "duration": 5.479}, {"text": "We do have actually seven games to choose from so props to that", "start": 625.259, "duration": 3.929}, {"text": "We have Mario three Mario five Mario missing Mario 10, Mario 11", "start": 629.189, "duration": 5.46}, {"text": "Mario 14 and Mario seven now memory is a tricky thing", "start": 634.649, "duration": 4.53}, {"text": "But I don't remember there being more than a few of those numbered Mario games, especially not 14 of them", "start": 639.189, "duration": 5.869}, {"text": "but with the powers of Investigation", "start": 645.069, "duration": 2.0}, {"text": "We actually know that that isn't even", "start": 647.559, "duration": 1.921}, {"text": "Scratching the surface of how many bootlegs of Mario there really are if I had to make a guess", "start": 649.48, "duration": 4.849}, {"text": "the number would be somewhere in the 20s or 30s in terms of how many bootleg games of Mario there actually are", "start": 654.329, "duration": 6.419}, {"text": "That's a lot of Mary. So let's make our way down this list. Shall we Mario 3? Oh", "start": 661.12, "duration": 6.109}, {"text": "It's actually just Super Mario 3", "start": 667.749, "duration": 2.03}, {"text": "You know that amazing game for Nintendo", "start": 669.779, "duration": 2.0}, {"text": "As far as I can tell there weren't any changes made to the game either", "start": 671.98, "duration": 4.369}, {"text": "So I guess it just gets a big thumbs up for me. Good game. Good game. Good game game. All right Mario 5", "start": 676.42, "duration": 8.0}, {"text": "the heck wait", "start": 685.24, "duration": 2.0}, {"text": "This is just Mario 2", "start": 688.269, "duration": 2.0}, {"text": "Ok, so Mario missing", "start": 690.939, "duration": 2.0}, {"text": "Ok, it's just mario is missing", "start": 693.25, "duration": 2.239}, {"text": "murmuring something", "start": 696.49, "duration": 1.469}, {"text": "ok, so it turns out that these are just the basic Mario games nearly identical to the originals and I say nearly because the only", "start": 697.959, "duration": 7.849}, {"text": "Difference I could really find was that peach looks like she's about to murder someone that's with her. She's got the demon eyes like Dracula", "start": 705.809, "duration": 7.2}, {"text": "Oh", "start": 714.61, "duration": 1.229}, {"text": "My god, and she can flow", "start": 715.839, "duration": 2.0}, {"text": "stauros a deal-breaker", "start": 718.24, "duration": 1.68}, {"text": "aside from the game being called Super Bros 5", "start": 719.92, "duration": 2.269}, {"text": "The only other thing I really noticed was that the music was ramped up like a kid discovering sugar for the first time", "start": 722.189, "duration": 4.65}, {"text": "And instead of Mario it says Mario for all intents and purposes, this is Mario too though", "start": 736.01, "duration": 6.109}, {"text": "So I guess that leaves us with the latter four games on to mario ten", "start": 742.16, "duration": 3.95}, {"text": "Superb rose kung-fu Mari. Oh", "start": 748.43, "duration": 3.44}, {"text": "It's a buff Mario. Look at him strut", "start": 753.29, "duration": 2.51}, {"text": "What in the heck is going on here?", "start": 756.44, "duration": 2.39}, {"text": "Did that guy just strike down Mario with a lightning bolt?", "start": 760.01, "duration": 3.019}, {"text": "No, man, I'd be pissed too Mario. Don't worry. We got your back", "start": 763.58, "duration": 4.099}, {"text": "Mario's off on his adventure. Once again to save Asian peach. Don't forget to acknowledge grandpa before we go off on our adventure", "start": 768.2, "duration": 6.38}, {"text": "that's a must", "start": 774.92, "duration": 2.0}, {"text": "Dude Mario, you're just like such a badass you know that right? So this is super bros 10 and kung-fu mari", "start": 783.329, "duration": 6.2}, {"text": "It's a 2d platformer where you can jump punch kick admire Mario's head on his body and you can even hop token", "start": 789.81, "duration": 7.159}, {"text": "That's exactly what this game needed", "start": 797.1, "duration": 2.03}, {"text": "Okay. I admit it. This game wasn't originally a Mario game. I", "start": 799.769, "duration": 6.23}, {"text": "Know it was a pretty well hidden secret this game was just in fact another sprite swap of a game called Jackie Chan action", "start": 807.029, "duration": 7.64}, {"text": "Kungfu, that's I yeah get a lot of that cover man", "start": 814.829, "duration": 4.7}, {"text": "What an honor I mean, have you ever been a bootleg of a Jackie Chan? I didn't think so", "start": 819.66, "duration": 5.239}, {"text": "Also if this happened and here's a freakin", "start": 825.75, "duration": 2.419}, {"text": "Stuff we have Mario 11. So it looks like we got Mario here hanging out with this side girl", "start": 829.529, "duration": 5.78}, {"text": "Uh-oh does beach know about this. Well, I mean, I guess technically they're not Facebook official am I right? Oh, no", "start": 835.579, "duration": 7.5}, {"text": "aliens", "start": 843.75, "duration": 2.0}, {"text": "Damn", "start": 846.759, "duration": 1.171}, {"text": "supergirls left LeBron's meant for the 11th time", "start": 847.93, "duration": 2.839}, {"text": "Okay, so this is just adventure island 3, but let's not forget the important detail that Master Higgins is replaced with Mario", "start": 851.47, "duration": 6.169}, {"text": "That's what's important here", "start": 857.639, "duration": 1.351}, {"text": "That's a clearly Mario now and not only that but this is actually a cheap version of the game with tons of resources", "start": 858.99, "duration": 6.509}, {"text": "So you can basically just power your way through the game and do whatever you want. Boom", "start": 865.499, "duration": 3.99}, {"text": "Rad Mario can ride dinosaurs now and that's never even up been done before not not even a look a little twinkle in Miyamoto's eye", "start": 869.49, "duration": 7.739}, {"text": "Okay, I know what you guys gonna say. But no, this is clearly mario. I mean see there there is coin", "start": 877.689, "duration": 5.93}, {"text": "I think my favorite thing about this bootleg is the way that Mario's model changes on different dinosaurs", "start": 883.62, "duration": 5.579}, {"text": "I mean you have the classic Mario but once he gets on a dinosaur you got chubby Mario the seizure Mario and hands-down the best", "start": 889.199, "duration": 6.84}, {"text": "Weird mustache Mario and lucky for us weird mustache Mario also has the feature of having a melting face when jumping on a dinosaur", "start": 896.249, "duration": 6.99}, {"text": "Oh, yeah, that's good", "start": 903.24, "duration": 2.0}, {"text": "Well, I guess if you're looking for a version of adventure Island that's easier then I guess this bootleg is for you", "start": 905.41, "duration": 5.539}, {"text": "Alright, super bros 14. Here we go", "start": 912.189, "duration": 2.96}, {"text": "So asian peach is back in mario 14 and there's some bad guys asian peach decides that she wants to get this business", "start": 915.279, "duration": 5.899}, {"text": "Sorted and the best form of communication is to throw a paper airplane to this guy who catches the paper airplane and then plot-twists", "start": 921.339, "duration": 6.71}, {"text": "Transforms into Mario in the blink of an eye. We never saw that coming. He's a master of disguise", "start": 928.54, "duration": 4.07}, {"text": "Also white polo Owoh Owoh there's actual Mario enemies in this game. This is some next-level stuff who made this Oh,", "start": 934.509, "duration": 7.1}, {"text": "1993 Wario Mario", "start": 942.579, "duration": 2.0}, {"text": "Made this in this game. We play as Mario of course, and we have a kick-ass mow staff", "start": 944.679, "duration": 5.15}, {"text": "even throughout these almost energy like attacks against most enemies with your staff and you can even use the staff to bounce off of", "start": 949.829, "duration": 5.669}, {"text": "Ledges and pogo stick around like you're screwed McDuck and that's not Mario reverting back to his original sprite", "start": 955.569, "duration": 5.72}, {"text": "It's Mario fighting his inner demons, but sometimes you can't help it", "start": 961.29, "duration": 4.26}, {"text": "They just come out", "start": 966.12, "duration": 1.99}, {"text": "Probably or again. Most of these pirate bootleggers take the easy way out. Where's all the original content those original games?", "start": 968.11, "duration": 7.01}, {"text": "Well, I hate to break it to you guys, but this is in fact just another reskin of a game called kid", "start": 975.43, "duration": 5.239}, {"text": "Nicky radical ninja 3", "start": 980.67, "duration": 1.83}, {"text": "I'm not sure quite what the obsession is with turning Mario into a ninja or kung-fu master", "start": 982.5, "duration": 4.89}, {"text": "But at least he's had many games now to perfect his craft. The game itself is actually pretty fun", "start": 987.39, "duration": 5.099}, {"text": "well", "start": 992.5, "duration": 0.839}, {"text": "except for the bosses", "start": 993.339, "duration": 1.171}, {"text": "It is kind of do the same", "start": 994.51, "duration": 1.47}, {"text": "thing forever and it's really tedious and stupid and I do actually have to hand it to Wario for adding actual Mario enemies to the", "start": 995.98, "duration": 7.25}, {"text": "game", "start": 1003.23, "duration": 2.0}, {"text": "That's not a Mario enemy, okay one last game on our list Mario seven", "start": 1016.77, "duration": 7.64}, {"text": "What in the heck", "start": 1038.949, "duration": 2.0}, {"text": "seven grand dad", "start": 1041.65, "duration": 2.0}, {"text": "What is this?", "start": 1043.69, "duration": 2.0}, {"text": "Okay, every once in a while, you just see something that doesn't make any sense", "start": 1045.73, "duration": 4.46}, {"text": "The title says Mario seven, but clearly the title is seven grand den with grand dad. And why?", "start": 1050.74, "duration": 7.7}, {"text": "If you didn't realize already the title music is actually just the Flintstones and the game is a sprite swap of an actual", "start": 1059.35, "duration": 6.77}, {"text": "Flintstones game what is this? They didn't even try and even do anything. It's just the regular intro. Oh", "start": 1066.37, "duration": 6.079}, {"text": "I", "start": 1078.79, "duration": 1.11}, {"text": "See, yeah, that seems about right", "start": 1079.9, "duration": 2.179}, {"text": "So this is seven grand dad. I mean, it's either granddad or Tsar like some old guy behind the scenes pulling the strings", "start": 1082.66, "duration": 6.14}, {"text": "I can't honestly tell let's be honest", "start": 1088.8, "duration": 2.76}, {"text": "I'm actually just more fascinated with the title screen", "start": 1091.56, "duration": 2.369}, {"text": "The fact that the game is called seven grand dad than I am with the actual game itself", "start": 1093.93, "duration": 4.019}, {"text": "In the game though, you play as Mario?", "start": 1098.8, "duration": 2.119}, {"text": "As he makes his way through what I can only assume is a prehistoric version of the Mushroom Kingdom", "start": 1102.58, "duration": 4.73}, {"text": "Well are an even more prehistoric version of the Mushroom Kingdom?", "start": 1107.74, "duration": 3.979}, {"text": "You could climb up ledges batch things over the head with your club play some b-ball, you know the norm", "start": 1111.88, "duration": 5.15}, {"text": "Oh, no, I can't show that that's not even Mario", "start": 1117.03, "duration": 3.54}, {"text": "And probably two of my favorite things the ring button", "start": 1121.48, "duration": 3.469}, {"text": "And the button that lets you break the fourth wall, can you believe this", "start": 1126.72, "duration": 4.429}, {"text": "Now I know I'm not the first to discover seven granddad and I won't be the last in fact as far as I know Joel", "start": 1136.08, "duration": 6.229}, {"text": "From vine sauce is one of the first to discover this bootleg", "start": 1142.309, "duration": 2.52}, {"text": "So credit where credit is due and if you're into really weird enough skier stuff, then you should probably check out his channel", "start": 1145.23, "duration": 5.9}, {"text": "I honestly couldn't help myself. It's just such a weird find like how does this even happen?", "start": 1151.13, "duration": 5.009}, {"text": "And no part of the title doesn't actually say Mario, but that is certainly Mario", "start": 1156.929, "duration": 5.51}, {"text": "Alright and Fred Flintstone, but I think that's gonna be enough bootlegs for one day", "start": 1162.539, "duration": 5.479}, {"text": "It hurts", "start": 1170.1, "duration": 1.319}, {"text": "So I'll get you guys on the next episode and be sure to LIKE the video if you enjoyed this and until the next time", "start": 1171.419, "duration": 5.66}, {"text": "Stay hand", "start": 1177.33, "duration": 2.0}, {"text": "Hey guys", "start": 1184.2, "duration": 0.74}, {"text": "Thank you so much again for watching the video and a big shout out to the sponsor of this video", "start": 1184.94, "duration": 4.29}, {"text": "Next games for sponsoring the walking dead app game with me check it out the download links in the description down below", "start": 1189.299, "duration": 5.329}, {"text": "And if you liked this video and you want to see more videos like these be sure to subscribe to the channel and click that", "start": 1194.7, "duration": 5.179}, {"text": "Like button and comment down below. I want to hear your thoughts on the stuff and things like what is your favorite?", "start": 1199.879, "duration": 5.46}, {"text": "Bootleg version of Mario I gots to know", "start": 1205.98, "duration": 2.719}, {"text": "and if you just can't wait for more videos got two more videos for you right there the first Mario bootleg video I did and", "start": 1208.919, "duration": 6.29}, {"text": "Creepy Mario games. Alright, I'm out now bite", "start": 1215.7, "duration": 3.229}]