[{"text": "Before we dive into this feature a big thanks to Skillshare for sponsoring key productive", "start": 0.03, "duration": 4.019}, {"text": "this month Skillshare is an online learning community for creators with more than", "start": 4.049, "duration": 4.41}, {"text": "25,000 classes you can get hold of a premium membership which gives you unlimited access to those classes for less than", "start": 9.309, "duration": 6.77}, {"text": "$10 a month you can join over 7 million creators learning on Skillshare and", "start": 16.42, "duration": 4.969}, {"text": "You will get a 2 month free trial in the description below. I highly recommend Skillshare", "start": 21.789, "duration": 6.29}, {"text": "I create classes on there myself", "start": 28.08, "duration": 1.41}, {"text": "But I would recommend checking out Thomas Frank's latest one on productivity systems as well as Lindsey Holmes's one on", "start": 29.49, "duration": 7.229}, {"text": "Productivity with Evernote, especially if you're looking to deep dive into that tool and if you do have an extra moment", "start": 37.09, "duration": 5.959}, {"text": "I'd check out productivity habits that stick with the legend Mike Vardy", "start": 43.05, "duration": 4.919}, {"text": "Anyway guys, thanks so much and thanks to skill chair for sponsoring this video", "start": 48.129, "duration": 3.89}, {"text": "Hello everyone and welcome back to the Keep Productive YouTube channel", "start": 52.719, "duration": 3.68}, {"text": "It is so good to have you back now in today's feature", "start": 56.399, "duration": 2.79}, {"text": "what I wanted to do is talk to you briefly about how I moved from barre notes and", "start": 59.35, "duration": 5.36}, {"text": "Trello over to notion now", "start": 65.199, "duration": 2.779}, {"text": "Hopefully and the outcome in this video is to show you how you can potentially combine an experience", "start": 68.02, "duration": 5.959}, {"text": "but also giving you some advice on how to do this effectively because I think a lot of time people rush this and", "start": 74.049, "duration": 6.17}, {"text": "It's important to notes that you don't necessarily need to rush this", "start": 80.47, "duration": 3.469}, {"text": "Right away, of course. It's important to take that time. Make sure you've got the right application before you make some big leaps", "start": 84.759, "duration": 6.71}, {"text": "So let me explain I actually started using Bear Notes when I started actually", "start": 91.78, "duration": 5.12}, {"text": "Investing time in the YouTube channel scripting so I would spend most of my time on bare notes writing out scripts to future videos", "start": 97.42, "duration": 7.04}, {"text": "Now, of course, I'd use Bear Notes pretty regularly because I liked how it broke down the text", "start": 104.79, "duration": 5.639}, {"text": "I liked the markdown. I liked that it was a writer application that had distraction for experience", "start": 110.43, "duration": 5.309}, {"text": "I could quite easily write notes store them in a scripts hash tag", "start": 115.74, "duration": 4.11}, {"text": "Which is the notebook set up inside a bear and I found it a really good experience now", "start": 119.85, "duration": 5.519}, {"text": "I don't want to take away from this. I actually really do like bear and I do still recommend", "start": 125.369, "duration": 4.47}, {"text": "It is a great note-taker and writer application", "start": 129.84, "duration": 3.63}, {"text": "however", "start": 133.84, "duration": 0.51}, {"text": "at that time I was using it for about two years and then I sort of felt like", "start": 134.35, "duration": 4.819}, {"text": "I could be doing this inside of one application", "start": 139.54, "duration": 3.11}, {"text": "now obviously I had a key interest there and that was to script videos and", "start": 143.59, "duration": 5.059}, {"text": "I was also using Trello now", "start": 148.959, "duration": 2.27}, {"text": "I use Trello for a solid two years as well in the same sort of time zone there that I used Barre notes and", "start": 151.23, "duration": 6.15}, {"text": "Of course, both of those applications worked pretty well, and then I started using notion for about a year", "start": 157.45, "duration": 6.619}, {"text": "So about a year into notion use I thought okay", "start": 164.069, "duration": 3.51}, {"text": "I could actually combine both my scripting which was all my notes for future videos and", "start": 167.58, "duration": 5.909}, {"text": "My actual plan my sort of schedule my content calendar from Trello and put them together", "start": 174.7, "duration": 5.419}, {"text": "No, I was using Trello is essentially my content calendar. I had a full year worth of videos using thumbnails", "start": 180.37, "duration": 7.61}, {"text": "planning what the topics were and you know actually tagging the videos that I", "start": 188.53, "duration": 4.94}, {"text": "Linked in so it was all very helpful and actually hannah is an access", "start": 193.78, "duration": 3.86}, {"text": "Open so that people could suggest future videos now. I'm really not knocking Trello here. It was a fantastic experience", "start": 198.01, "duration": 6.53}, {"text": "I just personally noted that I was using two applications for the experience", "start": 204.7, "duration": 5.66}, {"text": "So I started using notion as my content calendar and I did it very very lightly", "start": 210.7, "duration": 5.36}, {"text": "Actually starting with the editorial calendar with me and Alice and then I started using it for the YouTube calendar", "start": 216.73, "duration": 7.639}, {"text": "Now just to be clear the editorial calendar use was almost like an experiment", "start": 224.56, "duration": 4.729}, {"text": "I would start by creating a very simple table and", "start": 229.29, "duration": 3.569}, {"text": "Embedding everything that I would for example all the upcoming features on the blog for and what I did inside of Trello", "start": 233.47, "duration": 7.16}, {"text": "Inside of this table now when it comes to scripting I'd open up the page", "start": 241.0, "duration": 5.299}, {"text": "That was actually about the certain topic or the certain video and then start writing about it", "start": 246.609, "duration": 5.69}, {"text": "Now as you can imagine this combined both uses bear and Trello now", "start": 252.609, "duration": 5.24}, {"text": "I definitely had some reservations to start off with I really didn't like the fact that I didn't get that markdown ability", "start": 257.85, "duration": 6.089}, {"text": "For example, I really like the way that bear delivered the script because I would open up bear and it'd be really accessible", "start": 263.94, "duration": 7.179}, {"text": "I definitely found the bear application faster and something that I find really liking to write", "start": 271.12, "duration": 6.209}, {"text": "for example, I just liked to write out long form pieces of scripting and", "start": 277.33, "duration": 4.5}, {"text": "Also, I liked Trello because it was colorful and and very useful and I was using with a lot of clients at the time", "start": 282.59, "duration": 5.869}, {"text": "So it actually became an application. I'd be opening a lot of during my day", "start": 288.68, "duration": 3.589}, {"text": "However, after I started using that editorial calendar as a sort of starter", "start": 292.94, "duration": 4.639}, {"text": "I think that actually really helped is actually having a smaller project to work alongside. There's not directly correlated", "start": 297.58, "duration": 7.44}, {"text": "So I was still using barren Trello at the same time", "start": 305.02, "duration": 3.029}, {"text": "But I was experimenting with an element of the work I was doing so actually having", "start": 308.06, "duration": 7.04}, {"text": "Those sort of mini experiment gave me a lot more time to think about whether this was suitable", "start": 315.53, "duration": 4.549}, {"text": "Now after 2 months of using that I then invested into creating the YouTube content calendar there and I then put more time and attention", "start": 320.33, "duration": 8.0}, {"text": "Into the property's experience inside of notion", "start": 328.729, "duration": 3.14}, {"text": "so now I have a lot of different properties set up and actually have a full content calendar here and it has really really", "start": 332.03, "duration": 6.23}, {"text": "Helped now what advice I'd give to people who are looking at actually combining two experiences", "start": 338.479, "duration": 5.809}, {"text": "maybe you're looking at bringing some of your meeting notes from Evernote and", "start": 344.51, "duration": 4.19}, {"text": "Maybe some of your project planning into notion now, that's actually a genuine", "start": 349.28, "duration": 5.089}, {"text": "You know actual opportunity and of course, it's something to definitely consider", "start": 354.919, "duration": 3.65}, {"text": "But the thing that I'd know it's just making sure whether it's suitable for you", "start": 358.849, "duration": 4.16}, {"text": "I would definitely recommend running a one to two months trial using a very simple", "start": 363.01, "duration": 6.239}, {"text": "Element of your existing work. So for example, if you are planning projects and your mate taking meeting notes", "start": 369.83, "duration": 7.279}, {"text": "Why don't you pick a certain topic or maybe even the people you work with?", "start": 377.3, "duration": 4.88}, {"text": "So for example any future meetings with Bob", "start": 382.31, "duration": 3.109}, {"text": "I will now and and in manage and", "start": 385.419, "duration": 3.33}, {"text": "Project manage inside of notion in one experience and in trial it see whether it's suitable for you giving yourself", "start": 389.06, "duration": 7.01}, {"text": "time to breathe understand the features and actually", "start": 396.289, "duration": 3.38}, {"text": "So that you're not fully moving your experiences over now sadly", "start": 400.5, "duration": 4.079}, {"text": "There isn't a import from Bayer so I wasn't able to import all of my previous scripts", "start": 404.58, "duration": 5.73}, {"text": "However, you can import from Trello if you're looking to move your projects over", "start": 410.71, "duration": 5.149}, {"text": "so there is some possibilities with that now obviously that was just a short story about me using Trello and bear and how I", "start": 415.86, "duration": 7.38}, {"text": "Combine the experiences but one I definitely recommend is sitting down and evaluating your ones", "start": 423.43, "duration": 5.63}, {"text": "I noticed that I was using two applications for something that I could fix with one. So it's definitely something to consider", "start": 429.06, "duration": 7.29}, {"text": "Now, I've only recently been looking at this with for example, Google Calendar", "start": 436.99, "duration": 5.96}, {"text": "I was you know when I come back from holiday", "start": 442.95, "duration": 2.759}, {"text": "I notice that I was booking a lot of meetings and now I'm actually considering do I use Google Calendar and calendly or", "start": 445.71, "duration": 7.2}, {"text": "Do I just combined my experiences and use woven calendar?", "start": 453.61, "duration": 3.62}, {"text": "Because that might be a better way of doing it is just having a fewer", "start": 457.39, "duration": 4.279}, {"text": "Google Calendar application which is woven and the scheduler in one so that I'm not necessarily", "start": 462.25, "duration": 4.76}, {"text": "Duplicating my experiences. I'm just using one application that will then combine those experiences", "start": 467.65, "duration": 5.6}, {"text": "so I definitely recommend continuing to look at your systems without necessarily going to", "start": 473.41, "duration": 5.54}, {"text": "Aggressively do this in and with lots of plenty of time. That's my biggest recommendation to you guys", "start": 479.35, "duration": 6.41}, {"text": "Anyway guys, please let me know in the comments, which is useful. I'm planning to do a all my tools feature", "start": 486.16, "duration": 5.809}, {"text": "so I'd really love to hear your opinions on whether you'd like to see that because I'm", "start": 492.13, "duration": 3.979}, {"text": "Would love to plan and release out and even guys a big. Thank you and I'll talk to you guys in a future video", "start": 496.36, "duration": 5.93}, {"text": "cheers, everyone", "start": 502.479, "duration": 2.0}]