[{"text": "Pre-video Dom: \"This video has been brought to you by NordVPN. Use the code DOMICS at NordVPN.com/DOMICS", "start": 0.82, "duration": 7.7}, {"text": "for 66% off a 2 year plan.", "start": 8.62, "duration": 3.6}, {"text": "*Intro music*", "start": 12.22, "duration": 3.06}, {"text": "Dom: \"With all of the videos I've made about driving and my complaints about other people's abilities behind the wheel,", "start": 16.56, "duration": 5.78}, {"text": "you'd assume I'm a pretty good driver with no record.\"", "start": 22.42, "duration": 2.899}, {"text": "\"Haha,", "start": 25.42, "duration": 0.5}, {"text": "wrong.  I am a filthy hypocrite. (Good you admitted it) Last year", "start": 26.04, "duration": 2.7}, {"text": "I got a ticket for speeding ( SANIC GOTTA GO FAST) in a school zone, which, if you didn't know, is an automatic fail on your driving test.", "start": 28.8, "duration": 6.56}, {"text": "Actually looking back, I technically wasn't in the school zone yet, and I was just trying to keep up with traffic.", "start": 35.739, "duration": 5.81}, {"text": "But I'll own up to my ignorance and admit that I didn't realize I was actually going that fast.", "start": 41.8, "duration": 4.939}, {"text": "You can tell that specific area is a hotspot for speeders because there's a nice little nest for them Dodge", "start": 46.84, "duration": 5.569}, {"text": "Chargers to perch on. (IKR)  I sped past an incognito cop, saw the flashing lights in my mirror and after some initial", "start": 52.48, "duration": 6.439}, {"text": "delusion that it wasn't for me... No, it can't possibly be. Oh wait it is, I pulled over. Now,", "start": 59.05, "duration": 6.59}, {"text": "I got my driver's license when I was", "start": 65.64, "duration": 2.0}, {"text": "21.  Might seem a little late to some of you because you probably started driving right when you hit puberty.", "start": 67.84, "duration": 5.27}, {"text": "I know you don't need to tell me. You're probably", "start": 73.119, "duration": 2.93}, {"text": "5' 11\" (1.8m) at the age of 13 and feel the need to remind me that I'm short.", "start": 76.049, "duration": 3.601}, {"text": "I know, you don't need to tell me. But do know that I was a university student who", "start": 79.65, "duration": 4.68}, {"text": "commuted everyday to school in a city where it's a nightmare to drive. (Ouch)", "start": 84.43, "duration": 4.099}, {"text": "So the only times I could drive was during my free time on the weekends, which was usually non-existent.", "start": 88.81, "duration": 6.29}, {"text": "It wasn't worth paying insurance to be an inactive driver,", "start": 95.1, "duration": 3.12}, {"text": "but I eventually got a part-time job and decided on getting my G2", "start": 98.5, "duration": 3.47}, {"text": "soon after my 21st birthday and for the next six years, until last year,", "start": 102.07, "duration": 5.0}, {"text": "I was never in an accident nor ticketed for vehicular misconduct. And", "start": 107.07, "duration": 3.75}, {"text": "then I went 80kmph in a school zone... Which is an unacceptable amount to pass the 40 kilometer per hour limit as", "start": 111.0, "duration": 6.659}, {"text": "competent of a driver as I believed to be, I probably deserved that ticket. The cop gave me the whole,", "start": 118.06, "duration": 6.02}, {"text": "Cop: \"Do you know how fast you were going?\" speil and I was nothing but cooperative in the conversation.", "start": 124.08, "duration": 5.14}, {"text": "Dom: \"Officer I was going so fast that you're not even speaking to me, this just my afterimage.\"(Bye felicia)", "start": 129.38, "duration": 4.98}, {"text": "He asked for my license, insurance policy, and proof of ownership, cool.", "start": 134.37, "duration": 4.5}, {"text": "Here's my license and my insurance policy and let me just get my other document from the", "start": 138.909, "duration": 4.669}, {"text": "The empty glove compartment. Why are my documents not here? Oh, yeah. That's right", "start": 144.549, "duration": 4.639}, {"text": "I recently got my car detailed and took everything out and forgot to put it back in.", "start": 149.188, "duration": 4.252}, {"text": "*sigh* uhhhhhhhhhhh...", "start": 154.1, "duration": 2.52}, {"text": "Cop: \"Sir, are you aware that your policy expired a month ago?\"", "start": 156.78, "duration": 3.08}, {"text": "*Dolphin sound* with ood mouth", "start": 159.86, "duration": 1.39}, {"text": "*Dolphin Sounds*", "start": 161.25, "duration": 1.39}, {"text": "*rhythmically smacking dolphin sounds*", "start": 162.64, "duration": 5.18}, {"text": "Dom: \"No.\"", "start": 168.12, "duration": 1.8}, {"text": "Cop: \"Please remain in your car.\" The police officer went back inside his car for a few minutes.", "start": 169.92, "duration": 3.38}, {"text": "I assume he went to check my records (and steal your identity) and then he returned to my car.", "start": 173.31, "duration": 3.779}, {"text": "He saw that my record was clean and decided to cut me some slack.", "start": 177.09, "duration": 3.059}, {"text": "Cop: \"I understand", "start": 180.31, "duration": 1.37}, {"text": "this is your first offense, but I'm still gonna have to ticket you for speeding.", "start": 181.68, "duration": 3.239}, {"text": "But, I'll only mark you for going ten over, All right?\"", "start": 185.139, "duration": 4.04}, {"text": "*Nods head repeatedly* (Looks like having seizure)", "start": 189.179, "duration": 0.941}, {"text": "Cop: \"I can waive your other charges if you can provide those documents in court, you'll be contacted for an appointed date.\"", "start": 190.239, "duration": 5.661}, {"text": "Dom: \"Thank you officer.  I'd really appreciate it.\"", "start": 195.9, "duration": 2.3}, {"text": "Cop: \"All right, you have a good day, sir.\"", "start": 198.3, "duration": 1.509}, {"text": "*phew* Ok...", "start": 199.809, "duration": 2.191}, {"text": "Dom: \"I maintained a 10 kilometer per hour speed below the limit for the next few weeks. The next day,", "start": 202.4, "duration": 5.47}, {"text": "I immediately went to go pay the speeding ticket, And then I got my documents together for the court hearing that was scheduled four months", "start": 207.87, "duration": 5.94}, {"text": "later. And so I waited for the day to arrive... As it approached,", "start": 213.81, "duration": 3.779}, {"text": "I remember working on a video deadline and staying up late one night. The court hearing was the next day at 10:00 a.m", "start": 217.59, "duration": 5.669}, {"text": "and I remember contemplating whether to just stay awake for a few more hours until then.", "start": 223.259, "duration": 4.44}, {"text": "I spent too long thinking about it that I was already on that path, but somehow I didn't make it for 10 A.M.", "start": 227.919, "duration": 6.23}, {"text": "I didn't make it to 11. In fact, I didn't even wake up at noon! I somehow fell asleep and woke up at 4:00 P.M! (Jesus Christ)", "start": 234.15, "duration": 7.979}, {"text": "Holy shhhiiittt. I jumped up from my bed, So violently that I ended up on the roof of my condo building. (3rd editor: I have to remove all parenthesis now.)(fourth editors had to fix most mistakes)", "start": 243.219, "duration": 5.93}, {"text": "I didn't know what to do. I looked up the number for the courthouse and called, voicemail said they were closed...", "start": 249.15, "duration": 6.119}, {"text": "I checked their hours to call the next day. They were closed on weekends, Oh", "start": 255.269, "duration": 3.809}, {"text": "my girth...", "start": 259.079, "duration": 1.16}, {"text": "I remember reading in the letter or somewhere that if you are absent without informing the court prior to the date,", "start": 260.239, "duration": 5.16}, {"text": "The judge can issue a warrant for your arrest. (GET DOM!)And I know it was just a speeding ticket with failure to provide some documents,", "start": 265.4, "duration": 6.899}, {"text": "but, Hahaha, I", "start": 272.3, "duration": 1.929}, {"text": "panicked. I called 9-1-1", "start": 274.229, "duration": 1.801}, {"text": "9-1-1 Lady: \"Hello. What is your emergency?\"", "start": 276.03, "duration": 1.94}, {"text": "Dom: \"Hi, this this isn't an emergency,", "start": 277.97, "duration": 2.009}, {"text": "I just wasn't sure what number to call.\"   Someone probably got murdered because I occupied the line. I explained my situation", "start": 279.979, "duration": 7.26}, {"text": "and although I could feel how much of an idiot she thought I was, she was helpful and explained my options.", "start": 287.55, "duration": 5.66}, {"text": "Which were nothing. I simply had to wait for Monday to call the court again", "start": 293.669, "duration": 3.98}, {"text": "and when I did I was", "start": 297.65, "duration": 1.9}, {"text": "informed that not only was I absent", "start": 299.55, "duration": 2.51}, {"text": "but so was the officer that ticketed me. And I believed my charges would have been waived if I was just there, but because we", "start": 302.13, "duration": 6.919}, {"text": "Both weren't they rescheduled the hearing and you bet your gas hole I didn't sleep in that time.", "start": 309.05, "duration": 5.13}, {"text": "They usually group a couple hearings together because many are short and get resolved quickly.", "start": 314.22, "duration": 4.399}, {"text": "The person in line in front of me turned around and did a double-take.", "start": 318.76, "duration": 3.62}, {"text": "Random Stranger: \"Are you Domics?\"", "start": 322.38, "duration": 0.92}, {"text": "Dom: What an inconvinient place for a fan to recognize me, I could probably just lie...", "start": 323.86, "duration": 5.32}, {"text": "Dom: \"Yeah, that's me. I'm just here for a speeding ticket, How about you?\"", "start": 329.46, "duration": 3.02}, {"text": "Random Stranger: \"I ran a red light and killed a family.\"", "start": 332.48, "duration": 1.94}, {"text": "(Awkward Silence Thinking  about why the guy isn't in jail.)", "start": 334.42, "duration": 2.0}, {"text": "I'm just kidding, but I remember it being more serious than a speeding ticket", "start": 336.87, "duration": 3.529}, {"text": "Anyway, the police officer that ticketed me came into the room and approached me. He seemed almost", "start": 340.77, "duration": 4.94}, {"text": "hospitable with what he told me to do and say once my name was called up and assured me that I'd be okay.", "start": 346.53, "duration": 5.209}, {"text": "I mean, I knew my offense wasn't that serious, but he kind of seemed like a bro for making sure things went smoothly.", "start": 351.979, "duration": 5.58}, {"text": "I don't know. Maybe it was just me. Uh, mister puhhpu", "start": 357.56, "duration": 3.18}, {"text": "ponge-a-bob (Pang-a-nee ban what is so hard bout this)", "start": 362.16, "duration": 2.0}, {"text": "(That sounds awfully close to a butchering of my last name.)", "start": 364.8, "duration": 4.16}, {"text": "(I sure hope someone in here is actually named at Ponge-a-bob.)", "start": 368.99, "duration": 5.19}, {"text": "(I guess that's a nope, nobody here,)", "start": 375.18, "duration": 2.209}, {"text": "Okay, yeah, that's me.", "start": 378.93, "duration": 2.0}, {"text": "Man, I'm really glad that cop cut me some slack, but you know who wouldn't be as nice?", "start": 382.11, "duration": 4.13}, {"text": "Freakin' hackers.(CHEAP) If you guys want peace of mind while we are on the web check out our sponsor for today NordVPN by using", "start": 387.18, "duration": 6.32}, {"text": "the code DOMICS at NordVPN.com/DOMICS", "start": 393.65, "duration": 3.57}, {"text": "for 66 percent off a two-year plan. It's easy. It's simple, ten out of ten best VPN", "start": 397.3, "duration": 6.52}, {"text": "Virtual Private Networks are a great way to protect your privacy and security online", "start": 404.0, "duration": 3.959}, {"text": "Allowing you to surf the net anonymously with absolutely no data logging using military-grade encryption with its thousands of servers in over 60 countries", "start": 408.479, "duration": 7.97}, {"text": "It's lightweight and user-friendly interface. You can virtually be wherever you want to be without actually being there", "start": 416.699, "duration": 6.62}, {"text": "I travel pretty frequently and you can never be too safe when connecting to certain networks", "start": 423.32, "duration": 4.469}, {"text": "Last thing you want is to get all your info stolen your privacy deserves to be protected(PREACH!)", "start": 428.01, "duration": 4.189}, {"text": "It's real easy to use you just boot it up and literally choose where you want to be. My neighbors below. I'm there", "start": 432.389, "duration": 6.559}, {"text": "Maybe I feel like being in France.  Bonjour!  I can even keep going and be in Japan.  Konnichiwa!", "start": 439.05, "duration": 5.929}, {"text": "Super fast servers, protect up to six devices at once, available on Android, iOS, Windows, and Mac OS", "start": 445.59, "duration": 6.109}, {"text": "If you're still iffy about it, give it a try. You have 30 days to get your money back...", "start": 452.009, "duration": 4.52}, {"text": "...guaranteed. Once again, that's NordVPN.com/DOMICS with the code DOMICS for", "start": 456.9, "duration": 5.959}, {"text": "66% off a two-year plan.", "start": 463.0, "duration": 2.5}, {"text": "Enjoy, and stay safe.", "start": 465.74, "duration": 2.0}, {"text": "Captions Contributors: HoneyDew Melon, Dreemurr, agaveboy, AveryTube HD", "start": 469.24, "duration": 1.08}]