[{"text": "In 1994, a massive earthquake shook the Northridge suburb of Los Angeles, killing 57", "start": 1.9, "duration": 5.8}, {"text": "people and injuring over 5000. The cost of damages was in excess of $20 billion. It's", "start": 7.7, "duration": 7.54}, {"text": "earthquakes like this one that make us question just how solid is the earth beneath our", "start": 15.24, "duration": 5.52}, {"text": "feet, and what does it mean to be solid anyway?", "start": 20.76, "duration": 4.7}, {"text": "At first glance, pitch looks like a solid, but it's not. It's actually a liquid at room", "start": 25.46, "duration": 6.12}, {"text": "temperature—just a very viscous one. Viscosity is a measure of resistance to flow—what we", "start": 31.58, "duration": 7.06}, {"text": "often think of as the \"thickness\" of a liquid. Olive oil is nearly 100 times more viscous", "start": 38.64, "duration": 5.84}, {"text": "than water, and honey is about 100 times more viscous than that. Meanwhile, pitch has a", "start": 44.48, "duration": 5.98}, {"text": "viscosity 2.3×10¹¹ times that of water. At the university of Queensland in Australia,", "start": 50.46, "duration": 6.58}, {"text": "pitch is the subject of the world's longest running lab experiment, and it's still going to this day.", "start": 57.04, "duration": 6.72}, {"text": "Back in 1927, this glob of pitch was placed into a funnel, and ever since then, in nearly", "start": 63.76, "duration": 6.74}, {"text": "90 years, it has produced only 9 drips—roughly 1 a decade—and no one has ever been in the", "start": 70.5, "duration": 7.78}, {"text": "room to see a drop fall. Though in 1988, the former custodian of the experiment, John Mainstone,", "start": 78.28, "duration": 7.76}, {"text": "came very close to observing a drip fall, except he stepped out of the room", "start": 86.04, "duration": 5.98}, {"text": "for just a few minutes to get a cup of tea. Now, you can actually watch this experiment", "start": 92.02, "duration": 7.52}, {"text": "live—there's a link in the description—but since the last drop happened in 2014, I think", "start": 99.54, "duration": 5.26}, {"text": "you'll probably be waiting a while.", "start": 104.8, "duration": 2.44}, {"text": "Another substance that you may have heard is a very viscous liquid is glass. If you look", "start": 107.24, "duration": 4.54}, {"text": "at the stained glass windows of old churches, you'll find the bottom of the pane is", "start": 111.78, "duration": 4.3}, {"text": "decidedly thicker than the top, and that's because the glass has been flowing down over", "start": 116.08, "duration": 4.94}, {"text": "centuries... Actually, no, it hasn't! You know, we've looked at old telescopes where the", "start": 121.02, "duration": 7.48}, {"text": "optics is very sensitive to slight shifts in the lens glass, and we find they still work", "start": 128.5, "duration": 5.02}, {"text": "perfectly after hundreds of years. Plus, studies of thousand year old windows find no", "start": 133.52, "duration": 5.64}, {"text": "real evidence of flow. So the truth is that it's just very difficult to make glass of", "start": 139.16, "duration": 5.72}, {"text": "uniform thickness, and so when the glass was originally installed thousands of years ago,", "start": 144.88, "duration": 5.2}, {"text": "they would install the thickest part towards the bottom. The lead actually has a lower", "start": 150.08, "duration": 4.7}, {"text": "viscosity than the glass, so if the glass had even thickened a little bit, then the lead", "start": 154.78, "duration": 4.9}, {"text": "should be a puddle on the floor by now.", "start": 159.68, "duration": 2.82}, {"text": "Now, glass is unusual in that it's an amorphous solid, meaning that the silica molecules", "start": 162.5, "duration": 5.92}, {"text": "are not regularly arranged as in a regular crystalline lattice. Instead, they're all in a", "start": 168.42, "duration": 6.0}, {"text": "jumble, and this is because the glass is cooled down so quickly from the liquid state to", "start": 174.42, "duration": 4.98}, {"text": "the solid state that the molecules don't have time to arrange themselves in a nice", "start": 179.4, "duration": 4.36}, {"text": "regular crystal structure—but what makes something a solid rather than a liquid is that", "start": 183.76, "duration": 5.06}, {"text": "all of the atoms or molecules are so strongly bonded together chemically that they can't", "start": 188.82, "duration": 5.24}, {"text": "slide past each other. So in water, or olive oil, or pitch, the molecules can slide past", "start": 194.06, "duration": 6.32}, {"text": "each other, but in glass, at room temperature, they can't.", "start": 200.38, "duration": 3.76}, {"text": "So what about the interior of the Earth? Beneath the Earth's crust is the mantle, which", "start": 204.14, "duration": 5.6}, {"text": "is responsible for plate tectonics, and therefore earthquakes. Is it a solid or a liquid?", "start": 209.74, "duration": 6.76}, {"text": "We can obviously never observe the mantle directly, but when we do see material come out", "start": 216.5, "duration": 5.28}, {"text": "from underground, it is red hot rock—it's lava. So you might be imagining that the mantle", "start": 221.78, "duration": 6.48}, {"text": "is very similar, made up of this molten magma—hot liquid rock—and that would make sense,", "start": 228.26, "duration": 6.48}, {"text": "because in order for it to flow, it must be a liquid, right? Actually, wrong! The mantle", "start": 234.74, "duration": 6.38}, {"text": "is a solid. Under all that pressure, even though it's at very high temperature, it", "start": 241.12, "duration": 4.78}, {"text": "remains in a solid state, and we know the mantle is solid because shear waves from", "start": 245.9, "duration": 5.5}, {"text": "earthquakes can actually propagate through the mantle. These waves cannot propagate", "start": 251.4, "duration": 4.28}, {"text": "through liquid, like the molten iron of Earth's outer core, because liquids flow in", "start": 255.68, "duration": 5.22}, {"text": "response to being sheared—or rubbed sideways—and as a result, we can see the shadow of", "start": 260.9, "duration": 5.72}, {"text": "the liquid outer core by measuring seismic waves from an earthquake on the other side of", "start": 266.62, "duration": 4.82}, {"text": "the world—but how exactly does this solid rock flow?", "start": 271.44, "duration": 3.96}, {"text": "Well, the answer lies in the fact that crystals aren't perfect. There may be a missing", "start": 275.4, "duration": 4.66}, {"text": "atom here or there, and under the high pressures in the mantle, sometimes a neighboring", "start": 280.06, "duration": 4.8}, {"text": "atom will pop in to fill that gap. Now, from a human perspective it takes a very long", "start": 284.86, "duration": 5.26}, {"text": "time for this to have a noticeable effect, but from the Earth's perspective, it happens", "start": 290.12, "duration": 4.66}, {"text": "in no time at all. The viscosity of the mantle is similar to that of glass, to several", "start": 294.78, "duration": 6.34}, {"text": "orders of magnitude greater, so it is really only over these geological time scales that", "start": 301.12, "duration": 5.74}, {"text": "the mantle is fluid-like at all.", "start": 306.86, "duration": 3.38}, {"text": "So pitch—a liquid—can flow so slowly as to seem like a solid, whereas the Earth's mantle—", "start": 310.24, "duration": 6.26}, {"text": "a solid—behaves like a fluid if you just wait long enough. As the famous American", "start": 316.5, "duration": 5.98}, {"text": "geologist Grove Karl Gilbert once said:", "start": 322.48, "duration": 2.88}, {"text": "\"To my mind it appears that the difficulty is only imaginary and not real. Rigidity and", "start": 325.36, "duration": 4.96}, {"text": "plasticity are not absolute terms, but relative, and all solids are in fact both rigid", "start": 330.32, "duration": 5.5}, {"text": "and plastic... When great masses and great forces are involved ... the distinction loses value.\"", "start": 335.82, "duration": 6.08}, {"text": "Sometimes the rigid definitions we create for ourselves can introduce misconceptions, or", "start": 341.9, "duration": 6.26}, {"text": "viscous rumors, like the idea that the core of the Earth is a giant ball of magma. If", "start": 348.16, "duration": 6.52}, {"text": "only we could think about liquids and solids a little bit more...fluidly.", "start": 354.68, "duration": 5.54}, {"text": "Hey! This episode of Veritasium was supported by Audible.com, a leading provider of", "start": 367.04, "duration": 4.42}, {"text": "audiobooks, with over 180,000 titles in all areas of literature, including fiction,", "start": 371.46, "duration": 4.52}, {"text": "non-fiction and periodicals. This week I wanted to recommend to you a brand new", "start": 375.98, "duration": 4.42}, {"text": "science-fiction book published in 2015. It is by Neal Stephenson, and the book is called", "start": 380.4, "duration": 4.56}, {"text": "'Seveneves', and it's about a massive catastrophe that threatens the Earth. I think that", "start": 384.96, "duration": 5.52}, {"text": "if you're into science, you will really enjoy it, and you can actually download this book", "start": 390.48, "duration": 3.7}, {"text": "for free by going to audible.com/veritasium, or you can pick any other book of", "start": 394.18, "duration": 3.52}, {"text": "your choosing for a one month free trial.", "start": 397.7, "duration": 2.22}, {"text": "So, I really wanna thank Audible for supporting me and I wanna thank you for watching,", "start": 399.92, "duration": 4.4}, {"text": "and if you haven't signed up for my mailing list yet, that is something you should", "start": 404.32, "duration": 3.56}, {"text": "probably do. You can click on this card here and go over to Veritasium.com, and that is", "start": 407.88, "duration": 4.84}, {"text": "where I will be announcing some very cool things coming out very soon. So yeah,", "start": 412.72, "duration": 5.36}, {"text": "check it out, if you haven't already. Bye!", "start": 418.08, "duration": 2.18}]