[{"text": "3Blue1Brown\n[Classical music]", "start": 0.98, "duration": 2.96}, {"text": "Picture yourself as an early calculus student\n about to begin your first course:", "start": 4.12, "duration": 3.74}, {"text": "The months ahead of you\n hold within them a lot of hard work", "start": 8.019, "duration": 2.39}, {"text": "Some neat examples, some not so neat examples, beautiful connections to physics, not so beautiful piles of formulas to memorise,", "start": 10.41, "duration": 6.27}, {"text": "plenty of moments of getting stuck and banging your head into a wall, a few nice 'aha' moments sprinkled in as well, and", "start": 16.9, "duration": 5.719}, {"text": "some genuinely lovely graphical intuition to help guide you through it all.", "start": 23.14, "duration": 3.68}, {"text": "But if the course ahead of you is anything like my first introduction to calculus or any of the first courses that I've seen in", "start": 27.25, "duration": 6.439}, {"text": "the years since, there's one topic that you will not see, but which I believe stands to greatly accelerate your learning.", "start": 33.69, "duration": 5.7}, {"text": "You see almost all of the visual intuitions from that first year are based on graphs -", "start": 39.82, "duration": 4.61}, {"text": "the derivative is the slope of a graph, the integral is a certain area under that graph,", "start": 44.62, "duration": 4.849}, {"text": "but as you generalize calculus beyond functions whose inputs and outputs are simply numbers,", "start": 49.84, "duration": 4.52}, {"text": "it's not always possible to graph the function that you're analyzing. There's all sorts of different ways that you'd be visualizing these things", "start": 54.64, "duration": 6.139}, {"text": "so if all your intuitions for the fundamental ideas,", "start": 61.09, "duration": 2.719}, {"text": "like derivatives, are rooted too rigidly in graphs, it can make for a very tall and largely unnecessary", "start": 63.809, "duration": 5.459}, {"text": "conceptual hurdle between you and the more \"advanced topics\", like multivariable calculus, and complex analysis, differential geometry....", "start": 69.79, "duration": 7.43}, {"text": "Now, what I want to share with you is a way to think about derivatives", "start": 78.4, "duration": 2.809}, {"text": "which I'll refer to as the transformational view, that generalizes more seamlessly into some of those more general context where calculus comes up", "start": 81.34, "duration": 7.849}, {"text": "And then we'll use this alternate view to analyze a certain fun puzzle about repeated fractions.", "start": 89.5, "duration": 5.269}, {"text": "But first off, I just want to make sure that we're all on the same page about what the standard visual is.", "start": 95.079, "duration": 4.61}, {"text": "If you were to graph a function,", "start": 99.82, "duration": 1.67}, {"text": "which simply takes real numbers as inputs and outputs, one of the first things you learn in a calculus course", "start": 101.49, "duration": 5.25}, {"text": "is that the derivative gives you the slope of this graph.", "start": 106.74, "duration": 3.239}, {"text": "Where what we mean by that is that the derivative of the function is a new function which for every input x returns that slope", "start": 110.38, "duration": 7.73}, {"text": "Now, I'd encourage you not to think of this derivative as slope idea as being the definition of a derivative", "start": 119.049, "duration": 5.12}, {"text": "instead think of it as being more fundamentally about how sensitive the function is to tiny little nudges around the input and", "start": 124.719, "duration": 5.84}, {"text": "the slope is just one way to think about that sensitivity relevant only to this particular way of viewing functions.", "start": 130.66, "duration": 6.16}, {"text": "I have not just another video, but a full series on this topic if it's something you want to learn more about.", "start": 136.82, "duration": 4.709}, {"text": "Now the basic idea behind the alternate visual for the derivative is to think of this function as", "start": 142.08, "duration": 5.15}, {"text": "mapping all of the input points on the number line to their corresponding outputs on a different number line.", "start": 147.33, "duration": 5.389}, {"text": "In this context what the derivative gives you is a measure of how much the input space gets stretched or squished in various regions.", "start": 152.82, "duration": 7.279}, {"text": "That is if you were to zoom in around a specific input and take a look at some evenly spaced points around it,", "start": 161.85, "duration": 6.319}, {"text": "the derivative of the function of that input is going to tell you how spread out or", "start": 168.39, "duration": 5.18}, {"text": "contracted those points become after the mapping.", "start": 173.82, "duration": 2.779}, {"text": "Here a specific example helps take the function x squared", "start": 177.48, "duration": 3.229}, {"text": "it maps 1 to 1 and 2 to 4 3 to 9 and so on", "start": 180.93, "duration": 4.639}, {"text": "and you could also see how it acts on all of the points in between", "start": 186.21, "duration": 2.72}, {"text": "and if you were to zoom in on a little cluster of points around the input 1 and", "start": 192.48, "duration": 4.339}, {"text": "then see where they land around the relevant output which for this function also happens to be 1", "start": 196.89, "duration": 5.27}, {"text": "you'd notice that they tend to get stretched out in.", "start": 202.53, "duration": 2.48}, {"text": "In fact, it roughly looks like stretching out by a factor of 2 and the closer you zoom in the more this local behavior", "start": 205.56, "duration": 6.68}, {"text": "Looks just like multiplying by a factor of 2.", "start": 212.61, "duration": 2.93}, {"text": "This is what it means for the derivative of x squared at the input x equals 1 to be 2.", "start": 215.94, "duration": 5.75}, {"text": "It's what that fact looks like in the context of transformations.", "start": 221.82, "duration": 3.559}, {"text": "If you looked at a neighborhood of points around the input 3, they would get roughly stretched out by a factor of 6.", "start": 225.38, "duration": 6.63}, {"text": "This is what it means for the derivative of this function at the input 3 to equal 6.", "start": 232.29, "duration": 4.819}, {"text": "Around the input 1/4 a small region actually tends to get contracted", "start": 238.709, "duration": 4.25}, {"text": "specifically by a factor of 1/2 and that's what it looks like for a derivative to be smaller than 1.", "start": 243.3, "duration": 4.909}, {"text": "Now the input 0 is interesting,\nzooming in by a factor of 10", "start": 250.56, "duration": 3.8}, {"text": "It doesn't really look like a constant stretching or squishing, for one thing all of the outputs end up on the right", "start": 254.489, "duration": 5.84}, {"text": "positive side of things", "start": 260.489, "duration": 2.0}, {"text": "and as you zoom in closer and closer by 100x or by 1000 X", "start": 262.81, "duration": 4.22}, {"text": "It looks more and more like a small neighborhood of points around zero just gets collapsed into zero itself.", "start": 267.1, "duration": 6.38}, {"text": "And this is what it looks like for the derivative to be zero, the local behavior looks more and more like", "start": 277.15, "duration": 5.359}, {"text": "multiplying the whole number line by zero. It doesn't have to completely collapse everything to a point at a particular zoom level. Instead", "start": 282.79, "duration": 7.25}, {"text": "it's a matter of what the limiting behavior is as you zoom in closer and closer.", "start": 290.04, "duration": 3.63}, {"text": "It's also instructive to take a look at the negative inputs here.", "start": 295.15, "duration": 3.079}, {"text": "Things start to feel a little cramped since they collide with where all the positive input values go,", "start": 300.61, "duration": 4.549}, {"text": "and this is one of the downsides of thinking of functions as transformations, but for derivatives, we only really care about the local behavior", "start": 305.5, "duration": 6.36}, {"text": "Anyway, what happens in a small range around a given input.", "start": 312.0, "duration": 3.42}, {"text": "Here, notice that the inputs in a little neighborhood around say negative two. They don't just get stretched out -  they also get flipped around.", "start": 316.08, "duration": 7.6}, {"text": "Specifically, the action on such a neighborhood looks more and more like multiplying by negative four the closer you zoom in", "start": 324.64, "duration": 6.889}, {"text": "this is what it looks like for the derivative of a function to be negative", "start": 331.87, "duration": 3.89}, {"text": "and I think you get the point. This is all well and good,", "start": 338.53, "duration": 2.06}, {"text": "but let's see how this is actually useful in solving a problem a", "start": 340.59, "duration": 3.269}, {"text": "Friend of mine recently asked me a pretty fun question about the infinite fraction one plus one divided by one plus one divided by one", "start": 343.96, "duration": 6.559}, {"text": "plus one divided by one on and on and on and on and", "start": 350.52, "duration": 2.489}, {"text": "Clearly you watch math videos online", "start": 353.68, "duration": 1.88}, {"text": "So maybe you've seen this before but my friend's question actually cuts to something that you might not have thought about before", "start": 355.56, "duration": 5.61}, {"text": "Relevant to the view of derivatives that we're looking at here", "start": 361.66, "duration": 2.42}, {"text": "the typical way that you might", "start": 364.54, "duration": 1.59}, {"text": "Evaluate an expression like this is to set it equal to X and then notice that there's a copy of the full fraction inside itself", "start": 366.13, "duration": 7.1}, {"text": "So you can replace that copy with another X and then just solve for X", "start": 374.68, "duration": 3.89}, {"text": "That is what you want is to find a fixed point of the function 1 plus 1 divided by X", "start": 378.85, "duration": 5.48}, {"text": "But here's the thing there are actually two solutions for X two special numbers were one plus one divided by that number", "start": 387.13, "duration": 7.009}, {"text": "Gives you back the same thing", "start": 394.66, "duration": 2.0}, {"text": "One is the golden ratio phi Φ φ around 1.618\n and the other is negative", "start": 396.67, "duration": 5.6}, {"text": "0.618 which happens to be -1/φ.", "start": 403.3, "duration": 2.96}, {"text": "I like to call this other number phi's little brother since just about any property that phi has, this number also has and", "start": 406.26, "duration": 6.659}, {"text": "this raises the question:", "start": 413.5, "duration": 1.62}, {"text": "'Would it be valid to say that that infinite fraction that we saw, is somehow also equal to phi's little brother: -0.618?'", "start": 415.12, "duration": 7.399}, {"text": "Maybe you initially say \",obviously not! Everything on the left hand side is positive. So how could it possibly equal a negative number?\"", "start": 424.42, "duration": 6.62}, {"text": "Well first we should be clear about what we actually mean by an expression like this.", "start": 432.25, "duration": 4.279}, {"text": "One way that you could think about it,", "start": 437.47, "duration": 1.52}, {"text": "and it's not the only way there's freedom for choice here, is to imagine starting with some constant like 1 and then", "start": 438.99, "duration": 5.94}, {"text": "repeatedly applying the function 1 plus 1 divided by x and", "start": 445.06, "duration": 3.5}, {"text": "then asking what is this approach as you keep going?", "start": 449.74, "duration": 3.41}, {"text": "I mean certainly symbolically what you get looks more and more like our infinite fraction", "start": 455.59, "duration": 3.83}, {"text": "so maybe if you wanted to equal a number you should ask what this series of numbers approaches and", "start": 459.42, "duration": 4.349}, {"text": "If that's your view of things,\nmaybe you start off with a negative number", "start": 464.98, "duration": 3.079}, {"text": "So it's not so crazy for the whole expression to end up negative.", "start": 468.06, "duration": 3.089}, {"text": "After all", "start": 472.78, "duration": 0.62}, {"text": "If you start with -1/φ then applying this function 1 + 1/x", "start": 473.4, "duration": 5.25}, {"text": "You get back the same number -1/φ. So no matter how many times you apply it", "start": 478.66, "duration": 5.059}, {"text": "you're staying fixed at this value.", "start": 483.72, "duration": 2.0}, {"text": "But even then there is one reason that you should probably view phi as the favorite brother in this pair, here", "start": 487.389, "duration": 6.739}, {"text": "try this: pull up a calculator of some kind", "start": 494.129, "duration": 2.13}, {"text": "then start with any random number and then plug it into this function 1 + 1/x and", "start": 496.33, "duration": 5.479}, {"text": "then plug that number into 1 + 1/x  and then again and again and again and again and again", "start": 501.999, "duration": 5.99}, {"text": "No matter what constant you start with you eventually end up at", "start": 508.389, "duration": 3.44}, {"text": "1.618", "start": 512.529, "duration": 1.081}, {"text": "Even if you start with a negative number even one that's really really close to phi's little brother", "start": 513.61, "duration": 4.729}, {"text": "Eventually it shys away from that value and jumps back over to phi", "start": 518.74, "duration": 4.489}, {"text": "So what's going on here? Why is one of these fixed points favored above the other one?", "start": 530.67, "duration": 4.88}, {"text": "Maybe you can already see how the", "start": 536.28, "duration": 1.89}, {"text": "transformational understanding of derivatives is going to be helpful for understanding this set up,", "start": 538.17, "duration": 3.559}, {"text": "but for the sake of having a point of contrast,", "start": 541.8, "duration": 1.97}, {"text": "I want to show you how a problem like this is often taught using graphs.", "start": 543.77, "duration": 3.539}, {"text": "If you were to plug in some random input to this function, the y-value tells you the corresponding output, right?", "start": 547.53, "duration": 6.409}, {"text": "So to think about plugging that output back into the function,", "start": 554.46, "duration": 3.169}, {"text": "you might first move horizontally until you hit the line y equals x and that's going to give you a position where the x-value", "start": 557.97, "duration": 7.4}, {"text": "corresponds to your previous y-value, right?", "start": 565.95, "duration": 2.179}, {"text": "So then from there you can move vertically to see what output this new x-value has", "start": 568.5, "duration": 5.719}, {"text": "And then you repeat you move horizontally", "start": 574.62, "duration": 2.15}, {"text": "to the line y = x, to find a point whose x-value is the same as the output that you just got and then", "start": 576.99, "duration": 5.6}, {"text": "you move vertically to apply the function again.", "start": 582.59, "duration": 2.0}, {"text": "Now personally, I think this is kind of an awkward way to think about repeatedly applying a function, don't you?", "start": 585.39, "duration": 5.299}, {"text": "I mean it makes sense,", "start": 590.69, "duration": 1.75}, {"text": "but you can't have to pause and think about it to remember which way to draw the lines, and you can if you want", "start": 592.44, "duration": 5.809}, {"text": "think through what conditions make this spiderweb process narrow in on a fixed point versus propagating away from it", "start": 598.38, "duration": 6.799}, {"text": "And in fact, go ahead pause right now and try to think it through as an exercise. It has to do with slopes", "start": 605.37, "duration": 4.88}, {"text": "Or if you want to skip the exercise for something that I think gives a much more satisfying", "start": 611.74, "duration": 4.19}, {"text": "understanding think about how this function acts as a transformation.", "start": 616.12, "duration": 3.26}, {"text": "So I'm gonna go ahead and start here by drawing a whole bunch of arrows to indicate where the various sample the input points will go,", "start": 621.91, "duration": 5.51}, {"text": "and side note: Don't you think this gives a really neat emergent pattern?", "start": 627.42, "duration": 3.989}, {"text": "I wasn't expecting this, but it was cool to see it pop up when animating.", "start": 631.41, "duration": 3.45}, {"text": "I guess the action of 1 divided by x gives this nice emergent circle and then we're just shifting things over by 1.", "start": 634.86, "duration": 6.209}, {"text": "Anyway, I want you to think about what it means to repeatedly apply some function like 1 + 1/x in this context.", "start": 641.56, "duration": 7.13}, {"text": "Well after letting it map all of the inputs to the outputs,", "start": 649.87, "duration": 2.96}, {"text": "you could consider those as the new inputs and then just apply the same process again and then again and", "start": 653.47, "duration": 6.02}, {"text": "Do it however many times you want", "start": 659.68, "duration": 2.0}, {"text": "Notice in animating this with a few dots representing the sample points,", "start": 662.68, "duration": 3.739}, {"text": "it doesn't take many iterations at all before all of those dots kind of clump in around 1.618 .", "start": 666.42, "duration": 5.459}, {"text": "Now remember, we know that 1.618... and its little brother -0.618...", "start": 674.17, "duration": 4.699}, {"text": "on and on stay fixed in place during each iteration of this process,", "start": 679.45, "duration": 4.28}, {"text": "but zoom in on a neighborhood around phi during the map points in that region get contracted around phi", "start": 684.4, "duration": 7.369}, {"text": "meaning that the function 1 + 1/x has a derivative with a magnitude that's less than 1 at this input in", "start": 693.79, "duration": 7.459}, {"text": "Fact this derivative works out to be around -0.38.", "start": 701.62, "duration": 2.42}, {"text": "So what that means, is that each repeated application", "start": 704.65, "duration": 3.95}, {"text": "scrunches the neighborhood around this number smaller and smaller like a gravitational pull towards phi.", "start": 709.12, "duration": 5.06}, {"text": "So now tell me what you think happens in the neighborhood of phi's little brother.", "start": 714.82, "duration": 3.619}, {"text": "Over there the derivative actually has a magnitude larger than one, so points near the fixed point are repelled away from it and", "start": 720.959, "duration": 7.82}, {"text": "When you work it out, you can see that they get stretched by more than a factor of two in each iteration.", "start": 729.3, "duration": 4.19}, {"text": "They also get flipped around because the derivative is negative here, but the salient fact for the sake of stability is just the magnitude.", "start": 733.95, "duration": 6.529}, {"text": "Mathematicians would call this right value a stable fixed point and the left one is an unstable fixed point", "start": 743.399, "duration": 5.72}, {"text": "Something is considered stable if when you perturb it just a little bit,", "start": 749.67, "duration": 3.169}, {"text": "it tends to come back towards where it started rather than going away from it.", "start": 752.84, "duration": 3.88}, {"text": "So what we're seeing is a very useful little fact: that the stability of a fixed point is", "start": 757.82, "duration": 4.46}, {"text": "determined by whet her or not the magnitude of its derivative is bigger or smaller than one and", "start": 762.66, "duration": 4.82}, {"text": "this explains why phi always shows up in the numerical play where you're just hitting enter on your", "start": 767.58, "duration": 4.699}, {"text": "calculator over and over but phi's little brother never does.", "start": 772.35, "duration": 3.049}, {"text": "Now as to whether or not you want to consider phi's little brother a valid value of the infinite fraction", "start": 775.89, "duration": 4.309}, {"text": "Well, that's really up to you everything", "start": 780.81, "duration": 2.75}, {"text": "we just showed suggests that if you think of this expression as representing a limiting process", "start": 783.56, "duration": 4.619}, {"text": "then because every possible seed value other than phi's little brother gives you a series converting to φ", "start": 788.459, "duration": 5.51}, {"text": "It does feel kind of silly to put them on equal footing with each other.", "start": 794.16, "duration": 3.29}, {"text": "But maybe you don't think of it as a limit", "start": 797.88, "duration": 2.179}, {"text": "Maybe the kind of math you're doing lends itself to treating this as a purely algebraic object like the solutions of a polynomial,", "start": 800.16, "duration": 6.47}, {"text": "which simply has multiple values.", "start": 806.94, "duration": 2.0}, {"text": "Anyway, that's beside the point and my point here is not that viewing derivatives", "start": 810.24, "duration": 4.159}, {"text": "As this change in density is somehow better than the graphical intuition on the whole in fact picturing an entire function", "start": 814.399, "duration": 6.87}, {"text": "this way can be kind of clunky and impractical as compared to graphs.", "start": 821.27, "duration": 3.329}, {"text": "My point is that it deserves more of a mention in most of the introductory calculus courses,", "start": 825.0, "duration": 4.579}, {"text": "because it can help make a student's understanding of the derivative a little bit more flexible.", "start": 829.829, "duration": 4.13}, {"text": "Like I mentioned the real reason that I'd recommend you carry this perspective with you as you learn new", "start": 834.54, "duration": 4.76}, {"text": "topics is not so much for what it does with your understanding of single variable calculus", "start": 839.37, "duration": 4.19}, {"text": "it's for what comes after there are many topics typically taught in a college math department", "start": 843.899, "duration": 4.94}, {"text": "which... How shall I put this lightly? don't exactly have a reputation of being super accessible.", "start": 848.839, "duration": 5.19}, {"text": "So in the next video", "start": 854.88, "duration": 1.46}, {"text": "I'm gonna show you how a few ideas from these subjects with fancy sounding names like holomorphic functions and the Jacobian determinant", "start": 856.34, "duration": 6.39}, {"text": "are really just extensions of the idea shown here.", "start": 863.25, "duration": 3.11}, {"text": "They really are some beautiful ideas,", "start": 866.48, "duration": 1.77}, {"text": "which I think can be appreciated from a really wide range of mathematical", "start": 868.25, "duration": 3.059}, {"text": "backgrounds and they're relevant to a surprising number of seemingly unrelated ideas. So stay tuned for that.", "start": 871.74, "duration": 6.02}, {"text": "Now for the final animation I just want to show you a little more of that time-dependent vector field I flashed earlier,", "start": 881.9, "duration": 5.46}, {"text": "but first let's look at some of the principles of learning from this video sponsor: Brilliant.org", "start": 887.64, "duration": 4.72}, {"text": "There's a lot of good stuff on this list, \nbut I want you to look at number two", "start": 892.68, "duration": 3.36}, {"text": "effective math and science learning cultivates curiosity.", "start": 896.58, "duration": 3.3}, {"text": "I love the word choice here. It's not just that you should be curious in one moment", "start": 900.36, "duration": 3.08}, {"text": "It means creating a context where that curiosity is constantly growing.", "start": 903.51, "duration": 4.13}, {"text": "Just look at the infinite fraction example here", "start": 908.37, "duration": 2.09}, {"text": "It would be one thing if you were curious about why the numbers bounce around the way that they do,", "start": 910.46, "duration": 3.599}, {"text": "but hopefully the conclusion is not just to understand this one example", "start": 914.49, "duration": 3.86}, {"text": "I would want you to start looking at all sorts of other infinite expressions and wonder if there's some fixed point", "start": 918.35, "duration": 5.099}, {"text": "phenomenon in them, or wonder where else this view of derivatives can be conceptually helpful", "start": 923.6, "duration": 5.0}, {"text": "Brilliant.org is a site where you can learn math and science topics through active problem-solving and if you go take a look", "start": 929.76, "duration": 5.78}, {"text": "I think you'll agree that they really do adhere to these learning principles, coming from this video", "start": 935.54, "duration": 4.56}, {"text": "you would probably enjoy their \"Calculus Done Right,\" lessons and they also have many other courses in various math and science topics.", "start": 940.1, "duration": 6.119}, {"text": "Much of it", "start": 946.5, "duration": 0.74}, {"text": "you can check out for free,", "start": 947.24, "duration": 0.93}, {"text": "but they also have a subscription service that gives you access to all sorts of nice guided problems.", "start": 948.17, "duration": 4.289}, {"text": "Going to Brilliant.org/3B1B", "start": 952.8, "duration": 2.719}, {"text": "Lets them know that you came from this channel and it can also get you 20% off of their annual subscription.", "start": 955.58, "duration": 5.18}]