[{"text": "By now, most of you have probably had a game greet you by your real name", "start": 0.0, "duration": 4.203}, {"text": "without you having entered it yourself.", "start": 4.203, "duration": 2.277}, {"text": "How is it doing that?", "start": 6.48, "duration": 1.24}, {"text": "Well, it's scraping your data from...", "start": 7.94, "duration": 2.086}, {"text": "somewhere.", "start": 10.026, "duration": 0.614}, {"text": "And as more of our systems end up with more and more of our data, we have to ask ourselves,", "start": 10.86, "duration": 4.54}, {"text": "\"What are the ethical and design ramifications of games doing this?\"", "start": 15.56, "duration": 4.1}, {"text": "This episode is brought to you by Audible.", "start": 25.06, "duration": 1.88}, {"text": "Go to audible.com/extracreditz (with a z) to start your free 30-day trial.", "start": 26.94, "duration": 5.1}, {"text": "*Woosh*", "start": 32.22, "duration": 0.5}, {"text": "Your NES and your SEGA Genesis:", "start": 32.86, "duration": 1.871}, {"text": "these were dumb machines.", "start": 34.731, "duration": 1.509}, {"text": "They performed a single, simple function:", "start": 36.24, "duration": 2.08}, {"text": "to run the code on the cartridges that you put into them", "start": 38.32, "duration": 2.56}, {"text": "Of course, that's not the case with our Xbox Ones, our PS4s or our Switches", "start": 40.88, "duration": 4.54}, {"text": "Today, those systems hold a huge manifold of data about us", "start": 45.42, "duration": 3.48}, {"text": "If you've ever entered a credit card info into one of them, they have a name and an address", "start": 49.14, "duration": 4.4}, {"text": "If you've linked your email account, they hold that too.", "start": 53.54, "duration": 2.94}, {"text": "If you've connected your Facebook or your YouTube accounts,", "start": 56.48, "duration": 2.76}, {"text": "there's probably a ton of personal data that can be gleaned there", "start": 59.24, "duration": 3.18}, {"text": "And this doesn't even take into account all of the information they have on your playing habits,", "start": 62.42, "duration": 4.4}, {"text": "from your trophies, hours played on each game, completion rate and such", "start": 66.82, "duration": 4.18}, {"text": "or the information that's stored about who you play with and who your friend group is", "start": 71.0, "duration": 4.54}, {"text": "Now, a lot of that data isn't accessible to game developers", "start": 75.58, "duration": 3.52}, {"text": "but some of it is, and it's almost frightening what a developer,", "start": 79.1, "duration": 3.483}, {"text": "one way or another, can scrape about you, if they choose to do so,", "start": 82.583, "duration": 3.597}, {"text": "especially if you play games on your PC.", "start": 86.18, "duration": 2.38}, {"text": "So let's talk about the ramifications of this", "start": 88.56, "duration": 2.3}, {"text": "Because, especially in the indie game-space,", "start": 90.86, "duration": 2.52}, {"text": "I've seen people start to explore what can be done with this collected information", "start": 93.38, "duration": 4.4}, {"text": "and there are some genuinely cool possibilities.", "start": 97.78, "duration": 2.98}, {"text": "When you wake up and you check your email in the morning", "start": 100.76, "duration": 2.42}, {"text": "to find that the mysterious AI character from the game you've been playing", "start": 103.18, "duration": 3.92}, {"text": "has left you a note with information that will help you progress?", "start": 107.1, "duration": 2.8}, {"text": "That's a pretty powerful moment!", "start": 109.9, "duration": 1.64}, {"text": "When one of your friends logs on and hops into your game, except it's not really your friend,", "start": 111.54, "duration": 4.76}, {"text": "it's just the game using their handle", "start": 116.3, "duration": 2.34}, {"text": "That can lead to all sorts of genuinely breathtaking, heartbreaking or even revelatory moments", "start": 118.64, "duration": 5.06}, {"text": "But there are a lot of dangers there too", "start": 123.7, "duration": 2.6}, {"text": "There are, of course, the obviously terrible examples", "start": 126.3, "duration": 2.56}, {"text": "Where games start putting in targeted ads based on your purchase history or the like", "start": 128.86, "duration": 4.5}, {"text": "But I think there are less obvious possibilities worth considering here, too", "start": 133.36, "duration": 3.92}, {"text": "The ones that might, unfortunately, come up when", "start": 137.36, "duration": 2.5}, {"text": "people are genuinely trying to make better, more immersive experiences for you to play", "start": 139.86, "duration": 4.44}, {"text": "Imagine that scenario I described before where a game emails you", "start": 144.48, "duration": 4.1}, {"text": "What is your gaming account isn't tied to your real email address?", "start": 148.66, "duration": 3.62}, {"text": "Or worse, what if, in its data scrapping, the game somehow gets the wrong address,", "start": 152.38, "duration": 4.32}, {"text": "and emails, like, your dad or your significant other?", "start": 156.7, "duration": 3.5}, {"text": "That is gonna be one confusing email they get in their inbox", "start": 160.2, "duration": 3.4}, {"text": "And hopefully, it doesn't read like a ransom note or a threat or something", "start": 163.6, "duration": 3.98}, {"text": "Which kind of leads me to my first point:", "start": 167.58, "duration": 1.64}, {"text": "When making use of real-world data", "start": 169.22, "duration": 2.08}, {"text": "we have to be incredibly careful that anything we do", "start": 171.3, "duration": 2.92}, {"text": "Won't be misconstrued as real by somebody not playing the game", "start": 174.22, "duration": 3.98}, {"text": "The goal here is, of course to make the game more immersive for the player", "start": 178.2, "duration": 3.4}, {"text": "I mean, they've already bought in", "start": 181.6, "duration": 1.6}, {"text": "There's already a sort of tacit agreement involved in playing the game", "start": 183.2, "duration": 3.0}, {"text": "So they are most likely okay with elements of the game popping up in their real life in cool little ways", "start": 186.2, "duration": 5.82}, {"text": "But we've got to make sure to prevent confusion with those real-world elements", "start": 192.02, "duration": 3.98}, {"text": "Or they could potentially have some disastrous ramifications.", "start": 196.0, "duration": 3.02}, {"text": "Which also leads me to our second point:", "start": 199.02, "duration": 2.52}, {"text": "Please, please do not have your game do anything that could be misconstrued as criminal", "start": 201.54, "duration": 4.36}, {"text": "Or that would suggest the possibility of real-world criminal activity to somebody not playing the game", "start": 205.9, "duration": 5.5}, {"text": "I feel like that should go without saying, but--here we are", "start": 211.4, "duration": 3.12}, {"text": "Now let's take the second scenario:", "start": 214.52, "duration": 2.16}, {"text": "The case where the game impersonates somebody you know", "start": 216.68, "duration": 3.18}, {"text": "I'm hesitant to say that we should never do this", "start": 219.86, "duration": 2.86}, {"text": "Because I'm just incredibly reluctant to cut off any avenue of design", "start": 222.72, "duration": 3.98}, {"text": "Much less one that could deliver such huge emotional stakes", "start": 226.7, "duration": 3.5}, {"text": "But this one rides incredibly close to that line", "start": 230.2, "duration": 3.08}, {"text": "There are just too many things that could just go too wrong", "start": 233.28, "duration": 3.28}, {"text": "I mean we could just destroy friendships", "start": 236.56, "duration": 1.76}, {"text": "Imagine if your friend hopped into your game and then acted like a complete jerk", "start": 238.32, "duration": 4.64}, {"text": "went way over the line", "start": 242.96, "duration": 1.9}, {"text": "And then you confront them about it later and they claim to know nothing about it", "start": 244.86, "duration": 3.62}, {"text": "This just gets bad in a hurry", "start": 248.48, "duration": 2.4}, {"text": "Or maybe they don't act like a jerk", "start": 250.88, "duration": 2.08}, {"text": "Maybe they just act weird or they stay silent when you try to talk to them", "start": 252.96, "duration": 3.92}, {"text": "You could get really worried for that person if you don't immediately recognize that they're just a trick of the computer's", "start": 256.88, "duration": 5.66}, {"text": "We also have to be careful of who we pull from people's friends list", "start": 262.54, "duration": 4.24}, {"text": "Imagine if an \"ex\" of yours suddenly hopped into your game,", "start": 266.78, "duration": 3.0}, {"text": "one who you still have feelings for", "start": 269.78, "duration": 1.86}, {"text": "Or imagine if the game pulled in somebody you'd lost--", "start": 271.64, "duration": 3.12}, {"text": "a parent, or a grandparent--who, for years, had just been sitting idle in your friends list", "start": 274.76, "duration": 5.06}, {"text": "The person you've never been able to bring yourself to delete", "start": 279.82, "duration": 2.88}, {"text": "Then imagine them suddenly joining your game", "start": 282.7, "duration": 2.8}, {"text": "There's just no reason to put somebody through that", "start": 285.5, "duration": 3.08}, {"text": "So I think games that do this sort of data-dredging will have to notify the player at the outset", "start": 288.58, "duration": 5.58}, {"text": "At least at first", "start": 294.28, "duration": 1.12}, {"text": "I know it takes away some of the impact", "start": 295.4, "duration": 1.78}, {"text": "And blunts some of the emotional effect", "start": 297.18, "duration": 2.3}, {"text": "But it also helps to mitigate how much damage might be done, and that's essential", "start": 299.48, "duration": 4.66}, {"text": "And in some ways, I hate losing that surprise", "start": 304.14, "duration": 2.9}, {"text": "That revelation that the game \"knows\" me", "start": 307.04, "duration": 2.44}, {"text": "Not as some impersonal and generic player", "start": 309.48, "duration": 2.64}, {"text": "But actually knows who I am in some strange way", "start": 312.52, "duration": 3.04}, {"text": "And that it's, like, tailoring itself to me", "start": 315.56, "duration": 2.34}, {"text": "Perhaps, in time, as these features become more common, it's possible we won't need any warning", "start": 317.9, "duration": 5.14}, {"text": "For the time being, though, we need to alert the player if we're going to dig through their data.", "start": 323.04, "duration": 4.24}, {"text": "And platform-holders are also going to have to start getting involved", "start": 327.28, "duration": 3.0}, {"text": "By giving players more control over their data", "start": 330.28, "duration": 2.8}, {"text": "All personal data should default to \"share with no one,\" no matter how innocuous", "start": 333.08, "duration": 5.22}, {"text": "I mean, do I really care if a game can see what trophies I've gotten", "start": 338.3, "duration": 3.32}, {"text": "just so it can make some crack about how I need to git gud at Dark Souls?", "start": 341.62, "duration": 3.56}, {"text": "No, but it doesn't matter. That's got to be the player's choice.", "start": 345.18, "duration": 3.42}, {"text": "Games should also be able to ask for permissions", "start": 348.6, "duration": 2.46}, {"text": "Much in the way as when you sign into something with Facebook and it asks for permission to access data", "start": 351.06, "duration": 5.34}, {"text": "But that needs to be the player's choice to opt into", "start": 356.4, "duration": 2.9}, {"text": "Not something that they've got to go through arcane menus to opt out of.", "start": 359.3, "duration": 3.66}, {"text": "If a game opened up and said \"Hey, [game] would like to access your trophies and your play-times\"", "start": 362.96, "duration": 5.0}, {"text": "I would almost certainly say \"Yeah, sure. Go for it\"", "start": 367.96, "duration": 2.76}, {"text": "And then I would know what I was getting into", "start": 370.72, "duration": 2.1}, {"text": "I could \"okay\" these things on a case-by-case basis", "start": 372.82, "duration": 3.16}, {"text": "limiting the potential negative effects", "start": 375.98, "duration": 2.32}, {"text": "This new horizon of design, where we scrape data about you", "start": 378.3, "duration": 3.64}, {"text": "to make your game more personalized, more intimate, has enormous potential", "start": 381.94, "duration": 4.42}, {"text": "These games could provide us with moments that will stick with us for a lifetime", "start": 386.36, "duration": 3.7}, {"text": "So I don't really want to simply close that door or say \"let's never go there\"", "start": 390.06, "duration": 4.38}, {"text": "But it is really important that we explore these possibilities with our eyes open", "start": 394.44, "duration": 5.06}, {"text": "That we give the player the opportunity to control their experience and respect them as they do so", "start": 399.5, "duration": 4.96}, {"text": "We cannot just jump into this new avenue of design thoughtlessly", "start": 404.46, "duration": 4.04}, {"text": "More than ever, this is the place where we must remember:", "start": 408.5, "duration": 3.28}, {"text": "The player comes first", "start": 411.78, "duration": 1.68}, {"text": "See you next week!", "start": 413.74, "duration": 1.16}, {"text": "This episode was brought to you by Audible", "start": 415.82, "duration": 2.14}, {"text": "The leading provider of audiobooks with an unmatched selection for you to choose from", "start": 417.96, "duration": 4.06}, {"text": "Audiobooks are great for making travel or traffic or chores that much more enjoyable", "start": 422.02, "duration": 4.72}, {"text": "This week for any of you Extra History fans", "start": 426.74, "duration": 2.38}, {"text": "our recommendation is Catherine the Great: Portrait of a Woman by Robert K. Massie", "start": 429.12, "duration": 4.74}, {"text": "There is so much more to Catherine than our series of videos could contain", "start": 433.86, "duration": 3.6}, {"text": "and this book can help you start to fill in those gaps", "start": 437.46, "duration": 2.88}, {"text": "Go to audible.com/extracreditz (with a \"z\")", "start": 440.34, "duration": 3.5}, {"text": "Because it d-d-- don't worry about it", "start": 443.84, "duration": 1.66}, {"text": "Anyway, go there and start your free 30-day trial", "start": 445.5, "duration": 3.26}]