[{"text": "This has been, hands down the worst", "start": 0.669, "duration": 2.33}, {"text": "Work trip I've ever been on. I lost my luggage", "start": 3.549, "duration": 2.51}, {"text": "We lost all the footage from a previous trip. So instead of going home", "start": 6.64, "duration": 3.139}, {"text": "I am actually going to be going to Ottawa after this, and then we tried to stream our", "start": 9.78, "duration": 5.279}, {"text": "Galaxy Note 9 coverage from here at unpacked 2018 for 45 minutes before finally giving up", "start": 15.16, "duration": 5.719}, {"text": "But at least there's a bright spot and the bright spot. Is that the Galaxy Note 9", "start": 21.52, "duration": 6.169}, {"text": "May very well be the sexiest phone we have ever seen", "start": 28.63, "duration": 4.309}, {"text": "In fact, not just may very well be look if I pull out the black one", "start": 33.52, "duration": 3.379}, {"text": "I think you've got a perfect reflection of Brandon in there making this officially the sexiest phone ever", "start": 36.899, "duration": 6.33}, {"text": "Right, right thumbs up for Brandon, sexy, please", "start": 44.14, "duration": 3.409}, {"text": "We're gonna tell you all about it after this message from PIA.", "start": 48.85, "duration": 2.959}, {"text": "This video is brought to you by private Internet access", "start": 51.809, "duration": 2.159}, {"text": "Private Internet access is the VPN that encrypts all your Internet traffic and uses a safe protected IP", "start": 54.28, "duration": 4.729}, {"text": "To learn more check it out now at the link in the video description", "start": 59.22, "duration": 2.5}, {"text": "♪Intro Music♪", "start": 62.06, "duration": 8.64}, {"text": "So I had a whole bunch of plans", "start": 70.86, "duration": 2.6}, {"text": "You know best laid plans of mice and men we were gonna do the whole thing live", "start": 73.47, "duration": 3.66}, {"text": "I had this I had this whole joke where I was gonna do like our whole our old intro and I was gonna I was", "start": 77.13, "duration": 5.009}, {"text": "Gonna hold it up for for the camera. Oh look. Look, it's Blair's tech tips intro lol. You know what we're gonna do it anyway", "start": 82.14, "duration": 6.09}, {"text": "Watch you might not know not NCIX ignore. The man behind the curtain NCIX has nothing to do with - tech tips anymore", "start": 88.93, "duration": 5.269}, {"text": "*Very Deep Breath*", "start": 94.199, "duration": 0.881}, {"text": "Okay", "start": 95.08, "duration": 1.17}, {"text": "So the whole keynote started with a lot of very bold claims and grandiose messaging", "start": 96.25, "duration": 5.87}, {"text": "seek a life fulfilled with purpose and it", "start": 102.55, "duration": 2.989}, {"text": "Motivated to do more and the kinds of people who they imagine a no customer would be but of course", "start": 106.03, "duration": 5.54}, {"text": "All that does is set very high", "start": 111.91, "duration": 2.449}, {"text": "expectations for someone like me of this device and they've actually managed to do an incredible job of living up to", "start": 114.78, "duration": 6.48}, {"text": "Most of it so specs run down. It's got a six point four inch display", "start": 121.84, "duration": 4.22}, {"text": "And the first thing I noticed about it once I got my hands on it was that it's actually got a slightly", "start": 126.06, "duration": 5.56}, {"text": "By the look of things slightly wider bezel", "start": 132.19, "duration": 3.529}, {"text": "than the previous s9 plus and I actually am fully supportive of this change because I do find that every so", "start": 136.269, "duration": 7.64}, {"text": "occasionally", "start": 144.4, "duration": 0.5}, {"text": "I'll have difficulty pressing something", "start": 144.9, "duration": 2.1}, {"text": "Especially when I'm reaching across the screen and I end up interfering with my button presses when I'm trying to type", "start": 147.37, "duration": 5.809}, {"text": "It's got a 10 nanometer octa-core processor", "start": 153.64, "duration": 3.44}, {"text": "this was actually very telling one of the most interesting moments of the keynote for me was at the very end when their", "start": 157.08, "duration": 6.27}, {"text": "smartphone division head", "start": 164.41, "duration": 1.25}, {"text": "I forget what his actual exact title is and something along the lines of every year", "start": 165.66, "duration": 4.38}, {"text": "We work to make the note the most powerful most amazing smartphone ever. This is not easier every year frankly speaking", "start": 170.47, "duration": 6.29}, {"text": "And then he kind of laughed and it unlike the entire rest of the presentation really sounded genuine and he goes", "start": 178.87, "duration": 6.3}, {"text": "This not easy", "start": 186.02, "duration": 1.799}, {"text": "And it really is a great point because you can't just keep stuffing better and better specs into a phone every time", "start": 187.819, "duration": 5.63}, {"text": "So it's got an octa-core processor which depending on which region you're in might actually mean something different", "start": 193.67, "duration": 5.69}, {"text": "So I've got my review device here", "start": 199.36, "duration": 2.009}, {"text": "Which I have already started to load apps on and of course", "start": 201.37, "duration": 3.18}, {"text": "the first thing was CPU said so it's going to be some combination of dual sourced Snapdragon 845 processors and", "start": 204.55, "duration": 7.019}, {"text": "some variant of Exynos probably the same thing from the s9 and the s9 plus you can see that the", "start": 212.06, "duration": 5.899}, {"text": "Snapdragon is the one that turbos up to 2.8 and I think the other one maxes out at 2.7", "start": 218.06, "duration": 4.699}, {"text": "So they're even listing separate frequencies for the different products depending on which capacity you get. I believe these are all", "start": 222.83, "duration": 6.589}, {"text": "128 gig versions you'll get either 6 or 8 gigs of ram. They're all", "start": 230.18, "duration": 4.1}, {"text": "Ip68 watcher and dust resistant. I refuse to call it waterproof", "start": 234.86, "duration": 3.86}, {"text": "They've all got fast wireless charging four thousand milliamp hour battery is this is another huge change", "start": 239.03, "duration": 6.589}, {"text": "I was not that impressed with the note eight and one of the things that I complained about was", "start": 245.62, "duration": 4.05}, {"text": "That I felt like Samsung was being really conservative with the battery capacity of it on the heels of the note 7 fire", "start": 249.859, "duration": 7.22}, {"text": "fiasco", "start": 257.78, "duration": 1.199}, {"text": "Gone, is that strategy? So they've brought their multi-point battery inspection process to a higher capacity", "start": 258.979, "duration": 5.48}, {"text": "Four thousand milliamp hour. That is a", "start": 265.16, "duration": 2.389}, {"text": "Great their messaging. It has an all-day battery and I actually", "start": 268.28, "duration": 2.72}, {"text": "Believe it", "start": 271.669, "duration": 1.5}, {"text": "Physically, there's not gonna be a lot of surprises here. Actually, really love the color choices this year", "start": 273.169, "duration": 4.61}, {"text": "So they've got this they're calling it copper to me. It's more of like a bronzy type color really like this one", "start": 277.78, "duration": 5.609}, {"text": "They've got purple making a return they're calling it lilac or something along those lines", "start": 283.45, "duration": 3.899}, {"text": "I like the s9 plus purple a little bit better", "start": 287.62, "duration": 1.98}, {"text": "But this one's pretty Schmeck c2 they've got a blue and then of course they've got a more traditional", "start": 289.6, "duration": 4.35}, {"text": "black and most of them have matching s-pen colors", "start": 294.02, "duration": 3.11}, {"text": "But the blue one gets this really bold yellow color", "start": 297.139, "duration": 3.23}, {"text": "One of the things that stood out to me about all the color choices this year", "start": 300.5, "duration": 3.2}, {"text": "Is that Samsung he really has their own identity for colors?", "start": 303.7, "duration": 2.759}, {"text": "Now they have not piggybacked on anything that Apple is doing there's no gold. There's no red", "start": 306.46, "duration": 5.07}, {"text": "Everything here is uniquely Samsung one of the other big physical changes is the movement of the fingerprint sensor", "start": 312.129, "duration": 5.339}, {"text": "So we've got tons of different options for biometric security", "start": 317.719, "duration": 2.839}, {"text": "once again fingerprint sensor at the back", "start": 320.629, "duration": 2.42}, {"text": "Facial reader in the forward-facing camera as well as their iris scanner and these two you can put together for what they're calling", "start": 323.509, "duration": 6.169}, {"text": "intelligent scan", "start": 329.839, "duration": 0.81}, {"text": "They spent a lot more time talking about their vast ecosystem of other products including mentioning things like refrigerators", "start": 330.649, "duration": 6.68}, {"text": "As they work towards sort of building a more connected world", "start": 337.489, "duration": 2.99}, {"text": "One of the more connected things that I saw demoed on stage was decks. So decks has gone from being this sort of", "start": 340.55, "duration": 6.109}, {"text": "weird feature that doesn't make a ton of sense to me because you have to buy this extra accessory to something that looks very", "start": 347.449, "duration": 6.319}, {"text": "Seamless. So now all you need is a USB type-c to HDMI adapter and", "start": 354.409, "duration": 4.94}, {"text": "Boom you plug that into a display and presumably you can connect a keyboard and mouse via bluetooth, though", "start": 359.929, "duration": 5.93}, {"text": "They didn't demo that they demoed using the note 9 as a touchpad", "start": 365.86, "duration": 3.449}, {"text": "That's it that's all it takes to get a desktop experience now Android still isn't a great desktop or laptop experience", "start": 370.819, "duration": 6.889}, {"text": "this was particularly clear when Razer was showing off their concept for a phone that kind of", "start": 377.839, "duration": 4.369}, {"text": "Slotted into a laptop shell but with some work and it does seem like we're going the right direction", "start": 382.999, "duration": 6.05}, {"text": "That could be a great way to take your work with you on the go", "start": 389.329, "duration": 2.84}, {"text": "Of course one of the big things they were talking about. Yes. Yes", "start": 392.749, "duration": 3.2}, {"text": "this is exciting was how much work you can take with you on the gore how much stuff so with the", "start": 395.949, "duration": 6.389}, {"text": "512 gig", "start": 402.86, "duration": 1.559}, {"text": "Which is going to be 1249 us and then it's $9.99. Oops. That's the wrong thing", "start": 404.419, "duration": 4.399}, {"text": "$9.99 us for the", "start": 409.459, "duration": 2.0}, {"text": "128 gig version", "start": 411.769, "duration": 2.0}, {"text": "They are saying that you can have up to a hundred", "start": 413.809, "duration": 2.75}, {"text": "Whoo, there it goes. You can have up to one terabyte of capacity and a phone", "start": 416.959, "duration": 5.24}, {"text": "Well, I say why wait because Samsung was saying well, you know, you got to wait for Samsung's 512 gig microSD, not me. I", "start": 422.569, "duration": 7.819}, {"text": "Have the integral", "start": 430.909, "duration": 2.0}, {"text": "128 gig microSD, so we're gonna do it first just for lols. I", "start": 433.939, "duration": 4.699}, {"text": "Actually don't even know if this is a 512 gig phone", "start": 440.3, "duration": 2.599}, {"text": "It's got a Seminole. Yes", "start": 444.16, "duration": 2.0}, {"text": "You saw it here first my friends that is assuming that I can get this in here", "start": 447.53, "duration": 5.119}, {"text": "512 gigs of microSD going into a note 9 I", "start": 456.26, "duration": 3.829}, {"text": "can't remember to take that with me that tastes like", "start": 461.03, "duration": 2.0}, {"text": "$400", "start": 463.7, "duration": 1.74}, {"text": "Tap here to transfer media files boom just like that it comes up", "start": 465.44, "duration": 3.44}, {"text": "Absolutely, gorgeous get more space. Yeah, right as if I need it last thing", "start": 469.88, "duration": 3.44}, {"text": "I really want to spend some time on is the s-pen the s-pen is something that I'd always looked at as a really cool feature", "start": 473.32, "duration": 5.04}, {"text": "that I'm not likely to use but that all changes this time so somehow without", "start": 478.36, "duration": 5.279}, {"text": "Changing the form factor at least to my eye. I don't have a no date on me today. They have managed to cram wireless charging", "start": 484.01, "duration": 6.949}, {"text": "Bluetooth and a battery into this thing. So now you can use it as", "start": 491.63, "duration": 3.26}, {"text": "remote capture for taking selfies", "start": 495.47, "duration": 2.0}, {"text": "You can use it to advance a PowerPoint presentation and they are even opening up the SDK. I think very soon", "start": 497.57, "duration": 7.19}, {"text": "They didn't actually give a timeline on it", "start": 504.76, "duration": 1.57}, {"text": "but they're gonna make the SDK available to everyone so it'll be up to app developers how they want to use this and", "start": 506.33, "duration": 5.75}, {"text": "I'm assuming it was by clicking and double-clicking, but they were even able to go forward and backward within PowerPoint", "start": 512.479, "duration": 5.39}, {"text": "that is absolutely", "start": 518.39, "duration": 1.8}, {"text": "Fantastic, it charges it a minute lasts for 90 minutes and still has all the regular S Pen functionality that you would expect", "start": 520.19, "duration": 6.83}, {"text": "Passively without the battery on board being charged", "start": 527.54, "duration": 2.96}, {"text": "So this is a potential game-changer for someone who is a reluctant S Pen or like me the speakers are stereo now", "start": 530.57, "duration": 7.13}, {"text": "So that's fantastic and they are AKG but it always becomes a little bit less meaningful when someone like Samsung says yeah", "start": 537.74, "duration": 7.489}, {"text": "They're akj speakers, but then they they ran out and they acquired Harman which is the parent company of AKG last year", "start": 545.23, "duration": 5.88}, {"text": "so it probably wasn't that hard to get the certification and", "start": 551.11, "duration": 2.82}, {"text": "I think that's pretty much it. They didn't say much about performance specifically", "start": 554.66, "duration": 4.129}, {"text": "Other than that, it's got a water carbon cooling system, which is probably fancy branding for a heat pipe", "start": 558.79, "duration": 4.559}, {"text": "and oh", "start": 564.23, "duration": 2.0}, {"text": "Yeah, right. They announced the Galaxy watch which I wasn't going to review", "start": 566.27, "duration": 4.309}, {"text": "But now I feel like I really need to get my hands on this thing is absolutely gorgeous", "start": 570.58, "duration": 3.989}, {"text": "It's got LTE connectivity", "start": 574.57, "duration": 1.12}, {"text": "Just like Apple's latest generation watch they say it lasts for three days on battery, which is a huge boon for someone like me", "start": 575.69, "duration": 6.949}, {"text": "Who's been whining about watches not having a either always-on displays or be?", "start": 582.639, "duration": 5.34}, {"text": "Good batteries since they pretty much showed up on the market", "start": 588.41, "duration": 2.989}, {"text": "So let me know in the comments below if you'd like to see a dedicated video on that also", "start": 591.399, "duration": 4.619}, {"text": "they did a Bixby smart speaker, which", "start": 596.019, "duration": 2.04}, {"text": "Sure. Let me know if you want to see that too. So thanks for putting up with our very late coverage here guys", "start": 599.209, "duration": 5.96}, {"text": "We really wanted to bring this to you live, but we tried and tried and tried and I'm only human and I'm sorry", "start": 605.17, "duration": 5.549}, {"text": "but what I'm not sorry about", "start": 611.42, "duration": 2.0}, {"text": "Is private Internet access?", "start": 613.61, "duration": 1.62}, {"text": "P ia is the VPN service that hides your true IP and allows you to bypass", "start": 615.23, "duration": 4.13}, {"text": "pesky geo restrictions and censorship by making you appear as though you are connecting from somewhere else and", "start": 619.49, "duration": 5.239}, {"text": "We actually got a video coming on this in the near future", "start": 624.8, "duration": 2.359}, {"text": "You can use a VPN for all kinds of things that you might not think of", "start": 627.16, "duration": 3.69}, {"text": "They're not just for people who are trying to like", "start": 630.889, "duration": 2.059}, {"text": "Conceal their identities online", "start": 633.47, "duration": 1.919}, {"text": "you can watch video streams from another country like if you want access to BBC and you are not living in Great Britain and you", "start": 635.389, "duration": 6.65}, {"text": "Can even get cheaper tickets for flights. If you are pretty savvy. We're gonna have a video coming about that soon", "start": 642.04, "duration": 5.88}, {"text": "So go check out P ia today, they have over a thousand servers in 28 countries, and we'll have them linked in the video description", "start": 648.019, "duration": 6.35}, {"text": "So thanks for watching guys, like dislike do whatever it is that you feel is right. Leave a comment", "start": 655.43, "duration": 4.519}, {"text": "Don't forget to subscribe so you don't miss any of our videos and I'm screwing up my standard outro", "start": 660.38, "duration": 4.849}, {"text": "We have a merch store linked in the video description. It doesn't have shirts like this. I lost my luggage", "start": 665.23, "duration": 5.25}, {"text": "So this is the same shirt that I put on for travel. It's really comfortable. That's why I was wearing it", "start": 670.91, "duration": 6.109}, {"text": "I wanted a line of tech tips shirt", "start": 677.05, "duration": 2.099}, {"text": "I'm broken. I'm a broken man. I", "start": 681.589, "duration": 2.119}, {"text": "Say nice now", "start": 685.55, "duration": 2.0}]