[{"text": "This video is sponsored by Vikings: War of Clans.", "start": 0.46, "duration": 4.28}, {"text": "If you loved the top PC strategy games of the 90's,", "start": 5.22, "duration": 2.52}, {"text": "you should definitely take a look at Vikings War of Clans.", "start": 7.8, "duration": 2.96}, {"text": "It's a great time to start, as it just went through a massive update, with new RPG elements and a new hero.", "start": 10.86, "duration": 6.16}, {"text": "Choose your own playstyle: build an impregnable city by raising your economy,", "start": 17.14, "duration": 3.72}, {"text": "use your diplomatic skills, or just gather with friends to play together.", "start": 20.86, "duration": 3.48}, {"text": "Check it out now and see why over 12 million players are addicted to it.", "start": 24.48, "duration": 4.14}, {"text": "Support the channel today by download Vikings from the links below in the description", "start": 28.62, "duration": 4.22}, {"text": "and get your initial protection shield for free and our special bonus of 200 gold for a fast start to success!", "start": 32.84, "duration": 7.76}, {"text": "It's the first half of the 13th century.", "start": 46.44, "duration": 2.92}, {"text": "The lands of medieval Livonia are being conquered by the Sword Brethren,", "start": 49.36, "duration": 3.78}, {"text": "a catholic military order sanctioned by the Pope.", "start": 53.14, "duration": 3.32}, {"text": "Its main goal, at least officially,", "start": 56.58, "duration": 2.38}, {"text": "was to spread Christianity among the indigenous Baltic and Finnic tribes,", "start": 58.96, "duration": 4.14}, {"text": "who collectively formed one of the last pagan bastions wedged between the rising powers of the Catholic and Orthodox churches.", "start": 63.1, "duration": 7.48}, {"text": "In 1225 a papal legate arrived to settle the power issues between the Sword Brethren,", "start": 71.28, "duration": 5.92}, {"text": "local bishops and participating nobility from Denmark and Germany.", "start": 77.2, "duration": 4.38}, {"text": "Livonia was divided into several feudal principalities", "start": 81.8, "duration": 3.16}, {"text": "serving as direct subjects to the Holy See and jointly named Terra Mariana, the land of Mary.", "start": 85.18, "duration": 6.78}, {"text": "Thus, the first phase of the Livonian Crusade came to an end.", "start": 92.2, "duration": 4.22}, {"text": "The Catholic military actions in the Baltic never enjoyed the prestige of the Middle Eastern Crusades", "start": 97.74, "duration": 5.64}, {"text": "but was comparably every bit as cruel and ruthless, as many pagan tribes of Livonia withstood forced Christianisation efforts for many years.", "start": 103.46, "duration": 9.26}, {"text": "Threatened by the Catholic sword to betray their traditional beliefs in favour of the new faith,", "start": 113.02, "duration": 4.78}, {"text": "they often chose to fight the invaders instead.", "start": 117.8, "duration": 3.18}, {"text": "The eastern Baltic wasn't a particularly peaceful area, even before the first Christianisation attempts were made.", "start": 121.32, "duration": 6.96}, {"text": "Indigenous clans raided each other for slaves,", "start": 128.46, "duration": 2.9}, {"text": "while the stronger ones even plundered the lands of their Russian and Scandinavian neighbours.", "start": 131.48, "duration": 4.54}, {"text": "These warlike societies were further hardened and militarised", "start": 136.84, "duration": 3.96}, {"text": "by defying the Christian invaders since the late 12th century.", "start": 140.8, "duration": 3.88}, {"text": "The rough and swampy Livonian woodlands encouraged ambushes and the usage of hit and run tactics by the indigenous tribes,", "start": 145.04, "duration": 7.24}, {"text": "as it was their only hope to stand a chance against the usually heavy armoured and well-disciplined Sword Brethren.", "start": 152.54, "duration": 7.1}, {"text": "In 1236 a papal bull was issued, declaring a crusade against the Lithuanian tribes inhabiting the lands south of the Daugava river.", "start": 160.16, "duration": 9.32}, {"text": "The Sword Brethren were reinforced by a party of so called \"seasonal crusaders\" from northern Germany and,", "start": 169.82, "duration": 6.76}, {"text": "in September, the joint force entered the lands of Samogitian tribes.", "start": 176.58, "duration": 4.8}, {"text": "Upon making contact with an enemy raiding party at a swampy river crossing,", "start": 181.74, "duration": 5.22}, {"text": "the Master of the Sword Brethren, being pressured by proud and overconfident German knights who refused to fight on foot,", "start": 187.18, "duration": 6.6}, {"text": "set camp for the night in this unsuitable place.", "start": 193.78, "duration": 3.48}, {"text": "This proved to be a huge mistake.", "start": 197.5, "duration": 2.66}, {"text": "The next morning, they were surrounded by the main Samogitian army,", "start": 200.3, "duration": 4.04}, {"text": "and while the Sword Brethren fought bravely, it was a crushing defeat.", "start": 204.34, "duration": 3.8}, {"text": "The abrupt end of the Lithuanian campaign, was also the end of the existence of the Sword Brethren as a separate order.", "start": 208.94, "duration": 7.28}, {"text": "More than half of the sworn brothers were killed, together with their commander, Grand Master Volkwin.", "start": 216.42, "duration": 5.38}, {"text": "Following the disastrous battle south of the Daugava,", "start": 221.94, "duration": 2.86}, {"text": "the remnants of the order were incorporated into the more renowned Teutonic Knights,", "start": 225.02, "duration": 5.0}, {"text": "operating to the south, and became its northern branch, named the Livonian Order.", "start": 230.02, "duration": 6.08}, {"text": "The territory of Livonia had undergone major political reorganisation, sealed by papal legate William of Modena,", "start": 236.48, "duration": 8.56}, {"text": "but it still remained a heavily militarized region.", "start": 245.7, "duration": 3.08}, {"text": "This gradually became a major concern for the Russian principalities to the East,", "start": 249.12, "duration": 4.76}, {"text": "particularly the Novgorod Republic, the strongest state of northern Russia.", "start": 253.94, "duration": 5.26}, {"text": "It’s core city, Novgorod the Great, was a thriving trade centre, moving such goods as furs, walrus ivory and dried fish.", "start": 259.66, "duration": 8.64}, {"text": "The Bishop of Novgorod was the head of the city, though only nominally.", "start": 268.58, "duration": 4.36}, {"text": "In truth, it was ruled by the town council.", "start": 272.94, "duration": 3.4}, {"text": "Despite its wealthy status, Novgorod could hardly defend itself from a serious outside threat with its own militia.", "start": 276.58, "duration": 7.58}, {"text": "Thus, whenever needed, a prince, known as a knyaz was invited to lead the city’s own force,", "start": 284.54, "duration": 7.06}, {"text": "also strengthening it with his own private army.", "start": 291.84, "duration": 3.16}, {"text": "There was no clear consensus among the Russian states on how to address the Catholic expansion within the Eastern Baltic region.", "start": 295.36, "duration": 7.68}, {"text": "Some nobility of Novgorod wanted to come to terms with the newcomers,", "start": 303.16, "duration": 4.2}, {"text": "while the others favoured a more aggressive stance, assisted by the princely Vsevolodovich dynasty.", "start": 307.36, "duration": 6.98}, {"text": "Although it seemed that both sides avoided an open conflict,", "start": 314.66, "duration": 3.7}, {"text": "in 1234 Prince Yaroslav lead a Novgorodian raiding party west and sacked the city of Dorpat,", "start": 318.62, "duration": 7.26}, {"text": "which was regarded as territory owned by Novgorod prior to the arrival of the Catholic military orders.", "start": 326.02, "duration": 6.26}, {"text": "Yet this raid was just one, inconclusive attack, and the borders remained untouched.", "start": 332.52, "duration": 5.54}, {"text": "Yaroslav moved his retinue to Kiev, instating his sixteen years old son – Alexander, as the new Prince of Novgorod.", "start": 338.34, "duration": 7.7}, {"text": "It was quite a challenge for the young knyaz, but Alexander quickly proved to be an able politician,", "start": 346.84, "duration": 6.0}, {"text": "swiftly balancing between various groups of interest in Novgorod.", "start": 352.84, "duration": 4.38}, {"text": "He was well aware of his own capabilities, and when the Mongol hordes ravaged the vast Russian interior in 1237,", "start": 357.24, "duration": 7.32}, {"text": "he submitted to the invaders before they were even able to reach Novgorod.", "start": 364.56, "duration": 4.62}, {"text": "This act was quite unusual, as other principalities often chose to fight the Mongols,", "start": 369.58, "duration": 5.54}, {"text": "which resulted in the devastation of their domains.", "start": 375.2, "duration": 3.52}, {"text": "Although on this occasion the Golden Horde eventually omitted Novgorod,", "start": 378.98, "duration": 3.98}, {"text": "from then on the eastern threat became Alexander’s major concern.", "start": 382.96, "duration": 5.36}, {"text": "But let’s get back to the western theatre and affairs in Livonia.", "start": 388.82, "duration": 3.98}, {"text": "Just as the Mongols devastated the cities of southern Russia,", "start": 393.06, "duration": 3.78}, {"text": "Pope Gregory IX called for a crusade against the Orthodox “schismatics”, encouraged by the divisions within the Novgorodian ruling class.", "start": 396.92, "duration": 9.46}, {"text": "The Pope’s official reasoning was that the Eastern Church did little to convert Baltic pagans,", "start": 406.76, "duration": 5.42}, {"text": "he also hoped that a common enemy would unify the squabbling crusaders of the Eastern Baltic area.", "start": 412.18, "duration": 6.42}, {"text": "It took some time for the papal legate to get things going,", "start": 419.22, "duration": 3.48}, {"text": "but in the summer of the year 1240 the first advance into Novgorodian territory had been made.", "start": 423.0, "duration": 6.46}, {"text": "The Swedish army under Thomas, Bishop of Finland, sailed up the Neva river.", "start": 429.6, "duration": 5.26}, {"text": "It’s not clear whether the Swedish bishop acted in cooperation with other allies,", "start": 435.08, "duration": 4.62}, {"text": "but his attack was easily repulsed by Alexander,", "start": 439.7, "duration": 3.04}, {"text": "who ambushed the camping Swedes and dealt them a considerable blow, forcing an uncoordinated retreat.", "start": 442.74, "duration": 7.32}, {"text": "Most likely this wasn’t a full scale invasion,", "start": 450.42, "duration": 3.2}, {"text": "but nonetheless Alexander used this victory wisely, and was soon hailed as Alexander Nevsky,", "start": 453.62, "duration": 7.0}, {"text": "enjoying immense popularity among the Novgorodian townsfolk.", "start": 460.62, "duration": 4.28}, {"text": "Yet his unexpected success made him new enemies, and soon, after a quarrel with the city’s merchants,", "start": 465.14, "duration": 6.26}, {"text": "he ostensibly left Novgorod, taking all his troops and family.", "start": 471.9, "duration": 4.58}, {"text": "Clearly, this time business won over politics.", "start": 476.72, "duration": 4.1}, {"text": "Anyway, this wasn’t by any means an end to Novgorod’s problems.", "start": 481.04, "duration": 4.64}, {"text": "Just months later, the Livonian Order raided deep into Novgorodian territory north of Lake Peipus,", "start": 485.96, "duration": 7.44}, {"text": "seizing the town of Koporye and plundering Tesov, just 50 kilometres from Novgorod.", "start": 493.4, "duration": 6.08}, {"text": "The town council wasn’t really prepared for this unexpected attack.", "start": 499.62, "duration": 3.96}, {"text": "Moreover, the Livonian Order installed a permanent garrison in Koporye,", "start": 503.8, "duration": 5.0}, {"text": "and soon began construction of a stone castle.", "start": 508.8, "duration": 3.08}, {"text": "Apparently, their plans were far more ambitious than just the mere plundering of Russian territory.", "start": 512.18, "duration": 6.5}, {"text": "Novgorod realised the danger and asked for Alexander to return,", "start": 519.16, "duration": 4.24}, {"text": "abandoning their demands which had led to their previous quarrel.", "start": 523.46, "duration": 3.9}, {"text": "Grand Prince Yaroslav initially offered the help of his younger son, Andrey,", "start": 527.82, "duration": 4.6}, {"text": "but Novgorodians insisted on Alexander.", "start": 532.42, "duration": 3.4}, {"text": "Eventually, both Vsevolodovich brothers were sent back to the north-west,", "start": 536.38, "duration": 5.0}, {"text": "but all this politics took time, during which the Livonian Order didn’t stay idle.", "start": 542.48, "duration": 5.48}, {"text": "With help of Danish and German nobility from Livonia, they performed another attack, this time south of the Lake Peipus.", "start": 548.4, "duration": 8.36}, {"text": "The Izborsk stronghold fell, and subsequently, the tiny garrison of Pskov was overwhelmed, and the town was taken.", "start": 556.98, "duration": 8.54}, {"text": "Crusader confidence was high, they doubted that Novgorod was able to acquire a sufficient army to actually oppose the invaders.", "start": 566.1, "duration": 8.66}, {"text": "One of the bishops even messaged the Pope with a request to grant him authority over Russian lands yet to be conquered.", "start": 575.04, "duration": 7.9}, {"text": "Meanwhile, Alexander finally arrived in Novgorod with his troops, strung up those who dared to drive him out of the city a year earlier", "start": 583.3, "duration": 7.68}, {"text": "and prepared an organised defence.", "start": 590.98, "duration": 2.6}, {"text": "His return though, coincided with another Mongol attack.", "start": 593.78, "duration": 4.2}, {"text": "It was a deadly threat to both belligerents, as Alexander couldn’t be sure of the Mongol intentions,", "start": 597.98, "duration": 6.04}, {"text": "as their previous agreements were rather brief and of little importance.", "start": 604.02, "duration": 4.92}, {"text": "Luckily, the Mongols avoided Novgorod and the north in general, wreaking havoc in central Europe instead,", "start": 609.1, "duration": 6.42}, {"text": "so Alexander could plan his steps uninterrupted.", "start": 615.52, "duration": 3.94}, {"text": "He performed his first counter-attack in autumn of the year 1241, taking the newly built Koporye castle by surprise.", "start": 620.04, "duration": 9.12}, {"text": "Early the next year he was ready to reclaim the town of Pskov, and did it swiftly enough,", "start": 629.5, "duration": 5.28}, {"text": "so the stationed nearby garrison at Izborsk could not intervene in time.", "start": 634.78, "duration": 5.38}, {"text": "While Alexander limited his actions to Novgorod territory over the previous year,", "start": 640.46, "duration": 5.28}, {"text": "this time he passed by the Izborsk stronghold", "start": 645.9, "duration": 3.08}, {"text": "and ravaged the lands to the south of city of Dorpat as an act of vengeance.", "start": 648.98, "duration": 5.44}, {"text": "While Novgorodian troops were busy pillaging, the Livonian Order hastily assembled an army able to repell the enemy,", "start": 655.0, "duration": 7.32}, {"text": "commanded by Bishop Hermann of Dorpat.", "start": 662.32, "duration": 3.3}, {"text": "They struck one of Alexander’s unexpecting units south-east of the city in a first move.", "start": 665.78, "duration": 6.74}, {"text": "Novgorodian survivors of the ambush rejoined with their prince", "start": 672.98, "duration": 4.0}, {"text": "and Alexander learned that the Livonian Order had gathered enough troops to pose a serious threat to his goals.", "start": 677.2, "duration": 7.72}, {"text": "We don’t know much about Alexander’s exact plans, but upon learning that the enemy was tracing him,", "start": 685.22, "duration": 6.58}, {"text": "he made use of his superior scouts and marched north, along the lake, seeking a suitable spot to defend.", "start": 691.8, "duration": 7.86}, {"text": "Upon reaching the narrow crossing around the sound connecting Lakes Pskov and Peipus,", "start": 699.92, "duration": 5.52}, {"text": "he decided to march through it and began deployment on the eastern shore.", "start": 705.44, "duration": 5.1}, {"text": "Both flanks were occupied by Alexander’s and Andrey’s druzhina,", "start": 711.0, "duration": 4.28}, {"text": "the princes’ mounted retinue and the most valuable of all Novgorodian troops.", "start": 715.28, "duration": 5.0}, {"text": "The centre comprised predominantly of the city’s militia, supplemented by the princes’ own footmen.", "start": 720.5, "duration": 5.94}, {"text": "On the right side, Alexander placed a small unit of horse archers,", "start": 726.72, "duration": 4.48}, {"text": "of unknown origin, but most likely from the Kipchak or Cuman region.", "start": 731.2, "duration": 4.68}, {"text": "The total number of his troops probably counted a little more than 5,000 men.", "start": 736.04, "duration": 4.98}, {"text": "Soon, Bishop Hermann of Dorpat arrived on the battlefield.", "start": 741.54, "duration": 4.42}, {"text": "A hurried mobilisation directly affected the Bishop’s numbers, as he lead no more than 2,500 soldiers to the battle.", "start": 746.34, "duration": 8.1}, {"text": "Still, he had several hundred heavily armoured mounted knights of Danish and German origin positioned in the centre,", "start": 754.62, "duration": 7.62}, {"text": "assisted by no more than one hundred Livonian Brothers on their right.", "start": 762.24, "duration": 4.98}, {"text": "A couple of units of regular militia infantry covered the left flank,", "start": 767.4, "duration": 4.3}, {"text": "whilst the second line was comprised of lightly armoured Estionian allied tribesmen held in the reserve.", "start": 771.7, "duration": 7.12}, {"text": "Hermann was aware of his inferior numbers,", "start": 779.12, "duration": 2.8}, {"text": "but also knew the value of a devastating heavy cavalry charge which,", "start": 782.1, "duration": 4.6}, {"text": "under favourable conditions, was able to rout entire units in a matter of minutes.", "start": 786.7, "duration": 6.08}, {"text": "The battle started, when the bulk of Hermann’s host was halfway through the sound.", "start": 792.98, "duration": 5.0}, {"text": "He commanded the charge of heavy cavalry, hoping to use the momentum to break Alexander’s centre.", "start": 797.98, "duration": 6.7}, {"text": "Charging in a wedge formation, mounted knights struck the terrified Novgorodian militia, dealing massive initial casualties.", "start": 805.08, "duration": 8.9}, {"text": "Melee fighting commenced, and while Herman’s infantry joined the fight, it quickly became clear,", "start": 814.32, "duration": 5.78}, {"text": "that Alexander’s centre had yet to break, despite sustaining considerable damage.", "start": 820.2, "duration": 6.26}, {"text": "This was the time for the Novgorodian prince to take an active part in the battle.", "start": 826.74, "duration": 5.28}, {"text": "He sent horse archers to disrupt the enemy lines,", "start": 832.38, "duration": 3.14}, {"text": "while his own retinue, along with his brothers, advanced on both flanks,", "start": 835.68, "duration": 4.72}, {"text": "performing a pincer movement in an attempt to envelop Hermann’s troops.", "start": 840.4, "duration": 5.52}, {"text": "When the Estonian auxiliary infantry realized, that the Bishop’s battle plan was too optimistic,", "start": 846.52, "duration": 5.82}, {"text": "they began to waver, and upon a brief engagement with the enemy,", "start": 852.64, "duration": 3.96}, {"text": "they gradually fled the battlefield.", "start": 856.6, "duration": 2.26}, {"text": "Alexander’s retinue finished their envelopment and the slaughter began.", "start": 859.16, "duration": 4.4}, {"text": "Some Livonian brothers and other knights managed to break through the encirclement and retreat,", "start": 864.06, "duration": 5.82}, {"text": "but many fell, including Bishop Hermann.", "start": 869.9, "duration": 3.34}, {"text": "The casualties were probably quite similar on both sides,", "start": 873.48, "duration": 3.62}, {"text": "but Alexander’s army was considerably bigger and well-motivated,", "start": 877.1, "duration": 4.92}, {"text": "so while the infantry in the centre endured the heavy cavalry charge", "start": 882.24, "duration": 4.1}, {"text": "he could take advantage of his resources and overwhelm the inferior numbers of the enemy.", "start": 886.52, "duration": 6.16}, {"text": "The peace negotiations that followed restored the former borders,", "start": 893.38, "duration": 4.28}, {"text": "as Alexander was focused on defending his own territory rather than conquering the west.", "start": 897.74, "duration": 6.34}, {"text": "The Livonian Order was considerably weakened, and soon had to face multiple native rebellions throughout the Eastern Baltic.", "start": 904.28, "duration": 8.32}, {"text": "The Christianisation process of the indigenous people took many more lives and lasted for another sixty years.", "start": 913.26, "duration": 7.56}, {"text": "The Battle of  the Lake Peipus boosted Alexander’s popularity and became probably his most notable achievement,", "start": 921.38, "duration": 7.62}, {"text": "enabling him to retain his position as Prince of Novgorod", "start": 929.22, "duration": 4.36}, {"text": "and eventually lead the Russian principalities through the difficult times of the Mongol Invasions.", "start": 933.8, "duration": 6.68}, {"text": "His political and military abilities lead him to be hailed as national hero", "start": 941.06, "duration": 5.44}, {"text": "and one of the most recognized figures in Russian history.", "start": 946.5, "duration": 4.4}]