[{"text": "This video is done in a collaboration with Wisecrack, so make sure to check out their video next.", "start": 0.0, "duration": 4.5}, {"text": "So this is a very special video for me,", "start": 4.5, "duration": 2.0}, {"text": "because as I'm sure many of you already know, I live in Texas, and have lived here for nearly my entire life.", "start": 6.5, "duration": 6.2}, {"text": "So, naturally, I've always wondered what Texas would be like if it was actually its own independent country.", "start": 12.7, "duration": 5.8}, {"text": "It used to be one once for a quick point in history between 1836 and 1846", "start": 18.5, "duration": 5.28}, {"text": "before it got annexed by the United States.", "start": 23.78, "duration": 2.0}, {"text": "But what would this independent Texas look like today if it ever happened?", "start": 25.78, "duration": 4.02}, {"text": "First of all, Texas basically gets second place in everything inside the U.S.", "start": 29.8, "duration": 4.8}, {"text": "It has the second largest population behind California,", "start": 34.6, "duration": 3.0}, {"text": "the second largest economy, also behind California,", "start": 37.6, "duration": 2.9}, {"text": "and the second largest area behind Alaska.", "start": 40.5, "duration": 2.3}, {"text": "But that doesn't mean that Texas is small,", "start": 42.8, "duration": 2.5}, {"text": "the Texan population stands at 28,305,000 people,", "start": 45.3, "duration": 4.2}, {"text": "which would make it the 50th most populous country in the world, ahead of a lot bigger countries like Australia.", "start": 49.52, "duration": 5.68}, {"text": "While Texas is much smaller than Australia in terms of land, it's much bigger than any country in Europe is except for Russia.", "start": 55.2, "duration": 6.7}, {"text": "Texas is so big on a European scale that you could fit all of Poland inside of it", "start": 61.9, "duration": 4.5}, {"text": "and still have room to drive around the edges.", "start": 66.4, "duration": 2.3}, {"text": "The town of Texarkana in the east is closer to Chicago, Illinois than to the city of El Paso on the western side of Texas.", "start": 68.7, "duration": 7.0}, {"text": "If it was independent, Texas would be the 39th largest country in the world in terms of land area.", "start": 75.7, "duration": 5.2}, {"text": "But the final big thing about Texas is its economy.", "start": 80.9, "duration": 2.6}, {"text": "The Texan economy stands currently at a GDP of 1.599 trillion U.S. dollars.", "start": 83.5, "duration": 6.1}, {"text": "This is enormous and would make Texas the 11th largest economy in the world,", "start": 89.6, "duration": 4.5}, {"text": "beating out other giant countries like South Korea, Russia, and Australia again.", "start": 94.1, "duration": 5.1}, {"text": "Big companies like American Airlines, AT&T, Dell, and Exxon Mobil", "start": 99.2, "duration": 4.1}, {"text": "all have headquarters currently located in Texas, which dramatically adds to this economic power.", "start": 103.3, "duration": 5.6}, {"text": "Texas is probably one of the few U.S. states that actually could succeed as an independent country,", "start": 108.9, "duration": 5.1}, {"text": "and here are a few reasons why:", "start": 114.0, "duration": 2.3}, {"text": "First, it has a coast, and therefore access to the world's shipping routes.", "start": 116.3, "duration": 3.7}, {"text": "Houston is the 8th busiest port in the United States and already has shipping routes connected with", "start": 120.0, "duration": 4.8}, {"text": "Brazil, the Netherlands, Germany, India, and China.", "start": 124.8, "duration": 3.6}, {"text": "Second, Texas is what's called a Tax-Donor state,", "start": 128.4, "duration": 2.9}, {"text": "meaning that the Texan state government sends more money to the federal government", "start": 131.3, "duration": 3.8}, {"text": "than it receives back in benefits.", "start": 135.1, "duration": 1.9}, {"text": "For every one dollar that Texas sends to Washington, it receives back just 94 cents.", "start": 137.0, "duration": 4.9}, {"text": "This means that Texas could fund all of their current government expenditures", "start": 141.9, "duration": 3.3}, {"text": "and still have enough left over to generate a nice budget surplus.", "start": 145.2, "duration": 3.7}, {"text": "Compared with other states like Mississippi,", "start": 148.9, "duration": 2.0}, {"text": "who gets three dollars back from the federal government for every one dollar they send,", "start": 150.9, "duration": 3.6}, {"text": "Texas would be in a great financial situation at first upon becoming independent.", "start": 154.5, "duration": 4.3}, {"text": "The final reason Texas would be self-sustainable is energy.", "start": 158.8, "duration": 2.9}, {"text": "Let's switch over to a map of the U.S. electrical grid to see how that's the case.", "start": 161.7, "duration": 4.2}, {"text": "There are only three main power grids in the mainland United States that the U.S. operates:", "start": 165.9, "duration": 4.9}, {"text": "The western grid, the eastern grid, and the Texan grid.", "start": 170.8, "duration": 2.7}, {"text": "Texas has its own fully independent electrical grid that wouldn't be influenced by the rest of the U.S.", "start": 173.5, "duration": 5.7}, {"text": "If another state like, say, New Mexico decided to leave", "start": 179.2, "duration": 2.7}, {"text": "the rest of the U.S. could just shut off that part of the grid and deny them electrical access.", "start": 181.9, "duration": 5.0}, {"text": "Not so with Texas. But here's the really interesting part:", "start": 186.9, "duration": 3.9}, {"text": "Back in 1840, Texas used to be a lot bigger,", "start": 190.8, "duration": 3.0}, {"text": "back then, it claimed about half of modern New Mexico,", "start": 193.8, "duration": 2.7}, {"text": "and also chunks of Oklahoma, Kansas, Colorado, and even as far north as Wyoming.", "start": 196.5, "duration": 4.8}, {"text": "If, for some reason, the modern Texas was expanded back to this territory today", "start": 201.3, "duration": 4.1}, {"text": "it wouldn't really add as much as you think.", "start": 205.4, "duration": 2.5}, {"text": "The population would only go up by a little over 1.2 million people,", "start": 207.9, "duration": 4.3}, {"text": "because besides the towns of Santa Fe in New Mexico and Pueblo in Colorado,", "start": 212.2, "duration": 4.6}, {"text": "most of this extra land is pretty rural.", "start": 216.8, "duration": 2.5}, {"text": "But back in 1840, the entirety of Texas was even more rural.", "start": 219.3, "duration": 5.0}, {"text": "Back then, the entire population of Texas was an incredible 70,000 people,", "start": 224.3, "duration": 5.2}, {"text": "basically the size of a small suburb of either Dallas or Houston is today.", "start": 229.5, "duration": 4.3}, {"text": "The only settlements you can see on maps from back then", "start": 233.8, "duration": 2.8}, {"text": "were San Antonio, Houston, and Santa Fe, which were all basically islands of people", "start": 236.6, "duration": 4.9}, {"text": "separated by hundreds, or thousands of kilometers of open and unpopulated land.", "start": 241.5, "duration": 5.2}, {"text": "Texas has changed dramatically since then in just a little over one and a half centuries,", "start": 246.7, "duration": 4.7}, {"text": "from a rural backwater on the fringes of the world to an economic powerhouse home to tens of millions.", "start": 251.4, "duration": 5.7}, {"text": "But there's one more thing that we haven't touched on yet, and that's if Texas could actually legally do this.", "start": 257.1, "duration": 5.7}, {"text": "The answer is a definitive no.", "start": 262.8, "duration": 2.4}, {"text": "The U.S. government has made it explicitly clear that no states can ever leave the union", "start": 265.2, "duration": 4.6}, {"text": "since the last time that was tried didn't really go over so well.", "start": 269.8, "duration": 3.6}, {"text": "This includes Texas, who can never ever hope to compete with the U.S. military.", "start": 273.4, "duration": 4.9}, {"text": "Texas does have a pretty weird clause though in its consitution that allows the state to, at any time,", "start": 278.3, "duration": 6.0}, {"text": "divide itself into five different, smaller states.", "start": 284.3, "duration": 3.1}, {"text": "Texas doesn't need permission from the U.S. congress to do this,", "start": 287.4, "duration": 3.0}, {"text": "and it would immediately quintuple their own power in the U.S. senate", "start": 290.4, "duration": 3.3}, {"text": "from having two senators up to ten senators.", "start": 293.7, "duration": 2.8}, {"text": "This could enable Texas to influence the U.S. government more heavily,", "start": 296.5, "duration": 3.3}, {"text": "but likely wouldn't help it to achieve independence.", "start": 299.8, "duration": 2.8}, {"text": "The vast majority of people living inside of Texas don't want independence anyway,", "start": 302.6, "duration": 4.1}, {"text": "but it's always just fun to speculate.", "start": 306.7, "duration": 2.7}, {"text": "The secession of Texas is just one of the many themes of one of my all-time favorites games: Deus Ex.", "start": 310.0, "duration": 5.7}, {"text": "It's about a grim future where humans can be technologically enhanced", "start": 315.7, "duration": 3.4}, {"text": "and where every conspiracy theory is more or less true.", "start": 319.1, "duration": 3.7}, {"text": "My friends over at Wisecrack just released a video exploring the philosophy of the whole series,", "start": 322.8, "duration": 4.6}, {"text": "which explores how paranoia and chaos operate in society,", "start": 327.4, "duration": 3.3}, {"text": "and whether or not we should all be excited about becoming cyborgs.", "start": 330.7, "duration": 3.5}, {"text": "So check it out by clicking here, and tell them that RealLifeLore sent you.", "start": 334.2, "duration": 3.3}, {"text": "Don't forget to subscribe, and I'll see you next friday for another brand new video then.", "start": 337.5, "duration": 4.4}]