[{"text": "What’s up guys, Rogue-9 here! In relatively\nrecent seasons, we have seen the extended", "start": 1.64, "duration": 4.98}, {"text": "barrel introduced to a number of new weapons,\nincluding Maverick’s M4, Mozzie’s P10", "start": 6.62, "duration": 5.44}, {"text": "RONI and now Mira and Goyo’s Vector .45\nACP. In addition to this, many of the existing", "start": 12.06, "duration": 5.63}, {"text": "weapons that allow the use of the extended\nbarrel have had damage nerfs and buffs since", "start": 17.69, "duration": 4.53}, {"text": "I last explored this particular attachment,\nso the questions I will be answering in this video are:", "start": 22.22, "duration": 5.06}, {"text": "Is the extended barrel a useful attachment", "start": 27.28, "duration": 2.2}, {"text": "for any of the new guns since my last test?\nHas anything changed significantly for the", "start": 29.48, "duration": 5.21}, {"text": "existing weapons? Which weapons does the extended\nbarrel add the most value to and which ones", "start": 34.69, "duration": 5.11}, {"text": "get almost no benefit at all?\nAs always I have run some tests, crunched", "start": 39.8, "duration": 4.62}, {"text": "the numbers and drawn some evidence based\nconclusions. Extended barrel: yay or nay?", "start": 44.42, "duration": 4.96}, {"text": "Let’s go and find out!", "start": 49.38, "duration": 1.84}, {"text": "First up let me tell you a little bit about today’s sponsor:\n“Raid: Shadow Legends”, the free to play", "start": 53.1, "duration": 4.919}, {"text": "mobile RPG that was released just earlier this year!", "start": 58.019, "duration": 2.731}, {"text": "I’ve been playing Raid: Shadow Legends on\nmy Galaxy S6 (yes, I know my phone is old)", "start": 60.75, "duration": 6.58}, {"text": "but one of the most surprising things about\nthe game is how well it manages to run, with", "start": 67.33, "duration": 3.84}, {"text": "full 3d character models, on such an old device.\nI would describe Raid as a JRPG style game,", "start": 71.17, "duration": 5.51}, {"text": "with turn based combat where strategic thinking\nis the key to victory and it all starts out", "start": 76.68, "duration": 4.68}, {"text": "with picking the best team for the job. Currently\nmy favourite champions are from the Ork faction.", "start": 81.36, "duration": 5.25}, {"text": "Galek’s Hellraiser ability is really useful\nand overall, I just really like the look of", "start": 86.61, "duration": 4.99}, {"text": "the Orks. There’s a lot of depth to this game and", "start": 91.6, "duration": 2.409}, {"text": "a lot of longevity with a substantial road\nmap of new content already laid out.", "start": 94.009, "duration": 5.311}, {"text": "The almost 320,000 players who have reviewed\nthe game on Google Play so far have given", "start": 99.32, "duration": 5.259}, {"text": "it an average of 4.5 out of 5 stars and on\nthe Apple app store it has 4.8 out of 5 stars.", "start": 104.579, "duration": 7.101}, {"text": "If you use the link in the description below,\nyou will receive a new player bonus of 50,000", "start": 111.68, "duration": 4.579}, {"text": "silver and a free epic level champion, so\ngo ahead and give the game a go; it’s free", "start": 116.259, "duration": 5.381}, {"text": "after all! And with that, let’s \nget back to the extended barrel!", "start": 121.64, "duration": 4.009}, {"text": "When discussing the extended barrel let me\nfirst make sure that we’re all on the same", "start": 125.649, "duration": 3.501}, {"text": "page by quickly going over some of the basics.\nIf you start to notice that you already know", "start": 129.15, "duration": 4.61}, {"text": "all of this, there will be a pinned comment\nbelow with timestamps to the relevant parts", "start": 133.76, "duration": 4.25}, {"text": "of the video. As you may know,\nthe extended barrel’s only", "start": 138.01, "duration": 2.99}, {"text": "purpose in Rainbow Six Siege is to “Provide\nthe full damage over a longer distance range,", "start": 141.0, "duration": 5.93}, {"text": "which offers you more options in terms of\npositioning to take down your opponents.”", "start": 146.93, "duration": 5.059}, {"text": "At least that’s what the in-game menu tells\nus. But not only is this description a bit", "start": 151.989, "duration": 5.431}, {"text": "vague, I also think that it is somewhat misleading\nbecause what the extended barrel actually", "start": 157.42, "duration": 5.23}, {"text": "does is that it flattens out the damage drop-off\ncurve for each weapon that it is attached to.", "start": 162.65, "duration": 5.59}, {"text": "For example, as you can see here, Jäger’s", "start": 168.24, "duration": 3.12}, {"text": "416-C carbine will normally do 43 points of\ndamage (with body shots against level 1 armour", "start": 171.36, "duration": 5.92}, {"text": "opponents) up to 25m and then we have a linear\ndecline down to 21 damage at 35m plus. Once", "start": 177.28, "duration": 8.179}, {"text": "you attach the extended barrel, the minimum\ndamage at long range is elevated to 32 points", "start": 185.459, "duration": 5.401}, {"text": "per shot but as you can see, the close range\ndamage and the inflection points of the drop-off", "start": 190.86, "duration": 4.55}, {"text": "curve remain unchanged.\nSo that is the benefit of the extended barrel", "start": 195.41, "duration": 4.7}, {"text": "in a nutshell: flatter drop-off and\nmore damage at long range.", "start": 200.11, "duration": 4.16}, {"text": "Ok, that doesn’t sound too bad really. Are\nthere any downsides to this attachment? Well,", "start": 204.27, "duration": 5.76}, {"text": "good news everyone, the extended barrel does\nin fact not have any active disadvantages.", "start": 210.03, "duration": 6.0}, {"text": "The only way in which the stats are modified\nis more damage and nothing else BUT!", "start": 216.03, "duration": 5.69}, {"text": "Before we all start celebrating, there are\na number of what we could call passive disadvantages.", "start": 221.72, "duration": 6.17}, {"text": "First of all there is the opportunity cost\nof missing out on any of the other muzzle", "start": 227.89, "duration": 4.87}, {"text": "attachments. Most of the guns (with the exception\nof Frost’s 9mm C1) have access to an array", "start": 232.76, "duration": 5.509}, {"text": "of other muzzle devices that all come with\ndifferent types of recoil benefits. If you", "start": 238.269, "duration": 4.961}, {"text": "want to know exactly how each of the other\nattachments affect your guns’ recoil patterns,", "start": 243.23, "duration": 4.3}, {"text": "I have a really good video on this topic and\nyou can find a link to that in the end card", "start": 247.53, "duration": 4.35}, {"text": "of this video or in the info card at the top\nright hand of your screen now!", "start": 251.88, "duration": 4.97}, {"text": "And then not only do you miss out on reduced\nrecoil when you attach the extended barrel", "start": 256.85, "duration": 4.9}, {"text": "but (and this may not surprise you) the extended\nbarrel also changes the profile of your gun", "start": 261.75, "duration": 5.01}, {"text": "significantly and the additional length that\nit adds can, in some situations, give away", "start": 266.76, "duration": 5.34}, {"text": "your position if you are hiding behind cover\nor trying to sneak around a corner.", "start": 272.1, "duration": 4.53}, {"text": "Ok, so a few disadvantages after all but I\nguess if the damage buff to any of the guns", "start": 276.63, "duration": 6.04}, {"text": "is high enough, this attachment may still\nbe worth considering. Let’s go and take", "start": 282.67, "duration": 4.361}, {"text": "a look at the damage stats now.\nHere is an overview of the damage stat boost", "start": 287.031, "duration": 4.629}, {"text": "for each of the guns that can attach the extended\nbarrel, with the exception of Ela’s FO-12", "start": 291.66, "duration": 4.85}, {"text": "shotgun. I have covered that separately in\na past video and you can find a link to that", "start": 296.51, "duration": 3.99}, {"text": "at the end too if you like.\nAs you can see, the additional damage added", "start": 300.5, "duration": 3.9}, {"text": "to each gun by the extended barrel varies\nwildly. Some only get a max. boost of 11 or", "start": 304.4, "duration": 6.59}, {"text": "13% while others get a 50% increase or even\nmore! At first glance, this inconsistency", "start": 310.99, "duration": 5.93}, {"text": "may seem confusing and completely random but\nI do believe that I may have come up with", "start": 316.92, "duration": 4.65}, {"text": "a theory on why the range of\nadditional damage is so diverse", "start": 321.57, "duration": 4.28}, {"text": "But before we get to that, let’s quickly\nlook at some of the new guns that have been", "start": 325.85, "duration": 3.95}, {"text": "added and what the wondrous extended barrel\ncan do for them! Maverick’s M4 gets a 22.2%", "start": 329.8, "duration": 7.61}, {"text": "damage increase at 35m+ which is just below\nthe average of all of the guns combined so", "start": 337.41, "duration": 6.42}, {"text": "that looks fair enough at first glance. Here’s\nthe issue though, 33 damage means that 3 hits", "start": 343.83, "duration": 5.8}, {"text": "will leave a lvl. 1 armour opponent with 1\nHP remaining and so the number of shots to", "start": 349.63, "duration": 5.19}, {"text": "down or kill that enemy remains at 4. Not\ntaking bullet penetration, leg shots or previous", "start": 354.82, "duration": 6.31}, {"text": "damage into account that means that the extended\nbarrel actually offers very little benefit", "start": 361.13, "duration": 4.77}, {"text": "at all to Maverick and his M4 at least against\nlevel 1 armour defenders.", "start": 365.9, "duration": 4.88}, {"text": "For the other two newer guns in the game that\nhave access to the extended barrel, namely", "start": 370.78, "duration": 3.96}, {"text": "Mira’s Vectors .45 and Mozzie’s P10 RONI,\nthe damage boost at range is similarly small", "start": 374.74, "duration": 6.19}, {"text": "to mediocre just like the M4’s but at least\nhere there seems to be somewhat of a positive", "start": 380.93, "duration": 4.95}, {"text": "impact. 15 damage is abysmal and will require\n7 hits to lvl. 1 armour opponents and even", "start": 385.88, "duration": 7.14}, {"text": "though 17 is not all that much better, it\nwill at least mean one less bullet to down", "start": 393.02, "duration": 4.69}, {"text": "or kill. And the same goes for the P10. Usually\nyou would need 6 solid upper body hits at", "start": 397.71, "duration": 5.46}, {"text": "27m or more and with the extended barrel it is “only” 5.", "start": 403.17, "duration": 4.57}, {"text": "And this leads us very nicely to my theory\nas to why the damage boost is so inconsistent", "start": 407.74, "duration": 5.21}, {"text": "across all of the different guns. It appears\nthat, in almost all cases, the damage boost", "start": 412.95, "duration": 5.73}, {"text": "was specifically chosen in order to reduce\nthe number of required body shots to down", "start": 418.68, "duration": 4.6}, {"text": "a full health, level 1 armour opponent by\none less shot than it would normally take", "start": 423.28, "duration": 4.94}, {"text": "without the extended barrel. This rule applies\npretty consistently across all of the weapons", "start": 428.22, "duration": 5.53}, {"text": "with the exception of the M4 as already mentioned\nand also Caveira’s M12 SMG. For some reason,", "start": 433.75, "duration": 6.8}, {"text": "the 14% damage boost to this gun is just short\nof where it would need to be in order to reduce", "start": 440.55, "duration": 5.99}, {"text": "the STD/K by the standard one hit. This inconsistency\nfor the M12 also extends to lvl. 2 armour", "start": 446.54, "duration": 8.36}, {"text": "opponents and it’s not until you come up\nagainst full health lvl. 3 armour opponents", "start": 454.9, "duration": 4.37}, {"text": "that Caveira actually gets any benefit at\nall from the extended barrel. And since there", "start": 459.27, "duration": 4.56}, {"text": "are only three lvl. 3 armour attackers in\nthe game (Fuze, Gridlock and Monty), the conclusion", "start": 463.83, "duration": 5.25}, {"text": "for the M12 is that the extended barrel has\nbasically no benefit at all apart from when", "start": 469.08, "duration": 5.71}, {"text": "you are taking down opponents that have already\nbeen damaged beforehand or maybe when shooting", "start": 474.79, "duration": 4.87}, {"text": "through walls at long range or hitting the legs.", "start": 479.66, "duration": 3.56}, {"text": "If we compare all of the guns’ required\nshots to down or kill against level 2 and", "start": 483.22, "duration": 4.55}, {"text": "3 armour targets as well we can see that for\nthe most part, the results remain fairly consistent", "start": 487.77, "duration": 5.25}, {"text": "with usually one bullet less required to get\nthe job done. There are some exceptions though,", "start": 493.02, "duration": 5.29}, {"text": "such as Jäger’s 416-C which benefits by\n2 hits against lvl. 2 armours and by 3 hits", "start": 498.31, "duration": 5.72}, {"text": "against lvl. 3 armours. Buck’s C8 also benefits\na bit more against level 3 armour defenders", "start": 504.03, "duration": 6.09}, {"text": "and there are more occasions where guns don’t\nbenefit at all against certain armour types,", "start": 510.12, "duration": 4.88}, {"text": "e.g. Blackbeard’s Mk17 and the SMG-11.\nBut all in all, the most common benefit has", "start": 515.0, "duration": 6.14}, {"text": "quite successfully been calibrated to needing\none less body shot for almost all weapons", "start": 521.14, "duration": 5.37}, {"text": "against almost all opponents and that’s\nat least something, right?", "start": 526.51, "duration": 4.59}, {"text": "Well actually… it’s not really something.\nIt’s really not something at all… The", "start": 531.1, "duration": 6.781}, {"text": "fundamental problem with the extended barrel\nremains the same as always. With all of the", "start": 537.881, "duration": 4.829}, {"text": "weapons, you won’t start to really see a\nconsistent benefit until you are fighting", "start": 542.71, "duration": 4.88}, {"text": "at 27, 28 or even more meters distance and\nthat has two separate issues.", "start": 547.59, "duration": 6.41}, {"text": "First of all, you are giving up the added\nrecoil control that you would normally have", "start": 554.0, "duration": 3.7}, {"text": "with a different muzzle attachment and with\nthe added recoil, at distances of 30m, it", "start": 557.7, "duration": 5.25}, {"text": "will start to become rather challenging to\nhit your target consistently. So the one bullet", "start": 562.95, "duration": 4.83}, {"text": "you save on average could actually be cancelled\nout by the fact that you end up missing more", "start": 567.78, "duration": 4.86}, {"text": "shots than usual.\nBut the absolute nail in the coffin for the", "start": 572.64, "duration": 3.69}, {"text": "extended barrel (both for the existing weapons\nof the past and for the more recently added", "start": 576.33, "duration": 4.74}, {"text": "ones) is that Siege is just an incredibly\nclose quartered, fast paced game. There are", "start": 581.07, "duration": 5.2}, {"text": "very few opportunities on any of the maps\nwhere you can actually fight an opponent at", "start": 586.27, "duration": 4.89}, {"text": "more than 10-15m max. and putting up with\nhigher recoil and a longer barrel that could", "start": 591.16, "duration": 6.02}, {"text": "potentially give away your position in the\nwrong situation just isn’t ever worth the", "start": 597.18, "duration": 4.39}, {"text": "pitiful damage gain your get at ridiculous ranges.", "start": 601.57, "duration": 4.13}, {"text": "So, as much as I was hoping for a some revelation\nhere, some unannounced update or at least", "start": 605.7, "duration": 5.7}, {"text": "something about the new guns that would finally\nmake the extended barrel worth using, the", "start": 611.4, "duration": 5.12}, {"text": "sad fact is that this is still the most pointless\nattachment in the game. In most situations,", "start": 616.52, "duration": 6.03}, {"text": "whether on attack or defence, you simply don’t\nget any used out of the extended barrel and", "start": 622.55, "duration": 5.58}, {"text": "the disadvantages, as passive as they may\nbe are just not worth putting up with for", "start": 628.13, "duration": 4.92}, {"text": "such a small payoff.\nIn conclusion, if you were excited about the", "start": 633.05, "duration": 4.14}, {"text": "extended barrel coming to the Vector or maybe\nyou have thought about using it on the P10", "start": 637.19, "duration": 4.91}, {"text": "RONI or the M4… yeah don’t. But that’s\njust my personal opinion here. What are your", "start": 642.1, "duration": 5.33}, {"text": "thoughts? Do you ever use the extended barrel?\nOr do you avoid it like the plague? Go ahead", "start": 647.43, "duration": 5.18}, {"text": "and leave a vote in the poll by clicking in\nthe top right-hand corner of your screen now", "start": 652.61, "duration": 3.9}, {"text": "or feel free to elaborate on your thoughts\nin the comments section below. I look forward", "start": 656.51, "duration": 4.9}, {"text": "to hearing what you have to say!\nAnd that’s it. As always, many thanks for", "start": 661.41, "duration": 5.06}, {"text": "watching, I hope you enjoyed the video and\nI will see you in the next episode!", "start": 666.47, "duration": 6.13}]