[{"text": "This video is sponsored by the great courses plus click the link in the description to get your free one-month trial in", "start": 4.05, "duration": 5.66}, {"text": "Part 1 of the series we discuss some of the history of our schools and realize that there were even some", "start": 10.32, "duration": 4.31}, {"text": "benefits to a public and standardized education", "start": 14.73, "duration": 2.0}, {"text": "But there are a few cons of the current public and standardized system that are becoming more and more apparent in recent years", "start": 16.8, "duration": 5.87}, {"text": "Firstly it stifles creativity the students are limited in the subject matter they can learn and the ways in which they can learn", "start": 23.16, "duration": 6.109}, {"text": "Secondly a values efficiency mastery and promotes incomplete understanding of subject material the current school system operates like a factory", "start": 29.699, "duration": 7.85}, {"text": "Students have a certain amount of time to get graded", "start": 37.829, "duration": 2.09}, {"text": "And they're either good products or bad products the system moves students along after a certain period of time and not when they've fully mastered", "start": 39.92, "duration": 6.99}, {"text": "the current subject matter in Sal Khan's book the One World schoolhouse", "start": 46.91, "duration": 3.36}, {"text": "He refers to this as Swiss cheese learning", "start": 50.579, "duration": 2.69}, {"text": "Students are allowed to pass on to the next year subject matter if they obtain a grade of at least 50%", "start": 53.52, "duration": 5.09}, {"text": "That means there's over 50% of the material that they don't understand", "start": 58.949, "duration": 3.409}, {"text": "Eventually all these holes in their learning will catch up to them, and they'll hit a point where the material stops making sense", "start": 62.76, "duration": 5.21}, {"text": "The analogy Sal uses is that of a house you wouldn't build a house on week foundation", "start": 68.479, "duration": 4.47}, {"text": "Would you but we're constantly doing this to our students by pushing them ahead", "start": 72.95, "duration": 3.3}, {"text": "Regardless of their mastery over a topic again the current school system is like an assembly line values quantity over quality", "start": 76.439, "duration": 6.59}, {"text": "Lastly curriculums are quickly becoming outdated the world is evolving so rapidly that our older institutions", "start": 83.88, "duration": 5.9}, {"text": "Can't keep up if you look at the revolutions in human history from?", "start": 89.78, "duration": 3.059}, {"text": "agricultural to", "start": 93.03, "duration": 0.839}, {"text": "Informational you'll see that the gaps between them are getting smaller and smaller all of the great revolutions in history have also had massive changes", "start": 93.869, "duration": 7.25}, {"text": "In how we educated one another except for the most recent information age", "start": 101.119, "duration": 4.05}, {"text": "But we are starting to see a shift in the educational paradigm", "start": 105.17, "duration": 3.209}, {"text": "Here are some of my predictions on the future of education education", "start": 108.479, "duration": 3.23}, {"text": "Will likely be digital automated and highly personalized for the individual it will go at the students pace", "start": 112.14, "duration": 5.569}, {"text": "And it will require students to master subject matter before moving on", "start": 117.71, "duration": 3.629}, {"text": "It will also be cheaper than ever before we are already starting to see these things emerge with the birth of khanacademy educational", "start": 121.52, "duration": 5.849}, {"text": "YouTube channels and an increase in quality in online courses you have sites like Udemy or Skillshare. We can learn practice skills online", "start": 127.799, "duration": 7.059}, {"text": "Universities are starting to put some of their lectures and notes online", "start": 135.56, "duration": 2.509}, {"text": "Some are even hosting massive open online courses also known as MOOCs soon a student's entire", "start": 138.379, "duration": 5.27}, {"text": "Education will be based around a laptop and the internet with teachers being utilized on an as-needed basis education will become more meritocratic", "start": 143.87, "duration": 7.099}, {"text": "Students will reward the best", "start": 151.43, "duration": 1.41}, {"text": "educators with their attention and money and so educators will start to compete to be the best or to be unique as a result we'll", "start": 152.84, "duration": 6.019}, {"text": "see an increase in the quality of education", "start": 158.859, "duration": 1.69}, {"text": "students get the road to this type of", "start": 160.549, "duration": 2.0}, {"text": "Education will be a difficult one the roots of our current system run deep the infrastructure is already there", "start": 162.68, "duration": 5.36}, {"text": "Meanwhile the infrastructure for the future of education is still in its infancy", "start": 168.109, "duration": 3.5}, {"text": "Online education still doesn't have the prestige and clout that traditional colleges have although this paradigm is shifting as well", "start": 172.25, "duration": 6.169}, {"text": "No one's going to hire a doctor or lawyer who learned everything online", "start": 178.43, "duration": 3.8}, {"text": "But they would hire a programmer graphic designer digital marketer an animator or writer who learned everything online", "start": 182.23, "duration": 5.489}, {"text": "Here's the final note that I'd like to conclude on: human curiosity is very hard to kill", "start": 187.879, "duration": 4.88}, {"text": "We are naturally very curious beings you can see that by analyzing little kids and seeing how they interact with the world around them", "start": 192.76, "duration": 6.599}, {"text": "They're fascinated, and they want to know how it all works and fits together. This is human nature", "start": 199.419, "duration": 4.14}, {"text": "We can see that a current system is starting to show its age because it's somehow", "start": 203.75, "duration": 4.309}, {"text": "Miraculously putting out the flames of human curiosity in our youth. Young kids are seeing education as a chore", "start": 208.609, "duration": 5.63}, {"text": "I think most of us would agree that the current system is outdated", "start": 214.239, "duration": 3.119}, {"text": "And will leave many students unprepared for a rapidly changing future. For them, I already feel sad although", "start": 217.72, "duration": 6.179}, {"text": "there's still lots of work to be done. I'm quite optimistic about the future of our education", "start": 223.9, "duration": 4.199}, {"text": "I'm excited to see a world where we can bring back a system of education", "start": 228.099, "duration": 3.419}, {"text": "that allows students to find and use their natural talents and inclinations to make the world around them a better place", "start": 231.59, "duration": 6.199}, {"text": "I'm excited to see a world where students freely choose to understand the parts of the world that fascinate them", "start": 237.79, "duration": 5.339}, {"text": "instead of having their natural curiosity snuffed out.", "start": 243.319, "duration": 3.02}, {"text": "Thanks to The Great Courses Plus,", "start": 247.009, "duration": 1.4}, {"text": "You can get a free one-month trial to their services by clicking the link in the description. The Great Courses plus is a video learning service", "start": 248.409, "duration": 5.371}, {"text": "with teachings from some of the best lectures around the world. They have a huge library of over", "start": 253.78, "duration": 4.94}, {"text": "8,000 carefully curated courses. Websites like The Great Courses Plus are slowly edging out the need for colleges", "start": 258.88, "duration": 6.34}, {"text": "Recently, I've been learning more about business and marketing in the", "start": 265.22, "duration": 2.38}, {"text": "course \"Critical Business Skills for Success\" by Michael A Roberto", "start": 267.7, "duration": 3.18}, {"text": "I'll definitely be using The Great Courses Plus as a source of study for future videos.", "start": 270.88, "duration": 4.32}, {"text": "Again, you can get access to your free one-month trial by going to thegreatcoursesplus.com/freedom", "start": 275.2, "duration": 4.1}, {"text": "or you can click the link at the top of the description to take you over there", "start": 279.46, "duration": 4.5}, {"text": "As always, thanks for watching, and I'll see you soon.", "start": 283.96, "duration": 2.28}, {"text": "You", "start": 300.46, "duration": 2.0}]