[{"text": "Hey guys, this week's episode of Basics is sponsored by Blue Apron.", "start": 0.0, "duration": 3.8}, {"text": "Blue Apron is a meal-kit delivery service that's a great option for anybody who's trying to cook more,", "start": 3.8, "duration": 4.54}, {"text": "cook healthier, or cook more deliciously.", "start": 8.34, "duration": 2.26}, {"text": "The first 100 people to use the link in this video's description to sign up for Blue Apron", "start": 10.6, "duration": 4.18}, {"text": "will get $60 off their first 3 weeks.", "start": 14.78, "duration": 2.42}, {"text": "As you can see, Blue Apron once again saves the day with quick, beautiful meals", "start": 17.2, "duration": 4.2}, {"text": "featuring instructions you can follow and ingredients you can pronounce.", "start": 21.4, "duration": 3.2}, {"text": "[♪♪]", "start": 24.6, "duration": 10.4}, {"text": "Alright folks, let's get down to making some fried rice.", "start": 39.0, "duration": 2.33}, {"text": "And before you start making your rice according to your manufacturer's instructions,", "start": 41.33, "duration": 3.67}, {"text": "hold up, because first we want to rinse it before pouring it into the specified amount of boiling water.", "start": 45.0, "duration": 5.4}, {"text": "Rinsing rice removes excess starch, which results in a fluffier end product.", "start": 50.4, "duration": 3.8}, {"text": "And after seasoning with a little bit of salt, if we bake the rice", "start": 54.2, "duration": 3.2}, {"text": "in a covered pot at 375°F for 20 to 25 minutes,", "start": 57.4, "duration": 3.58}, {"text": "you will find that you are met with perfectly cooked white rice.", "start": 60.98, "duration": 3.42}, {"text": "No sticking, no breakage, no goopy, gummy crap.", "start": 64.4, "duration": 3.0}, {"text": "It's easier to make, and it comes out better.", "start": 67.4, "duration": 1.9}, {"text": "Now, fried rice is always made from leftovers, so we need to let this chill completely;", "start": 69.3, "duration": 4.0}, {"text": "about 30 minutes at room temperature and then 4 hours in the fridge", "start": 73.6, "duration": 3.0}, {"text": "before we can even start talking about woks.", "start": 76.6, "duration": 2.2}, {"text": "Woks are fun to cook in, but they really only work on high output commercial stoves.", "start": 78.8, "duration": 4.0}, {"text": "Home stove tops are gonna concentrate all the heat in the bottom of the pot,", "start": 82.8, "duration": 3.1}, {"text": "while the sides are gonna remain relatively cold,", "start": 85.9, "duration": 2.1}, {"text": "and since stirfries are all about high heats, we want as much surface area as possible exposed to the flame", "start": 88.0, "duration": 5.2}, {"text": "So this wide nonstick pan is perfect. Once it's pre-heated", "start": 93.2, "duration": 3.27}, {"text": "we're gonna hit it with a little bit of vegetable oil and add 2 beaten eggs.", "start": 96.47, "duration": 2.97}, {"text": "These are gonna cook really quickly and we don't want them to brown,", "start": 99.44, "duration": 2.58}, {"text": "so keep them moving until they just barely form into curds and then set them aside,", "start": 102.02, "duration": 3.929}, {"text": "Wipe your pan clean, add a little bit more oil, and it's time to add the protein of your choice.", "start": 106.16, "duration": 4.169}, {"text": "I'm going with shrimp and just like the eggs, we're gonna keep these moving and saute them until they are just cooked.", "start": 110.33, "duration": 4.709}, {"text": "Give them a little flip-see-do so you make sure that each side is nicely caramelized", "start": 115.04, "duration": 3.84}, {"text": "and then we're gonna dump them right into the large bowl in which our eggs are already waiting.", "start": 118.88, "duration": 3.8}, {"text": "Then we're going to give our pan one last wipe down, hit it with one last glug of oil,", "start": 122.68, "duration": 3.7}, {"text": "and we're going to enter the final phase of cooking by starting with some shiitake mushrooms,", "start": 126.38, "duration": 4.08}, {"text": "sautéing until they've given up all their moisture and they're just starting to brown.", "start": 130.46, "duration": 3.329}, {"text": "Then I'm gonna add some frozen peas to give my fried rice a nice frozen pea vibe", "start": 133.789, "duration": 4.271}, {"text": "and a generous double handful of chunked up ham", "start": 138.06, "duration": 2.44}, {"text": "We're just sautéing these over medium-high heat until everybody's nice and warm and happy.", "start": 140.5, "duration": 3.74}, {"text": "Make sure to pick up every individual ham cube and inspect for browning. Number 67 is looking good.", "start": 144.24, "duration": 4.4}, {"text": "So it's time to add 2 cloves of crushed garlic and continue to saute for another 30 seconds at most", "start": 148.64, "duration": 5.16}, {"text": "until it's just starting to get fragrant, and then it's rice time.", "start": 153.8, "duration": 2.46}, {"text": "We're adding about 4½ cups of our \"leftover\" white rice", "start": 156.26, "duration": 3.87}, {"text": "and then I've got a mixture here of 3 tablespoons each oyster sauce and soy sauce which I'm going to add to the mixture", "start": 160.13, "duration": 5.27}, {"text": "as we crank the heat to high and let this guy sauté.", "start": 165.4, "duration": 2.78}, {"text": "Break up any major clumps, and fry the whole affair together for about 3 to 5 minutes", "start": 168.18, "duration": 3.94}, {"text": "until it looks like everybody's gotten to know each other.", "start": 172.12, "duration": 2.029}, {"text": "Then it's time to invite our work friends to the party, let everybody mingle, and hope things don't get too awkward.", "start": 174.15, "duration": 4.77}, {"text": "But it won't, because we're gonna provide a little bit of social lubricant", "start": 178.92, "duration": 2.82}, {"text": "in the form of some vegetable oil, some thinly sliced scallions, and my personal favorite addition to fried rice:", "start": 181.74, "duration": 5.58}, {"text": "sesame seeds. Now by this point, we've reduced the heat to low and we're just gonna give everything a cursory mix,", "start": 187.32, "duration": 4.98}, {"text": "just to make sure that everybody's dancing and nobody's hanging up on the wall.", "start": 192.3, "duration": 2.84}, {"text": "And then the final and maybe most important ingredient is a big ol' dollop of butter.", "start": 195.14, "duration": 4.44}, {"text": "This is just gonna amp up the richness of the fried rice", "start": 199.58, "duration": 2.7}, {"text": "and assuage any worries that you had that this isn't gonna taste awesome.", "start": 202.28, "duration": 3.56}, {"text": "There you have it, folks: your very own homemade fried rice.", "start": 205.84, "duration": 2.66}, {"text": "As you can see this dish is incredibly easy to make and can be tweaked a thousand and one different ways", "start": 208.5, "duration": 4.4}, {"text": "to either use up what you've got in the fridge or appease the picky eater in your life.", "start": 212.9, "duration": 3.459}, {"text": "It can be made healthier, fattier, meatier or entirely vegetarian.", "start": 216.36, "duration": 4.02}, {"text": "And so, if one of your New Year's resolutions is to get cooking more, this is a great place to get started.", "start": 220.38, "duration": 4.4}, {"text": "I'll see you guys in 2019.", "start": 224.79, "duration": 2.0}]