[{"text": "Previously I showed you how to create this little circuit,", "start": 1.16, "duration": 3.64}, {"text": "which after powering it,", "start": 5.22, "duration": 1.72}, {"text": "creates a modified square wave at its outputs.", "start": 7.24, "duration": 2.42}, {"text": "We should not,", "start": 10.3, "duration": 1.28}, {"text": "but can step this voltage up", "start": 11.68, "duration": 1.38}, {"text": "to mains voltage through a transformer,", "start": 13.14, "duration": 2.28}, {"text": "and thus use the setup as a crude mains voltage inverter.", "start": 15.92, "duration": 3.34}, {"text": "Only problem is that the stepped-up voltage at the transformer outputs", "start": 20.26, "duration": 3.72}, {"text": "still looks nothing, like the sinusoidal mains AC voltage,", "start": 24.52, "duration": 3.02}, {"text": "we are familiar with.", "start": 27.72, "duration": 1.68}, {"text": "That is why many viewers asked me whether", "start": 30.48, "duration": 2.7}, {"text": "I could showcase a technique called SPWM,", "start": 33.44, "duration": 3.28}, {"text": "to create a pure sine wave inverter,", "start": 37.16, "duration": 2.16}, {"text": "that like the name implies, outputs a pure sine wave.", "start": 39.76, "duration": 3.18}, {"text": "Now of course such modification is definitely possible,", "start": 43.84, "duration": 3.74}, {"text": "but it does not change,", "start": 47.96, "duration": 1.12}, {"text": "that my circuits features no feedback system", "start": 49.34, "duration": 2.84}, {"text": "as well as a couple of other important safety features.", "start": 52.68, "duration": 3.34}, {"text": "Luckily though,", "start": 57.1, "duration": 1.02}, {"text": "another viewer asked whether I", "start": 58.12, "duration": 2.0}, {"text": "could have a look at the EGS002,", "start": 60.12, "duration": 2.8}, {"text": "which is a cheap pure sine wave inverter module,", "start": 63.56, "duration": 4.04}, {"text": "which comes with a voltage current and temperature protection", "start": 67.6, "duration": 2.0}, {"text": "and apparently even a feedback system.", "start": 70.4, "duration": 2.32}, {"text": "So in this video,", "start": 73.8, "duration": 1.44}, {"text": "let's find out how", "start": 75.24, "duration": 1.52}, {"text": "SPWM is used to synthesize a pure sine wave", "start": 76.76, "duration": 3.28}, {"text": "And afterwards,", "start": 80.88, "duration": 1.04}, {"text": "let's try to build an inverter based on the EGS002 to find out whether", "start": 81.92, "duration": 5.6}, {"text": "it is a decent DIY alternative for commercial inverter", "start": 87.68, "duration": 3.52}, {"text": "Let's Get Started!", "start": 92.12, "duration": 1.999}, {"text": "[Intro]", "start": 94.72, "duration": 9.96}, {"text": "This video is sponsored by JLCPCB,", "start": 105.64, "duration": 3.56}, {"text": "upload your Gerber files today to order high-quality PCBs", "start": 109.8, "duration": 4.32}, {"text": "for ridiculously low prices and make your projects look more professional", "start": 114.12, "duration": 4.88}, {"text": "First off what does s pwm stand for well the S stands for sinusoidal and", "start": 120.52, "duration": 6.72}, {"text": "PWM for ports with modulation", "start": 127.92, "duration": 2.27}, {"text": "through pulse width modulation", "start": 131.16, "duration": 1.65}, {"text": "We create a port with whose frequency we can change as well as the on time of the bolts", "start": 132.81, "duration": 6.44}, {"text": "Also known as a duty cycle", "start": 139.56, "duration": 2.0}, {"text": "So by varying the duty cycle, we alter the average voltage of the poles", "start": 142.14, "duration": 4.88}, {"text": "For example with 100 percent duty cycle we would have around four point nine five volts", "start": 147.87, "duration": 5.809}, {"text": "Were 50 percent the half of that and with 25%", "start": 154.14, "duration": 3.74}, {"text": "1/4 of the maximum voltage", "start": 158.55, "duration": 2.0}, {"text": "Now assigned voltage is basically an analog waveform whose different voltage levels", "start": 161.37, "duration": 5.029}, {"text": "We can reconstruct with different duty cycles", "start": 166.739, "duration": 2.99}, {"text": "For example, let's use the 16-bit timer one of the Arduino for this task", "start": 170.58, "duration": 5.449}, {"text": "with a pre scalar of one and a counter limit of", "start": 176.91, "duration": 3.319}, {"text": "1600 we would get a Poots wave with a time period of", "start": 180.989, "duration": 3.98}, {"text": "0.1 milliseconds", "start": 185.519, "duration": 1.53}, {"text": "Which coincidentally fits 100 times in one wave of the main sine voltage?", "start": 187.049, "duration": 5.54}, {"text": "so next we have to divide our half sine wave into 100 pieces and", "start": 193.68, "duration": 4.79}, {"text": "Calculate their voltage values in correlation to the amplitudes for which we can easily use a graphical calculator", "start": 199.14, "duration": 7.55}, {"text": "Last but not least we convert the 100 percentage values", "start": 207.75, "duration": 4.07}, {"text": "into time account values by multiplying with the counter limits and", "start": 212.1, "duration": 4.279}, {"text": "Subsequently store those values in a lookup table in the code of the microcontroller", "start": 217.2, "duration": 4.789}, {"text": "During the microcontroller operation the timer will then increase", "start": 223.59, "duration": 4.01}, {"text": "Decrease the duty cycle of the pulse wave after every periods according to the lookup table", "start": 228.32, "duration": 6.119}, {"text": "But since setting up the timer properly year is not that simple", "start": 235.29, "duration": 3.709}, {"text": "Let's rather use this well-written Arduino ad Mel s PWM codes from github", "start": 239.49, "duration": 5.389}, {"text": "After uploading the codes to not we know and talking up its PWM p9 to an oscilloscope", "start": 246.0, "duration": 5.419}, {"text": "We can observe a practical as PWM signal with a slowly increasing", "start": 252.06, "duration": 5.179}, {"text": "Decreasing duty cycle and a fundamental PWM frequency or carrier frequency of 10. Kilo Hertz", "start": 257.88, "duration": 7.16}, {"text": "This s PWM signal along with its 10 milliseconds shifted counter as PWM signal on pin 10", "start": 265.98, "duration": 7.22}, {"text": "Can now be applied to the H bridge but make sure that the diagonal opposing MOSFETs get the same signal", "start": 273.54, "duration": 7.339}, {"text": "this way our attached loads gets powered by an ACS PWM signal", "start": 281.73, "duration": 5.479}, {"text": "Which obviously is not a pure sine wave yet?", "start": 287.61, "duration": 3.139}, {"text": "For that we have to attach an inductor and capacitor in this configuration to form a low-pass filter", "start": 291.66, "duration": 6.769}, {"text": "which like the name implies filters out the high carrier frequency of the PWM signal and", "start": 299.13, "duration": 6.109}, {"text": "thus turns it into a more or less pure sine wave and", "start": 305.49, "duration": 3.559}, {"text": "with that you are now familiar with as", "start": 309.81, "duration": 2.51}, {"text": "PWM and should understand that a practical hardware implementation of such a technique can be a bit daunting but", "start": 312.87, "duration": 6.77}, {"text": "Thankfully we got our Chinese as PWM driver boards, which will hopefully help us to achieve good results", "start": 320.82, "duration": 6.44}, {"text": "Honestly speaking though", "start": 328.83, "duration": 1.04}, {"text": "I was quite happy with the PCB quality of the module itself as well as the quality of all the solder joints", "start": 329.87, "duration": 7.26}, {"text": "which is a good start and", "start": 337.23, "duration": 2.0}, {"text": "While the datasheet of the module is only six pages long it gave me all mandatory information even without broken English", "start": 339.78, "duration": 7.82}, {"text": "The board consists of an e GE a t10 which is an ASI C", "start": 348.48, "duration": 5.479}, {"text": "so application-specific integrated circuits that manages the feedback system for the voltage current and temperature and", "start": 354.27, "duration": 7.789}, {"text": "most importantly spits out 4's PWM signals", "start": 362.37, "duration": 4.04}, {"text": "rather high frequency of", "start": 367.07, "duration": 2.0}, {"text": "23.5 kilo Hertz", "start": 369.36, "duration": 2.0}, {"text": "Additionally d-bots features and LM 393 op-amp for the current feedback functionality", "start": 372.03, "duration": 7.61}, {"text": "and two IR2113 MOSFET drivers to drive 4 N-channel MOSFETs", "start": 380.16, "duration": 4.1}, {"text": "Just according to those facts anti schematic the ports did sound promising", "start": 385.35, "duration": 4.76}, {"text": "The only thing we have to do is to add a couple of complementary components", "start": 390.84, "duration": 4.25}, {"text": "Which brings me to a PCB year that was advertised alongside the module?", "start": 395.85, "duration": 4.67}, {"text": "It is called the e GPU 1000 watts. And as you can see here forms the circuits for the complementary components", "start": 401.16, "duration": 7.519}, {"text": "So I went ahead and ordered it, which is where all the problems started", "start": 409.77, "duration": 5.029}, {"text": "The first thing I noticed about the boards where it's big traces", "start": 415.62, "duration": 3.619}, {"text": "Which is not a bad thing though because it needs to be able to handle 1000 watts", "start": 419.55, "duration": 5.389}, {"text": "But what I didn't like was the fact that even though the board is big and has tons of space on it", "start": 425.94, "duration": 5.54}, {"text": "They still utilized the smallest of SMD components while a complete tht mounting would have been possible", "start": 431.79, "duration": 7.459}, {"text": "But nevertheless the next problem. Was that the only datasheet", "start": 440.19, "duration": 4.1}, {"text": "Manual I found for the PCB year was in Chinese and even worse", "start": 444.86, "duration": 4.559}, {"text": "It seems like a couple of component calculations where explained in its", "start": 449.42, "duration": 4.529}, {"text": "But coincidentally, I found another eBay seller which at the time promised an English manual for the PCB", "start": 454.77, "duration": 7.25}, {"text": "But the translated manual I received was such a joke that they apparently do not offer it anymore", "start": 462.54, "duration": 6.32}, {"text": "After I complained about it", "start": 469.14, "duration": 2.0}, {"text": "So what I did as a result was utilizing all the data sheets", "start": 471.81, "duration": 3.95}, {"text": "I found and a bit of my gathered electronics knowledge to determine what complementary components the PCB requires", "start": 475.76, "duration": 7.589}, {"text": "Afterwards, I sourced all the components and successfully order them and", "start": 484.89, "duration": 4.369}, {"text": "As soon as I received them, I started soldering all the SMD ones to the board", "start": 489.87, "duration": 4.61}, {"text": "which would have been much easier if there were a bit bigger or just simply th", "start": 495.03, "duration": 4.94}, {"text": "Anyway after I sold it on the *in booming voice* FULL BRIDGE RECTIFIER", "start": 501.25, "duration": 3.29}, {"text": "Which was a bit too small since I got the wrong one because there was no information about it", "start": 504.73, "duration": 5.419}, {"text": "I moved on to the THD components which were quicker and easier to solder and", "start": 510.25, "duration": 6.38}, {"text": "Once I added a solder bridge to a jumper so that everything is powered by only one 12 volt supply", "start": 517.24, "duration": 6.14}, {"text": "I edit the filter capacitor and inductor and was basically done with the circuits", "start": 523.39, "duration": 6.049}, {"text": "So I inserted the module and connected the power which to my surprise did not lead to an explosion", "start": 530.11, "duration": 7.01}, {"text": "but instead the LED on the module simply lit up and", "start": 537.7, "duration": 4.01}, {"text": "By having a look at the outputs", "start": 542.35, "duration": 2.0}, {"text": "We can see the filters pure sine-wave with an RMS voltage of around eight point five volts", "start": 544.51, "duration": 6.2}, {"text": "That means we also require a transformer for the circuits", "start": 551.56, "duration": 3.89}, {"text": "which I hooked up in the same way as I did it with my modified square wave inverter and", "start": 555.76, "duration": 4.909}, {"text": "After also adding a small loads we can see here that everything seems to work", "start": 561.43, "duration": 4.82}, {"text": "But if we look at the voltage form we can see that the shape is not that pleasant to look at", "start": 566.89, "duration": 5.75}, {"text": "The reason is that we only have done since the outputs keeps shutting down after certain time while the module LED", "start": 573.46, "duration": 7.489}, {"text": "flashes four times", "start": 581.26, "duration": 2.0}, {"text": "According to the data sheets. That means there's an under voltage problem", "start": 583.57, "duration": 4.13}, {"text": "Which is obvious since there exists no feedback from the high voltage side of the transformer yet", "start": 587.98, "duration": 6.14}, {"text": "So according to the Chinese data sheets", "start": 595.18, "duration": 2.45}, {"text": "I removed the capacitor an adductor edit a wire bridge for the inductor", "start": 597.78, "duration": 5.519}, {"text": "soldered the capacitor to the Transformers high voltage sites and", "start": 604.03, "duration": 4.069}, {"text": "connected the feedback circuits and", "start": 608.62, "duration": 2.0}, {"text": "With crossed fingers. I powered up the system which to my own surprise did not blow up", "start": 611.11, "duration": 5.72}, {"text": "But still featured the shutdown problem", "start": 617.35, "duration": 2.57}, {"text": "But after adjusting the potentiometer these circuits finally worked correctly", "start": 620.77, "duration": 4.309}, {"text": "and the waveform on the high voltage side did also look acceptable and", "start": 625.839, "duration": 4.58}, {"text": "Actually pretty perfect without any loaded attached", "start": 630.88, "duration": 3.049}, {"text": "but then again the achieved voltage wasn't about", "start": 634.9, "duration": 3.169}, {"text": "230 volts like mains voltage", "start": 638.68, "duration": 2.059}, {"text": "For that I would have to increase the input voltage or use a different", "start": 641.26, "duration": 3.83}, {"text": "transformer I", "start": 645.61, "duration": 1.35}, {"text": "Have no interest in doing that though because even without a load these circuits draws around 20 watts while doing nothing", "start": 646.96, "duration": 7.13}, {"text": "Which is pretty terrible", "start": 654.76, "duration": 2.0}, {"text": "There also exists an LCD for the system, but that also only delivers wrong values at least for me", "start": 657.16, "duration": 7.55}, {"text": "So all in all the module and PCB year seem to do the job except ibly well", "start": 665.5, "duration": 5.27}, {"text": "And I believe that there's a lot of room to tweak the circuits", "start": 670.77, "duration": 4.049}, {"text": "but then again due to the non existent English manual that is very hard to do and", "start": 675.28, "duration": 5.449}, {"text": "With that being said, I hope you learned a bit about s PWM pure sine wave inverter", "start": 681.46, "duration": 5.599}, {"text": "'s and most importantly about effects that you should never trust", "start": 687.06, "duration": 4.44}, {"text": "Chinese products without a proper manual in English as", "start": 691.72, "duration": 3.77}, {"text": "Always don't forget to Like share subscribe", "start": 696.49, "duration": 2.33}, {"text": "Stay creative and I will see you next time", "start": 700.03, "duration": 3.769}]