[{"text": "*weird version of Windows XP boot up tune*", "start": 0.0, "duration": 3.88}, {"text": "Hi YouTube, I'm Cary K-*sigh* Frick!", "start": 8.28, "duration": 3.08}, {"text": "Hi YouTube, I'm Cary Kill Hitler.", "start": 13.69, "duration": 2.71}, {"text": "And today we'll be eating shrimp dumplings!", "start": 16.4, "duration": 2.32}, {"text": "Aren't they delicious?", "start": 30.96, "duration": 2.0}, {"text": "Don't they look delicious?", "start": 36.69, "duration": 2.0}, {"text": "Hi YouTube. I'm Cary Kill Hitler. And today we'll be eating shrimp dumplings.", "start": 61.7, "duration": 4.64}, {"text": "Don't they look delicious?", "start": 66.58, "duration": 1.64}, {"text": "Hi everyone Cary Ketchup Hole here!", "start": 72.54, "duration": 2.58}, {"text": "And I know the title this video says \"Automatic jump cutting tool\"", "start": 75.16, "duration": 2.8}, {"text": "(The original captions said Kari catch a pole! WTH? It's right there on the screen!)", "start": 77.96, "duration": 0.5}, {"text": "*FSSSSHHHHH*", "start": 78.46, "duration": 0.82}, {"text": "But it actually started as a way for me to watch my lecture videos faster.", "start": 79.28, "duration": 3.18}, {"text": "The class in question was CS 145 which is managing databases with sequel that happens to be the same language", "start": 82.46, "duration": 6.779}, {"text": "You guys crashed my website in! (U ok, Cary?)", "start": 89.24, "duration": 1.542}, {"text": "See my friends and I are super diligent students", "start": 90.782, "duration": 2.388}, {"text": "So that's why we waited to the last two days before the exam to catch up on one month of material", "start": 93.17, "duration": 4.649}, {"text": "Fortunately my college records and uploads most computer science lectures", "start": 98.28, "duration": 4.849}, {"text": "So we just had about 12 hours of lecture videos to sit through and we'd be fine. Now the teachers know we're busy kids", "start": 103.13, "duration": 6.629}, {"text": "So their website lets us increase the playback speed to 4 times, which could save us hours", "start": 109.759, "duration": 5.37}, {"text": "However, once you start pushing 1.8 or 2 times, I personally start having trouble understanding anything.", "start": 115.52, "duration": 6.82}, {"text": "*talking too fast to understand*", "start": 122.36, "duration": 6.44}, {"text": "So playing the video at 1.8 times saves me over 5 hours, but can we do better?", "start": 128.8, "duration": 5.86}, {"text": "Well analyze this totally real lecture video and tell me if you notice anything and just keep going so 4", "start": 134.73, "duration": 6.559}, {"text": "Sounds like death in Chinese now. We're kind of running out of space here. So", "start": 141.78, "duration": 3.47}, {"text": "I'm just erase this", "start": 147.09, "duration": 1.709}, {"text": "You see it. That's right", "start": 148.799, "duration": 1.581}, {"text": "The lecturer spends many precious seconds erasing the board", "start": 150.38, "duration": 3.839}, {"text": "Listening to questions or thinking during these times", "start": 154.68, "duration": 3.23}, {"text": "They are not speaking which means we can play faster than 2 times. However critical information may still be given during these times", "start": 157.91, "duration": 6.479}, {"text": "So we don't want to cut them out entirely now. I'm thinking to myself. Why don't we just play the parts of the video?", "start": 164.389, "duration": 5.58}, {"text": "I'm talking at a certain playback speed and then play the parts where I'm not talking at a different faster playback speed", "start": 170.18, "duration": 5.94}, {"text": "So let's just do it in early February. I made it happen first", "start": 176.12, "duration": 3.119}, {"text": "I used ffmpeg to split the original video into one audio file and hundreds of image files", "start": 179.239, "duration": 5.699}, {"text": "Then I set a variable called silent threshold to about", "start": 184.98, "duration": 4.069}, {"text": "0.04 and analyzed if each chunk of the audio surpassed that threshold or not at any point", "start": 189.689, "duration": 5.21}, {"text": "I then grouped like with--like and", "start": 194.9, "duration": 2.279}, {"text": "Contracted the silent chunks by a certain factor and contracted the sounded chunks by a different factor", "start": 197.43, "duration": 5.179}, {"text": "Just like in my last video", "start": 202.609, "duration": 1.44}, {"text": "I had to use the Python library phase vocoder to squish and stretch audio without affecting pitch as for the image files", "start": 204.049, "duration": 7.2}, {"text": "They kinda go along with the ride", "start": 211.25, "duration": 2.039}, {"text": "So they might have to be dropped or duplicated to stay aligned with the audio once that's all done", "start": 213.359, "duration": 4.37}, {"text": "We'll just use ffmpeg to stitch it all back into a video again, and that's pretty much it", "start": 217.73, "duration": 4.739}, {"text": "It's a deceptively simple piece of code. Ok to demonstrate how this works", "start": 222.469, "duration": 3.81}, {"text": "I'm gonna use jacksFilms video", "start": 226.28, "duration": 2.26}, {"text": "WOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOW", "start": 228.54, "duration": 0.84}, {"text": "because it has silent periods multiple speakers easily discernible speech and is short", "start": 229.38, "duration": 4.64}, {"text": "Alexa?", "start": 234.72, "duration": 1.59}, {"text": "Who's your favorite President?", "start": 236.31, "duration": 2.0}, {"text": "George Washington has my vote", "start": 239.43, "duration": 2.0}, {"text": "Alexa?", "start": 242.609, "duration": 2.051}, {"text": "Who's your favorite black president?", "start": 244.66, "duration": 1.568}, {"text": "I don't have an opinion on that.", "start": 247.68, "duration": 2.08}, {"text": "WOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOW", "start": 250.02, "duration": 1.28}, {"text": "So what should these silent and sounded speed of factors be?", "start": 251.3, "duration": 3.437}, {"text": "Well that's completely up to you to decide!", "start": 254.737, "duration": 2.463}, {"text": "Alexa who's your favorite resident, Washington Alexa, who's your favorite black president Wow", "start": 265.629, "duration": 5.09}, {"text": "Alexa who's your favorite president?", "start": 273.34, "duration": 2.569}, {"text": "Alexa who's your favorite black?", "start": 280.629, "duration": 2.54}, {"text": "President", "start": 296.979, "duration": 2.0}, {"text": "Okay enough of whatever that was after toying around", "start": 332.35, "duration": 3.35}, {"text": "I found the most useful setting to be sounded speed one a silent speed 1 million because that's the jump cutter", "start": 335.7, "duration": 6.48}, {"text": "Say you're hanging out with your friend Jabril and you want to impress him with your wit. Hey", "start": 342.28, "duration": 4.88}, {"text": "You guys walk into a bar", "start": 350.98, "duration": 1.49}, {"text": "The fourth one ducks the issue there was that you spent too much time thinking which makes you seem slow the jump cutter will fix", "start": 352.47, "duration": 6.21}, {"text": "That by removing the silent parts Hey", "start": 358.68, "duration": 2.309}, {"text": "Suddenly it seems like you came up with that joke on the spot and your friendship with Jibril's is restored", "start": 364.75, "duration": 5.03}, {"text": "I feel like this tool could be useful for storytime", "start": 369.93, "duration": 2.669}, {"text": "Youtubers who want to tell a story but have to pause to think about what happens next", "start": 372.73, "duration": 3.739}, {"text": "Shoot crap. Anyway. Hey guys storytime. So this one starts when I was hanging on the monkey bars", "start": 377.05, "duration": 4.639}, {"text": "and this girl wanted me to get off monkey bars because she wanted to play so she", "start": 381.69, "duration": 3.57}, {"text": "Jumped up and grabbed my legs and when she fell down she pulled down my weight. I think they're chasing me", "start": 385.51, "duration": 5.029}, {"text": "Okay, we gotta go we got to go", "start": 390.54, "duration": 2.0}, {"text": "As you can see the jump cutter compressed about two minutes of dull footage into 18 seconds of slightly less dull footage", "start": 399.46, "duration": 7.279}, {"text": "Creating stop-motion animation without touching the camera is also pretty simple", "start": 407.14, "duration": 4.579}, {"text": "Just move your props around and every time you want to take a frame clap", "start": 411.88, "duration": 3.71}, {"text": "The end result is a little noisy but it gets the job done", "start": 420.34, "duration": 2.869}, {"text": "That was my name no manual editing", "start": 435.59, "duration": 2.0}, {"text": "From here, you can probably see how we can get creative with this", "start": 445.82, "duration": 3.619}, {"text": "Basically anything you can do silently will be removed from the video", "start": 450.98, "duration": 4.069}, {"text": "So that's when we can do fun stuff like take our shirts off", "start": 455.18, "duration": 2.869}, {"text": "You have to be careful not to make a single noise or else the effect will be ruined", "start": 458.33, "duration": 4.069}, {"text": "Doing this allows us to create cool video effects and tricks without having to open any video software", "start": 464.69, "duration": 5.929}, {"text": "[aggressive squeaking]", "start": 489.02, "duration": 14.48}, {"text": " ", "start": 503.5, "duration": 2.0}, {"text": " ", "start": 505.5, "duration": 2.0}, {"text": "Clearly the jump cutting has gotten out of hand. So let's return to my initial goal watching lecture videos faster. Remember I said the", "start": 518.36, "duration": 7.55}, {"text": "Procrastinator settings were two times four sounded and eight times four silence. Does this work?", "start": 526.43, "duration": 5.51}, {"text": "Well, I can't show you how well it does on my colleges lecture videos since those are owned by Stanford", "start": 531.98, "duration": 6.23}, {"text": "But I did find this publicly available lecture video from MIT. Let's run these settings on it and see how easy it is to understand", "start": 538.21, "duration": 7.829}, {"text": "For exactly zero examples", "start": 554.06, "duration": 6.23}, {"text": "So that's this one there's no we just have some expressions to talk about some", "start": 566.6, "duration": 5.63}, {"text": "Constraints for the line to be such a sweet", "start": 575.33, "duration": 2.0}, {"text": "Not too bad, huh? I ran out on a 10-minute section a typical to time speed-up would drop that to five minutes", "start": 578.06, "duration": 6.44}, {"text": "But my algorithm shortens it further to", "start": 584.5, "duration": 3.03}, {"text": "324 if you had 12 hours of lecture videos like we did using my tool could save you another 1 hour 55 minutes and that's", "start": 587.9, "duration": 7.339}, {"text": "Enough time to watch the room and bow and the bfdi episode where they turn into puppets", "start": 595.24, "duration": 4.62}, {"text": "Hi, so I want to show you how you can use this video editing tool", "start": 599.99, "duration": 3.77}, {"text": "So after you've downloaded the file, it should just be a 1 Python file, which makes it pretty convenient", "start": 603.98, "duration": 4.579}, {"text": "then you just open that folder up in the terminal and", "start": 608.81, "duration": 2.929}, {"text": "we just run the command Python jump cutter PI and", "start": 612.53, "duration": 4.789}, {"text": "Within it there lots of parameters but to find them all you do - age which is pretty common which will give you a lot", "start": 618.35, "duration": 5.479}, {"text": "Of the inputs that you can add now, you don't have to do them all most of them have default values", "start": 623.83, "duration": 4.529}, {"text": "But the most important ones that I typically toy around with our first of all input file, obviously", "start": 628.36, "duration": 5.82}, {"text": "This was important because it tells the program which file to operate on so for input file, I'm gonna say it's jack mp4", "start": 634.18, "duration": 6.63}, {"text": "Which is that one of Jack's films?", "start": 640.81, "duration": 1.96}, {"text": "Then we need an output file. So for this I can just write any new file name. I want like Jack altered", "start": 642.77, "duration": 6.53}, {"text": "mp4 and then", "start": 649.91, "duration": 2.0}, {"text": "silent threshold that one is set to", "start": 651.92, "duration": 2.0}, {"text": "0.04 or port 3 by default, so we don't really need to change it", "start": 654.2, "duration": 2.659}, {"text": "The two important ones are sounded speed and silent speed which I talked about earlier", "start": 656.86, "duration": 5.4}, {"text": "So if you want to get the jump cut effect", "start": 662.42, "duration": 2.059}, {"text": "Sounded speed should be", "start": 664.67, "duration": 1.23}, {"text": "One because you don't want to change the speed at which someone talks and the silent speed should be as high as possible", "start": 665.9, "duration": 5.0}, {"text": "I always go with about a million. It doesn't really matter at that point", "start": 671.03, "duration": 3.349}, {"text": "and then if you notice that the algorithm is cutting off a lot of your f's", "start": 674.38, "duration": 3.9}, {"text": "S's, and th's a lot of the quieter and consonants then increase your frame margin from 0", "start": 678.68, "duration": 6.02}, {"text": "Which it is by default to maybe 2 or so because this will allow for a two frame", "start": 684.7, "duration": 4.109}, {"text": "margin on each side of a tongue and then if you notice that there's issues with", "start": 688.92, "duration": 3.27}, {"text": "Synchronizing then figure out what the frame rate of your video is and then tape it in", "start": 692.589, "duration": 3.32}, {"text": "Usually this program should be able to figure it out", "start": 695.91, "duration": 1.83}, {"text": "but if it doesn't", "start": 697.74, "duration": 0.849}, {"text": "it's nice if you can manually type it in - that's pretty much all you have to know you can read the details for the", "start": 698.589, "duration": 5.239}, {"text": "Other ones if you're really curious, but those I never have to modify myself", "start": 703.829, "duration": 3.3}, {"text": "So after that, you just hit enter like that and then you wait ffmpeg takes the longest time because it's converting", "start": 707.199, "duration": 7.31}, {"text": "Oh, it's done. Um because it's converting the video into frame images, which is pretty intensive", "start": 714.51, "duration": 5.579}, {"text": "But then the code of the chunking it's always pretty fast. So it's done now and if we play the original we get this Alexa", "start": 720.089, "duration": 6.179}, {"text": "Who's your favorite president? Well, you know the whole deal and then the altered version is here Alexa", "start": 727.36, "duration": 4.549}, {"text": "Who's your favorite president George Washington has my vote?", "start": 731.91, "duration": 2.97}, {"text": "Alexa you can see that the jump cuts are in place and they also don't sound super rushed because I added that frame margin of", "start": 735.43, "duration": 5.929}, {"text": "Two, so that's pretty much it. Hope you enjoyed and go to the github repo linked in the description to download it", "start": 741.36, "duration": 6.0}, {"text": "And here's a few more notes just to be safe at this point", "start": 747.36, "duration": 3.45}, {"text": "You might be noticing we're reaching the end of the video and I still haven't implemented the thumbs-up thumbs-down", "start": 750.81, "duration": 5.339}, {"text": "System I demonstrated at the beginning", "start": 756.73, "duration": 1.82}, {"text": "well", "start": 758.55, "duration": 0.45}, {"text": "I searched on github and I can't find a library that detects hand gestures to the level that Adam guy keys library can detect human", "start": 759.0, "duration": 7.829}, {"text": "faces most of these libraries were only trained on one humans hands", "start": 766.829, "duration": 4.89}, {"text": "So they probably won't work on mine or yours so Internet if you can give me that hand gesture recognizer", "start": 771.72, "duration": 6.63}, {"text": "I'll give you the completed video editing tool once I get all the parts together, though", "start": 778.35, "duration": 4.53}, {"text": "I think it would be fun to eventually turn this tool into a mobile app", "start": 782.88, "duration": 3.479}, {"text": "That way kids who have no knowledge of how to edit videos can record themselves and still produce something half-decent", "start": 786.37, "duration": 6.26}, {"text": "Oh speaking of mobile apps today's sponsor brilliant org just released offline courses on their iOS app", "start": 793.05, "duration": 6.899}, {"text": "That means you can learn new concepts on the go like when you're on a plane", "start": 799.949, "duration": 3.6}, {"text": "Underground or at the Tresidder area of Stanford campus. Seriously. Why can it never get signaled?", "start": 804.279, "duration": 4.01}, {"text": "What's awesome about these courses is that they're all totally interactive?", "start": 808.29, "duration": 3.539}, {"text": "You can experiment with pendulum clocks to master the physics of motion use rockets to model algebraic functions and learn", "start": 812.11, "duration": 6.709}, {"text": "probability by playing casino blackjack", "start": 818.98, "duration": 1.71}, {"text": "I personally liked this course on programming", "start": 820.69, "duration": 3.049}, {"text": "Python because it makes me a", "start": 824.08, "duration": 1.68}, {"text": "Nostalgic of elementary school when we programmed with turtles in logo Python is also what this video editing toe was written in", "start": 825.76, "duration": 6.83}, {"text": "So if you want to support me", "start": 832.59, "duration": 1.35}, {"text": "of course or get unlimited access to all of brilliants in-depth math and science courses", "start": 833.94, "duration": 4.65}, {"text": "You can head over to brilliant org slash Carey KH to get 20% off your annual premium subscription", "start": 838.75, "duration": 6.559}, {"text": "That's pretty much it for the video", "start": 845.31, "duration": 1.53}, {"text": "but one thing that happened was that I tweeted a picture of a mosquito bite I got on my knee and then someone said oh", "start": 846.84, "duration": 7.019}, {"text": "this is Carey knee hurt because it did make my knee hurt and then I", "start": 854.14, "duration": 4.52}, {"text": "guess someone replied to that he better put that in the next video and I guess I'm gonna do that because I have no", "start": 859.0, "duration": 5.869}, {"text": "Standards and this is why is this here? Why is this in this video? This makes no say", "start": 865.18, "duration": 4.489}, {"text": "Welcome to your first grad level lecture today", "start": 870.49, "duration": 2.869}, {"text": "We're teaching you how to count because clearly you guys don't know how to do that when you're drinking at the bar", "start": 873.36, "duration": 5.16}]