[{"text": " ", "start": 0.0, "duration": 0.5}, {"text": "This video was sponsored by novo resume", "start": 0.5, "duration": 1.75}, {"text": "If you have a paper and pencil nearby go ahead and put four dots anywhere on the paper and connect them to make a quadrilateral", "start": 2.71, "duration": 6.349}, {"text": "It doesn't matter how weird the shape is and I'll just put a few examples here to illustrate that point", "start": 9.34, "duration": 4.58}, {"text": "Now put a dot at the midpoint of all of those lime segments you just drew and connect those to make another quadrilateral", "start": 14.74, "duration": 6.11}, {"text": "Turns out no matter what connecting those midpoints will always yield a parallelogram or shape or opposite sides are parallel to each other", "start": 21.46, "duration": 7.22}, {"text": "The reasoning behind this is a theorem that says if you connect the midpoints of two sides of a triangle", "start": 29.26, "duration": 4.549}, {"text": "That line segment will be parallel to the third side", "start": 34.059, "duration": 2.45}, {"text": "I could then just form another triangle which shares that third side and then connect those midpoints you see here", "start": 36.61, "duration": 6.199}, {"text": "So again as a result that theorem I mentioned earlier these two line segments. You see here are parallel to the third side", "start": 43.21, "duration": 5.45}, {"text": "Which means they're also parallel to each other", "start": 48.969, "duration": 2.03}, {"text": "then if I connect the other two corners", "start": 51.76, "duration": 1.85}, {"text": "I can make the same argument which gives us two new parallel line segments leaving us with a parallelogram", "start": 53.61, "duration": 5.399}, {"text": "What we just solved was math in two dimensions something that could be done on a flat piece of paper", "start": 60.609, "duration": 4.85}, {"text": "We'll soon get to three dimensions though, which we can of course grasp since the space we live in is three-dimensional", "start": 65.95, "duration": 5.029}, {"text": "But once we move to higher dimensions, you'll see the intuition is mostly gone leaving us to rely on mathematical analysis", "start": 71.13, "duration": 5.879}, {"text": "Which can still be done without that intuition?", "start": 77.009, "duration": 2.0}, {"text": "But to set up a lot of what's coming", "start": 79.6, "duration": 1.67}, {"text": "I'm first gonna ask how many different types of three-dimensional dice are possible to make?", "start": 81.27, "duration": 4.5}, {"text": "Now I'm using the word dice pretty loosely here because what I really mean is three dimensional polyhedra that meets certain criteria", "start": 86.229, "duration": 5.599}, {"text": "The first one is that every face must be a regular polygon and the same regular polygon", "start": 92.68, "duration": 4.489}, {"text": "So for example this cube or a die we're familiar with is an example of this as every face is a square with the same", "start": 97.21, "duration": 7.099}, {"text": "sides and same angles the second criteria is that add the same number of faces must meet at each vertex for each corner for a", "start": 104.31, "duration": 7.08}, {"text": "Cube, that would be three and then the third is that shape must be convex. So it can't look like this or anything", "start": 111.39, "duration": 4.919}, {"text": "So including the cube how many 3-dimensional objects fulfill all these requirements?", "start": 116.68, "duration": 3.829}, {"text": "Well, I've got a few here that do", "start": 121.39, "duration": 2.0}, {"text": "Like a tetrahedron which has four faces that are all equilateral triangles. We of course have the cube. Here's the octahedron", "start": 123.61, "duration": 7.699}, {"text": "That's also made of equal our triangle faces X four phases in me at a corner here not three", "start": 131.31, "duration": 4.86}, {"text": "There's a dodecahedron that has twelve phases which are all regular Pentagon's then we've also got the icosahedron which has 20 phases", "start": 136.84, "duration": 7.04}, {"text": "But how many more are possible I?", "start": 143.98, "duration": 2.0}, {"text": "Mean in two dimensions you can have infinitely many regular polygons or shapes with equal side lengths and angles", "start": 146.02, "duration": 5.029}, {"text": "But when it comes to putting those on the faces of a 3-dimensional polyhedron what is possible?", "start": 151.75, "duration": 4.97}, {"text": "Well, this is it", "start": 157.27, "duration": 1.98}, {"text": "These are the five platonic solids the only shapes that meet the criteria we discussed earlier", "start": 159.25, "duration": 4.22}, {"text": "That's definitely not obvious. For example, I found it weird that we can't have a die with hexagons as faces", "start": 164.59, "duration": 5.779}, {"text": "Okay what we can like this one here, but as you can see there Pentagon's as well", "start": 170.77, "duration": 4.279}, {"text": "So it doesn't meet that requirement having the same regular polygons on each face now", "start": 175.39, "duration": 4.43}, {"text": "This is the point where I was gonna do a proof as to why there are only five platonic solids", "start": 179.82, "duration": 3.539}, {"text": "But I decided to a dedicated video just for that. So if you want to see you can click here or down in the description", "start": 183.85, "duration": 4.609}, {"text": "However, we will do a little more analysis with these shapes", "start": 189.04, "duration": 2.57}, {"text": "Take a look at the vertices edges and faces of each solid", "start": 192.37, "duration": 3.559}, {"text": "There's something these all have in common and it's not obvious at first", "start": 196.09, "duration": 2.779}, {"text": "But if we subtract the edges from the vertices and then add the number of faces in each case the value comes out to two", "start": 199.15, "duration": 6.98}, {"text": "This relationship of vertices minus edges plus faces is known as Euler's characteristic", "start": 206.98, "duration": 4.88}, {"text": "Yes, another one of his and it turns out for any convex polyhedron Euler's characteristic is two in", "start": 211.86, "duration": 6.33}, {"text": "fact even for a sphere with regards to the surface Oilers characteristic is still -", "start": 218.98, "duration": 4.94}, {"text": "That's because the sphere can be morphed into any convex polyhedron", "start": 224.29, "duration": 3.199}, {"text": "Aka the shapes are homeomorphic and Euler's characteristic is preserved under homeomorphisms", "start": 228.07, "duration": 5.209}, {"text": "But things get even weirder when you realize for example that Oilers characteristic for a four dimensional", "start": 234.01, "duration": 4.34}, {"text": "Klein bottle is 0 which we're going to get to soon", "start": 238.51, "duration": 3.05}, {"text": "Now in a previous video I showed you what a mobius strip was and this is a very famous shape in the field of topology", "start": 242.44, "duration": 5.389}, {"text": "Where you take a flat length of paper and put a half twist in it, then connect the ends", "start": 247.829, "duration": 4.29}, {"text": "Then I also showed how when you cut it right down the middle and go all the way around", "start": 252.7, "duration": 3.62}, {"text": "You're still left with one piece", "start": 256.51, "duration": 2.0}, {"text": "But that one piece is not a mobius strip as it has more than a half twist in it", "start": 258.549, "duration": 4.01}, {"text": "then we also saw how if we start our cut about 1/3 of the way in rather than", "start": 262.81, "duration": 4.01}, {"text": "And go around twice we end up with two pieces that are linked together", "start": 267.16, "duration": 3.63}, {"text": "But there are plenty more interesting results that we can get", "start": 271.46, "duration": 2.51}, {"text": "Like what if now I decided to put one?", "start": 274.7, "duration": 2.149}, {"text": "two", "start": 277.82, "duration": 1.35}, {"text": "Three half twists in this strip and then cut it down the middle", "start": 279.17, "duration": 3.619}, {"text": "Well, let's see what happens", "start": 283.43, "duration": 2.0}, {"text": "And", "start": 290.78, "duration": 1.89}, {"text": "Here we have", "start": 292.67, "duration": 2.0}, {"text": "Holed up I'm gonna need a flat surface for this", "start": 295.79, "duration": 2.0}, {"text": "The bends in the paper are making it not behave well, so I just kind of press everything down", "start": 299.96, "duration": 3.589}, {"text": "Now what we have here if you can tell is a knot you", "start": 304.31, "duration": 3.14}, {"text": "can see if we start somewhere and follow the paper all the way around we get to the original spot and the loop just keeps", "start": 307.85, "duration": 6.38}, {"text": "Going so it is one connected piece knot rings like before", "start": 314.23, "duration": 3.509}, {"text": "This is actually a specific type of knot known as the trefoil knot", "start": 318.44, "duration": 2.989}, {"text": "Here, let me try rearranging it. So it looks more like the graphic", "start": 322.55, "duration": 2.72}, {"text": "Now this isn't a knot like in your shoelaces where they have loose ends because in this case", "start": 325.79, "duration": 4.639}, {"text": "There's nothing I can do to unknot the paper without tearing it", "start": 330.43, "duration": 2.73}, {"text": "But if I could tear it or move the knot through itself in just one location", "start": 333.65, "duration": 3.71}, {"text": "Like here, it would become totally unknotted. Otherwise known as the UH knot to demonstrate moving it through itself", "start": 337.36, "duration": 7.169}, {"text": "I will just cut it in one location and retake the pieces on the other side of that crossing and", "start": 344.53, "duration": 4.92}, {"text": "Now if you just rearrange the paper a little you'll see we no longer have a knot", "start": 350.12, "duration": 3.679}, {"text": "Since I was able to do that in one cut one is the unknotting number of our trifle knot", "start": 355.55, "duration": 4.64}, {"text": "That's not too difficult to see but it's not as obvious that for example this", "start": 360.68, "duration": 3.77}, {"text": "Stevedore knot with six crossings rather than three also has a nun knotting number of one", "start": 364.61, "duration": 4.7}, {"text": "Well, the cinquefoil knot with five crossings has a nun knotting number of two", "start": 369.5, "duration": 4.13}, {"text": "We can see several other unknotting numbers here as well", "start": 374.24, "duration": 2.48}, {"text": "But it turns out that determining those numbers is actually not so easy to do mathematically", "start": 376.97, "duration": 4.76}, {"text": "We know it for several of these simpler knots before example. We haven't determined it for this knot here", "start": 382.13, "duration": 5.359}, {"text": "When you move into higher dimensions, you'll see there's a lot of unsolved problems there actually", "start": 388.34, "duration": 3.709}, {"text": "But let's go back to that mobius strip and answer another question", "start": 392.69, "duration": 3.229}, {"text": "What would I have to cut in half in order to get to moe strips?", "start": 396.32, "duration": 4.08}, {"text": "Or what shape would I get if I could sew these together?", "start": 400.59, "duration": 2.419}, {"text": "Well, the answer is that Klein bottle I mentioned earlier which is a shape that only exists in four dimensions", "start": 403.68, "duration": 5.75}, {"text": "That means if you really did connect to mobius strips", "start": 410.19, "duration": 2.51}, {"text": "Like numberphile has shown before you only get a 3d representation of the Klein bottle", "start": 412.7, "duration": 4.019}, {"text": "Which is the best we can do?", "start": 416.72, "duration": 1.51}, {"text": "to make a real Klein bottle you need access to a fourth spatial dimension if you're wondering why it's because right here it appears like", "start": 418.23, "duration": 6.47}, {"text": "the client bottles intersecting itself and in three dimensions it is", "start": 424.7, "duration": 3.059}, {"text": "But a true Klein bottle does not self intersect and that's only possible if this is embedded in a higher dimension", "start": 428.07, "duration": 5.66}, {"text": "However, the Klein bottle is still a two dimensional manifold", "start": 434.76, "duration": 2.929}, {"text": "Meaning close up or locally. It looks like a two dimensional plane since this really is just a surface", "start": 438.39, "duration": 4.609}, {"text": "See, this is just like the surface of the earth", "start": 443.58, "duration": 1.94}, {"text": "Of course, we know the global structure of Earth but to something small like us standing on that surface. It does look flat and two-dimensional", "start": 445.52, "duration": 7.529}, {"text": "Because of this the surface of the earth is also a two dimensional manifold as is the Klein bottle a torus and plenty more", "start": 453.99, "duration": 6.589}, {"text": "Locally they appear to be two-dimensional but they all curve or are embedded in higher dimensions", "start": 461.43, "duration": 4.85}, {"text": "Then when you get to relativity space-time and the curvature of the universe, you move into those three and four dimensional manifolds", "start": 467.43, "duration": 5.93}, {"text": "But that's beyond this video", "start": 473.36, "duration": 2.0}, {"text": "Let's now get into how to think about a four spatial dimension though and to do that", "start": 475.5, "duration": 4.04}, {"text": "We should first imagine a two-dimensional object living in flatland that can only see along this completely flat surface", "start": 479.54, "duration": 5.91}, {"text": "if a three-dimensional sphere entered that world all the flat creature would see is the", "start": 486.09, "duration": 4.489}, {"text": "Two-dimensional cross-section or a circle?", "start": 490.71, "duration": 1.64}, {"text": "If the sphere said hey, I'm a three dimensional object and the flatlander said prove it move in this third dimension", "start": 492.35, "duration": 5.13}, {"text": "You speak of all they'd see is that cross-section gets smaller and the same goes for us. I", "start": 497.48, "duration": 5.22}, {"text": "Mean if there were some two-dimensional world living on this piece of paper", "start": 503.22, "duration": 3.02}, {"text": "I could see everything that's going on and there's nothing they could do to hide for me", "start": 506.24, "duration": 3.809}, {"text": "Then if I wanted to at any point, I could enter their world", "start": 510.3, "duration": 2.6}, {"text": "But all they would see is the two-dimensional cross-section of my fingers in this case", "start": 513.24, "duration": 3.559}, {"text": "And this is exactly how it be for a four-dimensional object visiting us", "start": 517.05, "duration": 3.44}, {"text": "They could see our three-dimensional world and there's nothing we could do to hide from this", "start": 521.25, "duration": 4.099}, {"text": "They can then enter at any point and we would see a three-dimensional", "start": 525.51, "duration": 2.809}, {"text": "Cross-section of that object. So if it was a four dimensional sphere for example", "start": 528.87, "duration": 3.41}, {"text": "We would see a 3d sphere just appear out of nowhere. It would get bigger and bigger and then smaller and smaller and eventually disappear", "start": 533.16, "duration": 5.969}, {"text": "See our brains aren't really made to understand how that object is moving through that higher dimension", "start": 539.92, "duration": 4.549}, {"text": "But as you can see we can still draw comparisons and do the mathematical analysis", "start": 544.6, "duration": 4.46}, {"text": "Even if we don't have the geometric intuition to back it up, for example", "start": 549.189, "duration": 3.56}, {"text": "We can answer the question. How many?", "start": 552.75, "duration": 2.0}, {"text": "Four-dimensional dice are possible. And again what I mean by that is how many four-dimensional platonic solids are possible that meet those same criteria", "start": 555.04, "duration": 6.95}, {"text": "We discussed earlier we saw before how only a few regular polygons could be put on the faces of those platonic solids", "start": 561.99, "duration": 6.179}, {"text": "But can we connect these shapes to each other in the fourth dimension to create 4d dice", "start": 568.87, "duration": 4.729}, {"text": "The answer is yes", "start": 574.18, "duration": 1.159}, {"text": "in fact", "start": 575.339, "duration": 0.841}, {"text": "every platonic solid in three dimensions has a four-dimensional counterpart like if you join", "start": 576.18, "duration": 4.889}, {"text": "Tetrahedrons together at three to an edge you get the hyper tetrahedron", "start": 581.379, "duration": 3.77}, {"text": "There's also the hypercube hyper octahedron hyper dodecahedron and the hyper icosahedron as well", "start": 585.43, "duration": 5.809}, {"text": "But there is a six platonic solid that emerges in the fourth dimension and it's the octa cube or hyper diamond", "start": 591.759, "duration": 5.84}, {"text": "The analog of this constructed in three dimensions is the rhombic", "start": 597.97, "duration": 3.229}, {"text": "Dodecahedron something which is not a platonic solid do the irregular faces", "start": 601.569, "duration": 3.89}, {"text": "But in four dimensions amazingly the necessary criteria are all met and you'd think it gets even crazier as we move up", "start": 605.62, "duration": 6.589}, {"text": "But guess what happens in five dimensions?", "start": 612.37, "duration": 2.0}, {"text": "There are now only three platonic solids. We move to the sixth dimension", "start": 614.8, "duration": 3.919}, {"text": "They're still three and as we continue to go up we unfortunately only find three platonic solids now moving on", "start": 618.819, "duration": 6.83}, {"text": "Here's another example of something. We know very well for up to four dimensions", "start": 625.649, "duration": 3.539}, {"text": "But afterwards we know very little and this has to do with kissing numbers or the maximum number of units spheres that can be arranged", "start": 629.319, "duration": 6.8}, {"text": "to barely touch or kiss another common unit sphere", "start": 636.12, "duration": 3.179}, {"text": "For example in two dimensions the kissing number is six", "start": 639.88, "duration": 3.139}, {"text": "That's because if you have a single circle at most six other circles can be touching it in this way", "start": 643.36, "duration": 5.059}, {"text": "This wasn't too hard to find but in three dimensions it already got difficult as it took", "start": 649.089, "duration": 4.16}, {"text": "Mathematicians a while to figure out that in fact 12 is the kissing number and after much more effort", "start": 653.379, "duration": 5.21}, {"text": "We have determined that in four dimensions. The kissing number is 24", "start": 658.589, "duration": 3.119}, {"text": "However, five dimensions, we don't know the kissing number", "start": 663.069, "duration": 2.72}, {"text": "We just know as of this video that's between forty and forty four and four six dimensions and seven dimensions", "start": 665.79, "duration": 7.01}, {"text": "We also only have a range of numbers. It could be but funny enough", "start": 672.8, "duration": 3.45}, {"text": "We have figured this out for eight dimensions as the kissing number is 240 and even stranger", "start": 676.25, "duration": 5.669}, {"text": "We have determined that in twenty four dimensions. The kissing number is a hundred ninety six thousand five hundred and sixty", "start": 681.92, "duration": 5.549}, {"text": "It turns out something weird does happen in eight and twenty four dimensions when it comes to spheres, but I'll get to that soon", "start": 688.35, "duration": 5.539}, {"text": "the last thing I want to mention about four dimensions though is that there are no knots like the ones we're familiar with in the", "start": 695.25, "duration": 5.659}, {"text": "fourth dimension", "start": 700.91, "duration": 0.91}, {"text": "Well other than the trivial knot which isn't really knotted", "start": 701.82, "duration": 2.719}, {"text": "the reason is because a knot can be thought of as a", "start": 705.12, "duration": 2.269}, {"text": "One-dimensional string embedded in three-dimensional space as it needs that third dimension to exist", "start": 707.73, "duration": 4.969}, {"text": "You couldn't make a knot on flat paper without self-intersection", "start": 712.7, "duration": 3.33}, {"text": "But remember how I said I could unknot something by having it essentially passed through itself, which I demonstrated by cutting it", "start": 716.67, "duration": 5.539}, {"text": "Well in the fourth dimension a knot would be capable of passing through itself through that extra dimension", "start": 722.73, "duration": 4.219}, {"text": "Meaning it's not really a knot. It'd just be a loop in disguise and in mathematics, this is just the trivial not nothing that's special", "start": 727.5, "duration": 6.859}, {"text": "However, in four dimensions, it would be possible to have knots made out of two-dimensional sheets, though", "start": 734.91, "duration": 4.549}, {"text": "No clue what that would look like, but we need that difference of two dimensions in order to create a true knot", "start": 739.74, "duration": 4.789}, {"text": "So using that same logic, we could technically not a three dimensional object", "start": 745.59, "duration": 3.41}, {"text": "but we'd have to move it through five dimensions to do so and", "start": 749.25, "duration": 3.2}, {"text": "With that let's now transition to something else interesting that happens in the fifth dimension", "start": 753.15, "duration": 3.8}, {"text": "Which goes back to the video I made about adding up all the volumes of even dimensional units fears", "start": 757.29, "duration": 4.789}, {"text": "Which comes out to e to the PI for anyone who hasn't seen it?", "start": 762.3, "duration": 2.659}, {"text": "Many of you guys want more of an explanation and the biggest thing to know is that since the series?", "start": 765.66, "duration": 4.609}, {"text": "Converges that must mean the volume of these spheres gets smaller as the dimension goes up", "start": 770.4, "duration": 4.429}, {"text": "For a one-dimensional quote sphere or really just a line segment with radius one", "start": 775.56, "duration": 3.949}, {"text": "the length is of course to a two-dimensional sphere or circle with a radius one has an area of pie or", "start": 779.52, "duration": 5.869}, {"text": "3.14 a", "start": 785.97, "duration": 1.74}, {"text": "Three-dimensional sphere with radius one has a volume of 4/3 pi or four point one eight nine", "start": 787.71, "duration": 3.71}, {"text": "then from the equation for the volume of an n-dimensional sphere we can calculate that a", "start": 792.48, "duration": 4.22}, {"text": "Four-dimensional sphere of radius one has a volume of about four", "start": 797.01, "duration": 2.869}, {"text": "Point nine three five and a five dimensional unit sphere has a volume of five point two six four", "start": 799.97, "duration": 5.039}, {"text": "Notice that the number keeps going up with every dimension", "start": 805.62, "duration": 2.419}, {"text": "But once we get to six dimensions a sphere with radius one has a volume of five point one six eight", "start": 808.35, "duration": 5.299}, {"text": "It's finally lower than the previous dimension for seven dimensions. It goes down again and continues to do so", "start": 813.839, "duration": 5.599}, {"text": "If we look at the plot for the volume of a unit sphere versus the dimension", "start": 820.019, "duration": 3.799}, {"text": "We're in we see that the fifth dimension is the peak and it eventually does approach zero but geometrically why is that the case?", "start": 823.819, "duration": 6.45}, {"text": "Well, I'll give the best explanation I could find in", "start": 830.97, "duration": 2.75}, {"text": "Regards to two dimensions. Let's say we perfectly rest a circle inside a square which has side lengths of 1", "start": 834.389, "duration": 5.63}, {"text": "Well, it turns out the circle takes up", "start": 840.48, "duration": 2.0}, {"text": "78.5% of that squares area", "start": 843.029, "duration": 2.0}, {"text": "When we move to three dimensions and put a sphere inside a cube also a side length of one that sphere takes up only", "start": 845.639, "duration": 5.989}, {"text": "52.3% of the volume adding the extra dimension decrease the ratio of those volumes", "start": 852.3, "duration": 5.029}, {"text": "If we go to four dimensions and embed a hyper sphere inside a hypercube, the sphere only takes up 31% of that volume", "start": 857.67, "duration": 6.589}, {"text": "But notice that the cubes volume is not changing as you move up in dimensions for two dimensions", "start": 865.139, "duration": 5.299}, {"text": "The area of the square is one squared or one in three dimensions. The volume is one cubed or one and in four dimensions", "start": 870.439, "duration": 6.869}, {"text": "It'd be one to the fourth or of course one", "start": 877.309, "duration": 2.0}, {"text": "Yes, we are comparing completely different units", "start": 879.72, "duration": 2.119}, {"text": "So it's not the best physical comparison", "start": 881.839, "duration": 2.0}, {"text": "But the sphere is taking up less and less of something that always has a volume of one", "start": 883.92, "duration": 4.369}, {"text": "Thus the spheres volume will go to zero", "start": 888.42, "duration": 2.179}, {"text": "Another thing that notice is the diagonals of the cube in two dimensions. The diagonal has a length of root two", "start": 891.449, "duration": 5.48}, {"text": "Well, the circle has a diameter of one just a little less in", "start": 897.12, "duration": 3.229}, {"text": "Three dimensions though. The diagonal of the cube goes to root three", "start": 900.99, "duration": 3.079}, {"text": "well", "start": 904.1, "duration": 0.479}, {"text": "The spheres diameter again stays at one in", "start": 904.579, "duration": 2.1}, {"text": "Any dimension n the diagonal of the cube has a length of the square root of n as in those corners get further and further", "start": 906.87, "duration": 6.049}, {"text": "apart without bound as we move up in dimensions", "start": 912.92, "duration": 2.909}, {"text": "The sphere on the other hand is maintaining the same diameter and thus taking up less and less of the space as the dimension goes", "start": 916.05, "duration": 6.32}, {"text": "up", "start": 922.37, "duration": 1.389}, {"text": "Okay. Now I know before I showed how the fifth dimension strangely has that peak volume", "start": 923.759, "duration": 4.13}, {"text": "But actually this was nothing special and that's because we are specifically using it's fierce", "start": 927.99, "duration": 4.259}, {"text": "If we look at spheres with the radius of three the peak would happen at a different dimension", "start": 932.529, "duration": 3.469}, {"text": "But since spheres with a radius of one are just so common. I decided to highlight it now", "start": 936.429, "duration": 4.67}, {"text": "Let's look at sphere packing for centuries. Mathematicians have been curious about the optimal way to fill space using identical spheres", "start": 941.1, "duration": 6.389}, {"text": "for example in two dimensions the question was how can we arrange pennies on a table such that they are as dense as possible and", "start": 948.069, "duration": 6.32}, {"text": "It turns out the best arrangement takes up about 91% of the space", "start": 954.389, "duration": 3.809}, {"text": "For spheres it was much harder", "start": 959.17, "duration": 1.639}, {"text": "But we found the optimal arrangement takes up about 74% of the space now for most dimensions higher than three", "start": 960.809, "duration": 6.3}, {"text": "We know very little about the best way to arrange spheres", "start": 967.11, "duration": 2.309}, {"text": "However, as we go from dimensions 3 to 4 to 5 and so on the gaps between the spheres start to increase from the 3d", "start": 969.999, "duration": 7.22}, {"text": "case", "start": 977.22, "duration": 0.459}, {"text": "but for some reason in dimension 8", "start": 977.679, "duration": 1.731}, {"text": "There are new gaps that are just large enough to hold spheres that can be perfectly locked into place resulting in that optimal arrangement", "start": 979.41, "duration": 6.63}, {"text": "Which takes up about 25% of the 8 dimensional space?", "start": 986.04, "duration": 3.299}, {"text": "So we do know the math in eight dimensions and guess what the math of optimal sphere packing was determined in 24 dimensions as well", "start": 990.189, "duration": 6.77}, {"text": "Just like the kissing number problem. By the way for anyone saying what's the point of this?", "start": 997.24, "duration": 4.309}, {"text": "it turns out sphere packing and the hypercube graph have", "start": 1001.549, "duration": 3.06}, {"text": "Applications and information and coding theory when it comes to correcting errors and data that show up in noisy communication channels", "start": 1004.769, "duration": 5.869}, {"text": "for example", "start": 1011.1, "duration": 0.599}, {"text": "Let's say if I want to transmit the word yes to someone I'll send them a one and if I want to transmit an O", "start": 1011.699, "duration": 5.39}, {"text": "I'll send a zero now. This is simple enough but errors could come up when it comes to long distance communication", "start": 1017.089, "duration": 5.609}, {"text": "So instead I'll send three 1s for a yes and three zeros for a no", "start": 1023.369, "duration": 4.13}, {"text": "That way veneer does occur like in a message that says 1 0 1", "start": 1027.839, "duration": 3.5}, {"text": "You can still say that's more likely to be a yes since two of the bits are one", "start": 1031.5, "duration": 4.459}, {"text": "Well, we can think of each possible message as a point in 3d space located on the corners of a cube", "start": 1036.689, "duration": 5.599}, {"text": "We'll put a sphere centered at the one-one-one message and one at the 0 0 0 message if the radius of those spheres", "start": 1043.289, "duration": 6.29}, {"text": "Matches the length of the cube then whatever messages they cover will be interpreted as the message at the sphere center", "start": 1049.83, "duration": 6.109}, {"text": "Like here the 1 0 1 message would be interpreted as the 1 1 1 or yes, since that sphere includes both of those corners", "start": 1056.46, "duration": 6.829}, {"text": "But if I want to include more words than just yes or no, I need to pack more spheres into the space", "start": 1064.02, "duration": 4.939}, {"text": "Yes, this example is pretty simplistic", "start": 1070.049, "duration": 2.0}, {"text": "But openly it shows how packing steers tightly into space does have direct applications", "start": 1072.119, "duration": 4.52}, {"text": "And as we add more bits, we do the analysis on higher dimensional hypercube graphs. Meaning we're dealing with higher dimensional sphere packing", "start": 1076.639, "duration": 7.53}, {"text": "Now, let's see something weird in 9 & 10 dimensions", "start": 1084.899, "duration": 2.63}, {"text": "Imagine the square that is cut into four smaller squares and then draw a unit circle in each one of those as shown", "start": 1088.2, "duration": 6.14}, {"text": "Then draw another circle in the center that is tangent to the four others", "start": 1094.859, "duration": 3.739}, {"text": "You'll notice that the center circle is pretty small relative to the entire square and it's far from the edges", "start": 1099.09, "duration": 5.149}, {"text": "We'll do the same thing in three dimensions", "start": 1105.239, "duration": 1.94}, {"text": "Which would involve a cube being cut into eight pieces and those each being filled with a unit sphere?", "start": 1107.179, "duration": 4.53}, {"text": "Then we'd pack a sphere in the very middle such that it barely touches the other eight", "start": 1111.929, "duration": 3.829}, {"text": "Here you also notice that the sphere is much smaller than the cube", "start": 1116.279, "duration": 2.78}, {"text": "But as the dimensions go up that central sphere gets larger and larger and in nine dimensions that central sphere actually", "start": 1119.7, "duration": 6.289}, {"text": "touches the edge of the nine dimensional cube then in ten dimensions", "start": 1126.269, "duration": 4.099}, {"text": "It breaks through the sides of the cube", "start": 1130.369, "duration": 1.99}, {"text": "Even though the cube well looks like it should be the boundary of the inner sphere holding it inside", "start": 1132.359, "duration": 4.25}, {"text": "However, when the sphere breaks through the cube, it still has a smaller volume than the cube that is until dimension", "start": 1137.999, "duration": 6.2}, {"text": "262 after 262 dimensions the hyper sphere becomes larger than the hypercube volume-wise", "start": 1145.049, "duration": 6.229}, {"text": "Okay, I don't officially quote me on that as I found it in various forum posts rather than an official source", "start": 1152.249, "duration": 4.58}, {"text": "But once I came across that information, I really couldn't exclude it", "start": 1157.139, "duration": 3.08}, {"text": "Now let's look at an example. That's kind of similar to the sphere packing we saw earlier", "start": 1160.95, "duration": 3.799}, {"text": "Let's say we have a bunch of oranges or spheres that we need to wrap using saran wrap or whatever", "start": 1165.299, "duration": 5.51}, {"text": "The question is what's the best way to arrange these such that you use the least amount of that saran wrap?", "start": 1171.33, "duration": 5.329}, {"text": "Now I only have three oranges here so you don't have many options", "start": 1176.879, "duration": 2.63}, {"text": "But in general the question is should you align the oranges in a line or should you clump them?", "start": 1179.609, "duration": 5.66}, {"text": "Just like we saw the sphere packing", "start": 1185.269, "duration": 1.72}, {"text": "Well at the moment", "start": 1186.989, "duration": 0.92}, {"text": "Both of those answers are right because it does depend on how many oranges we have", "start": 1187.909, "duration": 3.869}, {"text": "When you only have a couple like four or five it is best to just line them up", "start": 1191.909, "duration": 3.92}, {"text": "however", "start": 1196.259, "duration": 0.5}, {"text": "For some reason when you get to 50 seven oranges", "start": 1196.759, "duration": 2.739}, {"text": "It is now better to clump them and the same goes for any number of spheres greater than 57", "start": 1199.529, "duration": 5.07}, {"text": "However, what's the best way to arrange them in four dimensions?", "start": 1204.999, "duration": 2.93}, {"text": "Well, it turns out again you should arrange them such as their centers are on the same line", "start": 1208.09, "duration": 3.859}, {"text": "Until you get to somewhere between 50 thousand and a hundred thousand four-dimensional oranges", "start": 1212.71, "duration": 5.66}, {"text": "because we have determined that somewhere in that range is when you should finally start to clump them in order to minimize the amount of", "start": 1218.769, "duration": 5.78}, {"text": "Wrapping paper used and after that we have no idea what the optimal packing method is in terms of higher dimensions", "start": 1224.549, "duration": 5.4}, {"text": "Until we get to dimension 42 in", "start": 1230.83, "duration": 2.27}, {"text": "42 dimensions and everything after", "start": 1233.919, "duration": 2.03}, {"text": "we have determined that it is best to again align the spheres such that all their centers are on the same line and", "start": 1236.11, "duration": 6.019}, {"text": "there is no breaking point for this so that it's always the best case no matter how many", "start": 1242.379, "duration": 4.46}, {"text": "Very high dimensional oranges that you have. So just in case you guys need to wrap some forty two dimensional fruit", "start": 1247.179, "duration": 5.42}, {"text": "You now know the best way to minimize the cost of that gift wrap", "start": 1252.6, "duration": 2.819}, {"text": "Now if this kind of math interests you there are quite a few areas that you can look into further things such as hyperbolic geometry", "start": 1255.49, "duration": 5.689}, {"text": "differential geometry or abstract algebra", "start": 1261.639, "duration": 2.51}, {"text": "I'll deal with complex surfaces or higher dimensional symmetries and so on but the main branch you want to look into is probably topology", "start": 1264.179, "duration": 6.9}, {"text": "This is a branch of math dealing with properties of space that are preserved under continuous deformations", "start": 1271.48, "duration": 4.939}, {"text": "So like homeomorphisms, which we saw earlier are an important topic in this field", "start": 1276.7, "duration": 4.069}, {"text": "Now this is a course that most people outside math and physics majors will never see", "start": 1281.169, "duration": 4.01}, {"text": "but it is usually offered an undergrad along with some of those other courses I mentioned so if you're not in those majors you could", "start": 1285.34, "duration": 5.299}, {"text": "Always try to tailor your electives to these higher-level math courses or you get a math minor", "start": 1290.639, "duration": 4.32}, {"text": "Even if these don't directly apply your field of study", "start": 1295.299, "duration": 1.891}, {"text": "it's still something you could put on your resume and", "start": 1297.19, "duration": 2.059}, {"text": "If your student or professional needing to make the perfect resume, you can do so over at Nova resume the sponsor of today's video", "start": 1299.409, "duration": 6.26}, {"text": "Novo resume is a free online resume and cover letter making platform that will prepare you for your next job or internship", "start": 1306.49, "duration": 5.689}, {"text": "with this platform", "start": 1312.669, "duration": 0.98}, {"text": "You can create amazing resumes and cover letters that will make you stand out as you can see there's a wide variety of highly", "start": 1313.649, "duration": 5.19}, {"text": "Customizable templates that make everything easy to format and organize", "start": 1318.97, "duration": 3.26}, {"text": "here, we have all the preset categories that are common on any resume where you can simply input relevant information to be displayed exactly how", "start": 1322.779, "duration": 6.95}, {"text": "you want", "start": 1329.73, "duration": 1.01}, {"text": "Personally, I love just being able to easily input the information hit enter and move on without worrying about formatting issues or having to adjust", "start": 1330.74, "duration": 6.29}, {"text": "Everything and that's exactly what you get on this platform", "start": 1337.03, "duration": 2.79}, {"text": "But on top of all this they have much more to help you out like that", "start": 1340.52, "duration": 2.959}, {"text": "Optimizer tool will give you suggestions on what to revise", "start": 1343.55, "duration": 2.449}, {"text": "Based on what companies and hiring managers like to see when looking at potential candidates", "start": 1346.16, "duration": 3.619}, {"text": "So, you know", "start": 1349.78, "duration": 0.6}, {"text": "You're getting the most optimized resume", "start": 1350.38, "duration": 1.87}, {"text": "You can change around the template and theme of the resume as needed and downloading your document is just one click away", "start": 1352.25, "duration": 5.3}, {"text": "Then they have the same capabilities for cover letters as well", "start": 1358.94, "duration": 2.51}, {"text": "So you'll have all the necessary documents when looking for that next job and if you need more help", "start": 1361.45, "duration": 4.529}, {"text": "They've got a career focus blog that'll provide insight on how to land a job as a recent graduate", "start": 1365.98, "duration": 4.02}, {"text": "How do video interviews how to tailor your resume for specific industries and much more?", "start": 1370.43, "duration": 4.579}, {"text": "So if you need to create your next resume head on over to novo resume com", "start": 1375.23, "duration": 3.739}, {"text": "Using the link in the description and make yours now completely for free. And with that I'm going to end that video there", "start": 1379.07, "duration": 5.719}, {"text": "If you guys enjoyed be sure to like and comment", "start": 1385.43, "duration": 2.27}, {"text": "Follow me on Twitter and bring them in for a Facebook group for updates on everything. I'll see you all in the next video", "start": 1387.83, "duration": 4.789}]