[{"text": "My first Xiaomi phone was the Mi Mix 2.", "start": 0.02, "duration": 2.98}, {"text": "A cutting edge nearly full display phone that gearbest.com", "start": 3.06, "duration": 3.9}, {"text": "helped me get my hands on last year,", "start": 7.08, "duration": 2.22}, {"text": "And that I abandoned reviewing after spending four hours", "start": 9.96, "duration": 4.48}, {"text": "Fighting with bootloader unlocking crap in an attempt to load the English ROM on it", "start": 14.5, "duration": 4.86}, {"text": "Only to find out that Xiaomi HAD", "start": 19.84, "duration": 2.786}, {"text": "a BLOODY", "start": 22.626, "duration": 0.697}, {"text": "ENGLISH VERSION coming a couple weeks later.", "start": 23.323, "duration": 3.937}, {"text": "Anyway, the Mi Mix 2s, so called for it's speedier", "start": 27.84, "duration": 4.94}, {"text": "snapdragon 845", "start": 33.48, "duration": 1.98}, {"text": "Processor, presumably is", "start": 35.469, "duration": 2.0}, {"text": "better across the board anyway", "start": 37.6, "duration": 2.0}, {"text": "Including the out-of-the-box support for English", "start": 40.03, "duration": 2.9}, {"text": "But I still can't figure out why", "start": 44.28, "duration": 2.9}, {"text": "Anybody in this hemisphere is buying premium phones from brands like Xiaomi", "start": 47.5, "duration": 4.96}, {"text": "Is there something on the surface that I am missing here? (Yes)", "start": 53.02, "duration": 3.86}, {"text": " ", "start": 57.2, "duration": 0.5}, {"text": "Like, for example a sponsor for this video like Madrenas Coffee", "start": 58.32, "duration": 4.32}, {"text": "Madrenas Coffee blends specialty cold brew coffee into 16-ounce grab-and-go cans for everyone's convenience", "start": 63.01, "duration": 5.84}, {"text": "Check them out and use offer code \"Linus\" to save 40% at the link below", "start": 69.22, "duration": 4.82}, {"text": "It's really easy to fall in love with the Mi Mix 2s", "start": 83.18, "duration": 2.6}, {"text": "It manages to have the sex appeal of a nearly bezel-less design coming just", "start": 86.0, "duration": 4.939}, {"text": "1% shy of the screen ratio of the iPhone 10 and that's without resorting to an unsightly notch and", "start": 91.43, "duration": 6.319}, {"text": "The work that they've put into their ceramic-coated back has paid off in spades", "start": 97.94, "duration": 5.7}, {"text": "Glass backed phones are back in vogue now to enable wireless charging but as hard as you might try", "start": 103.94, "duration": 7.78}, {"text": "a glass back will never feel as premium nor be as durable as this", "start": 111.92, "duration": 6.22}, {"text": "And after a similar amount of time in my pocket. My OnePlus 6 is", "start": 118.14, "duration": 4.8}, {"text": "noticeably more scuffed up and", "start": 122.94, "duration": 1.98}, {"text": "It's packed full of all the right hardware supporting the latest generation", "start": 125.179, "duration": 3.17}, {"text": "Snapdragon 845 processor up to eight gigs of RAM up to 256 gigs of non expandable storage blah blah blah blah blah", "start": 128.78, "duration": 6.589}, {"text": "So it's super fast.", "start": 135.44, "duration": 1.4}, {"text": "I think you guys get the point and the price is right too lining up right across the OnePlus 6 as a", "start": 136.84, "duration": 6.32}, {"text": "Flagship grade phone for hundreds of dollars less than you would pay a Tier 1 like Apple or Samsung", "start": 143.26, "duration": 6.26}, {"text": "and", "start": 150.66, "duration": 0.68}, {"text": "it's got lightning-fast fingerprint unlocking, (which is awesome) the ability to choose between button based or gesture based navigation and", "start": 151.34, "duration": 7.52}, {"text": "even wireless charging which as we outlined in our video recently has the potential, when used properly,", "start": 159.26, "duration": 6.5}, {"text": "To improve the lifespan of your non removable, but respectably sized", "start": 165.94, "duration": 4.78}, {"text": "3400 mAH battery", "start": 171.14, "duration": 2.38}, {"text": "So, uh", "start": 174.44, "duration": 1.799}, {"text": "Wait, why was I so down on this thing a couple of minutes ago? I still can't figure out why", "start": 176.24, "duration": 5.36}, {"text": "Anybody in this hemisphere is buying premium phones from brands, like Xiaomi. That seems kind of unfair doesn't it?", "start": 181.82, "duration": 6.22}, {"text": "I mean even the dual rear camera", "start": 188.26, "duration": 2.64}, {"text": "Absolutely blows away", "start": 191.14, "duration": 2.36}, {"text": "previous generation efforts from Chinese phone makers like", "start": 193.66, "duration": 3.64}, {"text": "this low-light shot here does have more noise than any other camera that I tested but", "start": 197.44, "duration": 6.12}, {"text": "it avoids the over sharpening of the Mate 10 Pro and", "start": 203.72, "duration": 3.66}, {"text": "the undesirable flaring of the Galaxy S9 so I mean at least", "start": 207.58, "duration": 4.74}, {"text": "Xiaomi isn't actively processing the image to make it worse", "start": 212.38, "duration": 3.76}, {"text": "And then in this challenging situation the Mi Mix 2s ends up", "start": 216.15, "duration": 4.769}, {"text": "Noisier than Samsung and with less true-to-life colors from the OnePlus 6", "start": 221.14, "duration": 4.37}, {"text": "But, it looks better than both the iPhone 10 and the Pixel 2 XL and under ideal conditions", "start": 225.94, "duration": 6.83}, {"text": "You can get some really nice images out of it", "start": 232.77, "duration": 2.729}, {"text": "So let's talk about some of the weaknesses of the Mi Mix 2s the earpiece speaker", "start": 235.5, "duration": 5.16}, {"text": "Isn't amplified for stereo sound. There's no water resistance, at least nothing officially IP rated,", "start": 241.24, "duration": 6.559}, {"text": "1080p slo-mo only goes to 120 fps rather than 240", "start": 248.47, "duration": 4.58}, {"text": "The display is IPS rather than OLED which means almost no potential for burn-in", "start": 253.18, "duration": 5.9}, {"text": "but at the cost of ambient or always-on technology and", "start": 259.42, "duration": 5.14}, {"text": "There is no headphone jack", "start": 264.58, "duration": 1.82}, {"text": "So you will need to pull out an adapter every time you want to watch My Little Pony at the back of the bus without", "start": 266.4, "duration": 5.309}, {"text": "anybody finding out.", "start": 271.71, "duration": 1.69}, {"text": "So all that is", "start": 273.4, "duration": 1.71}, {"text": "kind of a drag, but again, it's hundreds of dollars less for top spec hardware and", "start": 275.11, "duration": 7.65}, {"text": "It's got no display notch so I can accept that stuff", "start": 282.76, "duration": 5.64}, {"text": "even if I don't like all of it", "start": 288.49, "duration": 2.75}, {"text": "The part that is unforgivable is the", "start": 292.24, "duration": 2.57}, {"text": "software", "start": 295.39, "duration": 1.08}, {"text": "MIUI is like going back in time", "start": 296.47, "duration": 3.57}, {"text": "To when Samsung still thought that having a bunch of bloat in there...", "start": 300.24, "duration": 4.12}, {"text": "Okay", "start": 304.36, "duration": 0.68}, {"text": "Well, that's Samsung still has a lot of bloat in there. So", "start": 305.04, "duration": 3.059}, {"text": "um", "start": 308.8, "duration": 1.41}, {"text": "Okay, whatever in Xiaomi's defense", "start": 310.21, "duration": 2.75}, {"text": "Some of the stuff that they include is legitimately useful like a screen recorder app and a quick link to my downloads", "start": 313.6, "duration": 7.07}, {"text": "But there were just so many", "start": 321.13, "duration": 2.0}, {"text": "annoying things that I ran into that ground my gears from having in my pocket for two weeks", "start": 323.41, "duration": 5.809}, {"text": "Let's take Google Hangouts. If I got a message an hour ago, but left it unread because I wanted to deal with it later", "start": 329.62, "duration": 7.01}, {"text": "Every new message that I get or even opening up another conversation. Sometimes will make it pop up again", "start": 337.27, "duration": 6.38}, {"text": "Why?", "start": 344.38, "duration": 1.77}, {"text": "Um, when I create a folder on the homescreen", "start": 346.15, "duration": 2.11}, {"text": "It doesn't pull up the keyboard automatically for me to start typing", "start": 349.2, "duration": 3.16}, {"text": "Why?", "start": 353.11, "duration": 1.049}, {"text": "the included weather app wants access to my PHONE? for some reason when all it should need is my", "start": 354.16, "duration": 6.9}, {"text": "location not to mention that it cannot be removed or even hidden so you have to create a", "start": 361.18, "duration": 6.34}, {"text": "useless crap folder iOS style", "start": 367.96, "duration": 2.12}, {"text": "There's no obvious way to expand a notification from the lockscreen and reply to it", "start": 370.32, "duration": 5.38}, {"text": "Which is good for security, but I would like to at least have the option for my convenience", "start": 375.789, "duration": 5.36}, {"text": "I can't install Netflix off the App Store the workaround seems to be to track down the apk and install it manually", "start": 381.569, "duration": 6.269}, {"text": "It wakes the screen for notifications, which is nice", "start": 388.569, "duration": 2.6}, {"text": "But not when you lift the phone something that I've come to take for granted these days and there is no hardware button", "start": 391.33, "duration": 6.199}, {"text": "to launch the camera", "start": 397.87, "duration": 1.829}, {"text": "Yuck now taken individually", "start": 399.699, "duration": 2.0}, {"text": "every one of those things would seem like a pretty", "start": 402.4, "duration": 2.929}, {"text": "Insignificant little gripe and there are things that their software does reasonably well", "start": 406.27, "duration": 4.399}, {"text": "so their screenshot management, something that I use a lot, blows OnePluses out of the water and", "start": 410.72, "duration": 5.92}, {"text": "a separate account for another user", "start": 417.0, "duration": 2.14}, {"text": "Is super handy if I want to give the phone to my kids", "start": 419.32, "duration": 2.39}, {"text": "But I don't want them accessing all my stuff. The bottom line though, is that", "start": 421.71, "duration": 3.929}, {"text": "This device was annoying to use for me and not just compared to a flagship one like the S9+", "start": 426.31, "duration": 7.639}, {"text": "Compared to other devices that cost the same", "start": 434.469, "duration": 2.48}, {"text": "Xiaomi would do well to take a page out of OnePlus's book on the software side of things.", "start": 437.469, "duration": 4.55}, {"text": "There isn't really such a thing as", "start": 442.389, "duration": 2.0}, {"text": "Stock Android anymore. I mean even Google's own Pixel lineup customizes stock Android", "start": 444.639, "duration": 5.299}, {"text": "but they would do well to try to get a lot closer because the hardware and the design are", "start": 450.58, "duration": 7.22}, {"text": "Already really impressive. So I'm looking forward to seeing continued improvement", "start": 457.99, "duration": 4.669}, {"text": "Speaking of improvement", "start": 464.409, "duration": 1.1}, {"text": "The only thing that could improve this video is this message from our sponsor Corsair.", "start": 465.509, "duration": 4.17}, {"text": "Corsairs unplug and play series we'll get rid of the wires in your life the dark core RGB", "start": 469.899, "duration": 5.12}, {"text": "Se Mouse is quick featuring one millisecond 2.4 GHz and low latency Bluetooth connectivity", "start": 475.02, "duration": 5.639}, {"text": "And if you opt for the wireless charging model, you can actually charge it with Corsairs", "start": 480.659, "duration": 4.65}, {"text": "MM1000", "start": 485.31, "duration": 0.82}, {"text": "or any compatible Qi® wireless charging pad", "start": 486.13, "duration": 3.589}, {"text": "There k63 wireless gaming keyboard features the same low latency connection options and Cherry MX red switches with a blue LED", "start": 490.0, "duration": 6.919}, {"text": "Backlight and you can check out their entire lineup at the link below", "start": 497.02, "duration": 3.44}, {"text": "So thanks for watching guys. If this video sucked, you know what to do", "start": 501.52, "duration": 3.2}, {"text": "But if it was awesome get subscribed hit that like button", "start": 504.72, "duration": 2.82}, {"text": "Or check out the link to where to buy the stuff. We featured in the video description", "start": 507.61, "duration": 3.35}, {"text": "Also down there is our merch store which has cool shit like this and our community forum, which you should totally join", "start": 511.48, "duration": 5.839}]