[{"text": "This video is sponsored by KurtzPel and KOG Games.", "start": 0.02, "duration": 3.22}, {"text": "KurtzPel is a free-to-play, anime-style action RPG for PC that is available in the link below.", "start": 3.26, "duration": 4.66}, {"text": "Right off the bat I've got to say that this game, honestly, has one of the most satisfying action combat systems", "start": 7.96, "duration": 4.4}, {"text": "I've played in an anime MMO game. Attacks feel good and weighty, chaining combos with special moves", "start": 12.36, "duration": 4.82}, {"text": "looks cool as hell and overall, battles can actually be quite challenging, not forgetting that it all looks absolutely beautiful.", "start": 17.19, "duration": 5.669}, {"text": "Choose from a variety of different classes to suit your play style and also create your own character to suit whatever protagonist you want to be.", "start": 23.26, "duration": 5.75}, {"text": "You can be an OP anime guy, or let's be honest,", "start": 29.01, "duration": 2.669}, {"text": "we're gonna be a girl cuz when in life wouldn't I choose to roleplay as a cute anime girl?", "start": 31.679, "duration": 3.84}, {"text": "See you can edit all the important features like eye colour, hair style, and...", "start": 35.52, "duration": 3.94}, {"text": "DAMN BOI, SHE THICC, BOOOOOIIIIIIII", "start": 39.46, "duration": 1.3}, {"text": "Currently the game is in early access for North and Latin America,", "start": 40.78, "duration": 2.66}, {"text": "where you can play either PvE or get your ass handed to you in PvP.", "start": 43.46, "duration": 3.28}, {"text": "And I've been impressed at how closely the developers are listening to feedback and quickly addressing any issues", "start": 46.78, "duration": 4.58}, {"text": "the player base may have had with the game.", "start": 51.36, "duration": 1.53}, {"text": "If you want to try it out, again,", "start": 52.89, "duration": 1.47}, {"text": "Click the link in the description to give it a download on Steam. And with that said let's get on with the video", "start": 54.36, "duration": 5.699}, {"text": "There's a concept I feel has died as of late within our community. One that used to be a", "start": 60.12, "duration": 4.74}, {"text": "standard part of getting into the medium and that is the idea around classic anime.", "start": 64.9, "duration": 6.28}, {"text": "Anime that define their generation and pioneered the landscape you see today.", "start": 71.18, "duration": 4.24}, {"text": "It used to be mandatory to at least go back and watch a handful of them,", "start": 75.45, "duration": 2.97}, {"text": "but nowadays, not only is there less obligation to get yourself cultured by watching these shows,", "start": 78.42, "duration": 4.5}, {"text": "I also kind of feel like no matter how great any new anime coming out is, there's nothing that really sticks out to me that we could call a modern classic.", "start": 82.92, "duration": 7.8}, {"text": "I off handedly mentioned in my Best of Anime 2018 video that despite how great I thought last year was,", "start": 90.72, "duration": 5.6}, {"text": "it had zero classics, which was more my way of describing that no matter how good any show was, it seemed to lack a sense of impact and longevity", "start": 97.38, "duration": 5.8}, {"text": "that a lot of greater years of anime had. But it certainly sparked an unintentional debate in the comments section", "start": 103.2, "duration": 5.54}, {"text": "about what exactly a classic even is and whether it's too early to judge.", "start": 108.74, "duration": 3.62}, {"text": "So today, I wanted to really dig in on that exact topic, what's lacking today, and really remind everyone why they were", "start": 112.38, "duration": 7.08}, {"text": "important in the first place. There's a lot of different things I want to unpack in this video,", "start": 119.46, "duration": 4.04}, {"text": "so without further ado, let's just jump into it.", "start": 123.5, "duration": 2.7}, {"text": "What", "start": 126.2, "duration": 0.64}, {"text": "What makes", "start": 126.84, "duration": 0.52}, {"text": "What makes a classic?", "start": 127.36, "duration": 1.36}, {"text": "What makes a Classic FM? \n(Yay! A British joke no one gets!)", "start": 128.72, "duration": 0.6}, {"text": "I don't think I need to state that the exact parameters of what defines a classic is entirely subjective and probably different for every", "start": 129.32, "duration": 6.36}, {"text": "person.", "start": 135.68, "duration": 1.18}, {"text": "But I guess I just did anyway.", "start": 136.86, "duration": 1.94}, {"text": "Most common definitions of the word, in a broader sense, simply played out to be something of universally recognized quality and established ongoing value.", "start": 138.8, "duration": 7.42}, {"text": "However, for the sake of the argument I'm making, for me it boils down to three main points...", "start": 146.22, "duration": 5.6}, {"text": "Number One:", "start": 151.82, "duration": 0.96}, {"text": "Number One: Staying Power", "start": 152.78, "duration": 1.24}, {"text": "Classics are classics because they have stood the test of time. No matter how many years pass,", "start": 154.02, "duration": 4.86}, {"text": "they will still be relevant in their own way.", "start": 158.88, "duration": 1.95}, {"text": "There are many older anime that have aged in some way, mainly to do with their art style or", "start": 160.83, "duration": 4.59}, {"text": "animation, but have preserved a sense of timelessness, with either their story or", "start": 165.44, "duration": 3.54}, {"text": "characters, that can be enjoyed in any era. As a side note, that have been many shows that set trends and pioneered legendary tropes on", "start": 169.06, "duration": 6.92}, {"text": "the bleeding edge of what was fresh and", "start": 175.98, "duration": 1.66}, {"text": "significant in the time they came out, but have lost a lot of their luster through these elements becoming oversaturated years later.", "start": 177.64, "duration": 5.92}, {"text": "The Vision of Escaflowne, for example, pioneered a lot of things, and there was a time", "start": 183.56, "duration": 3.9}, {"text": "it was considered a classic and I'm sure many still do. Now though,", "start": 187.46, "duration": 3.7}, {"text": "it's a lot harder to recommend for newer audiences, as most people who watch it for the first time could see it as some", "start": 191.16, "duration": 4.86}, {"text": "generic, isekai-mecha show, because of how", "start": 196.02, "duration": 2.4}, {"text": "overplayed many of its tropes have become since, and, in my opinion, no matter how revolutionary a show is,", "start": 198.43, "duration": 5.599}, {"text": "this is a test it has to overcome. Which brings me to point Number Two:", "start": 204.029, "duration": 4.391}, {"text": "Impact \n(Presumably not like Eva)", "start": 208.62, "duration": 0.92}, {"text": "I feel there needs to be a level of impact and influence", "start": 209.54, "duration": 2.48}, {"text": "because logically, it must have been able to impact its own time in order for it to be remembered.", "start": 212.04, "duration": 4.32}, {"text": "And this goes in two ways: an impact on the anime industry", "start": 216.36, "duration": 2.82}, {"text": "itself that influences future titles and the landscape of anime, or an impact on anime pop culture and the general audience of the time.", "start": 219.25, "duration": 6.77}, {"text": "I don't think I need to clarify what kind of impact anime like Neon Genesis Evangelion or Akira had,", "start": 226.02, "duration": 4.919}, {"text": "but I could talk about more recent anime that had a profound impact on anime pop culture.", "start": 230.94, "duration": 4.48}, {"text": "If I shouted the phrase \"And this is to go even further beyond!\" or \"Just who the hell do you think I am?\",", "start": 235.42, "duration": 5.94}, {"text": "how many of you would immediately know what I'm talking about? Some classics", "start": 241.36, "duration": 4.1}, {"text": "I feel only have an impact on the industry, some on pop culture, and some doing both. But I think it's important because if an", "start": 245.46, "duration": 6.419}, {"text": "anime hits every other category, but isn't that popular or widely influencial, in my opinion, it's closer to a cult classic. And finally,", "start": 251.88, "duration": 7.7}, {"text": "Number Three:", "start": 259.58, "duration": 1.2}, {"text": "Number Three: Quality.", "start": 260.78, "duration": 0.7}, {"text": "The term classic surely implies that there would be a certain level of quality or critical acclaim behind it.", "start": 261.48, "duration": 4.66}, {"text": "You can have something that's remained relevant for years and is also widely influential, as you would see with a lot of gateway anime,", "start": 266.15, "duration": 5.7}, {"text": "but unless there's a general agreed consensus that it's up to a certain level of high standards, people won't take it seriously.", "start": 271.85, "duration": 6.59}, {"text": "I think the best example of this is the Sword Art Online franchise, which is still way more relevant than arguably", "start": 278.44, "duration": 5.02}, {"text": "any other anime that came out in the same year, and undoubtedly has had the popularity to back it up while influencing the landscape of modern anime.", "start": 283.46, "duration": 7.6}, {"text": "But would anyone actually call this a classic?", "start": 291.06, "duration": 3.86}, {"text": "Now with these points in mind, how many, if any, could you apply all three criteria to an anime today?", "start": 295.24, "duration": 7.3}, {"text": "To me,", "start": 306.2, "duration": 0.82}, {"text": "it's the feeling of a modern classic that's been missing from anime recently, and I don't want you to get the impression that that means", "start": 307.02, "duration": 5.15}, {"text": "anime has gotten worse. Quite the opposite in fact", "start": 312.17, "duration": 2.11}, {"text": "I think it's better than has ever been, and that might actually be it. Never before has such a wide variety of high-quality", "start": 314.28, "duration": 6.36}, {"text": "anime been available to us in a constant drip feed of seasonal content, never giving us a moment's rest.", "start": 320.64, "duration": 5.22}, {"text": "We've been spoilt for choice, and I think it kind of shows when I think this spring season is kind of weak just because it only has", "start": 325.96, "duration": 5.16}, {"text": "two shows I'm super hyped for and five shows I think are pretty good. Get out of here. What do you mean", "start": 331.13, "duration": 6.839}, {"text": "I'm not literally spending every free moment trying to keep up with shows worth watching like the last two seasons?", "start": 337.969, "duration": 5.511}, {"text": "(Sᴜʙsᴄʀɪʙᴇ ᴛᴏ CᴀʟʟMᴇCᴀʀsᴏɴ)", "start": 344.16, "duration": 0.5}, {"text": "While there are less shows pioneering new things, which is understandable considering how old this medium is right now,", "start": 346.96, "duration": 5.72}, {"text": "I think the average quality and very certainly the quantity of choice has gone up.", "start": 352.68, "duration": 4.529}, {"text": "But that's the thing, if everything is special, nothing is.", "start": 357.209, "duration": 4.151}, {"text": "Of all the three criteria, it's Staying Power", "start": 361.36, "duration": 2.36}, {"text": "that seems to be missing most of the time.", "start": 363.72, "duration": 1.92}, {"text": "Current trends and hype series cover the majority of what remains relevant and impactful throughout the wider community,", "start": 365.64, "duration": 5.26}, {"text": "with the sheer density of new series being fed to us every season, it can become easy to forget even great shows.", "start": 370.9, "duration": 6.38}, {"text": "We used to complain that anime used to have filler seasons. Now, it feels like we have filler anime. You could", "start": 377.28, "duration": 6.46}, {"text": "argue that it's far too early to determine which recently aired anime has staying power", "start": 383.74, "duration": 4.54}, {"text": "But I'd argue that you'd be hard-pressed to find any show that lingers around for longer than three months,", "start": 388.28, "duration": 4.98}, {"text": "let alone years or decades later. Just because not a lot of time has passed", "start": 393.32, "duration": 4.22}, {"text": "doesn't mean you can't have a good idea of what will stick around.", "start": 397.54, "duration": 2.74}, {"text": "There have been plenty of sporting events that have been labeled an instant classic, as soon as the last episode of Breaking Bad aired", "start": 400.28, "duration": 5.58}, {"text": "I knew was gonna go down in television history, and with what Infinity War and Endgame have achieved and how much is", "start": 405.87, "duration": 5.22}, {"text": "permeated into general pop culture, I have no doubt they will become classics that have defined this generation. On a rare occurrence, though", "start": 411.22, "duration": 6.949}, {"text": "I will watch an anime that does something special that would stay in my mind for a very long time, even in this climate.", "start": 418.169, "duration": 5.651}, {"text": "Something that goes above and beyond even compared to the best and has that special", "start": 423.88, "duration": 3.9}, {"text": "X-Factor you rarely see. The anime that I would say has come closest to becoming a classic recently is", "start": 427.8, "duration": 5.9}, {"text": "Mob Psycho 100 - Season 2.", "start": 433.7, "duration": 2.12}, {"text": "Hell, I know many of you would probably argue it already is, and I completely get that.", "start": 435.82, "duration": 4.4}, {"text": "Season 2 of Mob Psycho is one of the best anime series I've seen in years, that completely blew the first season out of the water.", "start": 440.22, "duration": 5.9}, {"text": "It somehow leveled up its orgasmic animation with some of the best fight scenes of the last decade,", "start": 446.12, "duration": 4.3}, {"text": "and paired this with a heart and intimate character writing that wasn't as", "start": 450.42, "duration": 2.84}, {"text": "prevalent before, while ending every major plot thread it had set up, resulting in an all-round package that will certainly stick with me for years to come.", "start": 453.26, "duration": 7.6}, {"text": "It was just such a perfect storm of greatness on every level that you rarely get to see.", "start": 460.86, "duration": 5.12}, {"text": "So what exactly is it missing?", "start": 465.98, "duration": 2.38}, {"text": "Well, it's precisely because...", "start": 468.48, "duration": 1.92}, {"text": "it's a season two. As much of a masterpiece as I think it was a lot of people were dropped off after season 1,", "start": 470.44, "duration": 6.049}, {"text": "which is to be expected in the fast-paced seasonal anime cycle and an over two year gap between seasons.", "start": 476.489, "duration": 5.311}, {"text": "Even I had trouble remembering everything the first season left off at, and I'm sure this killed off a lot of the potential", "start": 481.8, "duration": 5.02}, {"text": "wide-scale impact it could have had. I have no doubts that if it was one long season, or even if the gap was shorter,", "start": 486.86, "duration": 6.22}, {"text": "It would have permeated the community much deeper than it did, but as it stands it wasn't even the most popular show of its own", "start": 493.08, "duration": 6.0}, {"text": "season. There was more discussion around Shield Hero. More fresh hype around Promised Neverland.", "start": 499.14, "duration": 4.96}, {"text": "And more memes around Kaguya-Sama. This, I think, perfectly illustrates", "start": 504.1, "duration": 3.68}, {"text": "why it's so hard for anime today to get a sense of longevity. Right now, Anime has become too", "start": 507.78, "duration": 4.62}, {"text": "segmented to have the same influence, and the community moves too fast to have the same staying power it used to.", "start": 512.4, "duration": 5.18}, {"text": "I'm sure it's still possible, it's just much harder.", "start": 517.58, "duration": 3.08}, {"text": "It has to be able to stand out from the dozens of anime it competes with every season.", "start": 520.68, "duration": 3.869}, {"text": "It has to be given a long enough run time to have a lasting impact, without big breaks if it's broken up into seasons.", "start": 524.549, "duration": 5.111}, {"text": "It has to be easily accessible on a streaming platform that the community will collectively access,", "start": 529.66, "duration": 4.4}, {"text": "and, on top of that, it has to be...", "start": 534.1, "duration": 2.5}, {"text": "you know....", "start": 536.6, "duration": 0.74}, {"text": "Really", "start": 537.34, "duration": 0.5}, {"text": "Really Fucking", "start": 537.84, "duration": 0.5}, {"text": "Really Fucking Good.", "start": 538.34, "duration": 0.5}, {"text": "I do, however, think there's a small asterisk to this point,", "start": 538.84, "duration": 2.836}, {"text": "as I think every generation will have a", "start": 541.676, "duration": 1.724}, {"text": "long-running shonen that defines that era and goes down as a classic. With it being a staple of gateway anime and it's long-running nature", "start": 543.4, "duration": 6.769}, {"text": "allows it far more time to build the popularity and impact and staying power because, well, it sticks around for so long", "start": 550.169, "duration": 6.171}, {"text": "So if there is an exception to everything, I've said here it would, of course, be:", "start": 556.34, "duration": 4.74}, {"text": "My Hero Academia", "start": 561.08, "duration": 1.54}, {"text": "I do think this is the one show that has done enough to be remembered for a long time to come, but I also consider", "start": 562.62, "duration": 5.0}, {"text": "these types of shows to play by a different set of rules than the Mob Psychos of the anime world. Because part of the reason", "start": 567.63, "duration": 5.28}, {"text": "the idea of classics has died is because, well, we don't feel the need to look back into the past anymore.", "start": 572.91, "duration": 5.39}, {"text": "Even if the past is just a year or two ago. There's so much to choose from now,", "start": 578.3, "duration": 3.94}, {"text": "What's the point of looking back?", "start": 582.28, "duration": 2.38}, {"text": "And that's the real reason I wanted to make this video. Because over the past few months,", "start": 584.66, "duration": 4.34}, {"text": "I actually did set a bit of time to watch some classic anime I had never seen before.", "start": 589.08, "duration": 4.1}, {"text": "And it just reminded me why classics are indeed called classics.", "start": 593.18, "duration": 5.22}, {"text": "Two months ago", "start": 602.74, "duration": 0.92}, {"text": "I set off on an arduous mission to start the anime that had been sitting on my watch list for years.", "start": 603.66, "duration": 5.38}, {"text": "Waiting until I was ready to take that leap of faith to finally watch it.", "start": 609.1, "duration": 3.66}, {"text": "Legend of the Galactic Heroes.", "start": 613.44, "duration": 2.28}, {"text": "It was an undertaking that was as intimidating as the reputation that", "start": 615.72, "duration": 2.98}, {"text": "preceded it. A classic so highly spoken of, it has literally been memed to death by many people, myself included, as the one show that's been", "start": 618.7, "duration": 6.94}, {"text": "put up on the highest pedestal.", "start": 625.64, "duration": 1.76}, {"text": "\"Anime won't be the same once you watch Legends of the Galactic Heroes\"", "start": 627.4, "duration": 4.18}, {"text": "they said, and with this all in mind, what I found was exactly what I had expected.", "start": 631.58, "duration": 7.18}, {"text": "One of the greatest stories to have been told in the history of anime.", "start": 638.92, "duration": 4.68}, {"text": "A tale so grand, no other anime even comes close to the scale,", "start": 643.6, "duration": 3.92}, {"text": "depth, and density of the saga told here. A production that took almost ten years to complete, contained in a whopping", "start": 647.52, "duration": 6.02}, {"text": "110 episodes for a one-of-a-kind experience you can't find anywhere else in this medium.", "start": 653.58, "duration": 5.18}, {"text": "It's not the kind of fast-paced instant gratification anime more common today,", "start": 658.77, "duration": 3.839}, {"text": "but a full-length epic you gradually immerse yourself into.", "start": 662.609, "duration": 4.051}, {"text": "With a show like this you can get so caught up in its reputation", "start": 666.66, "duration": 2.68}, {"text": "that it can be easy to forget how and why it got its reputation in the first place. Through this, it reminded me", "start": 669.34, "duration": 6.92}, {"text": "why there used to be this big notion that you should go out and watch the classics.", "start": 676.26, "duration": 4.3}, {"text": "Not just because it was a great show,", "start": 680.56, "duration": 1.6}, {"text": "there are plenty of great shows that are coming out right now, but because it's a unique experience from anything you can find today.", "start": 682.17, "duration": 6.63}, {"text": "There's a reason the classics have survived the passage of time. They might have pioneered something,", "start": 688.81, "duration": 5.51}, {"text": "they might have left a deep impression on the audience of their time,", "start": 694.32, "duration": 3.089}, {"text": "but most importantly, it's because throughout the years that came after, nothing came along that was able to replace them.", "start": 697.409, "duration": 7.371}, {"text": "I can safely say since I first watched Cowboy Bebop, there hasn't been any other show quite like it .", "start": 704.78, "duration": 5.62}, {"text": "Serial Experiments Lain has a depiction of technology that somehow seems more relevant today than when it came out in 1998.", "start": 710.4, "duration": 7.1}, {"text": "Akira still looks better than 90% of the anime coming out now.", "start": 717.5, "duration": 3.78}, {"text": "Neon Genesis Evangelion redefines what it means to be genre defining.", "start": 721.28, "duration": 4.68}, {"text": "It can be easy to forget through the current sea of Isekai Power Fantasy Highschool rom-coms of today", "start": 725.96, "duration": 5.36}, {"text": "that anime didn't always look like this.", "start": 731.32, "duration": 2.78}, {"text": "So if you think this season is a little slow and you have some time to fill, just pick a classic title that's been collecting dust", "start": 734.11, "duration": 6.059}, {"text": "in your watch list and I guarantee, it'll be a way more fulfilling", "start": 740.169, "duration": 3.851}, {"text": "experience than watching another disposable show that's been airing in the last year.", "start": 744.04, "duration": 4.38}, {"text": "Whether or not you agree on which anime counts as classics, or even", "start": 748.42, "duration": 3.56}, {"text": "if you disagree with my opinion that we haven't gotten any recently,", "start": 751.98, "duration": 2.82}, {"text": "I think it's important to keep the idea of classics alive, because it does feel like lately", "start": 754.86, "duration": 4.08}, {"text": "there's been a depreciation in the value of longevity and revisiting the past.", "start": 758.94, "duration": 5.18}, {"text": "So if there's anything I wanted to do with this video, it's reminding people that there is a reason to look back", "start": 764.12, "duration": 5.82}, {"text": "It's taking a break from the current climate and having a look at a product of another time.", "start": 769.94, "duration": 4.46}, {"text": "It's having that realization of \"Oh, this is what everyone was talking about.\"", "start": 774.4, "duration": 5.16}, {"text": "It's experiencing a show that has done something to deserve to be remembered.", "start": 779.56, "duration": 4.26}, {"text": "Because one of the saddest things I think could happen to classics is for them to be", "start": 783.82, "duration": 5.52}, {"text": "forgotten.", "start": 789.34, "duration": 2.0}, {"text": "Hey guys, hope you enjoyed that video.", "start": 793.38, "duration": 2.12}, {"text": "Again, I want to thank KurtzPel and KOG games for sponsoring this video.", "start": 795.5, "duration": 4.0}, {"text": "If you liked what I showed and want to give it a go then just click on the link below to download it also", "start": 799.5, "duration": 3.9}, {"text": "Also, thank you very much to Bddinyolife,", "start": 803.4, "duration": 2.9}, {"text": "Robert Hamilton, Walt O, SupremeSayain, Nicholas Tatum, Michael, from my patreon discord lets me use one of his lines in this video", "start": 806.32, "duration": 7.14}, {"text": "There, Michael. There's your free shout out.", "start": 813.61, "duration": 2.07}, {"text": "And everyone else on my patreon for helping to support me for this month and making this video possible.", "start": 815.68, "duration": 4.12}, {"text": "Not many updates today, by the time this video comes out, I'll probably be in America or Ireland just travelling around.", "start": 819.9, "duration": 5.04}, {"text": "So, yeah, I'll just leave it at that. I've been Gigguk and I'll see you all next time.", "start": 824.94, "duration": 4.46}]