[{"text": "Animal vision is a remarkable thing. Like,", "start": 0.0, "duration": 2.76}, {"text": "Photons of light enter an eyeball and they somehow turn into electrical signals in the brain. That's amazing!", "start": 3.01, "duration": 6.62}, {"text": "It's something I've always wanted to understand and thanks to my last video", "start": 9.63, "duration": 3.599}, {"text": "I finally got the chance to sit down and work through it and figure it out.", "start": 13.229, "duration": 3.731}, {"text": "it all starts with one molecule called retinal", "start": 17.18, "duration": 3.48}, {"text": "Which I've built here.", "start": 20.82, "duration": 1.69}, {"text": "So, retinal is an arrangement of a specific number of carbon atoms, hydrogen atoms and one oxygen atom", "start": 22.51, "duration": 7.939}, {"text": "joined together in a specific sequence.", "start": 31.09, "duration": 2.0}, {"text": "But despite that specific sequence and number, there's a lot of variability in the form of the molecule. Like look,", "start": 33.79, "duration": 6.649}, {"text": "I can twist it around move this around over here and change the shape of it", "start": 40.44, "duration": 4.26}, {"text": "Except that in reality a molecule like this tends to find an equilibrium for itself. Like look", "start": 45.24, "duration": 5.44}, {"text": "If you think about these two hydrogen atoms, for example", "start": 50.74, "duration": 3.1}, {"text": "These hydrogen atoms are slightly positively charged and so they repel each other.", "start": 54.16, "duration": 3.86}, {"text": "But then look, these two hydrogens are repelling each other as well", "start": 58.21, "duration": 2.81}, {"text": "so it's gonna find some kind of equilibrium like this and actually, you know,", "start": 61.02, "duration": 3.479}, {"text": "You need to worry about these ones. You need to worry about the arrangement of all of these", "start": 64.5, "duration": 3.569}, {"text": "different charges to figure out what the stable equilibrium of a molecule like this  is gonna be", "start": 68.58, "duration": 4.64}, {"text": "But anyway, it's something like this.", "start": 73.24, "duration": 1.9}, {"text": "Though actually a molecule like this is gonna have more than one stable equilibrium arrangement.", "start": 75.46, "duration": 7.42}, {"text": "It's a bit like a switch in that way. Just to make the point clear,", "start": 83.02, "duration": 3.74}, {"text": "I got this thing 3d printed (I wanted to get it 3d printed anyway)", "start": 86.82, "duration": 3.3}, {"text": "This is a bistable switch, and look", "start": 90.26, "duration": 2.88}, {"text": "It's in a stable equilibrium at the moment because if I try and push it away from that equilibrium state", "start": 93.43, "duration": 6.739}, {"text": "I can push it away. But when I remove that force it relaxes back into the equilibrium position.", "start": 100.169, "duration": 5.151}, {"text": "but if I apply enough force, eventually it snaps into a different equilibrium configuration", "start": 105.46, "duration": 6.66}, {"text": "And this is a stable equilibrium as well because look, if I apply a force I can deviate it from its equilibrium", "start": 112.42, "duration": 6.52}, {"text": "But when I let go it relaxes back into it. Its a bi-stable equilibrium", "start": 119.08, "duration": 4.92}, {"text": "And a similar thing is true for this molecule", "start": 124.0, "duration": 3.02}, {"text": "So if you give it enough energy you can switch it from one state stable equilibrium to another", "start": 127.119, "duration": 5.15}, {"text": "And in this case it switches from this arrangement, which is called 11-cis retinal into...", "start": 133.26, "duration": 6.24}, {"text": "This arrangement. So this swings up and it becomes", "start": 140.28, "duration": 4.24}, {"text": "All-trans retinal", "start": 144.52, "duration": 2.46}, {"text": "So how do you give a molecule like this energy to make it switch?", "start": 146.98, "duration": 4.069}, {"text": "Well, you do with photons. So think of a photon as a packet of...", "start": 151.08, "duration": 4.98}, {"text": "oscillating electric and magnetic fields", "start": 156.64, "duration": 2.42}, {"text": "Let's ignore the magnetic field for now and just so you know photons coming in", "start": 159.12, "duration": 5.0}, {"text": "and it's really an oscillating electric field and...", "start": 164.16, "duration": 3.7}, {"text": "charged particles feel a force in an electric field.", "start": 168.64, "duration": 3.92}, {"text": "So the particles are going to feel an oscillating force in the oscillating electric field of a photon", "start": 172.56, "duration": 8.14}, {"text": "And so this, you know,", "start": 180.88, "duration": 1.579}, {"text": "it's going to be wiggling around and because you've got these charged particles and they're feeling a force", "start": 182.46, "duration": 4.38}, {"text": "And, if the photon is energetic enough it. You'll make it switch into this arrangement", "start": 186.84, "duration": 5.54}, {"text": "In reality, it's not just about the photon having enough energy, It's also about the oscillations of the", "start": 193.0, "duration": 4.519}, {"text": "magnetic and electric field having the right frequency. And so what you have is an absorption spectrum", "start": 198.12, "duration": 7.22}, {"text": "So this molecule is good at absorbing a range of frequencies.", "start": 205.44, "duration": 5.42}, {"text": "It'll peak at one particular frequency and die off either side. So that's step one.", "start": 210.87, "duration": 4.529}, {"text": "We've got loads of these molecules called retinal in the cells in the back of our eyes", "start": 215.41, "duration": 4.189}, {"text": "They can absorb photons and it changes their shape", "start": 219.76, "duration": 3.529}, {"text": "But how does that then eventually lead to electrical signals in the brain?", "start": 223.6, "duration": 4.08}, {"text": "And also if there's only this one molecule?", "start": 227.68, "duration": 3.5}, {"text": "How can we perceive different colors of light", "start": 231.4, "duration": 2.82}, {"text": "When you've got this one absorption spectrum for this one particular molecule?", "start": 234.3, "duration": 4.82}, {"text": "Well retinal is kind of useless on its own. In the cells in your eyes,", "start": 239.12, "duration": 4.76}, {"text": "retinal is found embedded in much larger molecules in proteins.", "start": 244.18, "duration": 4.68}, {"text": "And here, I'm representing the larger protein molecule with this white fabric", "start": 248.96, "duration": 5.34}, {"text": "And the way to think of it is the bonds between the retinal molecule and the opsin molecule are", "start": 254.74, "duration": 7.1}, {"text": "pulling on the retinal and slightly changing its shape", "start": 262.479, "duration": 3.47}, {"text": "Depending on the subtle way that you change the shape of retinal, it will affect the absorption spectrum.", "start": 266.77, "duration": 5.539}, {"text": "It will affect which photons of light it preferentially absorbs", "start": 272.44, "duration": 4.64}, {"text": "So in the different cone cells in your eyes and in the rod cells in your eyes, you've got different", "start": 277.38, "duration": 6.02}, {"text": "proteins they're called opsins. This is what the protein actually looks like by the way, nothing like a white sheet", "start": 283.92, "duration": 5.34}, {"text": "So the option that you've got in your rod cells is called rhodopsin", "start": 289.32, "duration": 4.0}, {"text": "and then in the three cone cells in your eyes. You've got three different photopsins that", "start": 293.32, "duration": 6.14}, {"text": "twist and slightly modify the shape of the retinal to make it absorb either light in the red end of the spectrum", "start": 299.76, "duration": 5.94}, {"text": "Or light in the middle of the spectrum 'round sort of green or light in the blue end of the spectrum", "start": 305.92, "duration": 5.929}, {"text": "So that's how a single molecule can be slightly modified by its host", "start": 312.28, "duration": 4.339}, {"text": "Protein to absorb different parts of the spectrum to be sensitive to different parts of the spectrum", "start": 316.99, "duration": 5.989}, {"text": "So here's how it goes photons of light come into your eyes. They're absorbed by the retinal molecules", "start": 322.99, "duration": 5.419}, {"text": "the retinal molecule changes shape", "start": 328.41, "duration": 1.84}, {"text": "That pushes on the opsin protein that it's embedded within and that changes the shape of the opsin protein", "start": 330.25, "duration": 6.47}, {"text": "Here's a thing this whole time the opsin protein has been holding on to another molecule", "start": 337.27, "duration": 4.669}, {"text": "Called transduction and when you change the shape of the opposite protein in this way, it can't hold on to transduction anymore", "start": 342.22, "duration": 7.07}, {"text": "It's released into the cell", "start": 349.29, "duration": 1.72}, {"text": "So you've got this transductive molecule", "start": 351.01, "duration": 2.359}, {"text": "Flying around in the cell that reacts with something that [  ] and then that thing that reacts with reacts with something else", "start": 353.74, "duration": 6.019}, {"text": "You've got this chain of reactions, but eventually the [the] final thing the most important thing is this molecule called CGMP", "start": 359.76, "duration": 8.52}, {"text": "and you can think of that as like a doorman", "start": 368.28, "duration": 2.82}, {"text": "Okay, it's holding a door open in the membrane of the cell. So in the membrane, that's out", "start": 371.32, "duration": 5.359}, {"text": "You've got loads of these things called sodium channels and it's like a door that allows sodium ions into the cell", "start": 376.68, "duration": 5.76}, {"text": "so this whole time you've got sodium ions flooding into the cell, but when this", "start": 382.44, "duration": 5.55}, {"text": "cGMP is turned into", "start": 388.54, "duration": 2.0}, {"text": "GMP it's almost like flopping the arm off of the doorman. It can't keep the door open anymore", "start": 390.79, "duration": 5.089}, {"text": "the sodium channel closes and then the", "start": 395.88, "duration": 2.94}, {"text": "concentration of sodium ions inside the cell", "start": 399.43, "duration": 2.1}, {"text": "Starts to go down and if you know about neurons and axons and cell to cell communication", "start": 402.05, "duration": 5.959}, {"text": "You'll know how important that is. Like if you've got a high concentration of sodium ions inside the cell that's like an action potential", "start": 408.29, "duration": 6.5}, {"text": "which which is important for that stuff and", "start": 415.67, "duration": 2.3}, {"text": "Actually what's weird is when there's no light", "start": 418.85, "duration": 3.259}, {"text": "That the sodium channels open and you've got this action potential in other words", "start": 422.78, "duration": 4.19}, {"text": "The rods and cones are turned on neurologically speaking when there's no light when the light shines in they turn off", "start": 427.31, "duration": 7.309}, {"text": "neurologically speaking", "start": 435.41, "duration": 1.11}, {"text": "so", "start": 436.52, "duration": 0.75}, {"text": "in fact the next cell in the sequence the next cell down the", "start": 437.27, "duration": 3.89}, {"text": "Neurological chain from the rods and cones is like a \"not gate\" is called a bipolar cell", "start": 441.23, "duration": 4.85}, {"text": "So in the rod or cone cell is on", "start": 446.08, "duration": 2.0}, {"text": "The bipolar cell is off and when the rod or cone cell is off", "start": 448.4, "duration": 3.649}, {"text": "The bipolar cell is on that way when light comes in. It corresponds to an on signal a couple of interesting things to add", "start": 452.05, "duration": 7.079}, {"text": "There's actually a fourth type of opsin protein", "start": 459.41, "duration": 2.359}, {"text": "That isn't in your rods or your cones. It's in a cell called an", "start": 462.38, "duration": 4.16}, {"text": "intrinsically photosensitive retinal ganglion cell and", "start": 466.72, "duration": 3.64}, {"text": "This opsin is called melanopsin and it makes the retinal molecule sensitive to the blue end of the spectrum", "start": 471.05, "duration": 6.11}, {"text": "and if you follow the chain of neurons into the brain, it goes to a region of the brain called the", "start": 477.41, "duration": 6.199}, {"text": "Supra", "start": 484.43, "duration": 2.0}, {"text": "Called the suprachiasmatic Nucleus", "start": 486.56, "duration": 4.36}, {"text": "otherwise known as the body clock", "start": 490.92, "duration": 2.76}, {"text": "So when the Sun rises in the morning streams into your eyes", "start": 493.94, "duration": 3.2}, {"text": "It gives you that blue light a signal sent to your body clock saying wake up", "start": 497.14, "duration": 4.41}, {"text": "That's why people turn the blue down on their phones before going to bed", "start": 501.55, "duration": 5.22}, {"text": "It's so that the blue light doesn't keep them awake", "start": 506.87, "duration": 2.63}, {"text": "the final thing to do is add clarity to what I said in my last video where I showed the", "start": 509.6, "duration": 5.119}, {"text": "Sensitivity spectrum of your red green and blue cone cells which you might now understand as the absorption", "start": 514.85, "duration": 7.399}, {"text": "spectrum of the retinal molecule as it's found embedded in the different opsin proteins in your", "start": 522.68, "duration": 7.06}, {"text": "red green and blue cones", "start": 529.9, "duration": 2.3}, {"text": "Except that the graph that I showed you is kind of a lie, or as I called it then an oversimplification", "start": 532.2, "duration": 5.45}, {"text": "because actually if you look at the absorption spectrum of these different obscene complexes, then it looks like this and", "start": 538.44, "duration": 6.26}, {"text": "Look the red opsin peaks", "start": 545.43, "duration": 2.72}, {"text": "At yellow it's not in red at all and look how much it overlaps with green right next to each other and the blue", "start": 548.76, "duration": 6.919}, {"text": "Actually peaks at violet. So why do we call them red green and blue cone cells?", "start": 555.96, "duration": 4.46}, {"text": "When they're - well, we should have got yellow green and violet cone cells", "start": 561.03, "duration": 3.649}, {"text": "Well, actually we don't call that anymore", "start": 565.59, "duration": 1.7}, {"text": "That's kind of historical what we call them now is short medium and long", "start": 567.29, "duration": 4.619}, {"text": "because of the different Wavelengths that they absorb", "start": 572.28, "duration": 3.64}, {"text": "a more probing question would be why do we use red green and blue pixels on a display?", "start": 575.92, "duration": 4.86}, {"text": "Why don't we use yellow green and violet given that those are the peaks of the absorption spectrum of the opsin complexes", "start": 580.78, "duration": 8.7}, {"text": "and the answer. Is that our visual system does some post-processing", "start": 589.48, "duration": 4.92}, {"text": "on the signals that come from our cone cells to try and tease apart", "start": 594.4, "duration": 4.42}, {"text": "The information especially between red and green because they're so close together", "start": 599.46, "duration": 4.13}, {"text": "So it's called the opponent-process theory of color vision", "start": 603.84, "duration": 3.799}, {"text": "If this wavelength of light is coming into your eyes, then it's stimulating your red cones and your green cones", "start": 608.03, "duration": 5.94}, {"text": "but it's stimulating your red cones a lot more so that gives you a sense of", "start": 613.97, "duration": 3.479}, {"text": "How the calculations work if you can call them calculations", "start": 618.2, "duration": 3.18}, {"text": "I'm still going to call them red green and blue cone cells, by the way", "start": 621.38, "duration": 2.34}, {"text": "Because I find it easier", "start": 624.04, "duration": 1.76}, {"text": "But you can then ask what is the equivalent?", "start": 625.8, "duration": 2.989}, {"text": "sensitivity of", "start": 630.24, "duration": 1.29}, {"text": "Those three cone cells after all that", "start": 631.53, "duration": 3.14}, {"text": "Processing has happened and it looks like this if you want to figure it out", "start": 634.89, "duration": 3.89}, {"text": "You can maybe try and examine what's happening with the neurons or you can just do some", "start": 638.78, "duration": 5.729}, {"text": "Experiments on some people to figure out like what is the optimal, like if I wanted to just use three distinct", "start": 645.15, "duration": 6.709}, {"text": "wavelengths in different amounts to recreate", "start": 652.26, "duration": 3.08}, {"text": "the", "start": 655.92, "duration": 1.05}, {"text": "experience of human color vision", "start": 656.97, "duration": 2.059}, {"text": "What would I do and you'd end up with the distribution that I showed you except that I normalized the blow down", "start": 659.61, "duration": 5.76}, {"text": "In other words, like if I wanted you to see this wavelength in I need to shine this much", "start": 666.37, "duration": 4.01}, {"text": "Red light this much green light and this much blue light.", "start": 670.93, "duration": 4.49}, {"text": "So there you go.", "start": 675.42, "duration": 0.9}, {"text": "I'm always fascinated by how complicated biochemistry is you know", "start": 676.32, "duration": 4.22}, {"text": "it's never just like there's this chemical reaction. And then that does that it's like", "start": 680.54, "duration": 4.02}, {"text": "this chemical reaction", "start": 685.089, "duration": 1.531}, {"text": "Causes this to happen to this molecule and then that changes that and does that does that until you know ten steps later", "start": 686.62, "duration": 5.779}, {"text": "It's the thing that you want to happen", "start": 692.41, "duration": 2.69}, {"text": "like the process for regenerating all trans retinal", "start": 695.1, "duration": 4.049}, {"text": "into", "start": 699.79, "duration": 1.109}, {"text": "11-cis retinal it's like a seven step process to get it back to the way it was", "start": 700.899, "duration": 5.359}, {"text": "It's recycled back into the opsin complex", "start": 706.259, "duration": 3.059}, {"text": "If nature were able to overhaul these biochemical processes then maybe we'd end up with", "start": 709.319, "duration": 6.33}, {"text": "simpler chemistry inside us but", "start": 716.29, "duration": 2.359}, {"text": "Nature doesn't work like that evolution can't overhaul", "start": 719.35, "duration": 3.679}, {"text": "Evolution works by tiny baby steps and so we have in us these complicated systems", "start": 723.55, "duration": 6.229}, {"text": "This video is sponsored by North VPN - VPN stands for virtual private network", "start": 729.91, "duration": 4.369}, {"text": "You know that but what does it mean in reality?", "start": 734.279, "duration": 2.429}, {"text": "well", "start": 736.75, "duration": 0.5}, {"text": "You're basically creating a tunnel between your device and some endpoint right one of Nord VPNs endpoints somewhere around the world", "start": 737.25, "duration": 7.229}, {"text": "you can actually choose what you want if you want and", "start": 744.48, "duration": 2.0}, {"text": "so what that means is like all the traffic coming out of your device is", "start": 746.709, "duration": 4.34}, {"text": "Encrypted first and then it goes through the tunnel. That's why it's called a tunnel because no one can get of it on the way", "start": 751.63, "duration": 5.059}, {"text": "Like if you're in a coffee shop on their Wi-Fi or hotel Wi-Fi or something like that", "start": 757.269, "duration": 4.309}, {"text": "No, one on that network can see what you're doing. It's all gibberish to them", "start": 761.92, "duration": 3.979}, {"text": "like if you're filling in personal information on a website for", "start": 766.0, "duration": 3.199}, {"text": "example", "start": 770.38, "duration": 1.199}, {"text": "It also adds a layer of anonymity. So like", "start": 771.579, "duration": 3.14}, {"text": "The the services that you're ultimately connecting to they don't know where you are", "start": 775.689, "duration": 5.15}, {"text": "They think you're at one of the Nord VPN endpoints around the world. They can't geotag you for things like", "start": 781.089, "duration": 5.72}, {"text": "Advertising another nefarious things like that. Like your data is valuable is the point so, you know", "start": 787.329, "duration": 6.06}, {"text": "Do what you can to hold on to it you we need to think about VPNs you really need to", "start": 793.39, "duration": 4.319}, {"text": "by the way, one of the benefits of this kind of", "start": 798.56, "duration": 3.5}, {"text": "like lack of geo-tagging", "start": 803.33, "duration": 2.059}, {"text": "That you can do with a VPN is if you're traveling and you want to use Netflix or Iplay or something like that", "start": 805.73, "duration": 5.929}, {"text": "And it's blocked because you're not in the right country", "start": 811.85, "duration": 2.809}, {"text": "you can just", "start": 815.329, "duration": 1.471}, {"text": "Virtually switch countries you do it through the Nord VPN interface is one of things I really like", "start": 816.8, "duration": 4.159}, {"text": "It's very simple to do if you go to Nord VPN dot com forward slash Steve", "start": 820.959, "duration": 4.32}, {"text": "You'll get 70% off for three years and an additional 30 days", "start": 825.29, "duration": 4.549}, {"text": "Absolutely free. So check it out today. I hope you enjoyed this video", "start": 830.48, "duration": 3.109}, {"text": "If you did, don't forget to hit subscribe, and I'll see you next time", "start": 833.589, "duration": 3.48}]