[{"text": "This video is sponsored by Square Space whether you need a domain website or online store make it with Square Space", "start": 7.42, "duration": 5.99}, {"text": "I mentioned in passing in a previous video that I could get good laminar flow from my kitchen taps, which is nice", "start": 13.41, "duration": 6.53}, {"text": "But I also noticed something really strange recently", "start": 20.12, "duration": 2.18}, {"text": "Not just from this particular kitchen tap, but from any laminar flow really coming from a faucet. Watch this.", "start": 22.71, "duration": 6.06}, {"text": "Look what happens when I put my finger into the stream of water.", "start": 28.99, "duration": 3.77}, {"text": "I get these ripples above my finger", "start": 33.73, "duration": 2.719}, {"text": "Look as I move my finger down the ripples get tighter", "start": 38.589, "duration": 3.98}, {"text": "And as I move up the ripples get broader", "start": 44.53, "duration": 2.0}, {"text": "Strange", "start": 47.62, "duration": 1.41}, {"text": "My kitchen isn't the best environment to investigate this sort of phenomena. So I set something up in my studio", "start": 49.03, "duration": 4.43}, {"text": "I really wanted to see if we can figure out where these ripples come from", "start": 53.46, "duration": 3.51}, {"text": "But I also wanted to capture a really good example of it", "start": 56.97, "duration": 3.36}, {"text": "The first thing you need is you need that flow of water to be really stable", "start": 60.33, "duration": 3.569}, {"text": "Really consistent I managed to achieve that with this funnel and just some cloth over the bottom of it", "start": 64.449, "duration": 6.199}, {"text": "You get this beautiful laminar flow from this setup a lot of other considerations as well. But look, let's just see what we got", "start": 70.649, "duration": 6.15}, {"text": "Isn't that amazing. As soon as the obstruction goes in those standing waves just suddenly appear", "start": 79.539, "duration": 5.99}, {"text": "It seems like further downstream. The  ripples are tighter. Then as you move up the stream", "start": 85.96, "duration": 6.259}, {"text": "They get wider. Look at that. So cool. Is that a standing wave? What is it?", "start": 92.92, "duration": 4.909}, {"text": "I also noticed that there are sweet spots like if the obstruction isn't in quite the right place you get these", "start": 98.74, "duration": 5.449}, {"text": "Vibrations, but where do these ripples come from? Well for one thing you definitely need laminar flow", "start": 104.71, "duration": 5.93}, {"text": "I've mentioned that a couple of times", "start": 110.649, "duration": 1.371}, {"text": "I've not really said what it is, but imagine this imagine you've got a column of water like we have and", "start": 112.02, "duration": 5.22}, {"text": "It's all streaming downwards, but the water is traveling at different speeds", "start": 117.819, "duration": 3.92}, {"text": "So maybe on the inside the water is traveling more quickly than on the outside and with laminar flow", "start": 121.74, "duration": 6.39}, {"text": "you don't have any interaction between those layers of different speed they just kind of", "start": 128.44, "duration": 5.3}, {"text": "Slide past each other. If water was transferred between those layers of different speeds", "start": 134.349, "duration": 5.99}, {"text": "Then you'd end up with turbulent flow which is like the opposite of laminar flow", "start": 140.34, "duration": 3.72}, {"text": "You can see it really well with the smoke from a candle", "start": 144.13, "duration": 3.289}, {"text": "So to begin with the smoke rises through the still air around it, but doesn't interact with it at all", "start": 147.42, "duration": 6.509}, {"text": "But eventually it catches if you like on the air around it and creates these turbulent", "start": 153.93, "duration": 5.82}, {"text": "Spinning twisting motions. I've done a bit of research and there doesn't seem to be much literature around these ripples above an obstruction", "start": 160.39, "duration": 7.49}, {"text": "But I have found a clue and that cure is the Rayleigh-Plateau", "start": 167.88, "duration": 4.229}, {"text": "Instability which is a fancy name for", "start": 172.81, "duration": 2.0}, {"text": "Something you've probably seen many times before if you turn your tap down until it's just a fine stream eventually", "start": 175.239, "duration": 6.8}, {"text": "You'll see it breaking into droplets and that moment that it breaks into droplets", "start": 182.04, "duration": 4.169}, {"text": "That's Rayleigh-Plateau instability. But the cool thing is if you take a freeze-frame of that happening", "start": 186.73, "duration": 5.509}, {"text": "It looks like this look at those ripples very similar to what we're getting here", "start": 192.239, "duration": 4.11}, {"text": "interesting application of the Rayleigh plateau instability is if you've got a jet of fluid hitting a surface and you want to reduce splash back", "start": 197.17, "duration": 6.949}, {"text": "Simply reduce the distance to the surface until you remove all instability", "start": 204.22, "duration": 5.0}, {"text": "But why is it that you can only see those ripples in freeze-frame you can't see them with the naked eye", "start": 211.18, "duration": 5.0}, {"text": "It's because they're moving around they're moving up and down the stream as time goes on", "start": 216.22, "duration": 3.5}, {"text": "It's too fast for you to see so maybe when you obstruct the flow of the stream", "start": 219.76, "duration": 6.35}, {"text": "You're generating the ripples at that point, but you're fixing them in space somehow", "start": 226.11, "duration": 4.919}, {"text": "I've got a theory for how that might happen", "start": 231.03, "duration": 2.549}, {"text": "But where are the ripples come from in the first place in the Rayleigh-Plateau instability?", "start": 233.579, "duration": 5.22}, {"text": "Well, there is literature on that and it's all to do with surface tension", "start": 238.799, "duration": 4.83}, {"text": "You can think of the surface tension of water as like an elastic property that the water has on its surface. So", "start": 243.63, "duration": 7.139}, {"text": "How's it gonna behave? Well think about an elastic band mean you stretch an elastic band", "start": 251.59, "duration": 3.769}, {"text": "It pulls itself in. An elastic band tries to minimize its length, and it's similar with", "start": 255.359, "duration": 6.809}, {"text": "elastic surfaces, they try to minimize their area and", "start": 262.36, "duration": 3.89}, {"text": "This is also true of soap film", "start": 267.039, "duration": 2.42}, {"text": "so when you blow a bubble it encapsulates a", "start": 269.46, "duration": 3.51}, {"text": "Volume of air and it slowly kind of wobbles into its preferred shape", "start": 273.37, "duration": 4.829}, {"text": "Which of course is a sphere because a sphere is the lowest surface area that can enclose a given volume", "start": 278.199, "duration": 7.05}, {"text": "And it's also why droplets of water", "start": 285.44, "duration": 2.0}, {"text": "Forms spheres, but what does this mean for a column of water like we have here?", "start": 287.84, "duration": 6.38}, {"text": "Well, we can actually model it with soap film", "start": 294.22, "duration": 2.79}, {"text": "How does a cylindrical soap film minimize its surface area? Look as the cylinder grows in height", "start": 297.01, "duration": 6.479}, {"text": "the soap film starts to bow inwards", "start": 303.71, "duration": 2.269}, {"text": "This is always the minimum surface area", "start": 306.11, "duration": 2.9}, {"text": "If it was more pinched to the surface air would be greater", "start": 309.01, "duration": 2.399}, {"text": "if it was less pinched the surface air would be greater as well and as", "start": 311.41, "duration": 3.629}, {"text": "The cylinder grows in height that bowing inwards grows more pronounced", "start": 315.56, "duration": 5.869}, {"text": "Anyway, it gets to the point where it pinches all the way in and it separates into two", "start": 321.62, "duration": 5.329}, {"text": "separate soap films a bit like the formation of a droplet of water", "start": 327.68, "duration": 3.47}, {"text": "How does that apply to a column of water?", "start": 331.789, "duration": 1.711}, {"text": "Like why do the ripples appear in the particular location that they appear and why are they the size that they are?", "start": 333.5, "duration": 7.369}, {"text": "Well the ripples grow from tiny", "start": 341.66, "duration": 3.649}, {"text": "Perturbations in the otherwise very smooth flow of water and they grow like this imagine that you've got some ripples", "start": 345.86, "duration": 7.76}, {"text": "That are kind of sinusoidal", "start": 354.02, "duration": 2.0}, {"text": "so you've got some pinch points and you've got some bulge points like this and here's an interesting fact about", "start": 356.03, "duration": 7.549}, {"text": "elastic surfaces if an", "start": 363.889, "duration": 2.0}, {"text": "Elastic surface is tightly curved. Then the pressure inside will be great", "start": 366.349, "duration": 6.53}, {"text": "whereas if the elastic surface is", "start": 373.639, "duration": 2.75}, {"text": "Loosely curved the pressure inside will be less and you can apply that to these bulges here", "start": 376.9, "duration": 7.06}, {"text": "So look at the neck here, you've got a tightly curved", "start": 383.98, "duration": 3.9}, {"text": "Elastic surface, so the pressure inside is very great. At the bulge, you've got a loosely curved surface", "start": 388.52, "duration": 5.32}, {"text": "So the pressure is less that means that the neck will squeeze water into the bulge and you will have this growing ripple", "start": 393.849, "duration": 7.11}, {"text": "Except it's a little bit more complicated that because the curvature at the pinch points", "start": 401.479, "duration": 6.319}, {"text": "it's actually a saddle point and", "start": 408.019, "duration": 2.15}, {"text": "saddle points are a bit more complicated a good example of", "start": 411.139, "duration": 2.449}, {"text": "Saddle point is a Pringle crisp", "start": 414.169, "duration": 2.059}, {"text": "So you've got a curve going this way and you've got a curve going that way like it like a saddle essentially", "start": 416.229, "duration": 4.919}, {"text": "But look imagine that this is a little section of our pinch point. You've got the inside curve here", "start": 421.149, "duration": 7.38}, {"text": "That's generating pressure inside but then you've got this this is actually a negative curve. It's going the other way", "start": 428.529, "duration": 5.13}, {"text": "So it's reducing the pressure inside the neck. So it's actually not clear who's gonna win the fight", "start": 433.659, "duration": 6.75}, {"text": "Is it the the Bulge that has like both curves of the curve in this direction the curve in this direction?", "start": 440.409, "duration": 5.73}, {"text": "They're both adding to the pressure inside. But look at this curve here. This curve is going the other way", "start": 446.379, "duration": 5.1}, {"text": "It's a negative curvature and it actually reduces the pressure inside", "start": 451.479, "duration": 4.019}, {"text": "So there's a balance between those two effects and it turns out that who wins the fight", "start": 456.139, "duration": 5.51}, {"text": "Depends on the wavelength of the ripples", "start": 462.319, "duration": 3.529}, {"text": "so with those short wavelength ripples that the Bulge is gonna win the fight and they're just going to disappear but with", "start": 465.849, "duration": 7.41}, {"text": "longer curvature ripples where the external curvature is lower", "start": 473.839, "duration": 4.01}, {"text": "Then the the pressure inside the neck is going to win and the pinch point is going to get greater and greater", "start": 478.129, "duration": 7.369}, {"text": "It's those bulges that are going to grow. It's that optimum wavelength that you're ultimately going to see", "start": 485.719, "duration": 6.32}, {"text": "So there's got to be a link between this Rayleigh-Plateau Instability", "start": 494.779, "duration": 2.869}, {"text": "and the ripples that we're seeing when we obstruct the stream of water", "start": 498.079, "duration": 4.22}, {"text": "My thinking is this when you put your finger into the stream", "start": 502.429, "duration": 2.72}, {"text": "you're forcing the water to bow out at that fixed point and it's a bit like a", "start": 505.189, "duration": 6.139}, {"text": "Standing wave in wave mechanics. So you've got a kind of boundary condition", "start": 511.729, "duration": 4.64}, {"text": "so in wave mechanics a boundary condition is when you fix a certain point like on a guitar string one end is fixed as you've", "start": 516.5, "duration": 6.229}, {"text": "Got two boundary conditions. Both ends are fixed and that forces a", "start": 522.729, "duration": 3.299}, {"text": "Standing wave in the vibrations of the guitar string and in a similar sense here", "start": 526.579, "duration": 5.63}, {"text": "you're saying look we're forcing an anti-node", "start": 532.25, "duration": 3.139}, {"text": "At this point and the rest of the wave is gonna grow", "start": 535.85, "duration": 4.55}, {"text": "Upwards from that point like a standing wave on a guitar string. That's my theory anyway.", "start": 540.65, "duration": 4.639}, {"text": "I love investigating these sorts of things just for their own sake really like I'm sure nothing useful will ever come of it", "start": 545.29, "duration": 6.54}, {"text": "but I actually think curiosity for curiosity's sake is important because", "start": 551.83, "duration": 4.139}, {"text": "some of these investigations do turn out to be important like the Rayleigh-Plateau instability is really useful for", "start": 556.73, "duration": 6.83}, {"text": "Making printers work like inkjet printers and all sorts of other applications actually bizarrely", "start": 563.87, "duration": 5.63}, {"text": "Even black holes like some physicists are investigating", "start": 569.96, "duration": 3.5}, {"text": "what black holes look like in the extra dimensions of string theory and", "start": 573.86, "duration": 4.82}, {"text": "they're modeling it as what they call black strings and it seems like these black strings are unstable in a similar way to", "start": 578.9, "duration": 6.919}, {"text": "streams of water and", "start": 585.95, "duration": 2.0}, {"text": "They're gonna break up into like black hole droplets like the Rayleigh-Plateau droplets really interesting stuff", "start": 587.96, "duration": 6.949}, {"text": "This video is sponsored by Squarespace", "start": 594.98, "duration": 2.33}, {"text": "As you know, I'm working with my dad on a project to publish his articles online. He writes these really interesting articles about science", "start": 597.31, "duration": 8.01}, {"text": "And the nature of knowledge and things like that. I really want people to be able to read them", "start": 605.62, "duration": 3.7}, {"text": "So we're putting them online and we're using Squarespace to do it", "start": 609.339, "duration": 3.51}, {"text": "I met with my dad last week and I showed him the interface. I showed him what the website is going to look like", "start": 612.85, "duration": 5.52}, {"text": "He's really happy with it because it looks great", "start": 618.37, "duration": 2.25}, {"text": "I mean", "start": 620.62, "duration": 0.49}, {"text": "you know the templates look really good and you can personalize them and stuff like that and", "start": 621.11, "duration": 4.369}, {"text": "He picked up the interface straight away because it's really easy to use", "start": 625.85, "duration": 3.5}, {"text": "Other things you should know about", "start": 629.87, "duration": 1.83}, {"text": "Squarespace there's never anything to upgrade or", "start": 631.7, "duration": 2.539}, {"text": "Patch or install or anything like that. It's just it's a complete system and it just works. It's an e-commerce platform", "start": 635.06, "duration": 6.2}, {"text": "You can sell stuff if that's what you're thinking of doing", "start": 641.63, "duration": 2.39}, {"text": "You can get your domain name through Squarespace as well and importantly if you do that you own the domain name", "start": 644.69, "duration": 5.479}, {"text": "So it's not like a lock in or anything like that", "start": 650.17, "duration": 1.96}, {"text": "so we'll be doing that when the time comes it's", "start": 652.13, "duration": 3.049}, {"text": "It's going to be a couple of weeks because we're going to sort of pump all the text into into the articles", "start": 655.67, "duration": 5.63}, {"text": "And the images as well. My dad wants to tweak the images a little bit and make them really nice", "start": 661.58, "duration": 5.3}, {"text": "Because at the moment their just Word documents that he knocked up and then we'll go live. It's exciting", "start": 667.46, "duration": 6.08}, {"text": "anyway", "start": 673.68, "duration": 0.31}, {"text": "You should go to squarespace.com today for your free trial and then when you're ready to launch your project go to Squarespace.com/stevemould", "start": 673.99, "duration": 6.239}, {"text": "to get 10% off your first purchase. I hope you enjoyed this video", "start": 680.54, "duration": 4.34}, {"text": "If you did, don't forget to hit subscribe, and I'll see you next time", "start": 684.88, "duration": 3.75}]