[{"text": "So at some point in their lives, nearly everybody has wanted to dig a hole down to the center of the Earth.", "start": 0.346, "duration": 5.32}, {"text": "The only problem is, nobody ever has actually dug a hole down that far.", "start": 5.666, "duration": 4.46}, {"text": "This leads us to the question that this video is all about:", "start": 10.126, "duration": 3.48}, {"text": "If humanity decided that digging a hole was the #1 objective of our species,", "start": 13.606, "duration": 4.92}, {"text": "then how deep down could we actually dig with modern-day technology?", "start": 18.526, "duration": 4.42}, {"text": "Let's say that we start somewhere on the Earth's surface and just start digging from there-", "start": 22.946, "duration": 4.52}, {"text": "-not too far down at 1.8 meters", "start": 27.466, "duration": 2.24}, {"text": "and we arrive at the standard grave depth in Western culture.", "start": 29.706, "duration": 3.42}, {"text": "So if you are afraid of zombies, this is how far down they'll be coming from.", "start": 33.126, "duration": 4.16}, {"text": "4 meters down and we arrive at the depth that pharaoh Tutankhamun's tomb was discovered at.", "start": 37.286, "duration": 5.16}, {"text": "A little further, at six meters below the surface,", "start": 42.446, "duration": 2.1}, {"text": "we've reached the maximum depth that metal detectors can pick up signals from.", "start": 44.546, "duration": 4.44}, {"text": "At 12 meters, we can find the deepest burrows dug by animals - the Nile crocodile.", "start": 48.986, "duration": 5.06}, {"text": "A little further down at 20 metres and we arrive at the depth of the Paris Catacombs beneath the city of Paris -", "start": 54.046, "duration": 6.02}, {"text": "- a tomb that holds the remains of over 6 million people.", "start": 60.066, "duration": 3.2}, {"text": "Double that distance to 40 meters down and we can see the deepest swimming pool in the world.", "start": 63.266, "duration": 5.16}, {"text": "If you drained this pool and jumped into it from the top,", "start": 68.426, "duration": 3.02}, {"text": "it would take nearly 3 seconds before you would hit the bottom.", "start": 71.446, "duration": 3.74}, {"text": "100 meters down is the usual distance that governments bury their nuclear waste at,", "start": 75.186, "duration": 4.38}, {"text": "and just beneath that at 105.5 meters down is the deepest metro station in the world, located in Kiev.", "start": 79.566, "duration": 6.94}, {"text": "Moving on to 122 meters down and we see the deepest known point that a plant's roots have ever reached-", "start": 86.506, "duration": 6.48}, {"text": "- a fig tree in South Africa.", "start": 92.986, "duration": 1.8}, {"text": "220 meters down and we arrive at the deepest river in the world - the Congo River in Africa.", "start": 94.986, "duration": 5.36}, {"text": "Beyond that at 240 meters,", "start": 100.526, "duration": 2.42}, {"text": "you can ride through the deepest railway tunnel in the world that connects the Japanese islands of Honshu and Hokkaido.", "start": 102.946, "duration": 6.14}, {"text": "But at 287 metres down, you can drive through the deepest road tunnel in the world in Norway", "start": 109.086, "duration": 6.16}, {"text": "305 meters down and you would still be vulnerable to the B82 Earth-penetrating nuclear warhead", "start": 115.246, "duration": 5.92}, {"text": "which can destroy structures up to this depth beneath the surface.", "start": 121.166, "duration": 3.44}, {"text": "Incredibly though at 392 meters, we arrive at the deepest well and possibly deepest hole ever dug by hand.", "start": 124.746, "duration": 7.3}, {"text": "This is the Woodingdean Water Well in the UK and it was dug all the way back in 1862.", "start": 132.046, "duration": 5.98}, {"text": "At 603 meters down,we arrived at something terrifying-", "start": 138.086, "duration": 3.94}, {"text": "- the deepest vertical drop inside of a cave.", "start": 142.026, "duration": 2.7}, {"text": "If you were unfortunate enough to be in this cave and fall down this hole,", "start": 144.866, "duration": 4.16}, {"text": "the fall would be higher up than falling from the top of the One World Trade Center in New York", "start": 149.026, "duration": 4.84}, {"text": "and the fall would take you over 11 seconds before hitting the bottom.", "start": 153.866, "duration": 4.34}, {"text": "Even further down though at 700 meters is where the Chilean miners were trapped at for 69 days back in 2010.", "start": 158.246, "duration": 6.78}, {"text": "970 meters down is the deepest hole ever dug that still has an open sky above it -", "start": 165.226, "duration": 6.06}, {"text": "- the Bingham Canyon open pit mine in Utah.", "start": 171.286, "duration": 2.78}, {"text": "This pit is so deep that you could place the tallest building in the entire world in the center", "start": 174.066, "duration": 5.12}, {"text": "and still have over 100 more meters to the surface.", "start": 179.186, "duration": 4.1}, {"text": "Much further down at 1,410 meters though", "start": 183.366, "duration": 3.46}, {"text": "is where the deepest concert ever held happened by the band, 'Agonizer' in Finland", "start": 186.826, "duration": 5.02}, {"text": "1642 meters down is the depth of the deepest lake on Earth-", "start": 191.926, "duration": 5.36}, {"text": "- Lake Baikal in Russia,", "start": 197.286, "duration": 1.58}, {"text": "and 1857 meters down is the deepest part of the Grand Canyon.", "start": 198.866, "duration": 5.2}, {"text": "The deepest known cave on Earth is located 2,197 meters beneath the surface in Georgia", "start": 204.066, "duration": 7.02}, {"text": "but the deepest hole that you could actually fall into goes", "start": 211.086, "duration": 3.5}, {"text": "waaaaay", "start": 214.586, "duration": 0.5}, {"text": "deeper than even this-", "start": 215.086, "duration": 1.74}, {"text": "- All the way down at 3,132 meters is the bottom of the Moab Khotsong mineshaft in South Africa.", "start": 216.826, "duration": 8.32}, {"text": "Taking the elevator takes 4 1/2 minutes to reach the bottom", "start": 225.146, "duration": 3.64}, {"text": "but if you fell into it from the top,", "start": 228.786, "duration": 1.78}, {"text": "it would take you 25 entire seconds for you to hit the bottom and think about what you've just done-", "start": 230.566, "duration": 5.94}, {"text": "- long enough to receive and miss an entire phone call.", "start": 236.506, "duration": 3.82}, {"text": "Even further down at 3,600 meters is the deepest point that a multicellular organism has been found alive-", "start": 240.326, "duration": 7.0}, {"text": "- this freaky looking worm.", "start": 247.326, "duration": 1.92}, {"text": "But human beings themselves have been even deeper than this.", "start": 249.246, "duration": 4.0}, {"text": "4,000 meters down is the deepest part of the deepest mine on Earth, also located in South Africa.", "start": 253.246, "duration": 7.1}, {"text": "The trip from the surface down to the bottom takes over an hour to complete", "start": 260.346, "duration": 4.2}, {"text": "and the temperature at the bottom can reach a sweltering 66 degrees Celsius.", "start": 264.546, "duration": 5.42}, {"text": "6000 meters is the average depth of the oceanic crust beneath the ocean floor.", "start": 269.966, "duration": 4.98}, {"text": "Waaaaay", "start": 274.946, "duration": 0.9}, {"text": "down at 8,848 meters is the height of Mount Everest if it were placed underground instead", "start": 275.846, "duration": 6.6}, {"text": "10,994 meters down is the bottom of the Marianas Trench, which is the deepest part of the ocean.", "start": 282.606, "duration": 7.62}, {"text": "I already covered the depth of the ocean in another video", "start": 290.226, "duration": 3.04}, {"text": "but unbelievably humans have actually dug down significantly deeper than even this.", "start": 293.266, "duration": 5.92}, {"text": "For reference about what's next,", "start": 299.186, "duration": 1.68}, {"text": "11887 meters is the average altitude that a commercial airliner flies at,", "start": 300.966, "duration": 6.42}, {"text": "but deeper than that at 12,262 meters is the depth of the Kola Superdeep Borehole:", "start": 307.386, "duration": 7.02}, {"text": "A project where the Soviet Union attempted to drill all the way through the Earth's crust.", "start": 314.406, "duration": 5.08}, {"text": "They only reached a third of the way there though because the temperature at this depth reached 180 degrees Celsius,", "start": 319.486, "duration": 6.44}, {"text": "which was too hot for the drill to continue operating any further.", "start": 325.926, "duration": 3.68}, {"text": "The hole is also only 23 centimeters wide, so luckily you can't accidentally fall into it.", "start": 329.646, "duration": 6.48}, {"text": "If you dropped a quarter down the shaft though, it would take about 50 seconds before it hit the bottom.", "start": 336.126, "duration": 5.3}, {"text": "Recently, however, this depth has been surpassed by the Z44-Chavyo oil and gas well", "start": 341.546, "duration": 5.88}, {"text": "which has drilled down to a depth of 12,376 meters -", "start": 347.426, "duration": 4.86}, {"text": "- that's the equivalent of stacking 15 Burj Khalifas on top of each other", "start": 352.286, "duration": 4.18}, {"text": "and currently represents the deepest hole that humanity has ever dug.", "start": 356.466, "duration": 4.6}, {"text": "The crust, however, can extend down to 70,000 meters below the Earth's surface", "start": 361.066, "duration": 5.28}, {"text": "and the planets center is located 6,731", "start": 366.346, "duration": 3.64}, {"text": "kilooometers", "start": 369.986, "duration": 1.04}, {"text": "down.", "start": 371.026, "duration": 0.88}, {"text": "If the surface of the Earth is Lisbon, Portugal and the planet's center is Astana, Kazakhstan,", "start": 371.906, "duration": 5.28}, {"text": "then humanity so far has just ventured", "start": 377.186, "duration": 3.0}, {"text": "this", "start": 380.186, "duration": 0.82}, {"text": "tiny", "start": 381.006, "duration": 0.82}, {"text": "insignificant", "start": 381.826, "duration": 1.32}, {"text": "and don't forget to hit the bell for updated videos.", "start": 388.418, "duration": 2.88}, {"text": "You can visit my Patreon by clicking here if you'd like to directly support the channel and vote on future video topics", "start": 391.298, "duration": 5.44}, {"text": "And I hope to see you next Friday for another new video then.", "start": 396.738, "duration": 3.56}]