[{"text": "We've all been there before: you're in love, you think everything's going great and then...", "start": 0.02, "duration": 4.92}, {"text": "Um, we have to break up.", "start": 5.88, "duration": 2.88}, {"text": "Well, you just lost a fan.", "start": 9.74, "duration": 1.96}, {"text": "If you found yourself in this situation, I know how you feel.", "start": 11.8, "duration": 3.14}, {"text": "Sorry", "start": 17.74, "duration": 1.04}, {"text": "You can't eat, you can't sleep, all you can do is cry, think about your ex, what went wrong", "start": 18.789, "duration": 5.03}, {"text": "And why you're such an unlovable piece of shit", "start": 23.82, "duration": 2.219}, {"text": "But listen to me: you're going to be okay. Not now, not anytime soon;", "start": 26.289, "duration": 5.569}, {"text": "but, eventually, and with the help of", "start": 32.16, "duration": 2.399}, {"text": "friends, friends, friends, friends, friends, friends. You need your support network right now more than ever.", "start": 35.02, "duration": 5.509}, {"text": "So call your friends or family and ask them to come over, or just get on the phone to talk or schedule a lunch or", "start": 40.78, "duration": 5.479}, {"text": "dinner or whatever. You're gonna", "start": 46.26, "duration": 1.26}, {"text": "have a lot of free time on your schedule between all the crying and crying that you're doing, and that's when you want to lean", "start": 47.52, "duration": 5.219}, {"text": "on the people who love you; a lot.", "start": 52.739, "duration": 2.19}, {"text": "Because that's an opportunity to process this", "start": 55.27, "duration": 2.09}, {"text": "relationship without all the negative", "start": 57.489, "duration": 1.41}, {"text": "spiraling that you're bound to do in your own time because your support network is gonna say really supportive things that you won't say to", "start": 58.9, "duration": 5.84}, {"text": "yourself. Things like:", "start": 64.74, "duration": 1.48}, {"text": "\"He wasn't right for you.", "start": 66.28, "duration": 1.7}, {"text": "I didn't say anything at the time, but you know we all knew you guys weren't a great match.\"", "start": 67.99, "duration": 4.19}, {"text": "\"You're amazing you're gonna find someone who understands you and appreciates you and wants to work it out.\"", "start": 72.729, "duration": 6.319}, {"text": "\"I love you. I'm so sorry this is happening.\"", "start": 79.049, "duration": 2.85}, {"text": "\"Do you want some tea?\"", "start": 83.2, "duration": 2.0}, {"text": "When you're not leaning on your friends, pick up old or new hobbies. You're gonna", "start": 88.0, "duration": 4.4}, {"text": "have a lot of free time on your hands, as I mentioned, and a very active", "start": 92.4, "duration": 3.569}, {"text": "anxious mind to occupy and I please encourage you to not make drinking, smoking, or any other unhealthy form of escapism a hobby.", "start": 96.16, "duration": 7.669}, {"text": "Because I have done that before and it just prolongs your grieving process gives you a lot of bad tweets.", "start": 104.11, "duration": 5.18}, {"text": "And, you know, just doesn't make you feel very good so pick up something that you love", "start": 109.45, "duration": 4.22}, {"text": "but you haven't tried it in a while, or something that you've always wanted to try. With my blindside breakup,", "start": 113.67, "duration": 4.38}, {"text": "I finally decided, like, I'm gonna try to cope with this in a very healthy way. And, over the last month", "start": 118.05, "duration": 4.83}, {"text": "I read, like, 30 books I spent 40 hours getting reacquainted with drawing and poetry,", "start": 122.88, "duration": 4.829}, {"text": "meditated twice a day for 20 minutes, took a weekly yoga class, journaled a fuck ton, time saw two therapists and a life coach;", "start": 127.99, "duration": 6.8}, {"text": "Yeah, I was, it was a lot.", "start": 135.4, "duration": 1.89}, {"text": "But, that said, I do know that this breakup is gonna be all you think about all the time so try to", "start": 137.29, "duration": 6.409}, {"text": "understand what you're going through.", "start": 144.07, "duration": 1.07}, {"text": "And, if possible, embrace it because chemically, your brain is going through the same withdrawal process as a", "start": 145.14, "duration": 6.99}, {"text": "cocaine addict. This is why it hurts so bad", "start": 152.76, "duration": 3.5}, {"text": "*aaaahhhAaaaaAHAHAhhAAAA*", "start": 156.26, "duration": 3.84}, {"text": "Oh God, oh", "start": 160.1, "duration": 1.9}, {"text": "Grieving and crying", "start": 162.0, "duration": 1.53}, {"text": "suck ass, but they're a very natural part of the process. And I know this is not what anyone wants to hear right now,", "start": 163.53, "duration": 6.43}, {"text": "it's not what I wanted to hear, but try to take this opportunity as", "start": 169.97, "duration": 3.72}, {"text": "something good to transform yourself.", "start": 174.21, "duration": 1.89}, {"text": "You know, my friend told me to, like, try to make this breakup the best thing that ever happened to me.", "start": 176.1, "duration": 4.61}, {"text": "And, I know, you like hate them for saying it,", "start": 180.71, "duration": 1.98}, {"text": "but at the same time if you try to work towards making that statement true", "start": 182.69, "duration": 3.51}, {"text": "you take a lot of actions in your life that are really healthy and good for you, because you get to choose how to", "start": 186.3, "duration": 5.27}, {"text": "handle this breakup, and how you're gonna transform from it.", "start": 191.57, "duration": 2.58}, {"text": "So, are you gonna be a victim and be like really sad? Longer than necessary, because grieving is important;", "start": 194.15, "duration": 4.709}, {"text": "Or, are you gonna get the best revenge", "start": 198.86, "duration": 2.0}, {"text": "possible by just leveling the fuck up as a person and really empowering yourself and being the most successful greatest version of yourself possible?", "start": 200.88, "duration": 7.369}, {"text": "I'm Anna Akana. I'm very sorry that you're hurting and also if you do not know Dodie. Please check her out", "start": 208.98, "duration": 5.75}, {"text": "She's an amazing singer/songwriter and an advocate of mental health awareness", "start": 214.73, "duration": 3.269}, {"text": "Her book is really great for those of you who have depression. It helped me a lot, and also helped me with my breakup.", "start": 218.43, "duration": 5.449}, {"text": "She's just fantastic, and if you need a good cry listen to her song '6/10.'", "start": 223.95, "duration": 4.19}, {"text": "which I love. All right, stay right here for a sponsored message. *in a sad voice* I wanna say thank you to Squarespace for sponsoring today's episode.", "start": 228.14, "duration": 7.199}, {"text": "Squarespace offers beautiful award-winning templates not to mention an all-in-one platform,", "start": 236.28, "duration": 4.22}, {"text": "so there's like no installs, patches, or upgrades ever.", "start": 241.05, "duration": 3.62}, {"text": "They also have 24-hour customer service if you're, like, really sad in the middle of the night", "start": 245.43, "duration": 4.939}, {"text": "and you just need someone to talk to you, and they offer a simple and unique setup experience if you don't have a domain.", "start": 250.37, "duration": 6.779}, {"text": "I don't have a domain.", "start": 258.329, "duration": 1.18}, {"text": "They're gonna for any kind of website: like if you're an artist or photographer,", "start": 259.509, "duration": 3.86}, {"text": "you're looking for the love of your life, still like maybe they're still out there", "start": 263.77, "duration": 3.109}, {"text": "I hope they really are. You can go to Squarespace.com and start your free trial today.", "start": 266.879, "duration": 5.25}, {"text": "And you can use the offer code anna up for 10% off at checkout.", "start": 273.099, "duration": 2.33}]