[{"text": "Linus: It's finally here!", "start": 0.3, "duration": 1.92}, {"text": "We have all the pieces we need to put together our iMac pro.", "start": 2.56, "duration": 5.38}, {"text": "We've got a new iMac Pro 5k display,", "start": 7.94, "duration": 2.88}, {"text": "We've got a new logic board, complete with CPU and RAM (that are by the way socketed and not soldered on so)", "start": 11.34, "duration": 7.7}, {"text": "Yeah, we covered that in part two and we have the one and only Louis Rossmann!", "start": 20.08, "duration": 4.16}, {"text": "from Rossmann group", "start": 25.3, "duration": 1.62}, {"text": "Louis: Time to learn how to put together an iMac and as I say", "start": 26.92, "duration": 2.75}, {"text": "You should never learn on your own stuff always learn on somebody else's wait no you're supposed to learn on your own", "start": 29.67, "duration": 3.96}, {"text": "Is that how this goes?", "start": 33.63, "duration": 0.91}, {"text": "Linus: Who like me has never actually assembled and iMac Pro.", "start": 34.54, "duration": 6.56}, {"text": "So let's have some fun today, shall we?", "start": 41.18, "duration": 1.92}, {"text": "Sponsored of course by Mr. Rossmann's favorite tool company, iFixit!", "start": 44.53, "duration": 4.99}, {"text": "Louis: Their screwdrivers have a very nice personality", "start": 49.52, "duration": 1.84}, {"text": "iFixit is your one-stop shop for repair tools and guides for pretty much everything under the sun!", "start": 51.36, "duration": 5.189}, {"text": "You can check out the link to their Pro Tech tool kit in the video description", "start": 56.55, "duration": 2.61}, {"text": "So Anthony's laid everything out for us, pretty much.", "start": 67.8, "duration": 3.14}, {"text": "We've got our Fan component of the thermal solution.", "start": 70.94, "duration": 3.44}, {"text": "We've got all the picks and adhesive strips and everything that we should need", "start": 74.38, "duration": 3.62}, {"text": "We've got their little prop up thing for the doodad here that goes in there", "start": 78.05, "duration": 5.159}, {"text": "And then of course, is this your first time seeing an iMac Pro logic board in person?", "start": 83.42, "duration": 4.83}, {"text": "Louis: This is my first time.", "start": 88.25, "duration": 1.57}, {"text": "Linus: So why don't you kind of walk us through some of the things that are more and/or less obvious?", "start": 89.92, "duration": 5.22}, {"text": "I mean I actually have one right off the bat here", "start": 95.15, "duration": 2.89}, {"text": "Louis: Somebody's getting fired because the RAM is not soldered to the board", "start": 98.04, "duration": 2.04}, {"text": "Linus: for some reason apple's gone with this weirdo", "start": 100.08, "duration": 2.26}, {"text": "Configuration with five DRAM chips per side. So normally you would have four or eight and the the fifth one is for ECC", "start": 102.52, "duration": 7.72}, {"text": "That's error checking and that's a feature of the Xeon W processor that's in there", "start": 110.24, "duration": 4.23}, {"text": "But why wouldn't they just put all of them on the one side?", "start": 114.47, "duration": 3.0}, {"text": "Why would they do a dual sided DIMM for this?", "start": 117.47, "duration": 2.55}, {"text": "Louis: Maybe to get more on a single DIMM?", "start": 120.02, "duration": 1.53}, {"text": "Linus: These are just eight gig DIMMs", "start": 121.55, "duration": 1.2}, {"text": "Louis: Maybe they planned on it", "start": 122.75, "duration": 1.229}, {"text": "But then that person got fired because may using too much memory would result in a not not efficient power usage. Wait", "start": 123.979, "duration": 5.46}, {"text": "No, that was the excuse they used in the resin.", "start": 129.44, "duration": 1.48}, {"text": "Linus: I mean a lot of people have asked like why they might have gone with", "start": 130.92, "duration": 3.46}, {"text": "socketed memory rather than soldering the memory on because we all know that apples sort of MO here is", "start": 135.02, "duration": 5.76}, {"text": "Making as few components on the board", "start": 140.78, "duration": 1.98}, {"text": "Upgradable by the end user as possible", "start": 143.25, "duration": 1.85}, {"text": "Louis: and the CPU is socketed, too", "start": 145.1, "duration": 0.69}, {"text": "That's another person that's gonna get fired.", "start": 146.31, "duration": 1.89}, {"text": "Linus: So I figured it out", "start": 148.2, "duration": 1.069}, {"text": "Someone at Apple was just like, you know", "start": 149.97, "duration": 3.049}, {"text": "What if we want to deliver enough configurations without spending a bunch of money for the sole purpose of making things?", "start": 153.019, "duration": 6.96}, {"text": "less upgradable for the user", "start": 160.32, "duration": 2.0}, {"text": "Sockets make a lot of sense", "start": 162.6, "duration": 2.0}, {"text": "More than idea Apple", "start": 164.61, "duration": 1.99}, {"text": "Louis: And if the processor fails you don't have to buy a new board and what's the cost of that board?", "start": 166.6, "duration": 2.64}, {"text": "Linus: except you do!", "start": 169.24, "duration": 1.04}, {"text": "You do know it Apple only sells the logic board as a complete unit", "start": 171.06, "duration": 6.08}, {"text": "Louis: What?", "start": 177.14, "duration": 0.838}, {"text": "Linus: with the CPU and the RAM already in it?", "start": 177.98, "duration": 3.44}, {"text": "Louis: What if you only have a bad CPU?", "start": 181.42, "duration": 1.64}, {"text": "Linus: because even though their socketed they still treat it like a single unit!", "start": 183.06, "duration": 4.22}, {"text": "Louis: So what happens if you have a bad RAM stick?", "start": 187.28, "duration": 2.04}, {"text": "Okay that one I don't know", "start": 189.32, "duration": 1.479}, {"text": "But I know that when we had to buy the new logic board", "start": 190.799, "duration": 2.84}, {"text": "We had to send back our CPU and RAM if we wanted to qualify for replacement", "start": 193.64, "duration": 4.469}, {"text": "Which there's still a chance?", "start": 198.25, "duration": 1.8}, {"text": "I heard from our contact who got us this so there's still a chance we can get replacement pricing on it", "start": 200.05, "duration": 4.889}, {"text": "Louis: So you have to send back everything and if you don't send back everything you don't get replacement pricing", "start": 204.94, "duration": 3.6}, {"text": "But you get charged twice the actual price of it", "start": 208.54, "duration": 1.65}, {"text": "Which is ready four times the price that it should cost at any other computer. Yes. Well", "start": 210.19, "duration": 3.77}, {"text": "Go apple", "start": 214.46, "duration": 0.92}, {"text": "So those are standard SSDs, you could buy a new egg, right", "start": 215.5, "duration": 2.88}, {"text": "Linus: I mean in their defense their SSDs do perform pretty well, so I'll give them that but a lot of people asked us", "start": 218.38, "duration": 5.3}, {"text": "Why were you guys opening up an IMac pro in the first place? It's not meant to be opened", "start": 224.24, "duration": 3.94}, {"text": "The reason we were opening it was because we wanted to shed some light on the cooling", "start": 228.26, "duration": 4.25}, {"text": "solution that Apple is using for up to an 18 core processor and a Vegas 64 GPU just", "start": 232.61, "duration": 6.5}, {"text": "looking at it tells us everything we need to know about how much this sucker is gonna thermal throttle and in order for us to", "start": 239.36, "duration": 6.559}, {"text": "take our thermal throttling results and", "start": 245.92, "duration": 2.74}, {"text": "Sanity check them", "start": 248.92, "duration": 1.02}, {"text": "This is why we were opening it", "start": 249.94, "duration": 2.74}, {"text": "because we're a review channel and we know that opening up the product is not something that everyone's gonna do", "start": 252.68, "duration": 5.44}, {"text": "But this is a pro product in a professional environment where you you might actually have", "start": 258.38, "duration": 5.58}, {"text": "technicians on staff", "start": 264.54, "duration": 1.76}, {"text": "To help people through both software and hardware issues. It is my expectation", "start": 266.3, "duration": 5.18}, {"text": "that you would be able to use their service a", "start": 271.7, "duration": 2.5}, {"text": "Professional machine and you would be able to get the parts that you need. Is that an unreasonable thing?", "start": 274.64, "duration": 4.009}, {"text": "Louis: I think it's very unreasonable that you expect that", "start": 278.65, "duration": 2.279}, {"text": "You should be able to clean the dust out of it three years from now and it's filled with junk and runs 30 Celsius hotter", "start": 280.93, "duration": 3.929}, {"text": "When they say that you're not supposed to open it. It's not designed to be opened", "start": 285.14, "duration": 3.619}, {"text": "I can understand that to an extent, but wouldn't you want to open it so that you can clean it three years from now", "start": 288.76, "duration": 3.809}, {"text": "There's so many of these old machines they wind up dying when the graphics chip start running 20 and 30 Celsius hotter and this design", "start": 292.58, "duration": 5.929}, {"text": "If you blow compress there and there it's just going to wind up blowing the dust around the machine.", "start": 298.6, "duration": 5.36}, {"text": "Linus: Well yeah Oh here here", "start": 303.96, "duration": 0.78}, {"text": "What we can do is we can kind of we can kind of line this up and this is something that's very", "start": 304.75, "duration": 3.0}, {"text": "Difficult to do if you don't actually open it up and have a look at it", "start": 307.88, "duration": 3.109}, {"text": "So if you were to blow dust or if you were to blow air through through this very thoughtfully designed baffle here", "start": 310.99, "duration": 6.809}, {"text": "So that you don't get as much noise from the fan I guess", "start": 317.8, "duration": 2.82}, {"text": "Which is neat", "start": 320.72, "duration": 0.76}, {"text": "Louis: if you open any of these that are more than three years old", "start": 321.48, "duration": 1.699}, {"text": "I would be surprised that the fan even spins just based on how much dust they're in here after a few years", "start": 323.18, "duration": 3.839}, {"text": "So you would want to open it just to be able to blow it out and you can't do that in this machine", "start": 327.06, "duration": 3.529}, {"text": "So it makes sense that somebody would want to open this", "start": 330.589, "duration": 2.451}, {"text": "and if not now than a few years from now if they want it", "start": 333.04, "duration": 1.84}, {"text": "To last at least and Apple wants it to last right?", "start": 334.88, "duration": 2.1}, {"text": "Linus: Is there anything about this main board that should, that makes it special it does have a GPU built right into it", "start": 337.89, "duration": 6.739}, {"text": "Which is either a feature or a drawback depending on how you look at it?", "start": 344.63, "duration": 4.17}, {"text": "Louis: That's a good board It has to some extent it has four Thunderbolt ports four USB ports Ethernet", "start": 348.8, "duration": 3.9}, {"text": "Linus: 10 Gig LAN", "start": 352.7, "duration": 0.56}, {"text": "Louis: It does use the same USB C muxing that the touch bars did and I remember with the touch bars when I tried to use", "start": 353.27, "duration": 5.339}, {"text": "A third-party dongle rather than the original Apple dongle. It didn't work and the original Apple dongle was like 80 bucks", "start": 358.61, "duration": 5.1}, {"text": "Lunis: I mean this appliance your chip said to buy a card with this on it is about a hundred bucks", "start": 363.71, "duration": 4.17}, {"text": "I can understand how if it comes with a graphics card and it's specifically", "start": 367.88, "duration": 3.63}, {"text": "Custom-designed for this machine like I could see how this board would cost", "start": 371.64, "duration": 2.359}, {"text": "Yeah, like I would say this is a solid 800 $900 board", "start": 374.16, "duration": 3.019}, {"text": "Okay, cool", "start": 377.18, "duration": 1.02}, {"text": "But not $4,000 what that's how much the non replacement pricing is", "start": 378.2, "duration": 4.049}, {"text": "If you break the the warranty void if removed seals on it and when we priced out the iMac Pro", "start": 382.25, "duration": 5.279}, {"text": "We actually found that compared to a an apples-to-apples", "start": 387.57, "duration": 2.989}, {"text": "PC with is neon W like trying to get feature and performance parity. It was actually pretty darn similar", "start": 392.82, "duration": 6.559}, {"text": "So it's only when you want to try to get a replacement part and you don't have the untouched by", "start": 399.38, "duration": 6.119}, {"text": "Non-authorized technicians like yourself pricing that you really get owned rammed. Yeah", "start": 406.169, "duration": 6.14}, {"text": "I didn't think I'd bring this guy on and he'd be one toning my language down the entire machine", "start": 416.7, "duration": 5.569}, {"text": "It's not", "start": 422.27, "duration": 0.55}, {"text": "Necessarily that much of a ripoff considering the form factor that you get in it and when you do actually price it with a display", "start": 422.82, "duration": 4.849}, {"text": "That's for a PC. That would be equal. It actually isn't the terrible deal spec wise", "start": 427.669, "duration": 3.57}, {"text": "It's just if you ever have anything go wrong with it ever then you're really screwed", "start": 431.24, "duration": 4.32}, {"text": "I do think that Apple could do more to design things", "start": 435.56, "duration": 3.45}, {"text": "Not to fail and when you look at this cooling solution the inability to clean out the dust", "start": 439.41, "duration": 4.819}, {"text": "we look at the 500 watt power supply like this to me is common sense stuff when I", "start": 444.229, "duration": 4.95}, {"text": "Initially set out to build a computer. There's a whole freaking a lot to it these days", "start": 449.4, "duration": 5.149}, {"text": "It's like putting together Lego you got your form factor", "start": 454.55, "duration": 2.88}, {"text": "Which Apple does a great job of you got your acoustics and you got your thermals that's step one of building a computer", "start": 457.43, "duration": 7.44}, {"text": "Make sure that it's not going to overheat and it's not going to be super loud", "start": 464.87, "duration": 3.029}, {"text": "Oh and don't use a crappy power supply so that it doesn't blow up in two years", "start": 467.9, "duration": 3.209}, {"text": "I'm just surprised by the heatsink because I know that in many of their machines they focus on it being quiet", "start": 471.27, "duration": 4.399}, {"text": "Which is a good thing", "start": 475.669, "duration": 0.75}, {"text": "They wanted that machine to not make noise. But if you want it to not make noise you would want a larger heatsink", "start": 476.419, "duration": 4.71}, {"text": "Not a smaller one and what they've done with a lot of the newer machines. They took the", "start": 481.13, "duration": 2.669}, {"text": "2013/14 design which is actually a really nice design except the fan just doesn't turn on for another 20 C. Okay", "start": 484.44, "duration": 4.91}, {"text": "So should we get started then they get to figure out that I don't know how it goes together", "start": 489.57, "duration": 3.949}, {"text": "yeah, I know now now neither of us looks like", "start": 493.52, "duration": 2.58}, {"text": "An expert. Yeah, I know. So I've done I've done an iMac", "start": 496.77, "duration": 3.2}, {"text": "5k but I've never done an iMac Pro like in terms of disassembly and reassembly. Have you done an iMac? 5k? No. Oh, really?", "start": 500.52, "duration": 6.86}, {"text": "It's time I reassembled on iMac was 2012 or 13th", "start": 507.38, "duration": 2.669}, {"text": "Most of what we do is liquid damage repairs, but you got to be pretty special to spill water on here", "start": 510.05, "duration": 4.919}, {"text": "Yeah, like water typically goes down not beside this. You'd have to be drinking water over a bare board sitting on a table and", "start": 515.12, "duration": 6.27}, {"text": "It into your iMac", "start": 522.089, "duration": 1.83}, {"text": "Or someone has to say something really funny", "start": 523.919, "duration": 2.119}, {"text": "You have one thing that sucks with this form factor", "start": 526.04, "duration": 1.83}, {"text": "At least for the older ones is that if you want to replace the hard drive", "start": 527.87, "duration": 2.669}, {"text": "You have to remove the screen to get to the drive and the screen cable is short", "start": 530.54, "duration": 3.75}, {"text": "So when people take the screen out, they don't realize that they have to hold the screen on their chest. They don't do that", "start": 534.29, "duration": 4.98}, {"text": "They just take the screen out like this. They wind up ripping the screen connector right off the board", "start": 539.27, "duration": 3.75}, {"text": "Okay, so do we want to put this? No, you know, I mean, no just the opposite should be. Okay, right?", "start": 543.02, "duration": 4.769}, {"text": "Well, hold on a second, cuz we've got we've got brackets in here called like Wi-Fi and stuff", "start": 547.86, "duration": 4.91}, {"text": "So I want to make sure that we're that's this has Ethernet though, right? That's one thing that I have to say", "start": 552.77, "duration": 4.739}, {"text": "I love about Apple they're wireless", "start": 557.51, "duration": 2.399}, {"text": "it's just", "start": 560.459, "duration": 2.0}, {"text": "They're the only ones that I'm aware of that do a 3x3 by in", "start": 562.6, "duration": 3.38}, {"text": "In a notebook because everyone else is using the mini pcie", "start": 566.5, "duration": 3.289}, {"text": "Standard that is just not physically large enough to do a three by so this looks like some kind of sense 4G power supply", "start": 569.889, "duration": 7.01}, {"text": "I guess okay, so hold on. We've probably got two got to put this put this lead in. Oh, okay", "start": 576.899, "duration": 5.04}, {"text": "That one comes around as well. Hmm, okay", "start": 581.94, "duration": 2.399}, {"text": "This guy's blocking you hold on hold on", "start": 588.16, "duration": 2.299}, {"text": "Oh that's lifting up some kind of cover that probably serves some kind of purpose here. Hold on. Okay, it covers coils", "start": 590.519, "duration": 6.69}, {"text": "Yeah covers things that you shouldn't touch", "start": 597.25, "duration": 2.209}, {"text": "I guess this if I can kind of guide you in here stay up cables you really go", "start": 599.459, "duration": 5.309}, {"text": "Ham like it's funny cuz I get a lot of flack for just kind of like going for it with stuff", "start": 604.769, "duration": 4.83}, {"text": "Oh, yeah, but as far as we know this board works, so please do be very careful good", "start": 609.6, "duration": 4.2}, {"text": "No pressure", "start": 614.41, "duration": 1.89}, {"text": "Why did I fly in from here to do this for me? So I could learn there we go", "start": 616.3, "duration": 5.719}, {"text": "Now we're now we're getting in there. Huh? There we go. Not a Bing. Okay. All right, so it's like being a dentist", "start": 622.05, "duration": 6.479}, {"text": "that's like say", "start": 628.529, "duration": 1.511}, {"text": "Yes, say yeah", "start": 630.04, "duration": 2.0}, {"text": "Yeah, okay do we want to screw it in first", "start": 632.74, "duration": 2.45}, {"text": "Maybe I know we wanted to see if it works before you screw it in", "start": 635.23, "duration": 3.409}, {"text": "It's bad luck to screw it in before you see if it works", "start": 638.639, "duration": 2.0}, {"text": "So my thing is I don't close the panel first, but I I'm willing to screw in a board", "start": 640.72, "duration": 5.33}, {"text": "I'll put in at least a couple screws cuz I don't like I don't like motherboard sliding around on standoffs", "start": 646.05, "duration": 5.039}, {"text": "Oh, yeah, can I put in two screws? Okay, okay", "start": 651.089, "duration": 3.299}, {"text": "Stressing out here", "start": 657.67, "duration": 1.349}, {"text": "one thing about working on a PC like this that legitimately", "start": 659.019, "duration": 3.799}, {"text": "Should require certification and legitimately is dangerous for the average person is the fact that it has exposed", "start": 663.279, "duration": 6.77}, {"text": "Things on the capacitors on their power supplies. No, there's no no. No, there's nothing that goes on here. It's just like this", "start": 670.54, "duration": 6.32}, {"text": "That is extremely dangerous", "start": 677.43, "duration": 1.56}, {"text": "You could die. This this is nothing. This is no tongue-in-cheek. Haha, Apple or anything like that. Just I've never actually seen", "start": 678.99, "duration": 7.229}, {"text": "Another finished goods product like this with an exposed power supply like that", "start": 686.769, "duration": 5.03}, {"text": "And as far as I can tell the only reason they've done it is so that they can use the cooler unit here", "start": 691.8, "duration": 5.849}, {"text": "To cool the power supply", "start": 697.989, "duration": 1.77}, {"text": "Without having its own fan which would because of the thin form factor be quite small and therefore", "start": 699.759, "duration": 4.52}, {"text": "whining", "start": 704.349, "duration": 0.5}, {"text": "I'm surprised they didn't put at least some sort of cage over it but happened to be grounded so that if the somebody was going", "start": 704.849, "duration": 4.77}, {"text": "Into let's say clean their fan. They don't do that", "start": 709.619, "duration": 1.71}, {"text": "This is one of those things where I like to joke in my videos", "start": 711.329, "duration": 2.219}, {"text": "But I would not want to touch that and there is a good chance of somebody opening this and actually hurting themselves", "start": 713.549, "duration": 5.19}, {"text": "Even if it's unplugged because those two capacitors will stay charged for a long time after a long time sometimes months or even years", "start": 718.739, "duration": 5.91}, {"text": "You don't mess around with that stuff now actually on the subject of these things being exposed", "start": 725.049, "duration": 5.45}, {"text": "a lot of people have asked us what exactly", "start": 730.499, "duration": 2.34}, {"text": "happened because the way that we showed our iMac pro failure was in the form of like a", "start": 733.329, "duration": 5.869}, {"text": "Reenactment because obviously the camera wasn't rolling while we well we dropped the display", "start": 739.359, "duration": 4.58}, {"text": "Yeah, those sparks those master after-effects drawn sparks. Very real", "start": 744.849, "duration": 4.13}, {"text": "I know we deceived everyone believed in you up. So what actually happened was", "start": 749.739, "duration": 5.72}, {"text": "when Anthony was removing the display he bridged something in here and it caused a spark which", "start": 756.069, "duration": 7.19}, {"text": "Startled him and caused him to drop the display. That was what actually happened. And because the spark was on the motherboard", "start": 763.659, "duration": 6.65}, {"text": "that's why from the very", "start": 770.559, "duration": 2.0}, {"text": "Beginning we have deceived. No one we knew we definitely had a broken display, but we knew we also", "start": 772.629, "duration": 7.159}, {"text": "Possibly had a dead motherboard and therefore by extension a dead power supply. Actually the spark was off the power supply wasn't it?", "start": 780.429, "duration": 6.83}, {"text": "So, you know", "start": 787.599, "duration": 0.92}, {"text": "what's funny a", "start": 788.519, "duration": 0.97}, {"text": "shield would have prevented all of this a shield would prevent about how interesting so sorry the spark on the power supply so", "start": 789.489, "duration": 4.88}, {"text": "You know when you short out a power supply you can kind of kill almost anything downstream and because on this particular machine the power", "start": 794.369, "duration": 6.929}, {"text": "For everything runs through the motherboard. It was probably gonna burn something on the motherboard before it carried through to something else", "start": 801.299, "duration": 5.79}, {"text": "So that was where our conclusion came from we knew we definitely had a dead screen because it was cracked", "start": 807.089, "duration": 4.649}, {"text": "We knew that we potentially had a dead power supply and a dead motherboard", "start": 811.889, "duration": 3.599}, {"text": "but that our other components probably worked with that said I've seen a lot of", "start": 815.489, "duration": 5.789}, {"text": "Shorts occur in my day that have not resulted in dead hardware or I've seen them partially fail", "start": 821.679, "duration": 5.75}, {"text": "Like oh well now that USB port doesn't work anymore", "start": 827.97, "duration": 2.789}, {"text": "Yeah, if you send 12 volts to the five volt rail, your machine's dead if you send 12 volts to ground", "start": 830.759, "duration": 4.41}, {"text": "You just saw a big spark, but it's nothing that's gonna actually kill it Wow, you know those viewers are right. This is really complicated", "start": 835.17, "duration": 7.26}, {"text": "Because I mean the whole thing like oh, these are it's like a supercar you saw those comments, right?", "start": 843.009, "duration": 4.76}, {"text": "It's not designed to be you know", "start": 847.769, "duration": 2.01}, {"text": "Taken apart and put together and I'm kind of like well then how does Apple?", "start": 849.779, "duration": 2.94}, {"text": "You know take it apart and put it together because they can they just wouldn't we're good", "start": 853.149, "duration": 4.58}, {"text": "So here's another thing that would definitely require training", "start": 857.73, "duration": 3.359}, {"text": "the screws for the power supply and for just generally mounting the motherboard are", "start": 861.79, "duration": 5.779}, {"text": "Threaded the same as far as I can tell, but they should not be confused", "start": 868.209, "duration": 3.5}, {"text": "Because the power supply ones have these washers on them and they are actually designed we were talking about this off-camera", "start": 872.139, "duration": 5.72}, {"text": "How does the power supply connect to the motherboard? It's actually through screw screw connections here", "start": 877.93, "duration": 6.169}, {"text": "so these ones with the little", "start": 884.319, "duration": 2.0}, {"text": "kind of", "start": 886.509, "duration": 0.901}, {"text": "mark", "start": 887.41, "duration": 0.69}, {"text": "next to them", "start": 888.1, "duration": 0.839}, {"text": "That looks like it's a little oval shaped mark those ones use the silver screws and then everything else uses the black ones", "start": 888.939, "duration": 6.14}, {"text": "That is a bit of a trick and you would need to be very careful with something like that. Oh", "start": 895.24, "duration": 4.25}, {"text": "Not that one, please do", "start": 902.139, "duration": 2.0}, {"text": "that moment when you bring in like a celebrity repair technician", "start": 904.629, "duration": 3.83}, {"text": "And it turns out maybe you should have gotten a real repair technician, you know, yeah in all seriousness though", "start": 908.559, "duration": 5.24}, {"text": "This is not very difficult as it just takes about five minutes", "start": 914.05, "duration": 2.719}, {"text": "should an", "start": 917.47, "duration": 1.44}, {"text": "Apple Authorized service provider like is there any", "start": 918.91, "duration": 2.63}, {"text": "justifiable reason why they shouldn't be able to just stock replacement parts for an operation like this and be able to", "start": 922.0, "duration": 6.349}, {"text": "Turn a board swap around for a customer in a day", "start": 928.689, "duration": 2.75}, {"text": "the reason that they don't want them to have parts in stock is because they're afraid of them ending up on the open market or", "start": 931.439, "duration": 4.5}, {"text": "On eBay or being result like that data recovery tool that I had bought for the new touch bar MacBooks", "start": 935.939, "duration": 4.68}, {"text": "I got it from some likely authorized service center that was selling all of them on the side the downside of it", "start": 940.62, "duration": 5.13}, {"text": "Is that if the parts are not stocked the customer has to wait one to three weeks to get it in if you tell somebody", "start": 945.75, "duration": 4.859}, {"text": "It's going to take longer than 2 to 5 days. They just walk out of the store. This is an entirely different story", "start": 950.61, "duration": 4.469}, {"text": "Imagine for a second that I'm not some youtuber also a celebrity tech", "start": 955.389, "duration": 4.49}, {"text": "You know imagine that I bought this $5,000 machine so that I could run my you know home graphic design business", "start": 960.43, "duration": 6.989}, {"text": "Imagine that someone told me this is gonna cost more to repair", "start": 968.06, "duration": 2.929}, {"text": "Than I initially spent on it. How does that make any sense?", "start": 971.899, "duration": 2.809}, {"text": "The thing that made me most furious was the people", "start": 974.81, "duration": 3.44}, {"text": "Acting like that argument made any sense that a machine could be a total write-off", "start": 978.62, "duration": 4.519}, {"text": "When not every component of it was dead and no broadcast", "start": 983.449, "duration": 3.86}, {"text": "Facility is going to allow that any sort of recording studio any sort of video or news editing room", "start": 987.829, "duration": 4.489}, {"text": "They expect that there be virtually no downtime", "start": 992.319, "duration": 2.22}, {"text": "They're gonna have a machine to swap in a place and they expect to be able to repair this because they're using it for real", "start": 994.54, "duration": 4.409}, {"text": "Work not to mention for a reasonable price", "start": 998.949, "duration": 2.22}, {"text": "I expect when I buy a replacement piece of something whether it's a car or a vacuum cleaner that if I were to buy", "start": 1001.18, "duration": 7.969}, {"text": "every piece of it and", "start": 1009.759, "duration": 2.0}, {"text": "Assemble it myself", "start": 1011.98, "duration": 1.31}, {"text": "it should cost a little bit more, but I don't expect that if I were to buy all the pieces as", "start": 1013.29, "duration": 5.13}, {"text": "Replacement parts that the machine would cost literally double even if I'm putting it together myself, that doesn't make any sense", "start": 1018.61, "duration": 6.17}, {"text": "anyone making the argument that Apple can't sell it to me for", "start": 1025.36, "duration": 3.319}, {"text": "For cheaper because they've got to make money their business is clearly not doing the math because if Apple couldn't afford to sell me this", "start": 1028.809, "duration": 6.71}, {"text": "Board for around $1,000 then they couldn't afford to build this computer. I think I do stone this one", "start": 1035.52, "duration": 7.139}, {"text": "So the the Wi-Fi thing is also a little bit tricky", "start": 1042.659, "duration": 2.52}, {"text": "You've got to slide it into four little notches on these shields right here SD card area thing", "start": 1045.179, "duration": 4.229}, {"text": "The card reader is over here somewhere. So it's over here somewhere. Oh, it's to hold down that new deaden", "start": 1049.409, "duration": 5.07}, {"text": "okay, let's not turn this into a competition of which of us has done worse because that's not gonna be that's not", "start": 1055.6, "duration": 5.93}, {"text": "We were talking about credibility earlier, you know, that's not gonna help either", "start": 1063.28, "duration": 3.529}, {"text": "Well, the thing is sometimes I'll have I'll read out the letter that somebody sent in with their machine. So they'll know", "start": 1066.809, "duration": 5.849}, {"text": "Ok, he's working on mine", "start": 1072.659, "duration": 1.411}, {"text": "And then when I'm streaming it, they'll see like me saying okay, this is just for Thunderbolt", "start": 1074.07, "duration": 3.719}, {"text": "but screw this", "start": 1077.789, "duration": 0.64}, {"text": "Let us take the saddle and go wink wink wink, and then he'll get a call later saying, excuse me", "start": 1078.429, "duration": 4.55}, {"text": "Was that my machine that he just ripped the Thunderbolt USB and Wi-Fi circuitry off and then I'll have to explain to him", "start": 1082.98, "duration": 4.469}, {"text": "No, he's joking", "start": 1087.48, "duration": 1.199}, {"text": "He's gonna put that back when you get and then I'll like walk over to me and say did you stream?", "start": 1088.679, "duration": 4.95}, {"text": "Knocking all that stuff over", "start": 1093.94, "duration": 2.0}, {"text": "You watch these videos before you sent it to you you must have been expected like, you know what you're getting", "start": 1097.51, "duration": 4.16}, {"text": "It's not like it's false advertising", "start": 1101.67, "duration": 1.9}, {"text": "So this is like me and my wife like I'll make some sort of like really offensive off-color joke, and I'm just like, hon", "start": 1103.57, "duration": 6.349}, {"text": "I mean we were dating for", "start": 1109.92, "duration": 1.87}, {"text": "Six or seven years before we got married. You knew what you knew. Yes", "start": 1111.79, "duration": 3.859}, {"text": "Video when people watch the live streams of their stuff getting fixed I can only imagine how stressful that is because of the show that", "start": 1117.43, "duration": 5.449}, {"text": "I put on for what you're saying everything you see on TV is not you know an accurate reflection of real life", "start": 1122.88, "duration": 6.93}, {"text": "You put on a show. No way. I", "start": 1130.48, "duration": 2.27}, {"text": "Think the real takeaway here is that if we can handle this apples store probably could have handled. All right", "start": 1133.27, "duration": 5.9}, {"text": "Let's see if we get fan spin. It may not actually do that now", "start": 1139.17, "duration": 3.119}, {"text": "there's a lot of there's a lot of stuff where it into the display not just", "start": 1142.29, "duration": 3.959}, {"text": "Fans mail we did we're done", "start": 1147.04, "duration": 2.0}, {"text": "Yeah, so I can go", "start": 1149.26, "duration": 2.0}, {"text": "Put the panel back on that's the whole point fans fin. That's what was broken fan spins", "start": 1152.56, "duration": 5.9}, {"text": "So this is the one actually like special thing that you need and it's a part that I fix", "start": 1159.22, "duration": 6.679}, {"text": "It sells if you were to take apart and put back together and I'm at 400. Other than that", "start": 1165.9, "duration": 3.81}, {"text": "You just need like a screwdriver a couple of Torx bits", "start": 1169.71, "duration": 3.149}, {"text": "Nothing, nothing really special like you'd be surprised how many repairs you only really need a pretty basic", "start": 1173.47, "duration": 7.969}, {"text": "Toolkit for this is the hardest part of this repair actually is finding the proper adhesive and this goes back", "start": 1181.75, "duration": 4.79}, {"text": "Almost ten years with this stuff is that if you can open it up you can it's it's putting it back together. That's difficult", "start": 1186.76, "duration": 5.359}, {"text": "Yeah, because if you tried it if you just go to Home Depot and try to find adhesive that fits", "start": 1192.12, "duration": 3.39}, {"text": "It's just gonna fall right out. Oh they sent to just take it. They knew who they were. I fix", "start": 1195.52, "duration": 4.339}, {"text": "It does sell really good adhesive toolkits for these machines", "start": 1199.86, "duration": 2.13}, {"text": "I'll say well no", "start": 1201.99, "duration": 0.93}, {"text": "I was saying they sent two they clearly knew who they were dealing with all yeah expected me to screw it up once", "start": 1202.92, "duration": 4.559}, {"text": "We brought up the guide for putting on the strip's you really don't want to screw this up because they're one-time use", "start": 1208.36, "duration": 4.88}, {"text": "Oh, holy crap. They've got like eight steps for each", "start": 1213.24, "duration": 3.3}, {"text": "Strip, they really they really walk you through the steps there. I think I can handle this", "start": 1217.27, "duration": 4.64}, {"text": "I ended up picking the Dutch side", "start": 1223.27, "duration": 2.0}, {"text": "it should be noted that there's not actually that much pressure on you because", "start": 1225.32, "duration": 3.56}, {"text": "We are gonna take it apart again for sure to do our iMac pro repair guide which is what we were trying to do in", "start": 1229.37, "duration": 5.569}, {"text": "The first place I'm offended of being in a video with foul language", "start": 1234.94, "duration": 3.72}, {"text": "It's so frustrating to me that Apple tries to create this like, you know", "start": 1238.73, "duration": 3.68}, {"text": "Mystique around how difficult these machines are to repair. And the really frustrating thing is, that it works!", "start": 1242.48, "duration": 5.479}, {"text": "We had these comments from people who think that it's more than printed circuit boards, capacitors, wiring and stickers", "start": 1248.16, "duration": 8.06}, {"text": "I think a lot of people have bought into the idea that this is kind of a utopia and in some ways it is", "start": 1256.46, "duration": 5.38}, {"text": "You know did the software is easier to use it didn't crash as much when Vista was out. It looks nice", "start": 1261.84, "duration": 4.74}, {"text": "Did you put this on?", "start": 1266.82, "duration": 1.78}, {"text": "maybe", "start": 1268.61, "duration": 2.0}, {"text": "Linus: Clearly, I don't watch your videos.", "start": 1274.52, "duration": 2.02}, {"text": "Louis: There are at least 1000 MacBook Airs out there with the adhesive applied like that", "start": 1276.54, "duration": 3.46}, {"text": "Yeah, they think they think it's the Utopia so that if some anything goes wrong", "start": 1284.21, "duration": 3.59}, {"text": "It has to be their fault or it has to be your fault. It couldn't be that they did something wrong", "start": 1287.8, "duration": 4.229}, {"text": "So so people wind up denying their own experience when they have a problem like I remember seeing this one thread in 2011 world", "start": 1292.03, "duration": 6.539}, {"text": "So many people were saying you're wrong. This machine doesn't run too hot. You must have been doing something wrong", "start": 1298.57, "duration": 4.56}, {"text": "You must have got dust in it. You got a defense. You must have been running it too hard", "start": 1303.13, "duration": 3.299}, {"text": "Yeah, and it Roenick ly on their own page it says, you know", "start": 1306.429, "duration": 3.0}, {"text": "70% faster with video editing than last year's model and all you were trying to do is that it's some", "start": 1309.98, "duration": 4.04}, {"text": "Video. Oh, I screwed it up. Oh, I really missed. That's what the finger knows if you hold on hold on", "start": 1314.78, "duration": 5.179}, {"text": "Hold on I got I got this. I got this. I don't want it fold it", "start": 1319.96, "duration": 3.119}, {"text": "You definitely don't want two layers of it cut if it's a little bit. Ah", "start": 1323.08, "duration": 3.39}, {"text": "Shoot. No, that's really bad", "start": 1327.83, "duration": 1.34}, {"text": "Actually, I gave you so much for your application of the first couple then I screwed up the last one. Dang it", "start": 1329.17, "duration": 6.299}, {"text": "That's Karma for you. Do you want to do the ribbons and I'll hold the screen? Yeah, let's move it closer to the edge", "start": 1335.47, "duration": 5.79}, {"text": "Yes, that's actually do that now to pretend that we didn't forget to plug the microphone", "start": 1341.26, "duration": 4.38}, {"text": "Some reason they use that connector for the webcam on the MacBook", "start": 1346.25, "duration": 2.78}, {"text": "So I thought that that was a webcam Zapata's screen by the way for those watching at home", "start": 1349.03, "duration": 3.989}, {"text": "This is the smarter way to handle these recessed screws on the queer", "start": 1353.019, "duration": 3.239}, {"text": "You just put them in the rubber grommet first then screw them in", "start": 1356.259, "duration": 2.85}, {"text": "It was all going very smoothly yes, nothing is broken you", "start": 1360.83, "duration": 3.109}, {"text": "that we know it's best if you have somebody hold the screen while you're plugging things in so that you don't drop the screen or", "start": 1365.09, "duration": 5.27}, {"text": "There's always the chest or you or use your chest because it's very easy to drop this. That's the manly way", "start": 1370.36, "duration": 4.319}, {"text": "You have to have bigger packs than me for it to really work very well. I have more men moved it than pecs myself", "start": 1375.86, "duration": 5.0}, {"text": "It's good to use your nails rather than on the edge of the connector over here", "start": 1380.96, "duration": 5.089}, {"text": "So you're gonna see it's kind of shaped like an L and don't be afraid to just push it in on the edges", "start": 1386.049, "duration": 4.41}, {"text": "Don't try to push the whole thing in at once. That's very difficult", "start": 1390.46, "duration": 2.25}, {"text": "And then you can plug in the screen", "start": 1392.71, "duration": 1.689}, {"text": "Connect it without breaking it and we'll try not to drop anything in the power supply this time famous last words", "start": 1394.399, "duration": 4.369}, {"text": "Moment of truth. Come on. Come on over here Brandon. I want people to know we're not faking anything. There's no reenactments", "start": 1399.919, "duration": 4.76}, {"text": "So we got fan spin. How do we get Apple logo?", "start": 1405.71, "duration": 2.78}, {"text": "Something you do that was there very antique Leblon holding the screen with my good hand", "start": 1415.97, "duration": 4.64}, {"text": "Crash should we go like the top gun the top gun style high-five. Do you know the the high-five they do in Top Gun?", "start": 1422.84, "duration": 5.359}, {"text": "Okay, you got it. You got to go over here. Just so I'm gonna end with the screen being drop, okay", "start": 1428.2, "duration": 3.809}, {"text": "Yeah", "start": 1433.279, "duration": 2.0}, {"text": "So, I think that's pretty much it", "start": 1437.119, "duration": 2.27}, {"text": "massive thank you to", "start": 1440.059, "duration": 1.651}, {"text": "Absolutely everyone who was involved in this?", "start": 1441.71, "duration": 2.659}, {"text": "Thank you to Anthony for breaking our iMac Pro because otherwise we never would have really started this conversation", "start": 1444.679, "duration": 6.26}, {"text": "About right to repair and apples policies here", "start": 1451.279, "duration": 3.109}, {"text": "we would have had no way of knowing that it was going to be so difficult to repair a", "start": 1454.389, "duration": 4.02}, {"text": "professional-grade machine thanks to our community who really stepped up and helped us out getting this thing fixed for a", "start": 1459.019, "duration": 7.28}, {"text": "Reasonable price. Well, we can throw our total bill of materials up here compared to what Apple would have charged us", "start": 1466.97, "duration": 5.449}, {"text": "We can do that, right?", "start": 1472.419, "duration": 1.301}, {"text": "Huge thanks to Luis rossmann for showing up and helping", "start": 1473.72, "duration": 2.75}, {"text": "Be reassembled", "start": 1478.25, "duration": 2.0}, {"text": "Was a lot of fun. Thanks to iFixit", "start": 1480.269, "duration": 2.13}, {"text": "of course for providing us with the adhesive strips and the tools we need as well as their", "start": 1482.399, "duration": 4.079}, {"text": "awesome online guides for disassembly and reassembly of your electronics and of course for sponsoring this third installment of this video series and", "start": 1486.999, "duration": 7.969}, {"text": "Thank you to you guys for watching guys. If you dislike this video, you can hit that button, but if you liked it hit", "start": 1495.759, "duration": 5.719}, {"text": "Hit like get subscribed or maybe consider checking out where to buy the stuff we featured", "start": 1507.58, "duration": 3.979}, {"text": "At the link in the video description also down", "start": 1512.229, "duration": 2.75}, {"text": "There is our merch store which has cool shirts just like this one and our community forum, which you should definitely join", "start": 1514.979, "duration": 5.64}, {"text": "Can you buy screens and boards to Apple products on your merch store?", "start": 1520.69, "duration": 3.049}, {"text": "No, you cannot extra for the people who stayed till the end. Yes. We are aware of the serialization", "start": 1523.839, "duration": 6.32}, {"text": "Process for Apple main boards don't ask any questions", "start": 1530.739, "duration": 3.8}, {"text": "But this does work with FaceTime and iMessage and all that stuff", "start": 1535.299, "duration": 4.159}, {"text": "Don't worry about it, but you might run into issues if you were to actually try to just buy a random board on eBay", "start": 1541.329, "duration": 7.34}]