[{"text": "It was a warm and cloudless evening somewhere in the Riverlands.", "start": 0.0, "duration": 4.32}, {"text": "Robb Stark was sitting behind a tree drowsily,", "start": 4.32, "duration": 2.18}, {"text": "occassionally glancing up as his horse neighed faintly, grazing in the grass nearby.", "start": 6.5, "duration": 4.98}, {"text": "Then, the barely audible sound of hoofbeats in the distance sobered him up in a couple of shakes of his head.", "start": 11.7, "duration": 5.58}, {"text": "He quickly got up to his feet and motioned to ser Stevron Frey sitting nearby.", "start": 17.58, "duration": 4.24}, {"text": "Frey rose up without hesitation and began whispering orders.", "start": 22.14, "duration": 3.72}, {"text": "The battle was fast approaching.", "start": 26.24, "duration": 2.3}, {"text": "It is the year 297 after Aegon’s Conquest.", "start": 40.32, "duration": 3.52}, {"text": "Eight years have passed since King Robert Baratheon brought the might of the Seven Kingdoms to the Iron Islands,", "start": 43.96, "duration": 5.76}, {"text": "crushing the rebellion, setting disobedient House Greyjoy back to royal heel.", "start": 49.74, "duration": 4.76}, {"text": "It was eight long years of summer and prosperity for the commonfolk across Westeros,", "start": 55.04, "duration": 4.98}, {"text": "but it wasn’t a particularly good time for King Robert, who since his accession to the Iron Throne years before,", "start": 60.2, "duration": 5.64}, {"text": "quickly grew bored of the dull and tedious kingly duties expected of him.", "start": 65.84, "duration": 4.96}, {"text": "He preferred organizing feasts and hunting to ”counting coppers” and all the other equally boring administrative duties.", "start": 71.08, "duration": 7.56}, {"text": "These he had both happily and conveniently ceded to his small council,", "start": 78.92, "duration": 4.48}, {"text": "mostly to his younger brother Stannis, and to Jon Arryn, Robert’s childhood foster-father and the current Hand of the King.", "start": 83.4, "duration": 7.64}, {"text": "But in early 298 AC after a short, but serious illness, Jon Arryn unexpectedly dies.", "start": 91.44, "duration": 6.56}, {"text": "His death raised some concerns at the royal court as, despite his old age, he was considered a man of robust health.", "start": 98.0, "duration": 8.16}, {"text": "Though it was expected that the King would name either Stannis Baratheon or his brother-in-law Jaime Lannister as his new Hand,", "start": 106.44, "duration": 7.02}, {"text": "Robert instead decided to journey far North,", "start": 113.46, "duration": 3.04}, {"text": "where his childhood friend and ally, Lord Eddard of House Stark,", "start": 116.6, "duration": 3.96}, {"text": "kept watch over the Northern frontier of the Kingdom in Robert’s stead.", "start": 120.64, "duration": 4.22}, {"text": "While Lord Stark was initially hesitant to accept the King’s offer,", "start": 125.22, "duration": 3.64}, {"text": "upon hearing rumors that the nature of Jon Arryn’s death was suspiscious,", "start": 128.96, "duration": 3.62}, {"text": "he made up his mind, and joined Robert’s retinue,", "start": 132.78, "duration": 2.74}, {"text": "hoping to find out the truth behind the death of their foster-father.", "start": 135.66, "duration": 4.22}, {"text": "The royal court departed south, while a mere week later in Winterfell,", "start": 140.14, "duration": 4.18}, {"text": "an unnamed assassin made an unsuccessful attempt", "start": 144.44, "duration": 3.26}, {"text": "to murder Lord Eddard’s comatose middle son, Brandon - an event which caused deep consternation among the Starks.", "start": 147.7, "duration": 7.56}, {"text": "Lady Catelyn Stark, Bran’s mother, suspected that House Lannister could be behind this assassination attempt and,", "start": 155.54, "duration": 7.56}, {"text": "feeling that sending a raven would be too risky, departs Winterfell,", "start": 163.1, "duration": 3.98}, {"text": "secretly travelling to King’s Landing to inform her husband about the attack.", "start": 167.08, "duration": 4.66}, {"text": "Upon arriving in the capital, her old friend, and member of the King’s Small Council, Petyr Baelish,", "start": 172.02, "duration": 5.78}, {"text": "claims that the valyrian steel dagger, used by the assassin, belongs to Tyrion Lannister, brother of Queen Cersei, and Jaime Lannister of the Kingsguard.", "start": 177.9, "duration": 9.56}, {"text": "Two weeks later, on her route back to Winterfell, she fortuitously stumbles upon the said Tyrion Lannister in the Crossroad Inn,", "start": 188.04, "duration": 7.7}, {"text": "not far away from the mouth of the River Trident.", "start": 195.96, "duration": 3.0}, {"text": "Believing that he was to blame for the vicious attack on her son,", "start": 199.18, "duration": 3.34}, {"text": "Catelyn enlists the aid of her father’s bannermen to help arrest the dwarf.", "start": 202.7, "duration": 4.62}, {"text": "Catelyn’s action sparked a tumultuous chain of events.", "start": 207.88, "duration": 3.52}, {"text": "King Robert Baratheon attempted to nip the conflict between the two great houses of Westeros in the bud,", "start": 211.58, "duration": 5.3}, {"text": "but as he was always more of a soldier than a skilled politician, his actions yielded little result.", "start": 216.96, "duration": 6.52}, {"text": "Lord Tywin Lannister of Casterly Rock, Tyrion’s father and the wealthiest man in the Seven Kingdoms,", "start": 223.74, "duration": 5.48}, {"text": "began amassing troops, as he saw the capture of his son as a major insult to his family’s honor.", "start": 229.32, "duration": 6.34}, {"text": "He subsequently sent one of his bannermen, Ser Gregor Clegane, to the Riverlands", "start": 235.92, "duration": 4.6}, {"text": "to wreak havoc and hopefully lure Lord Eddard Stark there, where he could have been captured and the conflict brought to a quick conclusion.", "start": 240.52, "duration": 8.0}, {"text": "But Tywin’s plan is foiled when Ser Jaime Lannister attacks and injures Lord Stark in King’s Landing", "start": 249.3, "duration": 6.0}, {"text": "in retaliation for the capture of his younger brother.", "start": 255.42, "duration": 2.88}, {"text": "Jaime then flees the capital, riding to join his father gathering troops in the Westerlands.", "start": 258.3, "duration": 5.92}, {"text": "Being grounded in King’s Landing, Ned Stark appoints Lord Beric Dondarrion with the task of stopping the Lannister’s bannermen from ravaging the Riverlands,", "start": 264.3, "duration": 8.92}, {"text": "while he continues his investigation into Jon Arryn’s death.", "start": 273.3, "duration": 3.76}, {"text": "Ned’s investigation soon leads him to an unexpected conclusion.", "start": 277.42, "duration": 4.24}, {"text": "To Ned’s astonishment, all three of King Robert’s children are in fact Queen Cersei’s bastards fathered by Jaime Lannister,", "start": 281.84, "duration": 8.54}, {"text": "who had a long standing incestous love affair with his twin sister.", "start": 290.38, "duration": 4.86}, {"text": "Soon, Lord Eddard confronts the Queen with his findings and advises her to flee the capital.", "start": 295.82, "duration": 5.86}, {"text": "Instead, she hatches a plot to kill her husband, King Robert.", "start": 301.9, "duration": 4.26}, {"text": "Cersei pulls the strings swiftly, and a couple of days later, Robert Baratheon,", "start": 306.38, "duration": 4.54}, {"text": "after drinking excessive amounts of fortified wine, is fatally wounded by a boar during a hunt in Kingswood.", "start": 310.92, "duration": 7.38}, {"text": "He dies the very next day.", "start": 318.6, "duration": 2.34}, {"text": "Lord Stark, having secretly modified the king’s last will, intends to offer the throne to the rightful heir,", "start": 321.2, "duration": 6.82}, {"text": "Robert’s brother – Stannis Baratheon, while Robert’s supposed heir, Prince Joffrey Baratheon, was to be taken into custody as a false claimant.", "start": 328.02, "duration": 8.66}, {"text": "However, Lord Stark’s plan backfires, as he is betrayed by both Petyr Baelish and the City Watch and gets arrested and charged with treason.", "start": 336.98, "duration": 10.02}, {"text": "When word of Ned Stark’s imprisonment reaches Winterfell,", "start": 347.52, "duration": 2.82}, {"text": "his oldest son and heir, Robb, hastily gathers his fathers bannermen and marches south with the ultimate goal of freeing his father.", "start": 350.52, "duration": 8.46}, {"text": "The path to the capital led through the Riverlands, the domain of House Tully, Robb’s maternal family,", "start": 359.2, "duration": 5.74}, {"text": "who were struggling against Lannister forces that devastated the countryside.", "start": 365.02, "duration": 4.38}, {"text": "As a matter of fact, by the time Robb was on the move with his army,", "start": 369.74, "duration": 3.76}, {"text": "the Tully’s were already pushed back on the defense, with many important castles taken along the way by the Lannisters.", "start": 373.6, "duration": 7.06}, {"text": "Scouts reported that the host of Jaime Lannister was besieging Riverrun, Tully’s ancestral seat,", "start": 381.2, "duration": 5.82}, {"text": "whilst the force of Tywin Lannister, who was by this time joined by his recently freed son Tyrion,", "start": 387.02, "duration": 5.56}, {"text": "was positioned to the West, guarding the Ruby Ford at the Trident.", "start": 392.58, "duration": 4.1}, {"text": "Robb knew that Lord Tywin was too experienced a commander to abandon his strategic position untriggered,", "start": 396.94, "duration": 6.28}, {"text": "so he attempted to deceive the enemy.", "start": 403.3, "duration": 2.48}, {"text": "While the majority of his force, mainly footmen under Lord Roose Bolton of Dreadfort, marched further south along the Kingsroad to focus Tywin’s attention on them,", "start": 405.92, "duration": 9.04}, {"text": "Robb secretly moved the cavalry west, crossing the Green Fork at The Twins, and then rushed south to lift the siege of Riverrun,", "start": 415.18, "duration": 7.56}, {"text": "while rallying more rivermen under his banner on the go.", "start": 422.74, "duration": 3.2}, {"text": "It’s worth mentioning that Robb’s movement remained obscure to the Lannisters mostly thanks to the abilities of Brynden ”Blackfish” Tully, his grand-uncle,", "start": 426.28, "duration": 9.08}, {"text": "who coordinated the scouting parties and provided valuable advice to the inexperienced Young Wolf.", "start": 435.36, "duration": 6.66}, {"text": "Meanwhile to the East, Lord Roose Bolton surprised Lannister troops on the eastern bank of the Green Fork and early in the morning a fierce battle ensued.", "start": 442.36, "duration": 9.54}, {"text": "Throughout, Tywin Lannister maintained composure, retaining control in the ensuing chaos, and soon pushed the northerners back,", "start": 452.06, "duration": 8.26}, {"text": "killing or capturing several thousands, with relatively minor losses on his own side.", "start": 460.4, "duration": 5.54}, {"text": "Tywin quickly realises that the enemy army was not commanded by Ned Stark’s son, as he had expected,", "start": 466.28, "duration": 6.1}, {"text": "but by his more seasoned bannermen, Lord Bolton, who retreated in good order, despite his conceded defeat.", "start": 472.52, "duration": 7.08}, {"text": "Lingering no more, Tywin Lannister abandoned his plan to guard the ford and rushed back to reunite with the other Lannister host led by his son Jaime.", "start": 479.9, "duration": 9.62}, {"text": "Concurrently to the west, Robb held a meeting, discussing his plan to relieve the defenders at Riverrun.", "start": 489.82, "duration": 6.4}, {"text": "According to scout reports, ser Jaime Lannister, believing his position to be secure, frequently left the camp to fend off loose guerilla groups of rivermen,", "start": 496.46, "duration": 9.12}, {"text": "who raided Lannister supply lines.", "start": 505.58, "duration": 2.44}, {"text": "This lack of caution was soon to be exploited by the Northmen and their allies.", "start": 508.32, "duration": 4.88}, {"text": "Ser Brynden ”Blackfish” led the unit of three hundred outriders in the vicinity of Riverrun, where they attacked some loose Lannister marauders.", "start": 513.74, "duration": 8.02}, {"text": "Upon receiving reports of another group of Tully’s bannermen harrassing the baggage train, but this time a bigger one,", "start": 521.92, "duration": 6.28}, {"text": "Ser Jaime musters most of his cavalry, and two thousand riders depart the camp, chasing Blackfish’s unit,", "start": 528.42, "duration": 6.76}, {"text": "which escaped towards a wooded area north-west of Riverrun.", "start": 535.18, "duration": 4.14}, {"text": "Jaime’s men were about to finally catch the running foe when they reached a forested valley and temporarily lost trace of the rivermen.", "start": 539.76, "duration": 7.6}, {"text": "But as the drumming of the hooves died away, the air was filled with the whistling sound of arrows released by concealed archers,", "start": 547.58, "duration": 7.84}, {"text": "killing dozens and causing disarray in the Lannister ranks.", "start": 555.7, "duration": 3.34}, {"text": "Then, the sound of trembling hooves reappeared, as a couple thousand riders emerged from the forest and struck the unsuspecting Lannisters from three sides.", "start": 559.38, "duration": 10.14}, {"text": "The surprise was total. In a matter of minutes Starks, Freys, Mallisters, Tullys, Karstarks and others slaughtered hundreds of disarrayed westerners,", "start": 569.62, "duration": 10.04}, {"text": "hacking their way through the unordered mass of men and horses.", "start": 579.66, "duration": 4.06}, {"text": "Ser Jaime Lannister fought valiantly, yet he soon realized that he did not  stand a chance against this multitudinous enemy", "start": 583.96, "duration": 7.12}, {"text": "and made a bold attempt to cut his way to Robb’s guard and challenge the Young Wolf.", "start": 591.22, "duration": 5.8}, {"text": "But his attempt was futile.", "start": 597.46, "duration": 2.08}, {"text": "Surrounded by opponents, Jaime, even though he slays three of Robb Stark’s battle guards, is eventually captured.", "start": 599.78, "duration": 6.84}, {"text": "But many hundreds of his men were not that lucky, the valley was filled with the corpses of Lannister retainers.", "start": 606.94, "duration": 7.26}, {"text": "It was a total victory for the Starks and Tullys, as the seizure of Jaime Lannister was a serious blow to his father Tywin,", "start": 614.66, "duration": 6.7}, {"text": "who valued family honor and duty above all else.", "start": 621.36, "duration": 3.8}, {"text": "For the Northmen, Jaime Lannister served as an invaluable bargaining card in the effort to release Lord Stark from captivity in King’s Landing.", "start": 625.38, "duration": 8.24}, {"text": "The resolution of the conflict between the major powers of Westeros shone on the horizon,", "start": 633.84, "duration": 4.84}, {"text": "but the very next day in the capital, the newly proclaimed King Joffrey Baratheon acts foolhardishly against his family’s wishes", "start": 638.92, "duration": 7.52}, {"text": "and instead of sending Lord Eddard Stark to the Wall, sentences him to death.", "start": 646.44, "duration": 4.62}, {"text": "In an act of sheer barberousness, the young King Joffrey,", "start": 651.56, "duration": 3.64}, {"text": "has the noble Lord Stark beheaded in front of cheering crowds,", "start": 655.2, "duration": 4.34}, {"text": "sending the Seven Kingdoms into an even bloodier civil war.", "start": 659.54, "duration": 5.4}, {"text": "This video was sponsored by Audible.", "start": 666.52, "duration": 2.2}, {"text": "With an unmatched selection of books to choose from, Audible is the choice for audio book listening.", "start": 668.72, "duration": 5.4}, {"text": "For example, if you enjoy Game of Thrones along with actual history, why not check-out, The Influence Behind Game of Thrones", "start": 674.24, "duration": 6.98}, {"text": "a look at where the works of G.R.R. Martin and the past overlap.", "start": 681.4, "duration": 3.74}, {"text": "Hit the link in the description below, head over to www.audible.com/bazbattles or text bazbattles to 500 500 for our US watchers,", "start": 685.42, "duration": 9.26}, {"text": "and not only will you be supporting our channel, but you’ll receive a 30 day trial on Audible where you can try any book for free along with access to 2 Audible Originals", "start": 694.88, "duration": 10.02}, {"text": "exclusive audio titles crafted by the world’s most celebrated storytellers.", "start": 704.96, "duration": 4.92}, {"text": "And if you cancel your membership, you still get to keep your book, they’re yours!", "start": 710.12, "duration": 3.78}, {"text": "So there’s absolutely no obligation.", "start": 714.06, "duration": 2.5}, {"text": "Supporting all major platforms and device, visit www.audible.com/bazabattles or text bazbattles to 500 500 in the US and begin your free trial.", "start": 716.68, "duration": 10.92}, {"text": "Because it’s never been easier to listen and learn from the written word.", "start": 727.6, "duration": 5.46}]