[{"text": "Before we dive into this feature a big thanks to Skillshare for sponsoring keep productive", "start": 0.03, "duration": 4.019}, {"text": "this month Skillshare is an online learning community for creators with more than", "start": 4.049, "duration": 4.41}, {"text": "25,000 classes you can get hold of a premium membership which gives you unlimited access to those classes for less than", "start": 9.309, "duration": 6.77}, {"text": "$10 a month you can join over 7 million creators learning on Skillshare and", "start": 16.42, "duration": 4.969}, {"text": "You will get a 2 month free trial in the description below. I highly recommend Skillshare", "start": 21.789, "duration": 6.29}, {"text": "I create classes on there myself", "start": 28.08, "duration": 1.41}, {"text": "But I would recommend checking out Thomas Frank's latest one on productivity systems as well as Lindsey Holmes's one on", "start": 29.49, "duration": 7.229}, {"text": "productivity with Evernote", "start": 37.09, "duration": 1.44}, {"text": "Especially if you're looking to deep dive into that tool and if you do have an extra moment", "start": 38.53, "duration": 4.52}, {"text": "I check out productivity habits that stick with the legend Mike Vardy", "start": 43.05, "duration": 4.919}, {"text": "Anyway guys, thanks so much and thanks to skill chair for sponsoring this video", "start": 48.129, "duration": 3.89}, {"text": "Hello everyone and welcome back to the key productive youtube channel it is", "start": 54.85, "duration": 3.92}, {"text": "francesco here and today's video", "start": 59.469, "duration": 1.741}, {"text": "We're diving into a few of the home alterations and I've made over on mine ocean account after being inspired by", "start": 61.21, "duration": 6.949}, {"text": "Some of the individuals in an ocean community and also just milling on milling or milling on some of my thoughts", "start": 68.47, "duration": 7.069}, {"text": "Over the last couple of months now before we dive in you can check out our notion made", "start": 76.0, "duration": 5.569}, {"text": "Simple course and you can find that in the link in description", "start": 81.67, "duration": 2.779}, {"text": "We're looking to upgrade this in the next month now that I'm back from holidays", "start": 84.909, "duration": 3.65}, {"text": "so you guys can check it out and learn more about how you can learn ocean from scratch and", "start": 88.63, "duration": 5.779}, {"text": "Even as an intermediate or advanced user so let's dive in so gun is here", "start": 94.57, "duration": 5.269}, {"text": "We are with my notion account and maybe the last time I had this up it was mainly just a bunch of pages", "start": 99.84, "duration": 7.59}, {"text": "I'll show what my previous home screen looked like it really wasn't as intricate as this", "start": 107.43, "duration": 5.159}, {"text": "It had the goals area and it even had", "start": 112.78, "duration": 2.839}, {"text": "Sort of just a general list of the areas that I was using", "start": 115.93, "duration": 2.899}, {"text": "So I got inspired as I said by Murray who I was on the call with for the webinar", "start": 118.829, "duration": 6.84}, {"text": "I'll include links to her", "start": 125.67, "duration": 2.0}, {"text": "Twitter which is absolutely fantastic and we'll have her on to dive into a full", "start": 128.8, "duration": 3.829}, {"text": "At all, but she she sort of nudged me I guess in a way", "start": 133.17, "duration": 2.729}, {"text": "subtly, she didn't even know she did this to actually invent some of the", "start": 136.69, "duration": 3.979}, {"text": "Databases inside of the home view now as you can see here. I've made a few adaption", "start": 141.58, "duration": 5.69}, {"text": "So I want to go around this and also talk about how I went about building it", "start": 147.27, "duration": 4.139}, {"text": "So I mainly did this on holiday. It sounds really bad. But what I actually did was I", "start": 151.41, "duration": 7.559}, {"text": "was on the plane and I got my Knoblauch out and I started writing down a few things and I could", "start": 159.79, "duration": 5.479}, {"text": "adapt in my notion account", "start": 165.55, "duration": 1.88}, {"text": "and the main reason I did this is because I had been thinking about a homepage redesign for a couple of months now and", "start": 167.43, "duration": 6.36}, {"text": "I definitely thought this was the right time", "start": 174.25, "duration": 2.0}, {"text": "Seeing as I was just about to go on holiday, and I could come back and really try it out", "start": 176.5, "duration": 5.69}, {"text": "So I actually did it on the plane back and it works offline and pretty nicely", "start": 182.38, "duration": 3.739}, {"text": "So you can see up here. I wanted to start with this month goals because obviously that's quite important", "start": 186.67, "duration": 4.699}, {"text": "So what I've done here is I've stuck to my goal", "start": 191.56, "duration": 3.35}, {"text": "Database and this isn't a database", "start": 195.76, "duration": 2.419}, {"text": "Link and it's actually the original database you can see here. I've created it in a gallery view and", "start": 199.42, "duration": 6.919}, {"text": "I very simply", "start": 206.859, "duration": 2.0}, {"text": "Given these August 20 19 and if you click into it, you can see all of the goals for the month", "start": 208.87, "duration": 5.75}, {"text": "I've slimmed it down to five and", "start": 214.62, "duration": 2.0}, {"text": "This way I can actually begin to add more once I do and I don't have any link filters on this", "start": 217.42, "duration": 6.74}, {"text": "Is it just a very simple gallery view?", "start": 224.16, "duration": 2.0}, {"text": "So the top of the page whenever I open my notion now I have this nice entry of this month's goals", "start": 226.209, "duration": 5.149}, {"text": "Got a nice emoji here, and I can get started with all of that. That's a really simple that's probably the most simple thing and", "start": 231.519, "duration": 6.14}, {"text": "Member I'm not sure whether you remember", "start": 238.569, "duration": 1.521}, {"text": "I had this sort of calendar view that I had before and I will show you the original database first", "start": 240.09, "duration": 5.279}, {"text": "So this was a calendar view I would put in sort of subtle stuff like holidays things that we were doing", "start": 245.47, "duration": 6.529}, {"text": "But now I'm starting to use this as my meeting agenda because I'm doing a lot more podcast now", "start": 252.0, "duration": 5.94}, {"text": "I want to be able to have all of my meeting notes and all of the notes coming up and", "start": 257.94, "duration": 4.859}, {"text": "Even things like social stuff", "start": 263.44, "duration": 2.0}, {"text": "like visit the giraffes", "start": 266.05, "duration": 2.0}, {"text": "Actually that's happening. That's on the wrong day. I must have booked down the road. It's definitely there", "start": 268.63, "duration": 4.76}, {"text": "But if I go back it is just a if I go back to home. Sorry, it's literally just a", "start": 273.39, "duration": 6.269}, {"text": "Original database that's linked here", "start": 280.72, "duration": 2.0}, {"text": "So you can see I've got the title of the interview and I can open that as a page the date and the type", "start": 282.88, "duration": 6.799}, {"text": "now all I've done here is I've set a sort to ascending so that the latest date appears and", "start": 290.08, "duration": 6.319}, {"text": "Also, I've a date a filter. So anything that is the date is on or after tomorrow today", "start": 296.98, "duration": 6.739}, {"text": "So anything that goes for example after today, this one will go because I've got that interview this afternoon", "start": 303.94, "duration": 6.11}, {"text": "and", "start": 310.62, "duration": 0.73}, {"text": "the date is on or before one month from now, so it's basically", "start": 311.35, "duration": 3.739}, {"text": "like a", "start": 315.7, "duration": 2.0}, {"text": "View of that entire month coming up. So I've got today and after I believe that's how I've set it up", "start": 317.83, "duration": 5.239}, {"text": "Anyway, I did this on the plane then I was a little bit tired", "start": 323.07, "duration": 2.97}, {"text": "So I guess I get I've got a little bit of a past if I've got that wrong", "start": 326.04, "duration": 3.66}, {"text": "But the idea behind it is so that I've got", "start": 329.83, "duration": 2.329}, {"text": "What is my next month in sort of snippets?", "start": 333.19, "duration": 3.35}, {"text": "So for example an even like social stuff, like visit giraffes is starts at 12:30 and must read the full safety briefing and bring cards", "start": 336.76, "duration": 7.88}, {"text": "And then I've got the ability to add the context and when what was planned about it if I need to add that later", "start": 345.16, "duration": 5.99}, {"text": "So this has been a really neat thing and what I start doing now is if I've got any new big thing or interview coming", "start": 351.61, "duration": 5.479}, {"text": "up", "start": 357.09, "duration": 0.21}, {"text": "then I can add them here and what I quite like about this is I can actually dip in and", "start": 357.3, "duration": 4.11}, {"text": "See all the questions", "start": 361.9, "duration": 0.8}, {"text": "So that's gonna be really helpful for when I'm doing meetings and I used it the other day and actually really enjoy it", "start": 362.7, "duration": 5.669}, {"text": "So obviously they're the two made databases up here", "start": 368.49, "duration": 2.64}, {"text": "the new sort of addition on the right hand side is I've caught it Francesco's notion and I will be adding a picture of", "start": 371.35, "duration": 6.17}, {"text": "Like I don't know. I know it's tempting. I'd like a picture of the holiday. We've just been on or something like that", "start": 377.89, "duration": 4.88}, {"text": "It's just a nice personal photo up here and also a valid just below it like a quick access", "start": 382.87, "duration": 5.36}, {"text": "So this is really really simple", "start": 388.57, "duration": 1.91}, {"text": "the most", "start": 390.48, "duration": 0.67}, {"text": "common pages I'm using and", "start": 391.15, "duration": 1.59}, {"text": "I have slimmed that down and I will be talking about that in a separate video and just below it", "start": 392.74, "duration": 4.52}, {"text": "I have recent Clips. So basically", "start": 397.26, "duration": 2.97}, {"text": "This is like my reading list which is copied from this reading list here", "start": 401.349, "duration": 4.519}, {"text": "Of all of the things I am reading that I clip from the web", "start": 406.539, "duration": 3.079}, {"text": "but all it is if I go back to it all it is is a filter on it with Reid is", "start": 409.719, "duration": 6.739}, {"text": "uncomplete, so I show the ones that haven't been read and is created is within the past week so that I have some of the", "start": 417.009, "duration": 7.429}, {"text": "latest ones there and not the sort of", "start": 424.439, "duration": 2.429}, {"text": "Hideously long backlog that I've got so that I can tackle their more recent ones and when I go into them and read it", "start": 427.149, "duration": 6.41}, {"text": "So this is from nest labs and it's about holiday", "start": 433.559, "duration": 3.54}, {"text": "And how Nature has improved the mental health?", "start": 437.649, "duration": 2.989}, {"text": "If I click read that should disappear. I'm not gonna click read but it will disappear once I do it", "start": 441.189, "duration": 5.54}, {"text": "so that's the", "start": 446.729, "duration": 0.73}, {"text": "Use of the filters so that I can literally go into my home and go actually just just get this one out of the way", "start": 447.459, "duration": 5.48}, {"text": "Sounds bad, but let's just get this one out of the way and and I can take that one off pretty instantly", "start": 453.579, "duration": 5.029}, {"text": "I thought this old man was naked on thing. But it's a BBC article. It's it's a real one why we lied about retirement", "start": 458.609, "duration": 6.33}, {"text": "I just saw her and I thought I'll clip it. So that's her. That's my latest one here. So I've got goals", "start": 464.939, "duration": 5.91}, {"text": "Events quick access recent clippings and finally, I've got a serie called Fitness log", "start": 471.429, "duration": 5.45}, {"text": "and I've only honestly been using this three days, but I've actually noticed a dramatic improvements from the last time so previously I was using", "start": 476.879, "duration": 7.5}, {"text": "this Fitness log", "start": 484.929, "duration": 1.92}, {"text": "Which was like a calendar, but now I've basically turned my fitness log into a journal", "start": 486.849, "duration": 4.669}, {"text": "So what I've done here is for example the first day back", "start": 491.519, "duration": 3.33}, {"text": "I've logged what I've done very simply and I have a few properties here like what the focus was the", "start": 495.129, "duration": 5.6}, {"text": "Running distance I've done so I can add in that whether I meditate and stretch that morning and my current weight", "start": 500.889, "duration": 6.02}, {"text": "it was high after holiday, so I actually", "start": 507.129, "duration": 2.479}, {"text": "write down like what I did at gym a bit of my sort of focus on stuff and", "start": 511.029, "duration": 4.22}, {"text": "the stuff to improve for next time and honestly", "start": 515.439, "duration": 2.27}, {"text": "this is actually really really helped like actually doing this the last couple of days at least I", "start": 517.709, "duration": 4.59}, {"text": "Really have been inspired to actually do this for my own work like how to improve", "start": 522.49, "duration": 4.789}, {"text": "so that's my new fitness planner and the way of I've designed this or designed it or made it is by putting the first", "start": 527.589, "duration": 6.98}, {"text": "so this is scrollable so that name finishes last so I can only see the date and I've added a filter is", "start": 534.79, "duration": 5.809}, {"text": "Within the past week so that any of the old ones", "start": 541.0, "duration": 3.05}, {"text": "Disappears so that I don't have a backlog of the previous date", "start": 544.84, "duration": 5.059}, {"text": "I just want like a maximum of seven here and I guess the same with here like I probably want seven or eight so that", "start": 549.9, "duration": 5.76}, {"text": "I can see upcoming events. I would say upcoming meetings at the moment. So this", "start": 555.66, "duration": 4.26}, {"text": "title might change", "start": 560.47, "duration": 1.62}, {"text": "So I do all of these this one and this one and this one are all", "start": 562.09, "duration": 4.039}, {"text": "just simply created by pressing slash and if you type in database and scroll to", "start": 566.71, "duration": 4.549}, {"text": "Sort of midway down you can create a linked database and that's all you can you you have to do", "start": 571.57, "duration": 5.239}, {"text": "To bring that in and what's good is just creating filters on top of that or changing the view", "start": 577.45, "duration": 4.94}, {"text": "So that you can see it in a different view as you get started", "start": 582.52, "duration": 3.109}, {"text": "So I guess if I wanted to I could play around with this events in terms of making it a visual calendar", "start": 585.85, "duration": 5.929}, {"text": "But in the moment, I'm pretty happy with some of these homepage alterations. So I'm looking to really build on this over time", "start": 592.0, "duration": 6.95}, {"text": "But guys, I hope that was useful for you guys in terms of explaining how I went about doing this", "start": 599.83, "duration": 5.179}, {"text": "I would really recommend spending a bit more time on this", "start": 605.01, "duration": 4.35}, {"text": "so for example, don't do this in a day, like do this as you think about it, I", "start": 609.36, "duration": 3.539}, {"text": "Listed out a few things that were really bothering me about the way that was using the ocean and I just changed it in one", "start": 613.51, "duration": 6.109}, {"text": "Big fell swoop and I probably won't change this now - really really small tweaks for a couple of months", "start": 619.62, "duration": 5.43}, {"text": "But guys a big big. Thank you for stopping by today", "start": 625.39, "duration": 2.479}, {"text": "As I said, if you want to check out the course you can the link will be in the description and I really do recommend", "start": 627.87, "duration": 6.03}, {"text": "Because it's the only gonna get better that course. It's a forever guide", "start": 634.54, "duration": 3.109}, {"text": "So we're going to be improving it as we go and every guys if you're a nude here", "start": 637.65, "duration": 3.659}, {"text": "Please do hit subscribe and I look forward to making more videos about notion for you guys very very soon", "start": 641.35, "duration": 5.779}, {"text": "And even guys cheers everyone. I'll talk to you very very soon Cheers", "start": 647.13, "duration": 4.47}]