[{"text": "It’s early July of the year 362 BC.", "start": 0.82, "duration": 3.52}, {"text": "Epaminondas, famous Theban general and statesman, camps his sizeable army in the vicinity of the city of Tegea,", "start": 4.68, "duration": 7.1}, {"text": "while he weighs his options  to deal with the political divisions within the Arcadian League.", "start": 12.0, "duration": 4.82}, {"text": "The league after all, was intended as a countermeasure to contain the possible threat posed by the Lacedaemonians.", "start": 17.12, "duration": 7.08}, {"text": "Pressed by time, he knows that defeating his enemies in the Peloponnese is the only way to maintain the Theban influence on the peninsula.", "start": 24.48, "duration": 8.66}, {"text": "A pitched battle, that will determine the fate of Theban hegemony, is about to ensue.", "start": 33.14, "duration": 5.98}, {"text": "This video is sponsored by RAID: Shadow Legends.", "start": 40.48, "duration": 3.06}, {"text": "As wars need armies, armies need champions. In the ever evolving world of mobile RPGs, Raid: Shadow Legends enters the fray with a new perspective.", "start": 43.82, "duration": 9.32}, {"text": "Free to play, Raid allows you to control hundreds of possible heroes from over a dozen different factions", "start": 53.38, "duration": 5.3}, {"text": "and pit them against an every growing world of threats and challenges.", "start": 58.78, "duration": 3.46}, {"text": "Explore, conquer and even battle other players in a free to play experience of vast beauty and unimaginable danger.", "start": 62.4, "duration": 6.96}, {"text": "Join now, by clicking the link in the description below and not only will you be supporting our channel,", "start": 69.46, "duration": 4.8}, {"text": "but you will begin your quest with 50000 silver and an epic champion to secure your glory!", "start": 74.4, "duration": 6.22}, {"text": "It’s the middle of summer of the year 370 BC.", "start": 94.32, "duration": 3.56}, {"text": "Thebes’ shocking victory at Leuctra, barely a year earlier, had essentially ended the Spartan hegemony over Greece.", "start": 98.28, "duration": 6.42}, {"text": "Theban general Epaminondas gained great fame and esteem across the country.", "start": 105.56, "duration": 4.24}, {"text": "But despite his remarkable prowess, Epaminondas did not grow complacent.", "start": 109.98, "duration": 4.28}, {"text": "Just after the dust settled on the battlefield, a plan for the invasion into the Peloponnese was made in order to consolidate the Theban newly won dominance.", "start": 115.02, "duration": 9.64}, {"text": "In late 370 BC, Epaminondas led an army to Arcadia in the central Peloponnese,", "start": 125.06, "duration": 6.18}, {"text": "where he encouraged the foundation of the Arcadian League,", "start": 131.24, "duration": 3.28}, {"text": "and, through this League, the city of Megalopolis, founded in order to be a counterbalance to Spartan political power in the region.", "start": 134.68, "duration": 8.72}, {"text": "Moreover, the Thebans and their allies ravaged the Laconian countryside,", "start": 143.74, "duration": 4.4}, {"text": "directly threatening the city of Sparta, which had never before seen the enemy so close to its own front door.", "start": 148.4, "duration": 6.84}, {"text": "Though Epaminondas didn’t attempt to storm the city itself,", "start": 155.56, "duration": 3.16}, {"text": "he still hit the Spartans hard by liberating Messenia, a region conquered by the Spartans some twelve hundred years before.", "start": 159.02, "duration": 7.84}, {"text": "This was a huge blow for the Lacedaemonians,", "start": 167.3, "duration": 2.5}, {"text": "as the Messenian economy and its subjugated population of helots directly supported the Spartan professional army and military dominance.", "start": 169.96, "duration": 8.5}, {"text": "Though the Spartans avoided direct confrontation with Epaminondas’ invading force,", "start": 178.84, "duration": 4.84}, {"text": "Epaminondas still made sure to strip his enemy of any economic and political means that would pose a serious threat to the Theban ascendancy.", "start": 183.98, "duration": 9.46}, {"text": "Considering that Lacedaemon was already suffering from demographic decline,", "start": 193.62, "duration": 4.3}, {"text": "the Theban tactics had severe consequences for the beleaguered Spartans.", "start": 198.06, "duration": 4.52}, {"text": "While Epaminondas spent most of the subsequent years campaigning in the south,", "start": 202.88, "duration": 3.94}, {"text": "his friend and political ally, Pelopidas, was occupied with expanding Theban influence to the north, in Thessaly and Macedonia.", "start": 207.04, "duration": 8.08}, {"text": "While Theban activity in the north was marred by a few setbacks, particularly against Alexander, tyrant of Pherae,", "start": 215.52, "duration": 6.48}, {"text": "it is well worth noting  that in the wake of Pelopidas’ peace talks with the Macedonians, Pelopidas took thirty hostages back to Thebes,", "start": 222.24, "duration": 8.0}, {"text": "among them the youngest offspring of the late Macedonian King, a boy named Philip,", "start": 230.34, "duration": 5.9}, {"text": "who soon became a fond admirer of how the Theban state worked under the supervision of both Pelopidas and Epaminondas.", "start": 236.42, "duration": 8.06}, {"text": "But as the years passed by, Thebes had to face increasing difficulties in trying to maintain its dominant position among the unruly Greek city-states.", "start": 244.68, "duration": 8.14}, {"text": "In the north, Alexander of Pherae revolted once again, compelling Pelopidas to raise a force and punish the rebels.", "start": 253.14, "duration": 7.16}, {"text": "Though a good part of Pelopidas’ army disbanded in fear as a result of a solar eclipse – believing the eclipse to be a bad omen", "start": 260.74, "duration": 7.72}, {"text": "a determined Pelopidas met Alexander in battle and defeated his host.", "start": 268.64, "duration": 4.28}, {"text": "Unfortunately, this pursuit of Alexander turned out to be Pelopidas’ demise as Pelopidas single-handedly charged the enemy in a battle frenzy.", "start": 273.0, "duration": 8.44}, {"text": "He was quickly overwhelmed and perished on the field.", "start": 281.44, "duration": 2.68}, {"text": "The Tyrant of Pherae had been subdued,", "start": 284.26, "duration": 2.16}, {"text": "but Thebes had lost a general whose abilities and dedication lifted his home city to the position of a leading power in the Greek world.", "start": 286.42, "duration": 7.98}, {"text": "Epaminondas had little time to grieve the death of his dear friend.", "start": 294.62, "duration": 3.48}, {"text": "The political landscape to the south was growing increasingly complicated and it required his attention.", "start": 298.38, "duration": 5.44}, {"text": "He attempted to contain the threat of a now hostile Athens by undermining its naval empire,", "start": 303.96, "duration": 5.54}, {"text": "but despite some successes on the Aegean Sea, Athens remained a dominant naval power in Greece.", "start": 309.64, "duration": 6.42}, {"text": "Things were not looking good on the Peloponnese either, as Mantinea, a city-state member of the Arcadian League that Epaminondas had helped to establish,", "start": 316.56, "duration": 8.78}, {"text": "revolted and began lobbying other discontented poleis to oppose Theban influence in the region.", "start": 325.54, "duration": 6.66}, {"text": "Thus, in a matter of months Achaea, Elis and Sparta joined the opposition.", "start": 332.54, "duration": 5.24}, {"text": "Even Athens, seeking a way to limit Theban power, supported the Mantinean cause.", "start": 338.06, "duration": 5.48}, {"text": "Undoubtedly, the Mantinean revolt was the biggest threat to Theban hegemony since it had been  established just under ten years earlier,", "start": 343.98, "duration": 7.3}, {"text": "and Epaminondas was perfectly aware of this.", "start": 351.42, "duration": 2.7}, {"text": "He gathered and led a sizable army into the Peloponnese,", "start": 354.48, "duration": 3.56}, {"text": "hoping to discourage the rebelling city-states and compel them to recognize Theban overlordship.", "start": 358.16, "duration": 6.3}, {"text": "But as time passed by, it became clear that the Mantinean alliance was not going to yield to the mere presence of the Theban army.", "start": 364.68, "duration": 7.92}, {"text": "This was a dispute that was to be solved on the battlefield.", "start": 372.84, "duration": 3.98}, {"text": "Epaminondas moved his army to Tegea, an Arcadian city that remained loyal to Thebes, lying on the path between Mantinea and Sparta.", "start": 377.2, "duration": 9.08}, {"text": "There, upon receiving scout reports, the Theban army attempted to outsmart their enemy", "start": 386.6, "duration": 5.34}, {"text": "and take both cities while they were temporary undefended as their armies manoeuvred around.", "start": 392.12, "duration": 5.34}, {"text": "But as these manoeuvres seemed to lead nowhere, Epaminondas, determined to quell the rebels,", "start": 397.62, "duration": 5.46}, {"text": "marched his troops north, to meet the opposing army in a narrow plain just south of Mantinea.", "start": 403.2, "duration": 5.98}, {"text": "The Spartans and their allies didn’t expect an encounter with the sun already at its zenith,", "start": 409.82, "duration": 4.76}, {"text": "so upon seeing the advancing Boeotian troops, they scrambled to form the battle line.", "start": 414.7, "duration": 5.54}, {"text": "Twenty thousand soldiers from Sparta, Elis, Mantinea and Athens with flanks guarded by cavalry and light troops hastily prepared for battle,", "start": 420.34, "duration": 9.24}, {"text": "occupying the narrowest part of the plain between two hills.", "start": 429.58, "duration": 4.46}, {"text": "Coming from the south, thirty thousand men of the Boeotian League, supported by contingents from Euboea , Argos, Messenia and Thessaly,", "start": 434.32, "duration": 8.56}, {"text": "under the direct command of Epaminondas marched to meet the enemy.", "start": 442.88, "duration": 4.44}, {"text": "Despite the numerical advantage, the Theban general had a tough nut to crack, as his enemies prepared formidable defensive positions,", "start": 447.5, "duration": 8.46}, {"text": "refusing to advance beyond their line and thus greatly diminishing the power of the larger Boeotian numbers.", "start": 456.06, "duration": 6.54}, {"text": "It was an undeniable challenge for Epaminondas, who attempted to deceive his opponents.", "start": 462.82, "duration": 5.84}, {"text": "Instead of marching straight towards the Spartan and Mantinean line, Theban units moved westward,", "start": 469.0, "duration": 6.2}, {"text": "towards the mountains, and upon reaching new positions,", "start": 475.2, "duration": 3.06}, {"text": "their left flank pretended to ground their weapons and set a camp for the night, relaxing the enemy’s readiness for battle.", "start": 478.28, "duration": 7.66}, {"text": "Upon seeing that the enemy had taken the bait and loosened their formations,", "start": 486.4, "duration": 4.2}, {"text": "Epaminondas swiftly ordered his men to turn right and form a battleline roughly resembling the one he used almost ten years earlier at Leuctra,", "start": 490.84, "duration": 9.5}, {"text": "with a greatly strengthened left flank.", "start": 500.34, "duration": 2.64}, {"text": "In such a formation, the Theban left flank charged at the disorientated Mantineans,", "start": 503.12, "duration": 5.18}, {"text": "while the rest of the Boeotian allies steadily moved forward in an oblique order.", "start": 508.46, "duration": 5.02}, {"text": "Eventually, the lines clashed on the left and battle raged.", "start": 513.94, "duration": 3.8}, {"text": "Unsurprisingly, the ill-prepared Mantineans occupying the right flank were unable to stand their ground against the local superiority of the Theban troops,", "start": 517.9, "duration": 9.98}, {"text": "who steadily pushed their enemies back, ramming forward like a trireme, and killing many in the process.", "start": 528.1, "duration": 7.42}, {"text": "While battle raged on the Theban left wing, strong Spartan, Athenian and Elean contingents hesitated to abandon their favourable position", "start": 535.8, "duration": 9.66}, {"text": "and storm the less capable Boeotian units that Epaminondas held back.", "start": 545.46, "duration": 4.82}, {"text": "Only Athenian cavalry skirmished with their Theban counterparts somewhere on the eastern side of the battlefield.", "start": 550.66, "duration": 6.84}, {"text": "Eventually, the relentless pressure of the Theban left flank tore the Mantinean line apart.", "start": 557.74, "duration": 6.0}, {"text": "The Mantineans, upon losing cohesion, had no other choice but to retreat to avoid slaughter.", "start": 564.16, "duration": 5.92}, {"text": "Predictably, the rest of the allied line gradually lost faith and fled the battlefield.", "start": 570.5, "duration": 5.3}, {"text": "But the Thebans, though victorious in the battle, had suffered a huge blow,", "start": 576.14, "duration": 4.9}, {"text": "as in the ensuing pursuit to massacre their fleeing opponents the Theban general Epaminondas was fatefully struck by a spear.", "start": 581.36, "duration": 7.98}, {"text": "He took his last breath just as his enemies were running in disarray towards Mantinea.", "start": 589.62, "duration": 5.66}, {"text": "This was a bitter victory for the Boeotian League.", "start": 595.7, "duration": 2.56}, {"text": "With the death of Epaminondas, Thebes had no commander that could match his tactical prowess, leadership skills and political foresight.", "start": 598.72, "duration": 8.02}, {"text": "The only man who came close was Pelopidas, but Pelopidas had perished in a similar manner just two years before.", "start": 606.84, "duration": 7.28}, {"text": "Without a charismatic leader, the Theban hegemony slowly began to fade.", "start": 614.32, "duration": 4.3}, {"text": "Despite their fading dominion, however, Thebes’ adversaries, be they Athens, Sparta or Mantinea,", "start": 618.8, "duration": 6.82}, {"text": "still suffered from battle losses, the effects of the prolonged war and their own internal problems.", "start": 625.62, "duration": 6.66}, {"text": "They were simply not strong enough to impose their rule over any greater region of Ancient Greece.", "start": 632.28, "duration": 6.56}, {"text": "The Battle of Mantinea ended with a favourable outcome for Persian King Artaxerxes, who spent decades trying to maintain political divisions within Greece,", "start": 639.12, "duration": 9.04}, {"text": "seemingly achieving his goal.", "start": 648.16, "duration": 2.36}, {"text": "But just three years later, former Theban hostage Philip, following the death of his elder brothers,", "start": 650.8, "duration": 5.68}, {"text": "inherited the Macedonian throne and began his accession to power,", "start": 656.48, "duration": 4.2}, {"text": "building the foundations of an empire the Greek world had never seen before.", "start": 660.68, "duration": 6.34}]