[{"text": "Thanks to curiosity stream for sponsoring this video. I have a link for you to try out premium for free", "start": 0.5, "duration": 5.33}, {"text": "So hang out till the end of the video", "start": 5.83, "duration": 1.92}, {"text": "I'm primarily a Firefox user and I move between a Windows PC and a Mac both of which of course have their own web browser", "start": 7.75, "duration": 6.569}, {"text": "But in the last couple of weeks", "start": 14.48, "duration": 1.82}, {"text": "I actually have to download Chrome on three separate occasions because the three browsers that I have installed on", "start": 16.3, "duration": 5.819}, {"text": "My machines are apparently just not enough to run Google websites well anymore and sadly it is not just me", "start": 22.12, "duration": 5.969}, {"text": "The tech news is full of mysterious bugs and errors that pop up all the time and Google has purpose-built some sites like hangouts and", "start": 28.09, "duration": 7.47}, {"text": "Google Earth for example to only work in Chrome at least for a couple of years", "start": 35.87, "duration": 4.01}, {"text": "So in the 52nd episode of The Story Behind series", "start": 40.19, "duration": 2.72}, {"text": "Let's talk about POW and why Google is trying to turn Chrome into a monopoly", "start": 42.91, "duration": 4.95}, {"text": "Real quick before we start if you want to see more in-depth analysis of tech companies", "start": 53.39, "duration": 3.799}, {"text": "Especially from a business perspective consider subscribing to tackle time", "start": 57.32, "duration": 3.68}, {"text": "Alright, I'll start with my personal experiences. One of the random Google tools", "start": 61.489, "duration": 4.97}, {"text": "I use as a youtuber is the end screen editor, the tool to put these", "start": 66.46, "duration": 3.69}, {"text": "interactive little buttons at the end of my videos and about 2 months ago", "start": 70.31, "duration": 3.5}, {"text": "It stopped working out of nowhere in all three of my browsers. A month later when it still didn't get fixed", "start": 73.81, "duration": 5.97}, {"text": "I tweeted at YouTube to ask what was going on and they had a simple solution for me", "start": 79.78, "duration": 3.989}, {"text": "I should just use a different browser. Well lucky for them", "start": 83.77, "duration": 3.779}, {"text": "I guess the one that worked was Chrome", "start": 87.549, "duration": 1.831}, {"text": "So I downloaded it, put up my end screen cards, and a few weeks later one day, she got fixed", "start": 89.38, "duration": 5.01}, {"text": "I just deleted Chrome again. No biggie. A week or two after that", "start": 94.39, "duration": 3.54}, {"text": "I had to hop on a call with my partner manager from YouTube and since she is a", "start": 97.93, "duration": 3.809}, {"text": "Google employee we of course used Google Hangouts in the browser for the call. Except not in MY browser", "start": 101.81, "duration": 5.54}, {"text": "of course, as Hangouts straight up doesn't work in Firefox. Since it was on my macbook", "start": 107.35, "duration": 4.23}, {"text": "I decided to use Safari. Turns out you need to install a plug-in which I did and I got a random error", "start": 111.58, "duration": 5.939}, {"text": "I could have probably fixed this somehow but the call was in like two minutes", "start": 117.52, "duration": 3.389}, {"text": "So I just got Chrome and hopped on the call. At this point", "start": 120.909, "duration": 3.12}, {"text": "I was a little bit annoyed but whatever", "start": 124.03, "duration": 1.949}, {"text": "I deleted Chrome after the call and then got on with my life", "start": 125.979, "duration": 2.819}, {"text": "But then recently I tried to add subtitles to my latest video", "start": 128.799, "duration": 3.089}, {"text": "Like I always do and suddenly the subtitle editor doesn't work in Firefox. Neither on my PC nor on my Mac", "start": 131.889, "duration": 6.28}, {"text": "I tweeted at YouTube again, but this time they didn't reply to me and instead", "start": 138.17, "duration": 4.259}, {"text": "I only saw reports of other users confirming that they had the same issue as well", "start": 142.43, "duration": 4.709}, {"text": "So just like a well trained monkey", "start": 147.14, "duration": 2.34}, {"text": "I download Chrome and who would have thought it just works", "start": 149.48, "duration": 3.389}, {"text": "now if I were a normal human being this is probably the point where I was just switched to Chrome because obviously", "start": 152.97, "duration": 5.96}, {"text": "Chrome is the browser where everything just seems to work, right, but of course", "start": 159.06, "duration": 3.92}, {"text": "I'm not a normal human being so I got angry at Google instead and decided to make this video because my issues, as it turns", "start": 162.98, "duration": 7.259}, {"text": "out, they're not some isolated little errors. Just a few weeks ago, Google temporarily blocked Google Meet,", "start": 170.24, "duration": 6.059}, {"text": "which is their enterprise video calling app, from working in the new Microsoft Edge and a few days later,", "start": 176.3, "duration": 5.34}, {"text": "they blocked the same browser from accessing the modern version of YouTube, instead reverting users to a really old version", "start": 181.71, "duration": 7.19}, {"text": "That's extra weird because the new edge even uses Google's own rendering edge in chromium", "start": 189.18, "duration": 5.149}, {"text": "So it should handle websites the exact same way as chrome itself and indeed when users", "start": 194.33, "duration": 5.639}, {"text": "Manually changed their user agent to pretend that they're Chrome", "start": 200.19, "duration": 2.929}, {"text": "Both of these websites worked just fine", "start": 203.25, "duration": 2.149}, {"text": "And then there are tons of reports like this thread from a Firefox engineer that claims that Google suddenly used some outdated", "start": 205.4, "duration": 7.11}, {"text": "non-standard API on YouTube", "start": 213.24, "duration": 1.67}, {"text": "which is only supported by Chrome that all of a sudden made YouTube load 5 times slower on Firefox and edge than in Chrome or", "start": 214.91, "duration": 7.679}, {"text": "Like this thread from a previous VP at Mozilla claiming Google introduced", "start": 222.59, "duration": 4.02}, {"text": "Hundreds of Firefox-specific bugs and errors to Google Sites each time convincing many users to switch over to Chrome", "start": 226.74, "duration": 6.379}, {"text": "Instead and I could go on and list a bunch of other similar issues, but I think you get my point", "start": 233.19, "duration": 4.16}, {"text": "Google websites are just constantly riddled with strange bugs and just aren't very well", "start": 237.54, "duration": 4.91}, {"text": "optimised on anything that isn't Chrome and that's not even talking about websites like hangouts or Google Earth that", "start": 242.64, "duration": 5.599}, {"text": "for years only worked in in chromium", "start": 248.31, "duration": 2.24}, {"text": "Like when was the last time Mozilla, Apple, or Microsoft", "start": 250.56, "duration": 2.9}, {"text": "Built a major service that only worked in their own browser and then kept it that way for years? On the Google Earth website", "start": 253.77, "duration": 7.099}, {"text": "they even used the Chrome logo as the logo for the web as if the web for", "start": 260.87, "duration": 4.53}, {"text": "consumers should just equal to Chrome and to anyone who's been around in the nineties or in the early", "start": 265.6, "duration": 4.679}, {"text": "2000s, this sort of behavior should seem strangely familiar because we've seen it before", "start": 270.5, "duration": 4.52}, {"text": "Microsoft back in the days used their dominance with Internet Explorer to strangle other competing web browsers like Netscape", "start": 275.63, "duration": 6.98}, {"text": "for example. Sure, Microsoft might have been way more", "start": 282.61, "duration": 2.579}, {"text": "Straightforward in their anti-competitive behavior, I actually explained all of that in my previous video that you can watch right here,", "start": 285.71, "duration": 5.81}, {"text": "But Google is achieving the same results", "start": 291.52, "duration": 2.369}, {"text": "Even if they use much more subtle tools. Instead of actually trying to break", "start": 293.89, "duration": 4.799}, {"text": "Compatibility standards across the web like Microsoft did all Google needs to do is a bit of malicious neglect", "start": 299.06, "duration": 5.57}, {"text": "Given how reliant many people including myself are on Google services", "start": 304.76, "duration": 4.279}, {"text": "It's enough for those to work noticeably worse and competing browsers every now", "start": 309.04, "duration": 4.26}, {"text": "And then. That alone will slowly end up killing competing browsers just fine. It's death by a thousand cuts and not even obvious to people", "start": 313.3, "duration": 7.739}, {"text": "Looking at it from the outside", "start": 321.14, "duration": 1.47}, {"text": "There is a rational, non-malicious explanation to any one of these issues on their own and tech websites", "start": 322.61, "duration": 6.169}, {"text": "Love to point them out. The new edge for example is still in preview", "start": 328.78, "duration": 3.66}, {"text": "So maybe Google just didn't test for it. Hangouts is being phased out in exchange for Meet", "start": 332.44, "duration": 4.92}, {"text": "So maybe they didn't want to bother making it work on other browsers anymore. The YouTube tools are only used by a few people", "start": 337.39, "duration": 6.719}, {"text": "So maybe they're not all that important and so on. All of these can technically be explained in isolation", "start": 344.11, "duration": 5.64}, {"text": "But together they create a malicious", "start": 349.75, "duration": 2.0}, {"text": "anti-competitive pattern, a pattern where Google has", "start": 352.1, "duration": 2.57}, {"text": "Clearly decided that if something works in chrome, that's good enough and if it breaks in another browser", "start": 354.92, "duration": 4.91}, {"text": "Who cares they can just fix it", "start": 359.9, "duration": 1.85}, {"text": "Once they get enough complaints. Until then users can just get Chrome. In my last video", "start": 361.75, "duration": 5.19}, {"text": "I explained why Microsoft suddenly stopped being anti-competitive because their new business model incentivized them to become a good citizen", "start": 366.94, "duration": 6.959}, {"text": "I believe that companies are ultimately driven by their business incentives", "start": 374.29, "duration": 4.23}, {"text": "And so that's probably also what's driving Google in this case", "start": 378.52, "duration": 3.419}, {"text": "we all know that over 80% of Google's revenue comes from", "start": 382.16, "duration": 3.199}, {"text": "advertisements and chrome is", "start": 385.85, "duration": 1.47}, {"text": "Essential for letting them track you across the web and to make sure that you actually see the ads that they want to show you", "start": 387.32, "duration": 5.39}, {"text": "Nearly all competing browsers like Firefox Safari", "start": 392.72, "duration": 3.05}, {"text": "brave", "start": 396.08, "duration": 0.5}, {"text": "and even the new Microsoft edge have added built-in blocking for web trackers and ads, most of them turned on by default, and they're", "start": 396.58, "duration": 7.29}, {"text": "Increasingly getting more and more aggressive about them seeing it as a point of differentiation", "start": 404.06, "duration": 3.889}, {"text": "Versus the dominant chrome in other words these browsers directly threaten Google's ability to track users and to show them ads", "start": 408.29, "duration": 7.339}, {"text": "Google on the other hand has recently introduced their own default ad blocker on Chrome", "start": 415.85, "duration": 4.85}, {"text": "Except they only block", "start": 420.7, "duration": 1.36}, {"text": "Competing ads, not their own, and they've made changes to chrome that make it harder for third-party ad blockers to block trackers across the web", "start": 422.06, "duration": 7.25}, {"text": "By limiting things like how many", "start": 429.31, "duration": 1.6}, {"text": "blacklisted services", "start": 430.91, "duration": 0.98}, {"text": "they can have in their database and I think the", "start": 431.89, "duration": 2.22}, {"text": "Incentives are pretty clear to see. Now, if you care about the web enough to watch this video, I think you'll really enjoy this fantastic", "start": 434.21, "duration": 6.259}, {"text": "documentary about the internet called 2-digits where fellow youtuber Derek from veritasium", "start": 441.14, "duration": 3.859}, {"text": "Talks to everyone from the early inventors of the Internet to Edward Snowden", "start": 445.46, "duration": 4.459}, {"text": "Explaining everything from how network switches work to how white hat hackers save you from the bad guys", "start": 450.32, "duration": 5.69}, {"text": "You can watch it for free on Curiosity Stream if you sign up with my link in the description and you'll also get access", "start": 456.01, "duration": 5.309}, {"text": "to over", "start": 461.32, "duration": 1.3}, {"text": "2,400 professional documentaries available on the site including Schultz from Stephen Hawking, David Attenborough, and Jane Goodall", "start": 462.62, "duration": 6.89}, {"text": "Curiosity' stream was founded by the founder of the Discovery Channel and works on essentially every device you own, including smartphones computers and smart TVs", "start": 469.73, "duration": 7.94}, {"text": "And sign up if that sounds like fun to you and I'll see you in the next video", "start": 477.77, "duration": 3.649}]