[{"text": "This video is sponsored by Next Games, creator of AMC's official game The Walking Dead:No Man's Land.", "start": 0.0, "duration": 5.009}, {"text": "I put a link in the description so you can go download the game for free and it comes with a special offer!", "start": 5.009, "duration": 4.08}, {"text": "I'll tell you about in a few minutes.", "start": 9.09, "duration": 1.81}, {"text": "What's up guys welcome back for this video today,", "start": 10.9, "duration": 2.119}, {"text": "I thought it'd be fun to take a little bit of an apocalyptic twist now if you're to find yourself in a survival", "start": 13.019, "duration": 4.74}, {"text": "emergency or zombie apocalyptic situation,", "start": 18.039, "duration": 2.149}, {"text": "One of the most valuable resources you could get your hands on would be clean drinking water you won't last very long without it", "start": 20.619, "duration": 5.42}, {"text": "so for this video today,", "start": 26.109, "duration": 1.371}, {"text": "I thought it'd be great to show you how to use resources you already have to make clean drinking water for yourself", "start": 27.48, "duration": 4.289}, {"text": "So quick update guys. I just stepped outside for a second", "start": 43.37, "duration": 2.51}, {"text": "I walked over to my fish pond which ironically doesn't have any fish in it", "start": 45.88, "duration": 3.09}, {"text": "But it does have a massive amount of other kinds of life as you see here. We've got Mosquito larvae", "start": 48.97, "duration": 4.979}, {"text": "We've got these little worms flopping around all over the place", "start": 53.95, "duration": 2.189}, {"text": "We've got algae and all kinds of junk and other little parasites that probably will help very much in your quest for survival", "start": 56.14, "duration": 4.919}, {"text": "But I am going to drink it once we make our filter and sterilize the water", "start": 61.4, "duration": 3.229}, {"text": "We need a simple way to filter all this garbage out before we sterilize the water and to get started", "start": 65.03, "duration": 4.25}, {"text": "We're going to be making a simple sand", "start": 69.46, "duration": 1.57}, {"text": "Charcoal filter", "start": 71.03, "duration": 0.99}, {"text": "now to get started making our sand charcoal filter of course we're going to need some sand we're getting some charcoal and we're going to", "start": 72.02, "duration": 5.06}, {"text": "Need some kind of a plastic container like these simple little water bottles", "start": 77.08, "duration": 2.72}, {"text": "You probably have lying around", "start": 79.8, "duration": 0.98}, {"text": "Now because sand, clay and rocks have different densities if you put them in a container with water and stir it all up", "start": 80.78, "duration": 4.849}, {"text": "The rocks will fall to the bottom first followed by the sand and the clay on top", "start": 85.7, "duration": 3.919}, {"text": "any organic material left behind will float up with a surface where you can skim it off by using these layers of", "start": 89.869, "duration": 4.97}, {"text": "Separation with one chunk of dirt you can end up with nice small pebbles very fine sand and the clay which we don't actually need", "start": 94.91, "duration": 5.959}, {"text": "For this experiment. Or you could use something like a strainer and filter out the finer sand that way as well", "start": 100.869, "duration": 4.77}, {"text": "So now that we've got our fine sand our small pebbles and a small water bottle the only thing left to do is crush up", "start": 106.07, "duration": 5.089}, {"text": "some charcoal", "start": 111.159, "duration": 2.0}, {"text": "Now for this experiment. I'm using the same charcoal I used for our black-Powder experiment", "start": 113.33, "duration": 3.979}, {"text": "We made in the previous video", "start": 117.31, "duration": 1.18}, {"text": "however", "start": 118.49, "duration": 0.5}, {"text": "If you don't want to go to the trouble of making your own you can just look around a campfire", "start": 118.99, "duration": 2.55}, {"text": "For those large chunks of black wood they're charred and snap in half when you press them if your charcoal is done", "start": 121.729, "duration": 6.08}, {"text": "Right it should just about crumble if you apply any kind of pressure to it", "start": 127.81, "duration": 2.639}, {"text": "Which is good because the finer we can get our charcoal the better our filter is going to work", "start": 130.45, "duration": 3.84}, {"text": "now of course my charcoal is just a mixture of small twigs paint sticks and", "start": 134.57, "duration": 3.559}, {"text": "sawdust", "start": 138.56, "duration": 0.63}, {"text": "which I like to sawdust because it's already in fine powder form to begin with but whatever material you end up using to make your", "start": 139.19, "duration": 5.329}, {"text": "Charcoal should be just fine because it all ends up is pretty much the same stuff", "start": 144.519, "duration": 3.09}, {"text": "The goal is just to make it a very fine powder because the finer your charcoal is the better your filters can work", "start": 147.61, "duration": 4.83}, {"text": "that's beautiful", "start": 161.38, "duration": 1.93}, {"text": "Here we are guys we have all of our filter materials prepped and ready for assembly", "start": 163.31, "duration": 3.17}, {"text": "So let's take our plastic water bottle cut off the bottom and put a little bit of paper towel on the bottom to catch everything", "start": 166.61, "duration": 4.97}, {"text": "As it falls in now, if you don't have any paper towel or fine cloth", "start": 171.58, "duration": 2.94}, {"text": "You could use a bit of your shirt", "start": 174.52, "duration": 1.14}, {"text": "You can use some sock any kind of cloth really that's going to stick down the bottom and hold the charcoal in place", "start": 175.66, "duration": 4.259}, {"text": "Preventing it from slipping through so now that we have our paper towel in place", "start": 180.05, "duration": 3.199}, {"text": "We can go ahead and start adding the filter materials fineness to courses so in this case", "start": 183.25, "duration": 4.08}, {"text": "We're going to start with the very fine charcoal powder and build that up a few inches deep", "start": 187.33, "duration": 3.18}, {"text": "Followed by as much of the fine sand as we can pack in there, and then a nice top layer of small pebbles", "start": 190.7, "duration": 5.119}, {"text": "And that's really to protect the system from the water this splashing in and just to go one step further", "start": 195.82, "duration": 4.38}, {"text": "I took the bottom of the bottle and cut it into a makeshift baffle to stick it on the top and help reduce erosion", "start": 200.2, "duration": 4.829}, {"text": "As we pour the water in now", "start": 205.19, "duration": 2.0}, {"text": "This is a very basic style filter and the more material you could add the better it will work and you could also get creative", "start": 207.19, "duration": 4.889}, {"text": "With some different variations for example you could layer the charcoal and the sand", "start": 212.08, "duration": 3.75}, {"text": "Charcoal, sand as many times as you want or you can even just cut the water bottle in half, use the top part of it", "start": 216.08, "duration": 5.57}, {"text": "To form the filter and use the bottom part to form the cup", "start": 221.65, "duration": 2.729}, {"text": "The time has come to take our scummy pond water and test our filters to keep it work now if you look at the water", "start": 224.69, "duration": 5.179}, {"text": "Itself this has been sitting out for about 45 minutes", "start": 229.87, "duration": 2.0}, {"text": "and you can see that already a lot of the material in there has settled down to the bottom and", "start": 232.01, "duration": 4.459}, {"text": "Relatively filtered itself through gravity we've got organic material and bugs floating at the top", "start": 236.57, "duration": 4.369}, {"text": "But the water is a lot clearer than it used to be so step number one in filtering your water if you can", "start": 241.01, "duration": 5.149}, {"text": "Let your water sit out for a few hours. So most of the material can settle down to the bottom first", "start": 246.32, "duration": 4.009}, {"text": "So I've just made the transfer you can already see that this water is so much cleaner than this water here", "start": 267.86, "duration": 4.94}, {"text": "There's still little bugs floating around there and a lot of other nasties", "start": 272.8, "duration": 3.149}, {"text": "But we can now take this water and pour it into our filter and cleanse it even further watch this", "start": 275.95, "duration": 4.29}, {"text": "So our water filters are charged and is going to take a little bit of time for the water to filter through", "start": 297.16, "duration": 4.159}, {"text": "So while we're waiting for that let me show you a fun way you can brush up on those crucial survival strategies for surviving that", "start": 301.419, "duration": 5.54}, {"text": "Inevitable zombie outbreak I put a link down in the description to download The Walking Dead No Man's Land.", "start": 307.12, "duration": 5.0}, {"text": "It's a free game with a special offer. That's only available right now", "start": 312.31, "duration": 2.869}, {"text": "now if you're the kind of person that likes playing checkers chess or turn-By-turn", "start": 315.43, "duration": 3.32}, {"text": "Strategy type games this might be a good choice for you", "start": 319.15, "duration": 2.929}, {"text": "You actually use the characters you know from the television show The Walking Dead", "start": 322.08, "duration": 3.39}, {"text": "In the actual Walking Dead Locations like the terminus in the prison when I was doing a road trip down to La with my friend", "start": 325.69, "duration": 5.719}, {"text": "Mark a few weeks ago. I actually spent six hours straight playing this game, so I made it pretty far", "start": 331.409, "duration": 3.99}, {"text": "So you take turns moving people around and every time you move then the zombies get a chance to move as well you have to", "start": 335.44, "duration": 5.69}, {"text": "use a little bit strategy you have to do some tactical maneuvers you have to think your way through it because if you make the", "start": 341.13, "duration": 4.949}, {"text": "Wrong move all of your hard work can go down the drain the more cleverly you can position your people the better your chances at", "start": 346.08, "duration": 5.579}, {"text": "Winning it's a lot of fun", "start": 351.659, "duration": 0.871}, {"text": "And there's some back-end strategy going on as well because not only are you defeating the zombies and rescuing humanity, you also get to play", "start": 352.53, "duration": 5.639}, {"text": "Around with developing an encampment you start out with and you can choose how to set it up to build up your colony and fortify", "start": 358.169, "duration": 5.52}, {"text": "It if you're a fan of the TV show The Walking Dead you're going to recognise characters like Daryl Rick", "start": 363.69, "duration": 4.319}, {"text": "Michonne and Negan which by the way if you download the game right now", "start": 368.38, "duration": 3.589}, {"text": "You'll get the character Negan for free", "start": 371.969, "duration": 1.841}, {"text": "It would actually be really cool if they could make a King of Random character.", "start": 373.81, "duration": 3.349}, {"text": "The game is available on IOS, Android and pretty much any other device", "start": 377.229, "duration": 3.38}, {"text": "so if you like zombies", "start": 380.61, "duration": 1.049}, {"text": "And you want to rescue humanity hang out with characters you know and slaughter hordes of the undead?", "start": 381.659, "duration": 3.93}, {"text": "Go down to the first link of the description download the game for free the offer is only available right now", "start": 386.02, "duration": 4.91}, {"text": "All right back to the experiment", "start": 392.86, "duration": 2.0}, {"text": "Alright guys. We are back. We've been running these filters for about 45 minutes now to the point where the cups are actually overflowing", "start": 401.139, "duration": 6.32}, {"text": "So let's stop for a second and observe the different results between the different filters", "start": 407.46, "duration": 4.17}, {"text": "So just by looking at the different colors of the water here", "start": 412.0, "duration": 2.509}, {"text": "It looks like the one on your right is actually the clearest and this is the one that we built in this video", "start": 414.509, "duration": 4.8}, {"text": "It's got the layer of charcoal on the slot on the stand in the middle of the pebbles on the top and is this pretty", "start": 419.31, "duration": 4.799}, {"text": "basic Design now look if we screw the cap on", "start": 424.11, "duration": 2.85}, {"text": "We can actually contain everything inside and just set that off to the side to be used again at another time", "start": 427.24, "duration": 4.82}, {"text": "You know what else is really crazy is if you look at the top of the filter you can actually see like the little worms", "start": 432.28, "duration": 4.699}, {"text": "The Larva the bugs like jumping around and floating on top. They don't make it past the rocks though", "start": 436.979, "duration": 5.369}, {"text": "They just stay on the top the water we collected at the bottom is", "start": 442.349, "duration": 2.73}, {"text": "Definitely different than the water on the top now the one in the middle", "start": 445.419, "duration": 3.2}, {"text": "I'm a little bit surprised about because we actually had two different layers of Charcoal", "start": 448.62, "duration": 3.839}, {"text": "And I would have expected that to be the clearest out of all of them now what I think happened is when I was building", "start": 452.46, "duration": 4.829}, {"text": "this one", "start": 457.289, "duration": 0.301}, {"text": "I actually ran out of my really fine charcoal, and I just started putting the chunky charcoal instead", "start": 457.59, "duration": 4.169}, {"text": "so", "start": 461.83, "duration": 0.6}, {"text": "obviously", "start": 462.43, "duration": 0.5}, {"text": "It didn't filter the water quite as good as the really fine charcoal does this shows the finer your charcoal the clearer your water is", "start": 462.93, "duration": 6.869}, {"text": "Actually going to be let's take a look down inside and check it for clarity", "start": 469.8, "duration": 2.97}, {"text": "So I've just transferred our two large samples to two glasses.", "start": 473.199, "duration": 2.899}, {"text": "We can look inside and check for clarity and you see the one on the left has slightly yellow tinge to it the one on", "start": 476.099, "duration": 5.34}, {"text": "The right that looks absolutely fantastic and if you look down here", "start": 481.44, "duration": 2.13}, {"text": "You look straight through the glass you can't see any particulate floating around whatsoever", "start": 483.57, "duration": 5.219}, {"text": "This water right here looks beautiful looks refreshing. It looks crystal clear", "start": 489.19, "duration": 3.769}, {"text": "It looks delicious in a survival situation, it's going to be the nectar of life however", "start": 492.96, "duration": 5.1}, {"text": "There's one thing left to do before you drink it and that's to sterilize it", "start": 498.06, "duration": 3.389}, {"text": "Alright guys. I am back with my sterilized water. I just stuck this in the microwave for 4 minutes however", "start": 514.34, "duration": 4.399}, {"text": "There are a lot of alternative methods you could use for purifying water as well such as water purification tablets, UV stir sticks", "start": 518.81, "duration": 6.2}, {"text": "And I've even heard of people sticking water in clear plastic bottles and setting them out in sunlight for 24 to 48 hours", "start": 525.01, "duration": 5.909}, {"text": "But for simplicity on this project I went ahead and use the boiling water method", "start": 531.05, "duration": 3.559}, {"text": "That's the method that's most commonly used and after you boil water for a couple of minutes", "start": 534.61, "duration": 3.63}, {"text": "It's pretty much enough to kill anything in the water that could hurt you so they say so here. We are guys", "start": 538.24, "duration": 4.77}, {"text": "This is the moment of truth. We've got our green scummy pond water that we have transformed into", "start": 543.01, "duration": 4.2}, {"text": "sterilized charcoaled filtered water", "start": 547.73, "duration": 1.83}, {"text": "It's filtered sanitized life-giving zero-Calorie sugar-free gluten-free dairy-free and ready to drink so this is it", "start": 549.56, "duration": 6.799}, {"text": "I'm actually so confident. This is sterilized and ready to drink. I'm just going to down the whole thing here we go", "start": 556.36, "duration": 4.26}, {"text": "Bangarang. That was actually really good that tastes", "start": 567.74, "duration": 3.38}, {"text": "Probably a lot different than this taste. I mean look mosquito Larvae are still having a heyday in there", "start": 572.45, "duration": 6.02}, {"text": "So in a survival situation I choose our charcoal filter water which is made out of materials from the backyard Dirt, sand", "start": 579.35, "duration": 7.129}, {"text": "Charcoal and look how crystal-clear that comes out this is a viable option guys", "start": 586.7, "duration": 4.279}, {"text": "This is how you survive because water is one of the essentials", "start": 590.98, "duration": 3.15}, {"text": "So there you have a guys that's one cool trick to taking ugly disgusting contaminated water and turning it into sanitized, purified", "start": 594.29, "duration": 6.739}, {"text": "Totally drinkable water it might just save your life now", "start": 601.49, "duration": 3.53}, {"text": "You guys know I post videos every single day", "start": 605.02, "duration": 1.65}, {"text": "So if you're really curious to know whether or not this was actually safe for me to drink", "start": 606.67, "duration": 2.94}, {"text": "click subscribe ring the bell to receive my future post notifications because if I stop posting", "start": 609.71, "duration": 4.789}, {"text": "Well, you'll know what happened", "start": 615.02, "duration": 1.59}, {"text": "Thanks for joining me for this project today if an emergency pops up I hope this might help save your life", "start": 616.61, "duration": 4.34}, {"text": "I'll see you in the next video talk to you then", "start": 620.96, "duration": 2.0}, {"text": "I love charcoal.", "start": 624.04, "duration": 0.92}, {"text": "Just went into my lungs. Oh oh, oh", "start": 626.58, "duration": 3.54}, {"text": "There they go spill it all over the place. You're not having a mess you're not making fun", "start": 631.6, "duration": 3.38}, {"text": "Hey guys quick reminder", "start": 636.92, "duration": 1.22}, {"text": "there's a link in the description right now to download The Walking Dead no man's land for free if you download before the end of", "start": 638.14, "duration": 5.6}, {"text": "July you'll unlock the character, Negan go get em Boys!", "start": 643.749, "duration": 3.351}]