[{"text": "\"Why the heck do you guys need a whole roomful of servers just to make YouTube videos?\"", "start": 0.06, "duration": 5.56}, {"text": "We get asked this...", "start": 5.8, "duration": 2.0}, {"text": "Actually a lot of other questions about our data management and our workflow all the time.", "start": 7.809, "duration": 4.94}, {"text": "So for the last year actually, ever since we got our red cameras,", "start": 12.75, "duration": 3.75}, {"text": "I've been meaning to do an update for you guys on how we handle such heavy footage how we share resources", "start": 16.5, "duration": 6.269}, {"text": "with such a large team and how we do all of that while maintaining our", "start": 23.05, "duration": 5.09}, {"text": "rigorous daily release schedule, so", "start": 28.5, "duration": 3.04}, {"text": "When [G Winn] reached out to us asking us to do a feature on their smooth for camera gimbal,", "start": 32.22, "duration": 6.5}, {"text": "I thought well, hey there's an opportunity", "start": 38.72, "duration": 2.8}, {"text": "Why don't we grab this thing and take it with us while I show you guys the way that data flows", "start": 42.34, "duration": 5.599}, {"text": "Through Linus Media Group to become a video on your screen", "start": 48.28, "duration": 4.38}, {"text": "So while I let you all appreciate the irony of a video about our overly complicated workflow shot on a cell phone with a", "start": 62.08, "duration": 7.5}, {"text": "Simple handheld gimbal, I'll tell you guys a little bit more about the Zoom Four.", "start": 70.11, "duration": 3.979}, {"text": "So it's got a highly integrated control panel down here with apps for both iOS and Android that allow you to control your camera,", "start": 74.25, "duration": 7.369}, {"text": "It's got focus pull and zoom capabilities,", "start": 81.99, "duration": 2.48}, {"text": "It's got the ability to do vertigo shots with one button through the app or manually,", "start": 84.509, "duration": 5.66}, {"text": "It's got what they call phone go mode for instant scene transitions and it's got both a quick standby mode and a one-click mode switch.", "start": 90.17, "duration": 7.259}, {"text": "Everything that we shot outside of the intro and the souter right now was filmed on this.", "start": 97.92, "duration": 4.94}, {"text": "It's got a no date on it right now,", "start": 102.86, "duration": 1.259}, {"text": "But it was shot on an iPhone 10 and I'll let you guys be the judge of the stabilized footage that comes off of it.", "start": 104.119, "duration": 5.7}, {"text": "So to demonstrate some of the challenges with working with red footage,", "start": 109.82, "duration": 3.779}, {"text": "We're actually gonna take", "start": 113.6, "duration": 1.21}, {"text": "That intro that we just shot just now and we're gonna ingest the whole thing to show you guys how we do it now.", "start": 114.81, "duration": 5.569}, {"text": "Red cameras are not great for recording audio. In fact even with an external preamp,", "start": 121.19, "duration": 5.729}, {"text": "It is really difficult to get anything resembling usable audio out of the camera directly.", "start": 126.92, "duration": 5.699}, {"text": "So recently we finally gave in and resorted to an external audio recorder.", "start": 132.62, "duration": 5.1}, {"text": "It really sucks to synchronize audio, especially if you're stuck using the scratch audio that gets recorded directly to the camera,", "start": 137.91, "duration": 7.099}, {"text": "And then the SD card out of your external recorder and aligning it manually.", "start": 145.01, "duration": 3.93}, {"text": "But we recently got a little doodad called a \"tentacle sync\".", "start": 149.22, "duration": 3.259}, {"text": "You get two pieces here: A master that sits on our mix pre-six, and a slave that sits on our camera you synchronize them at.", "start": 152.579, "duration": 7.28}, {"text": "The beginning of the day and what they do is they inject what's called time code into the mag and into the SD card,", "start": 159.86, "duration": 6.149}, {"text": "So that you can easily synchronize them later on down the line.", "start": 166.009, "duration": 3.011}, {"text": "But that is far from the only problem.", "start": 170.42, "duration": 3.86}, {"text": "So the thing about the Weapon 8K,", "start": 174.29, "duration": 2.28}, {"text": "So that's our camera recently renamed the DSM-C2... Helium or something like that, is that it records footage.", "start": 176.57, "duration": 7.679}, {"text": "they're both the same camera at up to 8K/60 frames per second, and", "start": 184.249, "duration": 5.551}, {"text": "with the 480 or 960 gig Meg's that's up to", "start": 189.8, "duration": 3.68}, {"text": "hundred megabytes per second.", "start": 194.43, "duration": 1.64}, {"text": "So to put that in perspective if we were filming a simple Techlinked episode,", "start": 196.07, "duration": 4.589}, {"text": "Even though we will usually use like a twenty to one compression ratio,", "start": 201.12, "duration": 5.149}, {"text": "So that's about four times the compression that they would probably use on something like a feature film,", "start": 206.27, "duration": 5.039}, {"text": "That means that a 10 gig clip could still end up being in the neighborhood of about - a 10 gig clip.", "start": 211.31, "duration": 6.78}, {"text": "that means that a 10 minute clip could still end up being in the neighborhood of around 50 gigs, and", "start": 219.12, "duration": 6.289}, {"text": "While it's less of an issue for something like Linus Tech Tips or Tech Quickie when you're recording dailies,", "start": 226.05, "duration": 5.69}, {"text": "And you're expected to release the video on the same day that you film it like with something like a new show,", "start": 231.74, "duration": 5.339}, {"text": "Size of files ends up becoming a potential problem,", "start": 238.35, "duration": 3.169}, {"text": "so that's why our to ingest stations which you might recognize from one of our", "start": 241.52, "duration": 4.289}, {"text": "Tech Showdown episodes are both equipped with 10 gigabit network cards.", "start": 246.12, "duration": 4.369}, {"text": "So one of them has this Asus one,", "start": 250.49, "duration": 2.099}, {"text": "which is basically the last generation version of this \"Aqtion 1\", they're both using a quantities that", "start": 252.59, "duration": 6.69}, {"text": "Allow them to be somehow under $100 for 10 gig networking.", "start": 259.71, "duration": 4.129}, {"text": "There are a number of different ways that we ingest footage depending on the type of camera we're using,", "start": 264.08, "duration": 4.36}, {"text": "So for Red, you can see each of our video clips is actually a folder made up of smaller broken up video clips.", "start": 268.46, "duration": 6.56}, {"text": "So we're gonna go ahead and grab that and...", "start": 275.03, "duration": 2.0}, {"text": "Copy the whole thing into our project folder...", "start": 277.38, "duration": 3.169}, {"text": "For this video, so that goes in A-Roll One.", "start": 281.19, "duration": 2.869}, {"text": "What we're looking at right here is probably some kind of like weird buffering thing or something,", "start": 284.85, "duration": 4.85}, {"text": "But this is about what we'd expect to see in terms of our ingest speeds.", "start": 289.7, "duration": 4.199}, {"text": "It's not the full 10 gigabit because that would be in the neighborhood of one to 1.1 gigabytes per second,", "start": 294.6, "duration": 6.739}, {"text": "But the reality of it is that you're going to run into bottlenecks elsewhere.", "start": 301.34, "duration": 4.5}, {"text": "And in fact these Red Meg's even though we're using an eSATA", "start": 305.84, "duration": 3.209}, {"text": "Interface for them are just not that fast, and they only read it about", "start": 309.15, "duration": 3.83}, {"text": "230 megs a second. Then what we got to do is", "start": 313.94, "duration": 4.04}, {"text": "Grab the audio clip off of our SD card that goes into our audio folder right here, and that's pretty much the whole process", "start": 317.98, "duration": 6.84}, {"text": "for RED footage. But", "start": 325.66, "duration": 2.96}, {"text": "For that we wouldn't need powerful machines, and there is a reason that each of these is running", "start": 328.62, "duration": 4.88}, {"text": "64 gigs of ram and a 10 core Extreme Edition", "start": 333.61, "duration": 2.69}, {"text": "processor, and that's because for our other cameras like the A7-S for example,", "start": 336.64, "duration": 5.209}, {"text": "we actually use Adobe Prelude, which is an", "start": 341.92, "duration": 3.23}, {"text": "imperfect piece of software, but", "start": 345.76, "duration": 2.0}, {"text": "Has its uses to transcode the footage when we're bringing it in.", "start": 348.22, "duration": 4.94}, {"text": "So what we do is we take whatever project it is, and this is generally fast as possible,", "start": 353.2, "duration": 4.429}, {"text": "we still shoot that on the A7-S, we create a subfolder and we set it to transcode to Cinnaform 4k. This improves our", "start": 357.63, "duration": 7.08}, {"text": "Timeline performance when we're scrubbing through the clips in Adobe Premiere.", "start": 364.81, "duration": 3.47}, {"text": "The other thing that we do is set a second destination for the original files that we're not", "start": 368.74, "duration": 5.029}, {"text": "Transcoding just in case something goes wrong with the transcode,", "start": 374.02, "duration": 2.959}, {"text": "Which does happen from time to time, and we need to go back and grab the original files.", "start": 377.32, "duration": 5.059}, {"text": "Now just to give you some idea", "start": 382.87, "duration": 1.77}, {"text": "Even if we're not using the full potential of this network connection all the time of what it's capable of,", "start": 384.64, "duration": 5.6}, {"text": "Let's go ahead and just grab a file off the desktop and show you just what this puppy can do.", "start": 390.4, "duration": 6.14}, {"text": "So that is saturating the read speeds of the RAID 1 SSDs that each of these machines are booted off of, so that was a 10 gigabyte file.", "start": 397.52, "duration": 9.12}, {"text": "Let's go have a look on the other end of this Ethernet cable at how exactly that whole thing comes together now.", "start": 407.02, "duration": 5.779}, {"text": "I've shown you guys our server room...", "start": 412.8, "duration": 2.0}, {"text": "fair number of times, but I haven't given you guys an update in quite a while on", "start": 415.15, "duration": 4.909}, {"text": "How exactly it's working in here.", "start": 420.64, "duration": 2.179}, {"text": "So the main server that everyone is editing off of at the same time is this one right here.", "start": 424.6, "duration": 6.11}, {"text": "This is Whonnock server, and it's running", "start": 430.84, "duration": 2.76}, {"text": "24 plus 1/2 four or five six seven, so it's running 31", "start": 433.9, "duration": 5.04}, {"text": "Intel 750 series 1.1 terabyte NVMe SSDs, and this guy is an absolute monster.", "start": 439.55, "duration": 7.669}, {"text": "So if we fire up Performance Monitor, you can see that even though we've got four of our editors in office right now,", "start": 447.94, "duration": 6.7}, {"text": "And we're seeing each of them doing a hundred and fifty, one hundred and twenty,", "start": 454.64, "duration": 4.5}, {"text": "Fifty megabytes a second of reads. This thing is barely suffering and our", "start": 459.47, "duration": 5.12}, {"text": "There we go. Our Z disk queue-death is only about", "start": 465.65, "duration": 2.809}, {"text": "0.5. That's the benefit of", "start": 468.98, "duration": 2.36}, {"text": "Nvme, is that nice fast responsiveness.", "start": 471.89, "duration": 2.57}, {"text": "And in fact when we were still using our SATA", "start": 474.46, "duration": 3.059}, {"text": "SSD server for every one. We were starting to run into issues", "start": 477.82, "duration": 3.72}, {"text": "Once we had the room fully staffed over there, where Adobe Premiere would crash, but not just crash.", "start": 481.54, "duration": 5.12}, {"text": "Everyone's would crash at the same time and we narrowed that down to slow response times on our NAS.", "start": 487.31, "duration": 6.59}, {"text": "So this guy's connected at 40 gigabits per second.", "start": 494.18, "duration": 3.529}, {"text": "This one right here has 24 SATA SSDs. And this one only gets used", "start": 498.4, "duration": 5.72}, {"text": "This is called QQ server. This one only gets used for", "start": 504.12, "duration": 3.84}, {"text": "Large projects that only one person needs to work on at a time.", "start": 508.49, "duration": 4.55}, {"text": "It's still SSD based. So we still don't run into any crashes or any other weird issues like that,", "start": 513.17, "duration": 5.239}, {"text": "But it doesn't have quite the snap that an NVMe machine does.", "start": 519.08, "duration": 3.649}, {"text": "Now something that we learned a really valuable lesson about I", "start": 523.79, "duration": 4.189}, {"text": "guess it must have been about two years ago was", "start": 528.65, "duration": 2.63}, {"text": "Real-time data replication and off-site backup and that is where this guy comes in.", "start": 531.8, "duration": 6.17}, {"text": "So I want to show you guys a little trick here...", "start": 538.1, "duration": 2.119}, {"text": "I don't know. If I've ever actually done this demo in a video before I've shown people that have come into our office.", "start": 540.22, "duration": 5.759}, {"text": "So I'm going to use my test folder here and I'm going to create a document called", "start": 546.2, "duration": 5.4}, {"text": "\"Test For Video\" right here. This is a text file on our main drive.", "start": 551.78, "duration": 5.0}, {"text": "Then I'm going to jump over to this hard drive based server under it.", "start": 556.91, "duration": 3.949}, {"text": "So this is running 8 8 terabyte drives for a total of 64 terabytes,", "start": 560.9, "duration": 5.209}, {"text": "And I'm just gonna pull up the Whonnock sink folder...", "start": 567.97, "duration": 4.519}, {"text": "Get that test folder open, test Iridium- Wa-pow!", "start": 574.75, "duration": 3.44}, {"text": "Just like that. So within about five to ten seconds,", "start": 578.74, "duration": 3.89}, {"text": "Whether it's a text file or whether it's a large video file, the synchronization software that we're running here will", "start": 582.63, "duration": 6.84}, {"text": "Automatically dump it over to here,", "start": 589.84, "duration": 1.64}, {"text": "so if this crashes we can actually continue editing videos within about 10 to 15 minutes of", "start": 591.48, "duration": 6.33}, {"text": "Switching over everyone's map drives. And another benefit that it gives us is that normally on a network drive when you delete a file?", "start": 598.06, "duration": 7.1}, {"text": "It's just gone, but instead check this out.", "start": 605.62, "duration": 3.979}, {"text": "If I delete \"test for video\", I'm actually going to have to do it from a separate server, but if I delete \"test for video\"...", "start": 609.85, "duration": 6.2}, {"text": "Boop you're gone you're done.", "start": 620.38, "duration": 2.33}, {"text": "And I go into here...", "start": 625.36, "duration": 1.86}, {"text": "That file is going to disappear. But...", "start": 627.22, "duration": 3.32}, {"text": "What will happen is we can go into the deletions folder and we can rescue it. This has actually saved our butts", "start": 630.64, "duration": 9.24}, {"text": "more times than I would like to admit, because", "start": 639.9, "duration": 3.12}, {"text": "Stuff does get accidentally deleted.", "start": 643.12, "duration": 2.36}, {"text": "Now all of this is only for active projects that we are working on right now.", "start": 645.97, "duration": 6.44}, {"text": "Once we're done with something, it goes on to Petabyte Project, and we're actually running", "start": 653.05, "duration": 5.0}, {"text": "Both phases of it right now when we originally deployed it.", "start": 658.36, "duration": 3.23}, {"text": "We were only using one of them so we could just save power on ours for all the drives that were in the other one.", "start": 661.59, "duration": 5.699}, {"text": "Not the case anymore. So Petabyte Project is now up to", "start": 667.6, "duration": 3.89}, {"text": "777 terabytes of total space of which we've consumed four hundred and thirty-two.", "start": 672.49, "duration": 5.479}, {"text": "This holds all of our archived projects, so that in the event that we want to make a video that", "start": 678.34, "duration": 5.54}, {"text": "refers back to one of our other videos,", "start": 683.88, "duration": 3.0}, {"text": "We can grab the original quality files rather than downloading off YouTube like a lot of other YouTubers do. Bringing us into this room...", "start": 686.88, "duration": 6.9}, {"text": "One of the biggest challenges is not just working with red footage because the files are so heavy,", "start": 693.88, "duration": 5.359}, {"text": "one of the biggest problems that we have is that we've got", "start": 699.87, "duration": 2.369}, {"text": "Multiple people working off of that same shared NAS all at the same time. So this is", "start": 702.34, "duration": 5.84}, {"text": "Where the 10 gigabit connections that our editors are also using comes in. When we're scrubbing through footage,", "start": 709.72, "duration": 5.719}, {"text": "We can actually see data rates in excess of two-and-a-half gigabit per second,", "start": 715.44, "duration": 4.65}, {"text": "so we peaked at just shy of four gigabit per second. That", "start": 720.09, "duration": 5.79}, {"text": "My friends is why we've got the bangin NAS with the high-speed networking.", "start": 725.88, "duration": 5.64}, {"text": "So once the edit's done, Taron or one of our other editors will export the entire project as an MOV, but those are extremely inefficient", "start": 732.04, "duration": 10.28}, {"text": "Files, so they're- they're great quality, but they're absolutely massive.", "start": 742.42, "duration": 3.88}, {"text": "So he's gonna copy that those in the transcode flow plane. Yeah, and then you paste it here...", "start": 746.74, "duration": 5.3}, {"text": "Now what's gonna happen there is that", "start": 752.98, "duration": 2.48}, {"text": "Water-cooled server that I built a while ago the one that's at the very bottom of the rack,", "start": 755.5, "duration": 3.6}, {"text": "Is going to see that that file got transferred, and then it's going to spit out", "start": 759.22, "duration": 4.76}, {"text": "the correct formats for all the different platforms that we upload to, whether it be YouTube or Flowplane or", "start": 764.38, "duration": 5.78}, {"text": "Facebook or whatever the case may be that way. The editors machine doesn't get tied up with this. So this is cool,", "start": 770.56, "duration": 6.619}, {"text": "Once that file is done copying. It does take a second and Media Encoder is not always perfect", "start": 777.34, "duration": 6.349}, {"text": "Before it'll pick it up, but we use VNC in order to remote into that machine", "start": 784.42, "duration": 4.56}, {"text": "So everyone can go in at the same time unlike Remote Desktop Connection, and make sure that it has actually picked up the project and that it's transcoding to the correct format.", "start": 789.1, "duration": 8.38}, {"text": "Okay, cool. The system works, so", "start": 797.71, "duration": 2.419}, {"text": "Thanks for watching guys. If you disliked this video you can hit that button,", "start": 800.86, "duration": 3.589}, {"text": "But if you liked it, hit like, get subscribed, or maybe consider checking out where to buy the stuff", "start": 804.45, "duration": 3.539}, {"text": "We featured at the link in the video description.", "start": 807.99, "duration": 2.0}, {"text": "Also down there is our merch store which has cool shirts like this one, and our community forum, which you should totally join.", "start": 810.19, "duration": 5.75}]