[{"text": "This video was made possible by SquareSpace.", "start": 0.0, "duration": 2.14}, {"text": "Start building your website for free at squarespace.com/RLL, and then", "start": 2.14, "duration": 4.06}, {"text": "when you're ready to launch, use the code \"RLL\" to get 10% off at checkout.", "start": 6.2, "duration": 4.4}, {"text": "Life on earth can be a dangerous one", "start": 10.6, "duration": 2.24}, {"text": "Some things are poisonous, other things have sharp teeth, and more things can kill you without", "start": 12.84, "duration": 4.32}, {"text": "you even noticing.", "start": 17.16, "duration": 1.12}, {"text": "In theory, anything could kill you.", "start": 18.28, "duration": 2.02}, {"text": "Really, it just depends on how much or how little of it gets inside of you.", "start": 20.3, "duration": 3.96}, {"text": "In this video, I'll be comparing the most dangerous materials and substances known to mankind with", "start": 24.26, "duration": 5.22}, {"text": "a lethal dose being administered to an average human weighing 62 kilograms.", "start": 29.48, "duration": 4.36}, {"text": "If you weigh less than that, these doses will all be smaller for you, and if you weigh more, then", "start": 33.84, "duration": 4.72}, {"text": "the doses will be greater.", "start": 38.56, "duration": 1.34}, {"text": "So considering the weight of the average human, we're going to start off with regular water.", "start": 39.9, "duration": 4.28}, {"text": "In order to die from a lethal dose of water, you would need to drink 5.6 kilograms or one and a half", "start": 44.18, "duration": 5.72}, {"text": "gallons in a rapid amount of time.", "start": 49.9, "duration": 2.22}, {"text": "Other common household items you need to consume a ridiculous amount of to die from include", "start": 52.12, "duration": 4.92}, {"text": "table sugar, which you would need to slam down 1.8 kilos worth of to die from.", "start": 57.32, "duration": 5.04}, {"text": "But if you're feeling salty, you need to consume a whole kilogram of MSG to die that way.", "start": 62.36, "duration": 5.52}, {"text": "Death by Vitamin C requires you consuming 738 grams, and death by alcohol means you need to consume", "start": 67.88, "duration": 7.4}, {"text": "438 grams of pure ethanol, which is roughly 25 shots worth of 80 proof vodka.", "start": 75.28, "duration": 5.94}, {"text": "If you prefer smoking, then you should know that it takes 79 grams of pure THC to create a lethal response", "start": 81.22, "duration": 6.36}, {"text": "inside of the body.", "start": 87.58, "duration": 1.04}, {"text": "Since cannabis leaves only have a small amount of THC inside of them you would need to smoke an", "start": 88.62, "duration": 4.7}, {"text": "outrageous amount of weed to die from an overdose,", "start": 93.38, "duration": 3.36}, {"text": "approximately 680 kilograms, or half the weight of a Toyota Corolla, in 15 minutes.", "start": 96.78, "duration": 7.28}, {"text": "Drugs like Ibuprofen can be lethal at around 40 grams, which is about the same weight as an adult mouse,", "start": 104.06, "duration": 5.28}, {"text": "while chemicals like hydrochloric acid approach lethal levels at about 15 grams.", "start": 109.34, "duration": 4.96}, {"text": "In a concentrated, pure form, caffeine can kill you in as little as 12 grams.", "start": 114.3, "duration": 4.82}, {"text": "But that shouldn't make you worry about drinking caffeinated drinks because you would need to", "start": 119.12, "duration": 3.38}, {"text": "consume 116 cans of Red Bull, or 60 cups of Americano coffee to induce a lethal reaction that way.", "start": 122.5, "duration": 7.2}, {"text": "Drugs like MDMA, or Ecstacy, aren't much worse with a lethal dose being around 11 grams worth.", "start": 129.7, "duration": 5.64}, {"text": "Eating a block of Uranium about the same size as a €1 coin would probably be enough to kill, while consuming", "start": 135.34, "duration": 6.08}, {"text": "a US quarter-weight worth of cocaine would also do the trick.", "start": 141.42, "duration": 3.12}, {"text": "Thiopental Sodium, the ingredient used in most lethal injections, can induce a fatal reaction in as little as", "start": 144.54, "duration": 5.56}, {"text": "4 grams.", "start": 150.1, "duration": 0.92}, {"text": "While methamphetamine can do the same in just 3 and a half grams.", "start": 151.02, "duration": 3.36}, {"text": "But Mercury is even worse, an extremely toxic metal used in applications like thermometers that can", "start": 154.38, "duration": 5.8}, {"text": "kill you with as little as a US penny-sized amount.", "start": 160.18, "duration": 3.36}, {"text": "But after this point is where we arrive at the most lethal hard recreational drugs,", "start": 163.54, "duration": 4.8}, {"text": "Heroin and LSD, both of which can kill you in as little as one gram, or about the same weight as two raisins.", "start": 168.34, "duration": 7.46}, {"text": "In its pure form, Nicotene can also be lethal in doses as small as 403 milligrams.", "start": 176.4, "duration": 5.36}, {"text": "But since tobacco leaves have so little, your only risk of dying from smoking cigarettes is the long-term", "start": 181.76, "duration": 4.7}, {"text": "health effects associated with them, like cancer.", "start": 186.46, "duration": 2.28}, {"text": "The most venomous scorpion in the world is the appropriately named Deathstalker Scorpion, and its", "start": 188.74, "duration": 5.56}, {"text": "venom can kill you in a dosage as small as 267 milligrams, which is only slightly less dangerous than", "start": 194.3, "duration": 7.02}, {"text": "Hydrogen Cyanide, which can kill you in as little as 229 milligrams, or about the same as a one-carat diamond.", "start": 201.32, "duration": 7.78}, {"text": "But nothing that we've covered so far is as dangerous as what's about to come next.", "start": 209.1, "duration": 4.52}, {"text": "Pufferfish are infamously poisonous and can be fatal to eat since they contain the toxin called tetrodotoxin,", "start": 213.62, "duration": 6.14}, {"text": "and ingesting an amount as small as only 21 milligrams could be enough to kill you.", "start": 219.76, "duration": 5.12}, {"text": "This is almost as toxic as Plutonium, which if it's not being used in a nuclear bomb to kill you, a small", "start": 224.88, "duration": 5.82}, {"text": "sample size of 20 milligrams would also leave you just as dead.", "start": 230.7, "duration": 3.98}, {"text": "If eating mushrooms freaks you out, there's a pretty good reason for that because eating just half", "start": 234.68, "duration": 4.76}, {"text": "of a so-called death cap mushroom would be very, very fatal.", "start": 239.44, "duration": 3.78}, {"text": "This is because they contain amatoxin, 19 milligrams of which will kill you if ingested.", "start": 243.22, "duration": 5.56}, {"text": "But there's still a lot worse to come.", "start": 248.78, "duration": 2.24}, {"text": "Sarin, an odorless and colorless liquid, is so dangerous that it's classified as a weapon of mass destruction", "start": 251.02, "duration": 6.74}, {"text": "under international law.", "start": 257.76, "duration": 1.52}, {"text": "Often used in chemical weapons, a lethal dose amounts to just 11 milligrams, or about the size of a grain of", "start": 259.28, "duration": 6.76}, {"text": "sand.", "start": 266.04, "duration": 0.92}, {"text": "Inhaling a lethal amount can kill you in just 1 to 10 minutes.", "start": 266.96, "duration": 3.94}, {"text": "And even in you survive, permanent nerve damage is almost a guarantee.", "start": 270.9, "duration": 3.82}, {"text": "But weirdly, there's still creatures out there that produce more potent poison than a weapon of", "start": 274.72, "duration": 5.16}, {"text": "mass destruction.", "start": 279.88, "duration": 1.18}, {"text": "Like the Brazilian Wandering Spider, whose venom can kill you in amounts as small as 8 milligrams.", "start": 281.06, "duration": 6.04}, {"text": "Or the Inland Taipan Snake, found in Australia, whose venom can kill you in a dose as small as 2 milligrams,", "start": 287.1, "duration": 6.4}, {"text": "or the weight of a mosquito.", "start": 293.5, "duration": 1.58}, {"text": "The extremely powerful toxin Ricin, produced in the seeds of the castor oil plant, can kill you if you inhale", "start": 295.08, "duration": 5.86}, {"text": "even one milligram, which has made it popular for assassination attempts and biological warfare", "start": 300.94, "duration": 5.62}, {"text": "around the world.", "start": 306.56, "duration": 1.42}, {"text": "But latrotoxin, the venom produced by the Black Widow spider, will kill you even quicker in amounts as small as", "start": 307.98, "duration": 5.12}, {"text": "just 267 micrograms.", "start": 313.1, "duration": 2.82}, {"text": "The strongest poison any known creature makes on its own is batrachotoxin, found in the so-called", "start": 315.92, "duration": 5.1}, {"text": "Poison Dart Frog.", "start": 321.02, "duration": 1.12}, {"text": "124 micrograms is all it takes to kill you, about the same weight as two human eyelashes.", "start": 322.14, "duration": 6.74}, {"text": "But there are at least two substances that are even worse.", "start": 328.88, "duration": 3.34}, {"text": "One is called Polonium-210, so dangerous that that if you inhale just 620 nanograms, about the same as", "start": 332.22, "duration": 7.4}, {"text": "two to three grains of pollen, you would die an agonizing death.", "start": 339.62, "duration": 4.6}, {"text": "it is 250,000 times more toxic than hydrogen cyanide, and was used to assassinate Russian dissident", "start": 344.22, "duration": 7.12}, {"text": "Alexander Litvinenko back in 2006.", "start": 351.34, "duration": 2.92}, {"text": "But by far, the most lethal toxin known to mankind is Botulinum toxin, which is commercially sold", "start": 354.26, "duration": 6.34}, {"text": "as Botox.", "start": 360.6, "duration": 1.06}, {"text": "62 nanograms is all it takes to make you dead, about the same weight as 62 of your body's cells.", "start": 361.66, "duration": 6.5}, {"text": "It's 2.5 million times more toxic than hydrogen cyanide, but only very tiny fractions of that lethal dose", "start": 368.16, "duration": 8.16}, {"text": "are used in commercial Botox.", "start": 376.32, "duration": 2.04}, {"text": "Doctors and medical professionals that administer Botox have websites than can explain much more about", "start": 378.36, "duration": 4.78}, {"text": "this than I can in a short video.", "start": 383.18, "duration": 2.08}, {"text": "But if you're looking to create your own website to help explain what kind of business you do, there's no", "start": 385.26, "duration": 4.9}, {"text": "better place to go to next than SquareSpace.", "start": 390.16, "duration": 2.64}, {"text": "Regardless of what it is you do, whether it's podcasting, art, blogging, or you're looking to create your own", "start": 392.8, "duration": 5.76}, {"text": "YouTube channel, you need a way for people to find you online.", "start": 398.56, "duration": 3.58}, {"text": "SquareSpace can seriously help individuals and small businesses like you and me make something that was", "start": 402.14, "duration": 5.7}, {"text": "previously only available to huge corporations, an amazing, beautifully designed and", "start": 407.84, "duration": 5.1}, {"text": "professional-looking website.", "start": 412.94, "duration": 1.82}, {"text": "With their intuitive and easy-to-use website builder, beautiful design templates, reliable 24/7", "start": 414.76, "duration": 5.22}, {"text": "customer support, and reasonable prices, SquareSpace is the best place to build your online presence and", "start": 419.98, "duration": 5.62}, {"text": "create a lasting first impression when people search for and discover you.", "start": 425.6, "duration": 4.06}, {"text": "And best of all, you can try out SquareSpace for free right now by going to squarespace.com/RLL", "start": 429.66, "duration": 5.94}, {"text": "and then when you're ready to launch, you can get 10% off by using the code \"RLL\" at checkout.", "start": 435.6, "duration": 5.8}]