[{"text": "Video game peripherals, it's just useless junk to get you spend more money, am I right?", "start": 0.3, "duration": 4.12}, {"text": "And Nintendo, they're one of the worst!", "start": 4.42, "duration": 2.12}, {"text": "Donkey Kongas, the N64 Expansion Pak, the DS Expansion Pak,", "start": 6.62, "duration": 4.18}, {"text": "the Wii steering wheel, I definitely got a Balance Board in storage somewhere,", "start": 10.8, "duration": 3.38}, {"text": "[CRASH!]\nbut who am I kidding, I'm not above throwin' money at this kinda thing,", "start": 14.18, "duration": 1.26}, {"text": "but who am I kidding, I'm not above throwin' money at this kinda thing,", "start": 15.44, "duration": 2.16}, {"text": "I love this kinda stuff, and besides,", "start": 17.6, "duration": 2.2}, {"text": "sometimes you find a peripheral that really cuts through the hype and is truly something special!", "start": 19.9, "duration": 4.86}, {"text": "The Gamecube Game Boy Advance Link Cable is maybe Nintendo's most successful peripheral", "start": 24.76, "duration": 4.76}, {"text": "after the... Rumble Pak?!", "start": 29.52, "duration": 2.04}, {"text": "This little guy connects your Game Boy Advance to your Gamecube controller slot,", "start": 31.56, "duration": 3.94}, {"text": "works with either the Gamecube or the Wii, and is the key to unlocking an incredible amount of bonus content!", "start": 35.5, "duration": 6.5}, {"text": "It's compatible with just shy of 60 games, which is pretty amazing,", "start": 42.16, "duration": 3.18}, {"text": "considering the Gamecube was a bit of a flop for Nintendo,", "start": 45.34, "duration": 2.76}, {"text": "selling less than both the original Xbox and the previous-gen N64.", "start": 48.1, "duration": 4.42}, {"text": "I guess more developers were banking on their customers owning a GBA than a Gamecube,", "start": 52.72, "duration": 4.64}, {"text": "which was a safe bet!", "start": 57.36, "duration": 1.5}, {"text": "I've previously talked about the games that require the Link Cable to play,", "start": 58.86, "duration": 3.92}, {"text": "but in this episode we'll be talking about the Gamecube games featuring extra content", "start": 62.78, "duration": 4.1}, {"text": "unlocked with just a cable and a GBA system, no extra game required!", "start": 66.88, "duration": 5.16}, {"text": "Not everyone's got time for double games, Nintendo!", "start": 72.04, "duration": 2.26}, {"text": "Welcome back to Punching Weight, the show that celebrates the weird, ambitious and unnecessary,", "start": 74.32, "duration": 4.4}, {"text": "and I've dug through my Gamecube collection, and I'm ready to show you what kind of secrets are hidden", "start": 78.76, "duration": 4.94}, {"text": "behind the Gamecube Game Boy Advance Link Cable.", "start": 83.78, "duration": 2.78}, {"text": "But first, keepin' fresh is a challenge in the hot, sweaty summer months.", "start": 86.58, "duration": 4.52}, {"text": "I'ma spare you the details, but when it's hot outside, when it's humid...", "start": 91.12, "duration": 3.28}, {"text": "The Swamp is a problem, ya feel me?", "start": 94.46, "duration": 2.14}, {"text": "Manscaped got me set up with the Perfect Package 2.0 kit,", "start": 96.6, "duration": 3.52}, {"text": "it is a packed kit with lots of products to keep you fresh,", "start": 100.12, "duration": 3.34}, {"text": "like the Lawn Mower 2.0, which is 100% waterproof, wire-free,", "start": 103.46, "duration": 5.24}, {"text": "and includes replacement blades to keep the family jewels full 'o tude and nick-free,", "start": 108.7, "duration": 5.4}, {"text": "which is VERY important!", "start": 114.1, "duration": 1.66}, {"text": "20% off your order, plus free shipping and plus, a free travel bag,", "start": 115.76, "duration": 4.48}, {"text": "which is actually the perfect size for games AND all your grooming stuff too!", "start": 120.24, "duration": 3.78}, {"text": "And that's when you use the promo code \"SSFF20\".", "start": 124.14, "duration": 3.04}, {"text": "All Manscaped products feature a 30-day money-back guarantee, so you can try Manscaped risk-free,", "start": 127.28, "duration": 6.4}, {"text": "that's 20% off, plus a free bag, with the promo code \"SSFF20\".", "start": 133.68, "duration": 5.14}, {"text": "And now... onto the show!", "start": 138.88, "duration": 1.86}, {"text": "Gonna link up! Link time!", "start": 141.04, "duration": 2.78}, {"text": "Get linked in! Wait, can't use that one!", "start": 144.26, "duration": 2.38}, {"text": "First off, we gotta start with one of Nintendo's best and most innovative games of the era: Animal Crossing.", "start": 155.36, "duration": 6.14}, {"text": "Seriously, what a unique gem of a game, there was just so much you can do!", "start": 161.5, "duration": 4.14}, {"text": "Plus, it worked with just about every major peripheral Nintendo had at the time!", "start": 165.64, "duration": 4.18}, {"text": "It came with its own memory card, supported the e-Reader, and of course, the Gamecube Link Cable.", "start": 169.82, "duration": 5.04}, {"text": "About the only thing it didn't use was the broadband adapter and microphone,", "start": 174.86, "duration": 4.68}, {"text": "which, of course, would be implemented in future releases.", "start": 179.54, "duration": 3.04}, {"text": "You can actually do quite a lot with Animal Crossing by hooking up a GBA!", "start": 182.9, "duration": 4.04}, {"text": "The most major thing you can do is access the island:", "start": 186.94, "duration": 2.72}, {"text": "At the bottom of your town will always be a dock, usually a good place for fishin',", "start": 189.66, "duration": 3.7}, {"text": "but with a GBA plugged in, Kapp'n shows up", "start": 193.36, "duration": 2.26}, {"text": "and offers to take you to a special island where it's always sunny and summer!", "start": 195.62, "duration": 4.0}, {"text": "Oh hey, it's been 68 weeks since I last went to the island.", "start": 199.72, "duration": 3.42}, {"text": "Wait, 68 weeks, that's not right, we just played this like a few months ago for the e-Reader video...", "start": 203.2, "duration": 3.62}, {"text": "[♫ Mr. Resetti's theme ♫]", "start": 206.82, "duration": 0.52}, {"text": "[inhales sharply] Whoops!\n[♫ Mr. Resetti's theme ♫]", "start": 207.34, "duration": 1.7}, {"text": "Anyway, the island has exclusive fruit, fish, and its very own villager!", "start": 209.04, "duration": 4.72}, {"text": "You can't do much there, but when you leave, you can keep playing on the island with your GBA!", "start": 213.82, "duration": 5.12}, {"text": "If you remember to leave treats and tools there, you can boss your villager around and have them do stuff for ya!", "start": 218.96, "duration": 4.92}, {"text": "Yeah, chop that tree! And that tree too!", "start": 223.92, "duration": 2.56}, {"text": "Now relax and do some fishin'!!", "start": 226.58, "duration": 1.68}, {"text": "I got a little bit too into it and poked them too much, and they got sad and the music slowed down.", "start": 228.3, "duration": 5.14}, {"text": "But I gave 'em some fruit and that cheered 'em right back up. Sorry, buddy.", "start": 233.6, "duration": 2.54}, {"text": "YEAH, MORE FISHIN'!!", "start": 236.14, "duration": 1.24}, {"text": "There's a lot you can do on Animal Island, it's apparently how you farm certain rare things like the NES games.", "start": 237.38, "duration": 6.32}, {"text": "I mean, I have no idea, I just used the cheat codes. C'mon, man.", "start": 243.72, "duration": 2.94}, {"text": "If you hate your island, or want a new islander, or are really impressed with your island,", "start": 246.76, "duration": 4.22}, {"text": "you can trade islands with a friend through the GBA Link Cables!", "start": 251.02, "duration": 3.92}, {"text": "Man, can you believe this game existed without the internet on the Gamecube?", "start": 254.96, "duration": 3.88}, {"text": "It's always gonna be so impressive to me how many really creative ways Nintendo got around that.", "start": 258.84, "duration": 4.94}, {"text": "There are a few more features in Animal Crossing though,", "start": 263.78, "duration": 2.6}, {"text": "like designing stuff on the GBA instead of in-game,", "start": 266.38, "duration": 2.98}, {"text": "which actually saves you a couple hundred Bells! Nice!", "start": 269.36, "duration": 2.96}, {"text": "But the thing that I had no idea you could do is you could download and play NES games on your GBA,", "start": 272.42, "duration": 5.84}, {"text": "which means that not only is there an NES emulator inside of Animal Crossing, it's also, like...", "start": 278.26, "duration": 5.2}, {"text": "Well, it's like a Russian nesting doll emulator situation, right?", "start": 283.46, "duration": 2.74}, {"text": "Like, there's a game with a game, and then shoved into another game system! Like it's awesome!", "start": 286.2, "duration": 4.52}, {"text": "The only problem is that all the two-player modes have been removed,", "start": 290.82, "duration": 3.16}, {"text": "and Excitebike does not have the option to save your tracks, which actually makes sense,", "start": 293.98, "duration": 4.2}, {"text": "the NES games can't stay on your GBA once you turn the system off anyway.", "start": 298.22, "duration": 3.48}, {"text": "Some games like Wario's Woods don't work at all, because it was a late era NES game,", "start": 301.8, "duration": 4.82}, {"text": "and is physically too big for the GBA's memory.", "start": 306.62, "duration": 2.56}, {"text": "Also, did you even know Wario's Woods was in here?", "start": 309.24, "duration": 3.2}, {"text": "Man, Animal Crossing is so cool!", "start": 312.52, "duration": 1.64}, {"text": "VILLAGERS: \"Animal Crossing, for Nintendo Gamecube!\"", "start": 314.2, "duration": 2.42}, {"text": "ROB: \"I just been fishin', ya know?\"", "start": 316.76, "duration": 1.64}, {"text": "DEREK: It's time to talk Zelda!", "start": 318.9, "duration": 1.66}, {"text": "Now, we've already covered Zelda: The Four Swords Adventures,", "start": 320.6, "duration": 3.28}, {"text": "which was basically the flagship Gamecube Link Cable game.", "start": 323.88, "duration": 3.7}, {"text": "It came bundled with one, and each player requires one of their own for multiplayer.", "start": 327.58, "duration": 4.86}, {"text": "But it wasn't the only Zelda game with this compatibility:", "start": 332.5, "duration": 3.3}, {"text": "The Legend of Zelda: The Wind Waker has the Tingle Tuner.", "start": 335.86, "duration": 3.26}, {"text": "This is a 100% optional item that basically turns Wind Waker into a co-op game!", "start": 339.2, "duration": 5.4}, {"text": "Maybe it's just me, but I was kinda shocked at how well-advertised this little inclusion was,", "start": 344.66, "duration": 4.38}, {"text": "because no-one I knew ever talked about it, and it feels like no-one talks about it now, but it's really amazing!", "start": 349.04, "duration": 6.38}, {"text": "Getting the Tingle Tuner is itself a bit of a sidequest:", "start": 355.42, "duration": 2.44}, {"text": "You actually need to release Tingle from his jail on Windfall Island, and then he gives you his GBA.", "start": 357.86, "duration": 5.02}, {"text": "Or... I mean, sorry, \"Magic transmitter\"?", "start": 362.88, "duration": 2.26}, {"text": "Wait a second... if Link got a Not Game Boy Advance,", "start": 365.16, "duration": 3.16}, {"text": "then why the heck did Luigi get a Not Game Boy Color?", "start": 368.34, "duration": 2.56}, {"text": "Hang in there, Luigi! I got stuck with my brother's hand-me-downs too,", "start": 371.04, "duration": 3.16}, {"text": "your year will come, don't worry.", "start": 374.2, "duration": 1.46}, {"text": "- \"ルイジ・イア?\"", "start": 375.66, "duration": 1.48}, {"text": "DEREK: So, the Tingle Tuner lets Tingle act as your Super Guide:", "start": 377.16, "duration": 3.22}, {"text": "He has flavor text and info for just about everywhere you can go,", "start": 380.4, "duration": 3.34}, {"text": "and gives you fun little minigames around the world,", "start": 383.74, "duration": 2.06}, {"text": "like for example, I had to find all the benches in Windfall Island.", "start": 385.8, "duration": 3.44}, {"text": "It's not exactly riveting stuff, but y'know, it works!", "start": 389.4, "duration": 2.54}, {"text": "He also finds you hidden rupees, which comes in handy with the items he can buy to help Link,", "start": 391.94, "duration": 4.8}, {"text": "like balloons to walk on the air, bombs and whatnot!", "start": 396.8, "duration": 3.32}, {"text": "These items ain't cheap though, and the trailer itself admits", "start": 400.14, "duration": 2.72}, {"text": "that there's nothing really to stop your GBA partner from dinglin' up the Tingle Tuner.", "start": 402.86, "duration": 4.44}, {"text": "ANNOUNCER: \"Choose your friends wisely...\"", "start": 407.3, "duration": 2.34}, {"text": "DEREK: It also has its own sidequest: Using the Tuner you can uncover five Tingle statues,", "start": 409.64, "duration": 4.82}, {"text": "and if you get them all, you'll rescue his brother Knuckle who will upgrade the Tuner.", "start": 414.46, "duration": 4.04}, {"text": "The Tingle Tuner was a super-fun little extra", "start": 418.64, "duration": 2.3}, {"text": "that was unfortunately cut in the Wii U HD remake,", "start": 420.94, "duration": 3.9}, {"text": "which I guess they did because they wanted you to have access to the map on the Wii U GamePad at all times?", "start": 424.92, "duration": 5.94}, {"text": "Even though it would've been perfect for the Tingle Tuner!", "start": 430.86, "duration": 2.06}, {"text": "So, uh, instead it had the Tingle Bottle, which was actually a really cool idea,", "start": 432.92, "duration": 4.76}, {"text": "but no longer exists due to Miiverse dying.", "start": 437.76, "duration": 2.9}, {"text": "That means the Tingle Bottle messenger was only available for four years.", "start": 440.66, "duration": 4.36}, {"text": "Man, the Wii U was a weird system.", "start": 445.08, "duration": 1.84}, {"text": "GIRL: \"Find secrets with the Wii U GamePad!\"", "start": 446.92, "duration": 2.18}, {"text": "BOY: \"And did we mention, togetherness?\"", "start": 449.1, "duration": 2.14}, {"text": "- \"Just check out the simulation.\"", "start": 451.26, "duration": 1.42}, {"text": "- \"Yeaah, look like I've been upgraded!\"", "start": 452.92, "duration": 2.26}, {"text": "\"Pow!\"", "start": 455.28, "duration": 0.64}, {"text": "- Alright, so that's a couple 'o Nintenda games,", "start": 456.06, "duration": 1.66}, {"text": "how 'bout we switch gears and talk about Sega games?", "start": 457.72, "duration": 2.84}, {"text": "During the Gamecube days, Sega had just left the hardware business and had really hit the ground running!", "start": 460.56, "duration": 5.08}, {"text": "And it shouldn't really be a surprise that a company that loved making peripherals and add-ons as much as Sega", "start": 465.66, "duration": 5.4}, {"text": "would go a little bonkers with the Gamecube Link Cable.", "start": 471.06, "duration": 2.92}, {"text": "Is it still... oh, it's loading.", "start": 473.98, "duration": 0.98}, {"text": "GRACE: God, it lost... it wants to, just a minute...\nDEREK: Hold on, hold on...", "start": 474.96, "duration": 2.34}, {"text": "- The Gamecube Link Cable, Sega. 's Sonic Adventure now.", "start": 478.34, "duration": 2.88}, {"text": "GRACE: [laughs] These load times!", "start": 481.42, "duration": 1.78}, {"text": "DEREK: Several of Sega's Gamecube and Game Boy Advance games had Gamecube Link Cable support,", "start": 483.2, "duration": 4.56}, {"text": "and they all mostly center around one thing: CHAOS!", "start": 487.76, "duration": 3.86}, {"text": "Oh, sorry, not chaos, Chaos!", "start": 491.62, "duration": 2.1}, {"text": "These little Tamagotchi-like creatures were first introduced in Sonic Adventure,", "start": 493.84, "duration": 3.86}, {"text": "and one of the coolest things about them was you could carry them with you on your Dreamcast VMU!", "start": 497.72, "duration": 4.86}, {"text": "Well, maybe you can, I can't, because my VMU batteries have been dead since the Clinton administration.", "start": 502.62, "duration": 5.3}, {"text": "A bunch of Sonic games for the Gamecube and GBA featured a minigame that utilized the GBA,", "start": 508.0, "duration": 5.16}, {"text": "called the Tiny Chao Garden.", "start": 513.16, "duration": 1.9}, {"text": "Here's how it worked with Sonic Adventure DX:", "start": 515.18, "duration": 2.34}, {"text": "You can go to the Chao Garden, plug in your GBA, grab a Chao, and then go to the GBA kiosk.", "start": 517.54, "duration": 5.12}, {"text": "From there you can transfer your buddy into the Tiny Chao Garden,", "start": 522.66, "duration": 3.5}, {"text": "where you can feed them, play minigames and level up your little guy's stats.", "start": 526.16, "duration": 3.74}, {"text": "Being able to take them on the go with the GBA emulates the Dreamcast VMU,", "start": 529.96, "duration": 4.02}, {"text": "see, I don't even need new batteries for that thing!!", "start": 533.98, "duration": 2.2}, {"text": "But if you turned off the system, or the batteries died before transferring them back to your Gamecube,", "start": 536.18, "duration": 4.5}, {"text": "you'd lose all the work you did. Forever!", "start": 540.7, "duration": 2.76}, {"text": "However, Sonic Advance 1, 2 and Pinball Party for the GBA all have the Tiny Garden minigame too,", "start": 543.6, "duration": 5.74}, {"text": "and you can transport and save your little Chaos there as well!", "start": 549.34, "duration": 3.12}, {"text": "We don't actually have any of these GBA games, but it didn't matter", "start": 552.46, "duration": 3.3}, {"text": "because, and this is maybe the coolest thing,", "start": 555.76, "duration": 2.08}, {"text": "you can use the Tiny Chao Garden to transport your Chao into other games,", "start": 557.84, "duration": 4.38}, {"text": "which is how we got this adorable Tails Chao!", "start": 562.22, "duration": 3.28}, {"text": "You see, Sonic games didn't have the market cornered on Sega Link Cable extras.", "start": 565.56, "duration": 4.6}, {"text": "There are minigame extras in other games too, like my favorite Sonic Team series,", "start": 570.16, "duration": 4.1}, {"text": "Phantasy Star Online, or PSO.", "start": 574.3, "duration": 2.62}, {"text": "The Gamecube version featured a four-player splitscreen couch co-op,", "start": 576.98, "duration": 3.52}, {"text": "which I played for dozens of hours in college, it's still one hell of a great game, and...", "start": 580.5, "duration": 4.94}, {"text": "Oh god, if I don't get back on track I might get addicted to this game all over again...", "start": 585.44, "duration": 3.52}, {"text": "... anyway! There are four downloadable GBA games in PSO,", "start": 588.98, "duration": 3.78}, {"text": "and the easiest one to access is the Tiny Chao Garden, similar to the one in Sonic DX,", "start": 592.76, "duration": 4.22}, {"text": "though it's hidden away and extremely easy to miss:", "start": 596.98, "duration": 2.9}, {"text": "On the mission The Fake in Yellow, after you finish the quest but before collecting your reward,", "start": 599.88, "duration": 4.7}, {"text": "warp back down to Forest 1 and walk up to the waterfall, and surprise! It's a Chao!", "start": 604.58, "duration": 5.02}, {"text": "Now head back up to Pioneer II, and the same GBA kiosk from Sonic Adventure DX will be there.", "start": 609.6, "duration": 5.3}, {"text": "It'll only be loaded with Tiny Garden, but you'll be greeted by a Tails Chao.", "start": 614.94, "duration": 4.56}, {"text": "After poking and feeding him for a little bit, I put down my GBA, turned off PSO, booted up Sonic DX,", "start": 619.52, "duration": 5.62}, {"text": "went to the Chao Garden in the hotel and transported Tails off my GBA and into my Gamecube,", "start": 625.18, "duration": 4.64}, {"text": "and boom! My sweet prince had arrived!", "start": 629.82, "duration": 2.64}, {"text": "I then tried to feed him Dark fruit, hoping to turn him evil, but it turns out Tails is just too pure.", "start": 632.6, "duration": 5.52}, {"text": "Also, I don't know anything about how Chaos work.", "start": 638.32, "duration": 2.08}, {"text": "But what about the other three unlockable Sonic Team minigames in PSO,", "start": 640.86, "duration": 3.92}, {"text": "Chu Chu Rocket! Challenge, NiGHTS Score Attack and Puyo Pop Endless Version?", "start": 644.78, "duration": 3.6}, {"text": "Unfortunately the Tiny Chao Garden is the only GBA minigame attached to an offline quest.", "start": 648.38, "duration": 5.72}, {"text": "To get access to the other three, you need access to the online quests,", "start": 654.1, "duration": 3.44}, {"text": "which means you'll have to do one of the following:", "start": 657.54, "duration": 2.08}, {"text": "Get your Gamecube online and on a server, which you actually can totally still do today,", "start": 659.62, "duration": 4.78}, {"text": "thanks to some awesome fan communities, and complete the missions,", "start": 664.4, "duration": 2.76}, {"text": "or get a copy of PSO I & II Plus, which has all online-only quests available offline,", "start": 667.16, "duration": 6.76}, {"text": "but that game is rare and kind of expensive,", "start": 673.96, "duration": 1.74}, {"text": "or you can just play them all in Billy Hatcher and the Giant Egg!", "start": 675.7, "duration": 3.58}, {"text": "Yeah, when was the last time you thought about THIS game?!", "start": 679.3, "duration": 2.56}, {"text": "Big Boy Billy Hatcher was basically Sonic Team's last big new IP before diving full-tilt into \"Sonic! Sonic! Sonic!\"", "start": 681.92, "duration": 6.74}, {"text": "And it's a pretty cool game! It has five GBA minigames", "start": 688.66, "duration": 3.12}, {"text": "that you unlock by hatching special eggs in various levels,", "start": 691.78, "duration": 2.88}, {"text": "and three of these minigames are the exact same as the ones tied to online quests in PSO!", "start": 694.66, "duration": 5.12}, {"text": "It took some doing to unlock them, but let's run down them by starting with Chu Chu Rocket! Challenge.", "start": 699.8, "duration": 5.12}, {"text": "This is a 24-stage challenge mode, with a good variety of stages, it's a really solid demo!", "start": 705.22, "duration": 5.18}, {"text": "However, they are the exact same stages found in the GBA version, just with way, way worse music.", "start": 710.4, "duration": 5.54}, {"text": "GBA Chu Chu Rocket! is a great port of a great Dreamcast game,", "start": 715.96, "duration": 3.48}, {"text": "except the lack of buttons on the GBA makes the time-based stages extra stressful and... well, challenging.", "start": 719.44, "duration": 6.06}, {"text": "Really, the highlight of that port is the crazy amount of chill puzzles.", "start": 725.5, "duration": 4.16}, {"text": "This minigame is all time-based, all the time, plus there's nothing really exclusive about it,", "start": 729.7, "duration": 4.34}, {"text": "so for me, it was a bit of a letdown.", "start": 734.04, "duration": 2.02}, {"text": "Contrast that to the Puyo Pop minigame, which is probably my favorite one:", "start": 736.14, "duration": 3.82}, {"text": "This is basically just the Endless mode from the Puyo Pop GBA game, with the same two sub-modes:", "start": 739.96, "duration": 5.52}, {"text": "Task mode, where you play until you run out of time,", "start": 745.48, "duration": 2.12}, {"text": "and Normal mode, where you play until you reach the top and die.", "start": 747.62, "duration": 2.6}, {"text": "And I mean \"die\", you can't pause and quit to the menu,", "start": 750.22, "duration": 2.5}, {"text": "and you also can't turn off the system or you'll lose your scores?", "start": 752.72, "duration": 2.62}, {"text": "The controls feel kinda stiff, but otherwise this is a great get!", "start": 755.4, "duration": 3.48}, {"text": "I mean, it's classic Puyo Puyo, one of the all-time great puzzle games!", "start": 758.88, "duration": 3.22}, {"text": "It's nuthin' you can't find in any other Puyo Puyo game,", "start": 762.1, "duration": 2.9}, {"text": "but it's probably still the best minigame on either Billy Hatcher or PSO.", "start": 765.0, "duration": 3.64}, {"text": "But probably the most important minigame in this package is NiGHTS Score Attack.", "start": 768.68, "duration": 3.98}, {"text": "NiGHTS is definitely one of Sonic Team's most important games,", "start": 772.7, "duration": 3.1}, {"text": "and it still blows my mind that for such an iconic Sega character, he's only had, I guess, four games,", "start": 775.8, "duration": 5.18}, {"text": "and one of them is a minigame locked away in Phantasy Star Online and Billy Hatcher and the Giant Egg,", "start": 780.98, "duration": 5.44}, {"text": "makes me wonder if there ever were plans to make a full GBA game.", "start": 786.42, "duration": 3.04}, {"text": "Overall, this is standard NiGHTS fare: Collect all the gems and loops before time runs out.", "start": 789.5, "duration": 4.18}, {"text": "It's got great music, of course, and it looks pretty sharp!", "start": 793.68, "duration": 2.46}, {"text": "It's too bad there's just not much to it: There are only four stages that loop,", "start": 796.14, "duration": 3.84}, {"text": "and like the name implies, it's a race against the clock to get the highest score possible.", "start": 799.98, "duration": 3.7}, {"text": "It's pretty hard! It wants you to hurry up, but also not miss anything,", "start": 803.68, "duration": 3.2}, {"text": "which is pretty tough when your character controls with the grace of a whale!", "start": 806.88, "duration": 3.44}, {"text": "Still, it's a neat little bonus for NiGHTS fans out there!", "start": 810.74, "duration": 2.32}, {"text": "Of course, Big Boy Billy's got his own exclusive minigames: Billy Hatcher Hyper Shoot,", "start": 813.16, "duration": 4.3}, {"text": "which is sort of like a bowling-billiards-shooter kinda game that I actually really liked!", "start": 817.52, "duration": 4.76}, {"text": "Might go through the trouble of playing more Billy Hatcher to unlock the Hard mode version!", "start": 822.28, "duration": 4.28}, {"text": "To unlock all these, you have to play through a large chunk of the game,", "start": 826.6, "duration": 3.18}, {"text": "it took me about, like, I guess six hours to unlock them all?", "start": 829.78, "duration": 2.8}, {"text": "Though that's maybe because it was my first time playing in, like, forever.", "start": 832.58, "duration": 3.24}, {"text": "And there are worse ways to spend your time!", "start": 835.82, "duration": 1.94}, {"text": "Billy Hatcher and the Giant Egg is rough around the edges with its controls and camera.", "start": 837.88, "duration": 4.2}, {"text": "It's also a pretty weird concept, but it's still pretty charming!", "start": 842.14, "duration": 3.08}, {"text": "It has great music, and is one of the last flashes of that classic creativity from early 2000's Sega.", "start": 845.24, "duration": 6.7}, {"text": "It's kind of the end of an era, and could use a remaster,", "start": 851.98, "duration": 3.4}, {"text": "I'd recommend it on its own merits, as well as for these minigames.", "start": 855.38, "duration": 2.94}, {"text": "And speaking of ends of an era, Rayman 3: Hoodlum Havoc!", "start": 858.32, "duration": 3.78}, {"text": "This game with \"HUGE FEATURES\" also includes some pretty sizeable GBA connectivity,", "start": 862.12, "duration": 4.76}, {"text": "giving the Gamecube version an edge over the others!", "start": 866.88, "duration": 2.86}, {"text": "It's one of those rare games that has compatibility both with and without a corresponding GBA game,", "start": 869.8, "duration": 4.9}, {"text": "so I came prepared! I got both the Gamecube and GBA versions,", "start": 874.7, "duration": 3.6}, {"text": "only I accidentally got myself the PAL version of the GBA game,", "start": 878.3, "duration": 3.44}, {"text": "and turns out you can't cross those streams.", "start": 881.74, "duration": 2.86}, {"text": "But I was still able to go Seattle's Pink Gorilla and exchange it out for this lil' pink buddy over here.", "start": 884.6, "duration": 4.64}, {"text": "Thanks, Kelsey!", "start": 889.44, "duration": 0.82}, {"text": "And actually, some of Rayman 3's GBA connectivity isn't all that much to write home about.", "start": 890.38, "duration": 4.44}, {"text": "There's 2D Madness mode, which is a fun throwback to the series' roots, it's kinda like a Rayman remake,", "start": 894.84, "duration": 5.02}, {"text": "but it was also featured in the PC port, so it's not exclusive.", "start": 899.86, "duration": 3.3}, {"text": "There is an exclusive minigame called 2D Nightmare,", "start": 903.18, "duration": 2.58}, {"text": "which was supposed to unlock when you beat all the levels in the GBA game,", "start": 905.76, "duration": 3.34}, {"text": "but there's a glitch that makes it so the GBA never registers the final level,", "start": 909.1, "duration": 4.1}, {"text": "meaning the only way to play this game is with a cheat device.", "start": 913.2, "duration": 2.86}, {"text": "Turns out that doesn't matter all that much,", "start": 916.1, "duration": 2.02}, {"text": "because there are minigames you can play without the GBA game!", "start": 918.12, "duration": 3.2}, {"text": "And the Mad Trax mode is probably the best example of multiplayer Gamecube-GBA connectivity,", "start": 921.34, "duration": 5.66}, {"text": "and straight up one of the coolest co-op games I've ever played! Here's how it goes:", "start": 927.0, "duration": 4.02}, {"text": "The player on the GBA lays down track in Tetris-shaped chunks, dodges or blows up asteroids,", "start": 931.04, "duration": 4.84}, {"text": "while the Gamecube player attempts to drive on that mess they've made.", "start": 935.88, "duration": 3.34}, {"text": "The pressure is on! You have a limited time, and pieces disappear only a few seconds after being laid down.", "start": 939.28, "duration": 5.36}, {"text": "It's fast-paced, and the driving controls are a little rough,", "start": 944.7, "duration": 2.92}, {"text": "but I think it adds to the madness of the whole thing. It's super fun!", "start": 947.62, "duration": 3.52}, {"text": "In terms of how to unlock it, I'd never actually played Rayman 3 before,", "start": 951.16, "duration": 3.8}, {"text": "and I gotta be honest, I was grumpin' hard on the way it controls, especially the camera,", "start": 954.96, "duration": 5.14}, {"text": "but I called in for some backup, I gotta give a shout to Nitro Rad", "start": 960.1, "duration": 3.0}, {"text": "for givin' me some emotional support and telling me about this secret room on the first level,", "start": 963.1, "duration": 4.0}, {"text": "with that I was able to very quickly get the 20,000 points necessary to unlock the Mad Trax mode.", "start": 967.1, "duration": 5.46}, {"text": "There's also a four-player version called Wheelis, which puts two people on GBA's, and that sounds amazing!", "start": 972.56, "duration": 6.18}, {"text": "But that unlocks at 350,000 points.", "start": 978.74, "duration": 3.06}, {"text": "I had to decide for this video if I wanted to play a ton of Rayman 3 or Billy Hatcher,", "start": 981.8, "duration": 4.28}, {"text": "and no disrespect, but I went with Big Boy Billy.", "start": 986.08, "duration": 2.74}, {"text": "BILLY: \"Good morning!\"", "start": 988.82, "duration": 1.26}, {"text": "DEREK: If we're talkin' games where you don't need the GBA to have a good time,", "start": 990.12, "duration": 3.26}, {"text": "then my absolute favorite on this list is the legendary...", "start": 993.38, "duration": 3.34}, {"text": "... er, Dakar 2.", "start": 996.82, "duration": 1.64}, {"text": "Yes, Dakar 2: The World's Ultimate Rally,", "start": 998.58, "duration": 2.82}, {"text": "a forgettable sequel to an I-don't-know-I-guess-fine quality racing game based on a baller-crazy real life race.", "start": 1001.44, "duration": 6.92}, {"text": "It's a game I never thought twice about, and I'm gonna guess neither had you,", "start": 1008.36, "duration": 3.82}, {"text": "but it has one of my all-time favorite bonuses:", "start": 1012.18, "duration": 3.22}, {"text": "A full, unreleased GBA game, with 12 maps, complete with four modes of play and four vehicles.", "start": 1015.5, "duration": 6.7}, {"text": "God, I love this stuff!", "start": 1022.2, "duration": 1.32}, {"text": "It's not a bad-lookin' game, though there's no music, just engine noise", "start": 1023.54, "duration": 3.44}, {"text": "but the four vehicles all feel vastly different to drive,", "start": 1026.98, "duration": 3.06}, {"text": "which to me feels like Acclaim spent a lot of time on this game!", "start": 1030.04, "duration": 3.5}, {"text": "What I can't understand is why this wasn't released on the GBA,", "start": 1033.56, "duration": 3.04}, {"text": "I mean, everyone was makin' games for that thing!", "start": 1036.6, "duration": 2.14}, {"text": "Was Acclaim THAT broke in 2003, they couldn't afford to release a GBA game?!", "start": 1038.74, "duration": 4.82}, {"text": "Anyway, this mode is not even hidden, it's right there on the Extras menu.", "start": 1043.64, "duration": 3.56}, {"text": "However, the other 11 maps need to be unlocked in the campaign mode,", "start": 1047.22, "duration": 3.6}, {"text": "and you can only download one map at a time, which... eh, makes sense, the GBA only had so much memory.", "start": 1050.82, "duration": 5.16}, {"text": "I guess each map is smaller than Wario's Woods.", "start": 1056.0, "duration": 2.5}, {"text": "Unfortunately for all you cheaters out there, the Unlock All Tracks cheat does not open these maps up,", "start": 1058.5, "duration": 5.06}, {"text": "you still need to play it and finish every level.", "start": 1063.56, "duration": 2.58}, {"text": "But it's almost two full games in one! That's a hell of a lot to chew through!", "start": 1066.14, "duration": 3.94}, {"text": "Man, first Top Gear Rally 2, and now this.", "start": 1070.08, "duration": 2.6}, {"text": "What is it with forgettable rally racing games and having amazing special features?!", "start": 1072.7, "duration": 4.48}, {"text": "Like I said at the top, SO many games support this thing,", "start": 1077.24, "duration": 3.02}, {"text": "which means you'll find Link Cable capability in the weirdest places... like a demo disc!", "start": 1080.26, "duration": 4.7}, {"text": "The Gamecube was not Nintendo's first disk-based system,", "start": 1084.96, "duration": 3.22}, {"text": "but they somehow still did not understand the appeal of demo discs in the same way their competitors did.", "start": 1088.18, "duration": 5.04}, {"text": "The Gamecube Preview Disc is one of the very few demo discs released for the Gamecube,", "start": 1093.22, "duration": 4.7}, {"text": "and it was sold - yes, sold in stores, and was also a North American exclusive.", "start": 1097.92, "duration": 5.52}, {"text": "And it's actually a pretty feature-filled disc, including a bit of Link Cable support!", "start": 1103.44, "duration": 4.8}, {"text": "I mean, if you're only gonna make a few demo discs, you might as well go big, right?", "start": 1108.24, "duration": 3.66}, {"text": "It's got some playable demos, trailers, a couple of which show off Link Cable capabilities,", "start": 1112.08, "duration": 4.56}, {"text": "and two downloadable GBA games!", "start": 1116.64, "duration": 2.24}, {"text": "We got the NES version of Dr. Mario, a classic!", "start": 1118.88, "duration": 2.7}, {"text": "I'm not sure why exactly, but... eh, whatever.", "start": 1121.6, "duration": 2.74}, {"text": "It's like the Animal Crossing NES games in that it's the full game, but only one-player.", "start": 1124.34, "duration": 4.3}, {"text": "I even tried downloading it to two separate GBA's and linking them together, but nope. No multiplayer.", "start": 1128.64, "duration": 4.78}, {"text": "The demo disc also has this mouthful: \"WarioWare, Inc.: Mega Microgames Trial Version\".", "start": 1133.42, "duration": 4.94}, {"text": "It's a trial run of the introduction stage of the very first WarioWare game,", "start": 1138.36, "duration": 3.68}, {"text": "except it doesn't have the boss stages like the full game, and it starts to change games into fun advertisements.", "start": 1142.04, "duration": 5.62}, {"text": "I love this series, and actually, this demo is also downloadable on the Wario World Gamecube game too.", "start": 1147.66, "duration": 5.74}, {"text": "The actual weird thing though is that you CAN'T get this demo on the actual Gamecube port of the GBA game,", "start": 1153.54, "duration": 6.14}, {"text": "but it DOES have Link Cable capability: It lets you hook up your GBA and use it as a controller, so...", "start": 1159.68, "duration": 5.34}, {"text": "[laughs] You got controllers, but no demos?!", "start": 1165.02, "duration": 2.76}, {"text": "Wario, why are you so inconsistent and evil?", "start": 1167.88, "duration": 2.12}, {"text": "[Wario cackles]\nWario, why are you so inconsistent and evil?", "start": 1170.0, "duration": 0.5}, {"text": "[Wario cackles]\nAnd one last thing:", "start": 1170.5, "duration": 1.16}, {"text": "For this video we actually used our Wii as our Gamecube, and our Gamecube running the GBA Player", "start": 1171.66, "duration": 5.12}, {"text": "and, well, did you know that the Link Cable is also compatible with the GBA Player?", "start": 1176.78, "duration": 4.28}, {"text": "Yes, you can use your actual GBA... with the GBA Player,", "start": 1181.06, "duration": 3.92}, {"text": "like, how amazing is that! Like, think about that:", "start": 1184.98, "duration": 2.08}, {"text": "So, if you have a GBA, a GBA Player, a Gamecube, a Link Cable, but not a Gamecube controller,", "start": 1187.06, "duration": 6.94}, {"text": "you can still enjoy your GBA games on the big screen for however long your battery lasts.", "start": 1194.0, "duration": 5.3}, {"text": "By the way, the Link Cable covers up your charge port, so good luck with that.", "start": 1199.3, "duration": 3.88}, {"text": "But actually, it's maybe not as dumb as it sounds,", "start": 1203.18, "duration": 2.5}, {"text": "the Gamecube's D-pad is so frickin' small, playing off of an actual GBA doesn't sound so bad.", "start": 1205.74, "duration": 5.36}, {"text": "The Gamecube GBA Link Cable really is one of the greatest little gadgets", "start": 1211.36, "duration": 3.94}, {"text": "released in this console generation.", "start": 1215.3, "duration": 1.82}, {"text": "With cool stuff like this, it's sometimes hard to remember", "start": 1217.12, "duration": 2.94}, {"text": "why the Gamecube was such a bust financially for Nintendo.", "start": 1220.16, "duration": 2.94}, {"text": "But from this device, you see the ideas that would grow  into the DS, the Wii and Switch.", "start": 1223.18, "duration": 5.32}, {"text": "Man... no-one fails better than Nintendo.", "start": 1228.6, "duration": 2.5}, {"text": "Thank you so much for watching, if you have any unnecessary, weird or ambitious games", "start": 1231.12, "duration": 4.02}, {"text": "you'd like to see on Punching Weight, let us know in the comments below,", "start": 1235.16, "duration": 3.1}, {"text": "join the family at the Patreon, the specialest, specialest of thanks to all our Patreon supporters, and also, hey!", "start": 1238.34, "duration": 5.88}, {"text": "Don't forget, all of our Stop Skeletons T-shirt and pins, our merch is 50% off right now,", "start": 1244.22, "duration": 5.02}, {"text": "link... all that links in description below,", "start": 1249.34, "duration": 2.64}, {"text": "thanks so much for watching, and we'll see you again real soon!", "start": 1252.26, "duration": 2.66}]