[{"text": "It’s the hot summer of the year 1260.", "start": 0.0, "duration": 2.52}, {"text": "Two opposing armies of the Bohemian and Hungarian kings catch sight of one another over the bordering Morava River.", "start": 2.8, "duration": 6.82}, {"text": "Both rulers know that who so ever dares to cross the river first,", "start": 9.7, "duration": 3.82}, {"text": "most likely, would be scuppering their chances of winning the encounter.", "start": 13.66, "duration": 4.2}, {"text": "The stalemate persists, but the final clash is imminent. Battle is about to ensue.", "start": 17.86, "duration": 5.86}, {"text": "This video is sponsored by Gods and Glory.", "start": 24.86, "duration": 2.72}, {"text": "Gods and Glory is a tactical mobile game that blends city building with squad based strategy.", "start": 27.66, "duration": 5.06}, {"text": "Choose from a myriad of units to customise your attack parties and pit your war-bands against other players online.", "start": 32.9, "duration": 6.04}, {"text": "With over 3 million players across the world you will need your wits to conquer the realms.", "start": 39.2, "duration": 4.72}, {"text": "Support our channel by clicking the link in the description below,", "start": 43.92, "duration": 3.28}, {"text": "download the game and you will receive an Obsidian City upgrade, 1500 crystals, an exp boost and an additional resource starter pack", "start": 47.2, "duration": 8.58}, {"text": "a significant edge for any new ruler.", "start": 56.42, "duration": 3.8}, {"text": "It is late Autumn of the year 1249.", "start": 66.72, "duration": 2.8}, {"text": "Young Bohemian prince Ottokar is held in captivity within the walls of Primda castle", "start": 69.88, "duration": 5.72}, {"text": "as a result of putting his name behind the unsuccessful rebellion against his father, Wenceslaus One-Eyed, King of Bohemia.", "start": 75.6, "duration": 8.44}, {"text": "However, being the only living son and heir, Ottokar was an important political asset in the hands of his parent", "start": 84.04, "duration": 7.54}, {"text": "and within a couple of weeks was freed and reinstated as Margrave of Moravia,", "start": 91.76, "duration": 4.5}, {"text": "the easternmost part of Wenceslaus’ domain.", "start": 96.26, "duration": 3.32}, {"text": "It was here that he oversaw the reconstruction of the ruined countryside pillaged by the Mongols some years earlier.", "start": 99.64, "duration": 7.5}, {"text": "But Ottokar’s role as son of the incumbent monarch was more than just mere land administration.", "start": 107.44, "duration": 5.74}, {"text": "For the last few years King Wenceslaus was aiming to gain control over the neighbouring Duchy of Austria,", "start": 113.38, "duration": 6.66}, {"text": "which was an arena of significant turmoil since 1246, when the last duke of the ruling Babenberg dynasty died in battle against the Hungarians.", "start": 120.12, "duration": 9.62}, {"text": "Without delving too much into the details, in 1251 the Bohemian king took advantage of the favourable political circumstances", "start": 130.12, "duration": 8.26}, {"text": "and installed Ottokar as Duke of Austria and Styria, with the endorsement of the local nobility.", "start": 138.38, "duration": 6.48}, {"text": "To bolster his claim to the newly acquired lands, Ottokar was married to the sister of the late Babenberg duke, Margaret of Austria.", "start": 144.86, "duration": 8.22}, {"text": "Although almost 35 years older than him, Margaret was one of the last of the two living female members of House of Babenberg.", "start": 153.22, "duration": 8.38}, {"text": "However, Wenceslaus did not enjoy his victory for too long,", "start": 161.72, "duration": 4.02}, {"text": "as he died the very next year and Ottokar stepped up to his father’s throne in Prague.", "start": 165.94, "duration": 5.4}, {"text": "One could argue that the young heir wasn’t really prepared to fulfil this new role but in truth, during his final years,", "start": 171.6, "duration": 7.54}, {"text": "Wenceslaus stepped back somewhat to allow Ottokar to gain some much needed experience.", "start": 179.14, "duration": 6.16}, {"text": "Thanks to this eased ascension, the new king quickly consolidated his rule over the duchies remaining under his control", "start": 185.54, "duration": 7.5}, {"text": "and moved on to expand his influence even further.", "start": 193.04, "duration": 3.96}, {"text": "It’s worth mentioning, that Ottokar’s kingdom was just a part of the much bigger Holy Roman Empire,", "start": 197.1, "duration": 6.48}, {"text": "a loose amalgamation of various fiefs, lordships, bishopries, duchies, and kingdoms nominally ruled by the pope-blessed Holy Roman Emperor.", "start": 203.66, "duration": 9.64}, {"text": "But at the time of Ottokar replacing his deceased father,", "start": 213.5, "duration": 3.64}, {"text": "the imperial Hohenstaufen dynasty died out and the empire entered what is known today as the Great Interregnum,", "start": 217.26, "duration": 7.38}, {"text": "a decades-long period of succession crisis and turmoil.", "start": 224.64, "duration": 4.5}, {"text": "It is easy to predict, that the ambitious young monarch from Bohemia tried to leverage his position", "start": 229.76, "duration": 5.8}, {"text": "and endeavoured to claim imperial dignity as his mother came from the Hohenstaufen family.", "start": 235.56, "duration": 5.16}, {"text": "Yet Ottokar couldn’t win the support of the electors with his power and wealth alone,", "start": 241.0, "duration": 4.76}, {"text": "so for a time, he settled down in favour of other candidates, who also struggled in trying to gain the necessary backing.", "start": 245.86, "duration": 7.5}, {"text": "Despite his failed attempt to claim the imperial throne,", "start": 253.78, "duration": 2.98}, {"text": "Ottokar’s growing influence became a serious concern to his neighbours inside and outside the empire,", "start": 256.94, "duration": 7.0}, {"text": "most notably to Bela IV, King of Hungary.", "start": 264.26, "duration": 4.28}, {"text": "During that time, Bela was still in the process of recovering his kingdom from the devastation caused by the Mongol attack fifteen years prior.", "start": 268.84, "duration": 8.96}, {"text": "Much of his efforts concentrated on strengthening the defensive line along the Danube in the event of another Mongol invasion.", "start": 277.9, "duration": 8.04}, {"text": "But in spite of his internal challenges, just like Ottokar,", "start": 286.02, "duration": 3.76}, {"text": "Bela saw the succession dispute in Austria and Styria as an excellent opportunity to expand his influence and reinforce his defence plans.", "start": 289.84, "duration": 9.8}, {"text": "In fact, Bela was personally responsible for the extinction of the Babenberg dynasty in Austria,", "start": 299.88, "duration": 7.06}, {"text": "as he killed the last Duke of Austria in battle in 1246.", "start": 307.04, "duration": 5.08}, {"text": "Of course, the Hungarian king didn’t just passively observe Ottokar’s expansion and from 1250 he actively bedevilled the efforts of his neighbour", "start": 312.4, "duration": 8.84}, {"text": "through the constant raiding of the Moravian and Austrian territories.", "start": 321.24, "duration": 4.04}, {"text": "Growing conflict between the two eventually attracted the attention of the Holy See and subsequent papal mediation awarded Styria to Bela,", "start": 325.46, "duration": 8.46}, {"text": "while Ottokar retained his authority over Austria. Thus, a period of uneasy peace ensued.", "start": 333.92, "duration": 7.34}, {"text": "Although the hostilities ended, Bela had a tough time controlling Styria.", "start": 341.36, "duration": 4.8}, {"text": "Local nobility eventually rose up in revolt and expelled the Hungarian governor in 1258.", "start": 346.38, "duration": 5.82}, {"text": "Obviously, Bela quickly responded by invading the unruly duchy and installed his son Stephen as Duke of Styria.", "start": 352.52, "duration": 7.64}, {"text": "Yet this action only temporarily quelled the rebellion and just two years later it broke out once again,", "start": 360.3, "duration": 6.14}, {"text": "forcing Stephen to run back to Hungary.", "start": 366.44, "duration": 2.7}, {"text": "This was an opportune moment for Ottokar, who most likely aided the Styrian opposition the whole time,", "start": 369.14, "duration": 5.9}, {"text": "to move his troops south and regain control over the disputed region that he agreed to hand over to Bela six years earlier.", "start": 375.54, "duration": 8.4}, {"text": "Unsurprisingly, the Bohemian king didn’t have to wait too long for the Hungarian reaction.", "start": 384.32, "duration": 5.78}, {"text": "In early summer of the year 1260 he received reports that Bela was already in the process of assembling his army near the border formed by the Morava River.", "start": 390.32, "duration": 9.76}, {"text": "The Hungarian king was aided by contingents sent by the Polish and Ruthenian princes,", "start": 400.32, "duration": 5.68}, {"text": "and Bela had around 35,000 men under his command.", "start": 406.08, "duration": 4.3}, {"text": "In a matter of weeks Ottokar finished gathering his units and marched the 30,000 strong host", "start": 410.46, "duration": 5.88}, {"text": "supplemented by his allies from Silesia and Brandenburg to meet the threat.", "start": 416.34, "duration": 5.58}, {"text": "Both armies gathered some distance north-west of Pressburg and set camps on the both banks of the bordering Morava River.", "start": 422.16, "duration": 7.68}, {"text": "Unsurprisingly, neither side dared to cross the river, waiting for their rival to act first.", "start": 430.12, "duration": 6.36}, {"text": "Such a stalemate lasted for a week, and since the men suffered from the summer heat", "start": 436.72, "duration": 4.88}, {"text": "Ottokar offered to retreat from the river to give Bela a chance to cross and fight a chivalrous battle on equal terms.", "start": 441.86, "duration": 8.18}, {"text": "The Hungarian king agreed and as soon as the Bohemian units marched back, his troops began to move through the fords.", "start": 450.24, "duration": 7.96}, {"text": "The Hungarian van, comprised mainly of light mounted units under the command of Prince Stephen,", "start": 458.66, "duration": 5.28}, {"text": "crossed first and soon some of Bela’s men, possibly Cuman or Pecheneg, began unordered skirmishing against Ottokar’s units.", "start": 463.94, "duration": 9.2}, {"text": "Factoring in all accounts, Hungarian sources blame Ottokar for treacherously attacking Bela’s troops while crossing the river,", "start": 473.36, "duration": 7.74}, {"text": "but it seems a bit more likely that the Hungarian light riders, yearning for battle, sparked the events that followed.", "start": 481.2, "duration": 7.66}, {"text": "Seeing that his troops were being harrased by Bela’s mounted skirmishers,", "start": 489.22, "duration": 3.8}, {"text": "Ottokar mustered Bohemian knightly cavalry and lead a swift charge at the enemy’s vanguard.", "start": 493.12, "duration": 6.38}, {"text": "They furiously struck the unsuspecting Hungarians killing many and routing the rest of the forward skirmishers.", "start": 499.9, "duration": 7.32}, {"text": "Other Czech units soon followed their king and joined the fight,", "start": 507.48, "duration": 3.94}, {"text": "attacking the remaining part of Prince Stephen’s van which had already completed the crossing.", "start": 511.42, "duration": 5.24}, {"text": "Yet the unprepared Hungarian units were unable to mount an effective defence in time,", "start": 517.06, "duration": 5.0}, {"text": "and suffered huge losses as Ottokar’s men pushed them back to the river.", "start": 522.14, "duration": 4.62}, {"text": "The Hungarian heavy cavalry under King Bela along with the rest of his troops could do nothing but watch the vanquishing of their retreating allies.", "start": 527.14, "duration": 8.9}, {"text": "Many were killed and many drowned trying to escape the slaughter.", "start": 536.34, "duration": 4.24}, {"text": "Prince Stephen suffered a wound, but managed to cross the river with his retinue.", "start": 540.94, "duration": 4.28}, {"text": "In the matter of an hour, 10,000 of Bela’s men lay dead along the banks or taken by the stream.", "start": 545.52, "duration": 7.16}, {"text": "In all but an instant Bela’s plans of reclaiming Styria were crushed under the hooves of the Bohemian heavy cavalry,", "start": 553.16, "duration": 6.74}, {"text": "and while the surviving core of his army remained virtually intact, he had to surrender his ambitions of western expansion", "start": 560.16, "duration": 6.62}, {"text": "as he soon faced a new Mongolian threat along with the rebellion of his own son.", "start": 566.92, "duration": 5.32}, {"text": "Ottokar on the other hand, thanks to the unforeseen circumstances that led to this victory,", "start": 572.74, "duration": 5.04}, {"text": "consolidated his rule over Austria and Styria giving him room to further the expansion of his kingdom", "start": 577.78, "duration": 6.34}, {"text": "and established his position as the most powerful ruler within the Holy Roman Empire.", "start": 584.26, "duration": 5.64}, {"text": "But the rest of his story is yet to be written.", "start": 590.18, "duration": 3.82}]