[{"text": "So this is possibly going to be", "start": 0.06, "duration": 2.25}, {"text": "The most fun new Office update yet. We are going to be creating-", "start": 2.889, "duration": 6.14}, {"text": "Yes, every one here is a creator- We're going to be creating our new", "start": 9.37, "duration": 3.889}, {"text": "Cutlery and dishware for the new office which will help me keep [track] of who it is who does crap like this!", "start": 14.26, "duration": 7.68}, {"text": "Well, they're gonna have their name on the dish, so I'm gonna know who was.", "start": 22.58, "duration": 4.76}, {"text": "CableMod premium sleeved cables,", "start": 36.58, "duration": 1.88}, {"text": "They're still just as good as they were before when we reviewed them and now they're available for CoolerMaster", "start": 38.46, "duration": 4.949}, {"text": "power supplies! Click on this box to learn more.", "start": 43.409, "duration": 2.819}, {"text": "Yes, everyone gets a full set and we're gonna be using these handy dandy, pebeo..", "start": 46.96, "duration": 6.42}, {"text": "What are they even I don't even know what they are... Thermo-hardening...", "start": 53.38, "duration": 3.2}, {"text": "Water-based color, they're like- They're like paint pens.", "start": 57.06, "duration": 3.14}, {"text": "So we'll be using these and everyone will draw their own design on their plate,", "start": 60.54, "duration": 4.78}, {"text": "Then we're gonna bake them in the oven. They should in theory be", "start": 65.32, "duration": 4.46}, {"text": "Completely washer safe. Pretty cool stuff. Brendon, you are up first. Press tip repeatedly to start flow...", "start": 69.92, "duration": 6.38}, {"text": "-I feel like I'm in kindergarten. I have never been known for my neat writing. -World's greatest boss.", "start": 79.42, "duration": 6.77}, {"text": "It looks like your two-year-old made it. Did you shake it?", "start": 86.19, "duration": 4.01}, {"text": "-Noooooooo!\n-Crap!", "start": 92.82, "duration": 2.0}, {"text": "-Aw, Linus!\n-Oh, that's gonna be permanent. \n-Oh God, these squares are awful.\n-Where's the waveform? \n-That's stick version of me.", "start": 94.86, "duration": 6.36}, {"text": "-Ikea Boys 2001. \n-Are those Doritos?\n-Yeah.", "start": 101.76, "duration": 3.66}, {"text": "-It looks like blood on it.\n-It's supposed to be fire!", "start": 106.42, "duration": 3.16}, {"text": "That's less depressing.", "start": 109.78, "duration": 2.0}, {"text": "-I guess we could do it upstairs couldn't we?\n-So you still have the burning razor blade? \n-It is burning.", "start": 111.88, "duration": 7.8}, {"text": "-Oh, I get it, like cutting videos. \n-Yeah! \n-This is Nick's nickname for me, get it?", "start": 119.9, "duration": 6.06}, {"text": "Nickname?", "start": 126.42, "duration": 0.9}, {"text": "Wait, are you faking people signing your plate?", "start": 129.04, "duration": 3.1}, {"text": "-Those are it's not fake if it's what they would have written. \n-No those are all from you!", "start": 133.86, "duration": 4.56}, {"text": "Notice how it says \"good job\" not, \"great job\"?", "start": 139.26, "duration": 2.3}, {"text": "Well, it's just for finishing my bowl of cereal, so it's not really that spectacular.", "start": 141.96, "duration": 4.82}, {"text": "But I definitely deserve a smiley face when the milk is all gone.", "start": 146.84, "duration": 2.98}, {"text": "-I'm just being honest! \n-Is that Dickbutt?\n-Nope. I don't know how that got there. I didn't do it.", "start": 153.2, "duration": 6.44}, {"text": "-That's not something I would do. \n-So you're gonna rip my idea like right off?", "start": 159.96, "duration": 3.86}, {"text": "-Yeah. Good start, keep going, wow, come on, finish it, great job! \n-Great job.", "start": 164.1, "duration": 5.36}, {"text": "Yeah, let's have a look at what everyone came up with. So first we've got one of our new hires...", "start": 171.06, "duration": 4.4}, {"text": "John, who has says prohibited liquids and age three Backwash oil vinegar tobacco,", "start": 175.78, "duration": 7.58}, {"text": "Very nice. His bowl, ah is, uh... And you just recently got married in Las Vegas,", "start": 183.46, "duration": 6.29}, {"text": "So I guess that's why there's a chip in there.", "start": 189.75, "duration": 2.0}, {"text": "That's just inappropriate.", "start": 192.88, "duration": 1.59}, {"text": "Something about Carolina Hurricanes hockey and having actually won a Stanley Cup. This guy is not going to last long.", "start": 194.47, "duration": 6.529}, {"text": "Next up we've got the slice master. This is Terren's gear. He's got a definite theme going on, and...", "start": 201.36, "duration": 8.32}, {"text": "It's all about cutting.", "start": 209.68, "duration": 2.04}, {"text": "I am really liking this one. Slice master 2000. Next up", "start": 212.24, "duration": 5.26}, {"text": "We've got Brandon, whose skills with a camera are certainly better than his skills with a pen.", "start": 217.5, "duration": 6.38}, {"text": "I mean, is that a YouTube play button?", "start": 224.56, "duration": 2.0}, {"text": "That's pathetic.", "start": 227.46, "duration": 1.44}, {"text": "This barely even looks like a film reel, like is that- That's not even a circle.", "start": 228.9, "duration": 3.98}, {"text": "Does this guy even know how cameras work? We don't even shoot on film anymore, and he like, spilled crap on it!", "start": 233.78, "duration": 6.44}, {"text": "All right next up. We've got- This is Nick Light,", "start": 241.0, "duration": 2.58}, {"text": "\"sippin on some sizzurp\".", "start": 244.96, "duration": 2.0}, {"text": "-There's a Silicon Valley reference for those of you Who enjoy the show. Dat Acura logo. \n-Oh Acura, that's Infiniti!\n-Oh.", "start": 247.26, "duration": 7.56}, {"text": "Whatever, they all look the same to me. And then, uh...", "start": 255.28, "duration": 3.08}, {"text": "\"Dat Cheddah\".", "start": 259.68, "duration": 1.06}, {"text": "Next up, we've got luke who went for a more kind of abstract concept. He's got sun and... Sun and surf", "start": 261.94, "duration": 5.69}, {"text": "I think is what that is, and then...", "start": 267.63, "duration": 2.19}, {"text": "something...", "start": 270.37, "duration": 1.169}, {"text": "Snowflake... We're all unique, like a snowflake, like Luke. Luke is a snowflake for us.", "start": 271.539, "duration": 5.15}, {"text": "Speaking of tacky, this could only be Nick van Berkel.", "start": 277.72, "duration": 3.24}, {"text": "Who completely ripped off my idea.", "start": 282.82, "duration": 3.06}, {"text": "The cinco hotplate, which Involves removing your teeth at some point in order to use it. And the ultimate MLG plate: Mountain Dew,", "start": 286.5, "duration": 8.34}, {"text": "Hitmarkers, Doritos, you- you got it. It's all there. Oh, this is Ed.", "start": 295.22, "duration": 5.48}, {"text": "So this was actually a kind of a cool idea in concept, so it was like the hand goes there,", "start": 301.06, "duration": 4.82}, {"text": "but it just looks like a house...", "start": 306.19, "duration": 2.0}, {"text": "And Ed is our meme-tacular winner of the day. I can't- I have two rules right no profanity and", "start": 308.94, "duration": 8.4}, {"text": "No sexual content.", "start": 317.38, "duration": 2.02}, {"text": "This actually turned out really good.", "start": 321.46, "duration": 2.0}, {"text": "Finn and Jake from Adventure Time.", "start": 324.31, "duration": 1.89}, {"text": "Alright next up, we've got our other new team member Dennis.", "start": 326.2, "duration": 3.76}, {"text": "I told him no profanity, and I'm sure that probably is profane.", "start": 330.28, "duration": 4.85}, {"text": "So he's fired too. No, he did the outside. He- you know...", "start": 335.13, "duration": 5.27}, {"text": "We actually have Asians working here already, but he's coming in and he wants to be like, THE Asian.", "start": 340.56, "duration": 6.22}, {"text": "I don't even know what the hell. This is, I mean...", "start": 347.14, "duration": 2.7}, {"text": "I'll give him this,", "start": 351.26, "duration": 1.66}, {"text": "He's making progress if he wants to be the most Asian guy at Linus Media Group. (Laughter)", "start": 352.93, "duration": 5.21}, {"text": "So I actually asked for the employees to decorate all of my stuff,", "start": 359.05, "duration": 4.369}, {"text": "so you can see they actually put a number one trophy and \"world's best boss\" on my cup.", "start": 363.419, "duration": 5.31}, {"text": "Here, they came up with ten words to describe me, and", "start": 369.94, "duration": 4.28}, {"text": "Then this \"good job\" for finishing the cereal.", "start": 374.98, "duration": 2.62}, {"text": "I'm really proud of the effort that they put into this. You know, just all these amazing things that they wrote about me.", "start": 377.98, "duration": 6.68}, {"text": "Who the hell wrote that?", "start": 385.52, "duration": 1.5}, {"text": "-I'm just being honest. \n-This is why I had to do it myself.", "start": 387.88, "duration": 3.5}, {"text": "And this one, I guess they ran out of uplifting things,", "start": 391.68, "duration": 3.14}, {"text": "So they just tried to really drive the point home. Apparently I'm the world's greatest boss, and the world's greatest boss also delivered", "start": 394.82, "duration": 7.1}, {"text": "personalized cutlery!", "start": 402.44, "duration": 2.0}, {"text": "-That's yours right there. \n-Oh, it's beautiful.", "start": 405.78, "duration": 2.94}, {"text": "So let's go to the office and see if we've made any progress on the place", "start": 410.9, "duration": 2.9}, {"text": "We're actually going to put these once we bake them. All right, so we're coming up on the office,", "start": 413.8, "duration": 4.86}, {"text": "Hopefully they've made lots of progress. I actually haven't been here since last time.", "start": 418.67, "duration": 4.01}, {"text": "-You got little \"Linus Media Group\" signs! \n-Yeah, man! So I actually screwed these up, the quotation", "start": 425.26, "duration": 5.76}, {"text": "clearly said \"four inches by 18 inches\", and", "start": 431.06, "duration": 4.08}, {"text": "Let me tell you, I would know 18 inches, and that is NOT 18 inches. So they actually just", "start": 435.14, "duration": 4.72}, {"text": "cemented the old one on top of the", "start": 440.03, "duration": 2.0}, {"text": "Original ones, so let's see what's changed. so our yellow bins getting pretty full-", "start": 442.37, "duration": 4.399}, {"text": "You know what, I think this is Brandon's crap. Our moving helper has actually been throwing away Brandon's stuff.", "start": 446.77, "duration": 7.11}, {"text": "So I'll put this somewhere. I mean it can't be that expensive, but it's still inconvenient to not have them. Okay-", "start": 453.88, "duration": 6.899}, {"text": "Oh, sprinkler system! All right, so if there's a fire,", "start": 460.8, "duration": 4.78}, {"text": "Then these will go off and ruin all of our stuff. This is", "start": 465.96, "duration": 5.22}, {"text": "The storage corner, this is mostly like computer cases and like boxes for stuff that we've already-", "start": 471.18, "duration": 6.1}, {"text": "That are already in use that we're just going to have to transport without the boxes. This is more set walls.", "start": 477.84, "duration": 5.16}, {"text": "Yeah, that's all happening. It's all happening man. These...", "start": 483.47, "duration": 4.88}, {"text": "are our new desks, so", "start": 489.32, "duration": 2.72}, {"text": "Everyone is getting a motorized up-desk.", "start": 492.04, "duration": 2.7}, {"text": "So these are like the fancy- The fancy motorized sitting or standing desks.", "start": 494.9, "duration": 5.299}, {"text": "You can like dial in presets and crap like that.", "start": 500.2, "duration": 2.82}, {"text": "Pretty freakin' cool.", "start": 503.54, "duration": 2.0}, {"text": "Apparently we need two scissor lifts for whatever it is we have going on here right now.", "start": 505.67, "duration": 3.83}, {"text": "But this my friends, is where the real progress has been made.", "start": 509.87, "duration": 4.249}, {"text": "So we've got a lot of people upset that there isn't going to be a kitchen set at the new place.", "start": 514.58, "duration": 6.36}, {"text": "No, there isn't, but it's going to be much much improved. This is the workshop.", "start": 521.38, "duration": 6.72}, {"text": "Which is going to be an actual functional workshop.", "start": 528.1, "duration": 2.549}, {"text": "You can see, we've got power outlets coming in. It's actually going to be more- more desk all", "start": 530.65, "duration": 5.88}, {"text": "Along here, up to about here.", "start": 536.75, "duration": 2.21}, {"text": "And then like more shelving units in the bottom and it will also be a workshop set, like just of a fun, cool,", "start": 538.96, "duration": 6.239}, {"text": "Rustic looking Workshop set. So we've got an actual blackboard back here,", "start": 545.81, "duration": 3.71}, {"text": "So you can go ahead and like you could like write cool stuff on it or whatever. And then this is", "start": 550.13, "duration": 4.58}, {"text": "reclaimed wood from the disassembly of like, 60 pallets.", "start": 555.29, "duration": 4.609}, {"text": "So this has been clear-coated and put on for like, a really- A really raw", "start": 560.06, "duration": 4.099}, {"text": "cool-looking finish, and we actually did more", "start": 564.77, "duration": 2.599}, {"text": "Reclaimed wood. This my friends, is the WAN show set. So these were stained a bunch of different colors for", "start": 567.44, "duration": 6.229}, {"text": "Also, like a really [cool] look. And then we're doing a different finish on this wall because this is just the noise dampening", "start": 573.74, "duration": 5.84}, {"text": "Cellulose foam on the wall, so we have made legit", "start": 580.02, "duration": 4.28}, {"text": "Progress on the set pieces on this wall. It is- I am like, really pleased with how these walls turned out.", "start": 584.62, "duration": 7.28}, {"text": "I'm really excited.", "start": 591.91, "duration": 1.06}, {"text": "This is where the hVAC is going up to the roof where the air conditioning unit will be installed. So that is totally happening.", "start": 592.97, "duration": 7.83}, {"text": "So they have actually filled in the floor where the where the kitchen plumbing has been run over", "start": 600.8, "duration": 5.94}, {"text": "To where the kitchen's going to be, so the kitchen can start coming in very very shortly here.", "start": 606.95, "duration": 5.149}, {"text": "You can see all this is all- this is done here. That's cool stuff.", "start": 612.1, "duration": 3.52}, {"text": "Also, let's see. What's going down upstairs?", "start": 615.92, "duration": 2.38}, {"text": "So the library hasn't changed at all in terms of the layout,", "start": 618.64, "duration": 4.3}, {"text": "but we actually have a plan for what's going to go in here. So we're getting a sectional here,", "start": 623.81, "duration": 4.969}, {"text": "With like, an end table on either side, so you'll actually be able to like, lounge and right over here. In this corner,", "start": 630.44, "duration": 6.349}, {"text": "We're going to put like, I think a built-in bookcase with like cool", "start": 636.79, "duration": 3.45}, {"text": "Knickknacks like loot crate stuff and like, awards that Linus Media Group has won, like our subscriber award cool stuff like that.", "start": 640.25, "duration": 7.339}, {"text": "Over here is some kind of desk. So people can either sit on,", "start": 647.92, "duration": 4.24}, {"text": "I think there's going to be a little chair there, a sectional there, or a desk here.", "start": 652.16, "duration": 3.24}, {"text": "To- To write and have some, you know, private time.", "start": 655.42, "duration": 3.8}, {"text": "There's a lot more Ethernet in the server room now, so that's pretty cool.", "start": 660.14, "duration": 4.22}, {"text": "Not sure where all of this is going to, but this is all new, this must be downstairs. Oh, they're labeled look at that.", "start": 664.4, "duration": 5.9}, {"text": "\"Top of stairs\".", "start": 671.089, "duration": 2.0}, {"text": "What the hell is this supposed to be?", "start": 675.54, "duration": 2.12}, {"text": "I don't think this is in the spec.", "start": 679.02, "duration": 2.32}, {"text": "I thought the server room was just supposed to go all the way back.", "start": 682.68, "duration": 2.42}, {"text": "Nope, I farted. Don't inhale as you walk through it.", "start": 687.92, "duration": 2.34}, {"text": "So another room that hasn't actually changed in terms of the progress that's been made on it", "start": 693.029, "duration": 4.549}, {"text": "But has changed in terms of the plan is the meeting room.", "start": 697.58, "duration": 2.38}, {"text": "We discovered that in order to have enough room for chairs to move back and a table, our table was going to be 24 inches wide,", "start": 700.58, "duration": 7.44}, {"text": "Which is pretty stupid for a conference room table.", "start": 708.42, "duration": 3.32}, {"text": "New plan: We are turning this thing where we drywalled over some", "start": 711.96, "duration": 4.58}, {"text": "Features of the building in the front, we're going to raise this and turn it into bench seating.", "start": 716.94, "duration": 5.08}, {"text": "So the conference table will be here and there will be chairs on the other side.", "start": 722.96, "duration": 3.18}, {"text": "So you will either have chairs or bench seating, and then we'll actually salvage back the yes base that we needed.", "start": 726.14, "duration": 5.849}, {"text": "Here's something new, we looked into buying something like this to hold C-stands and flags and", "start": 733.8, "duration": 7.88}, {"text": "Basically we found one place that had them for like 600 or 700 dollars U.S.,", "start": 741.7, "duration": 4.38}, {"text": "And they wouldn't even ship to Canada. These are hard to find.", "start": 746.08, "duration": 3.26}, {"text": "Apparently easy to just build, so the same contractor who did the sets over there actually put together this rolling", "start": 750.0, "duration": 7.64}, {"text": "C-stand holder for us, freaking awesome.", "start": 757.72, "duration": 3.36}, {"text": "Brandon is going to spaz when he sees this, because this is going to be just great for moving the stuff around,", "start": 761.24, "duration": 6.56}, {"text": "Especially once you've loaded it up with like ten of these suckers, which are pretty heavy by the way.", "start": 767.96, "duration": 4.88}, {"text": "(Off-screen) You like those, right?", "start": 772.84, "duration": 1.14}, {"text": "I like C-stands? I think that they're very expensive for what they are.", "start": 774.74, "duration": 5.64}, {"text": "And this is a piece that isn't actually new in the sense that we've had it for a little while,", "start": 781.26, "duration": 4.489}, {"text": "But it's new in that it's much closer to its home. So this is our 42-U server cabinet from Norco Technologies, and", "start": 786.08, "duration": 10.02}, {"text": "It is- It's still- It's still wrapped,", "start": 796.64, "duration": 2.86}, {"text": "But I'm excited to take it off so I can go and hide inside it because that'll be super duper cool.", "start": 799.86, "duration": 5.8}, {"text": "Hold on a second...", "start": 806.73, "duration": 2.0}, {"text": "And in response to all the folks wondering in the video comments, how we can afford such an awesome office,", "start": 809.43, "duration": 5.479}, {"text": "Crunchyroll, the site created by anime fans for anime fans. They offer the most current episodes of new show straight from Japan Like Kuroko's basketball", "start": 816.02, "duration": 7.14}, {"text": "3 and Jojo's Bizarre Adventure,", "start": 823.16, "duration": 1.92}, {"text": "and they have a large collection of the most popular anime series like Naruto and", "start": 825.08, "duration": 4.5}, {"text": "One Piece. All the content on their site is professionally subtitled and", "start": 829.649, "duration": 3.919}, {"text": "If you have Crunchyroll Premium, which you can try out for free at \"crunchyroll.com/linus\" for 30 days,", "start": 833.78, "duration": 7.48}, {"text": "then you actually get 1080p streaming new episodes of shows from Japan within an hour of their premiere, and", "start": 841.4, "duration": 5.48}, {"text": "You can stream anywhere on a variety of devices like your phone tablet or game", "start": 847.62, "duration": 4.669}, {"text": "Console. If you like premium membership, then you can continue it for only", "start": 852.54, "duration": 3.68}, {"text": "$6.95 a month, so head over to \"crunchyroll.com/linus\" to check it out.", "start": 856.28, "duration": 5.48}, {"text": "So guys if you dislike the video, I think you know what to do,", "start": 862.98, "duration": 3.529}, {"text": "But if you liked it, go ahead and click that like button, get", "start": 866.509, "duration": 3.091}, {"text": "subscribed and consider supporting us by buying a cool t-shirt like this one, changing your Amazon bookmarks to  one of our affiliate code or even", "start": 869.6, "duration": 6.08}, {"text": "Supporting us directly through the linustechtips.com", "start": 875.819, "duration": 2.69}, {"text": "Community forum. if you're looking for something to watch, we've actually done a lot of cool videos lately.", "start": 878.6, "duration": 5.3}, {"text": "Luke just did one where he checked out ZOTAC's GTX 980Ti,", "start": 883.9, "duration": 4.12}, {"text": "it actually has hybrid air and liquid cooling both of them built right onto the card, so", "start": 888.08, "duration": 5.72}, {"text": "Definitely check that out if you're looking for another video to view at the moment.", "start": 894.62, "duration": 3.26}, {"text": "See you next time in \"new office vlog\"!", "start": 899.52, "duration": 3.08}]