[{"text": "It’s late July of the year 1018.", "start": 1.12, "duration": 2.7}, {"text": "The summer sun was slowly reaching its zenith as the camp dwellers on the Eastern bank of the Bug River", "start": 3.88, "duration": 5.24}, {"text": "bustled around preparing a midday meal.", "start": 9.4, "duration": 2.38}, {"text": "Then, the droning clamour of soldiers and servants moving around were spurred", "start": 11.96, "duration": 4.78}, {"text": "by the unexpected sound of clashing swords and human agony coming from the river.", "start": 16.78, "duration": 5.02}, {"text": "A moment later, a handful of breathless guards rushed into the camp, straight towards the officer’s tent.", "start": 21.94, "duration": 6.06}, {"text": "Grand Prince Yaroslav and his retainers stormed out yelling orders. The battle was about to begin.", "start": 28.28, "duration": 6.88}, {"text": "It’s spring of the year 1014.", "start": 46.5, "duration": 2.82}, {"text": "For the last twenty five years the vast lands of Kievan Rus were ruled by Grand Prince Vladimir,", "start": 49.46, "duration": 5.9}, {"text": "arguably one of the most prominent representatives of the Rurik dynasty to date.", "start": 55.56, "duration": 4.98}, {"text": "He was not only the first Eastern Slavic ruler to abandon paganism in favour of Christianity,", "start": 60.8, "duration": 5.26}, {"text": "but he also consolidated the Kievan realm from the medieval Ukraine to the Baltic, strengthening the frontiers in the process.", "start": 66.26, "duration": 7.54}, {"text": "However, Vladimir’s successful reign was quite frequently marred by his uneasy relationship with his many sons,", "start": 74.2, "duration": 6.56}, {"text": "to the point that by his mid-fifties the matter of Vladimir’s succession was still open,", "start": 81.06, "duration": 5.58}, {"text": "which unsurprisingly caused some unrest among his offspring.", "start": 86.84, "duration": 3.92}, {"text": "By 1014 it was already rather obvious that Vladimir was leaning towards bequeathing the Kievan throne to one of his younger sons,", "start": 91.08, "duration": 7.4}, {"text": "which in turn outraged his two oldest sons – Sviatopolk and Yaroslav.", "start": 98.66, "duration": 5.36}, {"text": "Both of them started acting against their father,", "start": 104.34, "duration": 2.4}, {"text": "eventually compelling Vladimir to take more drastic measures to douse the sparking rebellion.", "start": 106.88, "duration": 5.04}, {"text": "Sviatopolk was imprisoned, and a military campaign was being prepared against Yaroslav,", "start": 112.18, "duration": 4.12}, {"text": "who ruled the remote city of Novgorod in his father’s name.", "start": 116.54, "duration": 3.8}, {"text": "In the summer of 1015 Vladimir was ready to depart Kiev on a military expedition north to subdue his disobedient son.", "start": 120.78, "duration": 7.38}, {"text": "But Yaroslav was never to suffer the ire of his father and overlord,", "start": 128.52, "duration": 3.86}, {"text": "as Vladimir unexpectedly fell ill and after a couple of weeks died,", "start": 132.5, "duration": 5.02}, {"text": "leaving the fate of the Kievan realm to his quarrelsome sons.", "start": 137.54, "duration": 3.56}, {"text": "As the death of the Grand Prince happened so suddenly,", "start": 141.24, "duration": 2.78}, {"text": "the only one who was able to capitalize immediately on Vladimir’s death was Sviatopolk,", "start": 144.1, "duration": 5.26}, {"text": "who managed to set himself free and seize the Kievan throne before his other brothers could react.", "start": 149.58, "duration": 5.56}, {"text": "Subsequently, to solidify his claim, Sviatopolk orchestrated the murder of his three younger siblings,", "start": 155.38, "duration": 6.02}, {"text": "so the only other serious contender remaining was the acting Prince of Novgorod, Yaroslav.", "start": 161.64, "duration": 5.72}, {"text": "We ought to mention, that due to the poor reliability of the primary sources,", "start": 168.0, "duration": 4.48}, {"text": "it was entirely possible that Vladimir’s younger sons could well have been eliminated by Yaroslav,", "start": 172.72, "duration": 5.3}, {"text": "who then made sure to properly influence the chroniclers.", "start": 178.22, "duration": 3.5}, {"text": "Regardless of who committed the fratricide, Kievan Rus was soon to be the stage of a civil war", "start": 181.78, "duration": 5.3}, {"text": "as in early 1016 Yaroslav gathered an army and marched south to challenge Sviatopolk for the throne in Kiev.", "start": 187.14, "duration": 8.0}, {"text": "The two contenders met in battle some kilometres north of the city at the banks of Dnieper River and Yaroslav’s host eventually routed Sviatopolk’s army,", "start": 195.22, "duration": 9.26}, {"text": "forcing him to flee to the West.", "start": 204.5, "duration": 2.18}, {"text": "While the Novgorodian army marched further south to seize Kiev for Yaroslav,", "start": 206.86, "duration": 4.34}, {"text": "Sviatopolk sought refuge at the court of his father-in-law, Boleslav the Brave, the ambitious Duke of Poland.", "start": 211.26, "duration": 7.18}, {"text": "Sviatopolk’s flight to the West was not all that unexpected for the Polish duke,", "start": 218.56, "duration": 4.48}, {"text": "as Boleslav had already assisted Sviatopolk’s struggle for power before.", "start": 223.06, "duration": 4.66}, {"text": "However this time Boleslav was unable to provide immediate support,", "start": 227.78, "duration": 4.44}, {"text": "as the Duchy of Poland was in the middle of a lengthy conflict with Henry II, the King of Germany and the Holy Roman Emperor.", "start": 232.26, "duration": 7.04}, {"text": "It was not until early 1018, when the Treaty of Bautzen ended the hostilities on Boleslav’s western frontier", "start": 239.5, "duration": 7.18}, {"text": "that he could concentrate his attention on the East and possibly expand his influence onto Kievan Rus.", "start": 246.76, "duration": 6.38}, {"text": "In the summer of the same year, Boleslav led a plentiful Polish contingent intending to take over Kiev and install Sviatopolk on the throne.", "start": 253.64, "duration": 8.3}, {"text": "Boleslav’s forces were supplemented by a few hundred German knights, Hungarian mercenaries and a sizeable unit of Pecheneg riders.", "start": 262.1, "duration": 8.62}, {"text": "Seemingly, Grand Prince Yaroslav could have mounted the defence at the border strongholds or even at the capital,", "start": 271.12, "duration": 6.6}, {"text": "but being aware that Sviatopolk’s faction in the Kievan Rus was still going surprisingly strong;", "start": 278.14, "duration": 5.74}, {"text": "he had to make sure his brother was not allowed to set foot within the Kievan domain.", "start": 283.88, "duration": 4.88}, {"text": "Thus, Yaroslav’s host of roughly equal size to that of the Polish duke rushed out West to face the enemy.", "start": 289.1, "duration": 7.44}, {"text": "Before he was able to reach the bordering Bug River,", "start": 296.98, "duration": 2.84}, {"text": "Yaroslav received reports that Boleslav’s Pecheneg allies managed to ride straight to Kiev unhindered", "start": 300.08, "duration": 6.6}, {"text": "and had laid the siege of the city.", "start": 306.78, "duration": 2.08}, {"text": "Yaroslav sent some of his men back to bolster the Kievan garrison,", "start": 309.04, "duration": 3.78}, {"text": "but the main body of his army continued the march West, arriving at the eastern bank of the Bug river on 22nd of July.", "start": 312.94, "duration": 8.14}, {"text": "Soon, the scouts brought news that Boleslav’s host was already pitching tents on the other bank of the river.", "start": 321.28, "duration": 6.68}, {"text": "While Yaroslav was undoubtedly worried about the situation in Kiev,", "start": 328.42, "duration": 4.06}, {"text": "at least the tactical position of his main army was much better,", "start": 332.48, "duration": 3.56}, {"text": "as it was Boleslav who had to take the risk of crossing the river.", "start": 336.04, "duration": 4.34}, {"text": "Initially, both sides engaged mostly in minor skirmishes and verbal swordplay", "start": 340.48, "duration": 5.2}, {"text": "while the Polish side prepared the equipment and makeshift bridges to cross the river.", "start": 345.68, "duration": 4.6}, {"text": "It all appeared to be a lengthy standoff, especially as Boleslav ordered the preparation of a feast for his troops.", "start": 350.44, "duration": 6.42}, {"text": "But in the morning of the very next day, events escalated quickly.", "start": 357.02, "duration": 4.36}, {"text": "Upon seeing Polish soldiers and servants gutting animals near the river,", "start": 361.54, "duration": 4.3}, {"text": "Yaroslav’s vanguard made some attempts at harrassing the camp dwellers.", "start": 365.84, "duration": 4.24}, {"text": "In response, enraged Polish skirmishers crossed the river and managed to kill some of Yaroslav’s skirmishers and push back the rest,", "start": 370.16, "duration": 7.48}, {"text": "unexpectedly gaining a foothold on the Eastern bank of the river in the process.", "start": 377.82, "duration": 4.88}, {"text": "Both rulers were swiftly informed of these new circumstances, but Boleslav’s response was much quicker.", "start": 383.18, "duration": 5.8}, {"text": "In no time, using bridges, boats and horses, Boleslav’s men crossed the river and stormed Yaroslav’s host,", "start": 389.78, "duration": 6.62}, {"text": "which had barely even started forming the battle line.", "start": 396.52, "duration": 2.9}, {"text": "Battle ensued as Yaroslav struggled to muster as many men as he could", "start": 399.56, "duration": 4.42}, {"text": "to supress the rising number of enemy soldiers who managed to cross the river.", "start": 404.04, "duration": 4.56}, {"text": "But, as the clash raged, Yaroslav’s ill-prepared defence grew weaker and casualties mounted.", "start": 408.64, "duration": 5.98}, {"text": "The Kievan ruler knew that his men were not inferior, and still hoped to the last moment  that the tide would turn.", "start": 414.82, "duration": 7.44}, {"text": "Yet Boleslav and his retinue would not let the victory slip out of their hands.", "start": 422.48, "duration": 4.18}, {"text": "It was not even an hour into the battle when the Kievan host was forced to retreat to avoid further losses.", "start": 426.78, "duration": 6.7}, {"text": "It was a significant loss to Yaroslav, whose casualties were so considerable that he didn’t even attempt to relieve Kiev", "start": 433.66, "duration": 6.6}, {"text": "but retreated straight back to Novgorod to treat wounds and resupply.", "start": 440.52, "duration": 4.38}, {"text": "Boleslav, on the other hand, marched to the city besieged by the Pechenegs and soon received the surrender of its forsaken garrison.", "start": 444.98, "duration": 7.62}, {"text": "Sviatopolk was reinstated as the Grand Prince of Kiev and a couple of months later Boleslav,", "start": 452.76, "duration": 5.64}, {"text": "content with the positive outcome of his eastern campaign, departed on his way back to Poland with his carts full of loot and treasures.", "start": 458.44, "duration": 7.32}, {"text": "For Sviatopolk however, the intervening months were not so fortunate.", "start": 466.36, "duration": 3.72}, {"text": "Despite the considerable following he had in Kiev,", "start": 470.54, "duration": 2.6}, {"text": "he failed to capitalize on this and create a strong centre of power.", "start": 473.3, "duration": 3.66}, {"text": "Just a year later, he was once again threatened by Yaroslav,", "start": 477.12, "duration": 3.3}, {"text": "who gathered another host but this time defeated Sviatopolk in the field.", "start": 480.68, "duration": 4.56}, {"text": "Sviatpolk once again attempted to flee to Poland and the support of his father-in-law,", "start": 485.4, "duration": 4.3}, {"text": "but instead he died of wounds on his way there.", "start": 490.18, "duration": 2.9}, {"text": "Thus, Yaroslav was left as the only claimant to the Kievan throne.", "start": 493.36, "duration": 4.4}, {"text": "Despite his initial setbacks Yaroslav maintained the position of Grand Prince for the next 35 years,", "start": 497.76, "duration": 6.48}, {"text": "elevating Kievan Rus to one of the strongest medieval states in the region", "start": 504.24, "duration": 4.44}, {"text": "and posthumously gaining the telling nickname of Yaroslav the Wise.", "start": 508.84, "duration": 5.34}, {"text": "This video is sponsored by Audible.", "start": 517.02, "duration": 2.64}, {"text": "Before there was writing, there was the spoken word. Until the end of July, Audible is offering an amazing deal to all Amazon Prime members:", "start": 519.66, "duration": 7.76}, {"text": "Head over to audible.com/bazbattles or text bazbattles to 500 500, and get your first three months for only $4.95 per month, a third of what you would ordinarily pay.", "start": 527.44, "duration": 13.06}, {"text": "Thereafter, it’s just $14.95 a month.", "start": 540.5, "duration": 3.1}, {"text": "With the largest collection of audio books on the planet you can have your pick of any title per month along with 2 Audible Originals", "start": 543.86, "duration": 6.7}, {"text": "exclusive titles produced specifically for Audible by some of the worlds finest authors and narrators.", "start": 550.68, "duration": 5.48}, {"text": "A strong recommendation for fans of our channel would be A History of War in 100 Battles, a look at 100 conflicts of the past that influence us, today.", "start": 556.56, "duration": 9.52}, {"text": "Support our channel, go to audible.com/bazbattles or if you’re in the US you can also SMS bazbattles to 500 500,", "start": 566.08, "duration": 8.62}, {"text": "sign up before the end of July and if you’re an Amazon Prime customer receive your first three months each at a third of the regular cost.", "start": 574.7, "duration": 8.76}]