[{"text": "Hi, my name is Sam Johnson, and I am a voice teacher", "start": 0.0, "duration": 2.25}, {"text": "I'm going to be reacting to and analyzing female metal singers expectation versus reality", "start": 2.409, "duration": 5.42}, {"text": "Vests resume", "start": 9.7, "duration": 2.0}, {"text": "With this live version she just sounds like she's letting it release a little bit more up into her head", "start": 44.539, "duration": 4.52}, {"text": "She doesn't have as much connection on the free and it turns it into this more classical sort of sound", "start": 49.059, "duration": 6.45}, {"text": "And then this one comes back in the opposite of that", "start": 56.269, "duration": 3.59}, {"text": "Yeah, it just seems like on her evals", "start": 71.659, "duration": 2.72}, {"text": "It's kind of pulling back just a little bit becoming really released rather than holding on to it", "start": 74.45, "duration": 7.01}, {"text": "But when when she goes over to some of the other bowels, it's much more forward", "start": 84.049, "duration": 4.73}, {"text": "It doesn't have nearly the concern for release or backspace' It's still easy and pretty free", "start": 88.88, "duration": 5.75}, {"text": "But it's not", "start": 94.63, "duration": 1.36}, {"text": "It's not as classical sounding as her evals are today", "start": 95.99, "duration": 4.459}, {"text": "Sponsor is mass drop", "start": 100.45, "duration": 1.169}, {"text": "They sent over these mass drop x sennheiser", "start": 101.619, "duration": 2.79}, {"text": "HD 6x x's about a week ago and i've really enjoyed", "start": 104.78, "duration": 3.919}, {"text": "Using them they have this open back so I can hear what my voice sounds like in the room and that makes me comfortable", "start": 108.77, "duration": 5.75}, {"text": "Using them for these videos that I make and for voice lessons over Skype and FaceTime", "start": 114.619, "duration": 4.639}, {"text": "Because I can hear the singer really really well with them. It's very very high quality audio", "start": 119.39, "duration": 4.549}, {"text": "Sennheiser has always been very good at that and they're also super super comfortable", "start": 124.219, "duration": 4.01}, {"text": "I mean I've worn them for entire teaching days and", "start": 128.289, "duration": 3.36}, {"text": "I don't really feel this need to take them off like you get with some headphones", "start": 131.84, "duration": 4.13}, {"text": "Especially some over here", "start": 135.97, "duration": 1.45}, {"text": "because these just kind of surround your ears and create this pillow of sound you can still hear what's going on around you and I", "start": 137.42, "duration": 6.5}, {"text": "Really like that. So I highly suggest going to mass drop and picking up the mass drop Sennheiser", "start": 143.92, "duration": 7.169}, {"text": "Six x axis the HDS. They're really high class", "start": 151.819, "duration": 3.289}, {"text": "headphones", "start": 155.69, "duration": 1.049}, {"text": "they work super well and", "start": 156.739, "duration": 1.59}, {"text": "when I first got them I was so excited about it that I just sat on my couch for a few hours and listened to", "start": 158.329, "duration": 5.33}, {"text": "All my favorite songs, like all of these songs that I kind of test out headphones with and they sounded super good", "start": 163.66, "duration": 5.579}, {"text": "So for both work, and for fun, I think they're a really nice headphone. They do have this open back though", "start": 169.239, "duration": 6.119}, {"text": "So it's going to leak some sound out into the world. I wouldn't suggest them for like airplanes or something", "start": 175.359, "duration": 5.25}, {"text": "maybe get something with a closed back but for being at home and just", "start": 180.609, "duration": 3.96}, {"text": "not having to worry about", "start": 185.15, "duration": 1.98}, {"text": "blocking out other sounds I", "start": 187.13, "duration": 2.0}, {"text": "Really think that they're a high quality choice", "start": 189.5, "duration": 1.97}, {"text": "so go check out the link below or I have it in my description and", "start": 191.47, "duration": 3.479}, {"text": "You can go pick up a pair of these headphones for yourself. Thank you master op for your sponsorship", "start": 195.169, "duration": 4.34}, {"text": "Pretty similar", "start": 229.439, "duration": 2.0}, {"text": "Laughs that's really really similar. She did a good job in both of those", "start": 239.239, "duration": 4.279}, {"text": "It's a little bit more disconnected", "start": 247.13, "duration": 2.0}, {"text": "Pretty traditional classical sounds", "start": 261.45, "duration": 2.0}, {"text": "Yes, she does a pretty good job with that", "start": 291.47, "duration": 1.61}, {"text": "I wish that she would let it touch back in to test a little bit more", "start": 293.08, "duration": 2.909}, {"text": "But it she doesn't need to and it's her prerogative. She's able to get this sound pretty clear", "start": 295.99, "duration": 4.62}, {"text": "It just sounds a little bit disconnected sometimes to me especially as she starts going towards her lower notes", "start": 300.77, "duration": 5.81}, {"text": "I think if she wanted to get a little bit more beef in those just letting a little more of that chest voice come in", "start": 306.58, "duration": 5.369}, {"text": "Would maybe make it a smoother transition?", "start": 311.95, "duration": 2.069}, {"text": "But as she did it, it's completely fine", "start": 314.66, "duration": 2.239}, {"text": "Then this has a lot more connection than the singer before", "start": 321.44, "duration": 2.75}, {"text": "So this sounds a lot more like just a high", "start": 332.31, "duration": 2.179}, {"text": "Chest mix to me rather than the one before which was a little bit more disconnected. So it wasn't mixing in the chest voice", "start": 334.59, "duration": 6.17}, {"text": "So we didn't get nearly as much twang in the voice. We didn't get as much", "start": 340.76, "duration": 3.809}, {"text": "Connection or power it's just it's a tonal difference is the main difference though", "start": 345.21, "duration": 4.76}, {"text": "And with this one, it just doesn't sound as round or as classical", "start": 349.97, "duration": 5.609}, {"text": "That's pretty good, I mean she's adding a little bit of distortion", "start": 378.29, "duration": 2.369}, {"text": "I think she's probably a little bit tired with just the overall sound of her voice", "start": 380.66, "duration": 4.32}, {"text": "She also has a very open sound in this which is generally associated with pulling chests", "start": 385.29, "duration": 5.57}, {"text": "Which she'd is doing just a little bit", "start": 390.86, "duration": 2.16}, {"text": "I think that if she was getting tired with this part if she was actually exhausted and this wasn't just a", "start": 393.02, "duration": 5.609}, {"text": "Effect that she's putting on a good solution might be just adding in a little bit more nasal sound just a little bit", "start": 399.12, "duration": 7.28}, {"text": "It's just a little bit back end a little bit too open and you wouldn't even need to go really nasal", "start": 406.71, "duration": 6.229}, {"text": "It's just a little bit more closed spoken like of owls", "start": 412.94, "duration": 3.119}, {"text": "I", "start": 416.06, "duration": 0.55}, {"text": "Think she could still get this nice open effect that she has", "start": 416.61, "duration": 3.38}, {"text": "but have a little bit more forward ring and that might be able to preserve her voice for the rest of the set if she", "start": 420.12, "duration": 6.29}, {"text": "Was getting a little bit tired if she was doing this on purpose", "start": 426.41, "duration": 2.61}, {"text": "I think that she could have done that on purpose and it's completely fine", "start": 429.02, "duration": 3.659}, {"text": "Now it's disconnected", "start": 434.52, "duration": 2.0}, {"text": "So what kind of sounds like two voices", "start": 439.57, "duration": 1.82}, {"text": "There's the one that's got a little bit of extra heaviness to it a little bit of extra weight and that's got the growl in", "start": 441.39, "duration": 5.549}, {"text": "It and then she just disconnects and she goes up into her head voice and it's a rounder sound", "start": 446.94, "duration": 5.339}, {"text": "It's not really trying to be connected with the bottom. I would prefer for it to connect with the bottom", "start": 452.28, "duration": 5.01}, {"text": "I think that it would give her a little bit more continuity in her voice", "start": 457.29, "duration": 3.059}, {"text": "But it also works almost like a Beauty and the Beast type thing where this top is", "start": 460.48, "duration": 4.22}, {"text": "Really really round and clear and pretty and the bottom has a little bit more grit to it", "start": 464.77, "duration": 4.069}, {"text": "Dad then this is a little bit more back", "start": 479.85, "duration": 1.77}, {"text": "So if she brought that more forward, it would probably influence how she sinks her lower notes", "start": 481.62, "duration": 4.25}, {"text": "And I think that would make the lower notes a little bit easier to sing", "start": 485.87, "duration": 3.179}, {"text": "But I again it's mostly a tonal choice that I think she's making", "start": 489.15, "duration": 4.339}, {"text": "So it sounds like on some of the really high ones she's kind of flipping", "start": 525.04, "duration": 3.979}, {"text": "She's letting go of some of the cord closure that she had that feeling of hold on that she had for some of her lower", "start": 529.02, "duration": 4.83}, {"text": "Notes and then she comes back down and it's a little bit more connected again a little bit more forward", "start": 533.85, "duration": 5.219}, {"text": "So it's almost like a yodel where you go up for these high parts that are disconnected and then come back to a more", "start": 539.17, "duration": 5.299}, {"text": "connected place", "start": 544.84, "duration": 2.0}, {"text": "Pretty forward connected", "start": 550.11, "duration": 2.0}, {"text": "I like this now. She's good", "start": 560.96, "duration": 4.159}, {"text": "Like that", "start": 570.65, "duration": 2.0}, {"text": "I kind of don't think that she was yodeling in that one", "start": 580.63, "duration": 3.53}, {"text": "It was lighter up at the top", "start": 584.16, "duration": 1.8}, {"text": "But it wasn't completely disconnected and she was able to blend that sound into this bigger", "start": 585.96, "duration": 6.029}, {"text": "Bell tear sound a little bit lower it wasn't super belty", "start": 592.33, "duration": 3.14}, {"text": "It was influenced heavily by how easy her high notes were", "start": 595.47, "duration": 2.849}, {"text": "But it was it wasn't quite a yodel there wasn't quite as big of a difference in the amount of cord closure", "start": 598.54, "duration": 5.659}, {"text": "I think it's just she wasn't going as intensely into it. I really like that", "start": 604.2, "duration": 4.109}, {"text": "I think that she showed a lot of control that she showed a lot of vocal prowess in that clip", "start": 608.31, "duration": 4.5}, {"text": "I like this too. It's a really nice forward sound", "start": 625.34, "duration": 3.33}, {"text": "It's a little bit more intense", "start": 645.74, "duration": 2.759}, {"text": "I think she's just leaning into it a little bit more. It sounds pretty similar in that", "start": 653.56, "duration": 4.169}, {"text": "It's easy sounding it doesn't sound like it's super strained or tense or anything", "start": 657.73, "duration": 4.08}, {"text": "It just sounds like it's more intense because in the first clip where it was the studio recording it didn't sound like she was", "start": 661.91, "duration": 7.61}, {"text": "Pushing into it or leaning into it as hard as she is with this one. I liked the first one", "start": 670.04, "duration": 4.46}, {"text": "It just sounded super super spoken and that's usually where I like people to start to be able to go from that very spoken place", "start": 674.5, "duration": 6.299}, {"text": "to then lean into this more intense place as long as you know where that more spoken easier place is", "start": 680.81, "duration": 6.109}, {"text": "then you can go play around and do some exploratory stuff and go more intense and", "start": 687.2, "duration": 4.909}, {"text": "break rules for a little bit because you know where home is and you know where safety is so you're gonna be able to get", "start": 692.27, "duration": 5.239}, {"text": "Through your set because if things go wrong, you can just come back to that safe area", "start": 697.51, "duration": 3.779}, {"text": "And then it's a little more intense and back to the", "start": 705.11, "duration": 5.07}, {"text": "I like that. It's a very narrow vowel it helped her slide up with a lot of twang. Oh, yeah", "start": 716.92, "duration": 5.669}, {"text": "I really like that sound that she just used", "start": 722.589, "duration": 2.0}, {"text": "Lots of grit", "start": 733.52, "duration": 2.0}, {"text": "Very similar", "start": 745.98, "duration": 2.0}, {"text": "That's a nice sounding voice", "start": 754.91, "duration": 2.0}, {"text": "That's a really nice sounding scream", "start": 769.709, "duration": 1.761}, {"text": "I'm not sure exactly how she's making the sound, but it sounds healthy to me", "start": 771.47, "duration": 5.07}, {"text": "Usually if if a scream isn't gonna feel very good. It's gonna sound really random", "start": 776.97, "duration": 5.179}, {"text": "Like it's just all of this noise but random amounts of it and it's got like a harshness to it", "start": 782.94, "duration": 5.539}, {"text": "but under hers", "start": 788.48, "duration": 1.2}, {"text": "She has this very nice sounding", "start": 789.68, "duration": 3.27}, {"text": "Singing voice and then it's just this distortion on top of it", "start": 793.41, "duration": 3.859}, {"text": "But the nice beautiful sounding singing voice is still ringing through it's just that it's colored really interestingly", "start": 797.269, "duration": 6.93}, {"text": "and so I think that that's a much more sustainable way to scream than if we were just", "start": 804.24, "duration": 4.159}, {"text": "Gutturally blowing out our vocal cords all the way through because then you wouldn't be able to get that nice clean underneath it", "start": 809.22, "duration": 6.32}, {"text": "Sounds so good", "start": 820.63, "duration": 2.0}, {"text": "That was a little bit more intense than the one before", "start": 837.519, "duration": 2.9}, {"text": "I actually really liked all of that. There wasn't anything that stood out as being like super hard for me", "start": 846.4, "duration": 5.039}, {"text": "It was just a forward really ringy slidy sound", "start": 851.44, "duration": 3.21}, {"text": "it sounds like she was just kind of sliding up to those high notes and that helped them stay really connected to the rest of", "start": 854.65, "duration": 6.21}, {"text": "the phrase", "start": 860.86, "duration": 0.97}, {"text": "the second one in the live version", "start": 861.83, "duration": 1.62}, {"text": "It was a little bit more intense", "start": 863.45, "duration": 1.67}, {"text": "But I don't think that that was bad necessarily because she when she started coming back down that intensity", "start": 865.12, "duration": 7.68}, {"text": "wasn't", "start": 873.71, "duration": 1.29}, {"text": "Manifesting in like a distorted or a tense sound", "start": 875.0, "duration": 4.4}, {"text": "It was just more intense and slid down and it was easy and clear", "start": 879.4, "duration": 4.919}, {"text": "I think that she did a really good job with both of those", "start": 884.32, "duration": 2.19}, {"text": "Yes, she's good", "start": 901.1, "duration": 2.0}, {"text": "Stop very nice vowels", "start": 912.319, "duration": 2.0}, {"text": "I like that", "start": 922.67, "duration": 2.0}, {"text": "And it's really disconnected up at the top more the classical sound again", "start": 927.76, "duration": 3.38}, {"text": "It's good, it's disconnected up at the top. She's spending all of her time", "start": 952.7, "duration": 3.079}, {"text": "Up above like the DD sharp", "start": 956.96, "duration": 2.479}, {"text": "so it", "start": 959.57, "duration": 0.99}, {"text": "There's no real need for her to start adding back in chest voice because it's high enough and she wants this sound that's more round", "start": 960.56, "duration": 6.859}, {"text": "more spinny", "start": 967.61, "duration": 0.89}, {"text": "I think that it's harder to understand personally just because once you get up there if", "start": 968.5, "duration": 4.739}, {"text": "Everything is in this rule place that you don't have as good of vowel differentiation", "start": 973.52, "duration": 4.369}, {"text": "But it gives it this very specific sound", "start": 978.11, "duration": 2.96}, {"text": "so I", "start": 981.07, "duration": 0.61}, {"text": "I like to think of it more like if you're using that you want that tone color if you started mixing in a little bit", "start": 981.68, "duration": 6.32}, {"text": "More I think it would be easier to understand you could still have a nice round beautiful tone color", "start": 988.0, "duration": 4.619}, {"text": "But it would never sound exactly like that", "start": 992.72, "duration": 2.36}, {"text": "I mean", "start": 995.08, "duration": 0.6}, {"text": "that's", "start": 995.68, "duration": 0.67}, {"text": "the only way to get that sound is to kind of", "start": 996.35, "duration": 2.69}, {"text": "Let go and ask for a really really realm really fruity sound up high. I I don't think that either of them is wrong", "start": 999.14, "duration": 6.559}, {"text": "I do think that going into the mixer one is a little bit more versatile", "start": 1005.7, "duration": 3.719}, {"text": "it lets you get more of these sounds a little bit more like what she just did that's harder to start transitioning into", "start": 1009.42, "duration": 5.58}, {"text": "Some other styles of singing then just a straight mix would be but I think that it's completely fine", "start": 1015.16, "duration": 6.29}, {"text": "It's a healthy sound. It's pretty sustainable", "start": 1021.45, "duration": 2.0}, {"text": "It's like there's the scream is forward somehow and then there's a vowel that she can change underneath it", "start": 1054.53, "duration": 5.57}, {"text": "But the scream is remaining constant. It's actually like super legato", "start": 1060.1, "duration": 4.169}, {"text": "It's and as she goes between the words there's this distortion that's remaining completely consistent all the way through it", "start": 1064.27, "duration": 6.81}, {"text": "And then she's just changing her vowels a little bit. We get vowel differentiation, but she's not changing the part", "start": 1071.08, "duration": 5.64}, {"text": "That's making this this really nice drone of distortion. And so I think that that's pretty sustainable", "start": 1076.72, "duration": 5.699}, {"text": "I mean she's found out how to make this sound", "start": 1082.42, "duration": 2.07}, {"text": "Really really consistent across it would be interesting for me to hear her go back to a clean sound", "start": 1084.83, "duration": 5.27}, {"text": "But I don't know if she does that and like what she did right there. That was really nice. I think", "start": 1090.1, "duration": 4.5}, {"text": "It's very free sound", "start": 1149.62, "duration": 2.0}, {"text": "It sounds like as she starts going to the lower notes", "start": 1160.21, "duration": 2.4}, {"text": "She's letting a little bit more connection come in", "start": 1162.61, "duration": 2.13}, {"text": "which I prefer and", "start": 1164.74, "duration": 1.36}, {"text": "Then as she goes up higher", "start": 1166.1, "duration": 1.22}, {"text": "It's still connected because she's able to connect it back down to those lower notes a little bit and it doesn't sound", "start": 1167.32, "duration": 6.42}, {"text": "Just round and like she's completely flipped", "start": 1173.81, "duration": 2.66}, {"text": "I think that what she's doing is pretty good and that she's at least aware of letting the feeling", "start": 1176.47, "duration": 4.589}, {"text": "Migrate back down to her chest as she goes towards low notes. So I think this is a really nice sound", "start": 1181.19, "duration": 5.119}, {"text": "She's still not pressing into it and she doesn't need to it's a really nice moderate sound", "start": 1186.38, "duration": 4.909}, {"text": "So yeah with a lot of these singers they're doing really really well", "start": 1210.26, "duration": 2.809}, {"text": "they're pretty consistent between", "start": 1213.08, "duration": 1.83}, {"text": "studio and live and I think that this is kind of one of the points of this video is to just show off how", "start": 1214.91, "duration": 5.75}, {"text": "Consistent a lot of these singers are and they are they really are pretty consistent", "start": 1221.059, "duration": 3.77}, {"text": "They know exactly how to stay in their Lane make the sounds that they're asking for", "start": 1224.83, "duration": 3.15}, {"text": "I think if I was in a voice lesson with some of these singers my goal would be to make sure that they can", "start": 1227.98, "duration": 4.8}, {"text": "Do some of the sounds that they're choosing not to do because they are using some pretty extreme sounds either with", "start": 1232.94, "duration": 5.63}, {"text": "Extreme in that it's completely disconnected and round from the top", "start": 1238.97, "duration": 3.89}, {"text": "I'd want to make sure that they can connect back down and that they're just doing that as a tonal choice", "start": 1242.86, "duration": 4.949}, {"text": "with the really aggressive singers", "start": 1248.51, "duration": 2.059}, {"text": "I would just make sure that they are able to go between that and cleans pretty easily and that's mostly just to make sure that", "start": 1250.57, "duration": 5.91}, {"text": "Everything that they're doing is a choice rather than that", "start": 1256.48, "duration": 2.969}, {"text": "They're just pushing to get it and they're guessing every time because if things are a choice", "start": 1259.45, "duration": 4.709}, {"text": "Then you get a lot more consistency and you get a lot more", "start": 1264.159, "duration": 2.4}, {"text": "Longevity in your career if things are just happening because that's the only no way you know how to do it", "start": 1266.809, "duration": 4.7}, {"text": "Then you might blow out your voice at some point or you might", "start": 1271.73, "duration": 3.589}, {"text": "Not be able to be as versatile of a performer as you might want to be. Thank you for watching", "start": 1275.48, "duration": 4.189}, {"text": "Please like and subscribe go check out the description below", "start": 1279.669, "duration": 2.52}, {"text": "I have links to my patreon my Instagram and my website vocal EES", "start": 1282.19, "duration": 4.02}, {"text": "Net where you can go if you're interested in signing up for a voice lesson with me. Thank you", "start": 1286.28, "duration": 4.25}]