[{"text": "This video has been brought to you by Express VPN, making me finally a real youtuber.", "start": 0.06, "duration": 5.34}, {"text": "Most people know Elon Musk is the CEO of SpaceX and Tesla, Inc.", "start": 5.58, "duration": 4.1}, {"text": "where he stands out from other business leaders for his bold risk-taking, work ethic, vision for the future of humanity", "start": 9.9, "duration": 5.6}, {"text": "and smoking weed on Joe Rogan's podcast", "start": 15.5, "duration": 2.22}, {"text": "and being the leader of two companies means he has one of the most demanding schedules in the business world,", "start": 18.02, "duration": 4.56}, {"text": "spending at least 40 hours a week at SpaceX and 40 hours a week at Tesla.", "start": 22.8, "duration": 4.5}, {"text": "That means on any given day he spends 16 hours working, 2 hours on his daily routines and meals, and there's 24 hours in a day", "start": 27.3, "duration": 7.06}, {"text": "That means he only has six hours a night left to shit post on Twitter", "start": 34.42, "duration": 3.7}, {"text": "For those unfamiliar with his companies, the most notable achievements of Tesla Inc. have been designing innovative", "start": 38.32, "duration": 5.12}, {"text": "electric cars that actually looked good and, more recently, the Tesla Roadster 2020", "start": 43.6, "duration": 4.14}, {"text": "which is not only electric but has the fastest", "start": 48.12, "duration": 2.34}, {"text": "acceleration out of any supercar ever made, can park and change lanes by itself,", "start": 50.54, "duration": 4.5}, {"text": "And while you might think it could be unsafe due to the lack of sideview mirrors", "start": 55.06, "duration": 3.47}, {"text": "It actually has the highest safety rating ever achieved, on account of the fact there is currently no way to enter the vehicle.", "start": 58.53, "duration": 6.05}, {"text": "Meanwhile, at SpaceX", "start": 64.74, "duration": 1.28}, {"text": "Well, they make money through contracts with organizations like NASA and privately launching satellites", "start": 66.02, "duration": 4.58}, {"text": "The entire mission director of the company is to establish a space colony on Mars in the next half century", "start": 70.869, "duration": 5.06}, {"text": "And while this might seem ambitious, one of the ways you know", "start": 76.18, "duration": 2.509}, {"text": "Elon's ideas are so good is because his speeches aren't. In fact every time he's on stage", "start": 78.689, "duration": 4.62}, {"text": "it's almost indistinguishable from a kindergartner doing show-and-tell with their favorite Hot Wheel.", "start": 83.31, "duration": 4.26}, {"text": "The only difference is instead of an aluminum matchbox car powered by falling", "start": 87.7, "duration": 3.77}, {"text": "It's an actual car piloted by a dummy in a spacesuit that he's literally blasted to the International Space Station for the meme.", "start": 91.47, "duration": 6.809}, {"text": "Even when he's describing the future of humanity as an extraterrestrial species, it's once again indistinguishable from the back of the Starcraft box.", "start": 98.59, "duration": 7.639}, {"text": "Besides his companies, Elon Musk is just as interesting as a person. He was born in Pretoria, near Johannesburg", "start": 106.86, "duration": 5.98}, {"text": "making him the world's richest African-American. The start of college he asked himself", "start": 113.04, "duration": 4.14}, {"text": "what were going to be the most important things for humanity in his lifetime. Which he decided were the internet, sustainable energy, and space exploration.", "start": 117.18, "duration": 7.44}, {"text": "Then instead of being distracted by girls in college and giving up on his dream like a normal person", "start": 125.08, "duration": 4.58}, {"text": "He was distracted by girls in college and still did it anyway", "start": 129.729, "duration": 3.05}, {"text": "One of my favorite Elon stories is of him chasing a girl named Justine he had a crush on in college", "start": 133.62, "duration": 5.0}, {"text": "And after getting rejected for an ice cream date", "start": 139.04, "duration": 2.0}, {"text": "He showed up where she was studying with two chocolate chip ice cream cones", "start": 141.24, "duration": 3.08}, {"text": "melting from the indoor climate control ...and his love.", "start": 144.68, "duration": 2.68}, {"text": "And while this sounds super cute, at the time this strategy did not work, on account of the fact", "start": 147.66, "duration": 4.12}, {"text": "he did not follow my first golden rule of not being creepy:", "start": 151.79, "duration": 2.849}, {"text": "which is being above a 7.", "start": 155.01, "duration": 1.86}, {"text": "He did however later find success when he followed my second golden rule of not being creepy, which was being worth 20 billion dollars.", "start": 156.87, "duration": 6.92}, {"text": "Incidentally, this also fixed the first rule. Regardless, thanks to Elon's ice cream tactics", "start": 164.37, "duration": 4.279}, {"text": "He and Justine eventually had five kids together, which is just enough to collect the remaining infinity stones.", "start": 168.65, "duration": 5.19}, {"text": "Since the end of the marriage with his first wife, Elon has been in the spotlight for many high-profile relationships including ones with Talulah Riley", "start": 174.45, "duration": 7.189}, {"text": "Amber Heard and now Grimes, who he met on Twitter", "start": 182.06, "duration": 2.58}, {"text": "Now you might be expecting me to explain Elon's taste in women,", "start": 185.04, "duration": 3.16}, {"text": "but the only analogy I can think of is when I listen to my pop playlist and it accidentally shuffles with Evanescence and I'm like, \"hmmm, yeah, I needed this.\"", "start": 188.2, "duration": 9.2}, {"text": "In addition to running his companies and sliding into the DMs of synth-pop Canadians", "start": 197.4, "duration": 4.64}, {"text": "Elon also works a little bit with OpenAI,", "start": 202.04, "duration": 2.26}, {"text": "SolarCity, and owns what he's called \"The Boring Company\" that will soon be drilling enormous tunnels underneath Chicago and Los Angeles.", "start": 204.92, "duration": 6.6}, {"text": "For what he says will be high-speed transit", "start": 211.98, "duration": 2.239}, {"text": "But honestly at this point he could just be playing IRL motherlode because I think we've all decided just to let him do whatever.", "start": 214.26, "duration": 5.72}, {"text": "But what excites and terrifies me the most is his grand plan to bring everything that he's doing together simultaneously", "start": 220.8, "duration": 5.599}, {"text": "And unlike companies like Apple who will eventually have an iPhone implanted in your brain or Google that will literally be your brain", "start": 226.739, "duration": 6.77}, {"text": "Elon is going for the monopoly on an entire planet because think about it like this", "start": 233.67, "duration": 4.1}, {"text": "SpaceX builds the rockets to take us to Mars and establishes the Mars colonies. The Boring Company builds tunnels to connect them all,", "start": 238.53, "duration": 7.13}, {"text": "Solar City powers everything with solar panels", "start": 245.85, "duration": 2.449}, {"text": "Tesla makes the cars that run on the electricity, the AI keeps law and order, and then when it's all ready Elon takes", "start": 248.76, "duration": 6.739}, {"text": "50% of the population to Mars of the snap of his fingers.", "start": 255.78, "duration": 2.69}, {"text": "Well, I'm sure some people don't like the idea of one company controlling a whole planet, at least when you visit earth you'll be able", "start": 259.26, "duration": 6.38}, {"text": "to tell everyone that you on a trip to Disney World.", "start": 265.64, "duration": 2.889}, {"text": "Now, if you're looking for some kind of protection and privacy from our corporate overlords, you might want to try our sponsor, ExpressVPN", "start": 270.4, "duration": 6.23}, {"text": "because there's a real reason they become so popular. All your information is completely encrypted", "start": 277.15, "duration": 4.64}, {"text": "So no one can steal your personal information or more importantly see your search history.", "start": 281.79, "duration": 4.019}, {"text": "You can even reroute your IP to 94 different countries", "start": 285.96, "duration": 3.24}, {"text": "If you're not having much luck on tinder locally. To show you how easy it is to use here's a real-life example", "start": 289.2, "duration": 5.759}, {"text": "Let's say you're on your computer, but have never changed your desktop wallpaper. In just one click, you're now in New York", "start": 295.3, "duration": 6.5}, {"text": "So your serene wilderness photo is actually novel again", "start": 301.8, "duration": 2.88}, {"text": "Then after briefly pondering Brexit you decide to reroute to Singapore because that's your favorite version of Netflix.", "start": 304.87, "duration": 6.74}, {"text": "Seriously though", "start": 313.69, "duration": 0.65}, {"text": "it's that easy to use on both your computer and your phone and for less than seven dollars a month you can have what's", "start": 314.34, "duration": 5.55}, {"text": "consistently the fastest VPN", "start": 320.2, "duration": 1.62}, {"text": "protecting your information whether using it day to day for", "start": 321.82, "duration": 2.6}, {"text": "gaming or for streaming. And you can even find out how to get three months free by clicking the link in the", "start": 324.52, "duration": 5.02}, {"text": "description or by going to expressvpn.com/casuallyexplained", "start": 329.62, "duration": 5.14}]