[{"text": "Hi. Why, why is internet filled with fake garbage like this guy making a fake generator to charge a cellphone.", "start": 0.0, "duration": 7.38}, {"text": "*motor noises*", "start": 7.48, "duration": 1.16}, {"text": "He glues 2 magnets to a motor shaft, solders a wall adapter to his motor,", "start": 8.78, "duration": 4.36}, {"text": "Makes a copper coil and solders a 5V voltage regulator to it, as well as a cellphone USB connector,", "start": 13.3, "duration": 6.72}, {"text": "Plugs them into the cellphone and turns the motor on and apparently, the f***ing rotating magnet generates enough electricity to charge the phone!", "start": 20.14, "duration": 8.96}, {"text": "He's not alone though. There is a whole army of idiots out there.", "start": 29.32, "duration": 3.18}, {"text": "Like this one who claims: \"Putting broken china in milk for 2 days mends it completely together.\"", "start": 32.64, "duration": 5.94}, {"text": "This video got over 144,000,000 views on Facebook. My entire channel has 88,000,000!", "start": 39.82, "duration": 6.4}, {"text": "You know, one of my relatives fell for it, and tried it.", "start": 46.56, "duration": 2.66}, {"text": "Just to realize the same broken pieces now smelling like a rotten cow.", "start": 49.34, "duration": 4.18}, {"text": "Videos like these waste everyone time and resources, because now everyone wants to try them.", "start": 53.66, "duration": 4.82}, {"text": "Obviously, milk doesn't mend china. All they did was to replace the broken plate with the good one.", "start": 58.64, "duration": 5.18}, {"text": "And they tried to match the location of the red tapes. See?", "start": 63.9, "duration": 3.08}, {"text": "*bing bong bing bong bing bong bing*", "start": 67.32, "duration": 3.14}, {"text": "In the same video, they have a bunch of other tips that could actually work.", "start": 70.68, "duration": 4.12}, {"text": "And then, they leave this fake garbage in there too.", "start": 75.0, "duration": 2.98}, {"text": "Making fake news is an art. One of my friends once told me that the best lie is the one that's wrapped in truth.", "start": 78.2, "duration": 6.28}, {"text": "A bunch of good tips makes everyone believe the 1 horribly fake one.", "start": 84.6, "duration": 3.98}, {"text": "Now please don't take this wisdom and start making fake s***.", "start": 88.68, "duration": 3.3}, {"text": "So that's what the milk guy did. Why? I mean I know why. They are looking for the juicy YouTube money and views.", "start": 92.1, "duration": 6.0}, {"text": "But you have to be at a certain level of evil to be willing to waste time and resources in such a great scale.", "start": 98.24, "duration": 5.92}, {"text": "Have you seen ThioJoe's videos? He has an entire channel dedicated to fake technology with more than 1,500,000 subscribers.", "start": 104.4, "duration": 7.38}, {"text": "Like \"How to double your internet speed\" or \"Charge your phone in no time\" all by wrapping aluminum foil, and a bunch of wires around s***!", "start": 111.92, "duration": 8.86}, {"text": "ThioJoe: It's gonna let you recharge almost instantly. You're obviously going to need your phone, normal charging cable, tin foil, some sort of wire.", "start": 121.02, "duration": 8.82}, {"text": "You just wanna take your phone and just wrap the cord around, get your tin foil and just wrap this around your phone.", "start": 129.92, "duration": 7.86}, {"text": "We're gonna plug this in for about 10 seconds. 78% is pretty good for going from 1% up to 78.", "start": 137.86, "duration": 8.14}, {"text": "Mehdi: At least now he mentions these videos are fake and joke in the video description.", "start": 146.16, "duration": 4.58}, {"text": "So, less evil maybe? But who ever reads the video description first before trying!", "start": 150.8, "duration": 5.26}, {"text": "Such people waste time of people like me too and we have to debunk s***!", "start": 156.22, "duration": 3.7}, {"text": "Except that every time I make a debunk video, I also get the juicy YouTube money.", "start": 160.36, "duration": 4.42}, {"text": "But that's not the point!", "start": 165.26, "duration": 1.06}, {"text": "Anyways, let's get to the fake phone charger. It looks like a generator but it's not.", "start": 166.58, "duration": 4.6}, {"text": "Now you might say: \"This guy looks like a decent guy who made a good generator.\".", "start": 171.5, "duration": 4.22}, {"text": "I mean why should you trust me who almost kills myself in every video.", "start": 175.98, "duration": 3.74}, {"text": "Everyone knows moving a magnet beside a coil generates electricity and he even tried to use a 5V regulator to have a proper charging voltage.", "start": 179.86, "duration": 8.6}, {"text": "Unlike me who killed my phone trying to make a handcrank charger with no regulator!", "start": 188.78, "duration": 4.62}, {"text": "Shu- Just shut up. There are a 1,000,000 reasons why this is fake.", "start": 193.54, "duration": 3.52}, {"text": "Well 1st, it doesn't matter. If you have a 5V wall adapter you can just directly plug it into your phone and charge it.", "start": 197.24, "duration": 5.46}, {"text": "Why turn a generator with it to charge the phone. But that's not the point.", "start": 202.76, "duration": 3.64}, {"text": "Let me tell you how a generator works. If you have a magnetic field like this.", "start": 206.46, "duration": 5.04}, {"text": "And a wire moves and cuts them perpendicular to the magnetic field then the electricity is generated in the wire.", "start": 211.82, "duration": 8.22}, {"text": "But if the wire is not perpendicular to the field, only the field vector that is perpendicular to the wire makes electricity in the wire.", "start": 220.22, "duration": 11.14}, {"text": "So if your wire is moving parallel to the fields it doesn't create electricity at all.", "start": 231.64, "duration": 5.42}, {"text": "The way the guy has it set up if you have the coil like this and look at the magnet from the bottom, then the fields would be coming out like this.", "start": 237.18, "duration": 8.34}, {"text": "Mehdi: So if you rotate the magnet. Friend 1: Is that \"ur-anus\"? Mehdi: Wha? *friend 1 laughs* Mehdi: Get out!", "start": 245.68, "duration": 4.58}, {"text": "We need a 3D representation of the magnet. Here is my paper magnet. And the paper magnetic field is going from one pole to the other.", "start": 250.32, "duration": 7.14}, {"text": "And this is my coil. Now if I insert the magnet into the coil like this, you see that the coil will have to cut through the magnetic fields and that creates electricity.", "start": 257.74, "duration": 10.04}, {"text": "But if I rotate the magnet like this center to the coil, you see that the coil doesn't necessarily cut any magnetic field. So, no electricity.", "start": 268.1, "duration": 9.22}, {"text": "If you rotate the magnet 90 degrees and insert into the coil, you see the coil cuts into the magnetic field but it's pretty useless because it is cutting into a posing magnetic field.", "start": 277.46, "duration": 10.62}, {"text": "So, the magnetic fields push electrons this way on one side and the other way on the other side and they cancel each other.", "start": 288.48, "duration": 6.52}, {"text": "Also, if you turn the magnet like this, it's pretty useless because the coil does not cut into any magnetic fields.", "start": 295.22, "duration": 6.38}, {"text": "So using these, you see that the guy has set up the magnet the worst way that creates the least electricity if any.", "start": 301.98, "duration": 6.64}, {"text": "The actual generators have their magnets sit up like this in to the coil and they turn this way.", "start": 309.08, "duration": 5.98}, {"text": "*paper crumbling*", "start": 315.08, "duration": 1.14}, {"text": "Let me show you the actual electricity generated in the coil on my scope.", "start": 316.34, "duration": 3.74}, {"text": "Which I love... ...and cherish...", "start": 320.5, "duration": 2.32}, {"text": "*kissing*", "start": 323.24, "duration": 1.06}, {"text": "I'll giveaway 3 of these at the end of my video. I have a bunch of magnets that are polarized like this.", "start": 324.38, "duration": 5.22}, {"text": "North on one side and south on the other side. So if I stack them together like this, It will give me a big magnet.", "start": 329.66, "duration": 7.28}, {"text": "If I want to know where the north of the magnet is, I'll just put it on a string and let go.", "start": 337.16, "duration": 4.08}, {"text": "And it turns towards the north.. Which is in that direction behind me.", "start": 342.0, "duration": 4.96}, {"text": "Now if I shove the magnet into the coil, I see that the voltage is generated.", "start": 347.48, "duration": 4.58}, {"text": "And the faster I go, the higher the amplitude. Like this:", "start": 352.5, "duration": 4.04}, {"text": "Friend 2: What the f*** are you doing? Mehdi: WHAT? Friend 2: Just close the door next time. Mehdi: WHAT!?", "start": 359.74, "duration": 4.0}, {"text": "Now let's make this same setup as the guy in the video. I put my 2 magnets on a nail like this and will rotate it with my drill.", "start": 363.94, "duration": 6.82}, {"text": "*drill noises*", "start": 370.86, "duration": 1.12}, {"text": "Now if I turn the magnet center to the coil, I only get tiny fluctuations because my magnet or the coil are not perfect.", "start": 372.02, "duration": 6.94}, {"text": "*drill noises*", "start": 379.14, "duration": 2.92}, {"text": "But if I shift it to one side, I'll get higher voltages.", "start": 382.38, "duration": 3.12}, {"text": "*drill noises*", "start": 385.68, "duration": 2.58}, {"text": "And in the best case, if I turn it like this, I would get the maximum voltage.", "start": 388.26, "duration": 3.9}, {"text": "*drill noises*", "start": 392.42, "duration": 2.58}, {"text": "And that's how the generators work.", "start": 395.32, "duration": 1.66}, {"text": "The other reason his generator is a piece of s*** is that something like this doesn't generate any significant voltage.", "start": 397.08, "duration": 5.9}, {"text": "The best I was able to capture was around 60mV. You need many more number of turns and a very good inductor core to capture most of the energy.", "start": 403.46, "duration": 8.76}, {"text": "The other reason is that as you saw in the scope, such a generator outputs an AC voltage.", "start": 412.44, "duration": 4.82}, {"text": "You need an FULL BRIDGE RECTIFIER. First to convert it to DC, before converting it into 5V using the regulator he used.", "start": 417.36, "duration": 8.68}, {"text": "You can get your full bridge rectifier from the link below.", "start": 426.1, "duration": 3.22}, {"text": "It's not gonna rectify anything though. It's just a shirt.", "start": 429.62, "duration": 2.5}, {"text": "Not only we need to rectify AC into DC first, we need a DC level more than 5V to be able to use the linear regulator he used in his video.", "start": 432.3, "duration": 8.54}, {"text": "And I only got was around 60mV peak. I assure you. His generator is a f***ing garbage.", "start": 441.0, "duration": 6.04}, {"text": "But wait! Another nail in the coffin! This is the handcrank phone charger I made in my other video.", "start": 447.1, "duration": 5.84}, {"text": "It has an actual generator that outputs to a rectifier circuit. The DC generated goes to a 5V switching regulator that outputs to a USB port for charging the phone.", "start": 453.36, "duration": 10.62}, {"text": "It turns freely like this:", "start": 464.26, "duration": 1.76}, {"text": "*cranking noises*", "start": 466.16, "duration": 1.28}, {"text": "But as soon as I plug it in to charge the phone,..", "start": 467.84, "duration": 3.12}, {"text": "*cranking noises*", "start": 471.54, "duration": 0.74}, {"text": "*thuds*", "start": 472.3, "duration": 0.82}, {"text": "F***. It is much harder to turn.", "start": 473.32, "duration": 2.76}, {"text": "*cranking noises*", "start": 476.16, "duration": 0.62}, {"text": "Because it's taking power from me to charge the phone.", "start": 476.82, "duration": 3.08}, {"text": "*cranking noises*", "start": 479.94, "duration": 0.6}, {"text": "Somewhere around 3W of power.", "start": 480.54, "duration": 2.0}, {"text": "*cranking noises*", "start": 482.54, "duration": 1.0}, {"text": "But his f***ing motor doesn't slow down a bit under the charging load when he brings the coil close.", "start": 483.56, "duration": 6.16}, {"text": "And finally, the last nail in his coffin. Fine. Let's assume he's making enough electricity and is taking current from the coil charging the phone.", "start": 496.3, "duration": 8.36}, {"text": "That current through the coil makes it's own magnetic fields that interfers with the rotating magnets.", "start": 504.8, "duration": 5.46}, {"text": "See like this: I am running some current through the coil and when I bring the magnet close", "start": 510.46, "duration": 4.42}, {"text": "*drill noises*", "start": 514.98, "duration": 2.02}, {"text": "It jumps around like this:", "start": 517.08, "duration": 1.5}, {"text": "*drill noises*", "start": 518.72, "duration": 1.72}, {"text": "But his f***ing coil is not moving at all!  All I'm saying is that he made a fake phone charger.", "start": 520.5, "duration": 5.36}, {"text": "Keysight: And now the word from the makers of the world's most expensive cellphone chargers? Keysight.", "start": 527.24, "duration": 3.92}, {"text": "We at Keysight like to charge our phones in style.", "start": 531.34, "duration": 2.8}, {"text": "Some of us like to use the $450.00 cellphone charger. But I like to use the $450,000.00 KGB grade natural mama's cellphone charger.", "start": 534.34, "duration": 8.12}, {"text": "Definite some sort of list now.", "start": 544.68, "duration": 1.26}, {"text": "GIVEAWAY TIME!", "start": 546.58, "duration": 2.14}, {"text": "Mehdi: I always wanted to have a scope since I was a baby to see exactly what's continiously f***ing me off.", "start": 548.84, "duration": 5.38}, {"text": "This thing teaches you electronics. That's why like to give you 3 more of these fantastic Keysight scopes.", "start": 554.46, "duration": 5.68}, {"text": "It's more than just any scope. It has a 20MHz function generator, a frequency counter and much more!", "start": 560.14, "duration": 5.82}, {"text": "This time, 1 goes to you, the viewers and the other 2 go to my patreons at patreon.com which you could be one too.", "start": 566.1, "duration": 6.36}, {"text": "For the viewers, I know an oscilloscope is not for everyone. So if you REALLY like it, you have to enter the draw by subscribing to Keysight Oscilloscopes channel", "start": 572.52, "duration": 8.8}, {"text": "And also leave a comment under my video saying that you want it. Something like: \"GIMME DA KEYSIGHT\". I know I'm not very creative winner. Do your best and good luck.", "start": 581.66, "duration": 9.44}, {"text": "Keysight: From a practical oscilloscope tips and less bushy eyebrow lagging, come join me on the Keysight Oscilloscopes youtube channel.", "start": 591.38, "duration": 5.16}, {"text": "*beatboxing, outro*", "start": 597.14, "duration": 8.32}]