[{"text": "This episode was sponsored by Squarespace.", "start": 0.0, "duration": 2.0}, {"text": "We all know that humans are overpowered and deserve a nerf,", "start": 15.7, "duration": 2.76}, {"text": "but that doesn't mean that there aren't any good counterplay options.", "start": 18.9, "duration": 2.38}, {"text": "And while there are plenty of builds in the game that can harass humans,", "start": 21.3, "duration": 3.3}, {"text": "none have achieved the same infamy that the goose has.", "start": 24.6, "duration": 2.62}, {"text": "The goose is easily one of the most polarizing", "start": 28.4, "duration": 2.0}, {"text": "characters in the entire game with plenty of players complaining to the devs that it needs to be nerfed.", "start": 30.42, "duration": 4.26}, {"text": "But let's do a deep dive into their stats and abilities Before we jump to conclusions here. Are they really that OP?", "start": 34.68, "duration": 5.28}, {"text": "Are there any really solid counter play options?", "start": 40.36, "duration": 2.06}, {"text": "Let's start with their two signature abilities.", "start": 42.92, "duration": 1.96}, {"text": "The first one dramatically boosts their resolve,", "start": 45.18, "duration": 2.38}, {"text": "granting near-total immunity to intimidation effects while the second one drastically increases the effectiveness of the goose's own intimidation abilities.", "start": 47.76, "duration": 7.54}, {"text": "This can lead to some absolutely hilarious", "start": 55.54, "duration": 2.44}, {"text": "situations where builds which could potentially one-shot at goose don't even have enough resolve to resist losing their nerve.", "start": 58.02, "duration": 5.56}, {"text": "The bigger the opponent is, the less effective their intimidation effects are against geese. So while a dog may spook them", "start": 64.42, "duration": 6.05}, {"text": "Behemoths like giraffes, cows, and elephants are unable to scare off the goose.", "start": 70.479, "duration": 3.77}, {"text": "Next let's have a look at the base stats of the goose.", "start": 75.34, "duration": 2.58}, {"text": "Right off the bat we notice that their best stat is HP, followed closely by their mobility.", "start": 77.92, "duration": 5.1}, {"text": "This is a bit of an unorthodox build to be honest, which could be part of the reason they're so successful.", "start": 83.44, "duration": 4.22}, {"text": "Most tanks tend to have high HP of course, but they also tend to favor defense and power over mobility.", "start": 88.36, "duration": 5.599}, {"text": "But there's one other thing worth paying attention to on the stat chart. Their power level.", "start": 94.3, "duration": 4.339}, {"text": "IT'S ABYSMAL!", "start": 99.66, "duration": 0.98}, {"text": "The goose build's max hit is so low that it would take ages for them to ever actually bring down an opponent's HP to 0.", "start": 100.869, "duration": 5.75}, {"text": "In some cases their DPS literally can't even match the natural health regeneration of their targets.", "start": 106.619, "duration": 5.37}, {"text": "So how is it that a build with almost no combat potential has been so dominant in the meta lately?", "start": 112.54, "duration": 4.429}, {"text": "Well, it ties back into their abilities.", "start": 117.46, "duration": 2.0}, {"text": "intimidation based abilities synergize perfectly with the goose's stats. Their goal with intimidation is to grant themselves control over an area, and", "start": 120.04, "duration": 6.829}, {"text": "when it works the goose player typically doesn't actually need to deal any damage in order to end the battle.", "start": 127.27, "duration": 4.129}, {"text": "But should the target resist their intimidation attempt, the two most important stats are going to be HP and mobility.", "start": 132.16, "duration": 5.479}, {"text": "HP, so that if the opponent counter attacks, you'll be able to take a hit or two, and still keep up the pressure; and", "start": 138.16, "duration": 4.849}, {"text": "the mobility so that if they actually do turn the tide of battle, you'll be able to escape.", "start": 143.65, "duration": 4.1}, {"text": "In addition to having good stats for the job,", "start": 148.66, "duration": 2.029}, {"text": "the goose build is also perfectly suited to conquer the newly created city park biomes that have become more commonplace due to the continued dominance", "start": 150.69, "duration": 7.049}, {"text": "of the human build. So what can you as a player do to counter the gooses? notorious strategy?", "start": 157.739, "duration": 4.59}, {"text": "Well, I think the chink in the armor is pretty apparent. They do basically no physical damage,", "start": 162.79, "duration": 4.639}, {"text": "so your own HP and defense level is not really something you need to worry about if you end up in a skirmish with them.", "start": 167.769, "duration": 4.91}, {"text": "Their attack strategy depends entirely on intimidation,", "start": 173.65, "duration": 2.479}, {"text": "so if your character can resist their intimidation attempts, you'll have pretty much won the battle before it ever began.", "start": 176.68, "duration": 5.24}, {"text": "So to increase your chances of resisting intimidation, you need to have a high resolve stat,", "start": 182.59, "duration": 4.55}, {"text": "which can be gained either by having high intelligence or by playing in groups.", "start": 187.18, "duration": 3.74}, {"text": "Once you've managed to stay in the fight, winning should be relatively easy, but I have some tips for that too.", "start": 191.65, "duration": 4.639}, {"text": "Geese really have only three different attack moves, those being Aerial Ace, Wing Attack, and Peck.", "start": 196.81, "duration": 4.639}, {"text": "Aerial Ace and Wing Attack are both pretty standard rushdown, attacks being short ranged and low power.", "start": 202.0, "duration": 4.849}, {"text": "But Peck is an interesting move because it's technically a spacing type move.", "start": 207.01, "duration": 4.009}, {"text": "It has a lot of range like most spacing attacks do, but the interesting part about it is that it's actually very vulnerable.", "start": 211.18, "duration": 5.54}, {"text": "Most spacing moves rely on a disjointed weapon that can pressure an opponent from a safe distance.", "start": 217.239, "duration": 3.889}, {"text": "Whether it's in the form of horns, claws, or a long beak,", "start": 221.739, "duration": 3.23}, {"text": "The function is basically the same, but with geese instead of using a protected part of their bill,", "start": 224.97, "duration": 4.229}, {"text": "they're actually taking a huge risk whenever they launch at a target.", "start": 229.2, "duration": 2.699}, {"text": "So if you target their neck and punish them whenever they're trying to Peck you you can really make the matchup difficult for them.", "start": 232.209, "duration": 5.21}, {"text": "Another thing that's near impossible for them to deal with is stealth, since their intimidation", "start": 238.09, "duration": 3.319}, {"text": "abilities are useless when they can't see the attacker coming before it's too late.", "start": 241.629, "duration": 3.05}, {"text": "So, with that in mind, here are some basic tips for beating geese. Number One: Try to resist intimidation.", "start": 244.68, "duration": 5.94}, {"text": "Number Two: Target their weak point for massive damage, and Number Three: Use stealth to prevent them from abusing intimidation abilities.", "start": 250.959, "duration": 6.11}, {"text": "Now for you goose mains out there, don't worry,", "start": 258.55, "duration": 2.209}, {"text": "I'm not just gonna give away all your secrets without giving you a tip as well.", "start": 260.76, "duration": 2.88}, {"text": "This is a big one, goose players, you need to do a better job avoiding grabs.", "start": 263.74, "duration": 3.86}, {"text": "Your high mobility stat doesn't do you any good if you get caught and can't fly away or swim.", "start": 267.94, "duration": 4.339}, {"text": "Because geese, like most birds have hollow bones,", "start": 272.92, "duration": 2.869}, {"text": "they're especially vulnerable to crush type damage, the kind often inflicted from grabs.", "start": 275.89, "duration": 4.309}, {"text": "The obvious implication here is that learning different matchups is important, you need to learn which builds are focusing on finding grabs.", "start": 280.45, "duration": 6.35}, {"text": "You also need to recognize that all three of your offensive moves have a blind spot directly behind you,", "start": 286.99, "duration": 4.52}, {"text": "and so it's absolutely essential that you don't let an opponent cross you up and grab you from behind,", "start": 291.51, "duration": 4.32}, {"text": "because once that happens, you're out of options.", "start": 296.38, "duration": 2.0}, {"text": "This makes it especially difficult to battle two opponents at once,", "start": 299.26, "duration": 2.809}, {"text": "since it's nearly impossible to avoid getting grabbed by one while you're attacking the other.", "start": 302.2, "duration": 3.799}, {"text": "but really, the best tip I can give goose mains is that you should switch to a build that can actually back up its", "start": 306.58, "duration": 4.879}, {"text": "intimidation attempts, a bill that even geese are afraid of, the Swan.", "start": 311.62, "duration": 4.13}, {"text": "Swans are basically everything scary about geese but shifted to Maximum Overdrive.", "start": 316.96, "duration": 3.8}, {"text": "Unlike geese, swans can dish out some serious damage, and on top of that, their aesthetics level is one of the highest in the game.", "start": 321.7, "duration": 6.38}, {"text": "But yeah. Swans and geese, both excellent builds.", "start": 328.54, "duration": 2.929}, {"text": "But in my opinion the Swan is the better choice because of their higher power and better aesthetics.", "start": 331.6, "duration": 4.009}, {"text": "Aesthetics is something that is difficult to master. Not only at animals, but also in web design.", "start": 336.22, "duration": 4.67}, {"text": "If you're looking to create a website,", "start": 341.47, "duration": 1.37}, {"text": "But don't know where to start, Squarespace has you covered. Whether you need a domain website or online store, make it with Squarespace.", "start": 342.84, "duration": 6.51}, {"text": "Squarespace enables you to create beautiful websites that can showcase your work,", "start": 350.95, "duration": 3.709}, {"text": "sell products and services of all kinds, promote your business, and much more.", "start": 355.03, "duration": 4.1}, {"text": "Whatever you want to make online, make it with Squarespace.", "start": 359.82, "duration": 2.32}, {"text": "Head to squarespace.com/tierzoo", "start": 362.7, "duration": 2.48}, {"text": "for a free trial, and when you're ready to launch, use the offer code TIERZOO to save 10% off your first", "start": 365.26, "duration": 5.02}, {"text": "purchase of a website or domain.", "start": 370.29, "duration": 2.0}, {"text": "Thanks again to Squarespace for sponsoring this video, as well as those of you who support me via patreon.", "start": 372.31, "duration": 4.61}, {"text": "Thanks again for watching, and good luck out there.", "start": 377.52, "duration": 2.0}, {"text": "*sick jazz my bois* (Subtitles by Zai's Meme Chamber/Zaiman12345)", "start": 379.64, "duration": 15.38}]