[{"text": "Back when I was still in university,", "start": 5.52, "duration": 1.319}, {"text": "I didn't have the money to live in downtown Toronto and close to the campus, so the only choice", "start": 6.839, "duration": 4.25}, {"text": "I had was to commute two hours from home to attend school,", "start": 11.09, "duration": 3.18}, {"text": "so almost every day for four years my commute consisted of:", "start": 14.37, "duration": 3.859}, {"text": "Walking to the bus stop from my house which took about 10 to 15 minutes,", "start": 18.6, "duration": 3.77}, {"text": "Riding the bus to square one mall, where I had to transfer to another bus that took me to the train station,", "start": 22.62, "duration": 5.119}, {"text": "Riding the train to union station in downtown Toronto, and then from there", "start": 27.9, "duration": 3.77}, {"text": "I could either spend three dollars to take the subway that stops pretty much at my campus or,", "start": 31.67, "duration": 4.23}, {"text": "Walk the rest which took about 25 minutes, but for a broke university student, you know you gonna walk.", "start": 36.32, "duration": 6.04}, {"text": "Viewer: DANG DOM!", "start": 42.36, "duration": 0.68}, {"text": "YOU MUST HAVE BEEN SO BORED DURING THE RIDE!", "start": 43.04, "duration": 2.42}, {"text": "Actually! I tried my best to be unconscious from most of the Commute, because being an", "start": 45.84, "duration": 4.02}, {"text": "Archi-TORTURE student who has to spend four hours of their day traveling you know I might be using that time to catch up on sleep!", "start": 49.86, "duration": 5.18}, {"text": "Which wasn't always the best thing to do since I ended up missing my stop a few times and having to walk back...", "start": 55.35, "duration": 5.6}, {"text": "Making me even more tired, and then by the time I get home I'd have no energy to finish my homework,", "start": 61.16, "duration": 4.96}, {"text": "So then I pass out and wake up with the sun shining rays of disappointment at my face.", "start": 66.12, "duration": 5.58}, {"text": "There was one time when I had to take the Go train in the morning to catch an 8 a.m. class,", "start": 71.7, "duration": 4.16}, {"text": "Huh, I slept at like 3 a.m. the night or morning of because of a project,", "start": 76.16, "duration": 6.04}, {"text": "So I was pretty dead and wanted to savor all the sleep I can get on the 30-minute ride.", "start": 82.22, "duration": 4.36}, {"text": "Now union station is the supposed last stop on the route, okay? So one of three things happened upon arriving:", "start": 86.7, "duration": 7.88}, {"text": "One, I wake up by the time or before we arrive! Cool!", "start": 94.77, "duration": 3.709}, {"text": "Two, the strangers around me are willing to wake me up knowing I probably don't want to stay in the train and", "start": 99.02, "duration": 5.84}, {"text": "Probably have somewhere to be! Cool! And then what happened that day,", "start": 104.88, "duration": 4.72}, {"text": "Number Three!", "start": 109.68, "duration": 1.319}, {"text": "No one wakes me up. I remain unconscious...", "start": 111.0, "duration": 2.78}, {"text": "Uncool! (Damn Straight)", "start": 114.14, "duration": 1.2}, {"text": "Obviously, not their fault you know that's", "start": 115.349, "duration": 2.12}, {"text": "That's just need failing at life... I don't know how long I was out", "start": 118.4, "duration": 4.18}, {"text": "Out? Ouuut?", "start": 123.32, "duration": 2.0}, {"text": "No, no, we don't say OOT", "start": 125.54, "duration": 2.0}, {"text": "OUT", "start": 127.98, "duration": 0.5}, {"text": "I'm saying it right! Out!", "start": 128.96, "duration": 2.36}, {"text": "Yeah Out... But by the time I woke up the train was moving again. Not back in the direction where I live,", "start": 131.66, "duration": 6.08}, {"text": "But past union station towards through who knows where! So I panicked... (Good Meme)", "start": 137.75, "duration": 4.559}, {"text": "I didn't know what to do, there was no one around me,", "start": 142.7, "duration": 2.52}, {"text": "I wasn't in immediate danger, but I needed to get the hell out of there,", "start": 145.22, "duration": 3.479}, {"text": "So I hit the emergency button, train stops, doors open, and a worker who runs to my cart, \"Whoa! Whoa!", "start": 148.7, "duration": 6.479}, {"text": "what, what, what, happened?\"", "start": 155.18, "duration": 2.0}, {"text": "(Fart noise) Uh... I-I uh fell asleep... (Rip Domics)", "start": 158.46, "duration": 2.7}, {"text": "Get out of here!", "start": 162.66, "duration": 1.42}, {"text": "Okay sorry...", "start": 164.08, "duration": 0.82}, {"text": "Commuting Via public transit can be", "start": 164.91, "duration": 1.83}, {"text": "inconvenient", "start": 166.74, "duration": 0.6}, {"text": "Enough as it is, but it doesn't help when bus drivers can be so savage and just not give a F*** if you don't make it", "start": 167.34, "duration": 5.69}, {"text": "On time! Like okay, I get it,", "start": 173.03, "duration": 2.339}, {"text": "They gotta stick to a schedule they they have guidelines to follow yeah,", "start": 175.37, "duration": 3.6}, {"text": "But if the schedule says that the bus is arriving at 1:40 p.m., I'd say", "start": 179.01, "duration": 4.46}, {"text": "It's safe to assume a five minute window before and after for the bus to arrive giving good weather and accounting for some traffic,", "start": 183.47, "duration": 6.71}, {"text": "But if I'm walking towards my bus stop, okay, like I see it in the distance", "start": 190.7, "duration": 4.08}, {"text": "And I see that a bus is already there at 1:30 p.m.. I shouldn't be going... \"Eh, Is that my bus?", "start": 194.84, "duration": 8.28}, {"text": "please let that not be my bus. That's gotta be like the 1:20 bus running late, right?", "start": 203.36, "duration": 5.12}, {"text": "okay, that that's probably my bus", "start": 209.52, "duration": 2.0}, {"text": "Is it worth sprinting for?", "start": 212.37, "duration": 2.0}, {"text": "All right, we running boys! And there it goes!", "start": 215.88, "duration": 2.72}, {"text": "MOTHERFU**A!, and then I'm forced to wait for the next one which is sometimes only another 10 to 15 minutes and sometimes another 10 to", "start": 219.66, "duration": 7.16}, {"text": "15 centuries. I mentioned good weather as a contributing factor earlier", "start": 226.82, "duration": 4.4}, {"text": "I live in the Toronto area where our winters can really be problematic for the roads... One time!", "start": 231.78, "duration": 5.0}, {"text": "I had to wait for the go bus at the station because trains only run during rush hours and", "start": 236.78, "duration": 4.679}, {"text": "That particular day was like a day or two after a blizzard so roads were pretty bad", "start": 241.68, "duration": 5.66}, {"text": "But I still had to get to school! Because you can't be a little BITCH! And skip class one each semester cost like Eight Grand!", "start": 247.34, "duration": 7.02}, {"text": "So I'm at my stop waiting in the shed, negative 15 degrees Celsius outside..", "start": 254.84, "duration": 3.78}, {"text": "Bus is supposed to come at 11:05 a.m.. It was 11:10 AM", "start": 259.29, "duration": 4.279}, {"text": "All right, yeah, it's cool. Roads are pretty bad I get it", "start": 264.08, "duration": 3.58}, {"text": "11:25 AM", "start": 268.28, "duration": 1.32}, {"text": "Okay, oh, yeah, okay? Yeah. Yeah, there was probably some sort of accident on the road. Yeah...", "start": 269.61, "duration": 5.06}, {"text": "But the bus should still be on its way", "start": 274.67, "duration": 1.99}, {"text": "11:40 AM can't feel my toes. Maybe I should have worn thicker socks", "start": 277.66, "duration": 4.08}, {"text": "11:55 AM, I regret my life choices. I probably should have stayed home today", "start": 282.94, "duration": 4.92}, {"text": "12:10 PM", "start": 288.74, "duration": 1.02}, {"text": "Bus still hasn't arrived by that time enough people have gathered and we're probably worth", "start": 289.77, "duration": 4.88}, {"text": "Maybe like four or five cycles worth of people... I overheard others discussing", "start": 294.65, "duration": 4.95}, {"text": "What was wrong some called the helpline and reported that there were some major issues with buses breaking down and whatnot and that they will", "start": 299.6, "duration": 6.869}, {"text": "Be sending other buses ASAP, but could take another 20 to 30 minutes", "start": 306.47, "duration": 4.11}, {"text": "Alright! Time to weed out the weak from the rest of the herd! Let's wait it out! at this point", "start": 311.52, "duration": 5.149}, {"text": "I was way past late for my class anyway, but I had too much pride to give up so I sucked it up", "start": 316.669, "duration": 4.77}, {"text": "We're already committed let's go. I lost a sense of feel in most of my body anyway. What's 30 more minutes?", "start": 321.56, "duration": 6.5}, {"text": "12:25 PM The bus turns into the station. There's maybe 200 of us waiting the bus is pulling up! And...", "start": 328.44, "duration": 9.06}, {"text": "It stops at the back of the line...", "start": 337.5, "duration": 2.0}, {"text": "Why would you do that?? There was a moment of hesitation when we the people at the front of line were like...", "start": 339.9, "duration": 6.38}, {"text": "\"No way that this bus driver. Is that dumb...", "start": 347.4, "duration": 2.869}, {"text": "right?\" And then he opened the doors...", "start": 351.12, "duration": 3.559}, {"text": "I pretty much got trampled, because everyone rushed to the back to get on the bus", "start": 355.7, "duration": 3.92}, {"text": "I was honestly too tired to even fight for it", "start": 360.08, "duration": 2.52}, {"text": "I mean after the cluster F*** of people managed to fit in the bus the driver told the rest of us that more are coming in", "start": 362.6, "duration": 5.879}, {"text": "Like five minutes so okay. Yeah, I guess it wasn't too bad...", "start": 368.48, "duration": 3.62}, {"text": "Except the next bus did the same damn thing", "start": 373.12, "duration": 4.14}, {"text": "Oh! Baby!", "start": 380.74, "duration": 1.02}, {"text": "What have we got here? Hey? That looks like a loot crate box. That's exactly what it is!", "start": 382.08, "duration": 6.36}, {"text": "But what is it? What, what?", "start": 389.14, "duration": 3.52}, {"text": "What do you mean you you just called it, a lo- you knew what it would what?", "start": 393.28, "duration": 4.94}, {"text": "Alright! You obviously don't know how to do this so let me just take over, okay? Alright? Alright!", "start": 398.74, "duration": 5.98}, {"text": "Loot crate is a monthly subscription box service that contains a bunch of exciting Geek, Gamer and Pop-Culture items! (Tell them how much it is!)", "start": 405.12, "duration": 8.06}, {"text": "Yo chill that I'll get to that... Less than $20! (In the USA...)", "start": 413.22, "duration": 4.64}, {"text": "Yeah, what he said meaning each month you get six to eight items ranging from licensed gear apparel to other collectible items that are", "start": 418.42, "duration": 7.46}, {"text": "Worth over $50 in retail value. When's the cutoff? You have until the 19th of any months at 9:00 p.m. PST", "start": 425.88, "duration": 7.54}, {"text": "To subscribe and receive that month's crate, and then it'll be automatic after that", "start": 433.42, "duration": 4.18}, {"text": "But what if I wait until after 9 PM? Then you lost your chance on that crate forever...!", "start": 437.76, "duration": 5.88}, {"text": "But you can always look forward to the next month", "start": 444.22, "duration": 2.2}, {"text": "There's always at least one thing that will interest you", "start": 446.43, "duration": 2.13}, {"text": "So sign up at Lootcrate.com/Domics and enter the code DOMICS to save 10% on any new subscription", "start": 448.96, "duration": 6.38}, {"text": "How do they know what they're gonna get though?", "start": 455.38, "duration": 2.239}, {"text": "Well you see each month has its own theme this month being Dystopia", "start": 458.14, "duration": 4.399}, {"text": "Contains items such as the aerodyne police car and police badge from Blade Runner a fallout 4 Headset and a mirror's Edge wristwatch", "start": 462.73, "duration": 7.069}, {"text": "Wow! Someone give that one bus driver one of these because he sure as hell didn't come to my stop on time! (You right)", "start": 470.2, "duration": 5.509}, {"text": "But hey! If you miss out on this box you can look forward to the next box of which the theme is Futuristic", "start": 476.2, "duration": 5.119}, {"text": "You can expect things from Star Trek Futurama, Megaman", "start": 481.6, "duration": 3.559}, {"text": "And Rick and Morty! As seriously I need season 3 of Rick and Morty soon... (Already out! Why are you watching this? GO WATCH IT)", "start": 485.16, "duration": 5.68}, {"text": "Please... And if none of these interests you loot crate also offers other genres such as Gaming, Pets and Anime!", "start": 491.08, "duration": 7.48}, {"text": "Once again, that's Lootcrate.com/Domics with the code DOMICS to save 10% on you subscriptions!", "start": 499.21, "duration": 5.93}, {"text": "Enjoy!", "start": 505.84, "duration": 2.0}, {"text": "(Go watch Rick and Morty now, it's funny)", "start": 517.329, "duration": 2.0}]