[{"text": "I was invited here, to Munich, by BMW the sponsor of this video", "start": 0.03, "duration": 4.81}, {"text": "to find out why the future of cars is electric.", "start": 4.84, "duration": 3.36}, {"text": "But electric cars are actually nothing new -- they date back to 1832,", "start": 8.8, "duration": 5.08}, {"text": "well before the first gasoline-powered car.", "start": 13.88, "duration": 3.28}, {"text": "In fact, the first car to go faster than a hundred kilometers per hour", "start": 17.16, "duration": 3.8}, {"text": "was in 1899, an electric one,", "start": 20.96, "duration": 3.12}, {"text": "called the Jamais Contente, meaning \"never satisfied\".", "start": 24.08, "duration": 4.24}, {"text": "But people were apparently satisfied with electric cars.", "start": 28.32, "duration": 4.32}, {"text": "By 1910, they were almost twice as common on American roads as internal combustion engines.", "start": 32.64, "duration": 5.6}, {"text": "But then came the Model T, which at $650 was significantly cheaper than comparable electric cars", "start": 38.24, "duration": 6.96}, {"text": "and as gas stations popped up around the country, they could be quickly refueled,", "start": 45.2, "duration": 4.88}, {"text": "allowing you to travel farther, faster, and cheaper than electric cars, which took a long time to recharge.", "start": 50.08, "duration": 6.96}, {"text": "So by 1935, the electric vehicle had been commercially obliterated.", "start": 57.04, "duration": 5.44}, {"text": "But electric cars were still useful for some things:", "start": 63.0, "duration": 3.4}, {"text": "in the vacuum of space, an electric vehicle was the obvious choice for the Apollo lunar roving vehicle.", "start": 66.4, "duration": 5.72}, {"text": "It was a single-use vehicle due to its non rechargeable silver zinc potassium hydroxide battery,", "start": 72.12, "duration": 6.96}, {"text": "and it had a range of just 92 kilometers.", "start": 79.08, "duration": 3.48}, {"text": "But the astronauts never needed even half of this range.", "start": 82.56, "duration": 4.36}, {"text": "At the Munich Olympics in 1972, to lead marathon runners in their race,", "start": 87.84, "duration": 5.08}, {"text": "BMW created an electric version of its two series car.", "start": 92.92, "duration": 3.84}, {"text": "The car ran on 12 large car batteries for a maximum range of 60 kilometers, or 37 miles.", "start": 96.76, "duration": 7.08}, {"text": "This demonstrated the benefits of electric vehicles: they can run quietly with no emissions.", "start": 103.84, "duration": 6.04}, {"text": "But it also illustrated their limitations: with the battery technology available at the time,", "start": 109.88, "duration": 6.0}, {"text": "electric cars were expensive and short-range, impractical for everyday use.", "start": 115.88, "duration": 5.32}, {"text": "So why are electric cars the future?", "start": 122.68, "duration": 3.16}, {"text": "In 2020, BMW is launching the IX3 all-electric sport utility vehicle,", "start": 125.84, "duration": 5.44}, {"text": "and they plan to have 25 electrified vehicles in their fleet by 2023.", "start": 131.28, "duration": 4.92}, {"text": "A lot of their concept cars, like the Vision M Next, are electric vehicles", "start": 136.2, "duration": 4.76}, {"text": "and they have a Formula-E car which can now run a whole race on a single battery pack.", "start": 140.96, "duration": 5.32}, {"text": "This is all made possible by developments in battery technology.", "start": 148.04, "duration": 4.0}, {"text": "Batteries have gotten a lot better,", "start": 152.04, "duration": 2.48}, {"text": "particularly with the introduction of lithium ion batteries.", "start": 154.52, "duration": 3.2}, {"text": "First used in mobile phones about 30 years ago,", "start": 157.72, "duration": 3.24}, {"text": "lithium ion batteries have almost two times more energy in the same volume", "start": 160.96, "duration": 4.24}, {"text": "than the next-best battery chemistry.", "start": 165.2, "duration": 2.36}, {"text": "Because of their use in many consumer products like phones and laptops,", "start": 167.56, "duration": 3.8}, {"text": "their manufacturing costs continue to decline,", "start": 171.36, "duration": 2.96}, {"text": "driven by manufacturing and supply chain optimization.", "start": 174.32, "duration": 3.4}, {"text": "Over the last three decades, the energy density has increased both per unit mass and per unit volume,", "start": 177.72, "duration": 7.04}, {"text": "while the price has plummeted.", "start": 184.76, "duration": 2.08}, {"text": "This is unlike internal combustion engines which, after a century of development,", "start": 186.84, "duration": 4.6}, {"text": "have few areas left for improvement.", "start": 191.44, "duration": 2.44}, {"text": "And the reality is, you don't really travel that far in a car.", "start": 195.24, "duration": 3.96}, {"text": "The batteries available today are good enough for all but the longest road trips.", "start": 199.2, "duration": 4.52}, {"text": "In the US, 99% of trips are under 160 kilometers, or 100 miles.", "start": 203.72, "duration": 6.4}, {"text": "And electric cars are just better vehicles.", "start": 212.88, "duration": 2.96}, {"text": "Here are my top 10 reasons why:", "start": 215.84, "duration": 2.2}, {"text": "First: more torque from a standstill.", "start": 218.04, "duration": 4.64}, {"text": "2. Thanks to the batteries under the floor, they have a low center of mass and so better handling.", "start": 222.68, "duration": 4.96}, {"text": "3. Since you can drive electric motors independently,", "start": 227.64, "duration": 3.08}, {"text": "you can have precise control over each wheel for maximum traction.", "start": 230.72, "duration": 4.04}, {"text": "4. Electric cars are quieter.", "start": 235.8, "duration": 2.04}, {"text": "5. Electric cars are cheaper to run than gas cars,", "start": 240.12, "duration": 2.56}, {"text": "because gas is more expensive than electricity for the same distance traveled.", "start": 242.68, "duration": 4.48}, {"text": "6. Electric cars are more efficient than gas cars,", "start": 247.16, "duration": 3.2}, {"text": "both in converting stored energy into energy of motion and in regenerating some of that energy when braking.", "start": 250.36, "duration": 6.48}, {"text": "7. You never have to visit a gas station, because you can recharge at home.", "start": 258.52, "duration": 4.24}, {"text": "8. There's less maintenance: fewer moving parts, no oil changes,", "start": 264.0, "duration": 4.2}, {"text": "and the brakes wear out less often thanks to regenerative braking.", "start": 268.2, "duration": 3.52}, {"text": "9. And depending on the source of electricity, in my case, solar panels,", "start": 271.72, "duration": 3.8}, {"text": "electric cars don't produce any CO2 at all, so they don't contribute to climate change.", "start": 275.52, "duration": 4.24}, {"text": "Plus, as cars become essentially computers on wheels,", "start": 279.76, "duration": 4.56}, {"text": "electric vehicles are leading the way towards self-driving cars.", "start": 284.32, "duration": 3.68}, {"text": "Alright we're gonna start our ride in an autonomous vehicle, my first time ever:", "start": 288.0, "duration": 4.04}, {"text": "Level 4 autonomy.", "start": 292.04, "duration": 1.92}, {"text": "Once this becomes commonplace, it's likely we'll change how we see cars:", "start": 293.96, "duration": 4.36}, {"text": "from something we own that sits idle for most of its existence,", "start": 298.32, "duration": 4.12}, {"text": "to transportation as a service,", "start": 302.44, "duration": 2.32}, {"text": "something we ride in to get from point A to point B,", "start": 304.76, "duration": 2.84}, {"text": "and something we share with others.", "start": 307.6, "duration": 2.16}, {"text": "There are still a lot of details to work out,", "start": 311.08, "duration": 2.96}, {"text": "but it's clear to me that the future of cars is electric, autonomous, and shared.", "start": 314.04, "duration": 5.52}]