[{"text": "It's Memorial Day, which isn't simply just an excuse to have a longer weekend,", "start": 11.5, "duration": 4.639}, {"text": "it's officially the federal holiday to pay respect to those who died and all the wars", "start": 16.139, "duration": 4.74}, {"text": "the United States has fought in. You know, World War II, Vietnam, the Civil War, the Quasi-War, the Cherokee Wars, the Boxer Rebellion...", "start": 20.88, "duration": 10.72}, {"text": "Huh.", "start": 34.51, "duration": 1.38}, {"text": "What Americans think about the wars their own country has fought in, they often think of just the big ones.", "start": 35.89, "duration": 4.969}, {"text": "World War I, Korean War, Iraq War. But ever since the U.S. was just thirteen little states,", "start": 41.17, "duration": 5.72}, {"text": "it's been involved in numerous brief wars, both local and abroad. And a surprising number of them have kind of just been..", "start": 46.89, "duration": 7.319}, {"text": "forgotten about.", "start": 54.519, "duration": 1.321}, {"text": "So I want to talk about some of the wars we aren't taught about in history class. Is this alternate history? No.", "start": 55.84, "duration": 6.14}, {"text": "No, it is not. The real video I planned about Canada didn't seem too smart to release on Memorial Day weekend.", "start": 62.5, "duration": 6.12}, {"text": "Call it bad planning. I don't care.", "start": 68.82, "duration": 2.34}, {"text": "Intervention in North Africa is a touchy subject for Americans today.", "start": 78.07, "duration": 3.56}, {"text": "It seems like for the last few decades we've done nothing but focus on North Africa in the Middle East.", "start": 81.63, "duration": 5.789}, {"text": "So when was the first time we had a conflict in the region? How about 1801?", "start": 87.42, "duration": 5.46}, {"text": "Yeah,", "start": 93.25, "duration": 0.5}, {"text": "when the U.S. was still a young nation and Thomas Jefferson was it's president,", "start": 93.75, "duration": 4.41}, {"text": "America fought a four-year-long war against pirates off the coast of North Africa.", "start": 98.65, "duration": 5.659}, {"text": "These were called the Barbary Wars, and yes, there were two of them.", "start": 104.5, "duration": 4.2}, {"text": "At the time, Muslim piracy was a major issue.", "start": 108.7, "duration": 3.529}, {"text": "The coastline of North Africa was made up of a series of pirate states on what was called the Barbary Coast.", "start": 112.39, "duration": 7.22}, {"text": "They included regions like Morocco, Ottoman-controlled Algiers, and even Tripoli.", "start": 119.89, "duration": 6.61}, {"text": "The main thing that united them was they really liked to raid incoming ships.", "start": 126.5, "duration": 5.209}, {"text": "European and now American ships that would cross into the area would often be attacked and had a ransom. Not be paid, it's sailors would be sold into slavery.", "start": 131.709, "duration": 10.091}, {"text": "This was actually a crisis at the time. It became a debate whether or not to pay off the pirates, or to fight them.", "start": 141.84, "duration": 7.28}, {"text": "Jefferson reasoned that paying off the ransoms only would encourage more piracy.", "start": 149.66, "duration": 5.94}, {"text": "When Jefferson became President, the pirate states tried to force another ransom, but Jefferson didn't comply.", "start": 155.74, "duration": 5.86}, {"text": "In response, Tripoli declared war on the U.S., and eventually all the Barbary States began raiding American ships.", "start": 161.84, "duration": 6.3}, {"text": "We today debate about how the President can use the military without an official declaration of war.", "start": 168.18, "duration": 7.46}, {"text": "Well, this conversation kinda began here. Congress concluded that Jefferson had the powers as commander-in-chief to stop the pirates, protect Americans, and destroy Barbary vessels.", "start": 175.64, "duration": 10.9}, {"text": "Effectively, this was the 19th century version of intervening against terrorists without a declaration of war.", "start": 186.66, "duration": 6.2}, {"text": "Battles were few in the period of four years.", "start": 193.24, "duration": 2.54}, {"text": "It was really just a naval blockade of North African cities, with the occasional raid.", "start": 195.78, "duration": 5.1}, {"text": "There was one time the Americans took the city of Derna, and raised the Stars and Stripes over foreign land.", "start": 200.98, "duration": 6.44}, {"text": "After four years of this war, Tripoli surrendered and a peace deal was made between the U.S. and the Barbary Coast.", "start": 207.72, "duration": 6.78}, {"text": "Piracy remained an issue for decades in the region, leading to another Barbary War in 1815.", "start": 214.5, "duration": 5.56}, {"text": "Once European naval technology became far more advanced than the pirates,", "start": 220.06, "duration": 4.98}, {"text": "Muslim piracy died in the region altogether.", "start": 225.4, "duration": 2.68}, {"text": "Leaving behind the strange tale of when Jefferson sent the Navy to fight against North African pirates for four years.", "start": 228.08, "duration": 8.34}, {"text": "What Americans learn about the relationship between", "start": 243.1, "duration": 2.06}, {"text": "Americans and the natives, well, they don't really learn about it.", "start": 245.69, "duration": 3.86}, {"text": "We talk about the Pilgrims and natives, then skip over to cowboys and Indians in the West.", "start": 249.55, "duration": 5.13}, {"text": "So really most Americans only learn about the beginning and the end. We don't teach about the couple centuries of constant, and I do mean constant, conflict.", "start": 254.92, "duration": 9.92}, {"text": "The United States spreading across the continent wasn't just people in wagons moving and taking empty land. It often involved American soldiers fighting against a guerrilla-style native resistance.", "start": 264.84, "duration": 13.1}, {"text": "Florida once used to be Spanish land, and in that Spanish land, there was a native population mostly called the Seminole.", "start": 278.06, "duration": 7.14}, {"text": "They lived there and formed an active military resistance to the United States.", "start": 285.2, "duration": 4.44}, {"text": "After the Seminole massacred nearby American settlers,", "start": 289.64, "duration": 3.2}, {"text": "the United States wanted retribution, and so the military was called in.", "start": 292.84, "duration": 4.54}, {"text": "The problem was, Spain actually hadn't given Florida to the United States yet, but that didn't matter.", "start": 297.38, "duration": 6.08}, {"text": "Andrew Jackson, a general at the time, gathered a force of 3,000 Americans and 1,400 Creeks to break the Seminole resistance.", "start": 303.46, "duration": 8.24}, {"text": "Yes,", "start": 311.76, "duration": 0.44}, {"text": "this meant that the Americans had to invade Florida.", "start": 312.2, "duration": 4.46}, {"text": "The invasion mostly consisted of village burnings and leaders being hanged. The atrocities were condemned,", "start": 316.66, "duration": 5.58}, {"text": "but it's Jackson. He didn't care.", "start": 322.24, "duration": 2.55}, {"text": "There was a period of peace, Florida became a state, but the Seminole were still a problem to the U.S.", "start": 324.95, "duration": 5.479}, {"text": "Well when Jackson became President, they weren't an issue anymore. The U.S created the Indian Removal Act,", "start": 330.56, "duration": 6.12}, {"text": "which meant all the natives east of the Mississippi had to get out of there.", "start": 336.68, "duration": 5.16}, {"text": "The Seminole understandably didn't like this, and the Americans knew it. And eventually, war did come. This war lasted...", "start": 341.84, "duration": 7.48}, {"text": "wait...", "start": 350.18, "duration": 1.23}, {"text": "Six years?", "start": 351.41, "duration": 1.62}, {"text": "Wow. Yeah,", "start": 353.03, "duration": 1.56}, {"text": "this conflict against natives lasted longer than the U.S. was in World War II.", "start": 354.59, "duration": 4.73}, {"text": "The Americans could do little against a group which knew their land.", "start": 359.57, "duration": 3.109}, {"text": "Seminoles would routinely kill American settlers, and Americans would routinely torch Seminole villages, but still,", "start": 363.2, "duration": 6.44}, {"text": "even after years, the Americans would be stuck in that swamp.", "start": 369.82, "duration": 3.88}, {"text": "Sometimes for so long, they had to resort to eating their horses.", "start": 373.7, "duration": 3.94}, {"text": "To be honest, this war is so interesting, it requires its own video.", "start": 377.64, "duration": 4.76}, {"text": "In fact, most native wars in the East do. But to cut it short,", "start": 382.43, "duration": 4.019}, {"text": "eventually after years of whittling down native resistance, the U.S. was able to drive the Seminole to a reservation in South Florida.", "start": 386.82, "duration": 6.8}, {"text": "I feel the war was just so brutal, and in such a regretful time in American history,", "start": 393.92, "duration": 5.91}, {"text": "it's mostly just been swept under the rug, at least in the states that aren't Florida.", "start": 400.32, "duration": 5.029}, {"text": "History sure is great at perspective.", "start": 413.86, "duration": 1.84}, {"text": "There was a time that Mexico truly was sending their worst, and the border was legitimately so dangerous, the United States had to fight a war to keep the violence out.", "start": 415.75, "duration": 10.81}, {"text": "This was a conflict that raged from 1910 to 1919, simply known as the Border War.", "start": 426.58, "duration": 8.16}, {"text": "In 1910, Mexico pretty much collapsed and was in complete anarchic chaos.", "start": 434.74, "duration": 3.92}, {"text": "Not even today's violence could come close to how bad it was.", "start": 439.08, "duration": 5.38}, {"text": "This was called the Mexican Revolution.", "start": 444.46, "duration": 2.18}, {"text": "Which is way too complicated to get into right now.", "start": 446.68, "duration": 2.34}, {"text": "Long story short, imagine a far worse Syrian Civil War on America's border.", "start": 449.56, "duration": 6.17}, {"text": "It lasted ten years, and two million Mexicans died.", "start": 455.77, "duration": 3.829}, {"text": "The war was just complicated and confusing,", "start": 459.88, "duration": 2.72}, {"text": "and the United States hated everybody involved, so they decided to just secure the border and fight anybody who tried to cross it.", "start": 462.6, "duration": 7.1}, {"text": "At some points, revolutionaries would just attack American towns, and battles would rage to stop the Mexican rebels from seizing it.", "start": 469.84, "duration": 7.369}, {"text": "Sometimes federal Mexicans try to attack in gangs, and Germans... (wut)", "start": 477.66, "duration": 5.72}, {"text": "Like I said,", "start": 483.7, "duration": 0.95}, {"text": "it was a confusing time.", "start": 484.65, "duration": 2.17}, {"text": "In this time period, the United States basically just waited for Mexico to get it together.", "start": 486.82, "duration": 4.2}, {"text": "To stop people from attacking inside, and the Americans invaded Mexican territory at times too. This was a back-and-forth", "start": 491.02, "duration": 6.92}, {"text": "that continued until the Mexican Revolution ended by 1919. Was that the most interesting conflict?", "start": 498.22, "duration": 6.02}, {"text": "No, but it's a little bit of context when we imagine how bad Mexico is today, and how bad border violence could be.", "start": 504.46, "duration": 7.309}, {"text": "History teaches us that it could always be...", "start": 512.38, "duration": 2.0}, {"text": "...far worse.", "start": 514.81, "duration": 2.0}, {"text": "For the last few months, everyone has feared that we would fight with North Korea for the first time in 70 years.", "start": 522.43, "duration": 5.96}, {"text": "But that's not true, because we actually fought against North Korea far sooner than that.", "start": 528.82, "duration": 5.15}, {"text": "There was a time in the 1960s that America and South Korea fought against the North.", "start": 534.1, "duration": 5.809}, {"text": "For three years.", "start": 540.58, "duration": 1.759}, {"text": "There was just a tiny conflict against the North in the 60s that never", "start": 542.339, "duration": 3.69}, {"text": "escalated into anything bigger. And when I mean tiny,", "start": 546.279, "duration": 2.96}, {"text": "I mean 400 North Koreans died, 300 South Koreans, and 40 Americans.", "start": 549.24, "duration": 5.24}, {"text": "The South tried to infiltrate the North and failed. The North tried to assassinate the South Korean leader,", "start": 554.48, "duration": 5.46}, {"text": "it was just a strange time. The North didn't have nukes, and the South was still a backwater,", "start": 560.019, "duration": 5.239}, {"text": "America was too busy with Vietnam,", "start": 565.899, "duration": 1.92}, {"text": "so after three years of not wanting to escalate the fighting, it just stopped.", "start": 567.819, "duration": 5.239}, {"text": "It was soon just called the Korean DMZ Conflict, and everybody just forgot that it ever happened.", "start": 573.24, "duration": 5.849}, {"text": "The lesson here is you can always stop the war from escalating, if you're already fighting a bigger one.", "start": 579.309, "duration": 5.12}, {"text": "So in conclusion Jimmy, why did I make this video? I don't really know. It's Memorial Day!", "start": 584.459, "duration": 5.789}, {"text": "It's interesting to remember the less popular wars out there as well.", "start": 590.249, "duration": 3.3}, {"text": "If there is one fight that people have recently began talking about, it's the fight for", "start": 601.209, "duration": 5.119}, {"text": "Information privacy, and that's why this video was sponsored by Nord VPN. Yeah, that's the best segue I could come up with.", "start": 606.579, "duration": 6.2}, {"text": "Oh well.", "start": 612.779, "duration": 0.631}, {"text": "A VPN is a virtual private network. By accessing a private network with military-grade encryption,", "start": 613.41, "duration": 6.539}, {"text": "you can protect yourself. If recent events have shown anything, it's that protecting your privacy and information online is", "start": 620.11, "duration": 7.309}, {"text": "extremely important. As a content creator on the Internet, It's something that I keep in mind everyday.", "start": 628.12, "duration": 5.119}, {"text": "Basically what NordVPN does, is it secures your information whenever you go online.", "start": 633.55, "duration": 5.329}, {"text": "Protects your IP address and gives you that peace of mind in an age where information protection is", "start": 639.36, "duration": 5.26}, {"text": "everything, with all the news that Facebook has been extensively sharing user info, and", "start": 644.78, "duration": 5.2}, {"text": "foreign hackers and Russia and China, now is the smartest time to get a resource that can help you protect yourself, and your", "start": 650.16, "duration": 6.28}, {"text": "information. They have thousands of servers from 60 countries that you can access, and with a simple interface,", "start": 656.54, "duration": 6.64}, {"text": "it's easy to set up. Say I want to have a new address from Britain. Well, I can do that. Or say India or China.", "start": 663.4, "duration": 7.92}, {"text": "NordVPN allows you to do that, and it works on any iOS or Android phones and Windows or Mac for computer.", "start": 671.58, "duration": 7.28}, {"text": "So if you want to just try it out, you can try it for 30 days,", "start": 678.87, "duration": 3.899}, {"text": "absolutely free.", "start": 683.08, "duration": 0.92}, {"text": "Start protecting your internet experience today with", "start": 684.0, "duration": 3.42}, {"text": "77% off a three-year plan by using the code, Althist", "start": 687.79, "duration": 4.28}, {"text": "at nordvpn.com/althist", "start": 692.4, "duration": 3.76}, {"text": "I never considered using something like this until recent events, and so I recommend if you want to stay safe online,", "start": 696.16, "duration": 6.54}, {"text": "this is a good option to go. This is Cody of AlternateHistoryHub.", "start": 703.12, "duration": 4.489}]