[{"text": "Here's a question for aspiring screenwriters:", "start": 0.7, "duration": 3.06}, {"text": "Is it possible to make the movie \"Passengers\" better with some relatively minor changes?", "start": 3.8, "duration": 6.2}, {"text": "You know, I don't think this is a really bad film.", "start": 10.3, "duration": 2.22}, {"text": "After hearing reviews from friends and online, I sort of expected it to be.", "start": 12.56, "duration": 3.86}, {"text": "But I think that feeling was mostly disappointed expectation. Passengers is by no means a train wreck.", "start": 16.52, "duration": 5.38}, {"text": "It's just really, really predictable. The plot goes like this:", "start": 22.1, "duration": 4.18}, {"text": "After the interstellar spaceship, Avalon, malfunctions, Chris Pratt wakes up from hyper sleep ninety years before he's supposed to.", "start": 26.28, "duration": 5.96}, {"text": "Ninety years before anyone else on the ship.", "start": 32.32, "duration": 2.48}, {"text": "He can't go back to sleep. He can't contact earth. He can't get to the ship's controls.", "start": 34.92, "duration": 3.6}, {"text": "He tries to do all of these things and fails.", "start": 38.52, "duration": 2.8}, {"text": "As a year passes, he grows increasingly sad and hopeless.", "start": 41.4, "duration": 3.56}, {"text": "So eventually he decides to wake up another passenger, Jennifer Lawrence, condemning her to the same fate, essentially death.", "start": 44.96, "duration": 6.22}, {"text": "In order to give himself some more company. He acts like it's another malfunction.", "start": 51.18, "duration": 3.96}, {"text": "He doesn't tell her. After a while, they fall in love.", "start": 55.22, "duration": 2.88}, {"text": "She finds out the truth, gets really mad, and then the ship begins to really malfunction.", "start": 58.1, "duration": 5.5}, {"text": "So Pratt sacrifices himself to save it, but in the end, she saves him.", "start": 63.68, "duration": 4.02}, {"text": "They fall in love again, and spend the rest of their lives alone on the ship, happily ever after.", "start": 67.7, "duration": 5.04}, {"text": "Oh and Laurence Fishburne's in it, too.", "start": 72.82, "duration": 2.12}, {"text": "\"How long have I got?\"\nAbout twelve or thirteen minutes in, Act III.", "start": 74.94, "duration": 3.64}, {"text": "But, you know, count your blessings, it's way better than what oscar-nominated actor Andy Garcia got.", "start": 78.58, "duration": 4.26}, {"text": "*audience disappointment* \nSo you can break this plot up into five basic turning points:", "start": 82.92, "duration": 3.64}, {"text": "1. Chris wakes up.\n2. Chris wakes Jennifer up.", "start": 86.56, "duration": 2.96}, {"text": "3. She finds out.\n4. Chris sacrifices himself.", "start": 89.52, "duration": 4.1}, {"text": "5. She forgives him. \nThe most acute tension in the film happens between parts 2 and 3.", "start": 93.62, "duration": 5.38}, {"text": "When Jennifer starts to fall in love with Chris, but doesn't yet know the truth.", "start": 99.04, "duration": 3.26}, {"text": "We know the truth is coming; there's a little dramatic irony there.", "start": 102.42, "duration": 2.78}, {"text": "And so we wait with increasing anxiety until it does. And when it does, predictably, Jennifer freaks out, predictably, and we feel a little sadness. Predictably.", "start": 105.24, "duration": 9.12}, {"text": "At this point, exactly an hour into the movie, the script has sort of written itself into a corner.", "start": 114.36, "duration": 5.28}, {"text": "Because Pratt is the real main character, because we spend 30 minutes alone with him at the start of the film and see everything through his eyes,", "start": 119.7, "duration": 6.64}, {"text": "There's really only two paths to take regarding the central relationship.", "start": 126.46, "duration": 4.64}, {"text": "Either he dies, or she forgives him. In both ways he finds absolution for the sin he committed.", "start": 131.12, "duration": 5.92}, {"text": "Because you're not going to be able to turn him bad, not a character like this.", "start": 137.32, "duration": 3.9}, {"text": "Not unless you have five seasons to do it.", "start": 141.28, "duration": 2.92}, {"text": "And yes, I know there are some allusions to \"The Shining\" here, but \"The Shining\" spent pretty much no time at all endearing us", "start": 144.32, "duration": 5.34}, {"text": "to the character of Jack Torrance. Passengers spends the whole first act endearing us to the lovable, scrappy Chris Pratt.", "start": 149.66, "duration": 6.26}, {"text": "It's clear the creators, or the studio, were intent on this being a love story, so they chose to go with the schmaltzy ending.", "start": 155.92, "duration": 6.12}, {"text": "But they could have chosen either. The last 45 minutes would have been the same; a movie pretty much devoid of real tension or suspense.", "start": 162.04, "duration": 7.22}, {"text": "Which requires a completely new plot device in the third act, the total malfunction of the ship, to juice the ending with some adrenaline.", "start": 169.26, "duration": 6.8}, {"text": "You know a couple weeks ago, I was watching Chris Stuckmann and Doug Walker's joint review of \"Passengers,\" and Walker said something interesting.", "start": 176.28, "duration": 6.58}, {"text": "\"If they told this in a different order,\nit would have been ten times more interesting.\"", "start": 182.98, "duration": 5.86}, {"text": "The thing I began to wonder is what if you rearranged the movie. So that Jennifer Lawrence was the point-of-view character, not Chris Pratt?", "start": 188.84, "duration": 8.72}, {"text": "What if the film began with her experience? Well I couldn't stop thinking about it,", "start": 197.56, "duration": 4.58}, {"text": "So I re-edited the existing footage-see what would happen to the story", "start": 202.14, "duration": 4.98}, {"text": "\"Good morning, Aurora. How are you feeling? You just spent 120 years in suspended animation-\" *malfunction*", "start": 220.74, "duration": 5.68}, {"text": "\"Hello?\"", "start": 231.92, "duration": 1.0}, {"text": "\"Anybody?\"", "start": 236.68, "duration": 1.3}, {"text": "\"Hello.\"\n\"Hi, are you a passenger or crew?\"", "start": 242.56, "duration": 3.22}, {"text": "\"Passenger. Jim Preston.\" \n\"Do you know what's going on? Nobody else from my row woke up.\"", "start": 248.1, "duration": 7.3}, {"text": "\"Same for me.\" \nWhen I made this change and just watched from there, some interesting things started to happen", "start": 256.68, "duration": 5.9}, {"text": "First of all, the first act changes its tone entirely. With the original first act, you're wandering around the ship with Chris Pratt.", "start": 262.58, "duration": 6.58}, {"text": "You learn cool things. You see him come to terms of the situation, have fun, get depressed, and finally reach the", "start": 269.22, "duration": 6.54}, {"text": "ethical dilemma that's meant to animate the movie. What you see is what you get here.", "start": 275.82, "duration": 4.84}, {"text": "Which makes for somewhat passive viewing experience.", "start": 280.66, "duration": 3.3}, {"text": "It's an amusing sequence, but that's mostly down to cool production design and Pratt's always charming performance.", "start": 283.96, "duration": 5.5}, {"text": "\"Guess I am going to die of old age on this ship.\"", "start": 289.52, "duration": 2.72}, {"text": "But in the new first act, the story is infused from the start with mystery.", "start": 292.28, "duration": 5.16}, {"text": "When I made the editing changes, I was genuinely surprised by just how creepy Pratt's character is when you take away his point of view.", "start": 297.48, "duration": 7.84}, {"text": "We don't know whether to trust him or not, believe him or not. And that makes the audience's experience an active one in every moment.", "start": 305.32, "duration": 6.76}, {"text": "\"Do you know what's going on? Nobody else from my row woke up.\"", "start": 312.38, "duration": 3.54}, {"text": "\"Same for me.\" As he leads Jennifer around the ship, locations become crime scenes where the viewer tries to figure out what's happening.", "start": 317.22, "duration": 7.42}, {"text": "This, of course by the way, is what makes Andrei Tarkovsky's \"Solaris\" so great.", "start": 324.64, "duration": 3.34}, {"text": "So much has happened on Solaris by the time the lead character arrives that he and the audience have to piece the fragments together themselves.", "start": 327.98, "duration": 8.26}, {"text": "I mean, just look at how creepy he is. I actually think that Pratt's performance takes on more dimensions from this angle.", "start": 336.24, "duration": 5.459}, {"text": "You're not always forced to see him as sympathetic, so his darker side comes out in greater relief.", "start": 341.7, "duration": 4.92}, {"text": "More important than that, the dark choice that sits at the heart of this film hits with greater impact when seen for the first time from Lawrence's perspective", "start": 346.62, "duration": 7.72}, {"text": "because we feel the cruelty as she feels it.", "start": 354.34, "duration": 2.8}, {"text": "\"Did you wake me up?\"", "start": 357.34, "duration": 1.54}, {"text": "\"I tried not to.\"", "start": 360.58, "duration": 1.52}, {"text": "*gasp*", "start": 362.1, "duration": 0.78}, {"text": "Now we're at the point where the original story hits that dead end.", "start": 363.6, "duration": 3.86}, {"text": "But with this new edit, you have some more options to play with.", "start": 367.68, "duration": 3.2}, {"text": "Namely, with this configuration, you could actually turn Pratt into the villain, the original film suggests,", "start": 370.88, "duration": 5.4}, {"text": "But can't follow through on and make \"Passengers\" into the thriller horror film that so many critics wanted to see.", "start": 376.28, "duration": 6.62}, {"text": "You can even cut back in that whole first section of Chris's time alone on the ship, but put it after the revelation without the need to justify his good guy-ness.", "start": 382.9, "duration": 8.62}, {"text": "You could show a deeper, more desperate side to his loneliness.", "start": 391.52, "duration": 3.68}, {"text": "Something that I think actually would make him more sympathetic in the end and the choice he makes more agonizing.", "start": 395.2, "duration": 6.02}, {"text": "*gasp*", "start": 415.34, "duration": 1.12}, {"text": "Of course, this simple cut and paste doesn't solve every problem in the script. The ending, for example, is still an issue.", "start": 419.02, "duration": 6.4}, {"text": "I think you'd want to remove the malfunction McGuffin, but it might be just as trite to close the story in true horror fashion.", "start": 425.42, "duration": 6.96}, {"text": "It could be cool to give it a twilight zone ending as Peter's last film suggested and have Pratt die and Lawrence gets", "start": 432.56, "duration": 5.72}, {"text": "so lonely that she begins to contemplate the same horrible choice.", "start": 438.28, "duration": 3.64}, {"text": "Brainstorming like this is obviously really fun and much easier than actually writing a movie and making one.", "start": 442.94, "duration": 5.48}, {"text": "For all its faults, \"Passengers is a big-budget movie with a completely original script, and that should be celebrated because it's a dying breed.", "start": 448.42, "duration": 7.44}, {"text": "But a film like this is a good opportunity for would-be screenwriters to think about story.", "start": 455.92, "duration": 4.64}, {"text": "Because you can learn just as much from films that don't work as you can from those that do.", "start": 460.56, "duration": 5.38}, {"text": "Hey, everybody. Thank you so much for watching. This episode was brought to you by Dollar Shave Club.", "start": 468.42, "duration": 3.98}, {"text": "You might have noticed that I have a beard.", "start": 472.56, "duration": 1.82}, {"text": "Everybody with a beard will tell you that if you don't keep things clean it can get really scruffy really quickly", "start": 474.44, "duration": 4.42}, {"text": "so I use dollar shave club razors to make sure all the", "start": 478.88, "duration": 2.46}, {"text": "lines on my neck and cheeks are smooth and even.", "start": 481.38, "duration": 2.84}, {"text": "And it's the smarter choice because they send everything you need right to your door", "start": 484.22, "duration": 2.88}, {"text": "At an affordable price. You don't have to go to the store.", "start": 487.1, "duration": 2.8}, {"text": "You don't have to spend money on unnecessary technology.", "start": 489.9, "duration": 2.58}, {"text": "And for a limited time you can get the executive razor with a tube of Dr. Carver's shave butter for just five dollars.", "start": 492.48, "duration": 7.08}, {"text": "No shipping fee, and razors are only a few bucks a month after that. Here's what you get in the box.", "start": 499.56, "duration": 5.78}, {"text": "You get a nice sturdy handle, you get your four razors and of course", "start": 505.38, "duration": 5.46}, {"text": "Dr. Carver's shave butter, don't leave home without it. Makes shaving really easy, no commitments, no hassles,", "start": 510.84, "duration": 6.06}, {"text": "And if you go to dollarshaveclub.com/nerdwriter you can get that first month for $5.", "start": 516.9, "duration": 6.1}, {"text": "The link's at the top of the description, that's dollarshaveclub.com/nerdwriter", "start": 523.22, "duration": 4.2}, {"text": "Thanks guys, I'll see you next week.", "start": 527.42, "duration": 1.58}]