[{"text": "-Today, I am here with Kevin more commonly known as the backyard scientist and as fate would have it", "start": 2.11, "duration": 4.999}, {"text": "-We are actually in", "start": 7.109, "duration": 0.991}, {"text": "-the backyard", "start": 8.1, "duration": 0.93}, {"text": "-So I recently made a video where I converted a leaf blower into a snowball machine gun and the first thing", "start": 9.03, "duration": 5.25}, {"text": "-He said was", "start": 14.28, "duration": 0.5}, {"text": "-you should set those on fire", "start": 14.78, "duration": 1.707}, {"text": "-so as soon as I got here today. We", "start": 16.487, "duration": 1.872}, {"text": "-But flaming snowballs aren't actually why I'm here today show them why I'm here today, Kevin", "start": 25.599, "duration": 4.01}, {"text": "So I actually don't drink but I've heard of people doing this with beer bottles, so either Kevin has some super powers", "start": 30.429, "duration": 5.96}, {"text": "Or there's some crazy physics going on there that we're going to try and figure out today", "start": 36.39, "duration": 4.049}, {"text": "So neither of us really knows what causes these bottles to break and there's a lot of conflicting [evidence] out there", "start": 40.53, "duration": 4.74}, {"text": "But we have some of our own ideas so as firm believers in the scientific method", "start": 45.27, "duration": 3.989}, {"text": "We are going [to] science our way to the right answer through a bunch of experiments. I'll drink to that not yet", "start": 49.26, "duration": 5.16}, {"text": "You won't have it", "start": 54.42, "duration": 2.0}, {"text": "I've heard that one of the reasons people think it's breaking is because when they slam their hand down [on] it", "start": 64.54, "duration": 5.089}, {"text": "They're forcing a bunch of air into models and that causes the bottom to shoot out", "start": 69.63, "duration": 4.08}, {"text": "So in this experiment", "start": 75.46, "duration": 1.1}, {"text": "We're testing the pressure wave theory where when a person hits it with their hand they force a bunch of air in that then creates", "start": 76.56, "duration": 6.989}, {"text": "A pressure wave that pushes out the bottom of the bottle so we put a cap on the top", "start": 83.549, "duration": 3.84}, {"text": "So there's no way to force air in we're using a rubber mallet just to be more consistent for all of the hits", "start": 87.39, "duration": 6.239}, {"text": "The bottle broke even though the cap was on and there was no way to force air in so we are rejecting this theory", "start": 99.5, "duration": 6.319}, {"text": "We think carbonation might have something to do with it, okay?", "start": 109.19, "duration": 2.66}, {"text": "So to isolate that we have one beer that's carbonated one with water, and then we fill this one with sparkling water", "start": 111.85, "duration": 6.659}, {"text": "[so] if these two [don't] break and this one breaks. I think we've isolated that it works better without carbonation. Yes", "start": 118.51, "duration": 7.799}, {"text": "So this bottle is filled with sparkling water theory is [that] it shouldn't break", "start": 128.78, "duration": 4.279}, {"text": "And now for the beer", "start": 134.9, "duration": 2.0}, {"text": "The bottle didn't break but that was interesting how much it fizzed up. So as it turns out", "start": 137.27, "duration": 4.339}, {"text": "Here's why [that] happens when you hit the bottle it moves down really fast", "start": 141.61, "duration": 3.69}, {"text": "[but] the liquid hasn't started moving yet that creates an empty gap down here. That's basically a vacuum or really low pressure", "start": 145.3, "duration": 6.779}, {"text": "[if] the drink is carbonated the co2 from the liquid gets sucked into that vacuum and fills it with Co2 gas bubbles", "start": 153.2, "duration": 6.5}, {"text": "Since these bubbles are less dense than the drink they rise up through the liquid and create a chain reaction", "start": 159.76, "duration": 5.339}, {"text": "Of more bubbles as they go", "start": 165.17, "duration": 1.98}, {"text": "But finally we test the water and just [like] with the carbonated liquids you [see] this vacuum form on the bottom", "start": 167.15, "duration": 5.69}, {"text": "Except this time the bottle breaks so theory number two is confirmed", "start": 177.41, "duration": 4.25}, {"text": "Non-carbonated liquids work better, but now we just have to figure out why what are they doing differently to make the bottle actually break?", "start": 182.72, "duration": 7.04}, {"text": "so what I think is breaking the bottle is the momentum of the water going back and filling the vacuum is causing the bottom to", "start": 189.95, "duration": 5.96}, {"text": "break out", "start": 195.91, "duration": 0.49}, {"text": "And I think the break is happening a little bit earlier when the vacuum is formed like the air outside is at 14", "start": 196.4, "duration": 7.55}, {"text": "PSI, and so it's in on the back, so it's it's before the water rebounds", "start": 203.959, "duration": 5.99}, {"text": "It's actually cracking because the difference in pressure. We'll find out. round three fight! So we're going to add some red", "start": 209.95, "duration": 7.32}, {"text": "Dye and then we're going to slow the camera down to like 7,000 frames per second see precisely", "start": 217.27, "duration": 4.679}, {"text": "the Moment", "start": 222.47, "duration": 2.0}, {"text": "So if I'm right, okay bottles it should break right there no", "start": 234.739, "duration": 4.91}, {"text": "Yeah", "start": 243.83, "duration": 2.0}, {"text": "Yeah, so you're definitely right it it ruptured when the water is coming back. That's right after it hits the bottom", "start": 246.53, "duration": 5.69}, {"text": "So Kevin was right in fact it turns out that water cavity", "start": 256.91, "duration": 3.769}, {"text": "collapses [ten] times faster than it formed which creates a Force higher", "start": 261.019, "duration": 3.8}, {"text": "Than the [initial] hit on the bottle which is why it doesn't break right away", "start": 264.919, "duration": 3.5}, {"text": "So now that you know the science if you want to impress your friends with this trick", "start": 268.419, "duration": 3.33}, {"text": "Here are a couple", "start": 271.75, "duration": 0.76}, {"text": "Important tips number one hits the bottle and not your hand you want to make as much", "start": 272.51, "duration": 4.519}, {"text": "energy from your strike go into moving the bottle and not just being reacted by your hand you can even get the neck of the", "start": 277.1, "duration": 6.049}, {"text": "bottle a little wet and then let it slip a bit when you hit it just to make sure it's moving number two like we", "start": 283.15, "duration": 5.279}, {"text": "Discovered use water or something", "start": 288.44, "duration": 1.979}, {"text": "non-carbonated otherwise the carbonation just fills in that vacuum and", "start": 290.419, "duration": 3.17}, {"text": "Cushions the rebound Force number three a liquid with a high vapor pressure is good if you use a liquid with a high vapor pressure", "start": 293.66, "duration": 6.35}, {"text": "That means the vacuum you need at the bottom of the bottle will form much easier", "start": 300.01, "duration": 4.289}, {"text": "So hot water is a lot better than cold [water] because the vapor pressure is higher nail polish remover also works well for the same", "start": 304.3, "duration": 6.39}, {"text": "reason [number] four be safe", "start": 310.69, "duration": 1.53}, {"text": "This is glass and glass can cut you if you're not careful where it lands number five don't chicken out", "start": 312.22, "duration": 5.22}, {"text": "It hurts way [more] if you don't follow through plus. You look like this. [oh], I heard it", "start": 317.5, "duration": 5.19}, {"text": "So I want to say thanks to audible. I enjoyed recently listening to a book called ready player one", "start": 328.28, "duration": 5.269}, {"text": "it's set in a dystopian future where people's main escape from the bleak world is to log into a virtual reality world called the", "start": 333.56, "duration": 6.799}, {"text": "Oasis was created by the richest man on Earth", "start": 340.43, "duration": 2.179}, {"text": "[but] before he died he hid an easter egg in the Oasis", "start": 342.61, "duration": 3.21}, {"text": "[and] he promised his entire fortune to the person who could find it, but he warned to be successful", "start": 345.82, "duration": 4.769}, {"text": "You would need to know a lot about 80s Pop Culture and video games", "start": 350.59, "duration": 3.36}, {"text": "The story is really creative and intense in fact Steven Spielberg is currently directing the film adaptation", "start": 355.52, "duration": 6.83}, {"text": "So if you want to listen to ready player one or any book for free all you have to do is use the link in", "start": 362.35, "duration": 4.679}, {"text": "The description or go to audible.com/MarkRober", "start": 367.03, "duration": 2.76}, {"text": "Thanks for watching", "start": 370.31, "duration": 2.0}]