[{"text": "This video is sponsored by Another Eden. Another Eden is a free-to-play", "start": 0.02, "duration": 3.42}, {"text": "JRPG adventure for iOS and Android and before I go any further.", "start": 3.66, "duration": 3.5}, {"text": "This is written and directed by Masato Kato, who wrote the likes of Chrono Trigger", "start": 7.26, "duration": 3.8}, {"text": "Xenogears, Heroes of Mana and many more. Yes, and like a lot of mobile games,", "start": 11.36, "duration": 3.939}, {"text": "and this is a super story focused RPG with a lengthy 26 chapter", "start": 15.299, "duration": 3.45}, {"text": "Campaign visiting multiple timelines and locations, voiced in both English and full Weeb. Yes", "start": 19.0, "duration": 5.029}, {"text": "It's a much more traditional story driven JRPG and as a JRPG enthusiast, I already know all the ins and outs", "start": 24.029, "duration": 5.64}, {"text": "Look has warned me not to fight this dude, but I'm pretty confident. I can handle...", "start": 29.67, "duration": 3.239}, {"text": "This must be the dark souls of mobile games!! You get to choose between a big variety of party members", "start": 37.86, "duration": 5.329}, {"text": "But I've also got to mention the music because it was composed by", "start": 43.19, "duration": 2.819}, {"text": "Yasunori Mitsuda and poor econ studio, who also works on Chrono Trigger and Xenogears cuz this is by far the best", "start": 46.079, "duration": 5.42}, {"text": "OST I've heard for any mobile game", "start": 51.6, "duration": 2.0}, {"text": "If this top class production sounds like your cup of tea", "start": 58.09, "duration": 2.75}, {"text": "Click the link in the description to download it on iOS and Android and with that said let's get on with today's video", "start": 60.88, "duration": 6.799}, {"text": "Anime endings- no not that- the ending of an anime", "start": 67.9, "duration": 2.93}, {"text": "-No, no, not not fucking- that the part that comes at the end of an anime", "start": 70.83, "duration": 4.769}, {"text": "No, Not fucking that! The final act of an anime in which the events happening in the plot, characters, and series come to a conclusion", "start": 75.81, "duration": 6.21}, {"text": "Aka the ending is an important part of any anime", "start": 82.27, "duration": 3.199}, {"text": "It can be the culmination of the journey that's been taken", "start": 85.47, "duration": 2.519}, {"text": "It can give the entire series a sense of resolution and closure and in some cases can literally make or break an anime", "start": 87.99, "duration": 6.36}, {"text": "But I feel in this age of seasonal anime, 3 episode rules, dropping shows harder than the asteroid that killed the dinosaurs", "start": 94.35, "duration": 4.889}, {"text": "something not discussed enough is", "start": 99.84, "duration": 2.0}, {"text": "Anime End- oh for fuck's sake- A good friend of mine once said \"the ending is Paramount", "start": 102.64, "duration": 6.56}, {"text": "Pictures\"", "start": 109.58, "duration": 1.08}, {"text": "Stay toasty, but I feel like in anime because of the way it's made there are different directions", "start": 110.86, "duration": 4.06}, {"text": "We as anime fans see a lot from the conclusive, to the open-ended, to the downright", "start": 114.93, "duration": 4.559}, {"text": "What the fuck? So I wanted to just take this video to just kind of discuss the different types of endings", "start": 119.68, "duration": 5.029}, {"text": "We usually see, my perceptions of them as a whole, and how they fit into the anime culture in general.", "start": 124.709, "duration": 5.22}, {"text": "Now, I want to keep this a general discussion about endings without spoiling everything I'm talking about", "start": 129.929, "duration": 4.02}, {"text": "so to help you avoid this on every section I will be listing any shows in which I either detail or show spoiler-ific", "start": 133.95, "duration": 6.0}, {"text": "Plot points to do with the ending", "start": 139.95, "duration": 1.44}, {"text": "So if you want to skip any sections, the timestamps of each section will be in the description below", "start": 141.39, "duration": 4.41}, {"text": "so with that out of the way first let's start with", "start": 145.87, "duration": 2.63}, {"text": "If there's one easy way for a new anime to grab my attention", "start": 151.0, "duration": 3.08}, {"text": "It's just by knowing that it's an anime original series", "start": 154.08, "duration": 2.699}, {"text": "Firstly, because this means we don't have any source material, meaning we don't get those manga-readers acting like 200 IQ", "start": 156.88, "duration": 4.879}, {"text": "Geniuses being like \"oh Is that what you think is going to happen? Poor Anime only watchers? hehehe\"", "start": 161.95, "duration": 3.889}, {"text": "\"Look at me. I'm so smart because I know what's gonna happen next hehehe,\" and then light novel readers are there like", "start": 166.42, "duration": 4.82}, {"text": "\"AHAHAHA, FOOLISH MORTALS!!\"", "start": 171.36, "duration": 2.62}, {"text": "And secondly because it's not based on a pre-existing IP, it's likely that it will have an ending that's conclusive or even better", "start": 174.42, "duration": 7.07}, {"text": "It means the entire story from beginning to end is already pre-planned and anime original series are not common occurrences", "start": 181.49, "duration": 6.539}, {"text": "But many shows older and new stick out to me because of this fact: Cowboy Bebop", "start": 188.03, "duration": 3.929}, {"text": "Eureka 7, Code Geass, even in more recent times with RE:Creators, and A Place Further than the Universe, of course", "start": 192.23, "duration": 5.4}, {"text": "It wasn't just the ending that made these show stand out, but it did help a lot something like", "start": 197.63, "duration": 4.589}, {"text": "Zankyou no Terror, despite a lot of the problems", "start": 202.22, "duration": 1.62}, {"text": "I had with it stick with me clearly because it felt like a complete story that was planned out with an ending", "start": 203.84, "duration": 4.889}, {"text": "I've really enjoyed and like holy shit Re:Creators did this", "start": 208.73, "duration": 3.18}, {"text": "Revolutionary thing in anime called an epilogue where the entire last episode was no action, no plot.", "start": 212.19, "duration": 5.959}, {"text": "It was just dedicated to tying up loose ends and seeing what characters were up to after the story was concluded to leave the viewer", "start": 218.15, "duration": 6.059}, {"text": "with a sense of closure", "start": 224.209, "duration": 1.451}, {"text": "What The Fuc- but of course just because something is anime original doesn't mean it's guaranteed to have a good ending", "start": 225.66, "duration": 6.229}, {"text": "In fact, there used to be this thing called 'Gainax endings' where certain shows coincidentally produced by studio Gainax would get endings", "start": 231.89, "duration": 6.96}, {"text": "That made no sense or served sequel hooks to sequels that were never made", "start": 238.85, "duration": 3.839}, {"text": "Fortunately 'Gainax Endings'", "start": 243.019, "duration": 0.991}, {"text": "nowadays seems to have died with the decline of the studio only to find themselves Isekai-d into Trigger for its own light", "start": 244.01, "duration": 5.58}, {"text": "novel adaptation of 'that time", "start": 249.59, "duration": 1.38}, {"text": "I got Reincarnated as Darling in the FranXX'", "start": 250.97, "duration": 2.009}, {"text": "But even some anime that have had a conclusive enough endings, have had a reoccurring issue because if it gets enough success and popularity", "start": 252.98, "duration": 6.03}, {"text": "There's always a chance that the creators felt it was appropriate to revive it and have another go", "start": 259.01, "duration": 4.349}, {"text": "There are little things that are sacred in anime these days and one of them certainly isn't the legacy of a popular franchise", "start": 269.59, "duration": 5.72}, {"text": "It doesn't matter how good or how conclusive and complete your series can be when it's over", "start": 275.31, "duration": 4.26}, {"text": "There's always gonna be a way to Ret-Conn or ass-pull or literally", "start": 279.57, "duration": 3.299}, {"text": "Resurrect a new narrative to milk a few more dollars out of beloved franchises just in time to give me my 'JI-BUN WOES'", "start": 282.96, "duration": 6.38}, {"text": "(cries for mistakes made that cause woes)", "start": 289.5, "duration": 1.1}, {"text": "On the rare occasion you get something like Diebuster adding a new story in the same world years after Gunbuster", "start": 291.1, "duration": 5.5}, {"text": "but there are numerous examples of sequels coming in that not only result in a vastly inferior ending to the original series but even going", "start": 296.639, "duration": 6.089}, {"text": "As far as completely fucking up and ruining the established canon", "start": 302.729, "duration": 2.76}, {"text": "We went from Darker Than Black season 1 Chinese electric Batman to Darker Than Black season 2", "start": 305.82, "duration": 5.339}, {"text": "Alcoholic dad simulator, Madoka Rebellion was a sequel movie....", "start": 311.919, "duration": 3.5}, {"text": "that people had opinions about and then there's Eureka 7 AO. Now if AO is viewed as a standalone series it would be", "start": 316.539, "duration": 6.47}, {"text": "Fine, just a fairly forgettable average show", "start": 323.01, "duration": 2.489}, {"text": "But as a sequel", "start": 325.5, "duration": 1.05}, {"text": "It's a fucking travesty.", "start": 326.55, "duration": 1.899}, {"text": "Introducing plot elements that completely broke characters and themes from the original", "start": 328.449, "duration": 3.551}, {"text": "going as far to confirm that the fucking spin-off reboot movie was somehow canon", "start": 332.0, "duration": 3.5}, {"text": "in some bizarre multiverse time travel fuck ass-ury", "start": 335.52, "duration": 2.68}, {"text": "and just in general trampling all over the world and themes of the original series", "start": 338.2, "duration": 3.3}, {"text": "There's a discussion to be had on whether the existence of these sequels have ruined the value of the original ending", "start": 341.56, "duration": 5.149}, {"text": "but there are also a few shows that have had pretty decent endings in the sense that they concluded everything they needed to", "start": 346.71, "duration": 5.369}, {"text": "but they still left room for a sequel which were eventually made that really didn't live up to the original", "start": 352.08, "duration": 4.769}, {"text": "The first Psycho Pass had some truly interesting and brilliant ideas that were explored and has yet to be replicated,", "start": 357.21, "duration": 4.889}, {"text": "nothing from Steins;Gate either from its sequel movie or Zero", "start": 362.53, "duration": 3.07}, {"text": "came close to capturing the original spirit and the only thing I thought the", "start": 365.6, "duration": 3.1}, {"text": "New FLCL (Fooly Cooly) brought to the table was a few new great tracks from The Pillows", "start": 368.789, "duration": 3.51}, {"text": "I think my problem with all these is that they are examples where sequel definitely wasn't needed or originally planned", "start": 372.3, "duration": 5.79}, {"text": "But they made one anyway", "start": 378.09, "duration": 2.04}, {"text": "It's not like the Mob Psycho season two's of today where the storyline didn't end and the sequel continues to add and enhance the plots", "start": 380.13, "duration": 5.88}, {"text": "But the original series has said everything it wants to and put a full-stop in it,", "start": 386.01, "duration": 3.39}, {"text": "making it hard for any sequel to capture that", "start": 389.4, "duration": 1.98}, {"text": "Same magic, even if in some cases it had left space for further ideas to be explored.", "start": 391.38, "duration": 4.64}, {"text": "However, to go in the complete opposite direction,", "start": 396.06, "duration": 2.24}, {"text": "you sometimes get anime that choose to give itself a conclusive ending even if the original story actually continues", "start": 398.3, "duration": 6.4}, {"text": "*RIP headphone users*", "start": 404.7, "duration": 1.72}, {"text": "Kind of a lost art nowadays are anime that follow the source material up to a point only to diverge from it, giving it an ending", "start": 410.18, "duration": 5.72}, {"text": "That's more conclusive", "start": 415.9, "duration": 0.759}, {"text": "Either because the source material they are adapting from is still incomplete or far too long to cover in the episode counts they are given", "start": 416.66, "duration": 5.62}, {"text": "now when I say some lost art", "start": 422.54, "duration": 1.6}, {"text": "I mean it kind of dug its own grave, set itself from fire, and jumped in head first, Soul Eater", "start": 424.15, "duration": 4.39}, {"text": "Claymore, Hellsing, Blue Exorcist, Gantz, Akeme Ga Kill! while all of these shows had", "start": 428.809, "duration": 4.04}, {"text": "conclusive endings that stopped to the point before the manga had instead of achieving their purpose of ending the series in a satisfying way it", "start": 432.979, "duration": 6.38}, {"text": "Just made fans want to end themselves. the problem with anime original endings", "start": 439.36, "duration": 3.929}, {"text": "Is that when an anime tries to go a different direction in order to give an ending that's more conclusive", "start": 443.289, "duration": 3.6}, {"text": "You miss out on the proper build-up and foreshadowing to make this happen", "start": 446.99, "duration": 3.589}, {"text": "This is made even more confusing when you get sequel seasons, that continue to follow the manga, for an anime", "start": 450.909, "duration": 5.339}, {"text": "That's already been given a conclusion.", "start": 456.248, "duration": 2.092}, {"text": "in most cases, You can just pretend the final anime only arc didn't happen and just continue business as usual", "start": 458.62, "duration": 4.4}, {"text": "but occasionally you get something like Tokyo Ghoul Root A", "start": 463.04, "duration": 2.9}, {"text": "The completely anime only sequel to Tokyo Ghoul aka Tokyo ghoul season 2, not to be confused with", "start": 466.06, "duration": 5.96}, {"text": "Tokyo Ghoul:re season 2 which is the second season to Tokyo Ghoul:re. the sequel season to Tokyo Ghoul because", "start": 472.02, "duration": 6.98}, {"text": "Tokyo Ghoul Root A aka Season 2 doesn't follow the manga so that makes Tokyo Ghoul:re the cannon second season of Tokyo Ghoul", "start": 479.16, "duration": 6.7}, {"text": "except Tokyo Ghoul:re aka Cannon 2nd season doesn't immediately continue the events of Tokyo Ghoul season 1", "start": 485.86, "duration": 5.039}, {"text": "I mean why the fuck with it, right? So instead it continues on from Tokyo Ghoul", "start": 490.899, "duration": 3.75}, {"text": "manga", "start": 495.38, "duration": 0.76}, {"text": "Obviously, which was never fully adapted into an anime, which makes it really easy to follow", "start": 496.43, "duration": 4.03}, {"text": "So if you're an anime only watcher it's actually pretty simple", "start": 500.469, "duration": 3.3}, {"text": "All you need to do is watch Tokyo Ghoul", "start": 503.979, "duration": 1.74}, {"text": "Then read the Tokyo Ghoul manga, then watch the Tokyo ghoul live-action then comes the Tokyo Ghoul Musical", "start": 505.96, "duration": 4.38}, {"text": "then Tokyo Ghoul Grand Order for the Nintendo DS and then after you've done all that you're finally ready", "start": 510.46, "duration": 5.46}, {"text": "to play Kingdom Hearts 3", "start": 515.92, "duration": 1.1}, {"text": "- my recollection, the only anime original ending that has been positively received has been the original Full Metal Alchemist", "start": 517.02, "duration": 5.74}, {"text": "and what made this possible was the fact that since the anime started diverging by the halfway point, it was able to carve out its", "start": 522.76, "duration": 5.549}, {"text": "own narrative and tackle things in a different way, giving much more adequate time to set up its ending and for it's time people were", "start": 528.31, "duration": 5.729}, {"text": "Satisfied considering the original manga was still ongoing. having said that though nowadays", "start": 534.14, "duration": 4.459}, {"text": "I get the sense that this ending is looked down upon because we now have", "start": 538.6, "duration": 2.88}, {"text": "Brotherhood", "start": 541.759, "duration": 0.5}, {"text": "which remakes the entire series to give an ending the majority seem to agree was much better than what we originally got and this is", "start": 542.259, "duration": 7.049}, {"text": "Why I feel you just don't see this kind of ending nowadays", "start": 549.309, "duration": 2.58}, {"text": "If you diverge from the source material. It is very hard to make something satisfactory", "start": 551.889, "duration": 3.78}, {"text": "even if you make it conclusive and fans seemingly would much rather be left hanging than given a conclusion that", "start": 555.67, "duration": 5.099}, {"text": "Absolutely sucks dick, and that leads us to our next section in the technical term. We know as", "start": 560.959, "duration": 4.94}, {"text": "Must be showing my age, that's not what the cool kids are saying these days", "start": 570.28, "duration": 2.6}, {"text": "*Pop* (fricken Light Novels)", "start": 573.42, "duration": 0.5}, {"text": "That's better as we know every story has a beginning, a middle, and an end", "start": 573.98, "duration": 4.76}, {"text": "Except in anime where we get a beginning, half a middle, and a season 3. That's never gonna come", "start": 579.11, "duration": 4.939}, {"text": "This is a very common occurrence in anime", "start": 584.049, "duration": 2.13}, {"text": "we see an interesting set up to a story or world, a major arc or two happens, and just as you feel you've just about", "start": 586.179, "duration": 5.85}, {"text": "Scratched the surface of what it has to offer, its ends and you never hear from it again", "start": 592.029, "duration": 4.529}, {"text": "If you're an anime fan, you've probably experienced this a lot", "start": 596.559, "duration": 2.4}, {"text": "Especially in the short, hard-hitting, seasonal anime culture. as they can", "start": 598.959, "duration": 3.75}, {"text": "Sometimes feel like certain anime were made as a glorified", "start": 602.709, "duration": 2.831}, {"text": "advert for the source material", "start": 605.58, "duration": 1.12}, {"text": "see, when it comes to people who read source material like manga there are two types of manga readers:", "start": 606.92, "duration": 5.46}, {"text": "the brain, rare heroic Souls who throw themselves into the Expansive world of manga", "start": 612.6, "duration": 4.9}, {"text": "working tirelessly to find that next hidden gem within the ocean of unknown titles", "start": 617.54, "duration": 6.26}, {"text": "and then, there's everyone else, who saw an airing anime and couldn't wait to find out what happens next.", "start": 624.32, "duration": 4.6}, {"text": "back in the day there were some pretty infamous endings for doing this and by infamous", "start": 629.0, "duration": 3.24}, {"text": "I mean it was like the animators ran out of paper to draw on and we're like, yeah", "start": 632.26, "duration": 3.09}, {"text": "Let's just cut to credits and hope nobody cares", "start": 635.35, "duration": 2.0}, {"text": "*whisper* everyone cared.", "start": 637.35, "duration": 1.159}, {"text": "Air Gear, Batoom, the original HunterxHunter, High School of the Dead", "start": 638.509, "duration": 3.71}, {"text": "These just ended right in the middle of a story arc with all number of story threads up in the air before just stopping dead", "start": 642.249, "duration": 5.4}, {"text": "No conclusion", "start": 647.649, "duration": 0.93}, {"text": "No promise of another season. just cut to credits", "start": 648.58, "duration": 2.34}, {"text": "and then you had the original Berserk, which didn't just stop in the middle of a story arc, but right in the middle of the most shocking", "start": 651.28, "duration": 5.34}, {"text": "Scarring turn of events that literally destroyed a man leaving him bleeding tears of blood, screaming in anger in a state of shock", "start": 657.139, "duration": 5.69}, {"text": "Betrayal, aghast, at the events that just unfolded", "start": 663.44, "duration": 2.86}, {"text": "and that was just me", "start": 666.38, "duration": 1.36}, {"text": "I don't even know how Guts felt", "start": 667.748, "duration": 1.432}, {"text": "Back then, fans would have sold their soul to see what happens next and little did we know that twenty years later we'd get our wish", "start": 669.18, "duration": 6.44}, {"text": "yeah, we got our wish, alright? We have no rights complain", "start": 675.62, "duration": 2.719}, {"text": "We got our fuckin wi- who made a deal with the fucking be-helots to make this wish come true", "start": 678.339, "duration": 5.01}, {"text": "Nowadays, what I will say is that seasons at least are more carefully planned out", "start": 683.75, "duration": 3.529}, {"text": "So audiences get some kind of closure in the arts that they tackle, but still if you've been an anime fan for a while", "start": 687.279, "duration": 5.159}, {"text": "I'm sure you've gotten used to the feeling of waiting for a season two or three", "start": 692.439, "duration": 3.81}, {"text": "That's may or may not ever come, whether that be Re:ZERO- Holy fucking shit. Are you serious?", "start": 696.25, "duration": 5.129}, {"text": "No Game No Life, Spice and Wolf, The Devil is a Part-timer", "start": 701.6, "duration": 3.34}, {"text": "*whisper* A Berserk adaptation we can be proud of", "start": 705.0, "duration": 1.76}, {"text": "All countless other shows if you're lucky you may get another season or I guess the hot new thing nowadays is sequel movies", "start": 706.82, "duration": 6.319}, {"text": "Oh, look at that sexy boy walking down the red carpet", "start": 713.139, "duration": 2.73}, {"text": "But even then will it ever even come close to completion?", "start": 715.87, "duration": 3.569}, {"text": "Not likely. part of the life cycle within the anime and manga culture is that we get an anime adaptation", "start": 719.899, "duration": 5.299}, {"text": "When you have a hot title and that rarely happens", "start": 725.389, "duration": 3.14}, {"text": "After a title has already ended. On the rare occasion you get something like Devil man Crybaby", "start": 728.75, "duration": 4.189}, {"text": "where the anime is adapting an old title that's finished", "start": 732.949, "duration": 2.84}, {"text": "But more often than not you find yourself finishing the anime and when you catch up to the manga or light novel,", "start": 735.789, "duration": 4.771}, {"text": "the story is still at least a few years away from completion", "start": 740.56, "duration": 3.3}, {"text": "one thing I both love and hate about the medium of anime is just how many new shows with massive variety we constantly get", "start": 743.86, "duration": 6.3}, {"text": "but the downside of that, is as an anime fan you get used to being introduced to stories, characters, and worlds", "start": 750.16, "duration": 5.5}, {"text": "which you know you're never gonna see the ending of and honestly", "start": 755.76, "duration": 3.34}, {"text": "I think that's kind of a shame because to me even though I don't think the ending is always the most", "start": 759.1, "duration": 5.07}, {"text": "Important factor a lot of the anime that have stuck in my mind. years after they have finished. are the ones that end.", "start": 764.3, "duration": 7.039}, {"text": "Now you may be sitting there wondering why I cared enough about", "start": 778.23, "duration": 3.17}, {"text": "Anime endings that I would want to make a whole video on it", "start": 781.5, "duration": 2.69}, {"text": "And that's because I just wanted to express how much I value a great ending", "start": 784.19, "duration": 5.489}, {"text": "well, I don't think every series needs a fantastic ending or even a proper ending, for it to be a", "start": 790.01, "duration": 5.729}, {"text": "fantastic series the ones that do have one. I never forget.", "start": 795.92, "duration": 4.32}, {"text": "my favorite anime ending of all time still is Code Geass's original ending", "start": 800.24, "duration": 5.1}, {"text": "Now over a decade later when I think back to Code Geass, with the second season in mind especially.", "start": 805.529, "duration": 4.52}, {"text": "I don't remember the complete mess", "start": 810.05, "duration": 2.28}, {"text": "it was at times, the complete flip-flopping of characters, that suited whatever the plot needed or whoever the fuck this little shit was", "start": 812.33, "duration": 7.13}, {"text": "does anyone remember the cat episode", "start": 819.46, "duration": 2.46}, {"text": "Does anyone remember the pizza episode!", "start": 822.56, "duration": 4.44}, {"text": "I remember season 2, episode 25, Re;", "start": 827.0, "duration": 4.58}, {"text": "I remember Lelouch's sacrifice", "start": 831.62, "duration": 2.729}, {"text": "I remember the Trumpets of Madder Sky", "start": 834.71, "duration": 2.25}, {"text": "Blaring as they explained Zero's Requiem. jaws wide open, goosebumps galore. as I realized", "start": 837.27, "duration": 6.679}, {"text": "Holy fuck. everything had a point", "start": 844.02, "duration": 3.139}, {"text": "Everything was leading up to this one moment and feeling a sense of awe", "start": 847.68, "duration": 4.789}, {"text": "jubilation, sadness, and emptiness. all at once as the credits started rolling and", "start": 853.5, "duration": 6.2}, {"text": "That is the power of a great ending", "start": 860.64, "duration": 2.809}, {"text": "It's that bittersweet void that tells you that the journey is Over", "start": 863.74, "duration": 4.04}, {"text": "as much as you love the path you took to get here and never wanted it to end", "start": 867.78, "duration": 5.38}, {"text": "The fact that it did end makes it even more special", "start": 873.48, "duration": 3.65}, {"text": "And you wouldn't have it any other way. Because yes, sometimes it's about the journey, not the destination", "start": 877.56, "duration": 6.86}, {"text": "but when you have a breathtaking destination,", "start": 884.72, "duration": 2.74}, {"text": "it can give even more meaning to that journey,", "start": 887.66, "duration": 3.0}, {"text": "and make that entire voyage you took THAT much more extraordinary", "start": 890.66, "duration": 5.38}, {"text": "Nowadays so much focus is given to how to begin a story.", "start": 896.18, "duration": 3.48}, {"text": "With so many anime competing\nfor your attention every season,", "start": 899.66, "duration": 3.1}, {"text": "it's all about how to make\nthe highest impact as fast as possible,", "start": 902.82, "duration": 3.36}, {"text": "how to immediately stand out from the crowd.", "start": 906.18, "duration": 2.46}, {"text": "But to me, it's the ending that sticks with you.", "start": 908.82, "duration": 3.38}, {"text": "There have been plenty of anime with great beginnings that slowly fizzle out and get forgotten", "start": 912.209, "duration": 5.04}, {"text": "But I have never forgotten an anime with a great ending", "start": 917.56, "duration": 4.699}, {"text": "It wraps up everything the story was trying to say", "start": 922.269, "duration": 2.9}, {"text": "Allows me to truly reflect on the anime as a whole", "start": 925.24, "duration": 3.16}, {"text": "and kind of make peace with the fact that it is complete.", "start": 928.4, "duration": 3.7}, {"text": "Because, if you end your anime right,", "start": 932.16, "duration": 3.48}, {"text": "it can be a moment you'll never forget.", "start": 935.82, "duration": 4.12}, {"text": "*smirk*", "start": 940.52, "duration": 2.0}, {"text": "\"Bang\"", "start": 944.78, "duration": 1.78}, {"text": "*Ending Music starts*", "start": 948.08, "duration": 2.76}, {"text": "Hey guys, hope you enjoyed that video.", "start": 952.96, "duration": 2.72}, {"text": "Again, I just wanted to give a quick thanks to\n\"Another Eden\" for making this video possible.", "start": 955.68, "duration": 4.28}, {"text": "If any of what I said has interested you then please check them out in the link below.", "start": 960.24, "duration": 4.4}, {"text": "Just a quick note: It's not available officially on App Stores in Europe, at the moment", "start": 964.64, "duration": 3.36}, {"text": "But they are looking for a full European release soon", "start": 968.008, "duration": 2.492}, {"text": "And with that said, thank you very much to Eliphal, Robert Harnborg, Basel, Laioken", "start": 970.5, "duration": 5.28}, {"text": "and everyone else on my patreon for supporting me this month. also know a lot of you have been asking but I will be doing another", "start": 975.78, "duration": 6.0}, {"text": "seasonal chart anime stream, when I go through all the anime next season,", "start": 981.9, "duration": 3.06}, {"text": "That's gonna be next week on Wednesday the 3rd of April at 3 p.m Eastern Daylight Time", "start": 985.12, "duration": 5.14}, {"text": "here on YouTube I wanted to do on a weekend, but unfortunately", "start": 990.34, "duration": 3.4}, {"text": "I am not free for any of the weekends coming up and I wanted to", "start": 993.75, "duration": 3.029}, {"text": "Experiment with doing a stream on YouTube as last time it was on my twitch and a lot of people weren't even aware that I had a twitch.", "start": 996.88, "duration": 6.02}, {"text": "So yeah. Anyway, that's it from me though. I've been Gigguk and I'll see you all next time", "start": 1002.9, "duration": 5.96}]