[{"text": "Me? Cycle in London? No! I'll die.", "start": 1.9, "duration": 2.24}, {"text": "You've got to be stark raving mad to cycle in London.", "start": 4.44, "duration": 2.36}, {"text": "I would cycle, but there are too many roads.", "start": 7.2, "duration": 2.1}, {"text": "I tried cycling once, but there was a bus on the other side of the road. Aargh!", "start": 9.7, "duration": 4.3}, {"text": "What's wrong with these people? Cycling is good exercise, it's free, it's fun", "start": 14.7, "duration": 4.14}, {"text": "You can change your route as you please, you can park anywhere, it's usually faster than the bus,", "start": 18.84, "duration": 4.22}, {"text": "sometimes faster than the Tube, and yet for some reason, cyclists in London are still", "start": 23.06, "duration": 4.0}, {"text": "a rare and strange breed.", "start": 27.06, "duration": 2.04}, {"text": "So, why isn't cycling normal in London? Is it to do with the way the streets were built?", "start": 30.3, "duration": 4.2}, {"text": "Or is it something embedded in our culture?", "start": 34.5, "duration": 2.36}, {"text": "Or is it a complicated and nuanced mixture of the two combined with several other surprisingly interesting", "start": 37.06, "duration": 4.26}, {"text": "factors that will take about ten minutes to discuss?", "start": 41.32, "duration": 2.38}, {"text": "♫ ♫ ♫", "start": 44.64, "duration": 1.68}, {"text": "Cycling infrastructure in London has been around longer than you might think.", "start": 51.38, "duration": 2.8}, {"text": "As far back as the 1930s when hardly anyone drove, the wise town planners decreed that", "start": 54.18, "duration": 4.6}, {"text": "cars and bikes don't mix.", "start": 58.8, "duration": 2.02}, {"text": "New suburbs in Morden, Perivale and Romford were furnished with shiny, wide, segregated,", "start": 60.82, "duration": 4.4}, {"text": "cycle tracks. The first of its kind was opened by transport minister Leslie Hore-Belisha in 1934.", "start": 65.22, "duration": 5.5}, {"text": "But they weren't really used much.", "start": 70.72, "duration": 1.62}, {"text": "Cycling groups at the time hated these so-called cycle tracks.", "start": 72.78, "duration": 2.94}, {"text": "They were worried that they'd be forced to use them and then banned from regular roads.", "start": 75.72, "duration": 3.8}, {"text": "Indeed, that's exactly what Leslie Hore-Belisha wanted, saying that cyclists were", "start": 79.86, "duration": 3.66}, {"text": "\"the most dangerous people on the road today.\"", "start": 83.52, "duration": 2.16}, {"text": "So a cycling revolution never came. But a new revolution was just around the corner.", "start": 86.54, "duration": 4.44}, {"text": "Introducing the new Car.", "start": 91.68, "duration": 1.38}, {"text": "Think you can't afford a car? Thanks to technology, the new car is more affordable than ever.", "start": 93.06, "duration": 4.38}, {"text": "You can afford the new car.", "start": 97.72, "duration": 1.2}, {"text": "With the new car, you can drive around in your new car.", "start": 98.92, "duration": 2.62}, {"text": "- Do you like your new car?\n- I love my new car. (giggles)", "start": 101.54, "duration": 4.72}, {"text": "(continues giggling)", "start": 110.78, "duration": 2.16}, {"text": "As cars became more affordable, the roads became more full of them. And so, the 1960s planners", "start": 113.48, "duration": 4.92}, {"text": "in their finite wisdom, altered London's existing streets to make more room for cars.", "start": 118.4, "duration": 3.98}, {"text": "and cyclists were completely forgotten about.", "start": 122.38, "duration": 2.42}, {"text": "Historic Hyde Park Corner was turned into a massive scary roundabout where every lane is the wrong lane.", "start": 125.38, "duration": 4.24}, {"text": "So was Archway, Elephant and Castle, Waterloo and Hammersmith.", "start": 130.04, "duration": 4.26}, {"text": "(car horns)", "start": 134.3, "duration": 2.02}, {"text": "The Westway was built. Bleurgh! And nearly all the 1930s suburban cycle tracks disappeared.", "start": 136.5, "duration": 4.94}, {"text": "Some becoming lanes for cars, others becoming parking spaces.", "start": 141.44, "duration": 2.8}, {"text": "Unsurprisingly, over the next few decades, the number of cyclists in London plummeted.", "start": 144.8, "duration": 3.78}, {"text": "* crash\n- Oww!!", "start": 148.58, "duration": 1.3}, {"text": "This terrifying video from about 1984½ which, believe it or not, is trying to promote cycling in London", "start": 149.88, "duration": 4.64}, {"text": "shows just how treacherous and horrible life on two wheels had become.", "start": 154.52, "duration": 3.2}, {"text": "it was Cars 1, Cyclists dead.", "start": 158.22, "duration": 2.5}, {"text": "Meanwhile, in Europe...", "start": 161.5, "duration": 1.22}, {"text": "Cities like Amsterdam which in the 70s had similarly lethal roads to London,", "start": 163.34, "duration": 4.44}, {"text": "not to mention a few dead children, decided to do something brave.", "start": 167.78, "duration": 3.02}, {"text": "Over the next three decades, the historic streets were totally transformed to prioritise pedestrians & pedallers.", "start": 171.14, "duration": 4.88}, {"text": "Cars were banned from some streets, and new segregated, wide, uninterrupted, smooth cycle paths", "start": 176.4, "duration": 4.9}, {"text": "were built in the lanes where people used to drive.", "start": 181.3, "duration": 1.9}, {"text": "Turning Amsterdam inside out wasn't easy and it didn't happen overnight, but eventually cycling became", "start": 184.0, "duration": 4.92}, {"text": "the normal, default way of getting around. And it was cars that had to learn to wait their turn,", "start": 188.92, "duration": 4.16}, {"text": "keep out of the way, and go the long way round.", "start": 193.08, "duration": 2.42}, {"text": "Now that doesn't mean that the Dutch are bike-mad cycling enthusiasts. That's a bit like saying that", "start": 196.48, "duration": 4.2}, {"text": "everyone in Britain is obsessed with vacuum cleaners just because everyone's got one.", "start": 200.68, "duration": 3.34}, {"text": "- In Holland\n- The Netherlands!", "start": 204.5, "duration": 1.58}, {"text": "...the Netherlands, there's no such thing as a cyclist.", "start": 206.08, "duration": 2.64}, {"text": "These people are teachers, doctors, lawyers, students,", "start": 209.1, "duration": 2.68}, {"text": "systems analysts, chartered quantity surveyors and porn stars.", "start": 211.78, "duration": 2.22}, {"text": "So why didn't this happen in London? Actually it's quite hard to say.", "start": 214.84, "duration": 4.18}, {"text": "Maybe it's because we Brits have always been overly attached to our cars.", "start": 219.4, "duration": 3.3}, {"text": "In the 80s, cars were a status symbol. Margaret Thatcher famously apparently probably said...", "start": 223.08, "duration": 4.18}, {"text": "\"A man over 30 who finds himself on a bus can count himself a failure.\"", "start": 227.58, "duration": 5.58}, {"text": "This meant that politicians and planners who wanted to make cycling better always did so with their", "start": 233.5, "duration": 3.98}, {"text": "hands tied behind their back. They couldn't do anything to get in the way of our lovely cars.", "start": 237.48, "duration": 4.26}, {"text": "Another possible reason is the way London was run for so many years.", "start": 242.2, "duration": 3.14}, {"text": "After Thatcher abolished the GLC in 1986,", "start": 245.62, "duration": 2.8}, {"text": "cycle infrastructure and the like was provided by London's 32 bickering boroughs.", "start": 248.42, "duration": 4.92}, {"text": "So there was no one to provide a city-wide shift in culture. But that would all change in the year 2000.", "start": 253.34, "duration": 4.54}, {"text": "For the first time London had an Assembly and a directly elected mayor", "start": 259.44, "duration": 3.34}, {"text": "with the power and budget to think big.", "start": 262.78, "duration": 2.08}, {"text": "Ken Livingstone...\n* ribbit", "start": 265.38, "duration": 1.28}, {"text": "and the newly formed Transport for London, or TfL...", "start": 266.66, "duration": 3.0}, {"text": "had to tackle London's chronic congestion and pesky pollution, & they saw that cycling could play a vital role.", "start": 269.66, "duration": 5.34}, {"text": "Although late to the party, with the right investment, London had the potential to become", "start": 275.66, "duration": 3.42}, {"text": "a cycling mecca just like Amsterdam. After all...", "start": 279.08, "duration": 2.94}, {"text": "It's got the same climate, it's flat (mostly), the streets are wide enough, and most journeys in London", "start": 282.32, "duration": 4.72}, {"text": "are a perfectly bikeable less than 2 miles.", "start": 287.04, "duration": 2.3}, {"text": "It was totally doable. They had to do it soon, and they had to do it now.", "start": 290.04, "duration": 3.94}, {"text": "Nearly more than 7 years later, Ken Livingstone stole an idea from Paris: The Cycle Hire Scheme.", "start": 294.84, "duration": 4.68}, {"text": "Docking stations were to be planted all over central London", "start": 299.82, "duration": 2.56}, {"text": "with bikes that were too heavy and conspicuous to want to steal.", "start": 302.38, "duration": 2.68}, {"text": "And anyone with a bank card and a pair of legs could hire them for a small fee.", "start": 305.06, "duration": 3.3}, {"text": "It took until 2010 for the scheme to get going, by which time London had a new mayor whose idea it wasn't", "start": 308.76, "duration": 5.3}, {"text": "giving the scheme the misleading but memorable and durable nickname \"Boris Bikes\".", "start": 314.32, "duration": 3.72}, {"text": "They were an instant smash, popular with locals and wobbly tourists alike.", "start": 318.42, "duration": 3.88}, {"text": "They helped promote the idea that urban cycling wasn't just for lycra-clad enthusiasts, but for everybody.", "start": 322.3, "duration": 5.64}, {"text": "With so many new wibbly wobblies on the road, it was more important than ever that London had", "start": 328.38, "duration": 4.28}, {"text": "safe streets to cycle on. And so, that very same year, along came the Mayor's most boldest plan so far:", "start": 332.66, "duration": 5.28}, {"text": "The Cycle Superhighways.", "start": 337.96, "duration": 1.76}, {"text": "This was a new special type of bicycle motorway for commuters that was long distance, clearly labelled,", "start": 340.4, "duration": 4.6}, {"text": "and painted luminous bright blue to match the colour of Barclays who were sponsoring the whole thing.", "start": 345.0, "duration": 4.08}, {"text": "12 cycle superhighways were planned, numbered like hours on a clock radiating out from central London.", "start": 349.46, "duration": 5.28}, {"text": "The first to open in 2010 was CS7", "start": 355.1, "duration": 2.08}, {"text": "which went over the underused Southwark Bridge, squiggled around Elephant and Castle", "start": 357.18, "duration": 2.84}, {"text": "and followed the Northern line all the way down to Colliers Wood.", "start": 360.02, "duration": 2.54}, {"text": "Next came CS2 which went east from Aldgate, through Whitechapel, up to the future Olympic Park at Stratford.", "start": 362.56, "duration": 5.92}, {"text": "But were these superhighways any good? Er... no.", "start": 369.12, "duration": 3.28}, {"text": "- Although very...\n- AAAARGH!!", "start": 372.4, "duration": 1.12}, {"text": "AAARGH!! ... although very well signposted and a lovely shade of blue,", "start": 373.52, "duration": 3.82}, {"text": "there was nothing to physically separate cyclists from passing cars, buses and lorries.", "start": 377.34, "duration": 3.8}, {"text": "Sometimes the blue paint would stop abruptly, or merge with a bus lane or fill up with parked cars.", "start": 381.14, "duration": 5.14}, {"text": "Timid new cyclists, the very people this scheme was designed to make feel safe, didn't feel safe at all.", "start": 386.28, "duration": 5.46}, {"text": "More worryingly, newish and confidentish cyclists were lulled into a false sense of security.", "start": 391.74, "duration": 4.98}, {"text": "They'd start on an easy bit, and then when the blue paint ran out, splat.", "start": 396.72, "duration": 3.48}, {"text": "Venera Minachmetova, a 24 year old Russian businesswoman was killed by a lorry", "start": 400.2, "duration": 4.5}, {"text": "at the notoriously inadequate Bow Interchange, one of 5 cyclists to die on the capital's streets in just 2 weeks.", "start": 404.7, "duration": 5.58}, {"text": "It led to protests calling for the Mayor and TfL to stop killing cyclists.", "start": 410.28, "duration": 4.16}, {"text": "A closer look at the original Superhighway designs reveals that they were dangerously ill-thought through.", "start": 414.44, "duration": 5.1}, {"text": "According to this map, CS11 was supposed to go up the very narrow Kilburn High Road.", "start": 419.54, "duration": 4.32}, {"text": "And where exactly was that meant to go?", "start": 424.32, "duration": 2.56}, {"text": "So TfL went back to the drawing board and took it more seriously this time.", "start": 426.88, "duration": 3.44}, {"text": "The next generation of cycle superhighways from 2013 onwards was a massive improvement.", "start": 430.32, "duration": 5.0}, {"text": "Physically separated from traffic with features like dedicated traffic lights and floating bus stops,", "start": 435.32, "duration": 4.48}, {"text": "these were proper cycle paths, worthy of the Dutch.", "start": 439.8, "duration": 2.72}, {"text": "Have these new superhighways been a success? \nF*** yes!", "start": 442.52, "duration": 2.94}, {"text": "Cycling on these routes has increased a whopping 60%. At rush hour 60% of all journeys are bikes.", "start": 445.46, "duration": 5.78}, {"text": "They even have cycling traffic jams. It demonstrates quite demonstrably that if you build it, they will come.", "start": 451.24, "duration": 5.76}, {"text": "Spurred on by the success of the cycle superhighways, the city was starting to send itself cycling silly. Look!", "start": 457.0, "duration": 5.56}, {"text": "Torrington Place is closed to cars westbound.", "start": 462.56, "duration": 2.48}, {"text": "Look! Bank junction is buses and bikes only on weekdays.", "start": 465.04, "duration": 3.66}, {"text": "Look! Camden are filling their streets with armadillos. ARMADILLOS!", "start": 468.7, "duration": 4.16}, {"text": "We're even starting to correct our mistakes from the 60s, turning former big scary roundabouts", "start": 472.86, "duration": 4.02}, {"text": "into much safer, albeit confusing two-way, inside out, question mark shaped junctions.", "start": 476.88, "duration": 3.9}, {"text": "in Archway, Elephant and Castle, Waterloo, not Hammersmith though - it's too late for Hammersmith.", "start": 480.78, "duration": 6.28}, {"text": "So everybody's happy... or are they?", "start": 487.48, "duration": 2.48}, {"text": "The cycling revolution has attracted criticism from some groups like... (game show buzzer)", "start": 489.96, "duration": 3.62}, {"text": "- Ooh, bad luck, and you're out of time.", "start": 495.38, "duration": 2.56}, {"text": "But you did very well. You did the history, you did the Superhighways, you even went to Amsterdam.", "start": 497.94, "duration": 6.28}, {"text": "But there's still so much more to talk about. Will you come back for part 2?", "start": 504.22, "duration": 4.4}, {"text": "- Er, yes I will.\n- Excellent! We look forward to it, don't we?", "start": 508.62, "duration": 3.2}, {"text": "See you after the break!", "start": 512.1, "duration": 1.6}, {"text": "♫ ♫ ♫", "start": 514.12, "duration": 2.04}]