[{"text": "PC gaming hardware is expensive, right?", "start": 0.24, "duration": 3.14}, {"text": "A Core i7 Extreme Edition: $1600. 2 Terabyte 960 Pro NVMe Drive $1,300.", "start": 3.38, "duration": 11.12}, {"text": "Two GTX Titan X PPs we got at $2,400, you add a 128 gigs of RAM,", "start": 14.5, "duration": 8.02}, {"text": "as well as a top-of-the-line motherboard, and yeah... That'll be $6,800, please.", "start": 22.54, "duration": 7.16}, {"text": "Now, to be clear, I'm not complaining. This is a spectacularly first world problem,", "start": 30.18, "duration": 5.9}, {"text": "but pro video production gear is on a whole freakin other level.", "start": 36.08, "duration": 4.76}, {"text": "Let me put it in perspective: this one PCI Express card costs as much as all that stuff I just listed combined.", "start": 40.84, "duration": 11.08}, {"text": "All of it! This is the Red Rocket X, a state-of-the-art creation tool and simultaneously a relic of a bygone era.", "start": 51.92, "duration": 10.06}, {"text": "A $7000 coprocessor card. Welcome to Holy $H!T!", "start": 62.28, "duration": 7.26}, {"text": "[intro music]", "start": 69.74, "duration": 9.4}, {"text": "Cooler Master's 25th anniversary Edition Cosmos 2 features a unique dual curved tempered glass side panel", "start": 79.96, "duration": 9.08}, {"text": "Check it out now at the link below.", "start": 89.04, "duration": 3.16}, {"text": "Ok so as many of you are probably aware,", "start": 92.82, "duration": 2.32}, {"text": "we moved to Red Digital cinema cameras earlier this year in an effort to bump up our production values.", "start": 95.14, "duration": 5.089}, {"text": "And I mean let's be honest, we're enthusiasts to give Brandon and Mack some new toys to play with.", "start": 100.229, "duration": 4.831}, {"text": "But have you ever actually tried to work with Red Code raw footage before?", "start": 105.3, "duration": 4.94}, {"text": "As Taryn would put it, it's a nightmare!", "start": 110.44, "duration": 3.66}, {"text": "At full 8K, on a 10 core Extreme edition processor, with a $5,000 Nvidia Quadro P6000 graphics card,", "start": 114.72, "duration": 9.96}, {"text": "this is what timeline performance looks like. You see those delays as I'm scrubbing around?", "start": 124.68, "duration": 6.46}, {"text": "And even straight playback performance is abominable.", "start": 131.24, "duration": 5.94}, {"text": "It's not like it's our 10 gigabit network connection bottlenecking us either.", "start": 137.18, "duration": 4.32}, {"text": "We're nowhere near saturating it.", "start": 141.5, "duration": 2.1}, {"text": "No, it's the CPU!", "start": 144.12, "duration": 3.67}, {"text": "Even though we're scaling across all 20 of our threads, we are still running out of processing power,", "start": 147.79, "duration": 7.79}, {"text": "and we haven't even added any Lumetri Color, yet either. That's only going to make matters worse.", "start": 155.58, "duration": 8.22}, {"text": "Throw that into the picture and now we are dropping about 90% of our frames,", "start": 164.16, "duration": 7.2}, {"text": "while dealing with 1/4 to 1/3 of a second delay,", "start": 171.36, "duration": 4.94}, {"text": "when we're trying to move the playhead around on the timeline.", "start": 176.3, "duration": 3.58}, {"text": "Ridiculous! And both our CPU and GPU are basically maxed.", "start": 180.44, "duration": 4.8}, {"text": "You actually need to drop your preview quality all the way down to 1/8,", "start": 185.24, "duration": 5.06}, {"text": "in order to get what I would consider to be acceptable performance with much lower usage.", "start": 190.3, "duration": 6.88}, {"text": "True to form though, Red Digital cinema has a solution for you!", "start": 197.58, "duration": 4.78}, {"text": "Are you unhappy with your editing experience or the footage from your $50,000 camera?", "start": 202.36, "duration": 6.64}, {"text": "Buy this expansion card to accelerate it!", "start": 209.02, "duration": 3.56}, {"text": "Available now for 7,000 easy payments of only $1! Call now and we'll throw in this... nothing!", "start": 212.58, "duration": 7.02}, {"text": "Absolutely free because we're Red and f'ing your wallet is more than just our job, it's our passion.", "start": 219.78, "duration": 6.94}, {"text": "But what is this thing? What does it even do? Well, we can figure out a little bit on our own.", "start": 226.72, "duration": 7.74}, {"text": "So there's some kind of processor here that's under 150 watts of total power consumption,", "start": 234.48, "duration": 6.38}, {"text": "based on the single slot cooler and the single six pin power connector back here.", "start": 240.86, "duration": 5.1}, {"text": "There's some memory on board, so we can see those chips arranged around the chip here.", "start": 245.98, "duration": 5.46}, {"text": "And the dual Displayport ports are so it can actually function as a video output device.", "start": 251.44, "duration": 6.5}, {"text": "Though, our workload necessitates a powerful GPU anyway. So we won't be using it that way.", "start": 257.94, "duration": 6.6}, {"text": "And the main purpose of this thing, anyway, is to accelerate:", "start": 264.54, "duration": 3.98}, {"text": "decoding, scaling and debayering of our 3D files.", "start": 268.52, "duration": 5.68}, {"text": "The first two, I think are fairly self-explanatory.", "start": 274.2, "duration": 2.7}, {"text": "But the last one is the process of reconstructing a full-color image from incomplete color samples", "start": 276.9, "duration": 7.84}, {"text": "that are captured by the sensor in a raw recording format.", "start": 284.74, "duration": 3.96}, {"text": "But they give us no actual details about the hardware,", "start": 288.7, "duration": 4.98}, {"text": "other than some nebulous 5x performance claim relative to their own first-generation Red Rocket.", "start": 293.68, "duration": 8.7}, {"text": "But why would this older chip based on older process node technology", "start": 302.4, "duration": 5.86}, {"text": "compare to a GPU running CUDA be better at any of that stuff.", "start": 308.26, "duration": 6.54}, {"text": "I mean Red even supports CUDA acceleration in their own Cine X desktop application.", "start": 314.82, "duration": 7.66}, {"text": "Is this thing even relevant today? So, with it installed, we throw on the latest drivers and ...", "start": 322.75, "duration": 5.69}, {"text": "I don't know. It's kind of... it's kind of weird.", "start": 329.5, "duration": 2.44}, {"text": "There's no configuration utility or anything like that, but if you go into device manager,", "start": 331.94, "duration": 5.66}, {"text": "it's working properly and everything seems fine,", "start": 337.6, "duration": 4.62}, {"text": "so all that's left to do then, is go into our video editing software and press enable!", "start": 342.24, "duration": 7.2}, {"text": "So this is the same project that we were just looking at,", "start": 349.46, "duration": 3.98}, {"text": "and we're going to change this \"use Rocket\" drop-down to all available.", "start": 353.44, "duration": 4.74}, {"text": "At full quality, my CPU is still tilt and now I'm seeing 90% GPU usage even with Lumetri color disabled. What?", "start": 358.86, "duration": 14.42}, {"text": "Okay, well now hold on just a minute here.", "start": 375.24, "duration": 4.58}, {"text": "Surely there must be something wrong", "start": 380.2, "duration": 2.66}, {"text": "Let's try disabling the Rocket,", "start": 383.28, "duration": 3.12}, {"text": "just to see if we can get back to where we started.", "start": 387.24, "duration": 2.34}, {"text": "Now, hold on... this doesn't make sense either.", "start": 389.82, "duration": 3.18}, {"text": "With it disabled our timeline scrubbing looks better than ever,", "start": 393.0, "duration": 5.48}, {"text": "our CPU usage is way down and even our GPU usage is under control now.", "start": 398.48, "duration": 7.48}, {"text": "But we are still dropping some frames, far fewer though.", "start": 407.24, "duration": 3.6}, {"text": "Well Red only advertises the Rocket X of being capable of handling up to 6K footage.", "start": 410.86, "duration": 6.22}, {"text": "So maybe what we're looking at here makes sense, if somehow it's enabled.", "start": 417.08, "duration": 5.62}, {"text": "Dropping then down to half quality in the preview window yields perfect playback without Lumetri color.", "start": 422.78, "duration": 8.28}, {"text": "Let's check that out.", "start": 431.24, "duration": 2.0}, {"text": "Ok.", "start": 434.72, "duration": 1.0}, {"text": "And... alright turning it on... well, it looks like we are still dropping some frames in that case.", "start": 436.32, "duration": 8.06}, {"text": "But that's probably caused then by a GPU bottleneck,", "start": 444.78, "duration": 3.84}, {"text": "because you can see our Quadro is sitting at around 80 to 85% usage.", "start": 448.62, "duration": 5.3}, {"text": "So, then finally as a last step, we drop down to 1/4 quality.", "start": 454.28, "duration": 4.68}, {"text": "And that's looking great!", "start": 460.34, "duration": 2.58}, {"text": "Acceptable CPU and GPU usage and a much nicer looking timeline", "start": 462.92, "duration": 6.5}, {"text": "than what we were able to achieve without the Red Rocket X.", "start": 469.42, "duration": 5.06}, {"text": "But in a lot of ways, this actually raises a lot more questions than it answers.", "start": 475.76, "duration": 8.32}, {"text": "Why would disabling our add-in card give me the best possible editing experience?", "start": 484.24, "duration": 5.96}, {"text": "Is it just a snake-oil hardware key to run an improved GPU acceleration algorithm?", "start": 490.2, "duration": 6.54}, {"text": "So I actually spent a couple of weeks investigating this,", "start": 497.32, "duration": 4.44}, {"text": "because timeline performance has genuinely been an issue for us", "start": 501.76, "duration": 4.12}, {"text": "But, investing in one of these for each of our editors,", "start": 505.88, "duration": 4.48}, {"text": "would be a whopping $35,000 total and here's what I found.", "start": 510.36, "duration": 5.56}, {"text": "First, some backup for what we already knew.", "start": 516.68, "duration": 2.52}, {"text": "Without the Red Rocket X Red Coat raw footage loves CPU cores,", "start": 519.2, "duration": 5.72}, {"text": "knocking my extreme edition down to six cores yielded dropped frames even at only one-quarter quality.", "start": 524.92, "duration": 7.46}, {"text": "But more cores only carries you so far. A 22 core Xeon like this cost more,", "start": 532.4, "duration": 6.68}, {"text": "significantly slashes single core performance,", "start": 539.08, "duration": 3.48}, {"text": "and doesn't even approach the performance improvement from the Rocket X installed,", "start": 542.56, "duration": 5.36}, {"text": "but disabled in Premiere.", "start": 547.92, "duration": 2.46}, {"text": "So then, the ideal 8K video editing configuration is a 10 core with a Quadro and a Red Rocket X disabled, right?", "start": 550.64, "duration": 10.08}, {"text": "Maybe not.", "start": 561.56, "duration": 1.52}, {"text": "Is the Quadro at over four times the price", "start": 563.08, "duration": 3.38}, {"text": "really accelerating this process any better than a high-end Geforce card would?", "start": 566.46, "duration": 4.78}, {"text": "We'll be moving to an HDR workflow sometime in Q4. Expect an update on that.", "start": 571.66, "duration": 5.04}, {"text": "So we need 10-bit color over Displayport, a traditional Quadro feature,", "start": 576.7, "duration": 5.46}, {"text": "but that was actually added to Geforce a while back.", "start": 582.16, "duration": 3.84}, {"text": "And the results here are fascinating.", "start": 586.67, "duration": 2.23}, {"text": "Our Titan X Pascal, despite it's nearly identical on paper specs to our Quadro P6000,", "start": 588.9, "duration": 8.22}, {"text": "is able to use its sky high, nearly 1800 Megahertz boost clocks to reduce GPU usage,", "start": 597.12, "duration": 7.94}, {"text": "lower our drop frames and even drop CPU usage a little bit, at our target 1/4 playback quality.", "start": 605.08, "duration": 7.56}, {"text": "It even almost managed to pull off half playback quality.", "start": 612.64, "duration": 5.12}, {"text": "Both GPUs, by the way, were run with their power sliders cranked and power saving mode disabled.", "start": 618.08, "duration": 5.74}, {"text": "So then having finished running all of these numbers,", "start": 624.76, "duration": 3.18}, {"text": "I came to the same conclusion that Red support did get back and give me:", "start": 627.94, "duration": 3.94}, {"text": "Premiere is just being Premiere, disabled is enabled and enabled is borked.", "start": 631.88, "duration": 6.34}, {"text": "And as for an optimal workstation configuration,", "start": 638.22, "duration": 3.58}, {"text": "well it turns out the Rocket X does do something for users with 8k footage, even though it's not rated for it.", "start": 641.8, "duration": 7.9}, {"text": "But for the difference that it provides, I'm not going to invest that much just to get a bump in preview quality.", "start": 649.7, "duration": 7.58}, {"text": "Do you ever find yourself thinking about the privacy of your information when you're making purchases online?", "start": 658.22, "duration": 6.1}, {"text": "Well privacy.com is a great way to control and protect your online spending.", "start": 664.36, "duration": 4.42}, {"text": "They offer the ability to set up virtual burner cards,", "start": 668.78, "duration": 3.62}, {"text": "which allow you to hide sensitive information and cut off specific points of spending immediately,", "start": 672.4, "duration": 6.72}, {"text": "without interfering with the places that you make online purchases.", "start": 679.12, "duration": 4.26}, {"text": "Two of the best features of privacy.com are the ability to set charge limits per transaction, per day and per year,", "start": 683.4, "duration": 7.96}, {"text": "and you can close any card with just a click.", "start": 691.38, "duration": 4.18}, {"text": "They've also got their private payments feature, which masks your spending,", "start": 695.74, "duration": 4.24}, {"text": "because it's nobody's business what you're buying", "start": 699.98, "duration": 2.5}, {"text": "and their browser extension automatically detects checkout fields on a web page,", "start": 702.48, "duration": 4.72}, {"text": "so with just two clicks you can create and autofill a dynamic number into the checkout form.", "start": 707.2, "duration": 7.38}, {"text": "So, head over to privacy.com/linus or click the link in the video description.", "start": 714.58, "duration": 5.06}, {"text": "As a special offer Privacy will be randomly selecting 50 of those who sign up via privacy.com/linus", "start": 719.64, "duration": 7.1}, {"text": "and crediting 50 bucks to their privacy.com accounts to spend whenever.", "start": 726.76, "duration": 4.92}, {"text": "That's like a Rival 300 mouse or a cheap mechanical keyboard... for nothing!", "start": 731.7, "duration": 4.78}, {"text": "So thanks for watching guys if you dislike this video you can hit that button.", "start": 737.16, "duration": 2.82}, {"text": "But if you liked it, hit the like button, get subscribed,", "start": 739.989, "duration": 2.231}, {"text": "maybe consider checking out where to buy the stuff we featured at the link in the video description.", "start": 742.22, "duration": 5.08}, {"text": "Also down there is our community forum which you should totally join,", "start": 747.32, "duration": 3.22}, {"text": "as well as our merch store, which has cool shirts like this one.", "start": 750.54, "duration": 2.64}]