[{"text": "So, I've been reading a lot of self-help books lately,", "start": 0.02, "duration": 2.4}, {"text": "not just 'cause it's my job and I'm fascinated with self-improvement, but 'cause...", "start": 2.42, "duration": 4.6}, {"text": "Fix me! Please, any of you, fix me!", "start": 7.08, "duration": 2.88}, {"text": "*cries* I'm broken... *sobs*", "start": 9.96, "duration": 2.92}, {"text": "And one that I read, that was incredibly thought-provoking", "start": 13.06, "duration": 2.52}, {"text": "was Brené Brown's \"The Power of Vulnerability\".", "start": 15.58, "duration": 3.02}, {"text": "Though the book has a lot of amazing insights, the one I want to talk about today is about play.", "start": 18.6, "duration": 5.0}, {"text": "So Brené's research stresses the importance of creative play to lead a life of joy.", "start": 23.6, "duration": 5.34}, {"text": "And what I actually found most surprising, is that she states that unharnessed creativity doesn't actually go anywhere.", "start": 28.94, "duration": 6.14}, {"text": "Instead, if you're not utilizing your creative self,", "start": 35.08, "duration": 2.84}, {"text": "it manifests itself as stress, judgment, anxiety and so much more awful stuff.", "start": 37.92, "duration": 5.12}, {"text": "And I thought this explains so much to me, because you know people who are like...", "start": 43.04, "duration": 4.32}, {"text": "Oh. Wow. No, I don't do any of that losery stuff.", "start": 47.36, "duration": 3.22}, {"text": "I mean, painting is just pointless, and dancing makes you look dumb, and pottery is just for idiots.", "start": 50.58, "duration": 5.26}, {"text": "I mean, I'm a super serious lawyer and I do incredibly serious lawyer stuff.", "start": 55.84, "duration": 4.04}, {"text": "I feel like we all know someone who just totally looks down on any kind of hobby or creative endeavor.", "start": 59.88, "duration": 5.9}, {"text": "And they're all just kind of bitter, right? And I was like....", "start": 65.78, "duration": 3.22}, {"text": "Oh, this is why, because they're not being creative.", "start": 69.06, "duration": 2.46}, {"text": "So all this repressed energy is just making them very unpleasant.", "start": 71.52, "duration": 3.86}, {"text": "And I know what you're thinking...", "start": 75.62, "duration": 1.14}, {"text": "Anna, you're just saying that because it's your job to be creative.", "start": 76.76, "duration": 2.96}, {"text": "I mean, some of us don't have that luxury.", "start": 79.86, "duration": 1.24}, {"text": "Some of us have- have families,\ncareers in non-creative fields,", "start": 81.1, "duration": 3.84}, {"text": "and like hundreds of cats to take care of.", "start": 84.94, "duration": 2.52}, {"text": "First of all, you can play with your cats.", "start": 87.46, "duration": 1.52}, {"text": "And second, if you have a career in a creative field,", "start": 88.98, "duration": 2.44}, {"text": "I don't think that necessarily means you're using your creative energy.", "start": 91.42, "duration": 4.18}, {"text": "Let me explain.", "start": 95.6, "duration": 0.78}, {"text": "So Brené Brown describes two factors that determine play.", "start": 96.38, "duration": 3.56}, {"text": "They are: one, you never want it to end,", "start": 99.98, "duration": 2.42}, {"text": "and two, it has no discernible purpose.", "start": 102.4, "duration": 3.0}, {"text": "And when I heard this, I was like, wow,", "start": 105.4, "duration": 1.98}, {"text": "I don't know what in my life actually meets these two categories.", "start": 107.38, "duration": 3.6}, {"text": "Even though I get to be creative all the time, it doesn't necessarily feel like play?", "start": 111.06, "duration": 3.84}, {"text": "I mean it kind of feels like work.", "start": 114.9, "duration": 1.94}, {"text": "And sometimes I resent creativity, because", "start": 116.86, "duration": 2.04}, {"text": "there's so much pressure to be imaginative in order to be relevant or successful, which is not fun.", "start": 118.9, "duration": 5.12}, {"text": "It just feels like you're going insane.", "start": 124.02, "duration": 1.78}, {"text": "Okay! So are we gonna do this sketch about dicks this week?", "start": 125.81, "duration": 2.219}, {"text": "Well, we've never approached it from a satirical angle.", "start": 128.03, "duration": 2.33}, {"text": "Exactly! How I feel about dick pics is more of a confessional vlog style.", "start": 130.36, "duration": 3.58}, {"text": "\"here's what i'll do to your dick\", is a public service announcement", "start": 134.1, "duration": 2.66}, {"text": "that satirizes violence against fruits and vegetables, in an effort to demonstrate how ludicrous it is", "start": 136.76, "duration": 5.22}, {"text": "to send a photo of your genitalia to someone you don't know as a courting favor.", "start": 141.98, "duration": 3.06}, {"text": "I just don't think that dicks are on trend anymore. And if we want to...", "start": 145.04, "duration": 3.0}, {"text": "*talking over each other*", "start": 148.04, "duration": 3.26}, {"text": "Can we settle on like one idea? Just one idea, cats or dicks. That's all we have, cats or dicks.", "start": 151.3, "duration": 4.88}, {"text": "And I've started to make Brunei's stressed importance on play a huge factor in my life.", "start": 156.18, "duration": 4.24}, {"text": "Because I've definitely felt myself over time, become judgmental or bitter or anxious,", "start": 160.42, "duration": 4.8}, {"text": "if I'm not doing anything that brings me joy.", "start": 165.22, "duration": 2.08}, {"text": "I mean that just makes a lot of sense, right?", "start": 167.3, "duration": 2.7}, {"text": "And who wants to hang out with someone who's all those things?", "start": 170.02, "duration": 2.38}, {"text": "So recently, I've written down what is play for me?", "start": 172.52, "duration": 2.58}, {"text": "What do I love and I never want to end that has no discernible purpose other than it's fun?", "start": 175.1, "duration": 4.8}, {"text": "So I've been trying to dive more into like animation with poems like, \"The Moment I Threw Your Toothbrush Away\" and \"p a l i n d r o m e\".", "start": 179.9, "duration": 5.78}, {"text": "And I'm also doing a stop-motion project called allure that I'm incredibly excited about.", "start": 185.68, "duration": 2.94}, {"text": "And now you guys may think...", "start": 188.62, "duration": 2.06}, {"text": "Erm, hey! Those sound like they have a discernible purpose. As in, they're going on your channel.", "start": 190.68, "duration": 4.56}, {"text": "Yes, you're technically right.", "start": 195.24, "duration": 1.78}, {"text": "I will definitely put them up, but they don't have a real purpose,", "start": 197.04, "duration": 2.68}, {"text": "because they're kind of just one offs that I'm sinking money into", "start": 199.72, "duration": 2.8}, {"text": "that I can't necessarily make it to a bigger property.", "start": 202.52, "duration": 1.92}, {"text": "So they're purely passion projects and I've started to rediscover how much I really love animation.", "start": 204.44, "duration": 6.26}, {"text": "When I was a teenager,", "start": 210.7, "duration": 1.0}, {"text": "I actually wanted to be an animator at like Pixar or Disney.", "start": 211.7, "duration": 3.7}, {"text": "And I would pull all of these unintentional all-nighters,", "start": 215.4, "duration": 2.58}, {"text": "because I loved drawing so much.", "start": 217.98, "duration": 1.78}, {"text": "And though I'm not animating these personally,", "start": 219.78, "duration": 2.7}, {"text": "the process of making something from absolutely nothing come to life is still so wild and awesome to me.", "start": 222.48, "duration": 6.72}, {"text": "And beyond that, of course, I've tried to think of activities that fall into these categories.", "start": 229.2, "duration": 3.2}, {"text": "Like Nerf gun fights, hiking, camping, crafting,", "start": 232.4, "duration": 3.38}, {"text": "and trying to be much more engaged in those activities.", "start": 235.78, "duration": 3.08}, {"text": "To give myself more joy.", "start": 238.86, "duration": 2.18}, {"text": "But what about you? What activities are play for you?", "start": 241.04, "duration": 2.08}, {"text": "And are you doing them enough or are you doing them at all?", "start": 243.18, "duration": 2.74}, {"text": "I'm Anna Akana, stay right here for an animated ad from Miss Bethany Radloff.", "start": 246.04, "duration": 4.34}, {"text": "Thank you to SquareSpace for sponsoring today's video.", "start": 250.38, "duration": 2.76}, {"text": "SquareSpace has beautiful award-winning templates and in all-in-one platform.", "start": 253.14, "duration": 4.02}, {"text": "There's no need to install patches or upgrades ever.", "start": 257.169, "duration": 2.97}, {"text": "They also have 24-hour customer service for whenever creative inspiration strikes.", "start": 260.32, "duration": 4.96}, {"text": "And if you need a domain, they offer a simple and unique setup experience.", "start": 265.28, "duration": 3.48}, {"text": "With SquareSpace, you can create any kind of website.", "start": 268.76, "duration": 2.48}, {"text": "Whether you're an artist, photographer, or just want a to dedicate a fan page for your cats.", "start": 271.24, "duration": 3.54}, {"text": "Go to squarespace.com/anna to start your free trial today, and use the offer code \"Anna\" for 10% off at checkout.", "start": 274.9, "duration": 6.56}]