[{"text": "In Inglorious Basterds, Quentin Tarantino wrote a funny sequence where a German officer", "start": 14.86, "duration": 3.889}, {"text": "Mixes up the story of King Kong with the story of the American slave trade. Every question", "start": 18.85, "duration": 4.129}, {"text": "He asks has the same answer for both.", "start": 22.98, "duration": 2.96}, {"text": "[German]", "start": 25.94, "duration": 0.88}, {"text": "[German]", "start": 26.949, "duration": 6.98}, {"text": "[German]", "start": 35.079, "duration": 2.0}, {"text": "The German officer and in turn", "start": 37.15, "duration": 1.98}, {"text": "Tarantino clearly think King Kong is an allegory for the slave trade, yet", "start": 39.13, "duration": 3.68}, {"text": "the creators of King Kong have repeatedly denied this interpretation of the movie, saying there are no hidden meanings.", "start": 42.81, "duration": 5.43}, {"text": "It's just a story to them.", "start": 48.24, "duration": 1.72}, {"text": "This disconnect between creator and audience brings to light", "start": 49.96, "duration": 2.569}, {"text": "One of the most important questions in film discussion.", "start": 52.53, "duration": 2.73}, {"text": "Is an interpretation still valid if it's not what the artist intended?", "start": 55.26, "duration": 2.8}, {"text": "The answer has broad implications for analyzing art.", "start": 58.06, "duration": 2.4}, {"text": "If meaning is objective, then discussion becomes much more narrow.", "start": 60.46, "duration": 3.32}, {"text": "Critics must take the artist's word as law, and only look for meanings that the artist consciously intended.", "start": 63.78, "duration": 4.86}, {"text": "On the other hand, if meaning is subjective,", "start": 68.78, "duration": 2.04}, {"text": "a critic can find any message they want in a film, and that means anybody can throw around any theory", "start": 71.0, "duration": 4.38}, {"text": "They want English teachers can overanalyze curtains no matter what the artist says. So where is the line?", "start": 75.39, "duration": 5.009}, {"text": "Let's have a look at how artists talk about and make their movies to figure out the best mindset towards", "start": 80.409, "duration": 4.76}, {"text": "Analyzing into over analyzing film some directors do clearly state their intentions for a movie in a rare interview from the Coen brothers", "start": 85.27, "duration": 6.319}, {"text": "They mentioned that The Big Lebowski is based on noir detective novels from the 30s and 40s, but with a humorous twist", "start": 91.59, "duration": 5.58}, {"text": "it has the main character in over his head a", "start": 97.17, "duration": 2.25}, {"text": "Complicated and morally ambiguous narrative and an unreliable supporting cast but instead of smoking cigarettes like most noir heroes", "start": 99.639, "duration": 6.47}, {"text": "He smokes marijuana one of the several humorous twists on the conventional detective stereotypes for deeper movie ideas", "start": 106.109, "duration": 6.209}, {"text": "many directors create a movie with an idea in mind but not only will directors hide the meaning of their movies they may even film", "start": 112.319, "duration": 5.91}, {"text": "The movie deceptively in American Psycho director mary harron had William Dafoe", "start": 118.229, "duration": 3.599}, {"text": "Portrayed his character in three different ways the first way the characters thinks Patrick Bateman killed Paul Allen", "start": 122.109, "duration": 5.36}, {"text": "I just wanted to know if you know", "start": 127.469, "duration": 2.0}, {"text": "The second he thinks he didn't do it people just", "start": 130.579, "duration": 2.54}, {"text": "Disappear and the third he's unsure to think that one of his friends killed him for no reason whatsoever would be too ridiculous", "start": 133.4, "duration": 6.889}, {"text": "Isn't that right Patrick?", "start": 141.469, "duration": 2.0}, {"text": "Harran edited these poor trails together to have the character constantly switch his opinion of Bateman between takes the choice creates a movie full of", "start": 143.629, "duration": 7.009}, {"text": "Uncertainty and it adds to the frenzy toxic male dominance within the movie angly used the exact same technique in Brokeback Mountain", "start": 150.709, "duration": 6.86}, {"text": "I played it as though I knew what was going on with Jake's character Jack and that he had been cheating on me with men", "start": 157.569, "duration": 5.849}, {"text": "And I knew about the gay bashing and I also played it as though I had no idea that", "start": 163.419, "duration": 4.35}, {"text": "This is how my husband died and those takes got merged in the final film", "start": 167.93, "duration": 4.22}, {"text": "So I don't actually know Aang", "start": 172.15, "duration": 1.33}, {"text": "Knows the truth in his head and it's not important to me because I think the ambiguity is what is the strength of that scene?", "start": 173.48, "duration": 5.029}, {"text": "And what's heartbreaking about it when filmmakers create a movie with multiple meanings they tend to keep their intent a secret", "start": 178.51, "duration": 5.669}, {"text": "I'm not gonna say what it is", "start": 188.81, "duration": 1.859}, {"text": "Oh", "start": 190.669, "duration": 1.201}, {"text": "You may not I never talk about themes", "start": 191.87, "duration": 2.539}, {"text": "it's a very big shame when something is finished and then", "start": 194.84, "duration": 5.029}, {"text": "People want you to translate it back into words. It never will work", "start": 200.18, "duration": 4.16}, {"text": "It never will go back into words and be what the film is. It's like describing a piece of music", "start": 204.34, "duration": 6.419}, {"text": "You don't hear the music. You just hear that see the words", "start": 210.759, "duration": 2.73}, {"text": "It's better to let people conjure up their own ideas having seen and experience the film", "start": 213.62, "duration": 6.319}, {"text": "I mean they want you to say I think you know", "start": 219.939, "duration": 2.669}, {"text": "This is a story of the duality of man of the duplicity of governments something like that", "start": 222.609, "duration": 4.05}, {"text": "and you know, I hear people try to do it sometimes it", "start": 226.659, "duration": 3.12}, {"text": "Usually is bullshit or if the work is good. It's it's sort of", "start": 230.449, "duration": 3.74}, {"text": "Kubrick might be the best director to look at when discussing", "start": 236.0, "duration": 2.389}, {"text": "Overanalyzing because his movies are some of the most analyzed in American cinema", "start": 238.699, "duration": 3.559}, {"text": "The documentary room 237 focuses entirely on fan theories about the shining some of the ideas suggested in the documentary are pretty ridiculous", "start": 242.439, "duration": 7.62}, {"text": "Like when they claim Kubrick airbrushed his own face into the clouds as the family drives to the hotel after hearing about his intense shooting", "start": 250.209, "duration": 6.899}, {"text": "schedules and extremely detailed production design fans have seemed to build a mythos around Kubrick believing", "start": 257.18, "duration": 5.33}, {"text": "Put specific meaning into every little thing despite all of the sort of apocryphal stories about me almost all of which are untrue", "start": 262.67, "duration": 7.079}, {"text": "You don't have unlimited resources and they do watch the budget and you know", "start": 269.75, "duration": 3.9}, {"text": "You do have to account for what you're doing the stories about cubic largely ignore how he himself described his shooting process", "start": 273.65, "duration": 5.729}, {"text": "He says he actually doesn't always put a particular meaning in his directing choices", "start": 279.39, "duration": 3.739}, {"text": "I'm pretty good at generalized statements when I'm asked what is this but I still can't tell somebody what has the glory is about I", "start": 283.13, "duration": 6.36}, {"text": "Find it's much more of an intuitive process more like what I would imagine writing music is like rather than a sort of", "start": 289.74, "duration": 6.109}, {"text": "Structuring an argument this intuitive approach doesn't make Kubrick's films any less meaningful", "start": 296.91, "duration": 4.22}, {"text": "It just means while he's making the movie his intent isn't always immediately obvious to him", "start": 301.28, "duration": 3.899}, {"text": "He instead makes choices that feel right instead of constantly dealing with hidden meanings", "start": 305.18, "duration": 4.5}, {"text": "I never deal with subtext when I'm writing ever ever ever. I keep it about the text", "start": 309.68, "duration": 4.859}, {"text": "I keep it about the scenario", "start": 314.54, "duration": 1.45}, {"text": "Because I know there's a lot there but I don't want to I don't want to know it right now", "start": 315.99, "duration": 3.619}, {"text": "So where does that leave room for analysis in both cases where directors hide the meaning and where they don't work with a specific meaning?", "start": 319.61, "duration": 5.699}, {"text": "In mind the viewer can't know the objective truth, but that doesn't mean analysis is hopeless the very basic things", "start": 325.31, "duration": 5.76}, {"text": "Especially from where mr. Orange is coming from I'm dying and I want to go to the hospital", "start": 331.65, "duration": 3.589}, {"text": "but just in writing those words just all this stuff just started pouring out and that was when I realized it was a", "start": 335.24, "duration": 7.649}, {"text": "Father/son story going on and in this interview Tarantino reveals a crucial truth about filmmaking", "start": 343.08, "duration": 4.789}, {"text": "He shows us how he subconsciously put a deeper meaning in his movie", "start": 347.87, "duration": 3.18}, {"text": "It doesn't matter if directors work with one meaning in mind or work purely on intuition", "start": 351.05, "duration": 3.929}, {"text": "Everybody brings their prior", "start": 355.29, "duration": 1.38}, {"text": "Experiences with them in the creative choices they make and that doesn't stop at the director every person involved in the process of filmmaking", "start": 356.67, "duration": 6.23}, {"text": "Places their worldview into the work and a good analysis reveals these hidden meanings to me. It's very obvious", "start": 362.97, "duration": 5.63}, {"text": "I mean, of course King Kong is a metaphor for the slave trade", "start": 368.6, "duration": 3.149}, {"text": "I'm not saying the makers of King Kong meant it to be that way", "start": 371.75, "duration": 2.88}, {"text": "But that's what that's the movie that they made whether they mention make it or not", "start": 374.63, "duration": 3.54}, {"text": "This analysis works because it fits with the time period the movie was made it's not only convincing but the analysis also makes the movie", "start": 378.17, "duration": 6.36}, {"text": "More impactful some interpretations seem to miss that analysis should add something meaningful to the movie in this particular interpretation", "start": 384.53, "duration": 6.719}, {"text": "King Kong shows how white people of the 1930s may have feared the free black elysion in America?", "start": 391.41, "duration": 5.759}, {"text": "not only is that interpretation well supported but it also invites the viewer to think about the movie in a fresh and", "start": 397.169, "duration": 4.98}, {"text": "Interesting way even if it is true that Kubrick airbrushed his face into the clouds", "start": 402.37, "duration": 4.19}, {"text": "How does that add to the movie and strangely enough?", "start": 406.56, "duration": 2.669}, {"text": "Maybe some stories are better enjoyed without analysis", "start": 409.229, "duration": 2.79}, {"text": "Kubrick once said if you submit to a completely logical and detailed analysis of a supernatural movie it will eventually appear absurd", "start": 412.419, "duration": 6.32}, {"text": "the true measure of a great supernatural thriller", "start": 418.81, "duration": 2.239}, {"text": "He says isn't in it's hidden meaning", "start": 421.05, "duration": 2.0}, {"text": "but in if the audience had a good fright believed the film they were watching and retained some sense of it with Brokeback Mountain the", "start": 423.06, "duration": 5.519}, {"text": "True analysis of Jack's death isn't what matters the fact that Angley leaves the audience", "start": 428.58, "duration": 4.47}, {"text": "Uncertain of Jack's fate makes his ending that much more heartbreaking. There's no sense of closure for us or for Ennis", "start": 433.36, "duration": 5.63}, {"text": "So maybe the next time you watch the ending of 2001 a Space Odyssey don't obsess over the details", "start": 438.99, "duration": 4.77}, {"text": "Kubrick actually did reveal what he was going for in that", "start": 443.94, "duration": 2.339}, {"text": "I'll link his interpretation in the description", "start": 461.53, "duration": 2.269}, {"text": "but before you click on that watch the ending one more time and think about the", "start": 463.8, "duration": 3.39}, {"text": "emotion", "start": 467.289, "duration": 0.5}, {"text": "It evokes because even with a particular meaning in mind", "start": 467.789, "duration": 2.52}, {"text": "He brick-built that ending based not around his own meaning but around how he wanted it to make you feel", "start": 470.31, "duration": 4.95}, {"text": "So when your teacher over analyzes blue curtains in a story the problem isn't that it's not what the artist meant", "start": 475.45, "duration": 5.779}, {"text": "The problem may be that the teacher got so caught up in analysis that they missed what made the book so great in the first", "start": 481.229, "duration": 5.25}, {"text": "place", "start": 486.479, "duration": 2.0}, {"text": "a", "start": 490.289, "duration": 1.63}, {"text": "Big problem with overanalyzing film comes from under researching if an analysis is", "start": 491.919, "duration": 4.459}, {"text": "Inconsistent with the rest of the movie or doesn't have a lot of concrete evidence", "start": 496.629, "duration": 2.989}, {"text": "It doesn't hold up", "start": 499.619, "duration": 1.05}, {"text": "Well in most areas of film criticism", "start": 500.669, "duration": 2.0}, {"text": "Education is key to coming up with the best", "start": 502.749, "duration": 2.0}, {"text": "analysis", "start": 504.789, "duration": 0.5}, {"text": "When it comes to actual film production the same principles apply to learn more about filming professional footage with tools", "start": 505.289, "duration": 5.339}, {"text": "You already own you can sign up for the DIY filming class on Skillshare", "start": 510.629, "duration": 3.389}, {"text": "Skillshare has over", "start": 514.209, "duration": 1.26}, {"text": "20,000 classes that cover tons of topics from business to filmmaking the first 500 people to click on the link in the description below can", "start": 515.469, "duration": 6.14}, {"text": "Get two months of completely free access to Skillshare. That's the filmmaking class plus thousands of others ranging from creative writing marketing and design", "start": 521.61, "duration": 7.109}, {"text": "Thanks for watching and thanks to Skillshare for sponsoring this video", "start": 528.73, "duration": 2.779}]