[{"text": "The Essential Phone is the new kid on the block and while I'm normally all for being nice to the new kid, the Essential's", "start": 0.03, "duration": 5.729}, {"text": "$700 price point means it wants to compete with the big boys.", "start": 5.95, "duration": 2.689}, {"text": "And it would be (??) to expect preferential treatment for such a quintessentially priced device. Let's get started.", "start": 8.639, "duration": 6.84}, {"text": "Inside the box we get a rather nice braided cable along with the USB-C", "start": 20.83, "duration": 3.409}, {"text": "dongle headphone jack which already spells bad news for the versatility of this device and of course the wall plug", "start": 24.4, "duration": 5.66}, {"text": "Here's the phone itself supposedly this device is Android, boiled down to the bare essentials", "start": 30.06, "duration": 4.199}, {"text": "Also, while calling it future-proof personally I always thought devices from the future would have more features instead of less", "start": 34.69, "duration": 6.02}, {"text": "But that might just be me. Let's start with the scratch test remember the Mohs scale of hardness is", "start": 40.71, "duration": 4.619}, {"text": "Exponential curving significantly upward as the numbers increase", "start": 45.64, "duration": 2.93}, {"text": "Build quality is one of Essential's big selling points using some of the most premium materials available in the cellphone world the Gorilla Glass 5", "start": 48.76, "duration": 6.619}, {"text": "On the screen is a good start, scratching at level 6 with a deeper groove at a level 7 the essential phone has the exact", "start": 55.379, "duration": 5.91}, {"text": "Same scratch tolerance as the Galaxy S8 and the iPhone 7. Up here at the Cyclops looking 8 megapixel front camera", "start": 61.289, "duration": 6.479}, {"text": "It's under the same glass as the screen, so it's protected as well. You might be wondering to yourself at this point", "start": 67.93, "duration": 4.909}, {"text": "Where is the earpiece on this phone is it a piezoelectric", "start": 72.84, "duration": 2.91}, {"text": "vibrator like we saw inside the Mi Mix? And no it's not, it's just a super thin little line up here at the top covered", "start": 75.97, "duration": 6.379}, {"text": "In some kind of fabric it'll be interesting to see the shape of the speaker and the audio channel configuration", "start": 82.35, "duration": 4.05}, {"text": "during the teardown", "start": 86.74, "duration": 1.01}, {"text": "because that slot is tiny. Down at the bottom of the phone how the buttons are still underneath the glass so there's nothing new to", "start": 87.75, "duration": 5.69}, {"text": "Check down here. The back of the phone though, is brilliant.", "start": 93.449, "duration": 2.631}, {"text": "I do like glass phones and the ceramic of the essential phone takes design to the next level - not only is the ceramic super reflective,", "start": 96.24, "duration": 6.54}, {"text": "but it's also super, super hard. ( ͡° ͜ʖ ͡°)", "start": 102.85, "duration": 2.239}, {"text": "We'll have to test and see if Essentials using real ceramic in a second.", "start": 105.09, "duration": 3.779}, {"text": "But since my razor blade is leaving no marks in the material, things are looking good.", "start": 108.869, "duration": 3.84}, {"text": "There are two circular holes in the top back panel", "start": 112.71, "duration": 2.519}, {"text": "I thought the modular accessory mount would be more flush like they are on Motorola's phones", "start": 115.259, "duration": 3.66}, {"text": "But these are literal holes in the phone with super strong magnets", "start": 118.92, "duration": 3.54}, {"text": "Inside kind of interesting the two circles on the opposite side of the phone are from the dual 13 megapixel cameras this part", "start": 122.59, "duration": 6.169}, {"text": "I'm not a fan of don't get me wrong", "start": 128.759, "duration": 1.831}, {"text": "I love dual camera setups the zoom lens of the iPhone 7 plus or the wide-angle lens of the LGV 30 are both amazing", "start": 130.59, "duration": 7.13}, {"text": "but I have yet to see a", "start": 137.73, "duration": 1.86}, {"text": "Monochrome picture that I just needed to have in my life the camera lens is glass so at least that's a positive", "start": 139.59, "duration": 4.97}, {"text": "Being so extremely flush with the back panel though is great aesthetically", "start": 144.63, "duration": 3.619}, {"text": "But not when you're trying to keep scratches and damage to a minimum. We'll try to solve that in a second but first", "start": 148.25, "duration": 5.16}, {"text": "Let's see if essential really used a ceramic panel", "start": 153.41, "duration": 2.789}, {"text": "Ceramic normally starts scratching at a level 8 as we learn from the ceramic Mi Mix phone last year", "start": 156.27, "duration": 4.639}, {"text": "And it looks like that same level of hardness is achieved on this essential phone", "start": 160.91, "duration": 4.049}, {"text": "No marks were left by my Mohs picks until level 8 the back panel is essentially", "start": 164.959, "duration": 4.35}, {"text": "Impervious to scratches along with the fingerprint scanner zero damage means the hardware will continue to function long into the future", "start": 169.56, "duration": 5.959}, {"text": "The sides of this phone are made from titanium which is a level 6 on Mohs scale", "start": 175.97, "duration": 4.679}, {"text": "This is not to be confused with titanium carbide which is a level 9", "start": 180.65, "duration": 3.57}, {"text": "These are two very different", "start": 184.22, "duration": 1.36}, {"text": "substances", "start": 185.58, "duration": 0.659}, {"text": "stainless steel like my razor blade is also around a level 6 and you can see the damage being done to the surface of the", "start": 186.239, "duration": 5.21}, {"text": "phone both titanium and stainless steels beat out aluminum though", "start": 191.45, "duration": 3.63}, {"text": "Which usually sits around at level 3 or 4 depending on the alloy and if all of that made sense you're probably watching too many", "start": 195.08, "duration": 5.759}, {"text": "Of my videos, it's not pure titanium though around the edge", "start": 200.84, "duration": 2.7}, {"text": "There's a pretty sweet little plastic rim plastic is much more forgiving than metal so even this minor ring pressed up against the glass", "start": 203.54, "duration": 6.22}, {"text": "Will help keep pressure off the glass during a drop if this phone survives the rest of my test and enough people request it", "start": 210.0, "duration": 5.9}, {"text": "I'd be willing to drop this phone a few times before I take it apart", "start": 215.9, "duration": 2.73}, {"text": "Let me know if you want to see a drop test down in the comments down here at the bottom of the phone we find", "start": 218.63, "duration": 3.779}, {"text": "The lack of headphone jack this phone really is just the bare essentials", "start": 222.41, "duration": 4.139}, {"text": "Which means it's barely useful if you forget to bring or charge your headphones personally, I own a ton of different wireless headphones", "start": 226.549, "duration": 6.42}, {"text": "I enjoy them", "start": 232.97, "duration": 0.66}, {"text": "but I still appreciate the convenience of my headphone jack on a regular basis the biggest downside to the glossy ceramic back is the", "start": 233.63, "duration": 6.989}, {"text": "Fingerprints and like I said earlier how the camera sits flush with the back surface one option that potentially solves both problems", "start": 240.81, "duration": 6.019}, {"text": "Is a skin this matte black skin helps keep things sleek and minimal", "start": 247.049, "duration": 3.77}, {"text": "Or if you want more of a khaleesi vibe the dragon skin also looks pretty sweet a skin raises the camera glass just enough so", "start": 250.819, "duration": 5.88}, {"text": "It's not rubbing on whatever surface you set your phone on I'll include a link to these skins down in the video description and big", "start": 256.7, "duration": 5.54}, {"text": "Thanks to D. Brand for supporting my channel and helping make this video possible", "start": 262.24, "duration": 3.12}, {"text": "Speaking of Dragonfire this 5.7 inch quad HD IPS display lasted about nine seconds under the heat from my flame not invincible", "start": 265.8, "duration": 7.54}, {"text": "But still impressive the pixels went black and turned off, but after the heat was removed", "start": 273.38, "duration": 4.3}, {"text": "They came back to life", "start": 277.699, "duration": 0.961}, {"text": "which seems to happen quite a bit north of the wall the ultimate test of build quality is the bend test the construction of the", "start": 278.66, "duration": 6.329}, {"text": "Phone says a lot about how long it will last in everyday life", "start": 284.99, "duration": 2.549}, {"text": "And this phone does feel extremely solid and heavy and that carries over into the bend test it is impressively rigid and sturdy", "start": 287.539, "duration": 7.38}, {"text": "even when flexed from both directions physically this phone passes my durability test, I'm", "start": 295.13, "duration": 4.109}, {"text": "Definitely impressed with the materials ceramic is one of my favorites", "start": 299.759, "duration": 3.29}, {"text": "But the second monochrome camera is unappealing to me that combined with a lack of headphone jack no water resistance no SD", "start": 303.05, "duration": 6.779}, {"text": "Card and no standardized wireless charging brings the uselessness level of this phone to a load that I'm not willing to accept", "start": 309.83, "duration": 5.7}, {"text": "I don't need the bare essentials. I need all of the essentials", "start": 315.63, "duration": 3.44}, {"text": "Let me know if you want to see a drop test", "start": 319.07, "duration": 1.469}, {"text": "I think I'd rather enjoy dropping this phone onto concrete", "start": 320.539, "duration": 2.309}, {"text": "Somewhere come hang out with me on Instagram and Twitter if you want to see a little preview. Thanks a ton for watching", "start": 322.949, "duration": 4.64}, {"text": "I'll see you around", "start": 327.63, "duration": 2.0}]