[{"text": "In upcoming videos, I will be having a closer look at an old smart phone,", "start": 1.06, "duration": 4.1}, {"text": "and also present you ancient electronic technologies I found in old books.", "start": 5.16, "duration": 6.14}, {"text": "So for pleasant viewing experience,", "start": 11.86, "duration": 2.96}, {"text": "I want to record the objects on a table with the camera facing them right above them.", "start": 15.2, "duration": 5.64}, {"text": "Now of course, such a shot can accomplished with a tripod.", "start": 21.84, "duration": 3.82}, {"text": "But it is certainly not the optimal solution.", "start": 25.84, "duration": 2.82}, {"text": "So in this video, I will be showing you how I created my own overhead camera rig.", "start": 29.72, "duration": 5.18}, {"text": "Which not only allows you to secure the camera right above the objects,", "start": 35.3, "duration": 4.22}, {"text": "but also features a monitor to see the camera image", "start": 39.94, "duration": 3.48}, {"text": "and two potentiometers to fine tune warm white and pure white LED strips to perfectly illuminate your shots.", "start": 43.66, "duration": 7.12}, {"text": "The rig is constructed mostly out of PVC pipes and wood, and thus is pretty simple to replicate,", "start": 51.8, "duration": 6.58}, {"text": "and also easily adjustable in size to fit your needs.", "start": 58.78, "duration": 3.9}, {"text": "So let's not waste anymore time and let me show you how I built it.", "start": 63.16, "duration": 5.16}, {"text": "🎶INTRO🎶", "start": 69.3, "duration": 9.78}, {"text": "This video is sponsored by JLCPCB.", "start": 80.44, "duration": 3.06}, {"text": "Who produce high quality single and multilayer PCBs quickly.", "start": 83.94, "duration": 4.54}, {"text": "They also offer an unbeatable price when it comes to prototype PCBs.", "start": 89.1, "duration": 4.32}, {"text": "So feel free to upload your Gerber files and test out their service today.", "start": 93.78, "duration": 5.14}, {"text": "To start off, I got myself a bunch of one meter long PVC pipes from eBay.", "start": 100.76, "duration": 5.4}, {"text": "Which come with an outer diameter of 32mm and an inner diameter of 27mm. (1.25in, 1.06in)", "start": 106.52, "duration": 6.34}, {"text": "Those will form the outer borders of the camera rig,", "start": 113.58, "duration": 3.4}, {"text": "and thus I obviously needed some couplers to interlock the PVC pipes with one another.", "start": 117.28, "duration": 6.24}, {"text": "But no matter how long I surfed on the internet, I didn't find a budget friendly version...", "start": 124.44, "duration": 5.12}, {"text": "So I designed my own couplers and model it in 3D design, sliced it, and 3D printed it with my Prusa i3 MK3.", "start": 130.3, "duration": 8.46}, {"text": "Which took around two and a half hours for one, and I needed eight of them...", "start": 139.28, "duration": 5.1}, {"text": "After a day of printing though, all of them came out pretty nicely.", "start": 145.22, "duration": 4.62}, {"text": "Which means it was time for me to head into my garage and perform the mechanical work.", "start": 150.2, "duration": 5.3}, {"text": "Before that though, I drew a blueprint with measurements for each PVC pipe.", "start": 156.48, "duration": 5.24}, {"text": "So that the rig will ultimately feature dimensions of 71 by 61 by 71 centimeter.", "start": 162.18, "duration": 6.5}, {"text": "Which might sound small, but is certainly enough for my intended shots.", "start": 169.1, "duration": 4.68}, {"text": "Now if all I wanted was a cube, it would have been easy to decide on the PVC pipe lengths.", "start": 174.36, "duration": 6.52}, {"text": "But since I also got those T pieces, which I will use to secure extra bars to mount the monitor,", "start": 181.32, "duration": 6.76}, {"text": "it took a bit more effort to calculate all the lengths.", "start": 188.44, "duration": 3.7}, {"text": "But as soon as I got all of them, I mount them onto my PVC pipes and started cutting them with a simple handsaw.", "start": 192.9, "duration": 6.94}, {"text": "This process was a bit boring... but definitely worth it.", "start": 200.68, "duration": 4.52}, {"text": "Because after also sanding the ends of the pipes, I basically got all the components for the main structure of the rig.", "start": 205.48, "duration": 7.34}, {"text": "So I added PVC glue onto two of the three links of the first coupler, and push the first two pipes onto it.", "start": 213.72, "duration": 7.84}, {"text": "While the glue was drying, I cut open a bag of sand.", "start": 222.4, "duration": 3.66}, {"text": "Which I used to fill up the rig's base PVC pipes", "start": 226.34, "duration": 3.38}, {"text": "in order to give it a lower center of mass and thus stability.", "start": 229.88, "duration": 4.32}, {"text": "Then I added the next coupler and pipe with the help of the PVC glue,", "start": 235.08, "duration": 4.66}, {"text": "filled them up with sand, and basically continued this working procedure until I got the completed base part.", "start": 240.08, "duration": 7.44}, {"text": "What I forgot though was that the lower front couplers do not require three links...", "start": 248.52, "duration": 4.94}, {"text": "but a handsaw solved this problem in no time.", "start": 253.66, "duration": 3.24}, {"text": "Next I repeated the same gluing and pressing fitting process,", "start": 257.6, "duration": 3.9}, {"text": "but without the sand in order to form the upper part of the rig.", "start": 261.82, "duration": 4.34}, {"text": "To connect the base and ceiling, I used normal sized pipes for the front, which I filled up with sand as well,", "start": 267.08, "duration": 6.98}, {"text": "but had to create special pipes with two T couplers in the middle and the bars for the monitor between them for the back.", "start": 274.38, "duration": 7.7}, {"text": "After securing this construction to the base, all I had to do was to mount the upper parts onto the whole structure.", "start": 283.14, "duration": 7.42}, {"text": "At this point, the main body of the rig was complete!", "start": 291.44, "duration": 3.62}, {"text": "So I continued with the ceiling,", "start": 295.42, "duration": 2.26}, {"text": "by bringing in a big square of 5mm thick beech plywood and a 0.8mm thick aluminum.", "start": 297.92, "duration": 7.48}, {"text": "I marked a 71 by 61 centimeter square onto both,", "start": 306.18, "duration": 4.2}, {"text": "and started creating those new shapes with a circular saw and a jig saw.", "start": 310.58, "duration": 4.52}, {"text": "Afterwards, I marked the center on both of the materials", "start": 315.8, "duration": 3.68}, {"text": "and also square around it with measurements of 15 by 12 centimeter.", "start": 319.6, "duration": 4.94}, {"text": "Which are the minimum dimensions for my camera, so that it can later look through the upper part.", "start": 325.08, "duration": 5.82}, {"text": "So I drilled through the center of the wood and aluminum, and used that as a reference point to align them on top of each other.", "start": 331.74, "duration": 8.2}, {"text": "At this point, I drilled four 4mm holes through both materials near the edges,", "start": 340.86, "duration": 5.36}, {"text": "and used those holes and M4 screws with nuts to permanently combine them.", "start": 346.58, "duration": 5.06}, {"text": "While the wood is mostly used for stability, and the aluminum will act as a heatsink for the LEDs.", "start": 352.04, "duration": 6.8}, {"text": "So next, I finally cut out the previously mentioned camera hole,", "start": 359.74, "duration": 4.18}, {"text": "and continued by bringing in another piece of beech plywood with a 10mm thickness.", "start": 364.26, "duration": 5.6}, {"text": "Out of which I created another square with dimensions of 15 by 6 centimeter.", "start": 370.26, "duration": 5.5}, {"text": "I then drilled a hole through its center, which I will later use in combination with a special camera mounting screw,", "start": 377.08, "duration": 6.22}, {"text": "and added the square with brackets and M4 screws onto the ceiling part right next to camera hole.", "start": 383.8, "duration": 6.54}, {"text": "To finish off the the ceiling, I placed it on top of the PVC pipe structure,", "start": 391.4, "duration": 4.64}, {"text": "marked a couple of holes along its edges and drilled those,", "start": 396.54, "duration": 4.06}, {"text": "so that I can later secure the ceiling to the main rig body with the help of zip ties.", "start": 400.8, "duration": 5.08}, {"text": "Last but not least for the mechanical work,", "start": 406.92, "duration": 2.36}, {"text": "I marked a 71 by 16 centimeter square onto the 10mm thick piece of beech plywood and cut it out with the circular saw as well.", "start": 409.66, "duration": 9.44}, {"text": "After marking its center point, I measured out the placement of the mounting holes of the monitor that I got from Amazon for this project.", "start": 420.3, "duration": 8.5}, {"text": "As soon as I was sure that they all featured a distance of 10 centimeter to one another,", "start": 429.68, "duration": 5.28}, {"text": "I marked them around the center of the wood and created them with a 4mm drill.", "start": 435.5, "duration": 5.18}, {"text": "After then securing the monitor to the wood and lifting this construction into place,", "start": 441.64, "duration": 5.38}, {"text": "I marked four more additional holes, which I then created in order to properly secure the monitor to the overhead camera rig with zip ties.", "start": 447.48, "duration": 9.4}, {"text": "And that means I was basically done with most of the mechanical work!", "start": 457.72, "duration": 4.62}, {"text": "And thus it was time for the electrical one,", "start": 462.58, "duration": 2.72}, {"text": "which means it was LED time!", "start": 465.58, "duration": 2.7}, {"text": "Now the LED strips I got are 6530 warm white and pure white ones.", "start": 468.68, "duration": 5.14}, {"text": "Which, not coincidentally, are the same ones I used in my portable LED panel project.", "start": 474.44, "duration": 5.66}, {"text": "From which I will also be utilizing the control electronics.", "start": 480.66, "duration": 3.6}, {"text": "So make sure to watch it if you want to understand how the dimming circuit functions.", "start": 484.62, "duration": 5.42}, {"text": "To start off though, I cut off myself four warm white, and four pure white strips with a length of 24 LEDs each.", "start": 490.62, "duration": 7.4}, {"text": "Afterwards, I secure them with their adhesive backside in alternating order on the aluminum piece of the ceiling.", "start": 498.86, "duration": 7.1}, {"text": "Additionally, I also used four smaller strips with 9 LEDs each in order to fill out the big gaps.", "start": 507.04, "duration": 7.38}, {"text": "Next, I connected the big strips with the same color temperature in parallel with a bit of wire,", "start": 515.08, "duration": 6.18}, {"text": "and then drilled another hole through the ceiling to guide the four wires through.", "start": 521.72, "duration": 5.14}, {"text": "There I tested with a 12 volt power supply whether all LEDs function correctly...", "start": 527.74, "duration": 5.16}, {"text": "which they did!", "start": 533.3, "duration": 0.98}, {"text": "So I gathered all the components for the dimming circuit, and started soldering them onto a perf board,", "start": 534.96, "duration": 6.36}, {"text": "and of course to one another according to the schematic from my LED panel project.", "start": 541.78, "duration": 5.24}, {"text": "Which I only altered slightly,", "start": 547.6, "duration": 2.06}, {"text": "by replacing the two TC4420 MOSFET drivers with one TC4427 MOSFET driver.", "start": 550.1, "duration": 7.72}, {"text": "As soon as that was done, I secured the PCB to the ceiling with screws,", "start": 559.0, "duration": 4.98}, {"text": "hooked up all the wires, and tested with a 12 volt power supply whether everything still functioned correctly.", "start": 564.46, "duration": 6.32}, {"text": "Which it still did!", "start": 571.46, "duration": 1.58}, {"text": "So to end this project, all I had to do was to secure my camera, connect it with a mini HDMI cable to the monitor,", "start": 573.78, "duration": 8.28}, {"text": "and basically start shooting some new interesting electronics content which you will hopefully enjoy!", "start": 582.28, "duration": 6.12}, {"text": "I hope you like this small project. If so, don't forget to like, share, subscribe, and hitting the notification bell.", "start": 589.46, "duration": 7.1}, {"text": "STAY CREATIVE AND I WILL SEE YOU NEXT TIME!", "start": 597.38, "duration": 4.42}]