[{"text": "So here's the thing it doesn't rain in Los Angeles. Not sure if you knew that but like never today's weather", "start": 0.34, "duration": 5.32}, {"text": "Today's weather is gonna be rai-rain? I-I don't know what to say. Uh I don't handle high-pressure well. FU-", "start": 5.68, "duration": 6.6}, {"text": "So the fact that it's raining right now as I'm recording this is, is a little bit weird", "start": 12.3, "duration": 5.04}, {"text": "Let me explain some of you might know that when I was a kid I had a secret relationship with my babysitter", "start": 17.34, "duration": 4.559}, {"text": "Excuse me what yeah, I know that might sound weird you got to watch my last babysitter video", "start": 22.21, "duration": 3.86}, {"text": "It'll make sense oh, and thanks to sugar for voicing the babysitter", "start": 26.07, "duration": 2.52}, {"text": "She's awesome. All you really got to know she was mostly there to watch my little sister and heads up", "start": 28.59, "duration": 3.659}, {"text": "This is a spoiler at the last video ended like this", "start": 32.25, "duration": 2.399}, {"text": "Yeah middle school Alex made out with a high schooler remember when I said it was crazy that it was raining out because this story...", "start": 38.5, "duration": 6.349}, {"text": "ends in the rain, and while the ending is just completely terrible. That's not how it starts so here's the story:", "start": 45.36, "duration": 6.54}, {"text": "I just got home from school with a note. She'd had her brother give me", "start": 52.56, "duration": 2.54}, {"text": "I was showing it to Bobby. \"What do you think it says?\" \"My man the little pimp I bet there's sexy pics\"", "start": 55.1, "duration": 5.88}, {"text": "No, dude. It's a handwritten note bro, I bet she sketched it herself", "start": 60.989, "duration": 4.051}, {"text": "He cracked it open and surprise: there was no pictures all it said was tomorrow at 3:00... meet me at work", "start": 65.04, "duration": 5.64}, {"text": "\"Even better she's troubled\" \"What no this isn't a booty call\" \"Yeah, bro that's where she met you ain't it?\"", "start": 70.68, "duration": 5.84}, {"text": "He had a point so the whole next day was kind of a blur all I could think about was the best place to find her power moons", "start": 76.52, "duration": 4.92}, {"text": "And I will never forget ringing that doorbell because this happened", "start": 81.82, "duration": 3.8}, {"text": "\"I don't think I can date you anymore\"", "start": 86.52, "duration": 2.0}, {"text": "\"What?\"", "start": 89.02, "duration": 1.26}, {"text": "I was devastated it was not what I was expecting. And I don't know what came over me because I didn't cry", "start": 90.28, "duration": 4.97}, {"text": "I'm just like \"I'm never gonna see her again.\" I uh- \"Wait!\" \"I really should go sorry.\" I can't believe I did this", "start": 95.3, "duration": 5.7}, {"text": "Alright you don't need to see that part, you know what you need to do? You need to make love to that like button and subscribe and-", "start": 105.72, "duration": 4.06}, {"text": "\"I uh have to think about this, sorry\"", "start": 116.07, "duration": 2.09}, {"text": "To this day no regrets. I mean if I didn't do that she never would have given it a second thought", "start": 119.28, "duration": 4.909}, {"text": "But now there was still a chance. So the next couple days half excited half wondering what was gonna happen, but then it got weird", "start": 124.189, "duration": 7.151}, {"text": "\"Hey, what's everyone whispering about?\"", "start": 133.96, "duration": 2.74}, {"text": "\"Some kids getting beat up\" \"What?\" \"Yeah, some middle schooler kissed a high schooler\" \"Has she had a boyfriend?\"", "start": 136.86, "duration": 7.22}, {"text": "\"Sucks to be him, am I right Bobby... anybody?\"", "start": 144.56, "duration": 3.72}, {"text": "\"That ain't cool, bro... we'll get revenge\"", "start": 148.46, "duration": 2.96}, {"text": "I am NOT good with face to fist action, if you don't believe me just watch my how to deal with a bully story", "start": 151.56, "duration": 4.12}, {"text": "But Bobby was dead set on revenge and it involved going to detention", "start": 155.92, "duration": 3.1}, {"text": "\"Bro I don't even have detention. I just go cuz that teacher's so dang sexy", "start": 159.08, "duration": 3.68}, {"text": "So sitting in that room was me, Bobby and a couple other kids and the sitter's brother and that's when I realized what Bobby was gonna do", "start": 162.9, "duration": 7.12}, {"text": "\"Oh, hey- no- no. What are you writing? Hey-\" \"Yo studder brother\"", "start": 170.14, "duration": 2.78}, {"text": "\"Y- y- yes yes, yes?\" \"Give this to your sis\" And just like that he was gone", "start": 173.02, "duration": 3.72}, {"text": "No matter what I said, Bobby would not tell me what was in that note even on the walk home \"That girl's evil, bro\"", "start": 176.81, "duration": 5.64}, {"text": "\"Don't worry about it\" Yeah, I was evil almost as evil as my sister", "start": 182.45, "duration": 3.929}, {"text": "\"Well hello... brother\"", "start": 186.38, "duration": 2.58}, {"text": "\"Get away from me. I do not need this right now\" \"Is somebody scared?\" \"No\" \"Do you miss your favorite sitter?\"", "start": 189.16, "duration": 7.24}, {"text": "\"What?\"", "start": 196.7, "duration": 0.64}, {"text": "\"She was my sitter MINE. Now it's because of your little 'thing' I can never see her again and now... neither can you.\"", "start": 197.36, "duration": 8.26}, {"text": "\"Wait what did you do?\" And it's right about then that it happened it started to rain", "start": 205.62, "duration": 5.78}, {"text": "\"You know what brother?\"", "start": 211.94, "duration": 1.46}, {"text": "\"Some people will believe anything\"", "start": 214.22, "duration": 3.12}, {"text": "\"If you whisper it to them\"", "start": 217.34, "duration": 1.78}, {"text": "\"You got played son\" \"Shoot, shoot, shoot, Bobby what what did that- no\" \"Uh I said, she was-\"", "start": 219.12, "duration": 4.7}, {"text": "\"-but on the plus side she still likes you.\"", "start": 225.84, "duration": 3.0}, {"text": "\"I am so screwed\"", "start": 228.94, "duration": 1.7}, {"text": "I just remember running through the rain trying to find her brother before she did. Luckily the house she was sitting at was in my neighborhood", "start": 230.64, "duration": 6.36}, {"text": "\"Hello?\" \"Is anybody there?\"", "start": 237.0, "duration": 2.0}, {"text": "\"Alex?\" \"Mrs. Haisley?\"", "start": 239.8, "duration": 3.22}, {"text": "\"What are you doing here?\" Hey, is uh is your sitter here?\"", "start": 243.02, "duration": 1.56}, {"text": "\"Are you sure you're not stalking me? Because I'm pretty sure your friend is\"", "start": 244.59, "duration": 2.849}, {"text": "\"Uh no, I just need to see the- the  sitter\" \"She's not here yet. Do you want to come in?\" \"Yes, yeah, yeah, yeah\"", "start": 248.56, "duration": 6.229}, {"text": "\"Uh sure, but your friends staying outside\"", "start": 255.849, "duration": 2.06}, {"text": "So there we are sitting in her kitchen waiting for the sitter to show up", "start": 258.789, "duration": 3.32}, {"text": "I don't know if you've ever been one of your teachers houses, but for me I was like:", "start": 262.109, "duration": 2.691}, {"text": "\"This is so weird i'm at the hot teachers house\"", "start": 264.8, "duration": 1.98}, {"text": "Just kept like playing on her computer or something then staring over at me", "start": 266.8, "duration": 2.9}, {"text": "Then going right back to working on her Squarespace website or something sidenote if you go to Squarespace.com/alex", "start": 269.7, "duration": 4.7}, {"text": "You can save 10% off your first purchase, build yourself up a website like my teacher.", "start": 274.4, "duration": 4.56}, {"text": "\"I had no idea it was so easy to build a website you get an A.\" No way around it", "start": 278.97, "duration": 3.089}, {"text": "This is a sponsored video", "start": 282.06, "duration": 0.87}, {"text": "But the cool thing about it is that I don't wanted to redo my website for a while and thanks to Squarespace", "start": 282.93, "duration": 3.479}, {"text": "I think it's gonna happen. I know you're sitting there typing in the comments \"Gee willikers Alex. That's so neat sponsored by Squarespace, whaaat?\"", "start": 286.44, "duration": 6.58}, {"text": "That's right. No plugins no updates. No patches. Ever. the last time I wrote my website", "start": 293.08, "duration": 3.92}, {"text": "I didn't know how to like code and stuff now instead I can focus on what you guys would want on a site", "start": 297.0, "duration": 4.27}, {"text": "So for real if you're gonna come to my website", "start": 301.27, "duration": 1.8}, {"text": "What would you want to see what do you want to know about me that you don't get right here?", "start": 303.07, "duration": 3.61}, {"text": "Or to build your own website like many Clarker already have visit Squarespace.com/alex. That said let's get back to the story", "start": 306.68, "duration": 5.98}, {"text": "Out of know where she says: \"I heard a rumor about a high schooler and a middle schooler. That's not you is it?\"", "start": 312.78, "duration": 6.72}, {"text": "\"Uh why?\" She comes over from the table and she goes: \"I've always found young men fascinating\"", "start": 322.44, "duration": 5.74}, {"text": "Okay stop it. You know that didn't happen", "start": 331.24, "duration": 1.82}, {"text": "I mean, maybe it did for Bobby not for me", "start": 333.06, "duration": 1.98}, {"text": "But I was a hundred percent only interested in the sitter which is why it hurts so much when this happened", "start": 335.04, "duration": 5.98}, {"text": "\"Hello?\"", "start": 344.28, "duration": 1.04}, {"text": "\"Oh my goodness\"", "start": 345.32, "duration": 1.72}, {"text": "That was the not so good phone call about my babysitter", "start": 347.04, "duration": 2.2}, {"text": "Turns out because of the rain she got into a car accident and as you can imagine", "start": 349.48, "duration": 4.1}, {"text": "There's more to the story, and I'm gonna tell you all about it in", "start": 353.74, "duration": 3.11}, {"text": "Part three. I know how much you guys love cliffhangers", "start": 357.4, "duration": 3.29}, {"text": "So you have another video to look forward to", "start": 360.69, "duration": 2.88}, {"text": "Congrats to Whovian for finding the screenshot", "start": 363.8, "duration": 2.1}, {"text": "Good luck finding this week's screenshot scroll back, rewind, find it, tweet me the picture.", "start": 365.9, "duration": 4.284}, {"text": "You guys keep messaging me saying you missed the buy one get three free sale", "start": 370.184, "duration": 3.585}, {"text": "So we're bringing it back all the info down in the description basically you pay for one and you get three more for free", "start": 373.77, "duration": 5.61}, {"text": "It's amazing! I'm It's Alex Clark, and I will see you somewhere ok? Bye", "start": 379.38, "duration": 5.92}]