[{"text": "Hey, what's up guys? Welcome back to\n\"Basics With Babish.\"", "start": 0.0, "duration": 2.8}, {"text": "Pasta...", "start": 3.12, "duration": 1.04}, {"text": "*Laughs*", "start": 5.52, "duration": 0.54}, {"text": "Hey what's up guys? Welcome back to \n\"Basics With Babish\"", "start": 6.3, "duration": 1.98}, {"text": "where this week, we're taking a look at pasta.", "start": 8.28, "duration": 2.32}, {"text": "One of the most beautiful and elegant dishes that you can create in your", "start": 10.6, "duration": 3.12}, {"text": "kitchen with little more than a table and a rolling pin.", "start": 13.72, "duration": 2.76}, {"text": "We're gonna take a look at a few ways to roll out \nand shape your pasta", "start": 16.48, "duration": 3.24}, {"text": "and a few sauces to flavour them with.", "start": 19.72, "duration": 2.04}, {"text": "Now, let's get down to basics.", "start": 21.76, "duration": 1.9}, {"text": "[Intro Music]", "start": 23.86, "duration": 10.4}, {"text": "\"Basics With Babish\" and the all new BasicsWithBabish.com are brought to you by", "start": 38.28, "duration": 3.78}, {"text": "SquareSpace!", "start": 42.08, "duration": 0.96}, {"text": "Head there now to check out recipes from the show, kitchen equipment lists,", "start": 43.04, "duration": 3.7}, {"text": "my personal blog posts, and more!", "start": 46.74, "duration": 2.0}, {"text": "Get 10% off your first SquareSpace order with offer code: BABISH", "start": 48.74, "duration": 3.38}, {"text": "Whether you need a domain, website, or online store", "start": 52.12, "duration": 2.94}, {"text": "make your next move with SquareSpace.", "start": 55.06, "duration": 2.02}, {"text": "OK, so we're gonna start off by making pasta entirely by hand. No machines involved", "start": 57.08, "duration": 4.82}, {"text": "Grandma-style, fork and egg; the whole deal.", "start": 61.9, "duration": 2.58}, {"text": "We're not going to measure anything either. This is something by feel", "start": 64.48, "duration": 3.26}, {"text": "I'm gonna start by making a mound of flour on my countertop, then I'm going to make a well in that I can crack 2 eggs inside", "start": 67.74, "duration": 6.78}, {"text": "2 to 3 eggs, depending on how much pasta you wanna make.", "start": 74.52, "duration": 3.4}, {"text": "And a little drizzle of olive oil, optionally and a little bit of salt. Then grab your fork and get to beatin' those eggs like you're making a Sunday omelet", "start": 77.94, "duration": 7.0}, {"text": "We wanna be picking up little bits of flour every time and with every stroke of the fork", "start": 84.94, "duration": 4.64}, {"text": "Dumping little bits more in there as necessary. Once  it starts to get too sticky to beat with a fork,", "start": 89.58, "duration": 5.3}, {"text": "grab a bench scraper and start folding everything towards the center.", "start": 94.9, "duration": 2.7}, {"text": "You can do this with your hands but it's a much more messy operation.", "start": 97.6, "duration": 3.78}, {"text": "Once a shaggy dough starts to form, we're gonna start kneading by hand for a solid 10 minutes.", "start": 101.38, "duration": 6.06}, {"text": "I hope it was a light day at the gym because you're going to get a little bit of an upper-body workout.", "start": 107.44, "duration": 3.88}, {"text": "We're talking 10 minutes of pressing \nthis guy into the countertop", "start": 111.32, "duration": 3.62}, {"text": "And you can see that there's a bunch of leftover flour; that's totally OK", "start": 114.94, "duration": 2.96}, {"text": "We're trying to incorporate enough flour so we get a dough that's about the consistency of Play-Doh.", "start": 117.9, "duration": 5.84}, {"text": "We want it tacky but not sticky. Smooth, supple, elastic.", "start": 123.74, "duration": 3.66}, {"text": "This is a great recipe to start learning how to not follow a recipe and do things by look and feel, smell and touch, and feel and touch are really the same thing.", "start": 127.4, "duration": 9.36}, {"text": "So, anyway, we'll be wrapping this guy in plastic wrap and letting it sit at room temperature for at least 30 minutes", "start": 136.76, "duration": 5.5}, {"text": "We want to let the gluten relax a bit before we start rolling it out.", "start": 142.26, "duration": 3.78}, {"text": "In the meantime, I'm gonna make another kind of pasta dough, a semolina pasta that is gonna be half all-purpose flour and half semolina flour.", "start": 146.04, "duration": 6.88}, {"text": "This is gonna result in a slightly different flavor, color and texture and is yet another example of how you're gonna put your own spin on this recipe.", "start": 152.92, "duration": 7.5}, {"text": "Just as before, we're dumping the flour out on a worktop, making a little mound, making a crater in the center,  dumping our eggs in, and then adding a little bit of olive oil", "start": 160.48, "duration": 8.84}, {"text": "And while we're starting the dough the same way, we're finish it, this time, just for fun, in a pasta machine", "start": 169.32, "duration": 5.0}, {"text": "Gotta make sure we're covering as many techniques as possible", "start": 174.32, "duration": 2.54}, {"text": "But, this doesn't get us out of kneading duty, so same deal as before: we're beating our egg with a fork until it can't be forked no more.", "start": 177.56, "duration": 7.0}, {"text": "Using our bench scraper to scrape everything into the center and kneading it rigorously for ten minutes", "start": 184.56, "duration": 6.14}, {"text": "Get creative, throw an elbow drop in there, and cease the kneading once the dough has become smooth and elastic", "start": 190.7, "duration": 5.52}, {"text": "Wrap in plastic wrap. You'll notice that I'm trying to get as little air in there as possible", "start": 196.22, "duration": 3.84}, {"text": "Air in this situation's gonna ruin your pasta dough", "start": 200.06, "duration": 2.86}, {"text": "All right, while that guy's resting for 30 minutes, let's get down to the old school by-hand pasta dough", "start": 202.92, "duration": 5.16}, {"text": "The first thing we're going to do is liberally flour everything;", "start": 208.08, "duration": 2.16}, {"text": "The pasta, your hands, the work surface, your rolling pin, your hair, your shoes, your dog, your cat, your goldfish", "start": 210.24, "duration": 5.96}, {"text": "Then, for a relatively small piece of dough like this one, we're gonna cut it in half.", "start": 216.2, "duration": 3.46}, {"text": "If it's a little bit bigger, (if you used 4 or 5 eggs), cut it into quarters.", "start": 219.66, "duration": 3.9}, {"text": "And now it's time to start gently rolling it out. We're gonna start by doing what we would do if we were using a pasta machine:", "start": 223.56, "duration": 5.96}, {"text": "Which is laminating the dough a little bit: rolling it out, folding it into thirds, turning it 90 degrees, rolling it out again,", "start": 229.52, "duration": 6.02}, {"text": "folding it into thirds, maybe 3 times total before we start going for the big roll; that is, rolling it out until it's nice and thin", "start": 236.1, "duration": 7.0}, {"text": "and thin enough that you can almost see your hand through it", "start": 243.1, "duration": 2.68}, {"text": "There's also advantages to different kinds of rolling pins: the dowel style I was using before is great for getting a nice even roll", "start": 245.78, "duration": 6.76}, {"text": "but a French rolling style like this that's tapered at each end kind of helps you get a more even shape because when it starts getting deformed,", "start": 253.66, "duration": 7.0}, {"text": "You can use the center of the rolling pin to roll certain parts harder than others", "start": 260.66, "duration": 3.5}, {"text": "so you can make it, at least, closer to a rectangle", "start": 264.16, "duration": 2.04}, {"text": "Once we've got the dough rolled out to our desired thickness and size, it's time to cut", "start": 266.2, "duration": 4.6}, {"text": "I'm gonna start by cutting off the rough edges to give me a nice, even rectangle.", "start": 270.8, "duration": 4.36}, {"text": "From here you could make lasagna noodles or filled pasta like ravioli or tortellini,", "start": 275.16, "duration": 4.68}, {"text": "but I'm gonna go simple today:", "start": 279.84, "duration": 1.84}, {"text": "By loosely rolling up the dough and cutting it into nice, wide fettuccine.", "start": 281.68, "duration": 4.58}, {"text": "Get a little sawing action in there with your knife 'cause you don't wanna press straight down", "start": 286.26, "duration": 3.74}, {"text": "If you find that once you're done cutting your noodles aren't unfurling properly,", "start": 290.0, "duration": 1.88}, {"text": "If you find that once you're done cutting your noodles aren't unfurling properly,", "start": 292.58, "duration": 3.0}, {"text": "just dust the dough sheet with a bit more flour before rolling it up", "start": 295.58, "duration": 4.0}, {"text": "Now we're gonna unfurl all of our noodles to make sure none of them stuck together", "start": 299.58, "duration": 3.2}, {"text": "but I'm gonna go simple today:", "start": 302.78, "duration": 5.66}, {"text": "just dust the dough sheet with a bit more flour before rolling it up", "start": 308.44, "duration": 5.18}, {"text": "Fettuccine made entirely by hand. Hang to dry or place under plastic wrap until ready to use.", "start": 313.62, "duration": 5.2}, {"text": "Now it's time to get crankin', so to speak, with our pasta maker.", "start": 318.82, "duration": 4.26}, {"text": "Start similarly by dusting half of the dough with flour, and laminating at least once before running it through the machine.", "start": 323.08, "duration": 6.14}, {"text": "Then with the pasta machine on its widest setting, it's time to start running it through.", "start": 329.22, "duration": 4.36}, {"text": "This machine's widest setting is 7, so I wanna get it down to about a two or three", "start": 333.58, "duration": 4.807}, {"text": "that means running through four to five times.", "start": 338.387, "duration": 2.733}, {"text": "Now it's going to start getting pretty long halfway through the rolling process", "start": 341.12, "duration": 3.44}, {"text": "so i recommend cutting it into two pieces", "start": 344.56, "duration": 2.0}, {"text": "and starting to work with those individually.", "start": 346.56, "duration": 2.68}, {"text": "And you can see on the thinnest setting that I wanna put it through, I think this is a two,", "start": 349.24, "duration": 3.82}, {"text": "it is thin and beautiful. Just like the stuff we rolled out by hand but we have an advantage here", "start": 353.16, "duration": 5.34}, {"text": "it is a bit more uniform than what we can do with a rolling pin so it makes it better for a ravioli", "start": 358.54, "duration": 5.08}, {"text": "or for filled pastas where you'll need very exact dimensions.", "start": 363.62, "duration": 3.3}, {"text": "But as you can see, this pasta machine, like most others, comes with a cutting attachment.", "start": 366.92, "duration": 4.38}, {"text": "So, we are going to use this to make some good ol' fashioned linguine.", "start": 371.3, "duration": 3.52}, {"text": "Now, just like when cutting by hand, you want to make sure to dust your dough with flour before running it through the blades", "start": 374.82, "duration": 6.32}, {"text": "otherwise you're going to end up pulling pasta out of the cutter and then when you try to toss your noodles with flour", "start": 381.14, "duration": 4.6}, {"text": "they get stuck together, you end up with a bird's nest, and you consider giving up cooking entirely.", "start": 385.74, "duration": 5.54}, {"text": "But, this was an actual mistake I made, I didn't do it for demonstration.", "start": 391.32, "duration": 3.66}, {"text": "I wanted you guys to see that mistakes are learning experiences.", "start": 394.98, "duration": 3.04}, {"text": "So this sheet I dusted with extra flour, and guess what? Came out perfect.", "start": 398.02, "duration": 4.76}, {"text": "Nothing stuck together and I decided to keep making the show.", "start": 402.78, "duration": 3.46}, {"text": "Just like the hand-cut stuff, we're tossing this with flour, sort of forming into a nest,", "start": 406.24, "duration": 4.44}, {"text": "and then keeping on a baking sheet under plastic wrap until we're ready to use it.", "start": 410.68, "duration": 4.0}, {"text": "You can also put these in a Ziplock bag and freeze them and then you'll have fresh pasta at the ready whenever you want it.", "start": 414.68, "duration": 6.2}, {"text": "And now it's time to finally cook the stuff. Fresh pasta cooks very quickly,", "start": 420.88, "duration": 3.98}, {"text": "so place into salted boiling water for probably no more than 90 seconds", "start": 424.86, "duration": 5.02}, {"text": "The best way to tell when it's done? Taste it. None of this throwing-it-against-the-wall crap. That doesn't work.", "start": 429.88, "duration": 4.82}, {"text": "It has always baffled me that that's a trick for testing the doneness of pasta. Just put it in your mouth!", "start": 434.7, "duration": 5.02}, {"text": "So we're going to be treating our two different kinds of pasta two different ways today.", "start": 439.72, "duration": 3.22}, {"text": "Let's start with cacio e pepe, maybe one of my favorite pastas in the entire world.", "start": 442.94, "duration": 4.26}, {"text": "I'm grating equal parts parmesan cheese. Make sure when you're shopping for it you're buying parmigiano reggiano.", "start": 447.2, "duration": 6.28}, {"text": "And then over here we've got some romano cheese. This is funkier, sharper, saltier than parmesan and it's going to make for a greater cacio e pepe.", "start": 453.48, "duration": 7.82}, {"text": "Now, I'm kind of breaking the rules a little bit here; I'm using butter. True cacio e pepe should not have butter", "start": 461.3, "duration": 4.9}, {"text": "but it's just kind of training wheels a little bit.", "start": 466.2, "duration": 2.0}, {"text": "We're also gonna use this as an opportunity to toast a little bit of freshly ground pepper before we add our cooked pasta.", "start": 468.2, "duration": 5.58}, {"text": "Try and time your pasta-cooking with the butter reaching a foamy stage", "start": 473.78, "duration": 5.04}, {"text": "You want to not have this pasta hang out in the water for a second longer than it needs to.", "start": 478.82, "duration": 4.48}, {"text": "Now we're going to add our grated cheeses, you'll notice that they're very finely grated", "start": 483.3, "duration": 3.4}, {"text": "we don't want it to be a huge effort to make these melt.", "start": 486.7, "duration": 2.0}, {"text": "And then I'll say, a solid half cup of the pasta water.", "start": 488.7, "duration": 3.48}, {"text": "Pasta water is loaded with starch and it's going to help us make a more cohesive sauce.", "start": 492.18, "duration": 4.76}, {"text": "This is honestly something you can do with almost any sauce that you're finishing pasta in.", "start": 496.94, "duration": 4.76}, {"text": "You can always add a little bit of pasta water to thicken and toss rigorously until all the cheese is melted", "start": 501.7, "duration": 5.94}, {"text": "and emulsified with the pasta water to create a creamy sauce.", "start": 507.64, "duration": 3.94}, {"text": "As is the way with all food ever made, I'm going to salt and pepper this to taste", "start": 511.58, "duration": 4.74}, {"text": "right at the end when I'm about to serve it to make sure that the seasonings are where they need to be.", "start": 516.32, "duration": 5.16}, {"text": "Always plate up your pasta with a carving fork for extra pasta XP.", "start": 521.48, "duration": 4.08}, {"text": "Twirl it into a little mound, we can go for a small portion here because this is very very rich.", "start": 525.56, "duration": 4.72}, {"text": "And it wouldn't be cacio e pepe without a little bit extra pepe.", "start": 530.28, "duration": 3.9}, {"text": "We're going to put some freshly ground pepper right on top. And there you have it, a wonderful date night pasta", "start": 534.18, "duration": 4.76}, {"text": "made by hand.", "start": 538.94, "duration": 1.28}, {"text": "But is it my favorite pasta in the world? No. My favorite is a classic from binging pasta aglio olio.", "start": 540.22, "duration": 6.92}, {"text": "A pasta I'm obsessed with for it's simplicity. A pasta", "start": 547.14, "duration": 2.0}]