[{"text": "The Samsung Galaxy Note 10+ 5G is here and could\nvery well be the pinnacle of all smart phones.", "start": 0.19, "duration": 7.34}, {"text": "Yeah, it's priced to complete with a used\nHonda Civic, or a round trip flight to Hawaii.", "start": 7.53, "duration": 4.919}, {"text": "But I mean, look at all these colors. Like\nI always say, groceries are overrated. Today", "start": 12.449, "duration": 5.531}, {"text": "we're going to see how durable Samsung's latest\nflagship really is.", "start": 17.98, "duration": 3.84}, {"text": "Let's get started.", "start": 21.82, "duration": 1.12}, {"text": "[Intro]", "start": 22.94, "duration": 6.22}, {"text": "So Samsung got a a little crazy and dropped\nthree versions of the same phone this time:", "start": 29.17, "duration": 4.389}, {"text": "the Note 10, the Note 10+, and the Note 10+\n5G. There's absolutely no reason whatsoever", "start": 33.559, "duration": 6.171}, {"text": "to buy the 5G version, which costs an extra\n$350, unless of course you already live in", "start": 39.73, "duration": 5.77}, {"text": "one of the very few 5G cities and have a 5G\nnode right outside your window. This phone", "start": 45.5, "duration": 6.01}, {"text": "will definitely live it's very full and complete\nlife span before 5G networks become a thing.", "start": 51.51, "duration": 6.09}, {"text": "One thing that differentiates this Powerpuff\nlooking contraption from other phones is the", "start": 57.6, "duration": 3.889}, {"text": "internal built-in stylus, and it's actually\none of the coolest parts of the phone. I've", "start": 61.489, "duration": 4.621}, {"text": "been tempting myself into upgrading from my\n2 ½ year old Galaxy S8 Plus just for this", "start": 66.11, "duration": 5.54}, {"text": "feature. From a business aspect, sometimes\nit's way easier to communicate with a drawing", "start": 71.65, "duration": 4.61}, {"text": "rather than just plain text...which makes\nthis built-in stylus very appealing. The soft", "start": 76.26, "duration": 4.93}, {"text": "tips are interchangeable. So if one breaks\nor gets bent or worn down, it's very easy", "start": 81.19, "duration": 4.81}, {"text": "to swap them out.", "start": 86.0, "duration": 1.62}, {"text": "The uni-body s-pen is made from blue painted\nplastic. But the most interesting parts are", "start": 87.62, "duration": 6.46}, {"text": "inside. The s-pen has internal accelerometers\nand a gyro. Also Bluetooth. All these let", "start": 94.08, "duration": 7.47}, {"text": "you control the phone from a distance with\ngestures and clicking the one little side", "start": 101.55, "duration": 4.45}, {"text": "button. The coils of wire down here near the\npressure sensitive tip doubles as a way to", "start": 106.0, "duration": 4.07}, {"text": "charge the s-pen and also generates an electromagnetic\nfield of it's own so that the phone, which", "start": 110.07, "duration": 5.76}, {"text": "also has an electromagnetic field under the\nscreen, can sense where the pen is located", "start": 115.83, "duration": 4.77}, {"text": "and exactly what it's drawing. It's a legit\ndistinguishing feature in a sea of phones", "start": 120.6, "duration": 4.65}, {"text": "that kind of all do the same thing.", "start": 125.25, "duration": 2.03}, {"text": "At the opposite end of the s-pen near the\nclicker is a capacitor. It stores about 10", "start": 127.28, "duration": 4.3}, {"text": "hours worth of energy with a 6 minute charge\nup while it's inside the phone. It's a very", "start": 131.58, "duration": 4.67}, {"text": "impressive system. I think it's time we take\na look at the other side of Rainbow Road here", "start": 136.25, "duration": 3.98}, {"text": "– the screen. [Scratching sounds]", "start": 140.23, "duration": 5.69}, {"text": "Gotta love it when companies give you free\nscreen protectors. The Galaxy Note 10+ 5G", "start": 145.92, "duration": 11.07}, {"text": "is using Gorilla Glass 6 on both the front\nand back of the phone. Have you ever noticed", "start": 156.99, "duration": 4.67}, {"text": "that it's really only the cellphone industry\nthat keeps on plopping a new number on basically", "start": 161.66, "duration": 4.28}, {"text": "the same phone year after year, and then calls\nit revolutionary? Thumbs up to Xbox PlayStation", "start": 165.94, "duration": 5.32}, {"text": "and Nintendo for being real and only releasing\nnew products when it's actually warranted", "start": 171.26, "duration": 4.82}, {"text": "– every couple years.", "start": 176.08, "duration": 1.62}, {"text": "The Gorilla Glass 6 on this Note 10 5G scratches\nat a level 6, with deeper grooves at a level", "start": 177.7, "duration": 5.78}, {"text": "7...just like last year...and the year before.\nI got a cool sapphire video coming up soon", "start": 183.48, "duration": 5.2}, {"text": "though. Don't you worry.", "start": 188.68, "duration": 2.04}, {"text": "The front facing cheerio camera is a 10 megapixel\nlittle guy and sits under the same pane of", "start": 190.72, "duration": 4.39}, {"text": "glass as the screen. Interestingly enough\nthough, there doesn't seem to be an earpiece", "start": 195.11, "duration": 4.13}, {"text": "gap up at the top. There might be a tiny little\ngap between the glass and the edge of the", "start": 199.24, "duration": 4.21}, {"text": "phone, but Samsung could also be using the\nunder display speaker tech that we saw inside", "start": 203.45, "duration": 4.5}, {"text": "of the LG G8. We'll have to take a look at\nthat from the inside to be sure though. Make", "start": 207.95, "duration": 4.6}, {"text": "sure you're subscribed for the upcoming teardown\nvideo. This no speaker grill aesthetic is", "start": 212.55, "duration": 4.45}, {"text": "pretty sleek looking. [Scratching sounds]", "start": 217.0, "duration": 8.51}, {"text": "The sides of this phone are made from aluminum.\nSamsung slipped up and said 'stainless steel'", "start": 225.51, "duration": 4.72}, {"text": "in one of their own promotional videos. But\nit's since been corrected to 'aluminum' like", "start": 230.23, "duration": 4.479}, {"text": "the rest of their flagships. Up here at the\ntop of the phone we have a lot going on. There", "start": 234.709, "duration": 5.802}, {"text": "is a layer of clear protective plastic along\nwith the SIM card tray. The little hole next", "start": 240.511, "duration": 6.159}, {"text": "to the SIM card tray is for the top stereo\nspeaker. With an expandable memory SD card", "start": 246.67, "duration": 4.77}, {"text": "slot, you can add up to one terabyte of storage,\nwhich you might not need while the phone is", "start": 251.44, "duration": 4.21}, {"text": "brand new, of course, but it's always nice\nto add more storage as your phone gets older", "start": 255.65, "duration": 4.04}, {"text": "and fills up instead of having to go delete\nthings. It also has a rubber liner around", "start": 259.69, "duration": 4.53}, {"text": "the base to satisfy the ip68 water resistance\nrating.", "start": 264.22, "duration": 3.46}, {"text": "The left side of the phone has a metal volume\nrocker, along with a single power button.", "start": 267.68, "duration": 4.769}, {"text": "Finally Bixby has left the building. Except\nfor if you hold the power button down for", "start": 272.449, "duration": 6.311}, {"text": "a fraction of a second too long, he comes\nright back.", "start": 278.76, "duration": 3.75}, {"text": "The coloring of this phone is seriously crazy.\nI feel like it belongs in Wreck-it Ralph with", "start": 282.51, "duration": 4.32}, {"text": "the sugar rush racers, instead of a business\nman's pocket. I'm still totally down though.", "start": 286.83, "duration": 6.589}, {"text": "The bottom of the phone is also made from\nmetal. No headphone jack anywhere to be found.", "start": 293.419, "duration": 4.671}, {"text": "Personally I think it's a bad move. I did\na poll on Twitter last month where 60% of", "start": 298.09, "duration": 4.42}, {"text": "you said you've used a headphone jack in the\npast week. And 60% of people on MKBHD's similar", "start": 302.51, "duration": 5.96}, {"text": "Twitter poll said a headphone jack would be\na nice bonus, or even a need. Personally,", "start": 308.47, "duration": 4.83}, {"text": "I'm all wireless at this point because exercising\nwith corded headphones is super annoying.", "start": 313.3, "duration": 4.56}, {"text": "But watching YouTube or Netflix with a tiny\nBluetooth lag is also slightly annoying. So", "start": 317.86, "duration": 5.761}, {"text": "I am sad that Jack is gone on the Note 10.\nAt least the s-pen won't get permanently stuck", "start": 323.621, "duration": 4.518}, {"text": "though in the hole if you put it in backwards.\nThat was an actual problem with the old Note", "start": 328.139, "duration": 4.661}, {"text": "5.", "start": 332.8, "duration": 1.0}, {"text": "The USB-C port on the Note 10 is rather awesome.\nIt is fully capable of super fast charging", "start": 333.8, "duration": 4.47}, {"text": "the phone with 45 watts of power. I know that\ndoesn't make a whole lot of sense with just", "start": 338.27, "duration": 4.53}, {"text": "the number. So let me draw out a comparison.\nThe Note 10 can take in a full 45 watts of", "start": 342.8, "duration": 4.899}, {"text": "power to super fast charge the battery. You\ndo got to pay a little extra for that 45 watt", "start": 347.699, "duration": 4.772}, {"text": "charger though, as Samsung only includes a\n25 watt charger in the box. 25 watts is still", "start": 352.471, "duration": 6.249}, {"text": "amazing though when you compare it to the\ncompetition.", "start": 358.72, "duration": 2.64}, {"text": "For example Apple's newest phone, the iPhone\n10s, can only fast charge with 15 watts of", "start": 361.36, "duration": 5.5}, {"text": "power. Yet Apple only includes a 5 watt charger\nin the box. That's right. The 9 watt reverse", "start": 366.86, "duration": 6.61}, {"text": "wireless charging capability on the Galaxy\nNote 10 is a faster charger than the wall", "start": 373.47, "duration": 5.09}, {"text": "plug Apple includes in the box with their\nnew iPhones. Ouch. Remember, Apple makes the", "start": 378.56, "duration": 6.109}, {"text": "jokes, I just read the spec sheet.", "start": 384.669, "duration": 2.351}, {"text": "Taking a quick look at the rear cameras, the\nNote 10 has the absolute optimal setup on", "start": 387.02, "duration": 3.989}, {"text": "the back with the 16 megapixel ultra wide\nlens up top, and a normal 12 megapixel lens", "start": 391.009, "duration": 5.551}, {"text": "in the center. And a 12 megapixel telephoto\nzoom lens on the bottom. The perfect perspective", "start": 396.56, "duration": 5.07}, {"text": "trifecta. The Note 10+ also has an additional\ndepth sensor off to the side, which combined", "start": 401.63, "duration": 5.77}, {"text": "with the bigger screen and bigger battery,\nmakes the 10+ a better purchase than the smaller", "start": 407.4, "duration": 4.42}, {"text": "Note 10. Still stay away from the 5G version\nthough.", "start": 411.82, "duration": 3.51}, {"text": "There is an under screen ultrasonic fingerprint\nscanner on the Note 10. It's the same cool", "start": 415.33, "duration": 4.24}, {"text": "tech we saw inside of the Galaxy S10. Super\nquick and doesn't take up much room inside", "start": 419.57, "duration": 5.159}, {"text": "the phone. But more importantly, the ultrasonic\nfingerprint scanner still functions even after", "start": 424.729, "duration": 5.641}, {"text": "the screen suffers heavy damage with level\n7 deeper groves. Very impressive.", "start": 430.37, "duration": 5.48}, {"text": "Speaking of scratches, do you want to see\nan experiment I started 2 ½ years ago? Both", "start": 435.85, "duration": 4.431}, {"text": "sides of the Note 10 are made from glass,\nand as we know, glass can scratch. Here are", "start": 440.281, "duration": 4.75}, {"text": "some level 7 deeper grooves on the back next\nto the Samsung logo. And here are even some", "start": 445.031, "duration": 4.279}, {"text": "level 6 scratches, both of which show up extremely\nwell on this child's kaleidoscope of a phone.", "start": 449.31, "duration": 5.97}, {"text": "There are plenty of things in everyday life\nthat can scratch glass. For example this is", "start": 455.28, "duration": 4.57}, {"text": "my 2 ½ year old daily driver that I purposefully\nnever put a screen protector on just to see", "start": 459.85, "duration": 5.03}, {"text": "how it would react and turn out with normal\nevery day use, sliding in and out of my pocket.", "start": 464.88, "duration": 5.39}, {"text": "Glass might be scratch resistant, but it's\nstill no match for anything above a level", "start": 470.27, "duration": 4.13}, {"text": "6 on Mohs scale of hardness. You really only\nhave two options. You can either cover up", "start": 474.4, "duration": 4.6}, {"text": "scratches that are already made, or prevent\nscratches with some kind of protection.", "start": 479.0, "duration": 4.78}, {"text": "Thanks to dbrand for sponsoring this video.\nDbrand has protective skins that you can combine", "start": 483.78, "duration": 6.389}, {"text": "together however you want. It changes how\nyour phone looks, along with adding aesthetic", "start": 490.169, "duration": 4.78}, {"text": "protection. You can see what your phone would\nlook like with the link in the description.", "start": 494.949, "duration": 3.351}, {"text": "A new skin for your phone is way cheaper than\nbuying a new phone...just saying. I'm digging", "start": 498.3, "duration": 4.54}, {"text": "this copper metal skin. I'll peel it off though\nso we can taste the rainbow and finish off", "start": 502.84, "duration": 4.24}, {"text": "the durability test. Have you ever roasted\nskittles over a campfire? Neither have I,", "start": 507.08, "duration": 11.13}, {"text": "but I couldn't figure out any other way to\nsegue into the burn test.", "start": 518.21, "duration": 3.11}, {"text": "The Note 10+ has a large 6.8 inch 1440p display\nand lasted about 20 seconds before I thought", "start": 521.32, "duration": 6.86}, {"text": "it was permanently damaged. But after removing\nthe heat from the dynamic AMOLED screen, the", "start": 528.18, "duration": 4.58}, {"text": "white marks quickly faded, leaving a pristine\nscreen behind, minus the evaporated oleophobic", "start": 532.76, "duration": 5.24}, {"text": "coating of course. There is no other damage.", "start": 538.0, "duration": 3.01}, {"text": "No durability test is complete without a bend\ntest. The physical structural integrity of", "start": 541.01, "duration": 4.67}, {"text": "a phone is just as important as the power\ninside. It's time to see if the Note 10 is", "start": 545.68, "duration": 4.74}, {"text": "as durable as it is cute. Bending from the\nback we get basically no flex, which is rather", "start": 550.42, "duration": 5.16}, {"text": "shocking considering how large the phone is.\nI'll flip it around to the front and we get", "start": 555.58, "duration": 4.47}, {"text": "basically the same result. No damage, no cracks,\nand no kinks in the frame. Just a super solid", "start": 560.05, "duration": 6.03}, {"text": "colorful flagship phone from Samsung that\nsurvives my durability test. I think it's", "start": 566.08, "duration": 4.68}, {"text": "a winner. Expensive, yes, but still a good\nphone.", "start": 570.76, "duration": 3.29}, {"text": "If it had a headphone jack, I'd probably end\nup switching right away. But as of right now,", "start": 574.05, "duration": 4.14}, {"text": "my Galaxy S8 is still working good enough,\nso I don't know. Maybe I'll upgrade. And maybe", "start": 578.19, "duration": 5.54}, {"text": "I'll let you guys decide for me over on Twitter.\nI'm not quite sure yet.", "start": 583.73, "duration": 3.65}, {"text": "We should definitely take it apart first,\nso hit that subscribe button if you haven't", "start": 587.38, "duration": 3.04}, {"text": "already. Come hang out with me on Instagram\nand Twitter. And don't forget to see what", "start": 590.42, "duration": 3.69}, {"text": "your phone looks like skinned with the dbrand\nlink in the description. Thanks a ton for", "start": 594.11, "duration": 4.12}, {"text": "watching. I'll see you around.", "start": 598.23, "duration": 1.91}]