[{"text": "This video is brought to you by Squarespace, my go-to for making websites more on this in a bit.", "start": 0.03, "duration": 4.08}, {"text": "So have you guys ever wondered what Japanese people are really thinking? Well in this video I wanted to share with you guys", "start": 4.11, "duration": 5.699}, {"text": "Some of the things that they never tell you but, they're actually thinking inside of their head.", "start": 10.09, "duration": 4.71}, {"text": "So I've been in Japan for more than 15 years", "start": 14.849, "duration": 2.22}, {"text": "And I'm going to be sharing with you some of the stuff that I've learned all along the way", "start": 17.07, "duration": 4.559}, {"text": "In general, Japanese people like to follow the rules.", "start": 21.92, "duration": 2.6}, {"text": "So when others break those rules, it's very frustrating for them.", "start": 24.54, "duration": 4.04}, {"text": "On top of that Japanese people don't like interacting with strangers", "start": 28.7, "duration": 2.62}, {"text": "so they'll try to avoid speaking out at all costs and the reason why I know this is", "start": 31.6, "duration": 4.92}, {"text": "Because I've actually made a lot of these mistakes myself.", "start": 36.7, "duration": 3.18}, {"text": "When you do come to a different country you want to be as respectful as possible.", "start": 39.94, "duration": 3.76}, {"text": "But it's just hard because a lot of the times, the Japanese don't tell you that you're pissing them off.", "start": 44.02, "duration": 4.82}, {"text": "But just keep in mind that I'm generalizing things, not everyone is like this in Japan.", "start": 48.84, "duration": 3.779}, {"text": "These are some of the guidelines to help you guys understand what Japanese people are thinking and", "start": 52.62, "duration": 3.84}, {"text": "So maybe you don't piss them off when you come to Japan.", "start": 56.54, "duration": 2.94}, {"text": "Number One: \"Not wearing masks in public when you're sick.\"", "start": 59.92, "duration": 3.22}, {"text": "If you ever come to Japan or have watched Japanese videos or any of my videos for that matter.", "start": 63.149, "duration": 4.271}, {"text": "You'll notice that a lot of people are wearing masks.", "start": 67.44, "duration": 3.54}, {"text": "Getting on airplanes or sometimes when they're just on the train.", "start": 70.98, "duration": 2.72}, {"text": "So what a lot of people think is that Japanese people are scared of getting sick.", "start": 73.71, "duration": 3.959}, {"text": "And so they wear the masks to protect themselves from other people transferring any viruses or any sicknesses to them.", "start": 77.67, "duration": 5.849}, {"text": "That's actually partly true. But the other side of it is they're trying to protect other people.", "start": 83.52, "duration": 4.64}, {"text": "When Japanese people get sick?", "start": 88.16, "duration": 1.14}, {"text": "They don't want to transfer what they've caught or their illness to someone else,", "start": 89.31, "duration": 4.11}, {"text": "so they wear a mask to protect other people.", "start": 93.689, "duration": 2.286}, {"text": "So it actually pisses them off is that when someone else is sick, and they're not wearing a mask", "start": 95.98, "duration": 5.9}, {"text": "As a common courtesy, Japanese people", "start": 101.88, "duration": 2.12}, {"text": "expect others, when they're sick, to wear a mask.", "start": 104.24, "duration": 2.919}, {"text": "So, if you're ever in Japan and you do get sick, it would probably be good to wear a mask.", "start": 107.159, "duration": 4.83}, {"text": "Number Two: \"squatting in public.\"", "start": 112.36, "duration": 2.42}, {"text": "If you ever been walking the streets in Japan.", "start": 114.78, "duration": 1.86}, {"text": "Especially Tokyo you probably rarely see Japanese people squatting.", "start": 116.64, "duration": 3.389}, {"text": "The reason for this is when Japanese people see someone squatting", "start": 120.029, "duration": 3.491}, {"text": "they actually think that this person is poorly brought up.", "start": 123.52, "duration": 3.52}, {"text": "One thing that I kind of see personally in Tokyo,", "start": 127.18, "duration": 1.94}, {"text": "especially with tourists is", "start": 129.19, "duration": 2.0}, {"text": "\"I'll go to a department store\"", "start": 131.28, "duration": 1.74}, {"text": "and I'll just see them like sitting against the pillar or sitting like actually on the ground in the department store", "start": 133.02, "duration": 5.04}, {"text": "or maybe they're sitting on some stairs.", "start": 138.06, "duration": 2.279}, {"text": "This is actually the same thing as squatting in public. Japanese kind of view that as behaving poorly.", "start": 140.34, "duration": 5.61}, {"text": "So the thing is in Japan department stores are considered luxuries,", "start": 145.95, "duration": 4.169}, {"text": "so it's kind of weird for Japanese people to see someone squatting when they're trying to like get that luxury experience.", "start": 150.12, "duration": 5.759}, {"text": "It's kind of like seeing someone picking their nose right next to the Chanel shop or like the Gucci shop.", "start": 155.879, "duration": 4.59}, {"text": "So if you do feel tired, then definitely find a seat.", "start": 160.47, "duration": 2.369}, {"text": "I know in Tokyo is a bit hard, especially because there's not a lot of places to sit.", "start": 162.87, "duration": 3.839}, {"text": "You can definitely try to find a seat or,", "start": 166.709, "duration": 2.911}, {"text": "what Japanese people will do is they'll find a cafe and they'll sit there.", "start": 169.62, "duration": 3.16}, {"text": "Number Three: \"Blocking traffic\"", "start": 172.9, "duration": 1.96}, {"text": "Now this kind of goes hand in hand with like sitting in department stores or squatting in public.", "start": 174.86, "duration": 3.72}, {"text": "Basically, you're making a nuisance of yourself when you're blocking traffic,", "start": 178.62, "duration": 3.479}, {"text": "so for example:", "start": 182.1, "duration": 1.2}, {"text": "You'll be walking on the street and you'll just see like a group of tourists", "start": 183.3, "duration": 3.18}, {"text": "just standing in the walkway and not letting people pass by.", "start": 186.48, "duration": 2.82}, {"text": "That just like really pisses people off because a lot of people are trying to get from A to B.", "start": 189.3, "duration": 3.96}, {"text": "And you're just like getting in their way and you're not kind of", "start": 193.26, "duration": 2.5}, {"text": "considering others not to say that all foreigners or tourists do this.", "start": 195.84, "duration": 3.32}, {"text": "But Japanese people will do it, too.", "start": 199.2, "duration": 1.52}, {"text": "But as you get kind of older you realize to be more courteous of others", "start": 200.73, "duration": 3.51}, {"text": "and you try not to get in other people's way.", "start": 204.24, "duration": 2.129}, {"text": "So, if possible if you need to stop don't stop in traffic;", "start": 206.4, "duration": 3.18}, {"text": "try to go off to the side where you're not actually getting in people's way.", "start": 209.58, "duration": 3.14}, {"text": "Number Four: \"expecting places like food stalls to accept credit cards.\"", "start": 212.72, "duration": 3.97}, {"text": "And now we've gone over this so many times in my other videos", "start": 216.69, "duration": 2.69}, {"text": "that Japan is still very much a cash based society.", "start": 219.38, "duration": 2.379}, {"text": "If you're buying street food probably not expect them to", "start": 221.92, "duration": 2.75}, {"text": "accept a credit card it because it's just kind of common sense.", "start": 224.94, "duration": 3.32}, {"text": "Common knowledge that these places don't accept credit card", "start": 228.34, "duration": 3.16}, {"text": "and they will get kind of like annoyed.", "start": 231.5, "duration": 1.68}, {"text": "It's kind of like, \"why are you asking me to take credit card", "start": 233.18, "duration": 2.18}, {"text": "when you know this place, these shops, don't take credit cards?\"", "start": 235.36, "duration": 2.663}, {"text": "Because at the end of the day it", "start": 238.023, "duration": 1.397}, {"text": "just makes you look like you don't have any common sense.", "start": 239.42, "duration": 2.44}, {"text": "Alright.", "start": 242.8, "duration": 0.859}, {"text": "So it just started to rain,", "start": 243.659, "duration": 1.231}, {"text": "so I needed to find some cover and what better way to do it than here!", "start": 244.89, "duration": 4.07}, {"text": "Let's continue on.", "start": 248.96, "duration": 0.86}, {"text": "Number Five:", "start": 249.82, "duration": 1.78}, {"text": "\"Eating at tourist trap spots.\"", "start": 251.7, "duration": 1.44}, {"text": "Now this one again maybe doesn't piss Japanese off per say,", "start": 253.14, "duration": 4.46}, {"text": "it is kind of embarrassing to go and eat at these kind of places", "start": 257.6, "duration": 3.02}, {"text": "because it's just so much food that Japan has to offer.", "start": 260.88, "duration": 3.8}, {"text": "When foreigners go to these like very very", "start": 264.68, "duration": 1.96}, {"text": "tourist trap places and eat it's kind of like", "start": 266.96, "duration": 2.74}, {"text": "\"aww you kind of missed out.\"", "start": 269.74, "duration": 1.48}, {"text": "Thing is I've actually gone to a lot of these", "start": 271.24, "duration": 1.76}, {"text": "like tourist trap places myself.", "start": 273.0, "duration": 1.98}, {"text": "Just not knowing better and I kind of wanted to give you some pointers on", "start": 274.98, "duration": 2.98}, {"text": "what's a tourist trap spot and what is not.", "start": 278.06, "duration": 2.58}, {"text": "This usually applies to for example, like \"Izakayas\", Japanese drinking restaurants.", "start": 280.64, "duration": 4.34}, {"text": "So, the ideal for a good Japanese restaurant", "start": 284.99, "duration": 2.17}, {"text": "would be a place like this that keeps it simple with minimal signage.", "start": 287.16, "duration": 3.4}, {"text": "What you'll find", "start": 290.56, "duration": 0.98}, {"text": "Instead with like a lot of tourist trap places is not only will they have their sign,", "start": 291.72, "duration": 4.73}, {"text": "it may be in English,", "start": 296.45, "duration": 1.05}, {"text": "but they'll also have a signboard with pictures and not only Japanese but it also has English on the menu.", "start": 297.5, "duration": 6.089}, {"text": "You're kind of like \"oh.\"", "start": 303.589, "duration": 1.171}, {"text": "So they are like catering to a foreign market . One of the biggest giveaways for this is not only do you see English", "start": 304.76, "duration": 6.38}, {"text": "but you see like Chinese and Korean, you see like three different languages on the menu.", "start": 311.15, "duration": 4.2}, {"text": "You might want to step back a little bit because this could be a tourist trap spot.", "start": 315.35, "duration": 3.839}, {"text": "Well one thing though this kind of goes against what I was saying,", "start": 319.19, "duration": 3.29}, {"text": "like for example, if you go to ramen shops nowadays.", "start": 322.48, "duration": 3.009}, {"text": "There's ramen shops.", "start": 325.49, "duration": 1.08}, {"text": "They get really, really popular and they have a lot of foreigners coming to it", "start": 326.57, "duration": 4.21}, {"text": "just to make the experience a little bit easier", "start": 330.78, "duration": 1.88}, {"text": "for both parties, they just added the English to the menu, but originally they didn't have it.", "start": 332.76, "duration": 4.699}, {"text": "So, it's not like they were initially trying to like get foreigners to come.", "start": 337.46, "duration": 3.54}, {"text": "It's just foreigners started coming so they had to kind of adapt", "start": 341.0, "duration": 2.9}, {"text": "and add an English menu.", "start": 343.9, "duration": 1.38}, {"text": "Oh, and this is probably the biggest giveaway out of all of it.", "start": 345.28, "duration": 3.54}, {"text": "If you ever hear one of those like aggressive shamisen music playing in the front of this door,", "start": 348.83, "duration": 6.299}, {"text": "you should probably run because", "start": 355.53, "duration": 1.8}, {"text": "they're like trying to attract tourists like you would not believe.", "start": 357.33, "duration": 3.31}, {"text": "But at the end of the day if you want to come to Japan and you just feel comfortable", "start": 360.64, "duration": 3.18}, {"text": "Eating at these like tourist chop spots then yeah, that's fine.", "start": 364.08, "duration": 3.5}, {"text": "But if you want to come to Japan and you want to kind of experience like authentic Japanese cuisine.", "start": 367.68, "duration": 5.209}, {"text": "I would say just like try to stay away from these places. All right.", "start": 372.889, "duration": 3.119}, {"text": "So, before I continue I wanted to just give a quick shout out to Square Space.", "start": 376.009, "duration": 3.66}, {"text": "Thank you so much for sponsoring this video", "start": 379.979, "duration": 1.951}, {"text": "and in fact", "start": 381.93, "duration": 0.829}, {"text": "I've been using Squarespace for I think like more than seven years now and when I started this channel;", "start": 382.76, "duration": 5.1}, {"text": "we built out Tokyo Zebra Coms and at that time I asked Michael to take over the site and", "start": 388.04, "duration": 5.0}, {"text": "she had no problems.", "start": 393.629, "duration": 1.82}, {"text": "It was the first time she ever built and managed a web site and I didn't even have to tell her how to use it.", "start": 395.449, "duration": 5.489}, {"text": "It's that easy to use and as you can see if you look at our site.", "start": 401.039, "duration": 3.86}, {"text": "You can build a pretty cool web site with like;", "start": 404.9, "duration": 2.369}, {"text": "minimal effort and minimal know how really Square Space is the perfect solution for your online presence.", "start": 407.61, "duration": 6.079}, {"text": "So definitely go check out squarespace.com for your free trial when you're ready to launch go to Square Space", "start": 413.689, "duration": 5.85}, {"text": "dot com forward slash Paulo from Tokyo to save 10% off your first purchase of your domain or your website.", "start": 419.669, "duration": 6.41}, {"text": "Number 6: \"eating with it off hand underneath the table.\"", "start": 426.24, "duration": 3.199}, {"text": "So this one was like really weird to me because what I didn't know this until after coming to Japan and", "start": 429.569, "duration": 5.3}, {"text": "back to be honest with you. I still do it sometimes.", "start": 435.21, "duration": 2.16}, {"text": "The way you're supposed to eat in Japan is you're supposed to just have some dominant hand you're eating with your chopsticks and you have", "start": 438.07, "duration": 6.139}, {"text": "Maybe happy a rice bowl on the other hand and you're just like you're just like eating like this.", "start": 444.21, "duration": 4.23}, {"text": "But sometimes if you know.", "start": 448.449, "duration": 1.25}, {"text": "You don't have the bowl in your hand and you're just eating on the table.", "start": 449.699, "duration": 2.279}, {"text": "Like I sometimes take my off hand and I put it underneath the table or like just on my lap and I heat with just", "start": 451.979, "duration": 6.029}, {"text": "one hand, but apparently this is just kind of bad manners in Japan.", "start": 458.009, "duration": 4.02}, {"text": "This is something that Japanese kids grow up with where their parents like telling them to always show", "start": 462.03, "duration": 5.519}, {"text": "Their other hand because I think just in general", "start": 467.71, "duration": 2.0}, {"text": "People like to put their off hand underneath the table or on their lap where they eat", "start": 469.9, "duration": 3.859}, {"text": "I don't know if this is a thing in your country, but it definitely is something here in Japan", "start": 473.759, "duration": 4.05}, {"text": "So when you eat and you want to have kind of good manners", "start": 477.849, "duration": 2.99}, {"text": "Then you should leave or you should show", "start": 480.84, "duration": 2.0}, {"text": "Your off hand the entire time just like put it on the table and finally before we get out of this place", "start": 482.949, "duration": 4.88}, {"text": "Number seven not cleaning up after you eat", "start": 488.32, "duration": 3.019}, {"text": "So cleanliness is kind of one of those pet peeves that Japanese people have they like to keep everything clean?", "start": 491.44, "duration": 6.229}, {"text": "You know in general so when you're eating in a public place", "start": 497.669, "duration": 2.76}, {"text": "It's always like kind of", "start": 500.43, "duration": 1.57}, {"text": "Proper manner just to clean up how to yourself while you're eating and especially after you eat maybe in other countries", "start": 502.0, "duration": 6.109}, {"text": "You expect the waiter or the waitress?", "start": 508.11, "duration": 2.0}, {"text": "To clean up after your eating so you can like leave all of your crumbs on the table", "start": 510.19, "duration": 4.13}, {"text": "You can leave, you know your french fries or your noodles. It's just like spilled on the table", "start": 514.32, "duration": 4.529}, {"text": "It's okay just to leave the table like that", "start": 518.849, "duration": 2.46}, {"text": "but in fact in Japan", "start": 521.38, "duration": 1.61}, {"text": "It's a common courtesy to", "start": 522.99, "duration": 1.719}, {"text": "actually gather all of the napkins of like the loose items and put it all in the bowler in the center or the plate and", "start": 524.709, "duration": 7.19}, {"text": "then if there's any like spots on the table just to like wipe it down with a napkin make it kind of tidy because in", "start": 531.9, "duration": 5.129}, {"text": "Japan no one wants to have like a really", "start": 537.029, "duration": 2.1}, {"text": "Messy table even after they leave is that an international thing or is that a just just a Japanese thing?", "start": 539.5, "duration": 5.359}, {"text": "All right, so that's enough about food. Let's move on to the next one", "start": 544.86, "duration": 3.57}, {"text": "Number eight making people wait, this one actually pisses a lot of Japanese off", "start": 548.5, "duration": 5.119}, {"text": "So in general, I think Japanese people are very punctual and that's just because they're being considerate of others", "start": 553.62, "duration": 6.23}, {"text": "They don't want to make other people wait, so when there's twisting meet someone say for example for work", "start": 559.85, "duration": 5.07}, {"text": "Then they'll usually arrive 5 to 10 minutes early on site", "start": 564.92, "duration": 4.169}, {"text": "They'll probably like go up a minute or two before going to the front desk and check them themselves in it's just like it's one", "start": 569.09, "duration": 5.669}, {"text": "Of those things being considerate is probably on the priority in like thinking of others", "start": 574.76, "duration": 5.25}, {"text": "So the fact that you're late meaning you're wasting other people's time and Japanese people don't like to waste time and in fact they hate", "start": 580.01, "duration": 6.72}, {"text": "It when someone else wastes their time, in fact, it's I've been here so long", "start": 586.73, "duration": 4.139}, {"text": "It kind of pisses me off to be honest when people that I have a meeting with are late", "start": 590.87, "duration": 5.31}, {"text": "I'll actually set up a lot of international calls like on skype or whatever people overseas are always like 5 10 15 minutes", "start": 596.18, "duration": 7.709}, {"text": "Later that email me to the floor", "start": 603.89, "duration": 1.29}, {"text": "Sorry got stuck in a different meeting and I think it's almost like common practice to be late when you're setting up a meeting", "start": 605.18, "duration": 7.259}, {"text": "But me being in Japan and working in I know a japanese-style environment for so many years", "start": 612.44, "duration": 4.92}, {"text": "I've just got accustomed to being on time or if not early to all of my meeting", "start": 617.36, "duration": 4.769}, {"text": "So if you ever come to Japan and you're meeting up with a Japanese friend you have dinner reservations", "start": 622.13, "duration": 3.96}, {"text": "Or just meeting someone for for business or for pleasure", "start": 626.52, "duration": 3.289}, {"text": "You want to be on time if not early?", "start": 629.97, "duration": 3.169}, {"text": "So definitely keep that in mind when setting up your meetings", "start": 633.33, "duration": 3.59}, {"text": "But there is one caveat to this. So as people get more comfortable with each other than I wouldn't say", "start": 636.92, "duration": 5.88}, {"text": "It's accepted to be late", "start": 642.8, "duration": 1.9}, {"text": "But it's more forgiving and it's not as big of a thing when compared to if you are", "start": 644.7, "duration": 4.429}, {"text": "acquaintances", "start": 649.38, "duration": 0.5}, {"text": "or if you were a business meeting at the end of the day is just being considered and none that don't understand why that's so", "start": 649.88, "duration": 6.27}, {"text": "Hard for some people maybe it pisses me off with him Japanese people number nine talking to someone in line", "start": 656.15, "duration": 6.15}, {"text": "so again", "start": 662.3, "duration": 0.69}, {"text": "This one is another thing that kind of surprised me kind of one of those reverse culture shocks when I went in the States", "start": 662.99, "duration": 5.82}, {"text": "I was just waiting in line at the supermarket and all of a sudden someone behind me", "start": 668.99, "duration": 3.6}, {"text": "Just started talking to me asking me about the weather or the sports theme or something like that. I was completely shocked", "start": 672.59, "duration": 5.7}, {"text": "I think it's because I've been in Tokyo so long that people here in Tokyo", "start": 678.29, "duration": 4.169}, {"text": "At least they don't appreciate it", "start": 682.46, "duration": 1.59}, {"text": "When a random person it just approaches them", "start": 684.05, "duration": 1.93}, {"text": "Especially if they're just doing their like normal daily tasks like going to the convenience store to buy something", "start": 685.98, "duration": 4.95}, {"text": "It catches a lot of people off-guard and it kind of just makes people uncomfortable", "start": 690.93, "duration": 3.599}, {"text": "I know there's like there's people out there that like to talk to people but if you want to kind of", "start": 694.66, "duration": 4.01}, {"text": "Respect that people's boundaries and their spaces. Then you might not want to just like come up and start talking to them", "start": 698.83, "duration": 6.44}, {"text": "so I think the exception to this is if you do have a reason to talk to someone so for example", "start": 705.27, "duration": 5.849}, {"text": "You are lost and you need like directions, then you can like say soon less and excuse me", "start": 711.12, "duration": 4.59}, {"text": "And then ask for the directions", "start": 715.78, "duration": 1.46}, {"text": "I think this is probably more mainly to do with the city because there's just so many people there's so many like", "start": 717.24, "duration": 4.829}, {"text": "Interactions that could potentially happen that you don't want to like continue to get bombarded with people", "start": 722.26, "duration": 3.98}, {"text": "So people are kind of in their own zone in the city. Maybe if you were to go out in the countryside", "start": 726.31, "duration": 5.45}, {"text": "It's less likely people have the guard down more. So so in fact they may actually appreciate you're talking to them", "start": 731.8, "duration": 6.289}, {"text": "Don't take this as like all of Japan is like this but maybe like in the city areas where people are just more closed off", "start": 738.09, "duration": 5.07}, {"text": "Then you might make them feel uncomfortable and finally number 10 talking way too loud", "start": 743.16, "duration": 6.39}, {"text": "now I see this all the time when you're on the train when you're on the bus you're in a restaurant and people are just", "start": 750.31, "duration": 6.62}, {"text": "Talking so loud that it interrupts you what's it's kind of off-putting and it actually pisses a lot of Japanese off", "start": 757.09, "duration": 6.679}, {"text": "I've heard my Japanese friends comment about it", "start": 763.77, "duration": 2.489}, {"text": "it's just something that people kind of like get really turned off by because people do like their personal space and", "start": 766.26, "duration": 5.85}, {"text": "Someone like a group of people are talking way too loud conscious being inconsiderate about their surroundings", "start": 772.39, "duration": 5.359}, {"text": "Then it just kind of like pisses people off", "start": 777.94, "duration": 2.0}, {"text": "It just scene says that you don't really care about the other people around you and I mean if you're just like talking normal", "start": 779.94, "duration": 4.95}, {"text": "It's not a big deal, but I will say that it's not like I don't hear Japanese people do this", "start": 784.89, "duration": 3.96}, {"text": "I mean", "start": 788.85, "duration": 0.42}, {"text": "like you'll probably sometimes be on a late train and people are like talking loudly because everyone's drunk on the train or", "start": 789.27, "duration": 6.54}, {"text": "You'll go to maybe like a festival and people are talking about but just like in normal", "start": 796.06, "duration": 4.009}, {"text": "everyday", "start": 800.62, "duration": 1.05}, {"text": "Daytime scenarios people like try to keep their voice down so they don't bother other people", "start": 801.67, "duration": 4.25}, {"text": "So if you are walking around and you don't want to piss people off then", "start": 805.99, "duration": 3.26}, {"text": "Just like keep your volume - as my grammar school teacher used to say keep your 12-inch voices", "start": 809.47, "duration": 5.599}, {"text": "No one's made more than 12 inches 1-yard voice because in the States, so yeah. Those are my top ten things", "start": 815.14, "duration": 7.16}, {"text": "I don't know if this video gets really popular", "start": 822.3, "duration": 2.279}, {"text": "Maybe it gets like 10,000 likes or it gets a few hundred thousand views and maybe we'll do another one", "start": 824.62, "duration": 5.119}, {"text": "So definitely hit that like button", "start": 829.77, "duration": 0.99}, {"text": "Let me know that you like this video if you want to see another one", "start": 830.76, "duration": 2.64}, {"text": "or else if you want to see what I'm doing on the daily then check out my", "start": 833.47, "duration": 2.989}, {"text": "Instagram account if you want to support the channel then check out my", "start": 836.62, "duration": 3.08}, {"text": "Shibuya merch", "start": 841.21, "duration": 1.8}, {"text": "yeah, if you want to see my other Japan guides or my D in their lives or anything like that hit that subscribe button and", "start": 843.01, "duration": 5.63}, {"text": "The Bell button and I'll catch you guys in the next one", "start": 848.64, "duration": 2.16}]