[{"text": "Warning this circuit showcased in this video uses mains voltage.", "start": 0.96, "duration": 4.92}, {"text": "Mishandling of such a high voltage can lead to fatal injuries.", "start": 6.3, "duration": 3.76}, {"text": "Replicate the circuit at your own risk.", "start": 10.54, "duration": 3.04}, {"text": "A while ago a friend of mine gave me this LED light bulb", "start": 14.56, "duration": 4.06}, {"text": "which emits quite an interesting to look at screen lights", "start": 18.86, "duration": 3.54}, {"text": "and he asked me whether I could create a circuits to dim brightness.", "start": 22.66, "duration": 4.36}, {"text": "And since the packaging of the LED bulb stated that it is dimmable.", "start": 27.36, "duration": 4.82}, {"text": "I said: - Yes, that should be possible.", "start": 32.36, "duration": 2.62}, {"text": "What I didn't expect though", "start": 35.66, "duration": 1.6}, {"text": "Was that dimming AC LED lights can be a very confusing and complicated topic", "start": 37.26, "duration": 5.64}, {"text": "But let's postpone this problem for now.", "start": 42.94, "duration": 2.9}, {"text": "Instead let's start with analyzing how common AC dimmer works", "start": 46.4, "duration": 4.98}, {"text": "and how we can easily create our own.", "start": 51.38, "duration": 2.48}, {"text": "Improved version by coming up with a custom PCB design controlled by a small ATtiny microcontroller.", "start": 53.9, "duration": 7.08}, {"text": "So that at the end of this DIY or Buy episode", "start": 61.62, "duration": 3.7}, {"text": "we can determine whether it makes sense to create a DIY AC light dimmer.", "start": 65.34, "duration": 4.88}, {"text": "Or whether we should stick to the commercial solutions instead.", "start": 70.22, "duration": 3.98}, {"text": "Let's get started!", "start": 74.78, "duration": 2.0}, {"text": "* Intro music *", "start": 77.38, "duration": 10.04}, {"text": "This video is sponsored by JLCPCB whose new full automatic PCB batch production factory", "start": 88.38, "duration": 7.5}, {"text": "is being used since April", "start": 96.08, "duration": 2.0}, {"text": "They produce 600,000 square meter of PCBs per month", "start": 98.54, "duration": 4.54}, {"text": "and you can get your own 2 layer prototype PCB for as low as two dollars.", "start": 103.12, "duration": 5.62}, {"text": "The AC dimmer I got online was a pretty generic one.", "start": 110.16, "duration": 3.74}, {"text": "That uses Phasenanschnitt in German or face anger control in English.", "start": 114.12, "duration": 5.86}, {"text": "To dimmer, 3 to 35 watt LEDs and 7 to 110 watt halogen lamps.", "start": 120.18, "duration": 6.68}, {"text": "So I hooked it up to mains voltage and in E27 sockets", "start": 127.52, "duration": 5.02}, {"text": "according to the wiring diagram offers instruction manual.", "start": 132.58, "duration": 4.02}, {"text": "As the first simple test subject, I will be using this 42 watts halogen light bulb.", "start": 137.06, "duration": 5.6}, {"text": "After securing it inside the sockets.", "start": 143.52, "duration": 2.24}, {"text": "It was a breeze to dim the brightness of its the main potentiometer of the dimmer.", "start": 145.76, "duration": 4.56}, {"text": "But let's think a bit deeper by removing a couple of screws", "start": 150.66, "duration": 4.12}, {"text": "and lifting up the dimmer slits in order to have a closer look at the circuits.", "start": 154.78, "duration": 5.08}, {"text": "I have to say that these circuits is a lot simpler than what I anticipated", "start": 160.54, "duration": 4.9}, {"text": "and the solder quality is certainly not the best.", "start": 165.62, "duration": 3.44}, {"text": "But I guess this is what you get at a price point of twenty four euro.", "start": 169.3, "duration": 4.2}, {"text": "If we reduce the component counts to only the mandatory bonds,", "start": 174.06, "duration": 4.82}, {"text": "then the schematic for the circuits would look something like this.", "start": 178.88, "duration": 3.82}, {"text": "With a resistor, potentiometer, capacitor, DIAC and TRIAC.", "start": 182.88, "duration": 5.08}, {"text": "To understand how it works, let's imagine, we got our AC sine wave voltage applied", "start": 188.4, "duration": 5.78}, {"text": "after the zero crossing point the voltage slowly increases", "start": 194.98, "duration": 4.18}, {"text": "Which charges up the capacitor through the resistor and potentiometer?", "start": 199.3, "duration": 4.46}, {"text": "The capacitor voltage increases up to value of, for example, 32 volts", "start": 204.46, "duration": 6.06}, {"text": "-- which is the break over voltage of our DIAC.", "start": 210.72, "duration": 2.86}, {"text": "At this voltage the DIAC becomes conductive", "start": 214.14, "duration": 3.42}, {"text": "and thus the capacitor discharges through its and through the gate of the TRIAC", "start": 217.86, "duration": 4.64}, {"text": "Which turns it on and thus lets current flow through the light bulb for the remainder of this half wave", "start": 222.72, "duration": 6.06}, {"text": "As soon as the next zero crossing point comes however the TRIAC turns off.", "start": 229.06, "duration": 5.86}, {"text": "Since the current value fell beneath the holding current.", "start": 235.2, "duration": 3.36}, {"text": "But feel free to watch my basics video about TRIAC's to understand they're working behavior better.", "start": 238.72, "duration": 5.82}, {"text": "anyway, for the next reversed polarity half wave, the process almost tastes the same", "start": 245.22, "duration": 5.66}, {"text": "and thus only part of the half wave gets once again applied to the light bulb", "start": 251.16, "duration": 4.76}, {"text": "Now by increasing the resistance of the potentiometer,", "start": 256.72, "duration": 3.16}, {"text": "the charge up time of the capacitor increases", "start": 259.98, "duration": 3.38}, {"text": "and thus the ignition point of the track gets delayed.", "start": 263.36, "duration": 3.74}, {"text": "Which means less average voltage less current and thus less brightness for the light bulb", "start": 267.1, "duration": 5.84}, {"text": "Now, of course, the commercial dimmer got a couple more components.", "start": 273.54, "duration": 3.96}, {"text": "Two, for example: suppressed noise and voltage spikes.", "start": 277.72, "duration": 3.56}, {"text": "But, in a nutshell, this is how such an analog face anger control dimmer functions.", "start": 281.6, "duration": 5.38}, {"text": "And after hooking up these circuits to the oscilloscope.", "start": 287.64, "duration": 2.88}, {"text": "We can see that the waveform of the mains voltage applied to our light bulb,", "start": 290.72, "duration": 4.82}, {"text": "pretty much looks like the theory we just talked about.", "start": 295.72, "duration": 3.48}, {"text": "Awesome!", "start": 299.7, "duration": 1.26}, {"text": "For such a halogen light bulb which can be modeled as a resistor such dimmer circuit is definitely suitable", "start": 301.14, "duration": 6.82}, {"text": "But for an LED light bulb which comes with capacitors inductors and LED drivers", "start": 308.5, "duration": 6.24}, {"text": "such circuits is oftentimes not suitable.", "start": 314.8, "duration": 3.14}, {"text": "Because the current path goes through the light bulb", "start": 318.4, "duration": 2.7}, {"text": "and thus and more complex loads can lead to the malfunction of the analog dimmer.", "start": 321.28, "duration": 5.639}, {"text": "That is why from our own design", "start": 326.92, "duration": 2.26}, {"text": "I wanted to teach this old analog light bulb serious concepts", "start": 329.22, "duration": 4.46}, {"text": "and instead go the digital way here with this SMD ATtiny 85 microcontroller.", "start": 334.06, "duration": 5.96}, {"text": "First off, I needed a potentiometer to set the desired phase angle of the AC voltage", "start": 340.62, "duration": 5.78}, {"text": "The other mandatory input for the microcontroller needs to get connected to phototransistor Optocoupler", "start": 347.16, "duration": 7.0}, {"text": "like it's shown here.", "start": 354.16, "duration": 1.8}, {"text": "When the mains voltage is high enough the LEDs inside the optocoupler get powered properly", "start": 356.1, "duration": 6.1}, {"text": "and thus connect the input of the microcontroller on to ground", "start": 362.52, "duration": 3.86}, {"text": "But as soon as the mains voltage reaches its zero crossing point, the voltage is too low to power the LEDs", "start": 366.84, "duration": 7.06}, {"text": "The transistor turns off", "start": 374.26, "duration": 1.94}, {"text": "and thus the microcontroller inputs connects to five volts through its internal pull-up resistor", "start": 376.2, "duration": 6.519}, {"text": "This way we have a zero crossing point indicator", "start": 382.72, "duration": 3.24}, {"text": "From whose occurrence we can use the timer to delay the ignition of the track", "start": 386.14, "duration": 5.18}, {"text": "according to the set potentiometer value", "start": 391.44, "duration": 2.78}, {"text": "and thus get our desired phase angle.", "start": 394.34, "duration": 3.44}, {"text": "And speaking of ignition for that I use an output of the microcontroller", "start": 397.94, "duration": 4.46}, {"text": "hooked up to an optocoupler track driver", "start": 402.42, "duration": 2.62}, {"text": "and finally a TRIAC like it shown here.", "start": 405.36, "duration": 2.82}, {"text": "As soon as the ignition point is reached the microcontroller lights up the LED for small inputs time", "start": 408.82, "duration": 6.88}, {"text": "which activates the first TRIAC and thus also the second TRIAC.", "start": 415.86, "duration": 4.8}, {"text": "And just like that, we should be able to create a digital microcontroller dimmer.", "start": 421.52, "duration": 5.08}, {"text": "But what I forgot was how to supply five volts power for the circuits", "start": 426.84, "duration": 4.32}, {"text": "Well, initially, I wanted to use a capacitive dropper circuits", "start": 431.76, "duration": 4.36}, {"text": "-- which I showed you how to build in a previous video.", "start": 436.36, "duration": 3.34}, {"text": "But then I realized that there's a risk of having a voltage potential of  230 volts", "start": 440.06, "duration": 5.88}, {"text": "across the potentiometer to earth.", "start": 445.94, "duration": 2.0}, {"text": "And thus I decided that this was not the best idea.", "start": 448.42, "duration": 3.6}, {"text": "Instead I got myself this pretty small Hi-Link five volts mains power supply.", "start": 452.9, "duration": 5.48}, {"text": "That can deliver more than enough current for our circuits.", "start": 458.6, "duration": 3.44}, {"text": "So what I did next was searching for suitable SMD components.", "start": 463.049, "duration": 4.61}, {"text": "And then calculating the complimentary passive components for them", "start": 467.88, "duration": 3.9}, {"text": "according to the datasheet specifications.", "start": 471.82, "duration": 3.34}, {"text": "This resulted in this a bit confusing to look at hand-drawn schematic", "start": 475.4, "duration": 4.78}, {"text": "which through the help of easy EDA.", "start": 480.58, "duration": 2.4}, {"text": "I turned into a more pleasant to look at schematic", "start": 483.0, "duration": 2.84}, {"text": "to which I also edit an ISP-header to later easily program the microcontroller.", "start": 485.84, "duration": 5.66}, {"text": "So next I clicked the converter PCB button installed arranging the components in a logical order", "start": 492.12, "duration": 7.0}, {"text": "After then connecting the components with copper traces", "start": 499.88, "duration": 3.14}, {"text": "Adding the outline of the boards and creating a ground copper layer on the top and bottom sites", "start": 503.34, "duration": 6.04}, {"text": "I think the PCB did not look half bad.", "start": 509.56, "duration": 3.14}, {"text": "So I clicked the generate Gerber files button", "start": 513.12, "duration": 3.16}, {"text": "and ordered my PCB from JLCPCB for only two dollars -- plus shipping, of course.", "start": 516.58, "duration": 6.26}, {"text": "After not even a week.", "start": 523.72, "duration": 1.48}, {"text": "I did not only receive my PCBs which looked even better in real life than on a computer screen", "start": 525.2, "duration": 6.06}, {"text": "but also all of the SMD components.", "start": 531.32, "duration": 3.3}, {"text": "And through the help of a lot of flux. I'll find soldering tip as well as thin soda", "start": 534.84, "duration": 5.68}, {"text": "I added all of the SMD components to the PCB in less than an hour", "start": 540.64, "duration": 4.96}, {"text": "After then also soldering in all of the THT components", "start": 546.32, "duration": 4.38}, {"text": "this circuit was finally completes.", "start": 550.74, "duration": 2.16}, {"text": "And only came with one minor package size problem", "start": 553.14, "duration": 3.5}, {"text": "To program the microcontroller, I connected the ISP-header to on Arduino Uno", "start": 557.04, "duration": 5.68}, {"text": "according to pretty much any Arduino Uno ISP programmer tutorial ever", "start": 562.98, "duration": 5.22}, {"text": "and started writing the code for the ATtiny.", "start": 568.56, "duration": 3.28}, {"text": "Now, I will not go through the code line by line and explain it.", "start": 572.44, "duration": 4.08}, {"text": "Since I commented the function of each line in the final codes.", "start": 576.52, "duration": 4.12}, {"text": "And I already told you the functional concepts of a microcontroller dimmer a couple of minutes ago.", "start": 580.64, "duration": 6.54}, {"text": "But if you're still confused", "start": 587.76, "duration": 1.64}, {"text": "then make sure to watch my Arduino 101, 102, 103  and microcontroller timer videos.", "start": 589.4, "duration": 7.68}, {"text": "Nevertheless though, the code is pretty simple and easily customizable", "start": 597.74, "duration": 5.36}, {"text": "which is always a plus point when it comes to microcontroller designs.", "start": 603.1, "duration": 4.5}, {"text": "And after burning the bootloader to the ATtiny and uploading the codes", "start": 608.16, "duration": 5.36}, {"text": "it was time to connect the mains voltage wires", "start": 613.66, "duration": 3.1}, {"text": "For which I also added a fuse in series for safety reasons", "start": 616.94, "duration": 4.5}, {"text": "And luckily after powering the circuits nothing exploded.", "start": 621.96, "duration": 4.02}, {"text": "That is why I added the E27 socket with halogen light bulb to the circuits", "start": 626.36, "duration": 6.06}, {"text": "in a very unsafe way.", "start": 632.44, "duration": 2.02}, {"text": "And tested whether I could dim its brightness which was certainly possible", "start": 634.56, "duration": 4.66}, {"text": "And after connecting the voltage of the light bulb to the oscilloscope", "start": 640.14, "duration": 3.98}, {"text": "we can see that the waveform is pretty much what we hoped for.", "start": 644.3, "duration": 3.94}, {"text": "Awesome!", "start": 648.4, "duration": 1.54}, {"text": "Even dimming the LED light bulb from my friend was partly possible with a bit of flicker", "start": 649.94, "duration": 5.76}, {"text": "Other LED light bulbs, however, work perfectly fine with my DIY dimmer", "start": 656.24, "duration": 4.82}, {"text": "while others did not work at all.", "start": 661.12, "duration": 3.02}, {"text": "The reason for that is pretty complex, which is why I will save this topic for future video", "start": 664.14, "duration": 5.8}, {"text": "For now, though, we can say that my DIY dimmer costs around the same as the buy version.", "start": 670.58, "duration": 5.8}, {"text": "Is easily customizable and reaches a lower face angle than the buy version", "start": 676.66, "duration": 5.16}, {"text": "However, the safety aspects of my circuits are quite honestly terrible", "start": 682.74, "duration": 4.96}, {"text": "While the buy version obviously had to follow safety standards", "start": 688.08, "duration": 4.1}, {"text": "So if we consider that we can get better working commercial dimmers for slightly higher price points,", "start": 692.68, "duration": 5.9}, {"text": "which I might test in the future, I have to say that mostly due to safety reasons,", "start": 698.72, "duration": 6.3}, {"text": "the buy option is this time the winner for me.", "start": 705.1, "duration": 3.14}, {"text": "And with that being said, I hope you enjoyed this video and learned something new.", "start": 708.46, "duration": 4.74}, {"text": "If so, don't forget to like share and subscribe", "start": 713.68, "duration": 2.78}, {"text": "Stay creative and I will see you next time.", "start": 716.98, "duration": 3.9}]