[{"text": "WELCOME GAMERS! TO The Official Discord Painting Competition(by google)", "start": 0.0, "duration": 3.18}, {"text": "Where a hundred people will be forced to use MS paint to draw the most compelling and breathtaking images", "start": 3.18, "duration": 5.34}, {"text": "All contestants will compete for a chance to win", "start": 8.56, "duration": 2.28}, {"text": "$1,000 sponsored by my mom's ᵖᵘʳˢᵉ", "start": 10.84, "duration": 3.14}, {"text": "And partnered up with Dollar Shave Club the hosts: ME.  The judges: the entire twitch chat. Let's see how this goes", "start": 14.04, "duration": 6.74}, {"text": "Also, make sure to join the Discord server down below", "start": 21.119, "duration": 2.01}, {"text": "While you guys draw on MS paint, it has to be on MS paint. I will be drawing on the board camp", "start": 24.0, "duration": 5.96}, {"text": "Oh my god. Oh my god. I'm so sorry. The board cam is right here", "start": 29.96, "duration": 3.14}, {"text": "Meaning every time you guys will draw I will be drawing here myself since it's a first round we're gonna get people 10 Minutes.", "start": 33.12, "duration": 6.64}, {"text": "You will go on the paintings chat, and you will submit your *Yeet* paintings *Quackity laughs*", "start": 39.78, "duration": 4.8}, {"text": "THAT'S GONNA BE THE FIRST PICTURE", "start": 44.58, "duration": 1.56}, {"text": "Here's a catch: you have to draw that picture like so,  AND add something of your own. Creativity counts A lot. Let's f*cking do this.", "start": 46.14, "duration": 7.82}, {"text": "I Can't fucking, I can't fucking poop *Rip the baby*", "start": 57.1, "duration": 3.1}, {"text": "Let's f*cking do this. We're just gonna draw his massive chin ass cracks anime eyes- NO He's crying", "start": 60.3, "duration": 6.52}, {"text": "Those are beautiful crying eyes. Stop it. I'm trying my best man. I'm not making him a furry", "start": 66.84, "duration": 5.22}, {"text": "I already gave him anime eyes. Like you guys told me to. OH, that's beautiful. I'll you give a kiss *MWAH*", "start": 72.06, "duration": 5.73}, {"text": "I can't- HhA. I can't f*cking, I can't fucking poop. I think it looks fucking incredible", "start": 77.79, "duration": 5.79}, {"text": "👏👏👏👏👏👏👏👏👏👏👏", "start": 83.58, "duration": 2.36}, {"text": "10 MINUTES OVER. x2", "start": 85.94, "duration": 1.84}, {"text": "First one!", "start": 87.78, "duration": 1.64}, {"text": "*Quackity laughs*", "start": 89.42, "duration": 0.94}, {"text": "Did you cover him in  F*UCKING POOP?!", "start": 90.36, "duration": 2.66}, {"text": "You covered him in shit. And that's a YES?", "start": 93.26, "duration": 2.06}, {"text": "He did it! Chat- Chat says yes.", "start": 96.24, "duration": 3.0}, {"text": "*Quackity laughs more*", "start": 99.28, "duration": 3.42}, {"text": "When the POOP DEALER F*CKING DIES ;-;", "start": 102.94, "duration": 1.84}, {"text": "Did you cover him in shit too?!  you make it to the next round ma friend.", "start": 104.8, "duration": 3.72}, {"text": "Hah- You put him in the toilet? *inhale* YOU PUT HIM IN A TOILET", "start": 108.52, "duration": 3.64}, {"text": "That is a yes from the chat! the chat likes you what did you d- HAHAHA?", "start": 112.44, "duration": 3.88}, {"text": "What did you do to him? Kiss me my so- is that me? who is that? is that the POOP DEALER?", "start": 116.88, "duration": 4.5}, {"text": "It's a NO from chat. What- what the f*ck?! Why'd you give him such as clown hat?", "start": 121.52, "duration": 5.02}, {"text": "What did you do to the poor clown man? ;-;", "start": 126.54, "duration": 2.28}, {"text": "It's like really 50/50 chat 👏👏! is 👏 this a yes or no from chat? AND he stays in the competition, that's incredible!", "start": 128.86, "duration": 7.04}, {"text": "What the hell man my digestive system is working just fine my friend sorry the colors are wrong", "start": 138.739, "duration": 5.66}, {"text": "I'm colorblind Wow, and the chat says yes", "start": 144.4, "duration": 2.369}, {"text": "Just looks like a goddamn blob it looks like patrick cockburn song", "start": 150.44, "duration": 4.069}, {"text": "Looks like", "start": 156.47, "duration": 1.89}, {"text": "Mommy quack take it. I'm not his mom. Imagine your child wakes you up in the middle of the night says I can't fucking", "start": 158.36, "duration": 7.039}, {"text": "Let's go quick I guess my heart this is so sad. Alright chat said yes you made it in I can't", "start": 167.93, "duration": 7.55}, {"text": "Yes", "start": 178.94, "duration": 2.0}, {"text": "Are you guys fucking joking is this a fucking joke you guys constant you guys concept but I get yeah, fuck it", "start": 182.72, "duration": 5.959}, {"text": "Whatever subscribe or I cry? No, I'm not gonna let the chat vote on you straight-up", "start": 188.68, "duration": 4.559}, {"text": "That can be stru feeling look at that, he's got like snot coming out of his nose - good job", "start": 196.25, "duration": 6.769}, {"text": "That is incredible. Remember guys anything that looks like shit", "start": 203.019, "duration": 3.15}, {"text": "I'm not even gonna submit it to voting cuz you guys somehow let this guy", "start": 206.17, "duration": 3.629}, {"text": "Make it to the next fuckin what's wrong with you guys? You gave him 3 chins you gave him three fucking Chin's dude", "start": 209.989, "duration": 6.38}, {"text": "Wait boating. Yes", "start": 216.4, "duration": 1.0}, {"text": "Ok chat wants you in and his name is your game list of the winners", "start": 217.4, "duration": 4.309}, {"text": "Taco Bell event I Jack at the alien Joe diamond board - dream on 3 a.m", "start": 221.81, "duration": 5.329}, {"text": "Coco Natalie buckaroo pingu's waifu is up is garvik log sign pepper. Oh, whoa chatting your game", "start": 227.709, "duration": 6.389}, {"text": "We all get a clap ladies gentlemen", "start": 234.099, "duration": 2.0}, {"text": "It's gonna be one big one battles from now on so it's time to add the next image", "start": 238.85, "duration": 4.129}, {"text": "Okay, are you ready are you ready for the next round chat should we give them five or ten minutes chat, please? Oh", "start": 245.3, "duration": 6.229}, {"text": "My god, I'm snapping him. Hold on check this out now", "start": 255.709, "duration": 2.839}, {"text": "It's a picture of Steve Harvey doing the sexy tongue flick", "start": 261.38, "duration": 3.919}, {"text": "I'm doing a greatest job. Can I call it babe instead of calling him Steve Harvey? Can I just call him Dave?", "start": 267.65, "duration": 5.149}, {"text": "I think it's looking great. I think it looks really good. Oh, oh shit", "start": 272.8, "duration": 4.2}, {"text": "Why did that all give them a tail make him say? Oh whoa, watch this", "start": 277.25, "duration": 3.769}, {"text": "Hello I Morgan Freeman as you can see quackety is having terrible Vietnam flashbacks", "start": 287.09, "duration": 6.98}, {"text": "But will he ever recover find out after this brief message from?", "start": 294.11, "duration": 4.309}, {"text": "quackety", "start": 298.97, "duration": 1.47}, {"text": "listen guys", "start": 300.44, "duration": 0.71}, {"text": "I grow facial hair at least", "start": 301.15, "duration": 1.69}, {"text": "10 times a day and I hate it which is why today's video has been sponsored by Dollar Shave Club", "start": 302.84, "duration": 5.63}, {"text": "Dollar Shave Club offers a wide variety of products apart from having high-quality shaving razors and shaving", "start": 308.63, "duration": 5.359}, {"text": "Essentials they also offer personal care items like a daily face cleanser body cleanser hair and scalp shampoo in items like a high-quality", "start": 314.54, "duration": 7.759}, {"text": "Toothbrush and some really nice toothpaste. Remember to always brush your teeth. Okay all of this in a starter set box that it's only", "start": 322.64, "duration": 6.379}, {"text": "$5. Oh and try to get your cat or theirs smells really nice", "start": 329.54, "duration": 3.199}, {"text": "so if you're like me and you want to keep clean and hygienic", "start": 332.75, "duration": 2.39}, {"text": "You won't want to miss out on this special", "start": 335.39, "duration": 2.089}, {"text": "$5 starter set box offer an offer that you can access by clicking on the link on the description", "start": 337.79, "duration": 4.729}, {"text": "Below and that is all the time. I have I need to get back to shaving my ten times a day facial hair", "start": 342.77, "duration": 5.48}, {"text": "We are now back perhaps now quackety has snapped out of his Vietnam flashbacks", "start": 348.89, "duration": 5.959}, {"text": "He didn't", "start": 359.72, "duration": 2.0}, {"text": "So we got Natalie and shiny", "start": 364.1, "duration": 2.179}, {"text": "Ami", "start": 372.38, "duration": 1.14}, {"text": "Talkable. All right, you really know you're gonna put it in. Anyways, if I'm not ready. You should give us the good image", "start": 373.52, "duration": 6.709}, {"text": "No, I'm gonna give you the worst insight", "start": 380.229, "duration": 2.19}, {"text": "Now nice nice I'm trying so hard", "start": 386.69, "duration": 4.609}, {"text": "Cheryl babe. Okay, they're gonna share of eight. They're gonna share a baby because of that donator", "start": 400.729, "duration": 3.71}, {"text": "We have five seconds. We have five seconds. Come on, okay", "start": 404.44, "duration": 3.149}, {"text": "Sorry, yeah, are you ready? Let's do this", "start": 408.979, "duration": 2.78}, {"text": "Your daddy loved you, what's how", "start": 414.979, "duration": 2.12}, {"text": "This is incredible, how do you guys feel how'd you guys feel this round terrible stressful the winner of this round is taco", "start": 419.78, "duration": 7.25}, {"text": "I", "start": 427.729, "duration": 1.801}, {"text": "Didn't know I will get this far to be honest", "start": 429.53, "duration": 2.0}, {"text": "And now is stroke tied with a bad time, are you guys feeling today whoa stressed well, you know what they say", "start": 434.66, "duration": 6.229}, {"text": "They don't say anything. I'm sorry", "start": 441.979, "duration": 2.0}, {"text": "That looks like a Beatles outfit cap, we should I get I'm knocking giving titties we have four minutes left. Yes", "start": 449.03, "duration": 5.72}, {"text": "Yes a gold chain indeed, sir", "start": 455.06, "duration": 2.51}, {"text": "Maybe they're mad cause he's smoking and he's", "start": 464.27, "duration": 2.029}, {"text": "Fucking mad no hoes bad dude, Carl Weezer not mad hos mad and the boats are in my friends", "start": 477.47, "duration": 6.95}, {"text": "Yes, Joe diamond, how do you feel betrayed my chest goes mad? No, I'm just kiddin", "start": 488.3, "duration": 5.029}, {"text": "Welcome to the competition, how are you guys feeling horrible? Alright. Whoa, how are you doing?", "start": 496.55, "duration": 4.519}, {"text": "Right, so", "start": 505.28, "duration": 2.0}, {"text": "I've been dying to drop Brendan Fraser since I was a kid present freezer crawl my god not five minutes five minutes like shit", "start": 509.84, "duration": 6.529}, {"text": "Shit. Oh my", "start": 516.53, "duration": 2.0}, {"text": "Red eyes guys. What should I add?", "start": 519.11, "duration": 2.0}, {"text": "I'm gonna have a stroke with my hand because that's now it looks like they did his haircut", "start": 522.41, "duration": 3.949}, {"text": "I can't believe it's actually fucking working. Okay, that looks amazing", "start": 526.36, "duration": 4.02}, {"text": "Please spare my ass what Oh", "start": 536.72, "duration": 2.27}, {"text": "Louise you made him a clown the winner of this round is blob", "start": 539.99, "duration": 4.64}, {"text": "With clowns not 3h, I'm this really pretty. Oh, thank you, but apparently I am the host better size", "start": 545.39, "duration": 6.95}, {"text": "There are five people left in the competition and all of them will compete in a free-for-all round", "start": 556.49, "duration": 4.58}, {"text": "The three highest voted will proceed on to the next round. It's the Avengers", "start": 561.07, "duration": 4.049}, {"text": "Sally what would you do with a thousand dollars any less any issues?", "start": 565.67, "duration": 3.14}, {"text": "I kind of want to use it for college probably buy something really nice for my mom get a new computer", "start": 568.81, "duration": 4.5}, {"text": "Although this is the next Tibbets. Let's go", "start": 573.56, "duration": 2.539}, {"text": "and", "start": 576.89, "duration": 2.0}, {"text": "Ak-47", "start": 579.27, "duration": 2.0}, {"text": "Yeah", "start": 585.33, "duration": 2.0}, {"text": "- Elmo", "start": 607.96, "duration": 2.0}, {"text": "Chose Glade now that you guys can start boating the poll just started I", "start": 615.73, "duration": 4.4}, {"text": "Did not even think I was gonna get this far sooner", "start": 624.46, "duration": 2.809}, {"text": "I mean the people who make it to the next round is Jackie", "start": 627.88, "duration": 4.82}, {"text": "What is fucking broccoli here look like", "start": 658.21, "duration": 2.09}, {"text": "What is he holding? Oh, he's holding divorce papers. A divorce isn't complete without tears Brett's a fucking clown", "start": 660.82, "duration": 6.169}, {"text": "Hos are not mad its hos love and love is love send me the rent I", "start": 675.79, "duration": 4.07}, {"text": "Think I lost a key you are a winner in my book the winner of this round is Ben's hai and Taco Bell sushi", "start": 691.66, "duration": 7.25}, {"text": "To keep with a tradition what I did last time was at the end round", "start": 703.63, "duration": 3.799}, {"text": "I told everyone to complete all these characters and put them into one single picture. That's what you guys are gonna do for the next", "start": 707.43, "duration": 7.799}, {"text": "And the timer starts now good luck fellas, I know you can do this well, thank you. They love to -", "start": 717.21, "duration": 6.019}, {"text": "All right, the first one was Spanos, oh my god, it's not it's not Kirby", "start": 725.49, "duration": 5.84}, {"text": "Pull-on I got a given body. Otherwise, this is just like a weird fever dream", "start": 734.67, "duration": 3.44}, {"text": "All right. Now the dog it looks like a fucking piggy. It's not like it's not a fucking dick lit, dude", "start": 738.35, "duration": 6.57}, {"text": "I don't want to draw this again, but I have to this alone will explain the first one shut the fuck up", "start": 744.92, "duration": 4.799}, {"text": "No, does it. All right host mad host mad. This is a mess", "start": 749.72, "duration": 3.42}, {"text": "Oh my god, it's bald and rash. Stop saying it belongs in the fucking trash. No, it doesn't there's a fucking trash", "start": 753.41, "duration": 6.09}, {"text": "Where does Elmo fit in here what else what else belongs in here? That's it. That's how we thought it'd", "start": 759.81, "duration": 6.2}, {"text": "Been Ty and Hannah, how are you guys feeling? How are you guys doing? How did you guys feel nervous?", "start": 767.04, "duration": 5.66}, {"text": "I have $29 my bank account. Oh, this will define if you are dis court's greatest painter. Oh,", "start": 773.03, "duration": 6.839}, {"text": "Do you turn it up? Oh, yeah, we had it in Yoda afterwards. Holy shit and Ben's hi-ho sad", "start": 781.2, "duration": 7.58}, {"text": "It's okay the book", "start": 788.78, "duration": 1.96}, {"text": "Dealers in a better place. No this can't be up it does", "start": 790.74, "duration": 3.32}, {"text": "I'm gonna finish the poet fellas. Thanks Ike you are the winner of an official discord eating competition", "start": 796.05, "duration": 7.4}, {"text": "I", "start": 806.39, "duration": 2.0}, {"text": "Know your tactics good job. Thanks", "start": 808.62, "duration": 3.559}, {"text": "Guys that was", "start": 813.81, "duration": 1.8}, {"text": "Incredible Ben tell you what how you feelin. How you feelin?", "start": 815.61, "duration": 3.17}, {"text": "Thank you very much. Turbot last time I felt so guilty second place didn't get anything. So, you know what Chet?", "start": 818.93, "duration": 5.67}, {"text": "What's your the second place get chat is saying?", "start": 824.63, "duration": 2.729}, {"text": "$500 and you know what? I'm all for it bet I get", "start": 827.94, "duration": 2.39}, {"text": "$2,000 benefits part for me. I feel like this is a dream. I'm gonna wake up and it's like oh, yeah you dream", "start": 830.85, "duration": 5.599}, {"text": "it's been a", "start": 836.45, "duration": 1.06}, {"text": "Wild ride thank you for watching the official discord patty competition by boys will be completely dead after this", "start": 837.51, "duration": 7.58}, {"text": "I'll see you guys in the next one", "start": 845.09, "duration": 2.309}, {"text": "Thank you guys so much for watching", "start": 848.01, "duration": 1.7}, {"text": "This is the end of the competition make sure to follow my twitch account since that's where the whole event was", "start": 849.71, "duration": 3.899}, {"text": "Livestream and make sure to join the discord Center, which is where it all went down. Thank you guys so much for watching", "start": 853.68, "duration": 4.49}, {"text": "I'll see you next time", "start": 858.17, "duration": 2.0}]