[{"text": "I", "start": 0.03, "duration": 2.0}, {"text": "Am run out of intros this is what I'm doing now. Okay, the why leave your entry?", "start": 3.969, "duration": 7.22}, {"text": "close", "start": 12.549, "duration": 2.0}, {"text": "Grab your favorite minecraft merch and let's get it gamers", "start": 18.76, "duration": 3.83}, {"text": "What is happening 12 hour minecraft livestream at a hundred million subscribers? Come on gamers", "start": 22.63, "duration": 5.36}, {"text": "It's my favorite part of the week after playing minecraft reviewing the luau means oh, yes", "start": 27.99, "duration": 5.64}, {"text": "Finally bing-bong baby. Fuck", "start": 34.18, "duration": 2.0}, {"text": "My hue my craft house is epic. So that was a freaking look", "start": 36.82, "duration": 4.579}, {"text": "Good bitch. Hey, you know if you want to be mad be mad at sigh that's why right side. I'm blaming you", "start": 43.69, "duration": 4.849}, {"text": "It was his idea. I was like site what's good idea of thumbnail? I", "start": 48.73, "duration": 4.069}, {"text": "Think at least I don't remember was it yeah, it's eyeful. Mr", "start": 54.52, "duration": 3.649}, {"text": "Bies speaking the language of gods make sure you limit your video game time today. I don't want you to become super violent", "start": 58.17, "duration": 6.419}, {"text": "Remember before games war wasn't a thing lovely more hate them. Let's get real everyone loved him. Mr", "start": 65.29, "duration": 6.29}, {"text": "Dees spitting facts pity pie. I think my humor has become less childish over the years", "start": 71.58, "duration": 5.459}, {"text": "You think you're better than fart noises", "start": 79.24, "duration": 2.0}, {"text": "No one's better than fart noises, let's get the brilliant 12-hour Minecraft livestream at the hundred million. Oh", "start": 82.78, "duration": 6.529}, {"text": "Are we at 99 yet? Come on gamers minecraft Vicky Felix trying to beat the wither using zombie pigmen", "start": 92.95, "duration": 6.349}, {"text": "The wither is immune to all attacks from other undead monk except skulls from other withers", "start": 99.369, "duration": 7.1}, {"text": "Definite. Oh, here's the thing. I knew okay. I just thought that would be a good decoy", "start": 106.899, "duration": 4.79}, {"text": "There were all the people saying that they heal them and that confused me as well, but they definitely serve their purpose", "start": 111.689, "duration": 5.67}, {"text": "Okay Thank You Pig mate", "start": 117.369, "duration": 2.0}, {"text": "Very great. Hey guys. So today we finally build the cobblestone generator", "start": 120.1, "duration": 4.369}, {"text": "Yeah, I think I think it's time you can play something else in Minecraft we're still stuck on the club poster", "start": 126.1, "duration": 6.56}, {"text": "Otherwise, it's this episode 500 at this points men has enter the nether twice. Okay, kill two", "start": 133.5, "duration": 6.77}, {"text": "Llamas, okay entered the freaking room", "start": 140.27, "duration": 2.699}, {"text": "Okay, all without Felix permission just like a rebel teenager Spanish growing up. This is so cute", "start": 143.16, "duration": 7.16}, {"text": "He also got married meanwhile in Hong Kong throughout the protests. Pure news. Say was oh my god", "start": 150.32, "duration": 7.919}, {"text": "What do I have to do? I'll call Papa Gloria. She's been on vacation. She's been having a good time", "start": 158.76, "duration": 5.119}, {"text": "I'll get her on this stack. She's been playing Minecraft", "start": 164.33, "duration": 2.91}, {"text": "When you forget to refrigerate your meatball, I don't like this. I don't even realise. What am I gonna do? I?", "start": 167.97, "duration": 6.98}, {"text": "Have to climb the meatball", "start": 177.15, "duration": 1.49}, {"text": "What do I gotta do?", "start": 178.64, "duration": 1.17}, {"text": "People said I should put the red sauce on it like pee I should put like red carpet over it you dumb vault", "start": 179.81, "duration": 5.58}, {"text": "You're a bunch of dumb balls. Okay, that's the worst suggestion I've ever heard in my life Swedish people", "start": 185.39, "duration": 5.009}, {"text": "Don't put tomato sauce on their meatballs. That's Italians. You dummy dumb dumb. We put brown sauce on our meatballs", "start": 190.4, "duration": 6.51}, {"text": "Honestly, you should probably just delete your YouTube account where ever it made that comment. Oh my god, that is the cutest", "start": 197.31, "duration": 6.5}, {"text": "Who made this the Kiawah? Thank you very much. That's really cute. Then. We'll appreciate", "start": 204.78, "duration": 5.36}, {"text": "We can use Spence, okay?", "start": 210.9, "duration": 2.0}, {"text": "Scared for shadowy noises see I notice it even when I was editing. I said it like three times in a row a night", "start": 214.74, "duration": 6.199}, {"text": "I let one end because I needed a sentence now", "start": 220.94, "duration": 3.54}, {"text": "I'm starting to understand what it's like to be an editor and having to cut through my speech impediment Jesus Christ", "start": 224.48, "duration": 6.509}, {"text": "I can see say freak as many times as I want YouTube", "start": 230.989, "duration": 3.36}, {"text": "What are you gonna do people are saying that they got a mineral add while I said Frick Frick Frick, baby", "start": 234.35, "duration": 5.339}, {"text": "What are you gonna do YouTube breakfast?", "start": 240.42, "duration": 2.0}, {"text": "You can't stop the frickin e you can stop scared Peter pie, but you can't stop freaking me grandpa. I found your old stuff", "start": 242.79, "duration": 6.679}, {"text": "What is it? It's a damn shame", "start": 249.709, "duration": 1.561}, {"text": "I'm gonna tell you a great story", "start": 251.27, "duration": 2.0}, {"text": "What you name your child is when after spend all well", "start": 253.44, "duration": 4.85}, {"text": "What is this poor people food Felix, excusing the peepee poo-poo armor for healing the weather during the second phase. The people are", "start": 258.51, "duration": 7.639}, {"text": "knowing that the Whizzer regenerates the", "start": 266.9, "duration": 2.0}, {"text": "Second. Why do you know what tell me everyone just goes don't showman him by the house. That's all I heard", "start": 269.389, "duration": 5.9}, {"text": "No actual help. You should sleep the nether Phoenix", "start": 275.33, "duration": 3.29}, {"text": "Can't trust you jab in heaven watching Felix literally making a sex dungeon", "start": 278.9, "duration": 4.82}, {"text": "What oh, yeah. Hey, hey, hey Frick dungeon get it right gamer gaming week", "start": 285.41, "duration": 6.35}, {"text": "gaming month", "start": 292.76, "duration": 1.77}, {"text": "minecraft addiction good morning gamers", "start": 294.53, "duration": 2.839}, {"text": "This is the daily episode 69 34 Micro Micro must have passed away. But at least oh", "start": 297.919, "duration": 5.9}, {"text": "Oh", "start": 308.03, "duration": 2.0}, {"text": "I'm a terrible parent", "start": 317.389, "duration": 2.0}, {"text": "The green parent that Felix trap waiting for Felix. Oh my god", "start": 319.789, "duration": 4.31}, {"text": "I'm so sorry. I", "start": 324.83, "duration": 2.149}, {"text": "Need to retrieve him now the perfect birthday party does annex why we is that redstone", "start": 331.19, "duration": 6.589}, {"text": "What is redstone tastes like?", "start": 338.84, "duration": 2.0}, {"text": "Red, where's that shoot? You have hundred million YouTube subscribers", "start": 341.84, "duration": 4.429}, {"text": "What's your next video? It's not", "start": 346.97, "duration": 2.779}, {"text": "No one's gonna want anything else let's get real here, come on gamers", "start": 352.58, "duration": 3.559}, {"text": "well", "start": 356.27, "duration": 0.5}, {"text": "our life game act 100 million", "start": 356.77, "duration": 3.57}, {"text": "Subscribe end credits scene after peopie beats the wither fine. I'll do it myself", "start": 360.83, "duration": 5.33}, {"text": "I love how epic that was legit. I was tearing up myself editing a night", "start": 367.51, "duration": 4.349}, {"text": "I appreciate all the nice comments me when I'm scrolling through this", "start": 371.86, "duration": 3.54}, {"text": "Subreddit without watching the latest video", "start": 376.28, "duration": 2.389}, {"text": "I'm always so confused. Big fan didn't watch the latest video fake fan", "start": 380.08, "duration": 4.829}, {"text": "You see you need an extremely high IQ to understand PewDiePie", "start": 385.099, "duration": 4.309}, {"text": "Ok, the Lord goes extremely in-depth her. He's probably thinking about other villagers him", "start": 389.68, "duration": 6.149}, {"text": "what if PewDiePie actually got the job he applied for at Mojang and the job was to become a youtuber again and", "start": 396.099, "duration": 5.76}, {"text": "Gain, a large enough platform to revive the game after it initially lost popularity. Oh my god", "start": 401.99, "duration": 6.589}, {"text": "Can you imagine how much minecraft gain from not hiring me?", "start": 408.97, "duration": 2.909}, {"text": "Cuz instead I just went and became a youtuber and helped promote the game the KP saw on minecraft", "start": 413.03, "duration": 5.959}, {"text": "Character is not because of your resource pack", "start": 419.15, "duration": 2.119}, {"text": "Optifine has an add-on called caves with this you can wear capes in Minecraft and I gave you mine", "start": 421.669, "duration": 6.02}, {"text": "What that's so sweet. Thank you", "start": 428.419, "duration": 2.69}, {"text": "That explains a lot of so confused peepee poo-poo", "start": 431.87, "duration": 3.259}, {"text": "Pink poop my first post here. Will you start it off?", "start": 436.039, "duration": 3.86}, {"text": "Extremely strong. You're never gonna beat this one. Trust me when you realize that if we never told Felix about swings tail health bar", "start": 440.629, "duration": 6.89}, {"text": "So one would most likely be dead. It ain't much but it done it work Thank You gamers", "start": 447.52, "duration": 4.98}, {"text": "It is actually really helpful because it's the only animal that indicates it, isn't it not knowing anything about Phineas and Ferb", "start": 452.5, "duration": 6.389}, {"text": "I still don't get it. Stop. Stop posting these what if Felix put both of us in the frickin chamber. No, just kidding. Just kidding", "start": 458.889, "duration": 7.019}, {"text": "unless", "start": 466.639, "duration": 1.411}, {"text": "Hey, what happened in the Frick chamber stays in the Frick chamber? It's nice and soft. I think you'll like it Felix", "start": 468.05, "duration": 6.32}, {"text": "Look what you've done", "start": 474.37, "duration": 1.78}, {"text": "jacksepticeye, looking good wanna play Minecraft Oh", "start": 476.15, "duration": 2.569}, {"text": "betrayal", "start": 479.93, "duration": 1.56}, {"text": "you should use ikea bird feather and make an arrow out of it and kill the Ender Dragon with it for eventually that is actually", "start": 481.49, "duration": 7.339}, {"text": "cool, but what you nerds don't know is that inner dragon is immune to arrows so", "start": 488.83, "duration": 5.13}, {"text": "Cringe these guys whose pulls cringe I'm a Minecraft veteran and even I knew that today's episode was freakin beautiful", "start": 495.889, "duration": 6.86}, {"text": "Oh, it was from a few days ago. Thank you guys Swedish people's first name Swedish people", "start": 502.789, "duration": 4.97}, {"text": "What it is now like eight years any time here in UK, what does your name Kajal Berg cuz eulenberg", "start": 510.36, "duration": 7.039}, {"text": "Full of food and then you come back to Sweden me like Oh, mr. Shelburn. Ah", "start": 517.919, "duration": 3.679}, {"text": "Just so good petition to name the place for Felix keep the villagers the ranch that is actually a good idea", "start": 523.139, "duration": 6.59}, {"text": "I like that we could build a giant. Dr. Phil face. Mmm. Oh", "start": 529.73, "duration": 4.049}, {"text": "My god, yes, I saw this", "start": 535.29, "duration": 2.0}, {"text": "We both had the same dumbass face as well", "start": 539.85, "duration": 3.83}, {"text": "Hey, hey", "start": 546.839, "duration": 2.0}, {"text": "This is what happens when you're a Minecraft veteran brain goes infinity and beyond No, don't do this. Stop, please", "start": 549.18, "duration": 7.13}, {"text": "I don't get it. Nobody's born cool, except of course the person that brought Felix that Swedish King I", "start": 556.319, "duration": 7.01}, {"text": "Agree, I agree", "start": 563.85, "duration": 1.529}, {"text": "Gamers helping gamers. I can't believe this is the same person that made a two-time 2x2 piston door and automatic", "start": 565.379, "duration": 7.4}, {"text": "Fuck I don't get it either", "start": 572.779, "duration": 2.0}, {"text": "For some reason whenever I play with other people Jack is the same Rangers goes", "start": 575.189, "duration": 4.369}, {"text": "insane Liebig get in the", "start": 580.649, "duration": 2.0}, {"text": "Last thing you hear before you never see your family again imagine one day", "start": 585.6, "duration": 3.529}, {"text": "You're you're in your garden some Swedish guy walks up behind you. Think what a nice farm you got there", "start": 589.129, "duration": 5.25}, {"text": "That's when you know, it's over", "start": 595.439, "duration": 1.981}, {"text": "You can put stained glass on a beacon to make it different colors. Thank you", "start": 597.42, "duration": 4.459}, {"text": "I know this you should know that I already know this. I like the creeper in the back too. That's good. Haha", "start": 601.91, "duration": 6.27}, {"text": "There's man and oh, please oh", "start": 608.49, "duration": 2.0}, {"text": "Man, I thought people would get mad at me for like changing the weather", "start": 611.459, "duration": 3.47}, {"text": "I know I said like I'll never use creative mode, but clearly for some stuff. It seems like it's necessary", "start": 614.93, "duration": 5.879}, {"text": "I won't use it for building. Okay, or getting material. Let me guess your home", "start": 620.879, "duration": 5.42}, {"text": "It was and it was beautiful, you know", "start": 626.55, "duration": 3.109}, {"text": "Everyone lost their mind over the fact that I summoned the weather in my base despite the fact that people going for days", "start": 629.66, "duration": 5.159}, {"text": "Don't do it. Don't summon the weather in your base, you know the astronaut really wasn't that bad. I", "start": 634.949, "duration": 4.88}, {"text": "Kind of hope it sound like I'm Marv Avengers like aftermath of battle kind of thing", "start": 640.35, "duration": 5.39}, {"text": "Like maybe the meatball had blown up. I was like that would look cool. That would be like, oh, wow really cinematic an epic", "start": 645.74, "duration": 6.15}, {"text": "No, nothing happens", "start": 651.96, "duration": 2.0}, {"text": "Stupid death the golden one stupid death to the diamond one died. Like a hero the dirt one. What?", "start": 654.51, "duration": 7.64}, {"text": "What oh my god, yeah, I", "start": 663.99, "duration": 3.859}, {"text": "Don't know what YouTube is gonna do maybe cool if they did something like that", "start": 669.57, "duration": 4.039}, {"text": "That's so cool magma block", "start": 675.06, "duration": 2.0}, {"text": "Yeah, I don't know how I got that 241 minutes like it's seriously hard to get them that long I printed Felix Minecraft world damn", "start": 683.64, "duration": 7.399}, {"text": "That's awesome. I", "start": 691.8, "duration": 2.0}, {"text": "Get that would look so good Wow pewds villagers", "start": 694.41, "duration": 4.489}, {"text": "0.001 seconds after potato start falling from the ceiling what if", "start": 700.05, "duration": 4.13}, {"text": "Yep, just an idea for when Dinnerbone, you know. Hey, no", "start": 708.33, "duration": 4.609}, {"text": "Fourteen-year-old boys talking about girls. So apparently if you throw food he may", "start": 714.39, "duration": 5.179}, {"text": "Destroy it works. My frickin chamber is gonna be the most advanced thing ever. Oh my god. Yeah", "start": 721.41, "duration": 5.239}, {"text": "I didn't notice this for so long. That's so awesome. I should have called them like GERD Yun or something", "start": 726.65, "duration": 6.63}, {"text": "Yeah, I'm good with names. I don't know what to tell you Brad editing sigh", "start": 733.32, "duration": 4.4}, {"text": "vanity", "start": 738.33, "duration": 2.0}, {"text": "I love how it makes me. Look just in the same pewds in his own survival series piercing sky look, there it is", "start": 741.69, "duration": 6.14}, {"text": "See, I don't I'll blame Ken", "start": 747.96, "duration": 2.0}, {"text": "I'll blame can I don't care about area 51 in view to rewind doesn't have Jurgen Sven or anything about Minecraft", "start": 749.99, "duration": 6.0}, {"text": "We read YouTube. Well, they will definitely have something about Minecraft put a tribute to Ikea bird on your shoulder", "start": 755.99, "duration": 6.059}, {"text": "That's such a good idea. Oh my god. Yes. Yes", "start": 762.72, "duration": 3.35}, {"text": "Absolutely, like a bird has died like four times", "start": 766.74, "duration": 2.54}, {"text": "I", "start": 769.96, "duration": 0.73}, {"text": "Don't know if I already reacted to this but it's okay", "start": 770.69, "duration": 3.74}, {"text": "I'm like the dumbest person. I would like I would like to say the dumbest smart person but no", "start": 782.42, "duration": 6.019}, {"text": "I'm just dumb una bolita meets men, you know full well with this means don't you? Yes", "start": 788.44, "duration": 5.01}, {"text": "Yes, but I have accepted the offering they're sealing the fate of Swedish men's hands", "start": 793.97, "duration": 4.94}, {"text": "I will now accept the fair consequences, even if it means my own demise may Watership with", "start": 798.91, "duration": 5.669}, {"text": "The drama, what is this?", "start": 807.59, "duration": 2.029}, {"text": "What these days I don't get it. Yeah, stop calling my meatball mouldy. Stop. Stop it now stop", "start": 810.17, "duration": 6.949}, {"text": "Yeah, this is", "start": 817.61, "duration": 1.59}, {"text": "This is what I was saying getting at earlier", "start": 819.2, "duration": 2.0}, {"text": "Yes, everyone would probably just make minecraft cringy again. Please please YouTube. You don't have to have me in it", "start": 821.59, "duration": 6.63}, {"text": "Yes, this don't ruin minecraft, please. I love all the fan art", "start": 829.19, "duration": 4.309}, {"text": "I'm taking like a small thing that happened and making it in look like a", "start": 833.5, "duration": 4.59}, {"text": "Thing Felix bonding with her inside bakes. He actually kills it without destroying his bangs at the third one", "start": 839.87, "duration": 6.86}, {"text": "He's disappointed that he didn't destroy space. It's not what I meant", "start": 846.73, "duration": 3.959}, {"text": "Relax, how I accidentally hit my younger brother still touched one how my brother tell him mom. I hit him sharpness five", "start": 851.18, "duration": 7.189}, {"text": "That's good, I understand this much like if you understood this one", "start": 860.45, "duration": 3.859}, {"text": "Don't spawn the weather near your house that same can stop me because I can't read", "start": 865.07, "duration": 4.85}, {"text": "Hey, you can't tell me what to do. You lost those privileges when you killed the first Jurgen. That's right", "start": 870.83, "duration": 6.53}, {"text": "I'm not over you did it you crazies out of a break you did it", "start": 877.36, "duration": 3.57}, {"text": "I don't know much. It was like buddy. Oh my god. It's that many huh. Oh", "start": 885.55, "duration": 4.469}, {"text": "This is so sad everyone went", "start": 894.23, "duration": 2.389}, {"text": "Come on it added tension it added a drama you gotta appreciate it", "start": 899.45, "duration": 3.739}, {"text": "If you don't have hi select, what do you want me to do? Make it everyone's like Oh what you can do", "start": 903.19, "duration": 4.2}, {"text": "It's like you can spawn them in obsidian and that would make the fight easy. Like no no no pain no game", "start": 907.39, "duration": 5.669}, {"text": "You got to do it. Oh", "start": 913.06, "duration": 2.0}, {"text": "My god, there's somebody good memes Garden of Eden has a frickin chamber God creates Adam and Eve also god, yeah", "start": 916.55, "duration": 6.949}, {"text": "What if we all live in the simulation and qtpie", "start": 927.05, "duration": 3.109}, {"text": "Is telling everyone to free I see you crying through your front camera, but I don't blame you. I grind you", "start": 930.68, "duration": 6.5}, {"text": "That was beautiful", "start": 937.79, "duration": 2.0}, {"text": "Council of Watership the council will decide your fate. Oh", "start": 941.81, "duration": 4.7}, {"text": "My god got a prank it", "start": 950.03, "duration": 2.0}, {"text": "I'll bring him back. Okay, I'll bring him back. Okay gamers. That's it for this week's Lawai", "start": 952.43, "duration": 5.36}, {"text": "There's so many more, but I gotta go back playing Minecraft", "start": 957.79, "duration": 2.88}, {"text": "It's much like a be enjoyed if you want to check out protect Sven merch", "start": 960.67, "duration": 3.269}, {"text": "I mean you don't have to but it would be pretty cringe if you don't have it next week. I'll finish up with another", "start": 963.94, "duration": 5.28}, {"text": "Song by party in the backyard and that's it for me for now. See you guys later gamers", "start": 969.77, "duration": 4.099}, {"text": "Sorry", "start": 1002.52, "duration": 1.17}, {"text": "Now we live in together and I adore you. I will fight all those nasty zombies for you", "start": 1003.69, "duration": 6.38}, {"text": "Was almost meaningless before you here best friends till the end. No one else can compare. We got a bond", "start": 1011.22, "duration": 7.22}, {"text": "unbreakable, I love", "start": 1019.17, "duration": 2.0}, {"text": "Unshakable sick just sleep here. Come into my bedroom Rochus. I just wanna free", "start": 1021.9, "duration": 5.959}, {"text": "I've been the second but we had some dope adventures we cross the lattice see in every kind of weather sometimes", "start": 1055.77, "duration": 6.979}, {"text": "Outworking lost I can get a bit distracted, but I always knew you'd find me", "start": 1063.03, "duration": 4.309}, {"text": "So it never really mattered but stable was so epic and Jeff was so pathetic", "start": 1067.34, "duration": 4.83}, {"text": "But when Dinnerbone and broke out when I did feel empathetic I saw when ride the rails I wanted to have a run", "start": 1072.33, "duration": 6.919}, {"text": "So even though it killed me at least I died having some fun", "start": 1079.25, "duration": 3.479}, {"text": "Hey", "start": 1138.28, "duration": 2.0}, {"text": "You can", "start": 1146.39, "duration": 2.0}, {"text": "What you never played super simulator", "start": 1178.89, "duration": 3.049}, {"text": "You know, it's fun, right", "start": 1183.45, "duration": 2.0}, {"text": "I'm not supposed to give my opinion but give it a try and then you can tell me if it's good or not", "start": 1185.52, "duration": 7.01}, {"text": "Not convinced yet. Okay. I'll cut you a deal", "start": 1192.87, "duration": 3.349}, {"text": "The game is available for free and that's a great price", "start": 1196.82, "duration": 3.84}]