[{"text": "wassup  you beautiful bastards. Hope even a fantastic Thursday", "start": 0.0, "duration": 3.179}, {"text": "welcome back to the Philip DeFranco show and let's just jump into and the first thing we're talking about today is the latest edition of", "start": 3.179, "duration": 5.97}, {"text": "Massive online creator at the center of international controversy news that person we're talking about today is PewDiePie", "start": 9.16, "duration": 5.87}, {"text": "I mean this thing blew up everywhere. It was on the BBC and the reason there was such a big reaction", "start": 15.03, "duration": 3.81}, {"text": "Is Felix posted this demi? Lovato me frame by frame? We see mom. Can you give me money for burger to buy burgers?", "start": 18.84, "duration": 5.849}, {"text": "Yes, actually buys heroin like a boss and immediately. You saw people pushing back against this Jimmy Wang tweet. Come on, bro", "start": 24.779, "duration": 5.67}, {"text": "This is making light of something that a lot of humanity struggles with day in and day out and countless families have been torn apart", "start": 30.449, "duration": 4.5}, {"text": "By an offensive humour for the sake of offensiveness isn't edgy", "start": 34.95, "duration": 2.879}, {"text": "It's just lazy and destructive some simply comment saying that it wasn't funny", "start": 37.829, "duration": 3.42}, {"text": "We also saw some fans commenting on the fact. They've supported him previously through scandal after skin tone", "start": 41.25, "duration": 4.379}, {"text": "He was a writing come on Felix. We've stayed with you through a lot", "start": 45.629, "duration": 2.07}, {"text": "Don't make a joke out of someone struggling with such a terrible addiction. She's been fighting this for literal years", "start": 47.7, "duration": 3.899}, {"text": "She went to rehab for this. This is not an OK joke to make there is no ok. Joke to make about this", "start": 51.6, "duration": 4.41}, {"text": "Of course at the same time you had people supporting one saying dark humor is like food, not everyone gets it", "start": 56.01, "duration": 4.68}, {"text": "I'm seemingly arguing that Felix is", "start": 60.69, "duration": 1.84}, {"text": "Unfairly villainize when users are tweeting literally anyone except PewDiePie could have posted that and it would have been fine", "start": 62.53, "duration": 4.43}, {"text": "Y'all just loved living at that man's through as far as Felix's reaction to the online reaction", "start": 67.17, "duration": 4.23}, {"text": "He ended up deleting the tweet and posted lead of meme", "start": 71.4, "duration": 2.369}, {"text": "I didn't mean anything with it and I didn't fully know about the situation. I realize now it was insensitive", "start": 73.77, "duration": 3.989}, {"text": "Sorry, as far as that response was Felix actually ignorant to what was happening with Demi Lovato. It's possible at the very least", "start": 77.88, "duration": 5.489}, {"text": "It's important to note that it doesn't appear that he made the meme himself. It was on other websites", "start": 83.369, "duration": 4.11}, {"text": "It seems like he was just hosting another one", "start": 87.49, "duration": 1.97}, {"text": "He also has a show that's dedicated to memes and we've seen people saying well because he has that show obviously he is", "start": 89.46, "duration": 4.769}, {"text": "Actually aware of the situation whereas others said no", "start": 94.45, "duration": 2.629}, {"text": "It just means that he's sharing this thing that was gaining traction", "start": 97.079, "duration": 2.7}, {"text": "Arguing that that doesn't prove anything and that's really all there is to this story", "start": 99.85, "duration": 3.049}, {"text": "I've seen people throwing out the hashtag", "start": 102.899, "duration": 1.391}, {"text": "PewDiePie who's over party my response to that hashtag is no obviously part of my reaction is based off of past", "start": 104.29, "duration": 5.389}, {"text": "Controversies with Felix and how he was able to survive and not only survive but thrive past though in those situations were arguably more", "start": 109.93, "duration": 6.229}, {"text": "offensive and fueled by a lot of coverage, but also I have that reaction because just if you look at stories in general cancel culture", "start": 116.32, "duration": 6.619}, {"text": "99% of the time failed. I think there's a mixed reason for that", "start": 123.549, "duration": 2.599}, {"text": "There are some people that go, you know what human beings are flawed individuals. Sometimes they're they're not going to be perfect for me", "start": 126.149, "duration": 5.94}, {"text": "They're gonna do wrong", "start": 132.09, "duration": 1.16}, {"text": "I should be open to that and then of course", "start": 133.25, "duration": 1.68}, {"text": "There's the blind love and support that does not falter even in the most extreme of situations that we see with once again", "start": 134.93, "duration": 5.009}, {"text": "Not on the same level in any way, you know like with extreme situations like with a Bill Cosby", "start": 140.25, "duration": 3.949}, {"text": "But ultimately where I land with a story is it isn't me saying?", "start": 144.2, "duration": 2.85}, {"text": "I'm outraged or offended by Felix posting this meme or I want something bad now to happen", "start": 147.05, "duration": 5.069}, {"text": "I mean as far as that memes last joke is concerned", "start": 152.12, "duration": 1.8}, {"text": "it looks like the whole intent is just to troll people to trigger people and it now has very much done that but where I", "start": 153.92, "duration": 5.61}, {"text": "Smile and with this story is more of a question about myself and in", "start": 159.87, "duration": 5.24}, {"text": "Society and hopefully by talking about the world every day. We find out more about people and fuss ourselves as well", "start": 165.209, "duration": 5.18}, {"text": "I end up thinking would I have a different reaction to this story if I replaced Felix with someone else?", "start": 170.39, "duration": 4.559}, {"text": "right\nWhether it be this situation or past ones and I won't include the Nazi stuff since I feel like Felix was wildly misrepresented there", "start": 175.07, "duration": 6.959}, {"text": "right\nBut what if for Felix's?", "start": 182.03, "duration": 1.959}, {"text": "n-word controversy when he when he referred to someone as the n-word while he would stream what if that had been let's say", "start": 183.989, "duration": 5.54}, {"text": "Logan Paul, what if this situation had been Logan Paul or Jake Paul?", "start": 189.63, "duration": 3.949}, {"text": "Would I have a much different reaction to that?", "start": 193.58, "duration": 1.83}, {"text": "Would you have a much different reaction to that and also with some of the people going in on Felix right now?", "start": 195.41, "duration": 4.589}, {"text": "Presumably some of those are Logan Paul fans", "start": 200.1, "duration": 2.089}, {"text": "Would they have a completely different tune if it was Logan at the center of this story?", "start": 202.19, "duration": 3.359}, {"text": "and so the question I want to pass off to you where I want to end this story is", "start": 205.549, "duration": 2.61}, {"text": "What are your thoughts on them?", "start": 208.35, "duration": 1.31}, {"text": "Do you think you would react the same or different and also?", "start": 209.66, "duration": 2.609}, {"text": "People in general you break it down to the nuts and bolts", "start": 212.61, "duration": 2.27}, {"text": "Do you feel like most people are just playing for teams?", "start": 214.88, "duration": 2.819}, {"text": "I lovea know your thoughts on this one", "start": 217.7, "duration": 1.259}, {"text": "Then let's talk about Facebook because yesterday they lost nearly", "start": 218.959, "duration": 2.279}, {"text": "130 billion in market value in two hours and then is Facebook's steepest stock decline ever and just to kind of put this into", "start": 221.64, "duration": 7.009}, {"text": "Context for you", "start": 228.87, "duration": 0.71}, {"text": "because for a lot of people when you start talking about number is this large you might as well be saying but Jillian there's what", "start": 229.58, "duration": 4.86}, {"text": "Do you compare it to Oh for comparison's sake the 130 billion dollars that by itself", "start": 234.44, "duration": 4.649}, {"text": "The loss is more than three times the value of Ford Motor Company and Zuckerberg himself lost sixteen point eight billion in value", "start": 239.09, "duration": 6.33}, {"text": "He dropped from the third richest person in the world to these six", "start": 245.519, "duration": 2.99}, {"text": "So of course thoughts and prayers to Mark Zuckerberg in these trying of times", "start": 248.66, "duration": 3.029}, {"text": "I don't know if he's gonna be able to pull through. He said sarcastically so the question becomes why why did this happen?", "start": 251.69, "duration": 5.519}, {"text": "I mean, there's been Facebook controversy after Facebook controversy. Why now?", "start": 257.209, "duration": 3.66}, {"text": "Well, the massive drop came after a disappointing earnings report and comments made by Facebook's chief financial officer analyst", "start": 260.9, "duration": 4.74}, {"text": "I projected Facebook be bringing in thirteen point three billion dollars this quarter", "start": 265.64, "duration": 3.359}, {"text": "But unfortunately for Facebook they missed that mark getting in just and it's so weird to say just thirteen point two billion", "start": 269.0, "duration": 6.6}, {"text": "So they fall short by 0.1 billion, which doesn't sound like a big number doesn't sound like a big deal", "start": 275.6, "duration": 5.25}, {"text": "But it is important to know that this is the first time they've missed analysts revenue projection since 2015", "start": 280.85, "duration": 4.649}, {"text": "So you at that situation?", "start": 285.5, "duration": 1.12}, {"text": "plus", "start": 286.62, "duration": 0.6}, {"text": "CFO David winner said sales growth would continue to slow down through the rest of the year and Facebook also fell short of analysts projection", "start": 287.22, "duration": 6.47}, {"text": "That they would hit one point four nine billion daily active users instead Facebook had Justin once again", "start": 293.69, "duration": 4.47}, {"text": "Just as a weird word to say one point four seven billion daily active users last month", "start": 298.26, "duration": 4.519}, {"text": "It's important to point out that a lot of this is just based on them not hitting projections", "start": 302.78, "duration": 4.05}, {"text": "The story here is not that Facebook is not growing", "start": 306.83, "duration": 2.25}, {"text": "In fact just from last year daily active user growth jumped 11 percent the story is that they missed", "start": 309.08, "duration": 5.339}, {"text": "projections and I think a lot of people are worried that that is going to be a", "start": 314.58, "duration": 2.599}, {"text": "Continued trend because of all of the past scandals and controversy and moving forward. I think Facebook is going to be fine", "start": 317.28, "duration": 5.33}, {"text": "There is an interesting angle to all of this and that angle and I think the thing that should be pointed out is that for?", "start": 322.61, "duration": 4.47}, {"text": "Some reason despite all of the Facebook controversy Instagram has been largely", "start": 327.08, "duration": 4.589}, {"text": "Untargeted which is interesting considering Facebook owns Instagram. And as far as Facebook's long-term success Instagram seems to be a winner for them", "start": 332.04, "duration": 7.279}, {"text": "You might remember back in 2012 Facebook bought Instagram for the low low price of 1 billion", "start": 339.32, "duration": 4.08}, {"text": "dollars and I say low low price because just earlier this month analysts said that if Instagram was their own company", "start": 343.56, "duration": 5.24}, {"text": "It would be valued at 100 billion dollars", "start": 348.8, "duration": 2.16}, {"text": "Also reportedly Instagram ad revenue is four times more than Facebook's for the year this despite Instagram having less monthly users on Facebook", "start": 351.08, "duration": 6.57}, {"text": "Instagram has around 1 billion where Facebook has around 2 billion and Instagram is just gaining ground right now", "start": 357.81, "duration": 5.33}, {"text": "Which is fantastic news for Facebook", "start": 363.14, "duration": 1.68}, {"text": "when one of your main competitors is another thing that you owns like if Google also owned twitch and they were like", "start": 364.82, "duration": 5.25}, {"text": "Oh, no", "start": 370.07, "duration": 0.55}, {"text": "twitch is gaining so much ground how", "start": 370.62, "duration": 2.119}, {"text": "Horrible that said as far as the success and failures with Facebook or really any other social media company right now", "start": 373.2, "duration": 5.269}, {"text": "Rhonda's gonna have to kind of wait and see but from that I want to share some stuff I loved today and today in awesome", "start": 378.72, "duration": 5.059}, {"text": "Brought to you by Squarespace when they needed domain an online store a beautiful website make it with Squarespace", "start": 383.78, "duration": 4.77}, {"text": "It's just so easy to make a beautiful website with Squarespace is all in one platform. It's easy to use its intuitive", "start": 388.62, "duration": 5.54}, {"text": "There is nothing to install patch or upgrade ever. Maybe you end up meeting some help. They've got winning 24/7 customer service", "start": 394.16, "duration": 6.67}, {"text": "And so if you want to make the smart move like many from the nation already", "start": 400.83, "duration": 2.009}, {"text": "Have you go to squarespace.com slash Ville start your free trial today and when you like it", "start": 402.84, "duration": 3.929}, {"text": "make sure you enter in code fill for 10% off your first purchase the first bit of Awesome today is a little flash sale if", "start": 406.77, "duration": 4.8}, {"text": "You even want to snag the sports shirt the best way to say I am so thankful", "start": 411.57, "duration": 3.269}, {"text": "You invited me to this event, even though I do not know what is going on", "start": 414.84, "duration": 2.85}, {"text": "You want to snag one over the next 36 hours just make sure you entering coupon code", "start": 417.69, "duration": 4.2}, {"text": "Bopha and you'll get 20% off then we got a trailer for to all the boys", "start": 422.08, "duration": 3.379}, {"text": "I've loved before your 10 out giving us", "start": 425.46, "duration": 1.8}, {"text": "How can you change someone's mind got a trailer for season 3 of animals?", "start": 427.26, "duration": 3.449}, {"text": "Which is one of the weirdest shows I've ever watched it got Wiz Khalifa on hot one weird life noggin asking", "start": 430.71, "duration": 5.73}, {"text": "How small are you compared to the galaxy then we had Thrillist giving us ramen pizza", "start": 436.44, "duration": 4.769}, {"text": "Is it actually pizza?", "start": 441.21, "duration": 1.68}, {"text": "And if you want to see the full versions of everything", "start": 442.89, "duration": 1.59}, {"text": "I'll just share the secret link of the day anything and all links as always are in the description down below", "start": 444.48, "duration": 4.289}, {"text": "Let's talk about all this junk", "start": 448.93, "duration": 1.37}, {"text": "we've seen over the past day about impeachment and there of course in the past been moments where you saw Democrats talking about impeaching the", "start": 450.3, "duration": 5.37}, {"text": "President but who we're talking about today? It's not the president yesterday", "start": 455.67, "duration": 3.209}, {"text": "We saw that 11 House Republicans filed articles of impeachment against Deputy Attorney General Rod", "start": 458.88, "duration": 4.35}, {"text": "Rosenstein that of course notable because Rosenstein is overseeing the Russia investigation since Jeff Sessions were accused himself", "start": 463.39, "duration": 4.909}, {"text": "As far as the lawmakers leading this move you had freedom caucus leader congressman mark meadows of, North Carolina", "start": 468.57, "duration": 4.649}, {"text": "You also had congressman Jim Jordan of Ohio", "start": 473.22, "duration": 2.13}, {"text": "They've been threatening to file these impeachment articles for a month claiming residency in both mishandled the 2016 election", "start": 475.54, "duration": 5.209}, {"text": "Investigations and that he is withholding", "start": 480.97, "duration": 1.5}, {"text": "documents from Congress in a statements meadows saying rod Rosenstein has been in charge of the Department of Justice as the agency has made every", "start": 482.47, "duration": 5.959}, {"text": "effort to obstruct a legitimate attempts of congressional oversight the stonewalling over this last year has been just as bad or worse than under the", "start": 488.43, "duration": 6.029}, {"text": "Obama administration for nine months we've warned them consequences. We're coming and for nine months", "start": 494.46, "duration": 3.809}, {"text": "We've heard the same excuses backed up by the same unacceptable conduct time is up, and the consequences are here", "start": 498.27, "duration": 4.62}, {"text": "It's time to find a new Deputy Attorney General who is serious about accountability and transparency", "start": 502.89, "duration": 3.509}, {"text": "And as far as why now?", "start": 506.41, "duration": 1.31}, {"text": "this move is coming after the Department of Justice publicly released a heavily redacted version of the Carter page warrant this weekend and kind of", "start": 507.72, "duration": 5.67}, {"text": "As a quick TLDR carter page as a former trump campaign advisor central figure in the russia investigation", "start": 513.39, "duration": 5.159}, {"text": "the FBI believes a page was targeted by russians to undermine the", "start": 518.55, "duration": 2.7}, {"text": "2016 presidential election by house republicans saying with the FBI abused its power and misled judges when applying for surveillance applications of page as far", "start": 521.349, "duration": 7.01}, {"text": "As the articles of impeachment there are five and I would jump into them", "start": 528.36, "duration": 3.789}, {"text": "But one of the largest updates to this story is they are no longer trying to impeach", "start": 532.149, "duration": 4.71}, {"text": "Rosenstein which makes sense because one had already appeared like it would be a long shot Republicans like Paul Ryan have said they do not", "start": 537.11, "duration": 5.149}, {"text": "Want to impede the Russia?", "start": 542.259, "duration": 1.661}, {"text": "Investigation I mentioned him specifically because he also issued a statement today saying he doesn't believe Rosenstein Zach shion's warrant", "start": 543.92, "duration": 5.089}, {"text": "Impeachment saying I don't think we should be cavalier with this process or this term number two", "start": 549.11, "duration": 3.619}, {"text": "I don't think this rises to the level of high crimes and misdemeanors", "start": 552.73, "duration": 2.19}, {"text": "Which is a really high standard and so now congressman mark Meadows is tabling the pursuit of impeachment", "start": 554.93, "duration": 5.269}, {"text": "But instead now he wants to pursue", "start": 560.199, "duration": 1.961}, {"text": "Contempt if the DOJ doesn't turn over documents as far as why meadow has changed his mind", "start": 562.16, "duration": 4.309}, {"text": "He said he spoke with Republican leaders this including chair of the House Judiciary Committee Bob goodlet and meadows telling reporters", "start": 566.47, "duration": 5.219}, {"text": "I hope we can avoid", "start": 571.73, "duration": 1.2}, {"text": "impeachment and hopefully avoid contempt and get the", "start": 572.93, "duration": 2.0}, {"text": "Documents but certainly both those things are on the table and remain on the table to have more of a contempt process both options remain", "start": 575.0, "duration": 5.539}, {"text": "there also another reason I mentioned Speaker of the House Paul Ryan is you know", "start": 580.54, "duration": 3.75}, {"text": "Jim Jordan the congressman from Ohio that helped lead this whole thing according to reports in the midst of all of this jordan has sent", "start": 584.29, "duration": 5.669}, {"text": "A letter to his colleagues announcing that he is officially running to replace", "start": 589.959, "duration": 3.059}, {"text": "Paul Ryan as Speaker of the House which I mean we already knew that Paul Ryan was retired", "start": 593.18, "duration": 4.219}, {"text": "But it'll be interesting to see which way Trump goes in which way all Republicans go because Paul Ryan has already endorsed Majority Leader", "start": 597.399, "duration": 5.729}, {"text": "Kevin McCarthy and he's also believed to be a favorite with Trump", "start": 603.129, "duration": 2.55}, {"text": "so is the move today in some sort of way a", "start": 605.68, "duration": 2.94}, {"text": "Showing of faith a showing of what kind of Speaker of the House he could be", "start": 609.019, "duration": 4.669}, {"text": "For Trump moving forward also as far as Jeff Sessions take here", "start": 613.939, "duration": 3.65}, {"text": "It appears that he has standing by his man my deputy rod Rosen. Stein is highly capable", "start": 617.589, "duration": 5.099}, {"text": "I have the highest confidence center", "start": 622.699, "duration": 2.9}, {"text": "And then adding what I would like Congress to do is to focus on some of the legal challenges that are out", "start": 625.6, "duration": 3.809}, {"text": "There you need Congress to deal with the immigration question for now that is where we are and it will be interesting to see going", "start": 629.41, "duration": 4.859}, {"text": "Into the midterms. Does this escalate does it go away?", "start": 634.269, "duration": 2.73}, {"text": "Also once Paul Ryan is no longer Speaker of the House once we see", "start": 637.0, "duration": 3.269}, {"text": "What the shuffling in the House of Representatives ends up looking like what happens from there? It's not how everything shakes out", "start": 640.43, "duration": 5.899}, {"text": "Do we see this reimagine?", "start": 646.329, "duration": 1.56}, {"text": "let's talk about the news and", "start": 647.889, "duration": 1.091}, {"text": "Reports of the White House banning a reporter for the questions that she was asking and it's been really interesting to watch the different", "start": 648.98, "duration": 5.75}, {"text": "Reactions to this but we'll start off at the top yesterday at an oval office photo op a CNN reporter by the name of Caitlin", "start": 654.8, "duration": 4.849}, {"text": "Collins asked Trump a series of questions about Cohen the tapes and", "start": 659.649, "duration": 3.15}, {"text": "Which if you don't know about the tape the Michael Cohen situation essentially the TLDR Tuesday night", "start": 663.02, "duration": 3.989}, {"text": "There was a recording released of Michael Cohen and Trump discussing what appeared to be a payment for the Karen McDougal story back in September", "start": 667.01, "duration": 4.919}, {"text": "Of 2016 also the rights to her story of an alleged affair. She had with Donald Trump in 2006 to America Media Inc", "start": 671.93, "duration": 5.52}, {"text": "The parent company of the National Enquirer and that small bit of audio is just a little audio from one tape", "start": 677.45, "duration": 4.919}, {"text": "That is one of many tapes that were taken by the FBI", "start": 682.37, "duration": 2.52}, {"text": "from Cohen's office and residence", "start": 684.96, "duration": 1.58}, {"text": "And as far as the heart with Putin Trump, of course invited Putin to the White House in the fall", "start": 686.54, "duration": 3.479}, {"text": "But before Rajat except in the meeting, it was suspended until 2019", "start": 690.02, "duration": 2.789}, {"text": "and as far as the moment in question", "start": 692.81, "duration": 1.5}, {"text": "we have video that shows Collins asking the questions of the president who was looking away from her while people are trying to get the", "start": 694.31, "duration": 4.23}, {"text": "Press out of the room", "start": 698.54, "duration": 2.0}, {"text": "And here it's being reported that Colin was representing five networks at the time Porter is also saying that it is incredibly common for reporters", "start": 722.71, "duration": 5.489}, {"text": "To ask questions during events like that Colin's adding later those questions were questions", "start": 728.2, "duration": 3.359}, {"text": "any reporter would have asked and I was there to represent all of the networks and therefore asked about the questions of the day and", "start": 731.56, "duration": 5.01}, {"text": "internally", "start": 736.57, "duration": 0.389}, {"text": "They call that question portion a pool spray and during sprays its standard practice for reporters to ask questions now following those questions from Colin", "start": 736.959, "duration": 6.0}, {"text": "She says she was later called in to a meeting with deputy chief of staff for", "start": 742.959, "duration": 2.52}, {"text": "Communications bill shine and press secretary Sarah Huckabee Sanders and shines involvement here is notable because he just started working at the White House earlier", "start": 745.76, "duration": 6.38}, {"text": "this month and he's a former Fox News executive that was pushed out for his handling of sexual harassment scandals and here Colin says that", "start": 752.14, "duration": 5.699}, {"text": "The two told her that the question she had asked were", "start": 757.839, "duration": 1.87}, {"text": "Inappropriate and that she would not be allowed to attend an open press event later in the day having other CNN reporters would be allowed", "start": 759.709, "duration": 4.91}, {"text": "to go the event", "start": 764.62, "duration": 0.6}, {"text": "But you cannot and this resulted in CNN releasing a statement on the incident saying today CNN White House", "start": 765.22, "duration": 4.53}, {"text": "Correspondent Caitlin Collins was denied access to cover an open press event at the White House adding that she was told her questions were", "start": 769.88, "duration": 4.849}, {"text": "Inappropriate they were not adding just because the White House is uncomfortable with a question regarding the news of the day doesn't mean the question", "start": 774.95, "duration": 5.359}, {"text": "Isn't relevant and shouldn't be asked its decision to bar", "start": 780.31, "duration": 2.13}, {"text": "A member of the press is retaliatory in nature and not indicative of an open and free", "start": 782.44, "duration": 3.57}, {"text": "Press we demand better on the other side of this you had press secretary Sarah Huckabee Sanders saying at the conclusion of a press event", "start": 786.01, "duration": 5.429}, {"text": "in the Oval Office a reporter shouted questions and refused to leave despite repeatedly being asked to do so subsequently our staff informed her she", "start": 791.44, "duration": 6.0}, {"text": "Was not welcome to participate in the next event but made clear that any other journalist from her network could attend", "start": 797.44, "duration": 4.289}, {"text": "She said it didn't matter to her because she hadn't planned to be there. Anyway be clear", "start": 801.73, "duration": 3.119}, {"text": "We support a free press and ask that everyone be respectful of the presidency and guests at the White House and this morning Shyne", "start": 804.85, "duration": 5.04}, {"text": "Objected to the use of the word banned regarding the coverage of this event", "start": 810.02, "duration": 3.409}, {"text": "Like I said the response to all of this was very interesting because yes", "start": 813.43, "duration": 3.45}, {"text": "You did see some of what you expected people like Peter Baker chief White House correspondent", "start": 816.88, "duration": 3.69}, {"text": "for the New York Times to eating outrageous of the White House to bar CNN reporter Caitlin Collins from an open press event because I", "start": 820.67, "duration": 5.45}, {"text": "Did not like her question a strong leader does not fear questions a strong democracy does not shield its leader from those who question Authority", "start": 826.12, "duration": 6.299}, {"text": "Hallie Jackson chief White House correspondent for NBC News calling it inexcusable", "start": 832.48, "duration": 3.75}, {"text": "Unacceptable and sets an extremely dangerous precedent adding we shout questions at the president regularly. It's called doing our job adding", "start": 836.54, "duration": 5.869}, {"text": "I stand firmly with her but in a big move a show of unity", "start": 842.41, "duration": 3.63}, {"text": "We saw Fox News president Jay Wallace saying in a statement we stand in strong", "start": 846.04, "duration": 3.989}, {"text": "Solidarity with CNN for the right to full access for our journalists as part of a free", "start": 850.339, "duration": 3.56}, {"text": "Unfettered press Fox and it was his chief political", "start": 854.08, "duration": 2.309}, {"text": "Anchor Brett Baier saying as a member of the White House", "start": 856.399, "duration": 2.69}, {"text": "Press pool Fox stands firmly with CNN on this issue of access and on top of that", "start": 859.089, "duration": 6.059}, {"text": "He was also defending Collins on Twitter in response to people although it is important to note that the support was not", "start": 865.149, "duration": 4.53}, {"text": "Universal with Lou Dobbs on Fox Business saying this I guess my question would be who the hell are you?", "start": 869.839, "duration": 4.61}, {"text": "Alright, the president does insist on respect. All I have to say about that is it's about time there were consequences", "start": 874.85, "duration": 6.26}, {"text": "For disrespectful behavior in the White House based over the connection Dobbs has with Donald Trump. There were a lot of people going ok", "start": 881.899, "duration": 7.369}, {"text": "Well, that's not too surprising", "start": 889.269, "duration": 0.88}, {"text": "but also resulted in people saying that Dobbs is a hypocrite who's playing for Team noting that back in 2012 when Obama was president after", "start": 890.149, "duration": 6.44}, {"text": "The Obama White House criticized Neal Monroe from the Daily Caller this for shouting out questions at an event following that instance", "start": 896.589, "duration": 5.52}, {"text": "Lou Dobbs said I don't know if you had the opportunity to go on Twitter and listen to the collection of all the people going", "start": 902.11, "duration": 4.349}, {"text": "It's against the decorum of the White House, and it's rude to the president adding", "start": 906.459, "duration": 3.51}, {"text": "what's rude is the president not speaking to the American people and taking the questions of the White House press so as far as if", "start": 909.97, "duration": 5.25}, {"text": "Lou Dobbs is being a hypocrite a team player here or if maybe his opinion has evolved", "start": 915.22, "duration": 4.71}, {"text": "I'll leave that up to you as a viewer as far as where I land on this, of course", "start": 919.93, "duration": 3.33}, {"text": "It is incredibly concerning if the White House is going to bar a reporter for asking questions", "start": 923.26, "duration": 4.799}, {"text": "You could argue that they barred a person not a network. So it's not a ban. It's not", "start": 928.19, "duration": 4.549}, {"text": "Censorship but it was a ban on an individual that was working for a network that was banned", "start": 933.26, "duration": 3.679}, {"text": "Seemingly at least in part the question she was asking and the actions that many other", "start": 937.07, "duration": 4.459}, {"text": "Reporters also do but were not banned", "start": 941.72, "duration": 2.63}, {"text": "It ends up looking like the White House trying to send a message to other reporters", "start": 944.35, "duration": 3.239}, {"text": "And that is also why I appreciate it", "start": 947.589, "duration": 1.921}, {"text": "Greatly that the president of Fox News spoke out about this", "start": 949.51, "duration": 3.359}, {"text": "But that said that's my personal take away from it and whether you agree or disagree", "start": 952.87, "duration": 3.059}, {"text": "I would love to know your take about this story in the comments down below. That's what I'm going to end", "start": 955.97, "duration": 4.46}, {"text": "Today's show and of course remember, this is a PDS. It's not just a show. It is a conversation", "start": 960.43, "duration": 3.479}, {"text": "so whether it be the last story the first one anything in between", "start": 963.92, "duration": 2.75}, {"text": "I'd love to know your thoughts and those comments down below", "start": 966.67, "duration": 1.979}, {"text": "Remember if you like these daily weekday videos", "start": 968.649, "duration": 2.1}, {"text": "Let us know hit that like button", "start": 970.75, "duration": 1.199}, {"text": "If you have new here hit that subscribe button also ring that bell to turn on all notifications", "start": 971.949, "duration": 3.9}, {"text": "But that said of course as always my name's philip defranco", "start": 975.85, "duration": 2.52}, {"text": "You've just been phill'd in a la vie o faces and i'll see you tomorrow", "start": 978.41, "duration": 4.01}]