[{"text": "It was a calm, late evening in the Lannister camp pitched on the River Road somewhere between Lannisport and the Golden Tooth.", "start": 0.0, "duration": 7.1}, {"text": "Ser Stafford Lannister was inspecting a new batch of fresh recruits that had arrived earlier that day.", "start": 7.48, "duration": 5.38}, {"text": "To his contentment, the gathering of fresh troops went better than he had expected, and soon they were to depart for the war-torn Riverlands.", "start": 13.1, "duration": 7.74}, {"text": "Yet unbeknownst to those in the camp, their assembly was being observed by a dozen of watchful eyes,", "start": 21.28, "duration": 5.52}, {"text": "hiding in the nearby forest.", "start": 26.98, "duration": 1.92}, {"text": "The war that the fresh Lannister contingent was being prepared for was about to reach them far sooner than they might have expected.", "start": 29.42, "duration": 7.18}, {"text": "It’s the beginning of the year 299 after Aegon’s Conquest.", "start": 48.28, "duration": 4.14}, {"text": "Flocks of crows circle low over the dead littering the forest clearing in the Whispering Wood.", "start": 52.54, "duration": 5.5}, {"text": "Robb Stark’s successful ambush and subsequent capture of  Ser Jaime Lannister along with dozen of the lords bannermen", "start": 58.22, "duration": 6.54}, {"text": "left the Lannister host besieging Riverrun virtually leaderless.", "start": 64.76, "duration": 4.16}, {"text": "Unsurprisingly, Robb’s next target was to maintain momentum", "start": 69.16, "duration": 4.14}, {"text": "and strike the enemy force encircling the Tully’s ancestral stronghold lying some miles, and a good few days march, to the south", "start": 73.3, "duration": 7.74}, {"text": "at the confluence of the Tumblestone and Red Fork rivers.", "start": 81.04, "duration": 4.18}, {"text": "Despite the defeat of Jaime’s contingent, the Lannister force was still considerably stronger in terms of raw numbers,", "start": 85.4, "duration": 7.06}, {"text": "than the host led by the Young Wolf.", "start": 92.6, "duration": 2.16}, {"text": "But given the particular position of the Riverrun castle, to lay a proper siege,", "start": 95.1, "duration": 4.6}, {"text": "the Lannisters had to pitch three separate camps which,", "start": 99.7, "duration": 3.76}, {"text": "with their own scouting units eliminated, were dangerously exposed to a surprise attack.", "start": 103.58, "duration": 5.08}, {"text": "And the Northmen, were perfectly aware of that.", "start": 108.66, "duration": 3.04}, {"text": "Robb Stark’s vanguard led by his great-uncle Brynden Tully struck the unsuspecting Westermen", "start": 112.38, "duration": 6.4}, {"text": "in their camp north of the Tumblestone encountering only a token resistance.", "start": 118.78, "duration": 4.96}, {"text": "The ensuing chaos alarmed the Lannister soldiers in the second camp, south of the river,", "start": 124.04, "duration": 4.74}, {"text": "who immediately rushed to prepare rafts in an attempt to aid their kin on the northern bank.", "start": 128.92, "duration": 5.7}, {"text": "The crossing was made no easier by the castle garrison which actively harassed the troops on the rafts.", "start": 135.08, "duration": 6.04}, {"text": "Eventually, at the least opportune of times for the Westermen,", "start": 141.92, "duration": 3.48}, {"text": "the sound of hundreds of hoof beats heralded another armed unit arriving on the battlefield.", "start": 145.56, "duration": 6.02}, {"text": "Robb Stark, Greatjon Umber and others entered the fray, storming the second camp from the west.", "start": 151.8, "duration": 6.5}, {"text": "All hope that the Lannister men had to push back the Blackfish’s assault had now vanished,", "start": 158.54, "duration": 5.76}, {"text": "as the Northmen obliterated those who attempted to face the attackers.", "start": 164.36, "duration": 4.18}, {"text": "Although the besiegers of the third camp managed to retreat mostly unscathed,", "start": 168.84, "duration": 4.54}, {"text": "the rest were either killed or at Stark’s mercy.", "start": 173.38, "duration": 3.32}, {"text": "In the span of less than a week, Robb Stark managed to destroy a stronger Lannister host,", "start": 177.2, "duration": 5.22}, {"text": "capture Lord Tywin’s son and relieve the most important stronghold in the Riverlands,", "start": 182.42, "duration": 5.24}, {"text": "all that with negligible casualties on his own side.", "start": 187.66, "duration": 4.26}, {"text": "Though still an inexperienced youngster,", "start": 192.08, "duration": 2.64}, {"text": "his recent deeds made it abundantly clear – Ned Stark’s heir was no less of a warrior and commander than his father.", "start": 194.76, "duration": 8.84}, {"text": "When the news of the execution of Eddard Stark reach Riverrun,", "start": 204.16, "duration": 3.58}, {"text": "Robb’s bannermen proclaim him as the King in the North, the first Stark king since Aegon’s Conquest.", "start": 207.74, "duration": 6.94}, {"text": "Hoping to gain further support, Robb sent envoys to negotiate alliances with Balon Greyjoy in the Iron Islands and Renly Baratheon in the Reach,", "start": 215.1, "duration": 9.64}, {"text": "along with sending a message to the neutral House Arryn, in the Vale.", "start": 224.74, "duration": 4.38}, {"text": "Being aware that he was not strong enough to face Lord Tywin Lannister, camping near Harrenhal,", "start": 229.5, "duration": 5.4}, {"text": "Robb offered peace terms to Queen Cersei in King’s Landing.", "start": 234.9, "duration": 3.74}, {"text": "The terms required for her to renounce all claims of dominion over the north, essentially recognising the domains of the Starks and Tullys as an independent kingdom.", "start": 238.84, "duration": 10.48}, {"text": "Moving ever forward, Robb appointed his uncle Edmure Tully with the task of guarding Riverrun,", "start": 249.74, "duration": 6.16}, {"text": "while he departed west with the Northmen.", "start": 255.9, "duration": 2.88}, {"text": "It could be seen as a surprising move, as he was expected to focus his actions within the Riverlands,", "start": 259.06, "duration": 6.18}, {"text": "but attacking Lord Tywin’s powerbase within the Westerlands was a cunning manoeuvre.", "start": 265.24, "duration": 5.28}, {"text": "Doing so would undermine his might,", "start": 270.66, "duration": 2.62}, {"text": "especially given the rumours that yet another Lannister army was being assembled roughly three days ride from Casterly Rock.", "start": 273.28, "duration": 8.08}, {"text": "Yet entering the Westerlands unhindered through the River Road was far more difficult than it seemed.", "start": 281.84, "duration": 5.32}, {"text": "The Golden Tooth, a mighty keep located in a strategic area at the border allowed the Westermen", "start": 287.54, "duration": 6.56}, {"text": "to keep a watchful eye over the nearby road preventing any unwelcome party from slipping through.", "start": 294.1, "duration": 6.08}, {"text": "The castle posed a serious challenge for the Northmen, as even if Robb Stark was able to force his way through,", "start": 300.46, "duration": 6.7}, {"text": "it would greatly diminish the surprise factor that played a decisive role in his recent victories.", "start": 307.28, "duration": 6.3}, {"text": "Luckily for the Northmen, Robb’s direwolf surprisingly discovered a previously unknown mountain path,", "start": 313.82, "duration": 6.26}, {"text": "which, though crooked and stony, was wide enough to ride single file.", "start": 320.22, "duration": 4.7}, {"text": "His men made their way around the Golden Tooth stronghold unharmed and, more importantly, unseen.", "start": 325.26, "duration": 6.88}, {"text": "Early the next day, the Young Wolf and his army planted  a foothold in the Westerlands, the domain of House Lannister.", "start": 332.76, "duration": 7.74}, {"text": "Though remaining unnoticed, Robb had to tread cautiously in the hostile region.", "start": 341.04, "duration": 4.78}, {"text": "The scouting parties led by the Blackfish soon brought reports", "start": 346.0, "duration": 3.7}, {"text": "that a fresh Lannister host was indeed assembling near the village of Oxcross under the command of Ser Stafford Lannister,", "start": 349.7, "duration": 7.72}, {"text": "Lord Tywin’s brother in law.", "start": 357.42, "duration": 1.94}, {"text": "It would seem that the Lannister’s intended to replace the army lost by Jaime Lannister in the Whispering Wood and at the siege of Riverrun.", "start": 359.64, "duration": 7.86}, {"text": "Robb was aware of the threat that this posed and gave orders to prepare an attack.", "start": 367.5, "duration": 6.28}, {"text": "Ser Stafford by no account was considered a man of equal calibre to Lord Tywin,", "start": 373.96, "duration": 4.76}, {"text": "but he managed to gather thousands of fresh recruits in a short span of time,", "start": 378.82, "duration": 4.64}, {"text": "at least partially mitigating the impact of the recent losses at the hands of the Starks.", "start": 383.46, "duration": 5.68}, {"text": "The quality of his troops however, was somewhat lower.", "start": 389.34, "duration": 3.12}, {"text": "Apart from those who were able to escape the siege of Riverrun,", "start": 392.6, "duration": 3.26}, {"text": "Ser Stafford’s army consisted mostly of sellswords, freeriders and inexperienced young men from Lannisport conscripted to bolster their lost force.", "start": 395.86, "duration": 10.08}, {"text": "Stafford was aware that the bulk of his men needed training,", "start": 406.32, "duration": 3.28}, {"text": "but given the sheer number at his disposal and safe position in the heart of the Westerlands", "start": 409.6, "duration": 5.84}, {"text": "he felt confident enough to not to concern himself with patrolling the area or even posting sentries.", "start": 415.44, "duration": 7.36}, {"text": "Little did he know, that this neglect would soon carry grievous consequences.", "start": 422.9, "duration": 5.72}, {"text": "The night was cool and damp.", "start": 429.12, "duration": 1.84}, {"text": "Most of Ser Stafford’s camp were asleep, with just a few dozen still wandering aimlessly between the tents.", "start": 430.96, "duration": 5.94}, {"text": "Yet they were unable to spot the shadows moving silently around their horses, cutting the lines that held them.", "start": 436.9, "duration": 6.5}, {"text": "It was then that a bigger, grey shadow pounced from the forest-line bounding  towards the horses with haste.", "start": 443.76, "duration": 6.8}, {"text": "The growl of Robb Stark’s direwolf mixed with frightened neighing as the Lannister mounts,", "start": 450.8, "duration": 5.04}, {"text": "panicked by the attack of the beast, scattered throughout the camp, trampling men, tents, and wreaking havoc.", "start": 455.84, "duration": 6.48}, {"text": "Seeing this, Ser Brynden Tully, leading Robb’s vanguard gave the signal to his riders,", "start": 462.58, "duration": 5.54}, {"text": "who up until now had waited patiently, concealed in the woods.", "start": 468.12, "duration": 4.5}, {"text": "In a matter of moments, hundreds of Northmen emerged from the forest, rushing towards the chaos stricken camp.", "start": 472.84, "duration": 6.5}, {"text": "It was a complete surprise for Ser Stafford and his officers, who virtually had no time to mount any meaningful defence to face the enemy.", "start": 479.6, "duration": 8.46}, {"text": "Still, some of the Lannister retainers managed to reach their weapons and mount horses, but there was little to prevent the slaughter.", "start": 488.38, "duration": 7.52}, {"text": "The death toll on the Lannister side rose quickly, all those who were unable to flee were either killed or captured.", "start": 496.06, "duration": 7.82}, {"text": "Soon, Ser Stafford was slain by Lord Karstark, trying to chase down his terrified horse.", "start": 504.16, "duration": 5.94}, {"text": "Even though the battle was a disaster for the Lannisters,", "start": 510.54, "duration": 3.08}, {"text": "Stafford’s son Devan managed to rally a few hundred of his father’s men and make a coordinated retreat to Lannisport, saving them from death or captivity.", "start": 513.62, "duration": 10.56}, {"text": "Robb Stark’s victory was so swift, that a number of legends quickly arose around the battle.", "start": 524.82, "duration": 6.12}, {"text": "It is said, that an army of wargs fell upon the Lannister camp, butchering thousands of good men and feasting on their flesh,", "start": 531.02, "duration": 8.0}, {"text": "while Robb cut out Stafford’s heart and fed it to his direwolf.", "start": 539.04, "duration": 4.16}, {"text": "True or not, the northmen’s advance into the Westerlands alarmed Lord Tywin Lannister,", "start": 543.38, "duration": 5.5}, {"text": "who immediately gave orders to depart Harrenhal and rush back to his own domain to face the Young Wolf.", "start": 548.88, "duration": 7.26}, {"text": "Meanwhile to the north, Theon Greyjoy, Robb Stark’s envoy to the Lord of Iron Islands, fails in his mission,", "start": 556.56, "duration": 7.02}, {"text": "and his father Balon rises up with another rebellion, preparing an attack on the North.", "start": 563.76, "duration": 5.44}, {"text": "To the south, the political landscape was even more treacherous:", "start": 569.36, "duration": 3.5}, {"text": "The two younger siblings of the late King Robert Baratheon separately questioned the legitimacy of Robert’s son and enter the war,", "start": 572.98, "duration": 7.84}, {"text": "proclaiming themselves as the true heirs of their deceased brother.", "start": 580.82, "duration": 4.32}, {"text": "The War of the Five Kings had entered it’s decisive phase.", "start": 585.4, "duration": 5.5}, {"text": "This video is sponsored by ExpressVPN.", "start": 592.34, "duration": 3.04}, {"text": "In the battle for online privacy, you need an ally with the best-in-class encryption to protect your data.", "start": 595.38, "duration": 6.62}, {"text": "ExpressVPN allows you to be on the move while protecting your personal information on public networks.", "start": 602.16, "duration": 6.06}, {"text": "With a single, simple click, you are guaranteed fast, secure, limitless connectivity – wherever you may be.", "start": 608.38, "duration": 6.66}, {"text": "What we at the channel found particularly impressive is that we could resupply  and not reveal our resources .", "start": 615.04, "duration": 6.32}, {"text": "And with 24/7 customer support, help is never far away.", "start": 621.36, "duration": 3.9}, {"text": "Support our channel by visiting ExpressVPN.com/BazBattles and you will an additional receive 3 months free on a 1-year bundle.", "start": 625.44, "duration": 9.26}, {"text": "Thereafter it’s just $7 a month along with a 30-day money back guarantee.", "start": 634.86, "duration": 6.08}, {"text": "Because as any commander knows, concealing one’s location is the height of tactical intelligence.", "start": 641.22, "duration": 7.02}]