[{"text": "Bebut oh god. Oh god. Oh good runs a crime. Oh", "start": 0.039, "duration": 7.19}, {"text": "God why there's so many", "start": 9.94, "duration": 2.0}, {"text": "Back to chicken", "start": 16.18, "duration": 1.59}, {"text": "Show me guide me veteran of minecraft. Where are you? Oh", "start": 17.77, "duration": 4.819}, {"text": "My god, I'm up above you I think Jack", "start": 23.109, "duration": 3.8}, {"text": "Where are we or plane crash honey? We?", "start": 27.73, "duration": 3.59}, {"text": "I don't even have a skin yet. Oh man upper ode. What is it called important? I won. Yeah, like default skin", "start": 33.91, "duration": 7.91}, {"text": "T44 skins are the new meta. Okay, I'm gonna dunk on some babies in this game. Wait. Why? Why are we up here?", "start": 43.93, "duration": 7.069}, {"text": "What are we doing? So I don't know what this is either but we're gonna play survival", "start": 51.01, "duration": 4.549}, {"text": "But the world is amplified. So I think it's like crazy structures. It's time you see there's like an island in the sky over there", "start": 56.23, "duration": 6.29}, {"text": "Yeah", "start": 63.129, "duration": 1.021}, {"text": "more", "start": 64.15, "duration": 1.049}, {"text": "more", "start": 65.199, "duration": 2.0}, {"text": "Okay minecraft gods cuz I'm on ok", "start": 69.159, "duration": 3.529}, {"text": "I'm sorry, am I able to jump off into that water tower?", "start": 73.27, "duration": 3.29}, {"text": "Do you think I'll make it light died completely if I try that is tempting that that is some I enjoyed", "start": 76.56, "duration": 5.19}, {"text": "How about you jump first? I'll give you a push", "start": 81.79, "duration": 2.0}, {"text": "PewDiePie pushes jacksepticeye off the cliff. Oh", "start": 86.29, "duration": 2.869}, {"text": "Did you really", "start": 93.909, "duration": 2.0}, {"text": "He doesn't sound like you made it he can't even aim for this distance I eat like shaved at the edge", "start": 96.79, "duration": 5.0}, {"text": "Who's so close you're gonna have a sprint bro, bro", "start": 103.509, "duration": 2.99}, {"text": "Oh", "start": 108.87, "duration": 2.0}, {"text": "Epic minecraft", "start": 114.94, "duration": 1.92}, {"text": "Minecraft thanks. I didn't swore. I didn't swore. I didn't I tried to high-five. You didn't always say. Okay Jackson", "start": 116.86, "duration": 7.099}, {"text": "It's gonna be nice. We have to prepare our boot our home together really living", "start": 123.96, "duration": 4.23}, {"text": "We roommate we roommate we built crib also since this is start of new. Let's play I give you this here you go Oh,", "start": 128.22, "duration": 7.229}, {"text": "magic flowers I eat no, I", "start": 136.33, "duration": 2.27}, {"text": "I can't eat it", "start": 139.45, "duration": 2.0}, {"text": "I'm going to die my belly red. Oh my gosh. Okay. Where are we going?", "start": 141.61, "duration": 4.49}, {"text": "I don't actually have a plank where you need to find like a good good place right fine be as always", "start": 146.1, "duration": 6.119}, {"text": "He just dig straight down and live in a hole but like an ostrich", "start": 152.22, "duration": 3.119}, {"text": "Exactly hide your head in the sand. So I'm gonna go to the middle", "start": 155.86, "duration": 3.02}, {"text": "Little sheep, three little sheep?", "start": 161.41, "duration": 1.14}, {"text": "Nani oh my god. Do we kill take wool make bed", "start": 162.55, "duration": 5.72}, {"text": "We give flour to sheepie in this you burn what is wrong with her faces. Ah, never mind there normal", "start": 168.27, "duration": 4.83}, {"text": "There you go. I give a I give him flour to a chicken", "start": 173.26, "duration": 2.629}, {"text": "Okay. He just run. This is the hardcore mode of playing mine crime be nice to ever", "start": 176.53, "duration": 3.98}, {"text": "Whoa, whoa. Whoa. Whoa, this world is crazy Jack wait", "start": 181.36, "duration": 3.349}, {"text": "What just melting the whole forest already? That's", "start": 185.44, "duration": 2.989}, {"text": "That's life just don't go near the lava you will die. Okay, there's a forest fire as well", "start": 188.98, "duration": 4.609}, {"text": "my god", "start": 194.47, "duration": 1.68}, {"text": "Global warming even take over minecraft my god. This says so much about our planet. There's gotta be just a floating in the air", "start": 196.15, "duration": 7.339}, {"text": "Yeah, it's so weird", "start": 203.56, "duration": 2.0}, {"text": "What five out of eight robot? That's okay. Can't you minecraft to eat in real life?", "start": 205.81, "duration": 4.399}, {"text": "There's a huge waterfall over here and well sight of the cliff is just water god damn place is weird. Yeah, it's cool", "start": 210.94, "duration": 6.829}, {"text": "I'm glad this isn't my world. My world is peaceful as dogs in it you give on dogs already", "start": 217.769, "duration": 6.66}, {"text": "Yeah, I would say spoil ease but episode already go up. How come whenever we record together. I just turn it to you", "start": 224.44, "duration": 6.169}, {"text": "To do", "start": 234.61, "duration": 2.0}, {"text": "This is it's not even my accident no, it's", "start": 238.269, "duration": 3.14}, {"text": "It's just a weird voice. Do I plant tree help in vitam? Oh my god", "start": 242.23, "duration": 3.809}, {"text": "We had give back with solve global warming look big happy dead. The fire will go away now", "start": 246.04, "duration": 4.889}, {"text": "Don't kill Pig not killing a petting with flower. I'm petting to get meat", "start": 250.94, "duration": 5.029}, {"text": "Good piggy, what'd you do to pig? I did nothing to pig. He just explode and give me his flesh sister", "start": 257.329, "duration": 6.86}, {"text": "Where are we going? We need a plan. It's gonna be night time. We're gonna die immediately", "start": 267.38, "duration": 3.619}, {"text": "Least you're eating while you're gaming. Alright how you know, I'm real gamer. At least we have waterfall to help climb. Oh,", "start": 275.06, "duration": 6.5}, {"text": "Look at us already minecraft veterans, even though you've you've been playing it for a whole month at this point up I go", "start": 282.53, "duration": 6.649}, {"text": "See you later mortal. I have reached the source. Okay. Alright. Okay. Good idea. Are you ready to take this seriously now, I'm ready", "start": 289.729, "duration": 7.22}, {"text": "There's a waterfall next to lava for love of waterfall. We can make cobbles ideon. We can make a", "start": 297.37, "duration": 7.29}, {"text": "cobblestone generator", "start": 305.24, "duration": 2.0}, {"text": "Spawn wait, here's the ocean actually that might be good like we stay by the beach", "start": 309.41, "duration": 3.5}, {"text": "Yeah, just like Brighton just like Brighton we're relieved. Oh, you think I can jump on cloud. It's catch", "start": 312.94, "duration": 5.699}, {"text": "maybe you like", "start": 319.789, "duration": 2.0}, {"text": "Okay chop wood, let's go three two one shop shop shop shop shop shop", "start": 330.44, "duration": 4.579}, {"text": "Felix has played a lot of Minecraft now Jackson", "start": 335.72, "duration": 2.209}, {"text": "He's starting he can teach him so much you shop wood shop shop shop shop shop shop little man. Oh wow", "start": 337.93, "duration": 6.869}, {"text": "Okay, I dare you to hit I dare you to hit the pool down there", "start": 344.84, "duration": 3.38}, {"text": "Yes, I", "start": 352.61, "duration": 2.0}, {"text": "Take all your things they're mine now Jack", "start": 354.979, "duration": 2.93}, {"text": "Jack yes. Are you gone forever? What are you?", "start": 359.479, "duration": 3.559}, {"text": "I'm at the bottom of pool I survived. Oh my god how you jumped so well because I good I play minecraft", "start": 364.039, "duration": 6.08}, {"text": "We haven't done anything, okay", "start": 374.009, "duration": 2.0}, {"text": "Okay. Okay. I'm buddy. I might a double waterfall. So all my knee. There's creepers Oh Jack Oh God", "start": 376.589, "duration": 5.75}, {"text": "Minecraft scary time now I hate this this game is legitimately sky, no", "start": 384.839, "duration": 6.71}, {"text": "No told me like oh this stupid kids game. I'm", "start": 392.999, "duration": 3.11}, {"text": "Creepy oh", "start": 397.74, "duration": 1.5}, {"text": "I kill sheep. Now remember when it was my suggestion that we should play in hardcore mode", "start": 399.24, "duration": 4.159}, {"text": "You're the first to die. Oh god. Can you come to the double llama?", "start": 404.219, "duration": 3.47}, {"text": "I mean the why don't the double obviously with lava right now. It's really freaking fer me", "start": 407.689, "duration": 5.489}, {"text": "Okay, I hit back. I'm at forest fire", "start": 414.119, "duration": 2.39}, {"text": "Okay, I think I hear you. Ah, it's a creeper. Maybe we should show me your name all the time. You could always look up", "start": 417.059, "duration": 5.45}, {"text": "Did he hear that explosion? No, then you know, it must be close", "start": 425.819, "duration": 3.889}, {"text": "If you don't hear it, that's mean, you know, really that means you're deaf now from explosion", "start": 431.189, "duration": 5.029}, {"text": "You cannot hear it?", "start": 437.459, "duration": 1.83}, {"text": "Are you splashing in water? No?", "start": 439.289, "duration": 2.0}, {"text": "I don't wanna go too far in case we end up going I one of us should really stay in one place", "start": 441.719, "duration": 4.339}, {"text": "This is like getting lost at the store. Okay, mom. I'm sorry. I take serious. Haha. I will find you", "start": 446.059, "duration": 7.26}, {"text": "Don't worry. I'm at a forest fire though. The trees are burning I get more wood. Okay, so I am at -", "start": 453.319, "duration": 5.13}, {"text": "183", "start": 460.139, "duration": 1.71}, {"text": "Thanks. I'm at - 169. Whoa, that is bad number is not a swore", "start": 461.849, "duration": 6.14}, {"text": "You saw I have to punch you there. Let me fight. You didn't sward", "start": 468.059, "duration": 3.68}, {"text": "Know it's fake. I'm at - - OH - now I'm we should be pretty close to each other then I'm minus 160", "start": 472.349, "duration": 6.2}, {"text": "Okay, you went past me impossible", "start": 478.74, "duration": 2.329}, {"text": "and then okay, what's your", "start": 481.61, "duration": 1.929}, {"text": "Z then o", "start": 483.539, "duration": 1.89}, {"text": "My Z is minus 354 - 220 Oh God, I have to go. Yeah. Yeah go down", "start": 485.429, "duration": 6.11}, {"text": "I'm gonna die from falling out this. Alright. Yeah, I'm getting better. You're minus", "start": 492.869, "duration": 4.459}, {"text": "200 230 40 okay. I see you Jackie. There you are -", "start": 498.089, "duration": 5.81}, {"text": "Yeah, you look changed you look different that's not me if it's fake back", "start": 505.56, "duration": 4.429}, {"text": "My god, it's a fake Jack. He swore, you know, we should have built the house by now", "start": 510.93, "duration": 3.83}, {"text": "We should have like pickaxe we shouldn't start mining", "start": 514.76, "duration": 2.669}, {"text": "We should have a diamond pickaxe by now", "start": 518.94, "duration": 2.269}, {"text": "okay - 200-some be", "start": 521.729, "duration": 2.0}, {"text": "zombies I run run run I", "start": 524.099, "duration": 2.9}, {"text": "Hope my creepy doesn't get me. Okay, so - turn is 63 about two giant waterfall again", "start": 527.55, "duration": 5.419}, {"text": "Tarantulas it creepy. Oh I'm starving so I can't run way scream", "start": 535.17, "duration": 6.289}, {"text": "I hear you jack", "start": 548.07, "duration": 2.209}, {"text": "Wow, alright, I got it I got it I kill myself to it and then will spawn sings black", "start": 553.8, "duration": 4.159}, {"text": "Genius maybe we should back out and not do like such a crazy world because it's kind of what do you think?", "start": 558.54, "duration": 5.989}, {"text": "Yeah, this is this is way too vertical", "start": 564.529, "duration": 2.0}, {"text": "Dang it. Okay, so", "start": 567.39, "duration": 2.0}, {"text": "Default and we call it", "start": 570.029, "duration": 2.0}, {"text": "No, it doesn't count epic sward just because you're not in the server doesn't mean you can't swore no lets me", "start": 575.339, "duration": 6.559}, {"text": "No one can join it's reset. Oh", "start": 581.899, "duration": 2.07}, {"text": "It's fucking annoying type of voice to make entire - Scandinavians lost in Minecraft", "start": 585.75, "duration": 6.079}, {"text": "Is this even Scandinavian? Yes, of course. This is how my parents speak when I board helmet Oh", "start": 591.829, "duration": 5.94}, {"text": "swore", "start": 598.529, "duration": 1.321}, {"text": "It is good. Oh good swore. Hey", "start": 599.85, "duration": 2.929}, {"text": "high five", "start": 603.839, "duration": 1.051}, {"text": "High five Sheep - the Sheep sheep - bye hi back. She white - father my unit I buy back huh? Oh", "start": 604.89, "duration": 7.25}, {"text": "He's giving me flesh. He offer flesh does where sheep go now I can high-five with the Sheep high-five", "start": 613.079, "duration": 7.01}, {"text": "Now you can high-five sheep with sheep Wow", "start": 622.05, "duration": 3.049}, {"text": "Is this crazy?", "start": 625.88, "duration": 1.57}, {"text": "minecraft", "start": 627.45, "duration": 1.53}, {"text": "Thanks, not use it great. Whoa", "start": 628.98, "duration": 2.39}, {"text": "Okay, so we should play maybe should we play seriously?", "start": 632.31, "duration": 3.57}, {"text": "Okay, maybe like before the Sun goes then we want at least have a house right", "start": 639.58, "duration": 4.13}, {"text": "Okay, I get would you get I get would you get wait, but what do I do? Maybe you get hurt maybe hurt", "start": 644.14, "duration": 6.169}, {"text": "I make crafts Finch and we both can utilize but we have to share share care", "start": 652.45, "duration": 4.339}, {"text": "sharing are", "start": 658.15, "duration": 1.32}, {"text": "Caring good", "start": 659.47, "duration": 1.95}, {"text": "God you I got can I have one would I make some plain? You know, I don't need it with", "start": 661.42, "duration": 5.27}, {"text": "What?", "start": 667.69, "duration": 1.14}, {"text": "Everyone needs a quid. Oh, it's special wood is special wood for special people. Okay. I need more anymore", "start": 668.83, "duration": 6.5}, {"text": "I used up all wood to make stick for some reason I", "start": 675.88, "duration": 3.409}, {"text": "Make stick for later. I'm still I'm not new but I'm still stupid", "start": 684.76, "duration": 3.89}, {"text": "Make this crap again. Oh, I need a break for I'd see crap", "start": 691.51, "duration": 4.369}, {"text": "Okay, I'll make wooden pickaxe that's good remember to replant tree to save environment", "start": 698.32, "duration": 6.019}, {"text": "I'm all about minecraft baby. Okay, I think this is a physical blinks actually good look look fellow Scandinavian", "start": 705.97, "duration": 7.31}, {"text": "There is a little feud here we can stay in flue-cured", "start": 713.28, "duration": 2.159}, {"text": "Already lost you friend's", "start": 716.589, "duration": 2.0}, {"text": "Name already disappear any lost boy", "start": 719.83, "duration": 2.509}, {"text": "We walk around each other", "start": 725.98, "duration": 2.0}, {"text": "Battle to death question mark why /n?", "start": 729.58, "duration": 3.799}, {"text": "Okay, okay, maybe maybe just give little tap talk a little sister, okay, please hit once out of system. Okay now we safe", "start": 735.33, "duration": 7.58}, {"text": "Maybe little stone here. Oh, this could be our little mind. Oh,", "start": 743.55, "duration": 3.68}, {"text": "You and there's no maybe good timing. Oh, I'm more advanced than you. You small brain. I be polite", "start": 747.87, "duration": 5.869}, {"text": "If you don't get there soon you're going to be smart, all right, I will get diamond before you", "start": 756.09, "duration": 4.789}, {"text": "probably right, you know what to do a brain took me two took me two hours yesterday to get", "start": 761.97, "duration": 4.519}, {"text": "Your small work and it stops you", "start": 767.85, "duration": 2.69}, {"text": "I was watching some of your after I like played some of it myself yet", "start": 774.69, "duration": 4.34}, {"text": "I went back and watched like your first episode your spawn was nuts", "start": 779.03, "duration": 3.299}, {"text": "Was it really you got so many like good things you might like", "start": 782.66, "duration": 2.699}, {"text": "people and you you went down you got diamonds really quickly because I'm trying because", "start": 785.43, "duration": 4.01}, {"text": "I'm veteran Jack", "start": 790.02, "duration": 1.74}, {"text": "No, cuz you sheet I know you should say I shake but your shake always do not cool", "start": 791.76, "duration": 6.38}, {"text": "- fuck cool. I like that. Did you get any? Okay. Okay, we now we got to make a little smelting machine", "start": 798.9, "duration": 6.14}, {"text": "You have cobblestone Oh", "start": 805.04, "duration": 1.72}, {"text": "Copley I got here you take this. Are you ready for epic epic time?", "start": 806.76, "duration": 5.419}, {"text": "Boom, what did smell te what did you do? Yeah, we need coal. Can I oh what you can't smell it - smell", "start": 812.88, "duration": 6.83}, {"text": "Yeah, I did that in my episode. Everyone was like you did you did it wrong, but you still got the same answer", "start": 820.8, "duration": 5.239}, {"text": "You know that cool wood also burn inside it now they yeah see I teach Sam", "start": 829.68, "duration": 5.21}, {"text": "gamers teach each other even though I'm still using my hands -", "start": 835.41, "duration": 3.26}, {"text": "Okay, you're quite hardware I get iron pickaxe stop advancing aaron ages before me", "start": 842.79, "duration": 6.529}, {"text": "Yeah nose-mounted ma'am. Oh my god. Is he allergic to smoke?", "start": 850.16, "duration": 4.04}, {"text": "Damn, honestly, we got sealed pretty fast. We should speedrun this beat dragon first episode", "start": 855.62, "duration": 4.46}, {"text": "I don't even know what dragon is spoiling spoil East oily. So sorry about that, bro", "start": 860.08, "duration": 5.099}, {"text": "I only got to nether realm and then got scared and came back", "start": 865.21, "duration": 2.399}, {"text": "Yeah, first time they around was like no hey", "start": 869.81, "duration": 3.349}, {"text": "III got my thing and then I got obsidian. I was like I probably shouldn't be", "start": 873.89, "duration": 4.25}, {"text": "Okay, we need coal cuz I can't make torches", "start": 880.58, "duration": 2.119}, {"text": "Okay, why don't we make this our mind then and we started mining down just like it because we both have Steel X", "start": 882.7, "duration": 4.769}, {"text": "That's what I do. Look I do already Oh it'sit's not steel. It's iron. Okay, Edie, of course. Sorry, it's iron", "start": 887.48, "duration": 7.19}, {"text": "Hey, come on", "start": 894.8, "duration": 2.0}, {"text": "But we don't have torch I steered you got the man up", "start": 897.02, "duration": 3.38}, {"text": "My cookies. No, you got the men I", "start": 901.22, "duration": 2.3}, {"text": "Meet cooker. You got two men. I need I need sustenance to get low but where you get to meet", "start": 904.16, "duration": 5.869}, {"text": "People like Jack and Felix should really play Minecraft together than his", "start": 911.279, "duration": 3.74}, {"text": "Not like this", "start": 915.809, "duration": 2.0}, {"text": "I", "start": 918.059, "duration": 1.89}, {"text": "Can't see anything Jack. I don't understand why it dark", "start": 919.949, "duration": 2.809}, {"text": "Okay, I kill sheep and then get won't Macbeth. Maybe ask sheep for a call Oh", "start": 923.909, "duration": 4.28}, {"text": "Sheep. Whoa. I found the shaft right away, dude", "start": 929.189, "duration": 2.779}, {"text": "Really?", "start": 932.969, "duration": 1.29}, {"text": "How do you do that? I don't know", "start": 934.259, "duration": 2.0}, {"text": "I'm gonna call you shaft from now", "start": 937.289, "duration": 2.0}, {"text": "Call me chef Orion. What is the spooky sounds that keeps happening? I'm scared", "start": 940.019, "duration": 4.19}, {"text": "I think it's when a monstrous pawns in a kid, but I'm not sure no, holy fully freak eats Mickey", "start": 944.209, "duration": 5.219}, {"text": "All right. I see you see the cold. No, it's not. It's next to the llama", "start": 949.429, "duration": 3.419}, {"text": "me scared of lavador", "start": 953.459, "duration": 1.8}, {"text": "Hey careful, what are you don't be hero in Minecraft the rule. There's a chest here bread tonight", "start": 955.259, "duration": 6.979}, {"text": "We eat gamer. Have you got pumpkin a melon seeds and a name tag?", "start": 962.239, "duration": 3.51}, {"text": "Which means if we find a pet we can name it something", "start": 966.629, "duration": 2.96}, {"text": "Also how that works. Yes. Oh my god have any song you're learning you're throwing crafts", "start": 970.229, "duration": 6.14}, {"text": "You're improving its person. Honestly, we're pretty lucky from finding that so fast, I think maybe", "start": 976.369, "duration": 5.46}, {"text": "epic gamer we play games", "start": 983.249, "duration": 2.0}, {"text": "Jesus love almost kept me. Hey, hey, hey danger danger stranger danger. We don't have armor backup, Rebecca", "start": 988.079, "duration": 6.5}, {"text": "Are you ready for epic? I put torch", "start": 994.799, "duration": 2.21}, {"text": "Everybody do you have sword right? Yeah, maybe I'm in the wallet go back", "start": 998.399, "duration": 5.74}, {"text": "Okay, I find I find they back my thoughts I can get well yes we grab them right did you want any steel", "start": 1025.179, "duration": 6.5}, {"text": "Yeah, you stole I made the stone", "start": 1031.929, "duration": 2.54}, {"text": "You swipe", "start": 1035.29, "duration": 1.529}, {"text": "Dog, give me give me all my things. Maybe we should cover up his lava. I feel like yeah, let's see", "start": 1036.819, "duration": 5.42}, {"text": "So what do you want hands put you one for me? I don't have", "start": 1042.24, "duration": 2.4}, {"text": "How can he slap how can you sled okay", "start": 1049.09, "duration": 3.229}, {"text": "So you had the iron pickaxe?", "start": 1053.559, "duration": 1.551}, {"text": "Yeah, there you go these sir and the me some more in that gray wool and the thing and the sword and the shovel", "start": 1055.11, "duration": 6.66}, {"text": "And the thing and I and I have second pickaxe", "start": 1062.65, "duration": 3.5}, {"text": "Should we explore this right away. I don't know. Uh", "start": 1070.63, "duration": 2.539}, {"text": "I don't know. How epic do you want to be? I don't want to blow people's minds, dude", "start": 1073.9, "duration": 4.219}, {"text": "This place is mess evasive. That is great", "start": 1078.12, "duration": 3.39}, {"text": "Great just great projecting", "start": 1083.679, "duration": 2.39}, {"text": "Jeepers Creepers", "start": 1090.1, "duration": 1.829}, {"text": "Oh, did he get the shiny? I got everything from check again? Oh", "start": 1091.929, "duration": 3.02}, {"text": "Oh, man. Okay. Do we need more call this co-sleeper down?", "start": 1096.07, "duration": 3.859}, {"text": "Need to smelt these multi. So a minecraft tip is to place torch on left side", "start": 1100.66, "duration": 5.149}, {"text": "so when you go back you look at other side and you're like", "start": 1105.809, "duration": 2.64}, {"text": "Oh this where I come from or just find diamond right away now", "start": 1108.45, "duration": 3.869}, {"text": "How is so so smart, I know you're thinking and how are you so at remind another hole it could do this mine is insane", "start": 1114.76, "duration": 7.369}, {"text": "There's a wiser. There's a sheep here. I mean for what are they called?", "start": 1122.7, "duration": 4.29}, {"text": "Chicken", "start": 1128.559, "duration": 2.0}, {"text": "What this freaking most common meat animal he can be friends we don't have okay wait, let's bury him here stay", "start": 1132.35, "duration": 7.369}, {"text": "Stay here. Suffocate. The little cheapy stay we come back very soon. Oh, there's lava lava down here. Lava and water", "start": 1141.02, "duration": 6.529}, {"text": "Maybe we shouldn't go down too far", "start": 1148.58, "duration": 2.0}, {"text": "Yeah, I'm scared. Mom. I don't have any what level are around 21 if we go down 10 more steps, we could find diamond", "start": 1150.71, "duration": 5.239}, {"text": "Right away, which would be kind of good mean", "start": 1155.95, "duration": 2.0}, {"text": "Okay, let's go together. Let's go down here. Okay", "start": 1158.21, "duration": 2.9}, {"text": "Watch out for creepers. I'm nervous", "start": 1161.99, "duration": 2.51}, {"text": "That's not the pro gamer tip that I learned Jack you press f3 and it says 11", "start": 1169.85, "duration": 5.0}, {"text": "This is the level. I already learned I get diamond to myself on level 12", "start": 1174.95, "duration": 5.39}, {"text": "Oh, you know how you know this?", "start": 1180.34, "duration": 2.55}, {"text": "I know how can you know this because because it took me 2 hours and I had to look up how", "start": 1182.89, "duration": 3.719}, {"text": "Okay, well I guess not there cuz I thought level people might get them 11 12", "start": 1188.75, "duration": 4.13}, {"text": "I thought that meant you go down 12 love", "start": 1192.88, "duration": 1.56}, {"text": "Oh, no trying to count from make the water level be like, okay", "start": 1194.44, "duration": 3.119}, {"text": "If I go down 1 2 3 4 why not work we probably should like get steel and sink get some armor", "start": 1197.56, "duration": 6.21}, {"text": "Before we go down here. Yeah do that. I have I", "start": 1204.11, "duration": 3.89}, {"text": "Have 12 so I could probably make a couple", "start": 1208.76, "duration": 2.0}, {"text": "of 6 iron ores now it is", "start": 1211.22, "duration": 2.239}, {"text": "Steel, well giant water pot lapras place", "start": 1213.98, "duration": 3.859}, {"text": "That's what I say that waterfall and thing down here. We should even look at first diamond blue. That's not time indeed", "start": 1217.88, "duration": 7.279}, {"text": "Laughs, it's blue what color?", "start": 1225.16, "duration": 2.0}, {"text": "Diamond time in this e3. I meant clear like your ocean high. So, thank you. You're sweet Scandinavian. I noticed my eyes. Thank you", "start": 1227.3, "duration": 8.0}, {"text": "It's the first thing I see when I wake up in the middle", "start": 1236.12, "duration": 2.27}, {"text": "nice look at", "start": 1239.33, "duration": 2.0}, {"text": "Well, this looks like a shrine room dude. What is this? You should build our base here. Yeah, that's awesome", "start": 1242.3, "duration": 5.21}, {"text": "This is like an evil lair. Yeah, I'm scared. Maybe we go back", "start": 1247.78, "duration": 4.08}, {"text": "I like that you put down torch, even though lava here brighten up everything", "start": 1251.86, "duration": 3.599}, {"text": "Be quiet, oh look we found obsidians that turtles spawn obsidians", "start": 1257.84, "duration": 4.67}, {"text": "Diamond. Okay. Well, I guess no lucky ducky", "start": 1263.21, "duration": 3.0}, {"text": "But we find what this rights don't actually do", "start": 1266.25, "duration": 2.329}, {"text": "You kids not like to trigger mechanism. You can make should we bring sheep to surface? No", "start": 1268.919, "duration": 4.43}, {"text": "okay, you can make like", "start": 1274.559, "duration": 2.0}, {"text": "wires and", "start": 1276.6, "duration": 1.829}, {"text": "electrical components and epicness", "start": 1278.429, "duration": 2.06}, {"text": "Contraptions contractions. Yes, like the ones your mother have. Hey, don't talk about good mama septic", "start": 1281.13, "duration": 6.949}, {"text": "I like oh wait, where's our way out?", "start": 1288.08, "duration": 2.099}, {"text": "Not there, I", "start": 1292.409, "duration": 2.0}, {"text": "Can talk normal now, it's been too long", "start": 1304.62, "duration": 2.119}, {"text": "I'm just talking monkey. Help me Jack help me, aren't you hungry? I have bread for you. Hi. I have meat bro", "start": 1309.45, "duration": 6.89}, {"text": "Maybe we should have built a little house here where we check", "start": 1316.35, "duration": 3.049}, {"text": "Where is our thing here, but we can make a new one. Maybe here. It's nice", "start": 1319.399, "duration": 4.11}, {"text": "But why would we put here and then not move Oh, what is that? What is big tall black figure over there?", "start": 1323.82, "duration": 6.859}, {"text": "Okay. Should we kill him? We now will probably die. It's too dangerous. I", "start": 1330.779, "duration": 3.38}, {"text": "Don't know if I just boy like suffer you don't know yet I just do that. Oh", "start": 1336.24, "duration": 3.919}, {"text": "Jesus okay. I found secret mining place from creeper creepers. Our friends just go over and give them a hug", "start": 1341.909, "duration": 6.65}, {"text": "Do not hurt you if you nice. That's the pro trip tip", "start": 1349.169, "duration": 2.84}, {"text": "trip", "start": 1352.679, "duration": 1.35}, {"text": "We are taking poacher. God know what I feel about having someone point out. How dumb I am all the time", "start": 1354.029, "duration": 5.39}, {"text": "Where are you? Are you by the thing? Yeah, I really feel like it should show our names a bit further than it is, right", "start": 1360.75, "duration": 7.25}, {"text": "What should we build next we should definitely make armor so just melt as much iron as possible", "start": 1371.669, "duration": 5.42}, {"text": "I would say I do I have beetroot seeds a pumpkin seeds. We can make a farm and make epicness", "start": 1377.09, "duration": 6.15}, {"text": "Do you have any coal could you put that in this one? It's in the furnace", "start": 1383.309, "duration": 3.979}, {"text": "What did you make a second one just so we can burn faster? Okay, and then I do this look Punk", "start": 1387.45, "duration": 4.4}, {"text": "Oh, we we put the Oh Jack. I put everything that I don't have surprise for you", "start": 1391.85, "duration": 5.39}, {"text": "Train go very fast. You have to be careful though speed these keys reduce the activation, okay", "start": 1402.59, "duration": 6.709}, {"text": "I I also have this look", "start": 1409.3, "duration": 2.0}, {"text": "Wait, how do I drop everything at once? Damn?", "start": 1411.92, "duration": 2.119}, {"text": "It was in chest, dude. All I can do is think about Minecraft lately. That's all you need", "start": 1415.01, "duration": 4.76}, {"text": "It's the best and now we played together whole new world, okay, go inside and I push you down. Okay, stay", "start": 1423.32, "duration": 6.92}, {"text": "It's like Disneyland for free happy you made a armor in your I make metal pants now metal pants", "start": 1440.99, "duration": 6.439}, {"text": "Like shiny metal. Look at my shiny metal ass, sorry", "start": 1447.65, "duration": 3.56}, {"text": "It was out, I'm sorry. Well metal pants almost look like apron you ready to cook little boy", "start": 1454.25, "duration": 7.01}, {"text": "Okay, I can't make anything else I'm melting more it's okay, it's okay, I'll make us helmets and then one was we're ready", "start": 1465.05, "duration": 7.099}, {"text": "We're gonna distraction. I can't wait to destruction. Oh, it's morning time. Look morning", "start": 1472.15, "duration": 6.0}, {"text": "Morning we should actually I know this sounds really pretentious, but we should actually place our house. So we see the sunset", "start": 1480.95, "duration": 6.109}, {"text": "Okay, I like that. That's not pretentious wait, which is better sunrise or sunset. They I think they go in bow", "start": 1487.13, "duration": 5.57}, {"text": "No, wait, we want sunset. Sorry. Yeah. Yeah sunset. Okay jack. Here you go. Now we both look very", "start": 1492.97, "duration": 5.64}, {"text": "big rained", "start": 1499.49, "duration": 2.0}, {"text": "a big helmet because big brain", "start": 1501.92, "duration": 2.66}, {"text": "Yes, big cube. Brain. Okay. Well now I think we should melt all of it. Let's see what's left. Three more. Maybe we make a", "start": 1505.43, "duration": 7.25}, {"text": "Ayran, sword. I want to shield. Oh Camry. Yeah, we should probably do a show. Yeah, we can make cousins are so annoying", "start": 1513.71, "duration": 6.199}, {"text": "I'll make you want", "start": 1519.95, "duration": 1.5}, {"text": "I", "start": 1521.45, "duration": 2.0}, {"text": "Have", "start": 1524.76, "duration": 1.409}, {"text": "Epic whoa wooden sword no. No. No, I got you", "start": 1526.169, "duration": 4.13}, {"text": "Okay, how much iron did you have? I grabbed as much as I could that was the point that was plantation", "start": 1531.12, "duration": 5.119}, {"text": "I'm sorry, I sighs. Oh", "start": 1536.24, "duration": 2.0}, {"text": "We have to name tags, let's listen we're doing good man the power of friendship when you work together", "start": 1540.24, "duration": 4.939}, {"text": "You mind together gamers help each other. We are too strong. There's no other video games in 2019", "start": 1545.179, "duration": 6.089}, {"text": "This is the only one that mattered. Can you believe minecraft invented video games?", "start": 1551.269, "duration": 3.84}, {"text": "Okay. Now the boys go down and we are not afraid boys mine", "start": 1556.289, "duration": 4.7}, {"text": "Boys mine, no girls allowed down here. We should explore the mineshaft by a chef mind. What is called Minecraft?", "start": 1561.75, "duration": 6.739}, {"text": "Should be gratis we can make epic rollercoaster sure. What's best item - Oh pickaxe to good pickaxe to strong", "start": 1574.32, "duration": 6.949}, {"text": "maybe we should close off like areas that we", "start": 1581.269, "duration": 3.06}, {"text": "Maybe judge Oh", "start": 1586.049, "duration": 2.0}, {"text": "Should make you up absolutely kill. Absolutely", "start": 1591.029, "duration": 2.3}, {"text": "Welcome to our town and now we with sweet land. Let's close this up so we know I", "start": 1595.529, "duration": 6.26}, {"text": "Usually cut down the pillars too because they make it really confusing", "start": 1602.669, "duration": 2.93}, {"text": "Do I need X it's preferable. I", "start": 1607.049, "duration": 2.989}, {"text": "Don't have then don't okay. Got it. Big break. Very very", "start": 1610.799, "duration": 4.04}, {"text": "Okay, I get all cold just so we have and I feel like I'm actually doing yeah, what are we searching for? Exactly? Um", "start": 1615.69, "duration": 6.29}, {"text": "There could be a spawner there could be", "start": 1622.559, "duration": 2.69}, {"text": "More chests I think is the main issue our main thing with the shadows", "start": 1626.399, "duration": 4.52}, {"text": "And just like exploring it see what's in this", "start": 1631.11, "duration": 2.51}, {"text": "You mean have a little fun time little fun time in little Minecraft's nothing nothing here. You didn't you did not okay", "start": 1633.62, "duration": 7.54}, {"text": "I closed off then close close and then", "start": 1641.16, "duration": 2.369}, {"text": "What about here Steve?", "start": 1644.14, "duration": 2.03}, {"text": "I'm stickin spider Oh monster acient", "start": 1647.65, "duration": 3.77}, {"text": "Judaism oh", "start": 1652.9, "duration": 2.0}, {"text": "Wow, oh oh Jack you fallin hurt. I fallen made poopoo. Help me Oh No Oh,", "start": 1655.81, "duration": 6.649}, {"text": "Oh", "start": 1663.46, "duration": 2.0}, {"text": "Scary skinny what take a teleporter behind you he shot me. I'm not today. Thank you Oh", "start": 1665.77, "duration": 7.609}, {"text": "Creeper ISM, whoa, we found a spotter. That's awesome. Holy Frick. I never found even in my own", "start": 1677.29, "duration": 5.239}, {"text": "Weight they're poisoned run Jack run", "start": 1684.07, "duration": 2.06}, {"text": "Minecraft is a scary game for not babies. I thought it was a regular spotter. Dang it. Well, he's scared now", "start": 1690.7, "duration": 6.29}, {"text": "Oh he running away. He backing up in the water", "start": 1697.02, "duration": 2.969}, {"text": "There's a creeper ism down there and I'm worried. Hey creeper. What's your name? Oh", "start": 1700.87, "duration": 4.28}, {"text": "man", "start": 1706.09, "duration": 2.0}, {"text": "How did you do that if you have the shield your protection wait, why is it bright here Oh,", "start": 1710.26, "duration": 5.089}, {"text": "Good question lava buh-buh-buh-buh-buh. What this what happened? Put this down here Oh,", "start": 1717.5, "duration": 6.05}, {"text": "Scary oh, whoa, it continues to shat. Oh", "start": 1725.12, "duration": 3.229}, {"text": "Good you are so good. I found gold it wait. What?", "start": 1742.01, "duration": 4.729}, {"text": "Wait, really. I found chicken place it all connects to chicken. Wait. What? Yeah, this is River before Oh,", "start": 1747.47, "duration": 7.52}, {"text": "More gold", "start": 1756.62, "duration": 2.0}, {"text": "It's iron pepper", "start": 1761.09, "duration": 2.06}, {"text": "Epic chest over here Oh guys don't know God Oh run. Yeah", "start": 1766.01, "duration": 6.41}, {"text": "Oh god why there's so many", "start": 1778.42, "duration": 2.0}, {"text": "To get back to chicken", "start": 1784.73, "duration": 2.0}, {"text": "The goal the hell is happening but the goal mommy should not have come in here without any food", "start": 1788.93, "duration": 6.199}, {"text": "Can you handle Oh God Oh God", "start": 1797.889, "duration": 2.119}, {"text": "Okay, I don't want to jump into your zone because I am afraid I'll end up hitting me oh god I'm gonna die", "start": 1803.259, "duration": 4.219}, {"text": "You have one heart, okay. Let me get them", "start": 1811.88, "duration": 2.0}, {"text": "Oh", "start": 1819.27, "duration": 1.0}, {"text": "the golden are", "start": 1820.27, "duration": 2.0}, {"text": "grabbity", "start": 1822.37, "duration": 1.38}, {"text": "Cold cold cold cold time epic cold time should we leave?", "start": 1823.75, "duration": 3.83}, {"text": "Maybe we should not be greedy. Maybe we should be strong strong like the Vikings of our forefathers forefathers were like hey", "start": 1828.16, "duration": 7.579}, {"text": "Let's not be pussies", "start": 1835.74, "duration": 2.0}, {"text": "Wait, sorry, where do we come from? This is epic way out", "start": 1843.52, "duration": 3.319}, {"text": "I do little hope to get out we should end do it making bed", "start": 1846.84, "duration": 3.69}, {"text": "Okay, but then we have to kill sheep. I kill sheep now. No, we don't", "start": 1851.68, "duration": 4.13}, {"text": "I'm not killing them. I'm putting them to sleep. Okay. I also coach sleep. Okay, and maybe I just killed it'll piggy", "start": 1857.62, "duration": 7.369}, {"text": "He smells so good he smell good I have to kill", "start": 1868.15, "duration": 2.599}, {"text": "I'm a vegetarianism real life but in Minecraft like everything is", "start": 1872.08, "duration": 4.939}, {"text": "Killable our home very pretty. Ok. Let's make bed. Ok. Yeah, I have I have", "start": 1877.33, "duration": 5.0}, {"text": "Three wool and ok, ok", "start": 1885.79, "duration": 3.38}, {"text": "Let's place down the bed. I don't think it's gonna be nighttime for a bit exam. The Sun is way high in this case thing", "start": 1890.17, "duration": 5.39}, {"text": "It's ok. I cook. Ok, let's get some food and we wait does the sleeping reset your health now? It just resets the day", "start": 1896.14, "duration": 7.219}, {"text": "I like how now I'm doing a survival. Let's play with you and I'm doing my own survival. Let's play the springtime", "start": 1903.36, "duration": 5.16}, {"text": "Well, I guess I'll I'll be do the same technically. Do you have more coat? Could you put it on the the other one?", "start": 1908.71, "duration": 6.05}, {"text": "No, it's all the coal ahead. Oh wait I have would freak", "start": 1914.76, "duration": 3.119}, {"text": "So that was like a", "start": 1919.69, "duration": 1.89}, {"text": "Villager that turned zombie before I don't know if you saw that guy who looked like weird. Oh they're corrupted", "start": 1921.58, "duration": 5.809}, {"text": "Yeah, I think it was I think that's quite rare", "start": 1927.39, "duration": 2.069}, {"text": "I don't know but I find bunches of them in my place room Oh Sun setting Sun setting time for bed", "start": 1929.46, "duration": 6.27}, {"text": "I'm just want to get to sleep the way you gotta place your own bed. I don't have a bed", "start": 1936.31, "duration": 4.88}, {"text": "Whoa, I gave you my wall to make your bed. Ah", "start": 1941.5, "duration": 2.03}, {"text": "You know what? This means we have to shoot", "start": 1944.32, "duration": 2.689}, {"text": "You to share bed with me nothing minecraft only real life okay, I sleep back now", "start": 1951.55, "duration": 5.989}, {"text": "My bed no wait", "start": 1959.5, "duration": 2.029}, {"text": "Why can't the nut make the bed a regular bed? Come on, we need to make bed. I'd I'd look for sheep", "start": 1962.679, "duration": 6.2}, {"text": "Oh so very darkness bear if target Oh get acquired. How does it work when you sleep in multiplayer? Actually, yeah", "start": 1968.88, "duration": 7.169}, {"text": "I don't know. I kill Pig because", "start": 1976.049, "duration": 2.0}, {"text": "Cows ease and creepies and she pees", "start": 1979.299, "duration": 3.26}, {"text": "Destroy the beat them all you have to kill the mannequin, but there's a scary scary man's killing me", "start": 1984.37, "duration": 5.809}, {"text": "Okay, I think I have it. I also kill sheep. Excellent retreat. I don't remember warehouse", "start": 1991.57, "duration": 6.109}, {"text": "Just keep running again", "start": 1999.37, "duration": 2.0}, {"text": "Follow the moon", "start": 2002.46, "duration": 1.89}, {"text": "And then bed. Okay. I got it. Okay. I need to put up like a barrier against", "start": 2004.35, "duration": 4.429}, {"text": "These you mean like building house", "start": 2009.899, "duration": 2.0}, {"text": "Yes, you make barrier. Very good", "start": 2013.23, "duration": 2.209}, {"text": "They stick out I'm not fast", "start": 2017.909, "duration": 2.96}, {"text": "Okay, take that, oh no another one", "start": 2023.94, "duration": 2.78}, {"text": "Man", "start": 2033.79, "duration": 2.0}, {"text": "Trying", "start": 2037.84, "duration": 2.0}, {"text": "Look you can jump on bed, you know this it's balanced fans", "start": 2043.0, "duration": 4.79}, {"text": "Wow, alright gamers", "start": 2050.649, "duration": 1.52}, {"text": "Hope you enjoy first episode smash. Like if you want more a million million double million likes and more episode and", "start": 2052.169, "duration": 7.199}, {"text": "Several beds for you. Good night gamers. Good night. Sleep tight top of night storm of the night", "start": 2059.95, "duration": 5.27}, {"text": "What you never played to simulator", "start": 2067.54, "duration": 3.05}, {"text": "You know, it's fun right? I'm not supposed to give my opinion", "start": 2072.07, "duration": 4.159}, {"text": "But give it a try and then you can tell me if it's good or not not convinced yet. Okay", "start": 2077.2, "duration": 6.199}, {"text": "I'll cut you a deal the game is available for free and that's a great price", "start": 2083.74, "duration": 5.54}]