[{"text": "The original inspiration for this video came when Alex craftily turned the Surface laptop he'd just finished", "start": 0.0, "duration": 6.8}, {"text": "writing the review for into his daily driver, and realized that our model, unfortunately only has 8GB of RAM,", "start": 6.92, "duration": 7.42}, {"text": "with no way to upgrade it.", "start": 14.38, "duration": 2.62}, {"text": "But does that matter?", "start": 17.0, "duration": 1.92}, {"text": "Well, the commonly held wisdom for years has been that, unless you're some kind of power-user,", "start": 18.92, "duration": 4.56}, {"text": "8GB ought to be enough for everyone.", "start": 23.48, "duration": 3.48}, {"text": "Well, hold on. With Windows 10 and Chrome devouring memory like Kobayashi at a hot dog-eating contest,", "start": 26.96, "duration": 5.72}, {"text": "we've been regularly seeing memory usage over 20GB just from web browsing on our writing workstations.", "start": 32.7, "duration": 8.08}, {"text": "So, we started an investigation.", "start": 40.8, "duration": 3.28}, {"text": "EK Water Blocks' MLC Phoenix lineup is designed around Quick Disconnect Couplings,", "start": 44.08, "duration": 4.38}, {"text": "and brings a modular approach to connecting and expanding your water-cooling loop.", "start": 48.46, "duration": 3.84}, {"text": "Learn more at the link below.", "start": 52.34, "duration": 1.92}, {"text": "*plink plink*", "start": 55.54, "duration": 0.96}, {"text": "*intro music plays*", "start": 56.94, "duration": 5.88}, {"text": "So, our testing rig has a Core i7-7700K, a GTX 1080Ti, and a 1TB SATA SSD.", "start": 63.28, "duration": 8.3}, {"text": "Then, we equipped it with 4, 8, 16, or 32 gigabytes of RAM.", "start": 71.6, "duration": 6.5}, {"text": "At each stage, we tracked pagefile usage with Performance Monitor,", "start": 78.1, "duration": 4.2}, {"text": "then, opened up tasks until we noticed activity.", "start": 82.34, "duration": 4.08}, {"text": "Once you reach the threshold where the system starts to swap data out of RAM and onto the boot drive,", "start": 86.42, "duration": 5.52}, {"text": "you might not necessarily see the system slow to a crawl or anything like that,", "start": 91.94, "duration": 4.3}, {"text": "but you could see a dip in performance or responsiveness if a tab or an application that you go to access", "start": 96.26, "duration": 6.8}, {"text": "has already been paged to your SSD or your hard drive.", "start": 103.1, "duration": 3.62}, {"text": "So first up is Chrome.", "start": 106.74, "duration": 1.82}, {"text": "We'll be looking both at how many Chrome tabs are open when Windows starts using pagefile,", "start": 108.56, "duration": 5.24}, {"text": "and how many are open when Chrome eventually becomes unusable.", "start": 113.8, "duration": 3.78}, {"text": "Bear in mind that not all tabs behave identically, I've seen some use 2GB of RAM on their own, but,", "start": 117.58, "duration": 6.4}, {"text": "we chose a mix of webpages that we feel should be representative of typical browsing behavior.", "start": 123.98, "duration": 5.94}, {"text": "With 4GB of RAM, we actually hit the pagefile with just 5 tabs open, and then after 13, Chrome crashed.", "start": 129.98, "duration": 8.34}, {"text": "Alrighty then.", "start": 138.38, "duration": 1.24}, {"text": "With 8GB we got to a respectable 25 tabs before any of them got swapped out,", "start": 139.64, "duration": 5.24}, {"text": "and managed 40 before the situation went totally south.", "start": 144.9, "duration": 4.02}, {"text": "With 16GB of RAM, we reached a fairly unreasonable 80 tabs open before pagefiling,", "start": 148.96, "duration": 6.82}, {"text": "and then Chrome finally crashed at around 180,", "start": 155.82, "duration": 3.12}, {"text": "then with 32GB of RAM we got all the way to 165 tabs before paging,", "start": 158.96, "duration": 6.32}, {"text": "and, frankly we didn't feel like going through actually kind of laborious process of opening and loading", "start": 165.36, "duration": 6.64}, {"text": "350 to 400 webpages in Chrome tabs, just to see the program fail. I mean,", "start": 172.02, "duration": 6.46}, {"text": "if you want that many tabs, you're kind of doing it wrong, and this is coming from me.", "start": 178.48, "duration": 5.08}, {"text": "So, let's move then into gaming.", "start": 183.56, "duration": 2.32}, {"text": "If all you're doing is playing a game, I think you might actually be surprised by how little RAM you actually need.", "start": 185.92, "duration": 7.64}, {"text": "\"Deus Ex: Mankind Divided\" for example, which recommends 12GB of RAM,", "start": 193.58, "duration": 5.32}, {"text": "didn't suffer too badly, even with only a single 4GB stick.", "start": 198.92, "duration": 4.34}, {"text": "Although, with that said, \"Rise of the Tomb Raider\" had some serious issues that were only sorted out", "start": 203.26, "duration": 5.34}, {"text": "by bumping up to 8GB of RAM.", "start": 208.62, "duration": 2.66}, {"text": "After that, though, performance didn't change for either of them when we jumped to 16GB or 32GB.", "start": 211.28, "duration": 6.36}, {"text": "So okay then. 8GB for gamers? Actually, maybe not.", "start": 217.66, "duration": 3.96}, {"text": "I mean, what if, *whoo*", "start": 221.64, "duration": 1.92}, {"text": "you don't painstakingly close down all of your running applications every time you launch Steam?", "start": 223.56, "duration": 5.64}, {"text": "For those folks, we popped open our 10-tab test suite and an instance of Discord,", "start": 229.2, "duration": 5.28}, {"text": "to see if 8GB could handle it.", "start": 234.52, "duration": 2.68}, {"text": "And, surprisingly enough, there was no difference at all, with the exception of \"Rise of the Tomb Raider\".", "start": 237.2, "duration": 6.18}, {"text": "That game seems to really love its RAM.", "start": 243.38, "duration": 2.84}, {"text": "So then, depending on the game, you probably won't need 16GB of RAM to play it,", "start": 246.22, "duration": 6.04}, {"text": "but, it won't give you a ton of breathing room for the future,", "start": 252.26, "duration": 2.92}, {"text": "and you might need to limit your background tasks for the best experience.", "start": 255.18, "duration": 3.8}, {"text": "So then, what does anyone need more than 8GB of RAM for?", "start": 259.0, "duration": 5.46}, {"text": "Well, I would argue that, any kind of workstation is going to want at least 16,", "start": 264.46, "duration": 6.04}, {"text": "and you might be surprised to find out that even more is pretty common for those kinds of systems.", "start": 270.5, "duration": 6.74}, {"text": "Alex actually has a number of Excel documents from his engineering days that, believe it or not,", "start": 277.24, "duration": 4.84}, {"text": "will not even open on a computer with 8GB of RAM,", "start": 282.1, "duration": 3.66}, {"text": "and has had some simulations of fluid flow or suspension movement that crash out, even with 16GB of RAM.", "start": 285.76, "duration": 7.96}, {"text": "Video editing can also be very demanding. But, this is heavily dependent on your workload.", "start": 293.72, "duration": 5.76}, {"text": "If you're cutting together short to medium-length 1080p videos,", "start": 299.48, "duration": 4.38}, {"text": "16GB should be plenty.", "start": 303.88, "duration": 2.04}, {"text": "But, the sky is the limit here. If you use tools like After Effects, you can expect 16 to be an absolute minimum,", "start": 305.94, "duration": 7.92}, {"text": "and as the complexity of your project increases, so does your RAM requirements.", "start": 313.86, "duration": 4.64}, {"text": "Our latest season of \"Scrapyard Wars\", for example, because of how darn much footage was in the timeline,", "start": 318.5, "duration": 6.36}, {"text": "immediately crashes with anything less than 64GB of RAM.", "start": 324.86, "duration": 5.18}, {"text": "Although, for more information about how much RAM you need for video editing specifically,", "start": 330.04, "duration": 4.76}, {"text": "you can check out our video here, where we tested it with up to 128.", "start": 334.82, "duration": 4.36}, {"text": "Now, it should be noted that all of what I'm saying concerns system memory,", "start": 339.2, "duration": 5.1}, {"text": "and not video memory, which is used for loading in 3D objects and textures for your graphics card's use.", "start": 344.32, "duration": 8.08}, {"text": "This is very important for games, and also professional applications, but is probably a discussion for a different video,", "start": 352.42, "duration": 8.12}, {"text": "one I can almost guarantee will end with, \"well, it depends.\" ;)", "start": 360.54, "duration": 4.82}, {"text": "One interesting side note before we wrap up is that as we moved up from 4GB of RAM,", "start": 365.36, "duration": 4.76}, {"text": "our system boot times actually got slower.", "start": 370.12, "duration": 2.86}, {"text": "It was only at most a second more, but, (and this is cool),", "start": 372.98, "duration": 3.56}, {"text": "if you're aware of a Windows feature called SuperFetch, it actually makes sense.", "start": 376.54, "duration": 4.44}, {"text": "SuperFetch tries to intelligently pre-load some programs into RAM so that they'll launch faster when you need them.", "start": 381.0, "duration": 7.56}, {"text": "So the idea is that if you run out and buy excess memory, it can still be used for something.", "start": 388.58, "duration": 6.22}, {"text": "Which doesn't mean, though, that we're saying to do that.", "start": 394.8, "duration": 3.4}, {"text": "As you might have noticed, RAM prices are out of control right now,", "start": 398.22, "duration": 4.62}, {"text": "so our recommendation for general users and gamers is: 8GB, if you're looking to scrape by and", "start": 402.88, "duration": 8.02}, {"text": "be ready to upgrade later,", "start": 410.9, "duration": 1.74}, {"text": "and 16GB if you wanna be comfortable for a while.", "start": 412.64, "duration": 3.26}, {"text": "As for the workstation users out there, well uh,", "start": 415.92, "duration": 4.34}, {"text": "it depends. ;)", "start": 420.26, "duration": 2.28}, {"text": "And you know what else it depends on? Yeah, it doesn't depend on that at all, forget it.", "start": 422.54, "duration": 3.78}, {"text": "Corsair's new Light Loop fans. These things look freaking incredible.", "start": 426.34, "duration": 6.02}, {"text": "They have dual RGB lighting loops with 16 independent RGB LEDs in every fan,", "start": 432.36, "duration": 6.9}, {"text": "that are split between two separate loops, allowing for nearly endless customization.", "start": 439.26, "duration": 5.08}, {"text": "The included Corsair Lighting Node PRO enables dynamic lighting effects with other Corsair LINK-supported devices,", "start": 444.34, "duration": 6.28}, {"text": "and they've got complete PWM controls so they can be controlled anywhere from 600RPM", "start": 450.62, "duration": 5.38}, {"text": "all the way up to 1500RPM depending on whether you want them to be quieter, or cool more efficiently.", "start": 456.06, "duration": 6.64}, {"text": "So check 'em out over at the link in the video description, because come on, baby. It's RGB.You know you love it.", "start": 462.7, "duration": 7.56}, {"text": "So thanks for watching, guys, if this video sucked you know what to do, but if it was awesome,", "start": 470.26, "duration": 3.52}, {"text": "get subscribed, hit that like button or check out the link to where to buy the stuff we featured in the video description.", "start": 473.78, "duration": 5.38}, {"text": "Also down there is our merch store which has cool shirts like this one,", "start": 479.16, "duration": 2.9}, {"text": "and our community forum, which you should totally join.", "start": 482.06, "duration": 3.46}]