[{"text": "Whoo it is so great to see you guys", "start": 7.089, "duration": 2.27}, {"text": "once again", "start": 9.36, "duration": 0.39}, {"text": "I want to start off this video with a trick question if you lost all of your money and your boyfriend or your girlfriend found", "start": 9.75, "duration": 5.13}, {"text": "Out that you are now put a rope. What do they leave you or would they stay by your side?", "start": 14.88, "duration": 4.229}, {"text": "Well, that's exactly what Antoine will be finding out today", "start": 19.39, "duration": 3.62}, {"text": "But before we get to that man, oh man I missed you guys", "start": 24.82, "duration": 3.02}, {"text": "I know it's been a while", "start": 27.84, "duration": 0.96}, {"text": "But I hope you guys didn't forget about these suckers right over here because you guys are gonna need him this video. Oh", "start": 28.8, "duration": 4.77}, {"text": "My god, that was such a fail", "start": 34.36, "duration": 1.53}, {"text": "so as I was saying for this video we are on a mission to see if Antoine's girlfriend Jada would end up leaving him for", "start": 35.89, "duration": 5.479}, {"text": "A rich guy after finding out that Antoine was now broke. I", "start": 41.37, "duration": 3.659}, {"text": "Got $200 to my name once that is gone. I'm broke, of course though", "start": 47.17, "duration": 3.5}, {"text": "This is just a test Antoine is not really broken. The rich guy is just pretending to be rich", "start": 50.67, "duration": 4.59}, {"text": "He's actually my friend loris in order to make him look rich though. He ended up renting out a multi-story volte bedroom", "start": 55.26, "duration": 6.36}, {"text": "Multi-million dollar home in Venice Beach and once booked we then made our way over to it", "start": 62.14, "duration": 4.79}, {"text": "This house was freakin gorgeous and the entire test from start to finish will be taking place in it", "start": 66.96, "duration": 5.309}, {"text": "Jada's gonna walk in through the front door", "start": 72.299, "duration": 1.621}, {"text": "Which he doesn't know is that Loris will be waiting for her when the time is right", "start": 73.92, "duration": 2.97}, {"text": "He's gonna head it downstairs and greet her as the owner. He's then gonna deliver some bad news to her", "start": 76.89, "duration": 3.9}, {"text": "Jada will then learn that Antoine is broke and finally Loras will try to swoop all the while Antoine will be upstairs in a bedroom", "start": 80.79, "duration": 6.0}, {"text": "Listening in to everything via FaceTime audio to see if Jada will end up treating him or not", "start": 87.04, "duration": 4.969}, {"text": "Now why does aunt won't even want to test Jada well because there is one issue that is causing some serious tension between them and", "start": 93.579, "duration": 6.62}, {"text": "To make it worse Antoine got with Jada after breaking up with a girl that he dated for years", "start": 100.2, "duration": 3.75}, {"text": "And this one issue was never a problem in that previous relationship", "start": 104.17, "duration": 3.709}, {"text": "I'm not gonna tell you guys what that one issue is just yet, but you guys will find out in a little bit here", "start": 107.88, "duration": 3.87}, {"text": "well, yo", "start": 112.06, "duration": 2.0}, {"text": "I'll go outside and get two right now. It's a little confusing appliances", "start": 115.21, "duration": 2.58}, {"text": "So what side we went to go get Loras and when we officially linked up and brought him inside", "start": 118.01, "duration": 3.829}, {"text": "We then began to hide our cameras and when we were done with that all that was left to do was just wait for antoine", "start": 121.84, "duration": 5.07}, {"text": "Who would arrive in a couple of hours?", "start": 126.91, "duration": 1.69}, {"text": "Killing all those hours would have been very very boring", "start": 128.6, "duration": 2.179}, {"text": "But lucky for me. I was entertained playing raid shadow legends", "start": 130.78, "duration": 3.57}, {"text": "Once again, this game is sponsoring your video and I want to urge you guys to download it", "start": 134.42, "duration": 3.889}, {"text": "I guarantee that you will enjoy it's amazing storyline be captivated by its crazy 3d graphics and become addicted to collecting all the epic champions", "start": 138.31, "duration": 7.169}, {"text": "There are also constant updates to the game", "start": 145.72, "duration": 1.95}, {"text": "So it always stays exciting in the description are my links to download this game for free. So go do it", "start": 147.67, "duration": 5.19}, {"text": "you'll receive", "start": 152.89, "duration": 0.64}, {"text": "50,000 silver ends a free epic champion when you do so this game also has an almost perfect score in the App Store I would", "start": 153.53, "duration": 5.419}, {"text": "Have not be recommending it if it wasn't good", "start": 158.95, "duration": 1.75}, {"text": "Now if you're one of those people who's like, oh, I just don't play games anymore. Trust me", "start": 160.7, "duration": 3.86}, {"text": "This is the game that will get you playing again. I", "start": 164.56, "duration": 2.19}, {"text": "Mean heck I almost want to play it right now, but I can't I'll play this later. We have to finish the video", "start": 167.36, "duration": 3.979}, {"text": "Ok, so a couple of hours go by and Antoine finally makes it to the hops are", "start": 171.5, "duration": 4.1}, {"text": "You doing hey, this is Lara now. I'm sure you might be wondering wait where the hell is Jada?", "start": 176.9, "duration": 4.49}, {"text": "How will she be getting to the house? Well, that is Antoine's job. See if I don't week ago", "start": 181.39, "duration": 3.96}, {"text": "We had Antoine so Jada that he wanted to take her on a nice three-day mini vacation in Venice Beach", "start": 185.35, "duration": 4.44}, {"text": "he sent her photos of the house and even the reservation receipts the plan was to have Jada under the impression that", "start": 189.79, "duration": 5.369}, {"text": "Antoine rented the house", "start": 195.29, "duration": 1.22}, {"text": "She's also under the impression that her and Antoine are gonna show up at the house together", "start": 196.51, "duration": 3.78}, {"text": "But of course that's not the case. We need her to come alone and think that Antoine is not even close to the house", "start": 200.29, "duration": 4.709}, {"text": "So right now Antoine will be calling her making up another excuse and asking her to just head to the house on her own", "start": 205.03, "duration": 5.79}, {"text": "Exactly I'm starting to storia with the homies right now. So it's gonna be some time fore I get there. I", "start": 213.829, "duration": 4.49}, {"text": "Know babe, just give me some time. All right. Hey just head to Airbnb right now on each other", "start": 219.65, "duration": 4.13}, {"text": "I'll cash up your gas money right now. Okay, I'll just sing about 20 30 bucks. All right, just get that out", "start": 223.78, "duration": 3.809}, {"text": "Babe I can't get up there. Okay. We've got this new song popping", "start": 231.22, "duration": 2.779}, {"text": "Okay, I'll just sing some gas play so you get there. Give me some time", "start": 234.0, "duration": 3.089}, {"text": "Give me like two hours", "start": 239.5, "duration": 2.0}, {"text": "Maybe just give me two hours. The more were on the phone the more I'm gonna take up - give me two hours", "start": 242.53, "duration": 4.22}, {"text": "Please like go to the air B&B right now. I'm on the cash of you right now. So go there right now", "start": 246.75, "duration": 4.08}, {"text": "Oh", "start": 252.58, "duration": 2.0}, {"text": "Jesus it was an uphill battle. I got a little nervous but we did it people Jada is coming to the house by herself", "start": 254.95, "duration": 5.24}, {"text": "That's all on you buddy. You're up, sir", "start": 260.47, "duration": 2.0}, {"text": "Whoo, okay, so that was probably like a one-minute break for you guys", "start": 268.66, "duration": 4.16}, {"text": "But that was like an hour break for me right over here. We got everyone in the background", "start": 272.82, "duration": 2.729}, {"text": "That's Josh the editor right there, and there's Denso, but anyways guys back to the video. So thanks to Antoine", "start": 275.55, "duration": 5.369}, {"text": "We knew approximately what time Jada would be arriving and when it came close to that time", "start": 280.919, "duration": 3.51}, {"text": "We ended up double-checking our cameras and when Jada Texas that she was right around the corner", "start": 284.43, "duration": 3.66}, {"text": "We ended up hitting record on those cameras. We then left Loras downstairs", "start": 288.09, "duration": 3.57}, {"text": "We turned off all of the lights and we made our way upstairs", "start": 291.66, "duration": 2.25}, {"text": "To the bedroom to hide to link onto a phone call with Flores and to wake her Jada to arrive", "start": 294.07, "duration": 4.609}, {"text": "Yeah, I can yes. Remember to put me on mute. Oh, no, no. No not on me. I'm sorry", "start": 298.87, "duration": 3.709}, {"text": "I'm gonna put you on mute", "start": 304.24, "duration": 1.5}, {"text": "Like I said, we left Lori's downstairs and I swear this man is gonna give poor Jada a heart attack", "start": 305.74, "duration": 4.52}, {"text": "He's actually the one who insisted that we turn off all the lights. The reason why is because he's always wanted to do this", "start": 310.26, "duration": 5.399}, {"text": "Definitely wants to do this. I'm telling this gonna scare her dude", "start": 317.62, "duration": 4.49}, {"text": "Well, we ended up letting him have his way and after a good couple of minutes Jada finally", "start": 322.78, "duration": 4.55}, {"text": "Texas Antwon asked him for the code to get into the house. Okay. She just she's just showed up. Okay", "start": 327.33, "duration": 5.91}, {"text": "The moment of truth has arrived ladies and gentlemen", "start": 333.91, "duration": 2.779}, {"text": "It's time to get this test officially started and the first step is to tell Jada some very very bad news. Oh", "start": 336.69, "duration": 6.3}, {"text": "Man okay. So Jada walked in and she is actually on her phone", "start": 348.76, "duration": 3.38}, {"text": "So she doesn't even notice that Loras is in the room. That is freaking creepy. I would honestly freak the hell out", "start": 352.14, "duration": 5.489}, {"text": "Hopefully this girl doesn't run or call the cops or something", "start": 357.79, "duration": 2.119}, {"text": "Are you a handsome funny?", "start": 366.66, "duration": 2.0}, {"text": "Are you a handsome funny? Yeah, I", "start": 373.35, "duration": 2.389}, {"text": "Am the owner, my name is Laura's is that wrong with you boys", "start": 378.09, "duration": 3.44}, {"text": "No, you see like the that's the thing like I can't let you guys stay here I", "start": 388.38, "duration": 5.57}, {"text": "Yeah, I never got paid. I was waiting for my payment", "start": 395.07, "duration": 3.709}, {"text": "No, no, yeah like and they went through but somebody must have filed a claim on the transaction", "start": 404.31, "duration": 5.63}, {"text": "he must have called the bank and did a", "start": 409.94, "duration": 1.57}, {"text": "Refund because I got paid then it froze it and then it got reimbursed to Antoine", "start": 411.51, "duration": 4.489}, {"text": "So ladies and gentlemen Loras has successfully delivered to the bad-news scheme for his Jada that there was a stop payment on her and Antoine's", "start": 416.0, "duration": 6.209}, {"text": "reservation so unfortunately", "start": 422.28, "duration": 2.0}, {"text": "They can't state", "start": 424.65, "duration": 2.0}, {"text": "So, I mean I would suggest Antoine count with you know, yeah", "start": 430.62, "duration": 3.92}, {"text": "Okay, so this was one of the reactions that we anticipated from Jada she has decided to take initiative and give Antoine a call", "start": 438.87, "duration": 5.54}, {"text": "However, what we did not anticipate is that she would have be giving him a call outside", "start": 444.45, "duration": 4.549}, {"text": "So hard and setting up so many cameras around the house", "start": 450.33, "duration": 2.54}, {"text": "Jada decides to call Antoine and the one place that we did not set up any cameras. Ultimately though", "start": 453.08, "duration": 5.13}, {"text": "I blame Loras because my man sends her outside", "start": 458.21, "duration": 2.369}, {"text": "Yeah, you guys anybody here yeah, I know we heard um, she okay, she's calling Anton right now in fact muting you though", "start": 468.78, "duration": 6.139}, {"text": "It was a bad", "start": 477.94, "duration": 2.0}, {"text": "Haul I canceled pay me I didn't do those like that", "start": 486.73, "duration": 2.959}, {"text": "We can't stay there I didn't do know what let me call the bay unload the fuckin call the bank", "start": 493.84, "duration": 4.7}, {"text": "I'll give you a call back. I see what's up", "start": 498.54, "duration": 2.0}, {"text": "Okay, so the stage is now set for us to move on to step two of our plan", "start": 504.07, "duration": 3.38}, {"text": "And that is to finally let Jada know that Antwon is broke supposedly suppose", "start": 507.45, "duration": 5.519}, {"text": "That's good", "start": 515.62, "duration": 1.26}, {"text": "That's good", "start": 516.88, "duration": 0.86}, {"text": "We don't come back you see up there because we call the bank that thinks like take forever to answer you have to wait about", "start": 517.74, "duration": 4.739}, {"text": "Five, I would say yeah tend to be safe", "start": 523.21, "duration": 2.299}, {"text": "Or what I'm tripping on is the fact that we do have a camera outside. So we're literally like missing everything", "start": 526.03, "duration": 4.25}, {"text": "I mean, it sucks that we didn't have a camera set up outside of it", "start": 531.25, "duration": 3.109}, {"text": "I mean hey", "start": 534.36, "duration": 0.39}, {"text": "We just have to improvise and get what we could so we decided to wait a good 10 to 15 minutes before calling Jada back", "start": 534.75, "duration": 6.15}, {"text": "Would you like some water or anything?", "start": 541.6, "duration": 2.0}, {"text": "And so after 10 to 15 minutes tick five, we have Antwon finally give Jada callback", "start": 546.3, "duration": 5.659}, {"text": "Babe so basically they say it's credit card fraud there. They couldn't go through with the payment", "start": 554.22, "duration": 4.76}, {"text": "What I just told you credit card fraud", "start": 560.31, "duration": 2.0}, {"text": "They said they can't do nothing about it because I did send one of the guys here to the store", "start": 565.079, "duration": 4.1}, {"text": "To go big pick up something for the studio", "start": 569.459, "duration": 2.09}, {"text": "but I guess he just took out more than was posed to and", "start": 571.55, "duration": 3.15}, {"text": "Since I gave him my pin number to my car they said that's all me so there's nothing they can do about it", "start": 574.98, "duration": 4.34}, {"text": "Down the chute someone just told you phony I", "start": 586.74, "duration": 5.059}, {"text": "Have no other money I do have another card. Oh, but it's not enough to cover the expenses of what room", "start": 597.45, "duration": 4.639}, {"text": "What are you talking about what do you mean what does that do it right now? I", "start": 609.83, "duration": 2.96}, {"text": "Repeat, what? Does that have to do it right now?", "start": 620.18, "duration": 2.0}, {"text": "I'm sorry. It's out of my control. Okay. It happens. We want me to do", "start": 634.4, "duration": 3.14}, {"text": "In the beginning of the video I mentioned to you guys if there was one issue that was causing tension between", "start": 644.6, "duration": 4.52}, {"text": "Antwon and Jada and this is that one issue if it hasn't become apparent already Antwon is actually pursuing a music career", "start": 649.34, "duration": 6.65}, {"text": "Which means that he's investing a lot of time and money into his craft", "start": 655.99, "duration": 3.63}, {"text": "unfortunately, though", "start": 660.32, "duration": 0.78}, {"text": "Jada finds it really really hard to support him in that and like you guys just heard she is constantly getting upset at him because", "start": 661.1, "duration": 5.359}, {"text": "She feels like he could be investing his money and his time into other things that she thinks would be quote", "start": 666.46, "duration": 4.5}, {"text": "smarter for him to do", "start": 671.3, "duration": 2.0}, {"text": "So our test was kind of on hold because we were now waiting for Jada to call us back", "start": 674.51, "duration": 4.13}, {"text": "But thankfully after about ten minutes she does so", "start": 678.64, "duration": 3.239}, {"text": "Hello", "start": 687.14, "duration": 2.0}, {"text": "What do you mean what's up you called me you said don't call your friends you call your plan because I'm waiting on you. I", "start": 689.48, "duration": 4.519}, {"text": "Have no other money I spent mostly all my money on the studio stuff. I got $200 to my name once that's gone. I'm broke", "start": 700.1, "duration": 6.679}, {"text": "And believe it you would me come all the way out here", "start": 711.05, "duration": 2.759}, {"text": "Babe like I've looked I'm gonna make it up to you. Okay?", "start": 720.9, "duration": 2.839}, {"text": "The song is about the table the song is about the pop right now once the song pops off", "start": 726.75, "duration": 4.34}, {"text": "I'm gonna take you wherever whatever you want to go. It don't matter. Oh", "start": 731.09, "duration": 2.969}, {"text": "Man okay, so", "start": 744.27, "duration": 1.86}, {"text": "Jada ended up becoming a little bit more upset than at least", "start": 746.13, "duration": 2.72}, {"text": "I thought she would she wants to leave the house, but hopefully Lara's can complete step 3 of the test before she tests", "start": 748.85, "duration": 6.69}, {"text": "So so what happened?", "start": 755.82, "duration": 2.0}, {"text": "I really can't", "start": 759.81, "duration": 2.0}, {"text": "I'm gonna get myself. Oh", "start": 762.279, "duration": 2.0}, {"text": "It seems like you really wanted to say no like really", "start": 765.819, "duration": 3.86}, {"text": "Boyfriend why do you think that all he ever does is", "start": 773.29, "duration": 3.169}, {"text": "moneyless", "start": 777.91, "duration": 2.0}, {"text": "Spending money on these videos promoting", "start": 780.49, "duration": 2.58}, {"text": "Nothing it's just sometimes you have to you have to learn that", "start": 786.709, "duration": 4.85}, {"text": "Geez okay, so it appears that Jada has a lot to Vince", "start": 795.94, "duration": 3.169}, {"text": "I mean at the end of the day, it's okay for her to have a different perspective on things", "start": 799.11, "duration": 3.179}, {"text": "I mean, it's unfortunate that they don't line up with Anton's perspectives, but that doesn't mean she's not loyal", "start": 802.29, "duration": 4.44}, {"text": "Do you think didn't you know like you can like support him in his crap?", "start": 806.73, "duration": 3.299}, {"text": "Jeez I mean if I'm being honest, dude", "start": 820.149, "duration": 3.17}, {"text": "It kind of sounds like you can't love him the way he wants you to and he can't love you the way you want him", "start": 823.32, "duration": 4.95}, {"text": "To you know, do you even think you guys are a good match?", "start": 828.27, "duration": 2.909}, {"text": "How about this I'll let you stay here, you know for the for the three days, you know free of charge", "start": 839.08, "duration": 5.929}, {"text": "Yeah, I'm serious I", "start": 846.73, "duration": 2.0}, {"text": "will feel like a", "start": 849.31, "duration": 1.5}, {"text": "Real big dick if I didn't, you know, if I if I kicked you out, you know", "start": 850.81, "duration": 4.19}, {"text": "I feel like I'm crushing your dreams or something like", "start": 855.0, "duration": 2.0}, {"text": "Yeah, come sit down though. He come sit down come sit. Oh my gosh. Damn. So just when Laura sees, dr", "start": 857.68, "duration": 5.119}, {"text": "Phil talk crazy stout Jada. He made it epic comeback by telling her that she could stay at the house free of charge", "start": 862.8, "duration": 6.059}, {"text": "Unless you're joking", "start": 869.68, "duration": 2.0}, {"text": "I'm serious. I'm serious. I'm serious. You know, you're very pretty girl", "start": 872.68, "duration": 4.13}, {"text": "You know you seem like you know what you deserve and for like this guy, you know", "start": 876.81, "duration": 4.5}, {"text": "He's not giving you what you do deserve but you know, not every guys like that know", "start": 881.31, "duration": 3.869}, {"text": "If I'm being honest, I would really feel honored", "start": 886.63, "duration": 2.659}, {"text": "If you would, you know, give me a shot to show you how you should be treated", "start": 889.29, "duration": 3.69}, {"text": "It's not a condition it's not nothing, you know, you could call up Antoine now and have them come through", "start": 901.089, "duration": 5.0}, {"text": "I'm just giving you an option cuz you don't really seem too happy with this Antoine guy, you know", "start": 906.1, "duration": 4.369}, {"text": "there's a music thing spending it all on dad not spending it on you, you know like", "start": 910.47, "duration": 4.53}, {"text": "What do I do Oh", "start": 917.199, "duration": 1.981}, {"text": "Dango, dango thing Oh ding, okay", "start": 919.18, "duration": 1.519}, {"text": "This could be the end of everything for those of you guys who don't know loris actually does music as well", "start": 920.699, "duration": 4.98}, {"text": "Well, as you guys know Jeana wouldn't like or be supportive of a music career", "start": 925.68, "duration": 4.019}, {"text": "So if Flores ends up telling her the truth that he does music", "start": 929.91, "duration": 2.82}, {"text": "This is the end of the line and the results could be inconclusive", "start": 932.769, "duration": 2.84}, {"text": "However, hopefully Loras is smart and he's able to stay in character and come up with the different response", "start": 935.639, "duration": 5.04}, {"text": "I'm gonna really state, you know, that's how I make my money", "start": 947.949, "duration": 2.54}, {"text": "I got my shit together, you know, I do that, you know", "start": 950.49, "duration": 3.75}, {"text": "But like I said you could I'm trying to let you stay here cuz I don't want to be a dick and kick you out", "start": 954.24, "duration": 4.679}, {"text": "Another yeah, those three days I could show you around I could take you out", "start": 958.92, "duration": 3.33}, {"text": "I could take you to the nice restaurant right down the beach", "start": 962.29, "duration": 2.929}, {"text": "The beach is like three blocks that way, you know, I can I can I can treat you right?", "start": 965.22, "duration": 3.989}, {"text": "But like I said, you can you can do that with me or you can just do all that with your boyfriend", "start": 970.089, "duration": 4.76}, {"text": "But I mean, honestly, you don't really seem like you too happy with them", "start": 974.85, "duration": 3.03}, {"text": "Okay, so we have successfully pulled off this test as best as we possibly could now it's time to see what Jada's responsible be", "start": 978.85, "duration": 6.739}, {"text": "She's been placed in a hypothetical situation where her boyfriend is broken", "start": 985.589, "duration": 3.51}, {"text": "She now has a choice to make will Jada stay loyal to Antwon and turn down the dates Lloris", "start": 989.1, "duration": 5.73}, {"text": "Well, people will find out after this commercial break", "start": 994.83, "duration": 3.059}, {"text": "I", "start": 1003.6, "duration": 2.0}, {"text": "Apologize for cutting it right then in there", "start": 1010.95, "duration": 1.67}, {"text": "But I had to go get this band's over here because my wrist and my forearm are hurting from all the editing that I'm doing", "start": 1012.62, "duration": 4.349}, {"text": "Oh, but it's all good. No pain. No gain. Where were we in this video? I can take it to the nice restaurant", "start": 1017.01, "duration": 5.69}, {"text": "all right down the beach I can I can treat you right but like I said", "start": 1022.7, "duration": 2.85}, {"text": "you can do that with me or you can just do all that with your", "start": 1025.55, "duration": 2.699}, {"text": "Time is really up to you go", "start": 1031.74, "duration": 2.0}, {"text": "Yeah, when it comes to me and Antoine like I", "start": 1034.89, "duration": 2.66}, {"text": "Just think right now maybe the best thing is just", "start": 1039.81, "duration": 2.359}, {"text": "I", "start": 1045.35, "duration": 0.609}, {"text": "Kind of figured what was gonna happen guys like Jada was thinking about it. Just way too long", "start": 1045.959, "duration": 4.01}, {"text": "You don't think about it that long unless you're actually considering it", "start": 1049.97, "duration": 2.789}, {"text": "But I mean heck I guess even if she is considering it as long as she still says no, I guess she passes a test", "start": 1052.759, "duration": 5.16}, {"text": "In your house, I was just gonna ask, okay like invite some friends over", "start": 1074.22, "duration": 4.429}, {"text": "Don't break nothing and don't invite Antoine", "start": 1079.98, "duration": 2.959}, {"text": "Not only can Jada not support Antoine in his music, but she also can't stay loyal to him", "start": 1083.34, "duration": 5.449}, {"text": "I'm gonna click cuz I think that was enough. It just might lead to the point where she starts saying", "start": 1088.789, "duration": 3.21}, {"text": "Oh, can I go put my stuff in the room or something like and she comes upstairs and finds us here", "start": 1092.0, "duration": 3.209}, {"text": "But what do you think? What are your thoughts?", "start": 1095.21, "duration": 2.0}, {"text": "Do you think she might have just been vulnerable or mad at you?", "start": 1098.7, "duration": 2.689}, {"text": "Do you think you might have just accepted to go on a date with him because she's really mad at her and she's really heated", "start": 1101.389, "duration": 3.84}, {"text": "And that's what she just said. Yeah, so she's just really accepted on a date with Laurence out of anger", "start": 1105.23, "duration": 3.569}, {"text": "That's what a part of me thinks. I don't know. It's whatever your thought is then what's your thought process? What are you?", "start": 1108.99, "duration": 4.01}, {"text": "Looking back on it now at the end of the day whether she was angry or she just won the house", "start": 1117.53, "duration": 3.8}, {"text": "She still failed if she thinks it's okay for her to do this because of anger because she wants the house and what other things", "start": 1121.33, "duration": 5.429}, {"text": "Is she willing to do because of her anger and her wants?", "start": 1126.76, "duration": 2.16}, {"text": "Paid in full, okay, I know", "start": 1130.46, "duration": 2.9}, {"text": "Maybe want to sell I", "start": 1135.71, "duration": 2.0}, {"text": "Know how much small talk Lars can keep her out there. So you said you wanted to go out there?", "start": 1141.2, "duration": 3.739}, {"text": "Are you good to go out there? Okay, hold on one sec. One second", "start": 1144.94, "duration": 3.839}, {"text": "Let me let me actually built my other camera. But okay. So Antoine is ready to go", "start": 1148.78, "duration": 3.75}, {"text": "Woo people you guys know exactly what time it is and no there are no more commercial breaks", "start": 1152.56, "duration": 3.689}, {"text": "So I hope you guys listen to me to grab your talk is in the beginning because we're gonna go straight into this thing", "start": 1156.25, "duration": 4.29}, {"text": "It's not her first rodeo together", "start": 1160.54, "duration": 1.56}, {"text": "You guys should have talkies every single video with at least half the back state for the confrontation because you guys already know", "start": 1162.1, "duration": 5.339}, {"text": "This shit's can't be good", "start": 1169.31, "duration": 2.27}, {"text": "What's up cute, is that what's up here? That's no no you expose now bitch you expose now, okay", "start": 1182.61, "duration": 6.469}, {"text": "I let the whole world know how big the whole you is", "start": 1189.08, "duration": 2.0}, {"text": "What's up? What's up? What is that Jada?", "start": 1192.42, "duration": 2.809}, {"text": "I", "start": 1199.08, "duration": 2.0}, {"text": "Lied cos Jada that vocal are gay. I get a card you are when I called you with some shithead credit card fraud", "start": 1201.87, "duration": 5.45}, {"text": "I'm fucking lies. I still got my money", "start": 1207.32, "duration": 2.25}, {"text": "And guess what? You ain't seen the domination, bitch", "start": 1210.09, "duration": 2.21}, {"text": "Ain't nobody joking Jada you see me laughing", "start": 1214.41, "duration": 3.229}, {"text": "So jameth, so just so just so you understand like everything my name is Sergio", "start": 1219.21, "duration": 3.77}, {"text": "this entire thing was actually just a test the plan for this test was to make Antoine broke and then have someone else who had", "start": 1223.44, "duration": 5.689}, {"text": "More money hit on you and stuff", "start": 1229.13, "duration": 1.5}, {"text": "Because we wanted to see if you would end up going out with him or saying well - Antoine and stuff", "start": 1230.63, "duration": 3.18}, {"text": "Did you fail you fail Oh", "start": 1233.97, "duration": 3.229}, {"text": "God do to you", "start": 1241.11, "duration": 2.0}, {"text": "Bitch", "start": 1246.54, "duration": 2.0}, {"text": "Fucking embarrassing", "start": 1257.58, "duration": 1.569}, {"text": "Photo for partnerships. Excuse me. First of all, you don't want to quit your job. That was your job not mine yours", "start": 1259.149, "duration": 5.839}, {"text": "I didn't make you quit you put your mother and job number two", "start": 1264.989, "duration": 3.45}, {"text": "I called you and I asked you we go do it this week or next week?", "start": 1268.44, "duration": 4.02}, {"text": "That's so proud you live it up get MoMA you never think pork the motherfucking future you live this weird-ass world", "start": 1282.46, "duration": 5.809}, {"text": "We all thought process we're balls around", "start": 1288.269, "duration": 2.01}, {"text": "Motherfucking Jada it's gotta be Jenna this Jenna death. It's my way or the highway mother you fly planes right now. So I guess", "start": 1290.95, "duration": 6.89}, {"text": "Go", "start": 1299.529, "duration": 2.0}, {"text": "Use me, oh man, this is gonna be interesting I need these I paid", "start": 1307.389, "duration": 4.25}, {"text": "My job to be here today you didn't I was fine without you but then you had to go do all this", "start": 1312.22, "duration": 4.729}, {"text": "So you looking for money", "start": 1323.35, "duration": 2.0}, {"text": "Go start sucking dick right down the corner in fig right there. I'm home school. What are you gonna came?", "start": 1325.509, "duration": 4.13}, {"text": "Here you off a Crisco right now. I know the bouncer", "start": 1329.639, "duration": 2.0}, {"text": "Yeah, go suck dick", "start": 1332.379, "duration": 2.0}, {"text": "You don't suck some dick", "start": 1334.96, "duration": 2.0}, {"text": "Gina oh", "start": 1338.109, "duration": 2.0}, {"text": "Man apparently Jada quit her job to come to this house", "start": 1343.119, "duration": 3.92}, {"text": "I don't know how true that is or isn't but she is not threatening to break these things in this house if she doesn't get", "start": 1347.039, "duration": 5.369}, {"text": "paid", "start": 1352.409, "duration": 2.0}, {"text": "Gina why would you put your job?", "start": 1355.72, "duration": 2.0}, {"text": "Oh", "start": 1358.239, "duration": 1.05}, {"text": "Jesus I don't think any of us saw that coming like we knew she was mad and threatening it but like people are mad at", "start": 1359.289, "duration": 4.579}, {"text": "Threatened stuff all the time. Like they don't actually go through that, but Jada went through", "start": 1363.869, "duration": 3.54}, {"text": "That's one very poor choice of words", "start": 1378.05, "duration": 2.0}, {"text": "Okay, can't wash it like this", "start": 1385.97, "duration": 2.0}, {"text": "That stuff is not ours this house is rented this house doesn't belong to him just you're breaking someone else's things. It's our space", "start": 1388.97, "duration": 5.21}, {"text": "Nobody paying you here", "start": 1397.01, "duration": 2.0}, {"text": "This girl was out of control", "start": 1399.08, "duration": 1.85}, {"text": "I came to the conclusion that no one not even Antoine could stop her at this point her peril", "start": 1400.93, "duration": 4.499}, {"text": "'evil was way over", "start": 1405.429, "duration": 0.911}, {"text": "9000 and when I saw her going for the fourth thing to break I realized that someone had to give in to her demands", "start": 1406.34, "duration": 4.849}, {"text": "Okay. Okay. I'll pay you. I'll pay you I'll pay you stop. Okay, will you take a check? I'll pay you in check", "start": 1411.35, "duration": 4.82}, {"text": "Can I write you a check? It's in my car", "start": 1416.17, "duration": 2.399}, {"text": "Will you not break anything while I go get it?", "start": 1418.6, "duration": 1.72}, {"text": "So I agree to pay Chatam, but here's the funny thing as I was walking to the car", "start": 1420.32, "duration": 3.32}, {"text": "I was like, yeah, what if we actually don't have to pay this girl, I mean we do these gold digger videos", "start": 1423.64, "duration": 4.229}, {"text": "Anyways, we have prop money and we also have fake checks", "start": 1427.87, "duration": 3.18}, {"text": "literally County", "start": 1432.29, "duration": 2.0}, {"text": "Exactly I have a check. This is the perfect plan", "start": 1436.85, "duration": 3.05}, {"text": "The problem was I didn't use those checks in a minute why they exist you know where they work", "start": 1439.91, "duration": 4.519}, {"text": "Can you can you check in that day back trunk?", "start": 1445.16, "duration": 2.149}, {"text": "Please and have them something right there or the front check in the front", "start": 1447.309, "duration": 2.76}, {"text": "All right, every motherfucking thing on that goddamn phone see this is the problem with you. Look at that", "start": 1450.07, "duration": 4.95}, {"text": "You're demeaning right now and your body language. You don't give a fuck", "start": 1455.02, "duration": 2.669}, {"text": "That's some bullshit reason. I don't need your motherfucking life no more. You can fucking bounce", "start": 1458.6, "duration": 4.489}, {"text": "Why should I have to pay you for anyway, elaborate, please?", "start": 1463.94, "duration": 2.78}, {"text": "Why do you want money for her how do I make you quit your goddamn job?", "start": 1468.559, "duration": 4.13}, {"text": "No fault no", "start": 1476.63, "duration": 2.0}, {"text": "Fault no fault", "start": 1479.6, "duration": 2.0}, {"text": "Some who's just fucking afraid they take responsibility for the lady. That's so bullish. What do you what do you have a thing? No", "start": 1482.15, "duration": 6.59}, {"text": "He's gonna hold it you all we could find was prop money", "start": 1490.16, "duration": 2.839}, {"text": "We were looking and looking and looking everywhere for those checks, but we couldn't find them at this point", "start": 1493.0, "duration": 4.23}, {"text": "We had already taken a couple of minutes and I had a feeling that Jada was gonna break something again", "start": 1497.23, "duration": 4.529}, {"text": "Or worse she would end up noticing the camera inches away from her and breaking facts", "start": 1501.76, "duration": 4.17}, {"text": "But what I didn't know is that something else was happening inside of the house", "start": 1505.93, "duration": 3.54}, {"text": "Antwuan actually decided to pull up his phone and send money to her bait. You know what I trust you. Love no more", "start": 1509.87, "duration": 5.839}, {"text": "I don't exactly know why he did it in the video", "start": 1515.71, "duration": 1.89}, {"text": "He says it's because he was tired of seeing her ugly mug, but at the same time he could have felt bad for me", "start": 1517.6, "duration": 3.869}, {"text": "He could have felt bad for all those things that were breaking or maybe he was just tired of seeing her mug", "start": 1521.47, "duration": 4.109}, {"text": "I don't know. But the point is he paid her. There you go", "start": 1525.58, "duration": 2.729}, {"text": "Check your baby did", "start": 1528.44, "duration": 1.35}, {"text": "Jada then walked on over to her phone check that she got the payment and then just like that", "start": 1529.79, "duration": 4.729}, {"text": "Got her things and made her way out", "start": 1534.62, "duration": 2.119}, {"text": "Jada was gone Antwon paid her. I didn't get a pair with the fake checks", "start": 1542.27, "duration": 3.35}, {"text": "What a shame", "start": 1546.47, "duration": 1.11}, {"text": "but at the end of the day the good news was that nobody was hurt and at least Antwon now knew the truth and when", "start": 1547.58, "duration": 5.15}, {"text": "Leslie came and got me from the garage and told me what Antwon had done", "start": 1552.73, "duration": 2.549}, {"text": "I finally had a chance to assess the bad news", "start": 1555.28, "duration": 2.55}, {"text": "Let's just say I would have not be surprised if those things end up costing us a lot of money", "start": 1557.96, "duration": 4.849}]