[{"text": "This video on air versus water cooling has two million views. It looks like crap", "start": 0.25, "duration": 7.73}, {"text": "Time for an HD remake", "start": 8.83, "duration": 2.96}, {"text": "And, it's not just a pure sellout move to capitalize on an idea that we already know works", "start": 12.49, "duration": 4.789}, {"text": "because a lot more has changed since that video, than our production values around here", "start": 17.59, "duration": 6.439}, {"text": "In particular AMD's High performance, not to mention huge and hot,", "start": 24.699, "duration": 4.97}, {"text": "180 watt threadripper CPUs are", "start": 30.609, "duration": 2.359}, {"text": "pushing the limits of all types of cooling systems in ways that we have never seen before", "start": 33.34, "duration": 6.11}, {"text": "So what's the ultimate cooler for the ultimate CPU? We have", "start": 39.969, "duration": 5.09}, {"text": "the answer", "start": 45.7, "duration": 1.16}, {"text": "The white Dark Base Pro 900 from Be Quiet features a modular design to support a variety of layouts and", "start": 56.29, "duration": 6.59}, {"text": "configurations. Check it out at the link below.", "start": 63.309, "duration": 2.09}, {"text": "We'll be testing six coolers that on previous platforms have delivered", "start": 66.22, "duration": 4.819}, {"text": "comparable results", "start": 71.71, "duration": 1.38}, {"text": "Three air and three liquid", "start": 73.09, "duration": 2.45}, {"text": "For water coolers, AMD helpfully provided an Asatek compatible TR4 mount in the CPU box, so we're able to use our existing", "start": 76.119, "duration": 7.79}, {"text": "stable of compatible Corsair H series AIOs, which is cool, because that means so can you.", "start": 84.369, "duration": 6.56}, {"text": "We've Got 120 millimeter, 240 millimeter, and", "start": 91.24, "duration": 3.349}, {"text": "280 millimeter radiator versions with all of them featuring the same Asatek design CPU block and", "start": 95.14, "duration": 6.319}, {"text": "in the H115i's case, a slightly more powerful pump.", "start": 101.71, "duration": 4.519}, {"text": "In a stroke of either luck or AMD foresight, the blocks are just big enough,", "start": 106.57, "duration": 5.209}, {"text": "that even though the heat spreader sticks out, the heat producing die area for threadripper is covered", "start": 112.06, "duration": 7.44}, {"text": "So while these are mainly meant for more square CPUs we have no reason to believe that you Should Worry about it as", "start": 120.0, "duration": 7.44}, {"text": "for our Air coolers well due to Their Wildly Varying Shapes and Mounting Mechanisms", "start": 128.14, "duration": 6.289}, {"text": "Not many of Them have Been retrofitted with Support for socket TR4 yet. Which is where Noctua's new line-up comes in. They're", "start": 134.77, "duration": 7.789}, {"text": "Visually and for The most Part", "start": 142.78, "duration": 2.0}, {"text": "Functionally Identical to their non TR4 cousins but when you turn them over,", "start": 145.239, "duration": 4.85}, {"text": "you are immediately greeted with plates Big and Shiny enough to host a Fancy Dinner Party", "start": 150.73, "duration": 5.839}, {"text": "This Huge Mount is common on each of them right down to the 92 millimeter NHU-9", "start": 157.3, "duration": 6.409}, {"text": "Because noctua decided to bake in", "start": 163.959, "duration": 2.779}, {"text": "Support for AMD's on socket Mounting Points, a Good idea Because", "start": 167.17, "duration": 5.3}, {"text": "well let's just say that taking this apart isn't a good idea", "start": 173.08, "duration": 4.309}, {"text": "Now to testing. While our old", "start": 178.45, "duration": 2.69}, {"text": "Standard Depth Version of this video discussed performance with different", "start": 181.989, "duration": 4.25}, {"text": "custom fan configurations", "start": 186.93, "duration": 1.6}, {"text": "Inside a case our video today Will focus on the temperature differences between the coolers themselves right out of the box", "start": 188.53, "duration": 7.879}, {"text": "so it should then be noted that you could get", "start": 196.689, "duration": 3.35}, {"text": "slightly better performance out of These AIOs by adding more fans in a Push-Pull configuration", "start": 200.17, "duration": 5.119}, {"text": "and the same can be said of the two tower coolers", "start": 205.78, "duration": 3.649}, {"text": "Another trick up our sleeve this time around is that we're going to be running our threadripper 1950X in both stock and", "start": 210.04, "duration": 6.679}, {"text": "overclocked configurations", "start": 217.239, "duration": 2.0}, {"text": "furthermore, this time we are in a climate controlled 24 degree Celsius", "start": 219.519, "duration": 4.25}, {"text": "Environment, Not my garage during the winter, so our results should be more comparable to what you can achieve at home. But enough talk, let's", "start": 224.049, "duration": 7.58}, {"text": "Do the Results", "start": 232.12, "duration": 1.83}, {"text": "Starting off then with our H80i-GT and Noctua NHU-9, we're seeing some pretty", "start": 233.95, "duration": 5.659}, {"text": "ok numbers for stock performance with similar Load temperatures and Package Power", "start": 240.28, "duration": 5.959}, {"text": "Overclocked on the other hand shows Again similar numbers but", "start": 247.359, "duration": 4.85}, {"text": "Markedly lower Package Power For the H80i-GT, meaning that it's throttling more to maintain that same", "start": 252.879, "duration": 7.789}, {"text": "87 Degrees", "start": 261.039, "duration": 1.38}, {"text": "so in the lightweight Category air cooling comes Away with a clear Victory", "start": 262.419, "duration": 4.309}, {"text": "The Next step Up is the NH-U12S and H100i v2 and again, we see almost identical", "start": 267.37, "duration": 7.609}, {"text": "numbers between these guys at stock speeds", "start": 275.68, "duration": 2.839}, {"text": "Looking now at the", "start": 279.4, "duration": 1.049}, {"text": "Overclocking Results We've Got a Much Narrower Lead for the Noctua fan over the corsair AIO as far as Package Power goes", "start": 280.449, "duration": 7.52}, {"text": "Meaning That They've Throttled Just about Evenly so we're gonna call This one a tie", "start": 288.22, "duration": 5.029}, {"text": "Bringing us to the main event the", "start": 294.28, "duration": 2.329}, {"text": "NH-U14S Weather versus the H115i  Gregor, both of them lasted all 12 rounds", "start": 297.159, "duration": 6.98}, {"text": "Maintaining maximum performance in both the stock and", "start": 304.389, "duration": 3.08}, {"text": "Overclocked tests and this is incredible considering we've got all 16 cores pinned to 3.9 Gigahertz", "start": 307.99, "duration": 6.89}, {"text": "But", "start": 315.43, "duration": 1.36}, {"text": "This Kind of a Match", "start": 316.79, "duration": 1.12}, {"text": "Isn't about pinning and the Noctua ran a few degrees cooler so we have to award it the win by technical knockout", "start": 317.91, "duration": 6.83}, {"text": "Of course, performance is only part of the equation", "start": 325.56, "duration": 3.35}, {"text": "Aesthetics and", "start": 329.94, "duration": 1.41}, {"text": "Physical Compatibility are Key Considerations as well", "start": 331.35, "duration": 3.95}, {"text": "Water Coolers do come with an additional mechanical point of failure-the pump", "start": 335.85, "duration": 4.82}, {"text": "But they look sexy and it's becoming more and more common for small form-factor", "start": 340.98, "duration": 4.76}, {"text": "Cases to Have mounts For 120 or 240mm radiators but not enough clearance for", "start": 345.99, "duration": 6.349}, {"text": "comparable Air Coolers and", "start": 352.56, "duration": 2.0}, {"text": "It's also worth considering that large", "start": 354.93, "duration": 2.3}, {"text": "AIO coolers like the H115i are", "start": 357.23, "duration": 2.579}, {"text": "Generally far easier to work around inside a chassis than a larger Air cooler especially where RAM slots are concerned", "start": 360.3, "duration": 7.729}, {"text": "With that said price is kind of a big deal - and Noctua's solutions", "start": 369.0, "duration": 5.899}, {"text": "Even though they're not the cheapest air coolers out there", "start": 375.36, "duration": 2.539}, {"text": "Generally come out ahead of the Water cooling equivalents by a significant margin here", "start": 378.54, "duration": 5.119}, {"text": "So TL:DR, then if you're not planning on overclocking Threadripper, it's actually a relatively easy beast to tame", "start": 384.36, "duration": 7.79}, {"text": "But overclock it and You'll need to set aside some budget for a beefy cooler", "start": 392.67, "duration": 4.339}, {"text": "Also if your priority is performance You'll reach for an air cooler or", "start": 397.86, "duration": 4.489}, {"text": "custom water cooling. But Water Cooling is a great choice if a more compact easy to work in and", "start": 402.81, "duration": 7.279}, {"text": "Subjectively Better-Looking machine is what you're after", "start": 410.46, "duration": 2.629}, {"text": "So then as always, The answer is", "start": 413.79, "duration": 2.809}, {"text": "It Depends", "start": 419.1, "duration": 2.0}, {"text": "If you haven't already now's the time to try out Dollar Shave Club it's more than just", "start": 421.38, "duration": 4.94}, {"text": "Razors. Dollar Shave Club makes it easy for you to upgrade your shave and your bathroom you don't even have to leave the house to", "start": 427.05, "duration": 7.01}, {"text": "Get high-quality shaving and grooming Products. They deliver them right to your door and", "start": 434.06, "duration": 4.529}, {"text": "for a Limited time Dollar Shave Club Is basically giving away their S**t, Shower, Shave starter Kit", "start": 438.81, "duration": 6.89}, {"text": "to new members for Only 5 bucks. This starter set features their executive razor and three trial size versions of their most popular", "start": 446.25, "duration": 7.489}, {"text": "products to help you stay fresh and clean everywhere. You get their shave Butter, Body wash and one Wipe Charlies", "start": 453.99, "duration": 6.589}, {"text": "Butt Wipes. You will also get the executive razor which includes their premium weighty handle and a full cassette of cartridges", "start": 460.919, "duration": 6.47}, {"text": "Then after the first box, replacement cartridges are just a few bucks a month so head over to", "start": 467.639, "duration": 4.97}, {"text": "dollarshaveclub.com/linus to check it out.", "start": 472.98, "duration": 2.899}, {"text": "So thanks for Watching Guys if you dislike this video you can hit that button, but if you liked it hit the like button get", "start": 476.73, "duration": 5.299}, {"text": "subscribed, Maybe consider checking out where to buy the stuff we featured at the link in the video description", "start": 482.07, "duration": 4.309}, {"text": "Also down there is a link to our community forum which you should totally join and our merch store Which has cool shirts like this one", "start": 487.229, "duration": 5.75}]