[{"text": "[Erik] Hello, everyone. You're watching Internet Comment Etiquette.", "start": 0.02, "duration": 2.26}, {"text": "I'm Erik your host, and today we're going to talk about how to leave proper and respectful comments", "start": 2.34, "duration": 3.7}, {"text": "on advertisements. That's right. Now there's a lot of advertisements out there;", "start": 6.04, "duration": 4.08}, {"text": "you got your good advertisements, you got your bad advertisements,", "start": 10.12, "duration": 2.96}, {"text": "sometimes you get an annoying advertisement like this one:", "start": 13.08, "duration": 2.86}, {"text": "[Announcer] Head On: apply directly to the forehead. (3x)", "start": 15.94, "duration": 6.44}, {"text": "And then there are advertisements that blur the line between commercial and art,", "start": 22.44, "duration": 3.8}, {"text": "where it leaves you wondering \"Is what I saw really just a commercial, or is it something more", "start": 26.24, "duration": 5.14}, {"text": "beautiful that tells me something about life itself?\" like this:", "start": 31.38, "duration": 3.66}, {"text": "[Man] Boss Lady, this man needs help! His baby mama put him out and he ain't got no furniture!", "start": 35.04, "duration": 4.4}, {"text": "[Boss Lady] Let him have it!", "start": 39.44, "duration": 1.2}, {"text": "[Man] Boss Lady, Boss Lady, this man need a bed and all he can afford is $69 a month!", "start": 40.64, "duration": 3.82}, {"text": "How he gon' get another one without a bed?", "start": 44.46, "duration": 1.94}, {"text": "[Boss Lady] Come on baby.", "start": 46.4, "duration": 0.8}, {"text": "[Erik] Genius!", "start": 47.2, "duration": 1.2}, {"text": "[Man] This man need a TV for his bedroom! All he can afford is $59 a month!", "start": 48.4, "duration": 3.5}, {"text": "[Boss Lady] 73 inches, baby!", "start": 51.9, "duration": 1.68}, {"text": "[Erik] I must respond!", "start": 53.58, "duration": 1.36}, {"text": "You guys ever wonder how to tweet to Ted Cruz through a YouTube comment? Check this out:", "start": 54.94, "duration": 4.06}, {"text": "@TedCruz Finger in my ass update #12:  Can now fit whole hand, thanks for the advice hot dick! And tweet!", "start": 59.0, "duration": 5.54}, {"text": "Alright now you might notice that this is a Youtube comment,", "start": 64.54, "duration": 2.24}, {"text": "but then if we go to my twitter, that's right - it's also a tweet to Ted Cruz", "start": 66.78, "duration": 3.44}, {"text": "I bet you're wondering: Erik, how'd you do that?", "start": 70.22, "duration": 1.9}, {"text": "Well, It's all in my one hour instructional program available on YouTube:", "start": 72.12, "duration": 3.64}, {"text": "\"How to tweet to Ted Cruz from anywhere and anything by Salvia\"", "start": 75.78, "duration": 3.339}, {"text": "This was a sponsored ad. Did I do it right..did I do the...did I..", "start": 79.12, "duration": 4.32}, {"text": "I also have a gambling website.", "start": 83.44, "duration": 2.0}, {"text": "Okay, well personally I'm a big fan of advertisements.", "start": 92.62, "duration": 2.66}, {"text": "I think they're fantastic studies in psychology of the human mind. They tend to encapsulate these zeitgeists", "start": 95.28, "duration": 5.669}, {"text": "of you know, past moments in our pop culture. For instance in 1950, a Camel cigarette ad challenged you to smoke their cigarettes", "start": 100.949, "duration": 5.811}, {"text": "for a whole month. PROVE IT! And also this ad for Folgers coffee:", "start": 106.78, "duration": 5.06}, {"text": "[Brother] Must have the wrong house", "start": 115.06, "duration": 2.16}, {"text": "[Sister] Sister!", "start": 117.22, "duration": 1.06}, {"text": "[Erik] See this ad is from 2009 when it was still socially acceptable to want to fuck your brother.", "start": 119.1, "duration": 4.06}, {"text": "[Brother] Heh, what are you doing?", "start": 126.46, "duration": 1.52}, {"text": "[Sister] You're my present this year.", "start": 128.16, "duration": 1.64}, {"text": "[Jingle] The best part of waking up...", "start": 131.74, "duration": 2.86}, {"text": "[Erik] Yeah. Alright well let's check out a few of the comments below.", "start": 134.64, "duration": 3.06}, {"text": "\"Those were NOT brother eyes those were BEDROOM eyes!\"", "start": 137.7, "duration": 3.04}, {"text": "\"L O LLLLL\"", "start": 140.74, "duration": 2.44}, {"text": "\"google \"rule 34 folgers\" you wont be disappointed\"", "start": 143.18, "duration": 3.22}, {"text": "\"A water-head baby is in their future-\"", "start": 146.4, "duration": 1.6}, {"text": "Woah woah holy shit, that is a truly terrible thing to say! What this video really needs right now,", "start": 148.0, "duration": 5.12}, {"text": "is a good example of comment etiquette up at the top,", "start": 153.12, "duration": 2.6}, {"text": "So why don't we oblige?", "start": 155.72, "duration": 1.44}, {"text": "[Erik accompanied by piano music] His eyes moved to the red ribbon she had planted on his right pectoral muscle.", "start": 157.16, "duration": 3.52}, {"text": "He saw something in her eyes when she touched him.", "start": 160.74, "duration": 2.08}, {"text": "A recognition of firmness. After all, he was toned to perfection from weeks of rebuilding a church in Rokoray,", "start": 162.96, "duration": 5.58}, {"text": "along the northern banks of the Great Scarcies River. He had met a woman there who reminded him of his sister.", "start": 168.58, "duration": 4.86}, {"text": "He cared for her, taught her a fledgling example of English,", "start": 173.46, "duration": 2.86}, {"text": "had even found himself feeling love for her. That was not a sisterly love however.", "start": 176.32, "duration": 4.32}, {"text": "Then again… was this?", "start": 180.64, "duration": 1.78}, {"text": "He began to open his mouth. Any moment his parents would walk downstairs.", "start": 182.42, "duration": 3.62}, {"text": "The look on her face said they were on the same channel. Everything he had just thought, she heard it.", "start": 186.16, "duration": 4.759}, {"text": "He spoke. “Listen, when mom and dad go out to say hi to the Gelsons next door tonight,", "start": 190.92, "duration": 4.259}, {"text": "let’s hang back, go upstairs and fuck the shit out of each other.” “What?” She answered, bewildered.", "start": 195.18, "duration": 4.76}, {"text": "“C’mon let's do it. Let’s fuck. Haven’t we always wanted this?” He reached out to reassure her, but she pulled away, fear in her eyes.", "start": 199.94, "duration": 5.7}, {"text": "“Whoa whoa. Uh no I’m just happy you’re home from Africa. What the hell are you talking about wanting to fuck me? Are you seriou--”", "start": 205.64, "duration": 5.62}, {"text": "And like a blade being hammered on the anvil, his father’s voice rang out from behind him: “WHAT IN SAM HILL IS GOING ON HERE?”", "start": 211.26, "duration": 6.94}, {"text": "“I can explain…” he stammered,", "start": 218.2, "duration": 1.7}, {"text": "but was cut off by the visceral scream from his mother as she began sobbing into her bathrobe.", "start": 219.9, "duration": 5.16}, {"text": "His father erupted, white morning spittle shooting from the corners of his mouth.", "start": 225.06, "duration": 3.88}, {"text": "“NO SON OF MINE IS GONNA DRINK FUCKING FOLGERS COFFEE!”", "start": 228.94, "duration": 3.66}, {"text": "He belted his son in the face, knocking the boy unconscious. “THIS IS A PEETS COFFEE HOUSE!”", "start": 232.6, "duration": 5.4}, {"text": "Drink Peets Coffee.﻿", "start": 238.02, "duration": 1.3}, {"text": "AND SHIT! All right well those are some of the ads that took place years and years ago, but what do ads look like now?", "start": 239.32, "duration": 6.02}, {"text": "Oh, well it's all very exciting. You see, ads right now come in the form of YouTube pre-roll ads, some of which you can skip", "start": 245.34, "duration": 6.12}, {"text": "after a few seconds. Not mine, though; mine are all unskipable unless use adblock, in which case, here's an ad that you can't skip.", "start": 251.46, "duration": 6.62}, {"text": "[Japanese Bird-Human Hybrids Singing]", "start": 258.08, "duration": 2.16}, {"text": "[Erik] Yeah, stop trying to click that button. That's not gonna work, you're just pausing the video dummy.", "start": 260.24, "duration": 3.82}, {"text": "Oh wait, whoa wait a second, what's that? How did it become clickable?", "start": 264.06, "duration": 3.58}, {"text": "Okay, don't click that. You're gonna miss out on some important stuff on my end...", "start": 268.38, "duration": 4.36}, {"text": "All right cool well thanks for not clicking that.", "start": 281.6, "duration": 2.14}, {"text": "Anyway let's take a look at the difference between that YouTube ad that we just watched and the Folgers coffee ad that was on actual television.", "start": 283.74, "duration": 6.3}, {"text": "YouTube ads can actually keep it whatever length they want.", "start": 290.04, "duration": 2.94}, {"text": "You can have 2-minute YouTube ad \nor you could have a 15-second YouTube ad. TV commercials - a little bit different.", "start": 292.98, "duration": 5.399}, {"text": "And you have to spend a lot of money to make TV commercials;", "start": 298.38, "duration": 2.549}, {"text": "they're so expensive to make and they have to be this high production quality. If you're just a regular Youtube guy and you got a", "start": 300.929, "duration": 6.671}, {"text": "camera and you got a fuckin' garage full of rented Ferraris, you can make an ad of that too.", "start": 307.6, "duration": 4.84}, {"text": "I don't know why you'd want to, because I don't think anyone's stupid enough to fall for that shit. Look at this guy:", "start": 312.44, "duration": 5.8}, {"text": "[Garage Guy] I'm a lot more proud of these seven new bookshelves that I had to get installed to hold 2,000 new books that I bought...", "start": 318.68, "duration": 6.44}, {"text": "[Erik] Who the fuck trust you? So that's one of the differences. Some YouTube ads even go viral like this one:", "start": 325.16, "duration": 4.62}, {"text": "[Chuck Testa] You probably thought this deer was alive, and this coyote was alive, and this pheasant was alive.", "start": 330.54, "duration": 6.28}, {"text": "Nope. They're not. They're dead. They've been taxidermised by Chuck Testa. Ojai Valley Taxidermy.", "start": 337.62, "duration": 6.56}, {"text": "[Erik] Well this must be an effective advertisement because it's got 16 million views. That's 16 million people", "start": 344.18, "duration": 5.98}, {"text": "who went out of their way just to watch a commercial.", "start": 350.16, "duration": 2.92}, {"text": "[Man] Look at that antelope driving a car!", "start": 353.08, "duration": 2.22}, {"text": "[Chuck Testa] Nope, it's just Chuck Testa.", "start": 357.86, "duration": 2.1}, {"text": "[Erik] I hope that guy's business is doing great. I'm gonna leave him a little comment to congratulate.", "start": 359.96, "duration": 4.14}, {"text": "I've been in the ad business since the 70's and I just don't get it anymore.", "start": 364.14, "duration": 3.76}, {"text": "I've worked millions of hours, attended thousands of meetings", "start": 367.9, "duration": 2.82}, {"text": "and handled hundreds of clients and in all that time, I never", "start": 370.74, "duration": 2.79}, {"text": "thought that getting two youtube jerkoffs to spend 50 bucks on a commercial would get the bigger audience.", "start": 373.6, "duration": 4.8}, {"text": "Thankfully I've been hired by this place called \"Correct the Record\" to go online and tell you kids to vote for that gash Hillary.", "start": 378.58, "duration": 5.68}, {"text": "Shit did I type that out loud? Oh no Jimmy", "start": 384.9, "duration": 2.96}, {"text": "you did it again, there goes that job. Knew I shouldn't have gotten this voice to text software. [Burps]", "start": 387.86, "duration": 6.24}, {"text": "Post! Hey, it's not just Youtube ads that go viral.", "start": 394.1, "duration": 2.76}, {"text": "Sometimes TV commercials go viral too, but on Youtube. So technically that's a Youtube ad. Well, all right, let's check it out.", "start": 396.86, "duration": 6.88}, {"text": "[Matthew McConaughey] That's a big bull.", "start": 409.98, "duration": 1.98}, {"text": "[Erik] Yeah, yeah.", "start": 413.7, "duration": 2.8}, {"text": "[McConaughey] I think that's Old Cyrus.", "start": 418.26, "duration": 1.92}, {"text": "[Erik] Yuup.", "start": 420.18, "duration": 0.86}, {"text": "[McConaughey] 1,800 pounds of \"do whatever the heck I want.\"", "start": 423.52, "duration": 3.3}, {"text": "[Erik] Yeeeaap", "start": 426.82, "duration": 1.42}, {"text": "[Erik, Shouting] Yeeaaahh", "start": 430.56, "duration": 1.3}, {"text": "[McConaughey] I can respect that.", "start": 432.14, "duration": 1.12}, {"text": "[Erik, Shouting] YYEEAAAH", "start": 433.26, "duration": 1.72}, {"text": "[Erik, Speaking] this dude's head looks like it was made with the line tool in ms paint", "start": 435.72, "duration": 2.7}, {"text": "And post! What, not every comment's got to be a fucking novel. I know what you're thinking:", "start": 438.52, "duration": 3.74}, {"text": "Erik, you've covered all of these commercials, but you still haven't covered any sexy commercials. Well don't worry. I got you covered, check this out.", "start": 442.26, "duration": 6.52}, {"text": "[Ashley Blue] Hi, I'm Ashley Blue and this is my cyber skin spread wide pussy and ass", "start": 449.38, "duration": 5.8}, {"text": "[Erik] Oh yeeah. Totally dude.", "start": 455.18, "duration": 2.82}, {"text": "[Ashley Blue] You can hold me on top of you or you can pound me on the tabletop.", "start": 458.0, "duration": 3.52}, {"text": "[Erik] Yeah dude! [Ashley Blue] At nine pounds, I feel amazing... [Erik] Let's check out some comments, brah.", "start": 461.52, "duration": 4.38}, {"text": "\"yes i love it\" \"call me ok (blurred out phone number)\" \"anyone wanna suck my dick\"", "start": 465.96, "duration": 5.7}, {"text": "[Ashley Blue] They molded me with my hands on my ass...", "start": 471.66, "duration": 2.0}, {"text": "Look at the way You can see the flesh between my fingers as I spread my ass cheeks for you.", "start": 474.02, "duration": 4.92}, {"text": "[Erik] And here we find the lowest form of advertising possible, which is advertising within the comments section of another advertisement.", "start": 478.94, "duration": 7.66}, {"text": "And of course, it's preying on people whose dicks don't work.", "start": 486.6, "duration": 2.76}, {"text": "[Ashley Blue] Slide your cock through my tight pussy and feel the ribbed love tunnel rip your cock.", "start": 489.36, "duration": 5.28}, {"text": "\" never mind the toy what's her name\" \"It's on the fucking box\"", "start": 494.64, "duration": 4.18}, {"text": "\"im also want to sex toe. how to take. u have any idea\"", "start": 499.06, "duration": 3.74}, {"text": "[screaming] \"how much its cost\" \"where the bleach\"", "start": 502.8, "duration": 2.68}, {"text": "We are Provide Indian Escorts in Dubai, Pakistani Escorts in Dubai, Escorts in Dubai, Dubai Escorts...", "start": 505.48, "duration": 5.72}, {"text": "Call Girls in Dubai and Much More Escorts in Dubai Call US phone number", "start": 511.2, "duration": 3.92}, {"text": "Alright well those comments eat more cock than Donald Trump going to visit the Kremlin, so let's see if we can spruce this whole thing up", "start": 515.12, "duration": 5.32}, {"text": "on behalf of the society of etiquette.", "start": 520.44, "duration": 2.18}, {"text": "Caught my son fucking one of these things, and man I gotta say the molding on those fingers spreading the asshole apart are", "start": 522.7, "duration": 4.9}, {"text": "top notch. I honestly thought my son had chopped a woman to pieces", "start": 527.72, "duration": 3.1}, {"text": "and was fucking her dismembered, blood-drained, pelvic region. You can imagine my surprise when I realized it was just high quality hand poured thermoplastic rubber.", "start": 533.06, "duration": 4.78}, {"text": "I'll bet if you goddamn nerds put half the time in to curing cancer as you did figuring out ways to fuck fake pussies,", "start": 537.84, "duration": 5.32}, {"text": "I'd have twenty more years to live right now.", "start": 543.16, "duration": 1.68}, {"text": "See the shadow masters hit me with their tumor satellite because I found out tower 7 was", "start": 544.84, "duration": 4.1}, {"text": "hosting an illuminati meeting the day of 9/11 and George Bush was actually trying to save the world by hitting that shit with his plane holograms.", "start": 548.94, "duration": 6.24}, {"text": "And post! Alright, well hopefully I've helped you all understand how to leave proper and respectful comments on advertisements now.", "start": 555.18, "duration": 6.66}, {"text": "We're going to come to a final commercial break.", "start": 562.1, "duration": 2.089}, {"text": "I'm going to hit play on this and then we're going to we're going to finish off the lesson. Play!", "start": 564.189, "duration": 3.57}, {"text": "Again if you have ad block enabled you're not seeing an ad right now,", "start": 568.759, "duration": 3.14}, {"text": "which is why I'm going to play this ad from GM, one of our sponsors.", "start": 571.97, "duration": 3.59}, {"text": "This is a fine advertisement. You see, got a robot losing its job. It's a really human story,", "start": 576.47, "duration": 5.659}, {"text": "falls into a deep depression here, and then throws itself off a bridge.", "start": 585.38, "duration": 5.059}, {"text": "Jesus Christ. Oh, it turns out it was all just a robot dream. Hey Robot, clear something up for me real quick.", "start": 591.86, "duration": 5.869}, {"text": "[Robot] Yes, Dad. [Erik] Can robots dream? [Robot] Oh, no. We are always awake.", "start": 598.46, "duration": 5.089}, {"text": "[Erik] Okay, so they can't even sleep. All right.", "start": 603.68, "duration": 2.119}, {"text": "Uh, oh wait a minute, does that mean you weren't asleep when I did that thing the other night?", "start": 605.95, "duration": 3.989}, {"text": "[Robot] Yes, I was awake. [Erik] But you were snoring. I heard you snoring. [Robot] Those...weren't...snores.", "start": 610.46, "duration": 6.4}, {"text": "[Erik and Robot laugh]", "start": 616.86, "duration": 4.82}, {"text": "[Robot] Hey, what happened to your top dresser drawer?", "start": 621.68, "duration": 1.98}, {"text": "[Erik] Here it is. [Robot] Oh, shit! ow, ohh, ohh...", "start": 623.66, "duration": 3.62}, {"text": "[Robot snoring]", "start": 628.02, "duration": 1.78}, {"text": "[Erik] All right, last commercial is this:", "start": 629.8, "duration": 2.7}, {"text": "[Julian] Okay phones down.", "start": 633.68, "duration": 1.5}, {"text": "[Woman] You run a tight ship here, Julian.", "start": 635.18, "duration": 1.64}, {"text": "GIVE ME TENDER MEAT JULIAN. COOK ME A NEWBORN, YOU GRINNING MORON", "start": 636.82, "duration": 5.92}, {"text": "[Julian] People, tonight your taste buds go where no taste buds have gone before.", "start": 642.74, "duration": 4.3}, {"text": "\"I fucking love Columbus day.\"", "start": 647.04, "duration": 2.38}, {"text": "[Julian] Voila! Veal tacos and fajitas!", "start": 649.42, "duration": 2.6}, {"text": "YES I DEMAND THE MEAT OF INFANT ANIMALS, NOTHING ELSE WILL DO FOR I AM RETARDED.", "start": 652.3, "duration": 5.66}, {"text": "[Announcer] Discover veal this Columbus day. Visit vealmadeeasy.com for recipes and enter to win $500 of groceries [deal]", "start": 657.96, "duration": 7.02}, {"text": "[Person] Veal, who knew?", "start": 664.98, "duration": 1.84}, {"text": "[Erik] Alright that's a whole lot of people pissed off about veal but nobody really talking about the commercial.", "start": 666.82, "duration": 4.11}, {"text": "So let me just do that then.", "start": 670.93, "duration": 2.01}, {"text": "I EAT BUTTHOLES AND BOOTY CHIPS BLING BLANG BLONG BOUNCED ON MY BABY COW'S DICK TO THIS SHIT ALL DAY L O L", "start": 673.22, "duration": 5.36}, {"text": "NO MANS SKY SUCKS FUCK YOU I’M A GIRL AND I WISH THEY MADE TOILETS THAT BABIES FIT DOWN TRUMP 2016﻿", "start": 678.58, "duration": 4.88}, {"text": "And post! All right this space is for sale. This ad...this space for sale right here.", "start": 683.46, "duration": 5.66}, {"text": "If you want to pay 800 bucks, I'll talk about your product here.", "start": 689.12, "duration": 3.66}, {"text": "[Burp]", "start": 693.3, "duration": 0.54}, {"text": "Ugh, uugghh...", "start": 694.4, "duration": 2.42}, {"text": "[Outro Song] Big Money Salvia, Salvia. Big Money Salvia!", "start": 696.82, "duration": 4.24}, {"text": "[YouNow Streamer] \"i wish they made toilets that babies fit down\"", "start": 701.06, "duration": 4.54}, {"text": "[Streamer] Why? \"I dunno planned parenthood paid me to say that.\" Hahaha", "start": 707.1, "duration": 5.38}, {"text": "[Outro Song] Big Money Salvia. Uh Big Money (x6)", "start": 712.72, "duration": 4.1}]