[{"text": "Hey Geograpeeps!", "start": 0.0, "duration": 0.64}, {"text": "So, this is a little video that I kind of wanted to make for a while, but never really had time.", "start": 0.64, "duration": 3.46}, {"text": "Until now!", "start": 4.1, "duration": 1.28}, {"text": "So, of course the majority of Geography Now! subscribers are from, you know, my home country; The U.S.", "start": 5.38, "duration": 4.76}, {"text": "However, we do have a very, very noticeable and sizeable community of subscribers outside of the U.S.", "start": 10.16, "duration": 4.84}, {"text": "And some of you have expressed, you know, a little curiosity as to how each of the fifty states, you know, kind of function or what they're like.", "start": 15.0, "duration": 6.34}, {"text": "Each state does kind of have their own unique and individual qualities and I'm gonna try my best to explain each and every single one of them to you right now!", "start": 21.34, "duration": 6.4}, {"text": "Alabama: Where both white people and black people are poor, but they party equally hard.", "start": 27.74, "duration": 4.52}, {"text": "Roll Tide!", "start": 32.26, "duration": 1.06}, {"text": "Now, but seriously, Alabama is kind of like where the Confederacy started.", "start": 33.32, "duration": 3.32}, {"text": "So, ah, eh, Civil War.", "start": 36.64, "duration": 1.72}, {"text": "Alaska; America's refrigerator.", "start": 38.36, "duration": 2.0}, {"text": "Seriously, this is like where we stock pile of all of our resources that won't be tap into until things get really messed up.", "start": 40.36, "duration": 5.22}, {"text": "It's the largest and coldest state, you can find polar bears and the native Yupik people.", "start": 45.58, "duration": 3.82}, {"text": "Arizona: The Grand Canyon State", "start": 49.4, "duration": 2.52}, {"text": "This is kind of like \"The King Desert State\" of the US.", "start": 51.92, "duration": 2.98}, {"text": "Arizona is also home to the largest Indian Reservation:", "start": 54.9, "duration": 2.32}, {"text": "Navajo Nation", "start": 57.4, "duration": 1.16}, {"text": "Arkansas: Basically just read the book Where the Red Fern Grows.", "start": 58.56, "duration": 2.48}, {"text": "It basically just gives you the gist of what Arkansas is like.", "start": 61.04, "duration": 2.46}, {"text": "And the people here love dogs. They have like the highest dog ownership out of any state in the country.", "start": 63.5, "duration": 4.06}, {"text": "California: My home state. Ah! So let me put it like this. If California somehow for some reason seceded from the US,", "start": 67.58, "duration": 6.02}, {"text": "it would still be like the world's seventh most powerful economic super power.", "start": 73.6, "duration": 4.0}, {"text": "So obviously, California holds a high position of geopolitical influence in our country.", "start": 77.6, "duration": 3.62}, {"text": "Nonetheless, California is still heavily dependent on the US government.", "start": 81.22, "duration": 2.98}, {"text": "We're the home of the entertainment capital of the world.", "start": 84.2, "duration": 2.2}, {"text": "Three of the largest tech companies in the world are in Silicon Valley.", "start": 86.4, "duration": 2.94}, {"text": "Crazy diversity and everything you need packed into one place: California.", "start": 89.34, "duration": 3.6}, {"text": "Colorado: Our healthiest state which has the lowest levels of obesity.", "start": 92.94, "duration": 3.7}, {"text": "This is probably because people go outdoors and get you know fresh air and enjoy those mountains.", "start": 96.64, "duration": 3.88}, {"text": "Just be careful when someone offers you a chocolate truffle or a brownie; they are really enjoying those new cannabis laws.", "start": 100.52, "duration": 5.64}, {"text": "Connecticut is like the gentler, cleaner suburbs that people move to when they are sick and tired of New York.", "start": 106.16, "duration": 5.06}, {"text": "Delaware: The first state to become a state and that's like literally all they got going for them.", "start": 111.32, "duration": 5.16}, {"text": "I think they have like a cardboard box factory.", "start": 116.48, "duration": 2.78}, {"text": "Florida: America's swampy playground.", "start": 119.26, "duration": 2.42}, {"text": "Seriously, none of the houses here have basements because if you just dig down a little bit, you'll hit water", "start": 121.68, "duration": 4.32}, {"text": "Orlando was originally built because not enough Americans could travel all the way to California to visit Disney Land so they built Disney World, they made it bigger,", "start": 126.0, "duration": 7.22}, {"text": "and then like 8,745 of other theme parks opened up.", "start": 133.22, "duration": 2.84}, {"text": "Georgia: The peach state.", "start": 136.06, "duration": 1.7}, {"text": "Home to Coca-Cola and the busiest airport in the US, boiled potatoes, and little miss beauty pageants.", "start": 137.76, "duration": 4.98}, {"text": "Yeah, some places do that in America.", "start": 142.86, "duration": 1.6}, {"text": "Hawaii: The last state to become a state.", "start": 144.52, "duration": 2.46}, {"text": "Before we made Hawaii into a state, it was actually its own country.", "start": 146.98, "duration": 2.82}, {"text": "Like, it was a Polynesian country.", "start": 149.8, "duration": 1.88}, {"text": "They had there own monarchy and everything.  Liliuokalani was the last queen.", "start": 151.68, "duration": 3.36}, {"text": "It's pretty cool. Otherwise, you know the rest: hula, surfing, pineapples, luaus, yada yada yada.", "start": 155.04, "duration": 4.04}, {"text": "Idaho: The only fact that most Americans know about Idaho is that they grow the most potatoes out of any other state.", "start": 159.08, "duration": 5.54}, {"text": "I mean apparently they have some cool secluded spots like hot springs and gorges.", "start": 164.62, "duration": 3.78}, {"text": "Otherwise, I feel like the people in Idaho are probably hiding a lot of dark secrets that we don't know about.", "start": 168.4, "duration": 3.88}, {"text": "Illinois: Ah! The land of Lincoln.", "start": 172.28, "duration": 2.56}, {"text": "Even though Lincoln was born in Kentucky.", "start": 174.84, "duration": 1.54}, {"text": "Now, I actually grew up a large portion of my childhood in this state and a lot of people know this place by another: Chicago.", "start": 176.38, "duration": 5.44}, {"text": "Seriously, like half of the time people don't know what state Chicago is in.", "start": 181.82, "duration": 2.86}, {"text": "Historically, it was known as the slaughter-house of America, partially because all the cows from Texas were brought up here to be slaughtered and also because", "start": 184.68, "duration": 6.34}, {"text": "and there was kind of a little bit of a mafia past.", "start": 191.08, "duration": 2.44}, {"text": "Indiana is like Illinois' annoying little brother who took the town of Gary away from Chicago and then they get to claim that they have the birthplace of Michael Jackson.", "start": 193.52, "duration": 7.28}, {"text": "No but seriously, like the only interesting thing from here is like the Indy 500 car race.", "start": 200.8, "duration": 3.8}, {"text": "Otherwise, John Green is from here.", "start": 204.6, "duration": 1.54}, {"text": "Iowa: Iowa is like the state that was so flat and so dull that they had to find creative ways to entertain themselves.", "start": 206.14, "duration": 6.0}, {"text": "Oh, and they are known for being good at wrestling.", "start": 212.14, "duration": 1.74}, {"text": "Kansas is the heart of the Midwest.", "start": 213.88, "duration": 2.14}, {"text": "Famous for Dorothy from 'Wizard of Oz' and this is literally the flattest state in our entire country.", "start": 216.02, "duration": 4.92}, {"text": "Ah, Kentucky: You with your baseball bats, and bourbon, and KFC, and horse-derbies.", "start": 220.94, "duration": 5.42}, {"text": "It's also home to Fort Knox where we hide all our gold.", "start": 226.36, "duration": 2.26}, {"text": "Louisiana: Now ya comin' down here y'all gonna see that you gonna get the real (contour khazhan).", "start": 228.62, "duration": 5.54}, {"text": "(French? )", "start": 234.16, "duration": 1.18}, {"text": "Louisiana is one of the only few states left in the US that has concentrated Francophone communities that speak French, kind of.", "start": 235.34, "duration": 5.92}, {"text": "Known for the bayou and a diet high in crawfish and crabs, reptiles, and other swamp creatures.", "start": 241.26, "duration": 4.48}, {"text": "This place is unlike anywhere else in the US.", "start": 245.74, "duration": 1.82}, {"text": "Maine: the lobster state.", "start": 247.56, "duration": 1.8}, {"text": "This is like where all the tough Atlantic sailors come and live and have houses on foggy cliffs with lighthouses.", "start": 249.36, "duration": 5.9}, {"text": "Maryland: Maryland is like home to the richest and most well educated black people in our country.", "start": 255.26, "duration": 4.34}, {"text": "It's also home to Olympic gold medalist Michael Phelps.", "start": 259.6, "duration": 2.68}, {"text": "They also love crab: crab cake, baked crab, boiled crab.", "start": 262.28, "duration": 2.86}, {"text": "You cook it. They eat it.", "start": 265.14, "duration": 0.96}, {"text": "Massachusetts is like the library of America and it has our best university, indisputably in the world, Harvard.", "start": 266.1, "duration": 5.72}, {"text": "However, there's like three different types of people from Massachusetts.", "start": 271.84, "duration": 2.6}, {"text": "There's the Uppity, the Gridy, and intellectual gridy.", "start": 274.44, "duration": 3.28}, {"text": "They all believe they are better than the other two.", "start": 277.72, "duration": 2.16}, {"text": "Michigan: I am so sorry.", "start": 279.88, "duration": 2.76}, {"text": "You were doing so well in the early twentieth century. You were like one of the richest states but then you kind of filed the largest municipal bankruptcy case in US history.", "start": 282.64, "duration": 7.14}, {"text": "Minnesota: I was actually born there.", "start": 289.78, "duration": 2.34}, {"text": "Minnesota is kind of like the Finland of America.", "start": 292.12, "duration": 2.58}, {"text": "Plus, there's also like an actual lot of Finnish people and other Nordic people that live there as well.", "start": 294.7, "duration": 4.72}, {"text": "The land of ten thousand lakes.", "start": 299.42, "duration": 1.92}, {"text": "And if I must say, they have some of the most attractive people in our country.", "start": 301.34, "duration": 3.36}, {"text": "It's just that they have kind of funny accents.", "start": 304.7, "duration": 1.94}, {"text": "\"Hey kids, let's go grab our bags and read the magazines.\"", "start": 306.64, "duration": 4.02}, {"text": "Yeah, I grew up with that accent.", "start": 310.66, "duration": 1.3}, {"text": "Mississipi, this is like, probably, this is like America's, truest, deepest, Southern, Southern", "start": 311.96, "duration": 5.3}, {"text": "\"Y'all put some butter on my grits\" state.", "start": 317.26, "duration": 2.44}, {"text": "Speaking of butter, yes, they are the fattest state.", "start": 319.7, "duration": 3.32}, {"text": "Just, they are.", "start": 323.02, "duration": 1.18}, {"text": "They love their churches, pecans", "start": 324.2, "duration": 1.786}, {"text": "or  \"pecans\" (accent)", "start": 325.986, "duration": 1.094}, {"text": "A ton of famous people like Oprah, Elvis were born here.", "start": 327.08, "duration": 2.74}, {"text": "Missouri, America's gateway to the Midwest", "start": 329.82, "duration": 2.7}, {"text": "Missouri is kinda like Kentucky's fraternal twin that also got mixed up in the CIvil War and was kinda acting like a buffer zone", "start": 332.52, "duration": 5.24}, {"text": "Today they are known for their Kansas City barbecue", "start": 337.76, "duration": 2.44}, {"text": "Yeah, the largest part of the Kansas City is actually in Missouri, not in Kansas,", "start": 340.2, "duration": 2.86}, {"text": "Las Vegas for old people", "start": 343.06, "duration": 1.24}, {"text": "and people who collect those tacky figurines and put them in their china cabinets.", "start": 344.3, "duration": 3.8}, {"text": "Sorry Missouri, just that is the image that conjures my head when I think of you.", "start": 348.1, "duration": 2.78}, {"text": "Montana: America's big, empty, mountanous, may as well just make whole the thing an Indian Reservation State", "start": 350.88, "duration": 5.48}, {"text": "I mean, seriously, you got the Blackfoot, the Flathead, the Crow, the Cheyenne", "start": 356.36, "duration": 4.06}, {"text": "Nebraska: corn and steak.", "start": 360.42, "duration": 2.3}, {"text": "That's literally like their only attraction.", "start": 362.72, "duration": 2.06}, {"text": "Warren Buffett, the second richest man in America lives here.", "start": 364.78, "duration": 2.48}, {"text": "Nevada is like, California's drunk girlfriend.", "start": 367.26, "duration": 2.8}, {"text": "Las Vegas alone is like 80% of what keeps the state alive.", "start": 370.06, "duration": 3.5}, {"text": "Oh and we bury all of our nuclear waste somewhere in there too. Rock on Nevada!", "start": 373.56, "duration": 3.78}, {"text": "New Hampshire is kind of like a small autumn wonderland with beautiful foliage and wooden covered bridges", "start": 377.34, "duration": 5.58}, {"text": "Home to Darthmouth, the smallest Ivy League University", "start": 382.92, "duration": 2.34}, {"text": "New Jersey, pretty rich and very angry.", "start": 385.26, "duration": 2.2}, {"text": "They don't even try to brush off the stereotype. They just own it.", "start": 387.46, "duration": 3.16}, {"text": "They either go crazy on the dance floor or crazy on each other.", "start": 390.62, "duration": 2.72}, {"text": "New Mexico is like Arizona's little brother that had to live in his shadow his whole life", "start": 393.34, "duration": 4.46}, {"text": "But then breaking bad happened and now he came out with like six-pack abs and a sleek new look", "start": 397.8, "duration": 4.54}, {"text": "And the Roswell is supposedly where aliens landed.", "start": 402.34, "duration": 2.38}, {"text": "New York is kind of like where so much of American history got its roots", "start": 404.72, "duration": 3.26}, {"text": "Most Caucasian-Americans that have ties to immigrants from the 1800s can trace their ancestors back to Ellis island where most European came in", "start": 407.98, "duration": 6.86}, {"text": "Home to our largest city by population New York.", "start": 414.84, "duration": 2.72}, {"text": "Proud people with big attitudes and they never sleep.", "start": 417.56, "duration": 2.86}, {"text": "Seriously like this whole place never stops moving.", "start": 420.46, "duration": 3.34}, {"text": "North Carolina, the first inflight state in which the Wright brothers flew the first powered aircraft in 1903.", "start": 423.8, "duration": 6.06}, {"text": "Other wise, Coca-Cola's arch nemesis Pepsi was born here.", "start": 429.86, "duration": 3.2}, {"text": "North Dakota, congratulations, now everybody is paying to that whole Standing Rock reservation. Dakota access pipeline controversy drama thing.", "start": 434.46, "duration": 7.0}, {"text": "In addition to a high concentration of Native Americans,", "start": 441.46, "duration": 2.0}, {"text": "there's also a lot of Norwegians that live here,", "start": 443.46, "duration": 2.0}, {"text": "many of which, still speak Norwegian at home.", "start": 445.46, "duration": 2.0}, {"text": "Ohio is like the most plain Jane", "start": 447.46, "duration": 2.0}, {"text": "typical American experience state", "start": 449.46, "duration": 2.0}, {"text": "with corn dogs and fireflies in the summer,", "start": 451.46, "duration": 2.0}, {"text": "with fireworks and carnivals.", "start": 453.46, "duration": 2.0}, {"text": "They also have the largest Amish population out of any other state.", "start": 455.46, "duration": 3.34}, {"text": "Then election time comes up and everything becomes a bloodbath.", "start": 458.8, "duration": 3.1}, {"text": "Oklahoma, America's tornado state.", "start": 461.9, "duration": 2.0}, {"text": "Yeah, pretty much all of the Midwest gets tornadoes.", "start": 463.9, "duration": 2.0}, {"text": "However, Oklahoma, you get hit hard.", "start": 465.9, "duration": 3.26}, {"text": "Oregon: It started out as like the frontier logging and lumber state,", "start": 469.16, "duration": 4.3}, {"text": "with burly men with axes and chainsaws.", "start": 473.46, "duration": 2.0}, {"text": "But then, one day the hippies realized,", "start": 475.46, "duration": 2.0}, {"text": "they couldn't afford living in San Francisco anymore.", "start": 477.46, "duration": 2.0}, {"text": "So, they all just kind of moved up north.", "start": 479.54, "duration": 1.92}, {"text": "Now Oregon is like this weird lumberjack- vegan- hipster hybrid freak show, with good doughnuts.", "start": 481.46, "duration": 5.0}, {"text": "Pennsylvania: America's history state.", "start": 486.46, "duration": 2.12}, {"text": "We should have had our capital over here", "start": 488.58, "duration": 1.78}, {"text": "and technically at one point our Congress did actually meet in Philadelphia.", "start": 490.36, "duration": 2.56}, {"text": "If you wanna relive the American history story, come here.", "start": 492.92, "duration": 2.0}, {"text": "Rhode Island, our smallest state,", "start": 494.92, "duration": 2.0}, {"text": "and it's not even an island. It's not even a peninsula.", "start": 496.92, "duration": 2.0}, {"text": "What the heck, Rhode Island?", "start": 498.92, "duration": 1.76}, {"text": "Anyway, they were one of the original 13 states.", "start": 500.68, "duration": 2.0}, {"text": "Other than that, they really don't have much else going for them.", "start": 502.68, "duration": 2.82}, {"text": "I mean, they are home to the fictional city of Quahog", "start": 505.5, "duration": 2.5}, {"text": "and the Family Guy, but that's about it.", "start": 508.0, "duration": 2.0}, {"text": "South Carolina. These people love", "start": 510.0, "duration": 2.0}, {"text": "their tobacco, fudge, walnuts,", "start": 512.0, "duration": 2.0}, {"text": "and it's home to the largest potion of the Gullah Community.", "start": 514.0, "duration": 2.5}, {"text": "They speak their own Creole, mixed with African influences", "start": 516.5, "duration": 2.6}, {"text": "and they hold their own communal festivals and celebrations.", "start": 519.1, "duration": 2.5}, {"text": "South Dakota, the other Dakota.", "start": 521.6, "duration": 2.36}, {"text": "Home to Mount Rushmore, America's most", "start": 523.96, "duration": 2.0}, {"text": "iconic presidential landmark.", "start": 525.96, "duration": 1.36}, {"text": "They are also working on the largest sculpture in the world,", "start": 527.32, "duration": 2.12}, {"text": "the crazy horse monument.", "start": 529.44, "duration": 1.1}, {"text": "Otherwise like North Dakota, they also have a sizable Native Americans community,", "start": 530.54, "duration": 3.24}, {"text": "mostly part of the Sioux Nation.", "start": 533.78, "duration": 1.46}, {"text": "Tennessee is kind of like the girl down the block that Texas has a little crush on.", "start": 535.24, "duration": 3.74}, {"text": "The capital of the Appalachians, mountain folk, Blue Grass.", "start": 538.98, "duration": 3.44}, {"text": "Country music artists all come here in hopes of making  record deals.", "start": 542.42, "duration": 3.02}, {"text": "Now everybody knows about Texas.", "start": 545.44, "duration": 1.54}, {"text": "Texas was, at one point, even its own country", "start": 547.06, "duration": 3.14}, {"text": "and in Texas everything is bigger.", "start": 550.2, "duration": 2.0}, {"text": "Football, or American Football, is basically a religion.", "start": 552.2, "duration": 2.08}, {"text": "Barbecue and barbecue sauce are each separate food groups.", "start": 554.28, "duration": 2.48}, {"text": "Cattle ranches are everywhere.", "start": 556.76, "duration": 2.0}, {"text": "In contrary to popular belief,", "start": 558.76, "duration": 2.0}, {"text": "most Texans, don't really mind Mexicans or Mexican culture.", "start": 560.76, "duration": 2.56}, {"text": "As so many already live in their state,", "start": 563.32, "duration": 2.04}, {"text": "that they have actually kind of developed", "start": 565.36, "duration": 1.24}, {"text": "this new Tex-Mex culture that fuses both of them.", "start": 566.6, "duration": 2.6}, {"text": "Utah: Basically everybody kind of knows this place", "start": 569.2, "duration": 2.34}, {"text": "as being like as America's Mormon state.", "start": 571.54, "duration": 1.96}, {"text": "Salt Lake City is like the headquarters of the Mormon Church", "start": 573.5, "duration": 2.84}, {"text": "and over half of the entire state's population is registered with them.", "start": 576.34, "duration": 2.98}, {"text": "Otherwise they have great skiing.", "start": 579.32, "duration": 2.1}, {"text": "The Sundance Festival comes here all the time", "start": 581.42, "duration": 1.4}, {"text": "and they have great eroded rock formations,", "start": 582.82, "duration": 2.34}, {"text": "like my favorite site in all of America, Monument Valley.", "start": 585.16, "duration": 2.12}, {"text": "Vermont is kind of like New Hampshire's", "start": 587.28, "duration": 1.88}, {"text": "smaller twin brother that makes a lot more maple syrup.", "start": 589.16, "duration": 2.12}, {"text": "Otherwise, the only other thing they got going for them", "start": 591.28, "duration": 2.0}, {"text": "is Ben and Jerry's.", "start": 593.28, "duration": 1.28}, {"text": "Like seriously, if that company goes bankrupt they will become the next Michigan.", "start": 594.56, "duration": 2.72}, {"text": "Virginia is kind of like where everything started with the US", "start": 597.28, "duration": 3.6}, {"text": "Essentially, the British came in. They tried to start", "start": 600.88, "duration": 2.0}, {"text": "a little small town and then the whole Pocahontas thing happened", "start": 602.88, "duration": 2.8}, {"text": "and then Disney made everything incredibly accurate", "start": 605.68, "duration": 2.0}, {"text": "and hold so much history.", "start": 607.68, "duration": 2.0}, {"text": "So, Virginia and Pennsylvania, those are like the two history states.", "start": 609.68, "duration": 2.0}, {"text": "Washington, the evergreen state.", "start": 611.68, "duration": 2.0}, {"text": "Basically, imagine the exact same scenario with Oregon", "start": 613.68, "duration": 2.82}, {"text": "except, replace hippies with computer nerds.", "start": 616.5, "duration": 2.46}, {"text": "Baam, Microsoft, Amazon, Expedia, Starbucks, Boeing", "start": 618.96, "duration": 4.1}, {"text": "they are all born.", "start": 623.06, "duration": 0.92}, {"text": "Oh, and a volcano erupted in the 80s", "start": 623.98, "duration": 1.6}, {"text": "and it's like really easy to catch flounder in their waters.", "start": 625.58, "duration": 2.66}, {"text": "West Virginia, is like the southernmost like-state,", "start": 628.24, "duration": 3.0}, {"text": "that was actually part of the union during the Civil War.", "start": 631.24, "duration": 2.86}, {"text": "It was like, \"Nope, Virginia. I'm leaving you.\"", "start": 634.1, "duration": 2.0}, {"text": "They are also the oldest state.", "start": 636.1, "duration": 1.66}, {"text": "The average age is about 40", "start": 637.76, "duration": 1.38}, {"text": "and we get a lot of coal from here.", "start": 639.14, "duration": 1.74}, {"text": "Wisconsin, America's dairy land.", "start": 640.88, "duration": 2.36}, {"text": "Now, my personal belief is that everybody needs to have at least one friend from Wisconsin.", "start": 643.24, "duration": 4.54}, {"text": "I personally do. He is actually the one who made the theme song for Geography Now.", "start": 647.78, "duration": 3.44}, {"text": "Wisconsin people are the easiest to get along with.", "start": 651.22, "duration": 2.34}, {"text": "They have the best stories.", "start": 653.56, "duration": 1.48}, {"text": "They are also, like, home to the country's most attractive chubby people", "start": 655.08, "duration": 3.66}, {"text": "They don't care. They own it and they flaunt it.", "start": 658.74, "duration": 2.0}, {"text": "Wyoming, home to our country's most noticeable national park , Yellowstone.", "start": 660.74, "duration": 3.7}, {"text": "Beautiful place, waterfalls, shooting geysers, hot springs;", "start": 664.44, "duration": 2.6}, {"text": "they have tons of buffalo and it's kind of like", "start": 667.04, "duration": 2.02}, {"text": "the training grounds for actual cowboys.", "start": 669.06, "duration": 1.86}, {"text": "And here's a little bonus.", "start": 670.92, "duration": 1.9}, {"text": "Washington D.C., our capital.", "start": 672.82, "duration": 1.82}, {"text": "Although it has a population higher than two states,", "start": 674.64, "duration": 2.28}, {"text": "it's not a state. It's a Federal District.", "start": 676.92, "duration": 1.52}, {"text": "The President lives here, sometimes.", "start": 678.44, "duration": 1.76}, {"text": "The Congress assembles, mostly.", "start": 680.26, "duration": 1.76}, {"text": "All the museums and the Smithsonian are free, but the hot dogs are crazy expensive.", "start": 682.02, "duration": 3.4}, {"text": "There are statues, monuments and everywhere you are being watched.", "start": 685.42, "duration": 3.22}, {"text": "Security cameras are everywhere.", "start": 688.64, "duration": 1.72}, {"text": "So, have fun! Just not too much fun.", "start": 690.44, "duration": 2.04}, {"text": "Oh yeah, we also have those territories like Puerto Rico, Guam, Marianas and the Virgin Islands.", "start": 692.48, "duration": 3.76}, {"text": "But we'll talk about those later.", "start": 696.24, "duration": 1.24}, {"text": "Alright now, very quickly before we end this video, just please stay, please, just listen.", "start": 697.48, "duration": 2.9}, {"text": "As you guys know, I've mentioned this before,", "start": 700.38, "duration": 1.84}, {"text": "I'm trying to work to save up for my heritage trip that me and my mom are taking and as you guys know", "start": 702.22, "duration": 4.26}, {"text": "one way I'm doing that is by doing more of these sponsored videos,", "start": 706.48, "duration": 1.86}, {"text": "and I'm very happy to announce that a great company called Skillshare has decided to sponsor Geography Now.", "start": 708.34, "duration": 4.9}, {"text": "What is Skillshare?", "start": 713.24, "duration": 1.36}, {"text": "Skillshare is an amazing online learning community with over 15,000 classes covering everything", "start": 714.6, "duration": 4.0}, {"text": "from photography to cooking to JavaScript.", "start": 718.6, "duration": 2.08}, {"text": "I'm personally keeping my eye on the French courses so that i can brush up on my French", "start": 720.68, "duration": 3.06}, {"text": "for the Heritage trip that my mom and I are planning to go on.", "start": 723.74, "duration": 2.28}, {"text": "It's very simple, once you sign up you select which fields you're interested in learning and from there,", "start": 726.02, "duration": 3.98}, {"text": "Skillshare gives you options to choose from a variety of categories and for you to follow.", "start": 730.0, "duration": 4.36}, {"text": "What's even cooler is can not only take part in classes or try a project you can also become a teacher", "start": 734.36, "duration": 4.46}, {"text": "and if possible work on Skillshare.", "start": 738.82, "duration": 1.94}, {"text": "Membership starts at $10 a month for unlimited access to every class", "start": 740.76, "duration": 3.04}, {"text": "however, you can get a free two month trial by clicking on this link like here which will also be available", "start": 743.8, "duration": 4.32}, {"text": "in the description of this video.", "start": 748.12, "duration": 1.22}, {"text": "Skillshare is also available on Android and iPhone (IOS)", "start": 749.34, "duration": 2.02}, {"text": "and you can even tap into every class when you're offline.", "start": 751.36, "duration": 2.56}, {"text": "Thanks, Skillshare! You guys rock, great learning material, check them out.", "start": 753.92, "duration": 2.72}, {"text": "In the meantime, thanks for watching hope you learn something, subscribe, stay cool, stay tuned", "start": 756.64, "duration": 4.66}, {"text": "[Outro Music]", "start": 761.3, "duration": 19.94}]