[{"text": "Thanks to LastPass for sponsoring our coverage of Computex 2018. You can try LastPass for free at the link in the video description", "start": 0.0, "duration": 6.92}, {"text": "This is a hands-on that is so exclusive", "start": 7.32, "duration": 3.4}, {"text": "Only a handful of people in the world have touched this device so far", "start": 10.72, "duration": 4.98}, {"text": "That we had to come all the way to Asus's headquarters in order to get it", "start": 15.72, "duration": 4.02}, {"text": "This is the one unit of what they're calling 'Project Precog'", "start": 19.74, "duration": 6.16}, {"text": "which takes an idea that we've sort of seen before in the Lenovo Yoga book", "start": 26.17, "duration": 5.539}, {"text": "which had a touchscreen on the top and then it had a touch surface", "start": 31.709, "duration": 5.211}, {"text": "that you could use as a keyboard and touch pad on the bottom", "start": 36.96, "duration": 2.28}, {"text": "And takes it to a completely different level", "start": 39.58, "duration": 2.22}, {"text": "So it's kind of a notebook, in the sense that, like a two-in-one", "start": 41.9, "duration": 5.22}, {"text": "you could use it on the desk in front of you", "start": 47.54, "duration": 2.52}, {"text": "or in your lap in front of you", "start": 50.48, "duration": 1.94}, {"text": "or you could flip it around and use it just as a Windows tablet", "start": 52.54, "duration": 6.18}, {"text": "See, you got that Start menu", "start": 59.2, "duration": 1.04}, {"text": "This thing actually does work by the way, you guys", "start": 60.24, "duration": 2.54}, {"text": "Or you could put it in tent mode", "start": 63.16, "duration": 2.24}, {"text": "But then, it's also kind of just like a", "start": 65.58, "duration": 3.22}, {"text": "like a giant flexible touch surface", "start": 69.42, "duration": 4.24}, {"text": "and they've got a book mode that would allow you to use it as, well", "start": 74.0, "duration": 2.74}, {"text": "I mean", "start": 76.84, "duration": 0.5}, {"text": "I guess this is sort of self-explanatory as", "start": 77.34, "duration": 2.94}, {"text": "as kind of a book", "start": 80.28, "duration": 2.0}, {"text": "One of the most striking things about the device to me is that they've achieved", "start": 82.5, "duration": 4.98}, {"text": "near symmetry in the design", "start": 87.9, "duration": 3.82}, {"text": "So the 'top' and the 'bottom' of the laptop as concepts", "start": 91.86, "duration": 5.42}, {"text": "are sort of being challenged here because", "start": 97.36, "duration": 2.46}, {"text": "Check this out", "start": 99.82, "duration": 1.32}, {"text": "This surface here like - yes, this Asus logo", "start": 101.14, "duration": 3.4}, {"text": "By the way, none of this stuff is final", "start": 104.58, "duration": 2.0}, {"text": "this is all very much in engineering stages right now", "start": 106.58, "duration": 2.56}, {"text": "So this Asus logo here is right-side up if you hold it this way", "start": 109.39, "duration": 4.099}, {"text": "But then you flip it over to the other side and you could just as easily have that logo here or here", "start": 113.92, "duration": 6.47}, {"text": "There's no feet. There's no nothing", "start": 120.42, "duration": 2.01}, {"text": "You could literally put it down this way, open it up and there's absolutely no reason", "start": 122.649, "duration": 6.08}, {"text": "why the keyboard and touchpad couldn't just be on this side", "start": 129.06, "duration": 4.88}, {"text": "And that's actually a big part of where the name of this product", "start": 134.48, "duration": 3.34}, {"text": "'Precog' comes from. Asus knows that with great flexibility", "start": 138.32, "duration": 4.66}, {"text": "you can actually lose some of the intuitiveness of the device", "start": 143.03, "duration": 3.97}, {"text": "and they're talking about some of the ways that they plan to tackle this", "start": 147.0, "duration": 4.06}, {"text": "So, for example", "start": 151.24, "duration": 1.66}, {"text": "they want the finished product to be able to detect when its keyboard is moved near it so that the", "start": 152.9, "duration": 6.14}, {"text": "on-screen keyboard could go away and the same would go for something like a mouse", "start": 159.17, "duration": 4.61}, {"text": "This is just a regular off-the-shelf mouse, but the example that they're talking about it's like", "start": 163.78, "duration": 4.56}, {"text": "maybe when you move the mouse here", "start": 168.42, "duration": 1.98}, {"text": "Now the touchpad, that is like a virtual touchpad on the bottom screen, can go away", "start": 170.62, "duration": 6.2}, {"text": "Maybe when that moves, so you can take more advantage of all this screen real estate that you paid for", "start": 177.14, "duration": 5.46}, {"text": "the keyboard itself could also move", "start": 182.82, "duration": 2.88}, {"text": "Which I guess brings us to the other challenge that Asus seems to be well aware of and yet I still have", "start": 185.9, "duration": 7.8}, {"text": "my doubts about how they're going to solve", "start": 193.7, "duration": 5.02}, {"text": "How do you make a keyboard usable on a touchscreen?", "start": 198.72, "duration": 5.86}, {"text": "How do you make a keyboard experience that runs as", "start": 204.84, "duration": 5.0}, {"text": "as an image on a touchscreen even remotely usable?", "start": 210.44, "duration": 4.68}, {"text": "There are a couple of main issues here that, quite frankly, the solutions I've seen for so far", "start": 215.4, "duration": 5.839}, {"text": "are not even close to adequate. First of all is haptic feedback", "start": 221.24, "duration": 5.18}, {"text": "When you press down on a key on a keyboard", "start": 226.48, "duration": 2.58}, {"text": "the response in your hands and your fingertips needs to be instantaneous and I have never", "start": 230.56, "duration": 5.58}, {"text": "experienced a haptic motor that is fast enough or", "start": 236.32, "duration": 4.04}, {"text": "crisp enough that I would consider it to be acceptable as a replacement for a real keyboard", "start": 240.7, "duration": 6.22}, {"text": "And then the other one is the positioning", "start": 247.26, "duration": 2.84}, {"text": "When I sit down at my laptop", "start": 250.42, "duration": 2.38}, {"text": "the first thing that I do is run my fingers over top of it and find the bumps for the home row", "start": 252.84, "duration": 5.32}, {"text": "That's how, within a second or two, I can be typing at full speed", "start": 258.65, "duration": 4.82}, {"text": "Asus has actually shared with me some of the ideas they have for tackling these problems", "start": 263.9, "duration": 6.779}, {"text": "and I have to say that my initial impressions of the idea were much worse than they are now", "start": 270.93, "duration": 5.09}, {"text": "But there's still a lot of work to be done and they're not expecting any kind of real product", "start": 276.44, "duration": 6.22}, {"text": "based on this concept to be available until sometime in 2019", "start": 282.74, "duration": 4.86}, {"text": "With that said, there's still a lot that we can try to guess at based on what we're seeing so far", "start": 287.88, "duration": 6.04}, {"text": "In spite of the thermal challenges", "start": 294.62, "duration": 2.28}, {"text": "Because you got to remember, most laptops breathe either through the", "start": 296.9, "duration": 5.24}, {"text": "bottom, which this one won't have a bottom, because both of them are the top", "start": 302.14, "duration": 3.96}, {"text": "the hinge or the keyboard or some combination of the two", "start": 306.26, "duration": 4.14}, {"text": "It will have to be basically passive", "start": 310.64, "duration": 2.54}, {"text": "But they're still saying that they might expect to be able to put Core i7-grade hardware in it", "start": 313.42, "duration": 4.74}, {"text": "Let's hope Intel's next generation has fantastic thermal and power consumption properties", "start": 318.2, "duration": 5.099}, {"text": "We can also look at the I/O. Right now, we've got a couple of Thunderbolt 3 ports", "start": 323.46, "duration": 5.24}, {"text": "which I am actually shocked to see in a form factor like this", "start": 328.7, "duration": 4.229}, {"text": "Either of which can be used for charging based on our short hands-on time with the product", "start": 333.09, "duration": 4.88}, {"text": "Another thing that we know is that the top and bottom have only", "start": 338.48, "duration": 5.24}, {"text": "slight differences in thickness. You can see, it's just the thickness of the glass right here", "start": 343.78, "duration": 5.0}, {"text": "that is allowing them to put processor, memory, storage, battery", "start": 348.84, "duration": 5.52}, {"text": "Somehow they've managed to jam a battery in this thing", "start": 354.52, "duration": 2.2}, {"text": "Are we going to see some kind of a custom shaped battery technology powering it?", "start": 356.72, "duration": 4.739}, {"text": "Are we gonna maybe see them split up the battery?", "start": 361.46, "duration": 2.94}, {"text": "Apple actually did that in the iPhone 10, where they put part of the battery", "start": 364.68, "duration": 3.06}, {"text": "in one portion of the phone and part of it elsewhere", "start": 367.76, "duration": 2.54}, {"text": "Could we see something where they put some battery here and some there?", "start": 370.42, "duration": 3.64}, {"text": "Something I'm really curious to see what they do with is speakers", "start": 374.48, "duration": 3.44}, {"text": "So right now you can actually see that's probably part of the reason why we've got some extra thickness on the bottom", "start": 378.0, "duration": 6.109}, {"text": "But we actually saw Sony demo a TV at CES 2017", "start": 384.12, "duration": 5.28}, {"text": "that had the speakers built into the panel of the glass", "start": 389.42, "duration": 3.48}, {"text": "so it actually produced sound by vibrating the glass and it sounded shockingly good", "start": 393.02, "duration": 5.6}, {"text": "I mean, well, I would love to see that technology built into something like this", "start": 398.62, "duration": 4.38}, {"text": "But while that all sounded really positive and excited there are", "start": 403.64, "duration": 5.06}, {"text": "still a lot of challenges for them to overcome like, right now", "start": 408.84, "duration": 4.96}, {"text": "do you think Windows 10 is ready for this kind of an interface?", "start": 413.88, "duration": 4.08}, {"text": "Hardly, I mean even something as simple as taking this chat window that's running in their demo", "start": 418.66, "duration": 5.62}, {"text": "and dragging it with your finger up to the", "start": 424.28, "duration": 2.0}, {"text": "Oh wait, there's a hinge there. So they might need some kind of momentum based", "start": 426.389, "duration": 5.691}, {"text": "software solution for flinging windows from one screen on to the other", "start": 432.66, "duration": 4.28}, {"text": "There's a lot of software work still to be done here, but", "start": 437.34, "duration": 4.22}, {"text": "Again, I really wish I could tell you guys more about how they're planning to solve the keyboard problem", "start": 442.21, "duration": 5.66}, {"text": "I'm pretty hopeful and I want to hear from you. Is this kind of a device important?", "start": 447.87, "duration": 5.97}, {"text": "Is this something that you guys want to see?", "start": 453.84, "duration": 3.149}, {"text": "Let me know in the comments below and let me know what you think are the", "start": 457.08, "duration": 4.8}, {"text": "biggest challenge and the biggest benefit to a device like this", "start": 462.06, "duration": 5.34}, {"text": "that's ... It's more screen now than laptop, you know", "start": 467.7, "duration": 3.92}, {"text": "folded and, you know, not evil but", "start": 473.4, "duration": 2.84}, {"text": "but definitely bad, you know like in that way", "start": 476.94, "duration": 3.7}, {"text": "Speaking of bad, it would be bad", "start": 480.82, "duration": 1.92}, {"text": "if you guys didn't check out our sponsor here at Computex 2018, LastPass", "start": 482.74, "duration": 3.86}, {"text": "With LastPass, all your passwords can be stored conveniently in your vault", "start": 486.9, "duration": 3.82}, {"text": "where they can be accessed on any device from anywhere in the world and even shared with people", "start": 490.72, "duration": 5.12}, {"text": "This is something that has come in handy for me a lot of times while I've been traveling and", "start": 496.02, "duration": 5.26}, {"text": "LastPass stores more than just passwords", "start": 501.52, "duration": 2.089}, {"text": "You could store your passport number so that you can quickly jot that into the website when you're trying to", "start": 503.61, "duration": 5.13}, {"text": "check in for a flight, for example", "start": 509.139, "duration": 1.961}, {"text": "It can store your social security number or your children's care card numbers", "start": 511.139, "duration": 3.72}, {"text": "so you don't have to carry around cards that are not only", "start": 514.86, "duration": 2.58}, {"text": "expensive to replace, but also a huge potential problem if they get into the hands of ne'er-do-wells", "start": 517.56, "duration": 6.28}, {"text": "Or even things like credit card numbers for something like the business credit card", "start": 524.02, "duration": 3.74}, {"text": "that you would never actually carry around but you might have to use from time to time", "start": 527.88, "duration": 4.06}, {"text": "Check out LastPass, you can try it out for free. We're gonna have a link in the video description", "start": 532.2, "duration": 5.36}, {"text": "So thanks for watching guys. I hope you enjoyed what will probably be the last video we upload from Computex 2018", "start": 537.98, "duration": 5.799}, {"text": "We certainly saved the best for last here and", "start": 543.78, "duration": 3.38}, {"text": "Don't forget to subscribe so you don't miss any of our videos on Linus Tech Tips", "start": 547.86, "duration": 4.3}, {"text": "I'm shocked at how thin they managed to make this thing in spite of two touchscreens", "start": 553.66, "duration": 5.39}]