[{"text": "This video is brought to you in part by Audible!", "start": 0.22, "duration": 2.38}, {"text": "Use the link audible.com/stopskeletons, or text \"stopskeletons\" to 500 500 to get a free book,", "start": 2.6, "duration": 6.56}, {"text": "two free Audible originals from a curated list, and a 30-day free trial!", "start": 9.16, "duration": 4.2}, {"text": "Lately I've been getting really into Game of Thrones,", "start": 13.44, "duration": 2.56}, {"text": "but the idea of reading one of those massive books as a dyslexic", "start": 16.0, "duration": 3.02}, {"text": "doesn't sound as appealing as listening to the audio version,", "start": 19.02, "duration": 2.62}, {"text": "which is why I recommend you try the first Game of Thrones book from Audible!", "start": 21.64, "duration": 3.76}, {"text": "Members get a free book credit every month, and you get to keep the book even if you leave Audible!", "start": 25.4, "duration": 4.52}, {"text": "That's audible.com/stopskeletons, or text \"stopskeletons\" to 500 500.", "start": 29.92, "duration": 4.92}, {"text": "Hey, it's Derek from Stop Skeletons From Fighting, and welcome back to Punching Weight,", "start": 34.84, "duration": 3.8}, {"text": "the show that celebrates the weird, ambitious and unnecessary.", "start": 38.68, "duration": 3.16}, {"text": "In this episode, we're gonna be talking random or procedural generation in games,", "start": 41.88, "duration": 4.7}, {"text": "specifically in a place where you'd least expect it.", "start": 46.64, "duration": 2.36}, {"text": "Now, random/procedural generation has been around in video games for a while:", "start": 49.0, "duration": 4.12}, {"text": "From Cave Noire, to ToeJam & Earl, to Diablo,", "start": 53.28, "duration": 3.34}, {"text": "even all the way up to No Man's Sky and the glut of indie Roguelikes,", "start": 56.62, "duration": 3.44}, {"text": "and of course, fan-made mods and the emulation community,", "start": 60.06, "duration": 3.0}, {"text": "randomly generating game content is not all that rare of a game feature.", "start": 63.14, "duration": 3.46}, {"text": "However, this feature is almost completely missing from one system's library: The N64.", "start": 66.7, "duration": 5.26}, {"text": "This episode was actually voted on by our Patreon supporters,", "start": 72.18, "duration": 3.4}, {"text": "and we love 'em, but if only I'd known what we were in for, I'd maybe not let them do it,", "start": 75.8, "duration": 4.24}, {"text": "but I'd do it again!", "start": 80.04, "duration": 1.46}, {"text": "We are here to talk about four Nintendo 64 games that have randomly generating features,", "start": 81.5, "duration": 5.62}, {"text": "maybe a few games you own,  but didn't realize had almost infinite content!", "start": 87.18, "duration": 4.3}, {"text": "We're gonna start with one of the most graphically impressive games on the system: F-Zero X.", "start": 99.84, "duration": 5.46}, {"text": "Visually it might not look like much,", "start": 105.3, "duration": 1.72}, {"text": "but F-Zero X's claim to fame is its silky-smooth graphics and blisteringly fast speed!", "start": 107.02, "duration": 5.16}, {"text": "Maybe not the best game on a pure aesthetics level,   but it prioritized framerate above everything else,", "start": 112.26, "duration": 5.28}, {"text": "which is not something you can say about a lot of N64 games.", "start": 117.54, "duration": 3.22}, {"text": "The fact that you can have 30 characters on-screen at once and still run like this is amazing!", "start": 120.8, "duration": 5.88}, {"text": "It's also a pretty fun racer on top of all that, with a great soundtrack", "start": 126.74, "duration": 3.5}, {"text": "and tracks that are futuristic and over-the-top, it's just bonkers!", "start": 130.24, "duration": 3.5}, {"text": "It's a game so good, you'd wish you could play it forever!", "start": 133.84, "duration": 3.28}, {"text": "But what if I told you that you could?", "start": 137.26, "duration": 2.16}, {"text": "Enter the X Cup.", "start": 139.56, "duration": 1.22}, {"text": "On top of being the coolest name for a mode ever,", "start": 140.78, "duration": 2.82}, {"text": "the X Cup functions like any other cup, in that it's the best of six races.", "start": 143.6, "duration": 3.62}, {"text": "However, all of the racetracks are randomly generated!", "start": 147.22, "duration": 3.02}, {"text": "No two tracks are ever the same, you never know what you gonna get!", "start": 150.28, "duration": 3.24}, {"text": "It's fun to play just to see what the game throws at you!", "start": 153.56, "duration": 2.82}, {"text": "Unfortunately, and probably because the devs didn't want you to end up with impossible tracks,", "start": 156.42, "duration": 4.5}, {"text": "some of the more outrageous track features like loop-de-loops and cylinders are left out,", "start": 160.92, "duration": 3.96}, {"text": "but things still get wild!", "start": 164.88, "duration": 1.56}, {"text": "Maps can have sudden bends and sharp curves that might result in launching you off the course.", "start": 166.44, "duration": 4.36}, {"text": "The AI-controlled drivers also typically don't handle these tracks very well,", "start": 170.82, "duration": 3.72}, {"text": "so, in a way, the X Cup is one of the easier cups.", "start": 174.54, "duration": 2.92}, {"text": "It does let you play on all difficulties, which by the way, means tougher opponent drivers, not tougher tracks.", "start": 177.46, "duration": 4.66}, {"text": "But if you really wanna level the playing field, grab three buddies and play four-player splitscreen!", "start": 182.12, "duration": 4.24}, {"text": "And if you wanna get the best time on a track you'll never be able to play again,", "start": 186.38, "duration": 3.7}, {"text": "hey, play on practice mode! Who cares?!", "start": 190.1, "duration": 2.22}, {"text": "It's a shame that this is the only F-Zero that ever had a random track mode,", "start": 192.56, "duration": 3.9}, {"text": "it's a damn shame that GX didn't have one also.", "start": 196.46, "duration": 2.74}, {"text": "If Nintendo doesn't include this mode in their battle royale reboot, F-Zero 99, we riot!", "start": 199.28, "duration": 5.34}, {"text": "We wanted to get the word out because honestly,", "start": 204.8, "duration": 2.42}, {"text": "I wouldn't be surprised if you didn't know this mode existed!", "start": 207.22, "duration": 2.74}, {"text": "It's not mentioned on the box or in the manual,", "start": 209.98, "duration": 2.22}, {"text": "this is one of my favorite racers on the system, and I can't believe I didn't know about it!", "start": 212.2, "duration": 4.02}, {"text": "I mean, I knew about the track editor in the Japanese-only 64DD version...", "start": 216.24, "duration": 3.8}, {"text": "... okay, I dunno, maybe I was the only one who didn't know about the X Cup.", "start": 220.06, "duration": 3.12}, {"text": "But there is a bit of a barrier to get it:", "start": 223.18, "duration": 2.32}, {"text": "To unlock the X Cup, you have to beat the Joker Cup on Expert, which is basically completing the entire game,", "start": 225.5, "duration": 5.72}, {"text": "OR do what we did and put in a code, and just go nuts!", "start": 231.34, "duration": 3.22}, {"text": "Because you shouldn't have to work that hard for some good ol'-fashioned dumb fun!", "start": 234.56, "duration": 4.24}, {"text": "Or, if you wanna have some dumb fun out of the box, our next game's got you covered:", "start": 239.44, "duration": 4.38}, {"text": "Excitebike 64 is an underappreciated racer that came out kinda late in the N64's lifespan.", "start": 243.92, "duration": 6.2}, {"text": "It's pretty fun, but it also has SO many cool modes and cheats,", "start": 250.38, "duration": 4.12}, {"text": "like an emulated version of Excitebike for the NES,", "start": 254.5, "duration": 2.84}, {"text": "a 3D remake of Excitebike for the NES,", "start": 257.38, "duration": 2.56}, {"text": "and a soccer mode that's basically Rocket League, but 15 years earlier!", "start": 260.0, "duration": 4.2}, {"text": "The story goes that Miyamoto himself told the devs", "start": 264.28, "duration": 2.9}, {"text": "to tone it down on the bonus stuff and focus on the main game.", "start": 267.18, "duration": 3.74}, {"text": "Luckily for us, they didn't listen.", "start": 271.0, "duration": 2.08}, {"text": "We don't have time to talk about all the cool things in this game,", "start": 273.3, "duration": 3.36}, {"text": "because we're gonna focus on the Desert mode.", "start": 276.66, "duration": 1.96}, {"text": "Desert mode is unlocked from the start, and it's very different from the X Cup,", "start": 278.62, "duration": 3.76}, {"text": "though it is, again, not advertised on the box, Desert mode is not a track,", "start": 282.46, "duration": 3.82}, {"text": "it is a procedurally generated 3D open-world desert where you can go in any direction!", "start": 286.28, "duration": 5.2}, {"text": "Your only goal is to hit ten campfire checkpoints before five other AI bikers.", "start": 291.54, "duration": 4.08}, {"text": "Driving up and down the dunes is fun, and it IS fun to try and beat your opponents,", "start": 295.62, "duration": 4.5}, {"text": "but dude! You don't have to do ANY of that!", "start": 300.14, "duration": 2.74}, {"text": "When we were researching this game, we came across something really interesting", "start": 302.92, "duration": 3.22}, {"text": "in Excitebike 64's writeup in Nintendo Power:", "start": 306.14, "duration": 2.88}, {"text": "Beyond claiming that the desert is \"endless\",", "start": 309.02, "duration": 2.5}, {"text": "they also say that the game remembers the landscape even after it's out of sight,", "start": 311.52, "duration": 3.66}, {"text": "so you can turn back and race over your favorite jumps.", "start": 315.18, "duration": 2.66}, {"text": "Wait...", "start": 318.14, "duration": 0.98}, {"text": "Wait... 'scuse me?", "start": 319.12, "duration": 0.66}, {"text": "Stop. What?!", "start": 319.78, "duration": 1.12}, {"text": "So, basically what this is saying is that not only does the desert generate in real time, possibly forever,", "start": 321.14, "duration": 6.5}, {"text": "it also stores everything it's generated in the game's memory?!", "start": 327.72, "duration": 4.02}, {"text": "Are you kidding me?!", "start": 331.96, "duration": 1.28}, {"text": "We had to test this.", "start": 333.44, "duration": 1.36}, {"text": "The first thing we did was put our back to the first campfire", "start": 334.94, "duration": 3.14}, {"text": "and drove 27 minutes in the opposite direction.", "start": 338.08, "duration": 3.8}, {"text": "The game didn't crash, didn't slow down or start chugging or anything!", "start": 341.96, "duration": 4.02}, {"text": "Then we turned around to see if it would take 27 minutes to get back to the campfire,", "start": 346.06, "duration": 4.44}, {"text": "and sure enough, it did!", "start": 350.5, "duration": 1.68}, {"text": "Can't say for certain if it was the exact same terrain, as you can see it's all very similar,", "start": 352.18, "duration": 4.58}, {"text": "but it did know how far away we went!", "start": 356.76, "duration": 2.24}, {"text": "And then it spawned nine more campfires, and we finished the race!", "start": 359.0, "duration": 2.9}, {"text": "Though we think our opponent drivers just vanished.", "start": 361.9, "duration": 2.84}, {"text": "Can't really say, we only tested this once because it took an HOUR, and we regret nothing!", "start": 364.9, "duration": 5.42}, {"text": "Well, that's what we thought, but then our editor Soberdwarf came through with some emulation testing,", "start": 370.42, "duration": 4.26}, {"text": "and it turns out, if we had driven another 90 seconds, we would have seen the hour time limit,", "start": 374.68, "duration": 4.62}, {"text": "which means that, in a literal sense, it's not endless, or if it is, we can't test it.", "start": 379.3, "duration": 4.86}, {"text": "It's definitely one of, if not the biggest physical area in an N64 game.", "start": 384.16, "duration": 4.74}, {"text": "As far as if the entire area is randomly generated every time...?", "start": 388.94, "duration": 4.4}, {"text": "Well, at the very least, the beginning area is the same,", "start": 393.34, "duration": 3.02}, {"text": "with the main variable being do you get a tree or a cactus.", "start": 396.36, "duration": 3.06}, {"text": "Also, we did our initial test without the Expansion Pak, which makes it all the more impressive!", "start": 399.42, "duration": 4.34}, {"text": "While it likely isn't generating in real time,", "start": 403.76, "duration": 2.2}, {"text": "we think this map was randomly generated by the developers and then placed inside the game,", "start": 405.96, "duration": 4.8}, {"text": "which I guess means that maybe Excitebike 64 doesn't actually belong in this video,", "start": 410.76, "duration": 4.9}, {"text": "but we thought all this was just so cool, it needed to stay in the video!", "start": 415.66, "duration": 2.92}, {"text": "Desert mode is a massive, maybe the biggest open world area in an N64 game!", "start": 418.76, "duration": 5.0}, {"text": "The only thing that could make it more bonkers is if it was also multiplayer,", "start": 423.9, "duration": 4.44}, {"text": "which, it's maybe no surprise, is not the case.", "start": 428.34, "duration": 3.46}, {"text": "Our next N64 game with a random mode is another racer: Top Gear Rally 2!", "start": 433.02, "duration": 4.8}, {"text": "And look! It's actually advertised on the box!", "start": 437.82, "duration": 2.52}, {"text": "Top Gear Rally 2 is a sim racing game, which has never been my thing,", "start": 440.36, "duration": 3.8}, {"text": "and it doesn't disappoint in this regard, as far as I can tell.", "start": 444.16, "duration": 3.48}, {"text": "And what I mean by that is this game got depth, and is also hard.", "start": 447.74, "duration": 3.82}, {"text": "And if the random tracks mode had not been advertised on the box,", "start": 451.68, "duration": 3.26}, {"text": "I probably wouldn't have given this game a second thought.", "start": 454.94, "duration": 2.5}, {"text": "The problem is that Top Gear Rally 2 has really confusing menus,", "start": 457.58, "duration": 3.18}, {"text": "and the random tracks mode is not mentioned in the manual, which luckily we have.", "start": 460.76, "duration": 4.24}, {"text": "So when we looked up how to unlock this mode online,", "start": 465.08, "duration": 3.24}, {"text": "all we found was this IGN review from 1999", "start": 468.36, "duration": 3.04}, {"text": "that said the mode unlocks \"once initial tracks are cleared\".", "start": 471.4, "duration": 3.92}, {"text": "I'm gonna come clean:", "start": 475.94, "duration": 1.1}, {"text": "I am not good at sim racers, I am not good at this game,", "start": 477.3, "duration": 3.32}, {"text": "I'm not even all that convinced this is a really good sim experience on the N64,", "start": 480.62, "duration": 4.04}, {"text": "but Punching Weight is a show for the people, and I was determined to bring random tracks to the people!", "start": 484.74, "duration": 5.3}, {"text": "Ten hours I played this game.", "start": 490.6, "duration": 2.56}, {"text": "Our Patreon asked us to put in the hours, and we did!", "start": 493.26, "duration": 2.9}, {"text": "And I was only able to finish all the cups by cheating.", "start": 496.46, "duration": 2.9}, {"text": "But I'd do it again!", "start": 500.16, "duration": 1.18}, {"text": "[Grace chuckles off-screen]", "start": 502.14, "duration": 1.6}, {"text": "There is no \"unlock everything\" code in Top Gear Rally 2 like there is in F-Zero X,", "start": 503.82, "duration": 4.92}, {"text": "so I made do with what I could:", "start": 508.74, "duration": 2.1}, {"text": "No damage, 100,000 credits, AI driving, and even intoxicated AI cars.", "start": 510.84, "duration": 4.76}, {"text": "No shame anymore, I literally watched a drunk driver finish the game for me.", "start": 515.64, "duration": 4.18}, {"text": "[ EUROBEAT INTENSIFIES ]", "start": 519.92, "duration": 6.04}, {"text": "And after me and my drunk chauffeur finally finished the last cup,", "start": 525.96, "duration": 3.4}, {"text": "I couldn't find the random track mode anywhere.", "start": 529.54, "duration": 2.78}, {"text": "It was only then, in a state of panic, that I went into the Multiplayer menu...", "start": 532.32, "duration": 4.16}, {"text": "... and found it.", "start": 536.98, "duration": 0.92}, {"text": "And then I, as a test, I took out the memory card and reset the game...", "start": 538.0, "duration": 2.72}, {"text": "... and yep, it's unlocked from the start.", "start": 541.0, "duration": 1.6}, {"text": "Ugh, Top Gear Rally 2, I'm about to throw you out the window.", "start": 542.88, "duration": 2.78}, {"text": "Okay, and before we all dunk on IGN,", "start": 546.04, "duration": 2.58}, {"text": "it's possible they were reviewing from an early version where the mode was an unlockable bonus,", "start": 548.66, "duration": 4.66}, {"text": "it's probably not their fault, but whatever! We finally got the random tracks mode!", "start": 553.32, "duration": 2.72}, {"text": "[CRASH!]\nit's probably not their fault, but whatever! We finally got the random tracks mode!", "start": 556.04, "duration": 1.58}, {"text": "And the first thing I noticed is that this mode actually gives you a lot of choices!", "start": 557.72, "duration": 4.34}, {"text": "There are four terrain categories: Farm, Desert, Jungle and Mountain,", "start": 562.06, "duration": 3.66}, {"text": "and three weather categories: Clear, Rain and Snow.", "start": 565.72, "duration": 3.22}, {"text": "but you can't do snow in the desert and jungle, which is dumb!", "start": 568.94, "duration": 3.62}, {"text": "Ugh, I just wanna have fun, Top Gear Rally 2, why can't we just have fun?!", "start": 572.56, "duration": 3.08}, {"text": "But what I did NOT see was extra specs for cars in multiplayer.", "start": 575.82, "duration": 3.96}, {"text": "Gone also is car damage, like brake failures and blown tires,", "start": 579.84, "duration": 3.68}, {"text": "which means the random track removes all the simulation stuff I personally didn't enjoy,", "start": 583.52, "duration": 4.26}, {"text": "and presents a more arcade-like experience, which I actually think is pretty fun!", "start": 587.78, "duration": 4.46}, {"text": "Overall, this is the least random random mode we're gonna be talking about in this episode.", "start": 592.34, "duration": 4.28}, {"text": "It's not really randomly generating tracks as much as randomly assembling them through familiar chunks.", "start": 596.62, "duration": 4.94}, {"text": "I consistently saw the same type of setups over and over again.", "start": 601.58, "duration": 3.54}, {"text": "I started to notice that, for example, every time I picked a mountain track,", "start": 605.12, "duration": 3.5}, {"text": "I would usually get the bridge, the cave and/or the hairpin turns.", "start": 608.62, "duration": 3.8}, {"text": "This held true for other terrain styles,", "start": 612.46, "duration": 1.86}, {"text": "and it makes me think that while it might be using a similar system as F-Zero X,", "start": 614.32, "duration": 4.18}, {"text": "at least F-Zero X makes it an experience.", "start": 618.5, "duration": 2.54}, {"text": "Having this many choices literally makes it less random, which takes away a lot of the magic,", "start": 621.04, "duration": 5.18}, {"text": "and then it just kicks you out to the menu once the race is finished.", "start": 626.22, "duration": 3.26}, {"text": "Presentation-wise, it's about as barebones as possible.", "start": 629.5, "duration": 2.7}, {"text": "Overall, this is my favorite part of the game, but my least favorite random mode.", "start": 632.24, "duration": 4.58}, {"text": "Now don't get me wrong, it's still super cool this mode exists at all,", "start": 636.86, "duration": 3.3}, {"text": "and to be fair, unlike Excitebike 64, this can be played four-player splitscreen!", "start": 640.16, "duration": 4.46}, {"text": "But just like Excitebike 64, it is unlocked from the start,", "start": 644.8, "duration": 3.66}, {"text": "no matter what you read online.", "start": 648.54, "duration": 1.94}, {"text": "Alright, so far we've been talking about random generation,", "start": 650.74, "duration": 2.72}, {"text": "but we're gonna wrap up this episode with something slightly different:", "start": 653.46, "duration": 3.16}, {"text": "Our old friend, the port of Resident Evil 2 on N64 has an exclusive randomizer mode!", "start": 656.64, "duration": 6.34}, {"text": "We've already talked about how this is an amazing port in other videos,", "start": 663.0, "duration": 3.02}, {"text": "how it features all four Leon and Claire campaigns, complete with CG cutscenes,", "start": 666.06, "duration": 3.88}, {"text": "on one 64-megabyte cartridge, which is still impressive,", "start": 669.94, "duration": 3.64}, {"text": "despite the recent revelation that Resident Evil 2 could have fit on one 700-megabyte PlayStation disc.", "start": 673.58, "duration": 5.88}, {"text": "In any case, the randomizer mode in RE2 64", "start": 679.5, "duration": 3.1}, {"text": "is different from the modes in the other games we brought up earlier,", "start": 682.6, "duration": 2.7}, {"text": "because it's not creating new levels or environments, it's randomizing ammo and health items.", "start": 685.3, "duration": 5.5}, {"text": "There are some weird rules to this, and we had to test it a few times to understand the quirks of the system.", "start": 690.82, "duration": 5.12}, {"text": "It doesn't change the placement of key items, like keys, medallions and rubies and so-on,", "start": 696.02, "duration": 4.94}, {"text": "so you're still able to theoretically finish the game.", "start": 700.96, "duration": 2.66}, {"text": "Second, item locations don't change, for instance,", "start": 703.7, "duration": 3.12}, {"text": "there's always two items hidden behind the desk in the east office, but what items you find change.", "start": 706.82, "duration": 5.32}, {"text": "However, saving and loading didn't produce different items for a specific playthrough,", "start": 712.14, "duration": 4.22}, {"text": "so it looks like they're set when you start the game.", "start": 716.36, "duration": 2.34}, {"text": "Also, items don't start randomizing until the police station,", "start": 718.7, "duration": 2.92}, {"text": "and near as we can tell, ink ribbons don't get randomized either,", "start": 721.62, "duration": 3.14}, {"text": "which the designers probably did to ensure that the game wasn't too difficult.", "start": 724.76, "duration": 3.62}, {"text": "But once you get the keycard from Marvin, things start to get drastically different.", "start": 728.38, "duration": 4.16}, {"text": "Like the item found on the Licker room corpse, for example:", "start": 732.54, "duration": 3.16}, {"text": "In our first two playthroughs, we got two different amounts of handgun bullets,", "start": 735.7, "duration": 3.3}, {"text": "but on our third playthrough, we got flame rounds!", "start": 739.0, "duration": 2.54}, {"text": "Leon gets the small key in the interrogation room like normal,", "start": 741.58, "duration": 2.84}, {"text": "but one time for Claire it was an herb, and another it was 25 grenade rounds!", "start": 744.42, "duration": 5.68}, {"text": "One thing we did notice is that when you find ammo,", "start": 750.18, "duration": 2.22}, {"text": "you're usually given way more than you would normally find.", "start": 752.4, "duration": 2.92}, {"text": "Like... WAY more!", "start": 755.38, "duration": 1.88}, {"text": "We think that the mode has extra bullets added into it, again, to make it easier.", "start": 757.34, "duration": 4.46}, {"text": "For my first run, I got almost nothing but red herbs and magnum ammo,", "start": 761.88, "duration": 3.68}, {"text": "which are completely useless by themselves this early in the game,", "start": 765.56, "duration": 2.76}, {"text": "but things turned around, and by the time I got to the sewer I was drowning in shotgun shells!", "start": 768.32, "duration": 4.48}, {"text": "I was just shootin' everything for the hell of it! Like the spiders!", "start": 772.8, "duration": 2.6}, {"text": "I NEVER bother to kill the spiders, but hey, I got the extra ammo!", "start": 775.4, "duration": 3.52}, {"text": "Though things can get tense, this does make the randomizer mode kinda easy.", "start": 779.0, "duration": 4.22}, {"text": "This is very different from most fan-made randomizers", "start": 783.28, "duration": 2.9}, {"text": "which, while usually still completeable, can be absolutely brutal,", "start": 786.18, "duration": 3.78}, {"text": "like our editor Soberdwarf's playthrough of the Resident Evil Remake randomizer mod:", "start": 789.96, "duration": 4.22}, {"text": "SOBER: ... why was Barry...", "start": 795.34, "duration": 1.3}, {"text": "Why is Barry replaced by a Tyrant?!", "start": 796.7, "duration": 1.94}, {"text": "Why...?", "start": 799.62, "duration": 0.82}, {"text": "Alright, d- do I got-", "start": 800.64, "duration": 1.82}, {"text": "Oh gee, ow! C'mon...", "start": 802.94, "duration": 1.72}, {"text": "DEREK: RE2 64's randomizer mode is less of an extra challenge,", "start": 804.78, "duration": 3.74}, {"text": "and more of just a dumb, fun good time!", "start": 808.52, "duration": 2.26}, {"text": "Which hey, that's enough for us!", "start": 810.9, "duration": 1.3}, {"text": "And this may be the first time a randomizer ever appeared in a console game!", "start": 812.34, "duration": 5.32}, {"text": "The way you unlock it is you beat all four campaigns, and it's a shame it wasn't really advertised.", "start": 817.66, "duration": 4.84}, {"text": "It's not mentioned on the box, in the instructions, or even in the dang strategy guide!", "start": 822.58, "duration": 3.92}, {"text": "Why did no-one other than Top Gear Rally 2 think to advertise these awesome random modes?!", "start": 826.5, "duration": 5.34}, {"text": "But hey, it's awesome that they're there in the first place,", "start": 832.18, "duration": 2.16}, {"text": "and whether or not you knew about them... well now you definitely do!", "start": 834.34, "duration": 3.3}, {"text": "We appreciate our patrons for voting on this episode,", "start": 837.78, "duration": 2.78}, {"text": "look, I know I was a little grumpy throughout this episode,", "start": 840.56, "duration": 2.68}, {"text": "but we had a lot of fun makin' it, and I'd do it again!", "start": 843.26, "duration": 2.82}, {"text": "And you can join their ranks by joining our Patreon and helping support the channel,", "start": 846.08, "duration": 4.68}, {"text": "if you enjoyed the video, hey, also just give a like, give a comment...", "start": 850.86, "duration": 3.1}, {"text": "...smack the bell, I dunno, all that stuff,", "start": 854.16, "duration": 1.9}, {"text": "if you wanna see more ridiculous, amazing, fun games, subscribe to Stop Skeletons From Fighting!", "start": 856.14, "duration": 4.92}, {"text": "Thanks for watching, and we'll see you again real soon!", "start": 861.26, "duration": 2.3}]