[{"text": "This video was made possible by our supporters on Patreon. If you want to join the community and help us reach our next goal,", "start": 0.0, "duration": 5.31}, {"text": "consider making a pledge.", "start": 5.31, "duration": 2.0}, {"text": "The average lifespan of a soldier in Stalingrad was just", "start": 17.5, "duration": 3.139}, {"text": "24 hours.", "start": 20.92, "duration": 1.02}, {"text": "The battle for the city that bore Stalin's name was one of the longest and most arduous of the Second World War. It is for", "start": 21.94, "duration": 6.649}, {"text": "that reason that most historians regard the battle as a turning point in the war.", "start": 28.59, "duration": 3.959}, {"text": "I'm Griffin Johnson, the Armchair Historian, and today, in addition to telling you about the battle itself,", "start": 32.77, "duration": 5.389}, {"text": "I'll be providing the personal accounts of both Russian and German soldiers in an effort to tell you the story of Stalingrad.", "start": 38.16, "duration": 6.479}, {"text": "But first, today's video is sponsored by Skillshare. I know; it's like we're official now!", "start": 44.739, "duration": 4.43}, {"text": "Skillshare is a quickly expanding online learning community that boasts a wide array of classes on topics like design, photography,", "start": 50.199, "duration": 6.529}, {"text": "entrepreneurship, and far more. Signing up on Skillshare is free,", "start": 57.82, "duration": 3.05}, {"text": "but a premium membership provides full access to over", "start": 60.87, "duration": 2.609}, {"text": "20,000 classes taught by experts. The premium membership still makes Skillshare more affordable than most learning platforms out there. An", "start": 63.79, "duration": 6.86}, {"text": "annual subscription costs you less than $10/month. Stay until the end of the video for more information", "start": 71.17, "duration": 4.58}, {"text": "and an exclusive offer from the Skillshare team.", "start": 75.909, "duration": 2.78}, {"text": "It's November 1941. The Wehrmacht is just miles away from the Russian capital but is halted due to extreme weather conditions.", "start": 80.77, "duration": 7.459}, {"text": "The German infantry is plagued with frostbite while the tanks are running short on fuel,", "start": 89.2, "duration": 4.55}, {"text": "not that it matters because their engines won't even start; it's -4 deg F (-20 deg C).", "start": 94.03, "duration": 4.669}, {"text": "Meanwhile, in Moscow, a secret meeting is taking place, headed by Stalin himself, who refuses to leave the city and proclaims that", "start": 99.399, "duration": 7.16}, {"text": "\"Moscow will be defended to the last.\"", "start": 107.079, "duration": 2.0}, {"text": "At this meeting the top Soviet military brass is gathered to discuss the Red Army's next course of action.", "start": 109.479, "duration": 5.66}, {"text": "Amid an atmosphere of panic and uncertainty, Semyon Timoshenko, the People's Commissar of Defense, takes the podium.", "start": 115.57, "duration": 6.949}, {"text": "Timoshenko boldly proclaims:", "start": 123.039, "duration": 6.32}, {"text": "Hitler acknowledged the scarcity of oil himself, reportedly saying:", "start": 147.44, "duration": 7.94}, {"text": "Thus the decision was made by Hitler and his senior staff to divert the German Army Group South", "start": 155.9, "duration": 5.39}, {"text": "to secure both the Volga and the Caucasus.", "start": 161.39, "duration": 2.419}, {"text": "The plan would be called Case Blue (Fall Blau) and was meant to be a second blitzkrieg to break the stalemate of the Eastern Front.", "start": 164.42, "duration": 6.47}, {"text": "It called for the assembling of 1,300,000 men and", "start": 170.99, "duration": 3.83}, {"text": "1,500 aircraft.", "start": 175.79, "duration": 1.26}, {"text": "The men that made up Army Group South were split into two detachments:", "start": 177.05, "duration": 3.05}, {"text": "Army Group A, which would swing around the city of Stalingrad, secure the oil fields at Baku, and then converge on Stalingrad from", "start": 180.29, "duration": 7.849}, {"text": "the south; and Army Group B,", "start": 188.14, "duration": 1.63}, {"text": "which was made up of the German 6th Army, the 4th Panzer Army, and their Romanian and Italian allies, would march", "start": 189.77, "duration": 5.899}, {"text": "directly towards Stalingrad, the major Soviet industrial city. The Soviets had other plans.", "start": 195.92, "duration": 5.539}, {"text": "The oil fields of Maikop and Elista, which were on the way to Baku, were both set aflame by the Red Army.", "start": 201.88, "duration": 5.549}, {"text": "Grozny, meanwhile, also enroute to Baku, was destroyed by the German Air Force, or Luftwaffe,", "start": 208.01, "duration": 5.419}, {"text": "instead of being captured, due to the fierce Russian resistance and strained German supply lines.", "start": 213.769, "duration": 5.21}, {"text": "This meant that Army Group B would be taking on Stalingrad alone and would face severe logistical problems.", "start": 219.5, "duration": 5.75}, {"text": "Hitler's oil crisis persisted, but the Battle for Stalingrad was only just beginning. The German Army Group B,", "start": 225.709, "duration": 5.48}, {"text": "spearheaded by the 6th Army under General Paulus, met resistance from the Soviets near the Don River.", "start": 231.44, "duration": 4.94}, {"text": "It took nearly a month for the 6th Army to assert control over the area that lay west of Stalingrad.", "start": 236.72, "duration": 5.299}, {"text": "The campaign was already shaping up to be slightly more costly for the Germans than expected.", "start": 242.019, "duration": 4.8}, {"text": "However,\nmorale among the troops remained high as they waited for a victory and dreamt of either", "start": 246.85, "duration": 4.169}, {"text": "returning home or settling in Russian lands after the war ended.", "start": 251.12, "duration": 3.32}, {"text": "Wilhelm Hoffmann, a soldier at the time of the battle, wrote in his diary the following:", "start": 254.5, "duration": 4.049}, {"text": "If you haven't already, I suggest taking a look at my video which goes through the majority of Wilhelm's diary in Stalingrad.", "start": 269.15, "duration": 5.839}, {"text": "With the German advance delayed, Soviet military officials in Stalingrad, headed by Chuikov, had time to prepare for the desperate onslaught that was", "start": 276.04, "duration": 7.309}, {"text": "materializing. As Catherine Merridale relates it in her book:", "start": 283.57, "duration": 2.66}, {"text": "Citizens of Stalingrad would be forced to stay and face the battle ahead. There would be no retreat.", "start": 299.38, "duration": 4.85}, {"text": "The first direct attack on Stalingrad began on August 23rd.", "start": 304.81, "duration": 3.949}, {"text": "600 planes of the Luftwaffe flew over the city and relentlessly carpet-bombed its inhabitants.", "start": 309.25, "duration": 4.519}, {"text": "The German planes left decimation in their wake: 40,000 Russians, mainly civilians, were killed, and much of the city was reduced to rubble.", "start": 314.05, "duration": 7.519}, {"text": "Max Hastings, in his book describes the aftermath with haunting detail:", "start": 321.84, "duration": 3.75}, {"text": "The Soviet forces took up positions in the central and northern parts of Stalingrad. As the German 6th Army", "start": 352.57, "duration": 5.69}, {"text": "encircled the city, a Russian soldier named Anton Dragan documented what life was like for him as a lieutenant of the Red Army:", "start": 358.48, "duration": 6.529}, {"text": "Every inch of the city was disputed as the Germans were forced to make their way through the city house by house,", "start": 371.77, "duration": 5.239}, {"text": "stairwell by stairwell. The Russians were told to practically hug the German advance to render German aircraft and artillery support", "start": 377.35, "duration": 6.529}, {"text": "useless. The Luftwaffe", "start": 384.13, "duration": 1.5}, {"text": "maintained air superiority and continued carpet-bombing, killing Russians and Germans alike and preventing boats from bringing shipments of supplies", "start": 385.63, "duration": 7.28}, {"text": "to alleviate the defenders.", "start": 394.199, "duration": 1.08}, {"text": "It is in the midst of this scene of chaos that we return to Dragan, who describes the dire state of the Soviets' position:", "start": 395.279, "duration": 6.65}, {"text": "During this retreat to the inner city, the Soviets were aided by artillery that was tactically positioned on the Volga's eastern bank.", "start": 414.119, "duration": 6.14}, {"text": "The growing feeling of frustration on the German side is aptly captured by Hoffmann's entry on 22 September 1942:", "start": 420.33, "duration": 6.29}, {"text": "And on the Soviet side, Chuikov, the commander of the 62nd Army, who maintained rigid discipline, shed light on a more desperate state of affairs:", "start": 432.74, "duration": 6.389}, {"text": "Chuikov writes on another occasion: \"Everyone saw a man in flames leap out of his trench, run right up to a German tank, and smash a bottle against the grille", "start": 452.219, "duration": 6.02}, {"text": "of the engine hatch. A second later, an enormous sheet of flame and smoke", "start": 458.24, "duration": 3.539}, {"text": "engulfed both the tank and the hero who had destroyed it. Acts like this prompted the Germans to express", "start": 461.909, "duration": 5.36}, {"text": "disbelief, even in the air. A Luftwaffe pilot who had rained fire from the skies said:", "start": 467.43, "duration": 4.129}, {"text": "As the infamous Russian winter set in, the tide of battle turned. The Russians put Operation Uranus into action,", "start": 479.839, "duration": 7.71}, {"text": "planned by the Chief of the General Staff, Georgy Zhukov, and executed by a Polish-Soviet officer,", "start": 487.55, "duration": 5.25}, {"text": "Konstantin Rokossovsky. Their goal was to encircle the 6th Army and relieve", "start": 493.259, "duration": 4.13}, {"text": "Stalingrad's determined defenders. The operation began on 19 November 1942", "start": 497.519, "duration": 4.04}, {"text": "and involved more than a million Red Army soldiers. Only three days after the operation had begun, the 6th Army was completely", "start": 501.839, "duration": 6.95}, {"text": "encircled and trapped in the city that they had besieged.", "start": 509.129, "duration": 2.75}, {"text": "Hitler did not consider retreat an option, and he gave orders for the Germans to hold their ground. The Soviets also gained air superiority", "start": 512.159, "duration": 6.679}, {"text": "by producing large numbers of aircraft and positioning anti-aircraft guns that prevented the Luftwaffe from being able to airdrop supplies", "start": 519.0, "duration": 7.039}, {"text": "and evacuate men. One of the more notable Soviet aircraft", "start": 526.41, "duration": 2.54}, {"text": "Was the Il-2, a ground attacker which would pick up the nickname \"Flying Tank.\" If you're interested in learning more about this aircraft,", "start": 529.05, "duration": 7.04}, {"text": "check out the video by my friend Tiberiu over on the YouTube channel", "start": 536.16, "duration": 3.319}, {"text": "Wartime History. This put an end to any hope of Axis victory. Now", "start": 539.85, "duration": 3.83}, {"text": "it was only a matter of time before the Soviets", "start": 543.68, "duration": 2.04}, {"text": "overwhelmed the German forces. Under General Paulus, the 6th Army and its allies held out until January", "start": 545.88, "duration": 5.0}, {"text": "before finally giving in. Although Paulus did not agree with Hitler's orders and considered defying them,", "start": 551.31, "duration": 5.299}, {"text": "he did not attempt to break out, largely for fear of leaving other elements of the Wehrmacht", "start": 556.61, "duration": 4.5}, {"text": "in the clutches of the Red Army.", "start": 561.29, "duration": 1.53}, {"text": "When the Soviets finally overran the Germans and drove them out of their dugouts,", "start": 562.82, "duration": 3.39}, {"text": "It seemed to some that the battle had been \"the same nightmare for everyone.\" However:", "start": 566.21, "duration": 7.109}, {"text": "Although many historians attribute the German failure at Stalingrad solely to poor logistics and planning, the Soviets'", "start": 583.5, "duration": 6.41}, {"text": "unwavering defense of the city was also a crucial factor in determining the outcome", "start": 590.04, "duration": 3.74}, {"text": "of the battle which would shape the rest of the war. In accordance with order #227, made famous for its line,", "start": 593.88, "duration": 6.32}, {"text": "\"not one step back,\" the Red Army had withstood the German onslaught. From that point on, the Soviets would remain on a near-constant", "start": 600.2, "duration": 6.119}, {"text": "offensive, pushing the Germans back to Berlin by", "start": 606.63, "duration": 2.21}, {"text": "1945. Now back to our sponsor, Skillshare. I personally have been using my membership to browse classes like", "start": 609.24, "duration": 6.08}, {"text": "Online Business Crash Course by value Academy and", "start": 615.54, "duration": 2.9}, {"text": "Learn a Language the Easy Way by Philippa Gillström.", "start": 618.69, "duration": 2.539}, {"text": "If you're interested in checking out Skillshare, the link in the description below grants the first", "start": 621.23, "duration": 3.96}, {"text": "500 people two months of a premium membership for free. So click that link now to get your free two months.", "start": 625.71, "duration": 5.149}, {"text": "Thanks for watching. I'd like to thank my General Staff on Patreon: Jake Hart, John Graham, James Thompson, Derek Below, Azarde,", "start": 631.5, "duration": 6.77}, {"text": "Jim Talbott, Dmitry Stillermann, Jeff Antolak, GJ, Ben Natividad,", "start": 638.34, "duration": 4.459}, {"text": "Joe Crispin, Emmanuel Kang, and everyone else listed onscreen.", "start": 642.87, "duration": 3.979}, {"text": "I'd also like to thank those working on the Armchair History team for making this video possible.", "start": 646.86, "duration": 3.83}, {"text": "Thanks again, and I'll see you next time with a video on the Second Sino-Japanese war.", "start": 651.24, "duration": 3.89}]