[{"text": "Any Apple diehard will tell you that some things just cannot be expressed on a spec sheet.", "start": 0.02, "duration": 5.72}, {"text": "These \"Je ne sais quoi\" of", "start": 6.32, "duration": 2.44}, {"text": "usability or", "start": 8.94, "duration": 1.18}, {"text": "industrial design can elevate the experience of using an object.", "start": 10.14, "duration": 4.86}, {"text": "Be it a phone or a pair of premium toenail clippers from merely practical to...", "start": 15.42, "duration": 5.76}, {"text": "...ethereal, but at what cost?", "start": 21.18, "duration": 3.24}, {"text": "Well it turns out the answer is", "start": 24.94, "duration": 2.0}, {"text": "$2,500", "start": 27.2, "duration": 1.52}, {"text": "Introducing the Book One from Porsche Design.", "start": 28.72, "duration": 3.22}, {"text": "A laptop designed to get your motor running", "start": 32.32, "duration": 3.16}, {"text": "And I'll tell you about it right after we keep the LTT motor running with this message from ZOTAC.", "start": 36.38, "duration": 4.26}, {"text": "ZOTAC's ZBOX PCs are great for applications like streaming and gaming", "start": 41.1, "duration": 5.3}, {"text": "They feature Intel 7th Generation core processors in tiny form factors.", "start": 46.54, "duration": 4.4}, {"text": "Check them out at the link below.", "start": 50.94, "duration": 1.66}, {"text": "Okay, so the industrial design is pretty impressive.", "start": 61.98, "duration": 3.92}, {"text": "It's got a matte anodized aluminum chassis with soft campers and polished edges", "start": 66.54, "duration": 5.16}, {"text": "And all 1580 grams of it looks and feels", "start": 71.72, "duration": 3.98}, {"text": "amazing when closed with a hinge design that is", "start": 75.7, "duration": 3.46}, {"text": "subjectively anyway among the best that we've seen on a 2 in 1.", "start": 79.52, "duration": 4.04}, {"text": "It's got just the right amount of resistance and goes all the way around", "start": 83.82, "duration": 4.54}, {"text": "without requiring you to take the screen off first or", "start": 88.36, "duration": 3.48}, {"text": "Leaving a weird gap like the Microsoft Surface Book does.", "start": 91.88, "duration": 3.34}, {"text": "By the way, Porsche Designs claims that the hinge design was", "start": 95.88, "duration": 4.06}, {"text": "inspired by the gearbox of a sports car.", "start": 99.96, "duration": 3.1}, {"text": "But I think it's just as likely that the marketing department thought of that after the fact.", "start": 104.0, "duration": 4.28}, {"text": "Anywho, that's not the only trick up it's sleeve.", "start": 108.3, "duration": 3.42}, {"text": "Like the Surface Book, and incidentally the Starship Enterprise,", "start": 111.72, "duration": 3.74}, {"text": "Book One can also be separated from its base", "start": 115.46, "duration": 2.62}, {"text": "entirely and used as a tablet by holding down the eject button on the side and pulling it apart.", "start": 118.08, "duration": 5.82}, {"text": "A process that is slightly less jank than the Surface Book.", "start": 123.92, "duration": 3.5}, {"text": "The 13.3 inch 16:9 screen is actually pretty nice with a", "start": 127.42, "duration": 4.2}, {"text": "3200 by 1800 QHD+ resolution and 10-point multi-touch along with support for the", "start": 131.62, "duration": 6.42}, {"text": "4096 Pressure Level Book One Pen by Wacom that looks as the rest of the product,", "start": 138.04, "duration": 7.96}, {"text": "and that can apparently run for eight months", "start": 146.02, "duration": 2.98}, {"text": "off of it's fun-sized AAAA battery.", "start": 149.0, "duration": 2.72}, {"text": "The I/O is probably best described as thoughtful", "start": 152.48, "duration": 4.0}, {"text": "I mean there isn't a ton of it, but it's really well placed.", "start": 156.48, "duration": 4.16}, {"text": "The base has a USB C port that lets the book one charge in just two hours,", "start": 160.64, "duration": 4.7}, {"text": "then two more USB 3.0 ports for regular stuff and a microSD slot for expansion.", "start": 165.34, "duration": 6.8}, {"text": "Then the tablet portion has a very welcome Thunderbolt 3 port,", "start": 172.14, "duration": 4.84}, {"text": "A 5 megapixel camera with IR for Windows Hello", "start": 176.98, "duration": 3.62}, {"text": "And a headphone jack that doesn't leave the cord", "start": 180.6, "duration": 3.58}, {"text": "floating in the air, like Microsoft's design.", "start": 184.2, "duration": 2.78}, {"text": "So, as advertised it's all pretty in premium, right?", "start": 186.98, "duration": 5.58}, {"text": "Well not so fast.", "start": 192.56, "duration": 1.18}, {"text": "We did find a few skid marks on this road", "start": 193.74, "duration": 3.52}, {"text": "While the keyboard is easy to type on, the key caps are smaller than the keys on the Surface Book", "start": 197.26, "duration": 5.66}, {"text": "Because the gaps between the keys aren't as finely milled", "start": 202.92, "duration": 3.72}, {"text": "meaning that you have a little bit less keyboard in the same footprint.", "start": 206.64, "duration": 4.58}, {"text": "The keys themselves also seem to have", "start": 211.26, "duration": 2.88}, {"text": "A bit of a resistance right at the top of the stroke that puts", "start": 214.14, "duration": 4.36}, {"text": "the typing experience a bit on the fatiguing side if you have dainty fingers like I do.", "start": 218.5, "duration": 5.34}, {"text": "As for the Microsoft precision certified touchpad, well,", "start": 224.56, "duration": 3.0}, {"text": "It's big, works beautifully and actually handles very similarly to the one on the Surface Book.", "start": 227.56, "duration": 5.74}, {"text": "Except that on the Porsche Designs it makes this noise that", "start": 234.06, "duration": 4.52}, {"text": "Well, I don't know let us know what you guys think", "start": 238.6, "duration": 3.18}, {"text": "Finally, the suspension is a little looser than I'd prefer,", "start": 242.92, "duration": 4.14}, {"text": "the screen has enough bezel that you'd think it has like an extra touch bar on it or something and", "start": 247.06, "duration": 5.32}, {"text": "Because of the way the hinge is designed, the detached tablet has asymmetrical corners.", "start": 252.38, "duration": 5.06}, {"text": "Now this stuff may sound pretty nitpicky.", "start": 257.44, "duration": 3.14}, {"text": "But this is the kind of scrutiny that you expose yourself to when you charge a premium for your premium design", "start": 260.58, "duration": 6.54}, {"text": "So should you buy this notebook?", "start": 268.22, "duration": 2.32}, {"text": "Maybe.", "start": 270.54, "duration": 1.24}, {"text": "But not before we take a pit stop to talk about the internals.", "start": 271.78, "duration": 3.88}, {"text": "The Book One had really good specs when it launched.", "start": 275.66, "duration": 3.04}, {"text": "But that was back in April, and yes, I know we're like way late on this thing", "start": 278.7, "duration": 4.7}, {"text": "But, we wanted to check it out anyway because it's cool.", "start": 283.4, "duration": 3.06}, {"text": "The point though is that that was before Ryzen Mobile, moball..?", "start": 287.2, "duration": 4.58}, {"text": "Or, Coffee Lake were things that existed.", "start": 292.28, "duration": 2.82}, {"text": "As it is today, everything but the dual-core CPU holds up pretty well.", "start": 295.38, "duration": 5.58}, {"text": "And thermals are pretty good as a half hour of stress testing in AIDA64", "start": 301.48, "duration": 5.0}, {"text": "Never made her throttle and noise wise, she never stood out against our offices HVAC.", "start": 306.48, "duration": 5.24}, {"text": "But, you might have noticed that I never specified what graphics card is inside and that is because", "start": 312.64, "duration": 5.82}, {"text": "There's no discreet graphics.", "start": 319.12, "duration": 2.2}, {"text": "So no, you won't be able to play Mankind Divided at 1080p even on low settings.", "start": 321.32, "duration": 6.06}, {"text": "Making it kind of hard to recommend the book one since the new Surface Book 2", "start": 327.38, "duration": 6.34}, {"text": "has an 8th Gen Core i7 Processor and a GTX 1050 for about the same price, back to whether to buy them", "start": 333.74, "duration": 7.58}, {"text": "I'm the kind of person who would prefer a graphics card to a sexy hinge and a sexy design.", "start": 341.32, "duration": 6.98}, {"text": "But, Porsche Designs clearly believes that there is more to the device", "start": 348.94, "duration": 4.94}, {"text": "experience than raw horsepower, and we'd love to hear from you guys in the comments below.", "start": 353.88, "duration": 5.72}, {"text": "Which one would you lean towards?", "start": 359.6, "duration": 2.26}, {"text": "AIAIAI's Modular TMA-2 headphones system is going wireless!", "start": 362.4, "duration": 5.72}, {"text": "They're launching the HO5, their new wireless, Bluetooth pair of headphones.", "start": 368.12, "duration": 6.62}, {"text": "Now the TMA-2 features more than a thousand possible configurations meaning that", "start": 374.74, "duration": 4.92}, {"text": "you can create your own personalized product that fits your specific needs", "start": 379.66, "duration": 3.98}, {"text": "while being able to change individual parts along the way.", "start": 383.64, "duration": 4.08}, {"text": "Now existing TMA-2 users...", "start": 387.72, "duration": 2.34}, {"text": "You guys are actually really gonna love this because", "start": 390.06, "duration": 3.34}, {"text": "you are not left out in the cold, you can upgrade to wireless while keeping your original sound preferences.", "start": 393.42, "duration": 6.62}, {"text": "So check it out now through the link in the video description.", "start": 400.46, "duration": 4.04}, {"text": "Say goodbye to headphone obsolescence.", "start": 404.5, "duration": 2.68}, {"text": "So thanks for watching guys if you disliked this video you can hit that button", "start": 408.37, "duration": 3.109}, {"text": "but if you liked it hit like", "start": 411.479, "duration": 1.271}, {"text": "Get subscribed maybe consider checking out where to buy the stuff. We featured at the link in the video description", "start": 412.75, "duration": 5.47}, {"text": "Also down there, We've got our merch store, which has cool shirts like this one as well as our community forum", "start": 418.26, "duration": 4.7}, {"text": "Which you should totally join.", "start": 422.969, "duration": 2.0}]