[{"text": "The Nintendo 64 launched in Japan and North America a few months apart from each other,", "start": 0.18, "duration": 4.42}, {"text": "however, they both had same launch title lineup:", "start": 4.6, "duration": 3.24}, {"text": "Mario 64 and Pilotwings 64 came out day-and-date with the system,", "start": 8.0, "duration": 3.74}, {"text": "and shortly after came Wave Race 64.", "start": 11.78, "duration": 2.12}, {"text": "It was a sparse catalog of games in the system's earliest days,", "start": 13.9, "duration": 3.52}, {"text": "but still, what a solid trio, especially Mario and Wave Race, which became big hits for Nintendo!", "start": 17.54, "duration": 5.7}, {"text": "But what if I told you that these two legendary N64 games got fancy re-releases in Japan only?", "start": 23.24, "duration": 6.96}, {"text": "Maybe you've heard of the Shindou versions of Mario and Wave Race 64.", "start": 30.2, "duration": 3.68}, {"text": "On the surface, they were simply the exact same games, except with Rumble Pak support added,", "start": 33.88, "duration": 4.82}, {"text": "but a deeper dive shows Nintendo did a lot more than just add vibration.", "start": 38.7, "duration": 4.68}, {"text": "And even though they're not very well remembered,", "start": 43.54, "duration": 2.14}, {"text": "these versions had a greater impact on the legacy of these two games than you may realize.", "start": 45.76, "duration": 5.08}, {"text": "Which is pretty impressive for a couple of Japanese-only re-releases, right?", "start": 50.94, "duration": 3.74}, {"text": "Also, a quick shout-out to NordVPN,", "start": 54.76, "duration": 2.5}, {"text": "they can protect YOU from being tracked online,", "start": 57.26, "duration": 3.02}, {"text": "save 66% off a two-year plan when you go to nordvpn.com/stopskeletons", "start": 60.28, "duration": 5.74}, {"text": "and use the offer code 'Stopskeletons', that's 66% off", "start": 66.02, "duration": 3.22}, {"text": "using the offer code 'Stopskeletons' at nordvpn.com/stopskeletons", "start": 69.28, "duration": 4.6}, {"text": "And now... let's get ready to rumble!", "start": 73.88, "duration": 2.28}, {"text": "The Shindou versions of Mario and Wave Race - literally \"Shindō Pak Taiō\" versions -", "start": 83.32, "duration": 5.42}, {"text": "were sold on their compatibility with the N64 Rumble Pak.", "start": 88.74, "duration": 3.6}, {"text": "Rumble, or haptic feedback, is so commonplace now", "start": 92.44, "duration": 3.34}, {"text": "that it's hard to remember a time when vibrating controllers were a big deal.", "start": 95.78, "duration": 3.86}, {"text": "The technology has existed in arcades from as far back as at least 1976,", "start": 99.66, "duration": 4.78}, {"text": "in Sega's motorcycle arcade game Fonz.", "start": 104.44, "duration": 2.64}, {"text": "But it made its big console debut with Star Fox 64,", "start": 107.12, "duration": 3.6}, {"text": "which original copies came packed with the N64 Rumble Pak.", "start": 110.72, "duration": 3.5}, {"text": "It marked an industry turning point...", "start": 114.22, "duration": 1.72}, {"text": "\"しびれる!\"", "start": 116.04, "duration": 1.56}, {"text": "... and from here, vibrating controllers would become the norm.", "start": 117.62, "duration": 3.24}, {"text": "It's hard to say if Nintendo were the first to think of putting rumble feedback into console controllers,", "start": 120.94, "duration": 4.9}, {"text": "but they WERE the first to market.", "start": 125.84, "duration": 2.04}, {"text": "Though this wasn't without setbacks:", "start": 127.88, "duration": 1.66}, {"text": "To run at full capacity, the Rumble Pak requires two AAA batteries,", "start": 129.54, "duration": 3.84}, {"text": "which adds quite a bit of weight to the controller.", "start": 133.38, "duration": 2.5}, {"text": "We weighed it: The Rumble Pak itself weighs half as much as the controller,", "start": 136.0, "duration": 3.8}, {"text": "plus the way it sits on the back end does make the controller noticeably heavier.", "start": 139.8, "duration": 4.34}, {"text": "On top of that, the N64 controller only has one slot,", "start": 144.14, "duration": 3.92}, {"text": "meaning that if games support rumble but didn't have battery-backed saves to the cart,", "start": 148.06, "duration": 4.52}, {"text": "(which, by the way, most games didn't)", "start": 152.58, "duration": 1.96}, {"text": "you'd have to swap out the Rumble Pak to save your game, then swap it back.", "start": 154.54, "duration": 3.12}, {"text": "Just because you're first doesn't always mean you're best.", "start": 157.78, "duration": 2.58}, {"text": "The PS1 would release its Dual Shock controllers a year later,", "start": 160.48, "duration": 3.24}, {"text": "and the Dreamcast rumble packs worked similarly, but did not require batteries.", "start": 163.72, "duration": 3.86}, {"text": "Fun fact though: The N64 Rumble Pak was a specific technology that Nintendo patented in 1995.", "start": 167.74, "duration": 6.0}, {"text": "Sony and Microsoft, on the other hand, might have rushed their controllers out too quickly,", "start": 173.74, "duration": 4.52}, {"text": "and had to deal with patent infringement lawsuits that cost them tens of millions of dollars.", "start": 178.26, "duration": 4.28}, {"text": "Nintendo to this day continues to be a pioneer of rumble technology with HD rumble on the Switch...", "start": 182.54, "duration": 5.66}, {"text": "... not that anyone probably cares.", "start": 188.3, "duration": 1.68}, {"text": "But bringing it back, the Rumble Pak was unleashed upon gamers with Star Fox 64's 1997 launch,", "start": 190.14, "duration": 6.0}, {"text": "and while it was a huge hit for Nintendo of America, it actually underperformed in Japan!", "start": 196.14, "duration": 4.64}, {"text": "Maybe Nintendo of Japan thought they needed a little more juice to help push the Rumble Pak,", "start": 204.96, "duration": 4.36}, {"text": "which explains the surprisingly elaborate ad campaign behind the Shindou re-releases.", "start": 209.32, "duration": 5.38}, {"text": "You see, these Rumble Pak re-releases of Mario and Wave Race 64", "start": 214.72, "duration": 3.74}, {"text": "were planned to be sold at full price: 6,800 yen, which is about 70 bucks.", "start": 218.46, "duration": 5.84}, {"text": "Seriously, that's already a bit of a hard sell for two games", "start": 224.4, "duration": 3.58}, {"text": "Japanese N64 owners probably definitely already owned!", "start": 227.98, "duration": 3.58}, {"text": "So they brought in rising teen idol Ryoko Hirosue, who actually was already in their Star Fox 64 commercial.", "start": 231.62, "duration": 6.56}, {"text": "I guess that makes her Nintendo's Rumble Girl.", "start": 238.2, "duration": 2.26}, {"text": "\"し~び~れ~る~~!\"", "start": 240.48, "duration": 3.28}, {"text": "Not only that, but the games were slated to be released on July 17th,", "start": 243.76, "duration": 4.04}, {"text": "which also happens to be Hirosue's 17th birthday.", "start": 247.8, "duration": 3.52}, {"text": "As if targeting golden birthdays wasn't enough,", "start": 251.32, "duration": 2.76}, {"text": "copies of these games were apparently sold with a hand fan that had Hirosue's face on it.", "start": 254.08, "duration": 5.14}, {"text": "I'm not sure this ever happened, actually, I couldn't find any pictures online,", "start": 259.3, "duration": 3.8}, {"text": "and the complete copies we have don't include it.", "start": 263.1, "duration": 2.34}, {"text": "And listen, you might have forgotten or never known about these re-releases,", "start": 265.5, "duration": 3.18}, {"text": "but Nintendo really swung for the fences here!", "start": 268.68, "duration": 2.54}, {"text": "They must be something really special, right?", "start": 271.22, "duration": 1.98}, {"text": "Welp, let's see what the rest of the world was missing out on!", "start": 273.2, "duration": 2.88}, {"text": "First up: Mario 64.", "start": 276.2, "duration": 2.06}, {"text": "Now, to really get your head around the changes made in the Shindou version,", "start": 278.26, "duration": 3.58}, {"text": "we first have to start with the two other versions:", "start": 281.84, "duration": 2.4}, {"text": "The original, vanilla Japanese version, and the North American version,", "start": 284.24, "duration": 3.38}, {"text": "released in June '96 and September '96, respectively.", "start": 287.62, "duration": 3.22}, {"text": "They were only released a few months apart,", "start": 290.84, "duration": 1.82}, {"text": "but it was enough for these versions to be quite different from each other!", "start": 292.66, "duration": 3.32}, {"text": "From layout differences, like this star which is in a box in international versions,", "start": 295.98, "duration": 4.34}, {"text": "to much less voice acting: In the vanilla Japanese release, Peach's letter doesn't have voiceover,", "start": 300.32, "duration": 5.34}, {"text": "and there's also a serious shortage of Mario too,", "start": 305.66, "duration": 2.92}, {"text": "just a lot less voicework that is actually noticeable right from startup.", "start": 308.58, "duration": 3.9}, {"text": "[Peach definitely not reading her letter aloud]", "start": 312.6, "duration": 4.76}, {"text": "It's also missing one of the greatest voice clips of all time:", "start": 317.48, "duration": 3.36}, {"text": "But that's because he's Koopa, not Bowser, in Japan... anyway.", "start": 322.68, "duration": 2.82}, {"text": "Of course, you can also expect a lot of glitches from a game", "start": 325.64, "duration": 2.68}, {"text": "that essentially created the blueprint for how the industry would conquer the third dimension.", "start": 328.32, "duration": 4.56}, {"text": "Mario 64 is well known for its glitches, but the Japanese version is a little more glitchy than others,", "start": 332.94, "duration": 5.44}, {"text": "like Bowser's key changing into a star in this cutscene, or a glitch that happens when you get over 1000 coins...", "start": 338.38, "duration": 5.22}, {"text": "... just to name a couple!", "start": 343.76, "duration": 1.96}, {"text": "The Shindou version came out about ten months after the North American version,", "start": 345.96, "duration": 4.06}, {"text": "and Nintendo definitely took advantage of that time!", "start": 350.02, "duration": 2.62}, {"text": "If you think of the North American version as a second revision, the Shindou is like a third revision.", "start": 352.64, "duration": 4.8}, {"text": "But we should probably start with the rumble features first, since that's the reason these exist, right?", "start": 357.6, "duration": 4.62}, {"text": "The first thing I noticed is that the vibration is shockingly active in the menu!", "start": 362.34, "duration": 4.64}, {"text": "Like, it's almost a jump scare!", "start": 367.04, "duration": 1.52}, {"text": "Hitting Start, checking scores, adjusting audio, it just assaults you with vibration!", "start": 368.56, "duration": 4.02}, {"text": "Dude! Chill out!", "start": 372.58, "duration": 1.3}, {"text": "Once you get into the game though, it makes more sense,", "start": 374.02, "duration": 2.14}, {"text": "with vibrations activating when landing a jump, butt-stomping or hitting walls or blocks.", "start": 376.16, "duration": 4.7}, {"text": "It's functionally the same as Mario's next mainline game, Mario Sunshine,", "start": 380.86, "duration": 4.48}, {"text": "so I guess check that out if you wanna get a better idea of how this version works.", "start": 385.34, "duration": 3.56}, {"text": "It doesn't add much, but it's pretty cool!", "start": 388.94, "duration": 2.3}, {"text": "In terms of other features, there's this fun gag when you press Z on startup.", "start": 391.38, "duration": 4.2}, {"text": "Get a load of this! This is the most Marios I've seen since Space World 2000!", "start": 395.76, "duration": 4.04}, {"text": "This is often referred to as an Easter egg, and I guess it technically is,", "start": 400.12, "duration": 3.44}, {"text": "but it's actually mentioned in the instruction book, so it's not THAT big of a secret.", "start": 403.56, "duration": 3.68}, {"text": "It also features most of the voicework that was missing from the vanilla Japanese version...", "start": 407.38, "duration": 4.2}, {"text": "MARIO: \"Okie dokie!\"", "start": 411.58, "duration": 1.32}, {"text": "PEACH: \"Dear Mario. Please come to the castle. I have baked a cake for you.\"", "start": 413.48, "duration": 3.78}, {"text": "\"Yours truly, Princess Toadstool. - Peach\"", "start": 417.42, "duration": 2.94}, {"text": "Like I said, this is basically a revision of the North American version,", "start": 420.36, "duration": 3.58}, {"text": "meaning it has all the fixes from the vanilla Japanse version, plus some other fixes that...", "start": 423.94, "duration": 5.74}, {"text": "... make the Shindou version basically the Greedo Shot First of Mario 64.", "start": 430.02, "duration": 4.56}, {"text": "Before I get ahead of myself, these problematic changes will only impact two specific groups:", "start": 435.4, "duration": 5.74}, {"text": "Hardcore fans, and speedrunners.", "start": 441.22, "duration": 1.82}, {"text": "Most people could still play Mario 64 Shindou and enjoy what the rumble function has to offer.", "start": 443.04, "duration": 4.92}, {"text": "However, this version has mysteriously increased load times.", "start": 447.96, "duration": 3.78}, {"text": "In just a cursory look at our footage, load times doubled", "start": 451.74, "duration": 2.9}, {"text": "and sometimes tripled for entering the castle or starting a level.", "start": 454.64, "duration": 3.44}, {"text": "It's still only fractions of a second, I didn't notice it myself before counting frames in the footage,", "start": 458.08, "duration": 4.88}, {"text": "but for speedrunners, that adds up!", "start": 462.96, "duration": 2.02}, {"text": "They also changed some of Mario's behavior,", "start": 465.06, "duration": 2.42}, {"text": "like making it so he always faces the screen after grabbing onto a tree or pole,", "start": 467.48, "duration": 4.12}, {"text": "but the biggest change is that Nintendo took out the Backwards Long Jump.", "start": 471.6, "duration": 4.38}, {"text": "This is pretty significant, since the Backwards Long Jump is an essential part of Mario 64 speedrunning", "start": 476.18, "duration": 5.96}, {"text": "that allows you to skip huge sections of the game.", "start": 482.14, "duration": 2.6}, {"text": "By this measure, because the rumble doesn't really add that much,", "start": 484.78, "duration": 3.5}, {"text": "it's in fact a worse version of the game.", "start": 488.44, "duration": 2.82}, {"text": "Perhaps surprisingly, the legacy of the Mario 64 Shindou version would live way past its 1997 release:", "start": 491.56, "duration": 7.26}, {"text": "It was the version ported to the Chinese-only iQue in 2003,", "start": 498.82, "duration": 4.08}, {"text": "and, by the way, if you didn't know, the iQue was a console made partially by Nintendo", "start": 502.9, "duration": 4.4}, {"text": "to get around the Chinese government's increasing restrictions on games,", "start": 507.3, "duration": 3.66}, {"text": "and the games were digital-only as a way to fight China's legendary bootleg market.", "start": 510.96, "duration": 4.86}, {"text": "Really fascinating stuff, but let's move on to the next year:", "start": 515.88, "duration": 2.46}, {"text": "In 2004, where Mario 64 launched with another system: The DS.", "start": 518.34, "duration": 5.12}, {"text": "Super Mario 64 DS is not based specifically off of the Shindou version, as it is a pretty substantial remake,", "start": 523.54, "duration": 7.04}, {"text": "but I thought I'd point out a couple of key things:", "start": 530.58, "duration": 2.2}, {"text": "Similarly to the Shindou version, it also excludes the Backwards Long Jump,", "start": 532.78, "duration": 4.4}, {"text": "which is kind of unfortunate, in my opinion.", "start": 537.18, "duration": 2.0}, {"text": "However, unlike the Shindou version, it does NOT have rumble support,", "start": 539.18, "duration": 4.2}, {"text": "even though the DS had its own Rumble Pak!", "start": 543.38, "duration": 2.68}, {"text": "Though to be fair, the DS' Rumble Pak was bundled with Metroid Pinball,", "start": 546.12, "duration": 3.68}, {"text": "and didn't launch for a full year after the DS' release.", "start": 549.8, "duration": 3.02}, {"text": "And you'd be forgiven if you didn't know or forgot that the DS and DS Lite had Rumble Paks.", "start": 552.82, "duration": 5.32}, {"text": "In contrast to the N64, very few games actually support it,", "start": 558.14, "duration": 3.78}, {"text": "but going into this video, I thought for sure it would have been among the few,", "start": 561.92, "duration": 3.62}, {"text": "and was a little surprised to see that it doesn't.", "start": 565.54, "duration": 2.52}, {"text": "From here, Mario 64 would see re-release in a new format:", "start": 568.06, "duration": 3.74}, {"text": "As a digital download via Virtual Console!", "start": 571.86, "duration": 2.44}, {"text": "I was kinda surprised to see that all of the Japanese Virtual Console versions of Mario 64", "start": 574.3, "duration": 4.84}, {"text": "are based off of the Shindou version, while the rest of the world got their respective international versions.", "start": 579.14, "duration": 4.74}, {"text": "And y'know, I'm actually not sure if the Japanese Virtual Console releases even included the actual rumble,", "start": 583.88, "duration": 5.92}, {"text": "and there's reason to suspect that it didn't!", "start": 589.8, "duration": 2.68}, {"text": "For example, Star Fox 64, which is THE rumble game,", "start": 592.52, "duration": 3.48}, {"text": "didn't have vibration support in the Wii Virtual Console version,", "start": 596.0, "duration": 2.88}, {"text": "though it DID in the Wii U Virtual Console version.", "start": 598.88, "duration": 2.94}, {"text": "What's wild to me is that vanilla Mario 64 was a huge hit in Japan, right, selling millions of copies.", "start": 603.08, "duration": 6.48}, {"text": "However, this revision that released a year later, that probably only a tiny fraction ever actually played,", "start": 609.66, "duration": 5.94}, {"text": "became the canonical version for Japan, but not the rest of the world,", "start": 615.74, "duration": 4.5}, {"text": "like \"This is the definitive Mario 64!\" says Nintendo,", "start": 620.24, "duration": 2.72}, {"text": "but not definitive enough for the rest of the world,", "start": 622.96, "duration": 2.48}, {"text": "\"and you Japanese players that grew up playing the vanilla version...\"", "start": 625.44, "duration": 2.68}, {"text": "\"... nah, that one doesn't count anymore!\"", "start": 628.32, "duration": 1.48}, {"text": "I mean, for such an important game like Mario 64...", "start": 629.8, "duration": 4.22}, {"text": "... it's kinda baffling!", "start": 634.48, "duration": 1.7}, {"text": "Where does that leave our other Shindou game?", "start": 636.48, "duration": 2.0}, {"text": "Well, for starters, Wave Race 64's legacy is far less complicated than Mario 64's.", "start": 638.48, "duration": 5.52}, {"text": "There are far fewer differences between the vanilla Japanese and North American versions.", "start": 644.0, "duration": 3.94}, {"text": "Most of the changes are more like presentational differences:", "start": 647.94, "duration": 2.74}, {"text": "The billboard advertisements in races are changed,", "start": 650.68, "duration": 2.22}, {"text": "a few voice clips have been re-recorded,", "start": 652.92, "duration": 2.28}, {"text": "they changed a few course names, like from Sandy Beach to Sunny Beach...", "start": 655.24, "duration": 3.72}, {"text": "... most of these can be chalked up to standard localization changes,", "start": 659.12, "duration": 3.22}, {"text": "so, before we even get into the Shindou versions,", "start": 662.34, "duration": 2.32}, {"text": "there wasn't much for Nintendo to \"fix\" with Wave Race in the first place,", "start": 664.66, "duration": 4.0}, {"text": "but there are still some significant differences.", "start": 668.66, "duration": 2.66}, {"text": "First off, the rumble feels way more natural than Mario 64, which isn't surprising, really.", "start": 671.54, "duration": 5.38}, {"text": "You feel the vibration initially as you accelerate,", "start": 677.02, "duration": 2.4}, {"text": "and once you reach top gear, it reacts as your craft impacts against the waves.", "start": 679.42, "duration": 4.32}, {"text": "It's pretty similar to how the vibration feels in the GameCube sequel Wave Race: Blue Storm.", "start": 683.74, "duration": 4.54}, {"text": "And it's great! It's a shame Pilotwings and Mario Kart 64 didn't get the same re-release treatment.", "start": 688.36, "duration": 5.22}, {"text": "But anyway, I wouldn't say it's an essential feature,", "start": 693.58, "duration": 2.66}, {"text": "but it DOES make an already-great game just that much better!", "start": 696.24, "duration": 3.88}, {"text": "In terms of other features, Wave Race 64 Shindou has some pretty substantial additions.", "start": 700.26, "duration": 4.92}, {"text": "All the voice clips changed for the North American version are as they appeared in the vanilla Japanese version,", "start": 705.18, "duration": 5.26}, {"text": "however, and this is totally anecdotal,", "start": 710.46, "duration": 2.32}, {"text": "I feel like the audio mix or master was tweaked for this version and made louder overall.", "start": 712.94, "duration": 5.02}, {"text": "Like the entire soundtrack, all the audio, just sounds a little louder.", "start": 718.02, "duration": 3.34}, {"text": "It's been often misreported that the title screen voice is different in the Shindou version,", "start": 726.24, "duration": 4.66}, {"text": "but that's how it sounded in the vanilla Japanese release.", "start": 730.9, "duration": 2.84}, {"text": "It's actually the non-Japanese versions that are different! Go figure.", "start": 733.8, "duration": 4.1}, {"text": "We also noticed slightly faster load times, but only very slightly faster.", "start": 738.22, "duration": 4.28}, {"text": "As you can see, they definitely aren't as big of a difference as in Mario 64.", "start": 742.5, "duration": 3.96}, {"text": "Another big difference is the inclusion of time trial ghosts.", "start": 746.54, "duration": 3.48}, {"text": "This was similarly seen in Mario Kart 64, however instead of transparent racers,", "start": 750.02, "duration": 4.88}, {"text": "your times are represented as cute dolphin buddies!", "start": 754.9, "duration": 3.1}, {"text": "Also similarly to Mario Kart, you can only save two,", "start": 758.08, "duration": 3.34}, {"text": "and they require such an incredible amount of memory space", "start": 761.42, "duration": 2.96}, {"text": "that you have to pull out the Rumble Pak and save it on a Controller Pak,", "start": 764.38, "duration": 3.04}, {"text": "but look! It's dolphin buddies!", "start": 767.42, "duration": 1.86}, {"text": "The third significant change is music:", "start": 769.28, "duration": 2.62}, {"text": "Wave Race Shindou's soundtrack features three songs that have been altered.", "start": 771.96, "duration": 4.22}, {"text": "Now, as far as I'm concerned, Wave Race 64 is one of the greatest video game soundtracks of all time,", "start": 776.18, "duration": 6.02}, {"text": "and, by the way, is one of the few games composed by Kazumi Totaka", "start": 782.2, "duration": 3.48}, {"text": "that doesn't appear to include the Totaka song.", "start": 785.68, "duration": 2.64}, {"text": "But anyway, the idea that you'd mess with perfection and alter songs was insane to me!", "start": 788.32, "duration": 6.34}, {"text": "But, I have to say, I think these alterations do almost uniformly improve the soundtrack!", "start": 794.72, "duration": 5.98}, {"text": "The first altered song is the theme to Sunny/Sandy Beach:", "start": 800.7, "duration": 3.94}, {"text": "The Shindou version has an entirely new and slightly longer intro,", "start": 804.64, "duration": 3.74}, {"text": "features guitar on the main melody instead of the synth piano tone, and is in a different key.", "start": 808.42, "duration": 5.02}, {"text": "Now, I'm torn on how I feel about this one.", "start": 813.44, "duration": 2.88}, {"text": "On its own, I don't mind it, but the guitar tone brings a more intense vibe", "start": 816.32, "duration": 4.28}, {"text": "which clashes a bit with the game's first proper race, and easiest track.", "start": 820.6, "duration": 4.46}, {"text": "The Port Blue / Port Pirates stage is another remixed song", "start": 825.2, "duration": 3.64}, {"text": "that, again, features more guitar and less synth piano,", "start": 828.84, "duration": 3.1}, {"text": "plus a rewritten section before the song loops that makes it a few seconds longer.", "start": 831.94, "duration": 4.18}, {"text": "Honestly, I'm pretty neutral on this one.", "start": 836.16, "duration": 2.38}, {"text": "It's a testament to its quality that I, like a lot of people, didn't even notice the difference.", "start": 838.66, "duration": 5.2}, {"text": "But put them side-by-side, and you can't miss it,", "start": 843.86, "duration": 2.22}, {"text": "but it's still... a minimal difference.", "start": 846.08, "duration": 2.36}, {"text": "The best change is the final track of the game, Southern Island.", "start": 848.44, "duration": 3.62}, {"text": "A pretty significant change here, again, a different key, more guitar, and a slight change to the main melody.", "start": 852.06, "duration": 5.8}, {"text": "Overall, I think this is a large improvement!", "start": 858.0, "duration": 2.58}, {"text": "Like the altered version of Sandy Beach, it's more intense,", "start": 860.58, "duration": 3.12}, {"text": "which is fitting for the last race in the game.", "start": 863.7, "duration": 3.0}, {"text": "As a huge fan of the music in this game, I was pleasantly surprised by these new versions!", "start": 866.96, "duration": 5.52}, {"text": "In terms of its legacy though, Wave Race 64 Shindou is pretty similar to Mario 64:", "start": 872.56, "duration": 6.16}, {"text": "This was the version ported to the iQue, and for its Virtual Console releases,", "start": 878.72, "duration": 4.56}, {"text": "most regions got their respective non-Shindou versions.", "start": 883.28, "duration": 3.18}, {"text": "Though some did have some additional advertisements changed.", "start": 886.46, "duration": 3.02}, {"text": "Nothing major, but since they were already tinkering with it to change some JPEGs,", "start": 889.48, "duration": 4.12}, {"text": "kinda wish they'd switched out the songs as well?", "start": 893.6, "duration": 2.18}, {"text": "As for Japan, as you can see from this commercial for the Wii U Virtual Console,", "start": 895.78, "duration": 3.56}, {"text": "the Japanese Virtual Console releases of Wave Race 64 are the Shindou versions,", "start": 899.34, "duration": 4.52}, {"text": "and while this isn't as weird to me as the case with Mario 64,", "start": 903.86, "duration": 3.92}, {"text": "I do think everyone outside of Japan missed out on a better version of Wave Race 64!", "start": 907.78, "duration": 5.32}, {"text": "Though at the end of the day, I don't think the rest of the world was worse off without the Shindou versions.", "start": 913.1, "duration": 5.64}, {"text": "I think that content-wise, the North American Mario 64 is probably the best version,", "start": 918.84, "duration": 4.68}, {"text": "based on the fact that there's more content and still enough fun glitches for superfans!", "start": 923.52, "duration": 4.5}, {"text": "Going by speedrun.com's current charts, the vanilla Japanese version is overall faster,", "start": 928.1, "duration": 5.04}, {"text": "though the North American version is on top for some runs!", "start": 933.14, "duration": 2.6}, {"text": "And yeah, I do think we technically got a worse version of Wave Race 64,", "start": 935.74, "duration": 4.82}, {"text": "but I'm definitely not saying that the non-Shindou versions are bad,", "start": 940.56, "duration": 3.12}, {"text": "unless you're talkin' about the PAL version, and then...", "start": 943.68, "duration": 2.38}, {"text": "... yeah, you hate to see that happen.", "start": 946.1, "duration": 2.24}, {"text": "We'd like to thank N64th Street for letting us borrow their pristine boxed copies of these games.", "start": 949.04, "duration": 6.72}, {"text": "Having the physical games and instructions here helped a lot with researching some of the more granular trivia.", "start": 955.76, "duration": 5.38}, {"text": "What do YOU want us to cover next? Let us know in the comments below,", "start": 961.14, "duration": 4.0}, {"text": "and also, tell your friends about this show, and consider supporting Stop Skeletons From Fighting on Patreon,", "start": 965.14, "duration": 5.04}, {"text": "and making some new friends, like all of these awesome people right here!", "start": 970.26, "duration": 4.5}, {"text": "That's enough rumbling for one video, so...", "start": 975.02, "duration": 3.2}, {"text": "... till next time, we'll see you again real soon.", "start": 978.48, "duration": 2.48}]