[{"text": "Hi, I like to make a Van De Graaff machine to make super high voltages", "start": 0.0, "duration": 4.38}, {"text": "This machine is invented by Robert J. Van De Graaff and works based on Triboelectric Effect", "start": 4.38, "duration": 5.849}, {"text": "Which is basically if two certain different material rub against each other", "start": 10.23, "duration": 4.05}, {"text": "They become electrically charged one of the two materials", "start": 14.28, "duration": 2.609}, {"text": "Pulls electrons from the other one and becomes negative leaving the other one positive", "start": 17.35, "duration": 4.069}, {"text": "Like when I rub towel against PVC pipe in my previous video", "start": 21.55, "duration": 3.739}, {"text": "In Van de Graaff machine, there is a belt that rotates very fast and constantly rubs against some rod and becomes charged", "start": 26.47, "duration": 6.89}, {"text": "My belt is one of those workout elastic bands", "start": 33.37, "duration": 3.02}, {"text": "**Mehdi doing workout**", "start": 36.8, "duration": 1.59}, {"text": "The PVC pipe turns negative and the belt turns positive", "start": 39.399, "duration": 3.53}, {"text": "If I rotate the belt like this, the rubbing action will charge the belt and the pipe", "start": 43.42, "duration": 4.549}, {"text": "This is a Leyden jar I made which is basically a capacitor as I explained in my previous video", "start": 48.1, "duration": 4.639}, {"text": "I taped a wire to the center contact with its strands poking out like that", "start": 52.739, "duration": 5.16}, {"text": "And I also taped a bunch of strands to the outer contact of the capacitor", "start": 57.94, "duration": 4.88}, {"text": "Now if I move the belt like this beside these wires it simply charges the capacitor", "start": 62.82, "duration": 4.199}, {"text": "See, when the neutral belt passes over the PVC pipe", "start": 67.6, "duration": 3.11}, {"text": "It leaves its electron on the PVC and turns", "start": 70.71, "duration": 2.909}, {"text": "positive going down. The electrons on the PVC pipe are picked up by this wire and charged the center of the capacitor negative which repels", "start": 73.78, "duration": 7.699}, {"text": "The electrons on the outer surface of the bottle and when I turn the belt the positive charges on the belt pick up those electrons", "start": 81.479, "duration": 7.349}, {"text": "coming from the outer surface and the belt becomes neutral and the outer surface of the capacitor becomes positive and the cycle continues", "start": 89.29, "duration": 7.279}, {"text": "Maybe you hear the charges going into the capacitor", "start": 97.99, "duration": 2.239}, {"text": "And if I do this multiple times", "start": 102.009, "duration": 2.0}, {"text": "And try to discharge the capacitor", "start": 105.759, "duration": 2.63}, {"text": "There it was charged and this is pretty much how Van de Graaff machine works", "start": 110.109, "duration": 4.31}, {"text": "Let's make one", "start": 114.42, "duration": 1.0}, {"text": "And another school wins the tool giveaway and there is another Keysight school giveaway at the end of the video", "start": 115.42, "duration": 6.139}, {"text": "I bought a bunch of PVC pipes and fittings to put this together", "start": 121.56, "duration": 3.809}, {"text": "Making the rotating part of the machine was a bit tricky", "start": 125.56, "duration": 2.569}, {"text": "See, I had the DC motor from my old drill and I took some parts from it to make this section and the DC motor", "start": 128.14, "duration": 6.349}, {"text": "Directly couples here and the belt goes around it and turns. Cuts the excess width of the belt", "start": 134.68, "duration": 7.76}, {"text": "Damn it. Why is it so hard to cut?", "start": 144.22, "duration": 2.0}, {"text": "finally", "start": 147.22, "duration": 1.349}, {"text": "Now I cut the stationary part of the PVC from a thicker pipe", "start": 148.569, "duration": 4.639}, {"text": "Now I put that piece in the belt and stretch the belt a little bit and attach it around here", "start": 154.84, "duration": 6.86}, {"text": "**BLEEP**", "start": 164.58, "duration": 0.5}, {"text": "I shouldn't have glued it, see, the stupid glue settles quick and I don't have time to make it straight. Damn it", "start": 165.08, "duration": 7.44}, {"text": "A bit shorter, well, it's okay. I'll glue it afterwards", "start": 174.14, "duration": 3.02}, {"text": "So here's what I've made so far", "start": 178.14, "duration": 1.76}, {"text": "My belt goes around that fixed PVC pipe on top", "start": 179.9, "duration": 3.36}, {"text": "Which is held by a piece of wood and some screws and the roller on the bottom", "start": 183.26, "duration": 4.199}, {"text": "and if I turn the roller it turns I didn't make the belt too tight either because I was afraid that the friction between the", "start": 187.47, "duration": 6.11}, {"text": "Belt and the top fixed PVC might hurt them in the long run now", "start": 193.58, "duration": 3.69}, {"text": "I want to see if I can charge my Leyden jar with it", "start": 197.27, "duration": 2.129}, {"text": "So I'm gonna place the jar beside it like this and turn the belt", "start": 199.4, "duration": 3.94}, {"text": "Also I have a wire from the outer surface beside the center contact with a gap", "start": 203.44, "duration": 4.4}, {"text": "So if it is charged enough there should be an arc between them", "start": 207.86, "duration": 3.15}, {"text": "Okay, let's do it", "start": 212.1, "duration": 2.0}, {"text": "It does get charged", "start": 220.08, "duration": 2.0}, {"text": "There you go, but I think with this set up is only charging to a limited voltage, so let's just continue building the whole Van de Graaff", "start": 223.89, "duration": 7.099}, {"text": "Now that my tower is almost done I was thinking of using aluminum foil to create those charge pick up brushes", "start": 251.79, "duration": 6.229}, {"text": "But then I realize something these aluminum foil cutting sharp edges should make the best brush", "start": 258.019, "duration": 5.01}, {"text": "so I'm gonna cut this I'll cut these and glue them on some ice cream sticks for support and when you glue this on the", "start": 263.03, "duration": 6.809}, {"text": "piece of wood make sure that these sharp edges are on the", "start": 269.84, "duration": 2.88}, {"text": "Inside of the wood edge so that they won't touch any moving parts and scratch them", "start": 272.789, "duration": 4.52}, {"text": "then we can drill a hole in these brushes, past seven wire through the hole and tighten it", "start": 277.309, "duration": 5.391}, {"text": "And even solder the wire so it won't come out later something like this", "start": 283.1, "duration": 4.04}, {"text": "Aagh, the more I'm running this belt the more it's developing a problem", "start": 287.3, "duration": 3.8}, {"text": "See, the PVC is getting darker and it's covered with some sort of", "start": 291.1, "duration": 4.42}, {"text": "Brownish goo that I can't clean up, But the goo is kind of sticky and results in the belt not being able to", "start": 296.01, "duration": 7.19}, {"text": "rotate freely", "start": 304.14, "duration": 1.92}, {"text": "and I have to change this belt  I'm", "start": 306.06, "duration": 2.18}, {"text": "Thinking if I could change if it's like a towel or a fabric it would be nice", "start": 308.64, "duration": 3.77}, {"text": "I just saw a video from DIY. Tryin who made a Van de Graaff machine using pantyhose as belt", "start": 312.41, "duration": 5.819}, {"text": "That sounds like a good idea. Let's give it a try. Aagh, where does she keep her pantyhoses?", "start": 318.229, "duration": 4.791}, {"text": "I made this too permanent. I don't want to cut the belt", "start": 323.88, "duration": 2.32}, {"text": "There", "start": 339.26, "duration": 2.0}, {"text": "Now I will just do some pantyhose fitting", "start": 341.52, "duration": 2.45}, {"text": "I also put the pantyhose around the bottom roller to like the guy did in his video. It has a few benefits", "start": 343.97, "duration": 5.47}, {"text": "It increases the friction and prevents the belt to be torn apart by the sharp edges and things", "start": 349.5, "duration": 5.57}, {"text": "The belt was shifting when rotating so I just glued a bump on the side to stop it from shifting", "start": 366.889, "duration": 4.91}, {"text": "It should be good now. Let's see", "start": 371.839, "duration": 2.0}, {"text": "There you go, but the real question is can it make static electricity?", "start": 375.38, "duration": 6.12}, {"text": "Oh, there we go", "start": 383.66, "duration": 1.2}, {"text": "Very good. Had to make a special brush for the topside roller. So here's how I did it for the bottom brush", "start": 385.309, "duration": 7.271}, {"text": "I use the same thing I made from the aluminum foil box, but for the top side I had to make this", "start": 392.589, "duration": 6.27}, {"text": "Special brush because you know, the belt is kind of bumpy and keeps jumping up and down", "start": 399.529, "duration": 4.55}, {"text": "And I needed this brush to be flexible to accommodate that now for the top of the Van de Graaff machine", "start": 404.149, "duration": 4.85}, {"text": "I have these two perfectly round IKEA bowls that you can find under the Van de Graaff section", "start": 408.999, "duration": 5.49}, {"text": "I have to cut one of them open with my side grinder", "start": 414.52, "duration": 2.94}, {"text": "**Electrocute rocking**", "start": 420.18, "duration": 1.76}, {"text": "Aw, my ears", "start": 427.64, "duration": 2.0}, {"text": "I have to get rid of all these sharp edges, otherwise the charges will run away from them", "start": 430.22, "duration": 4.13}, {"text": "You know, I have this aluminum tape that's gonna help me cover the sharp edges of this thing", "start": 434.63, "duration": 4.94}, {"text": "I'm gonna cover it with electric tape too for added insulation. Now to attach the two bowls", "start": 440.12, "duration": 5.809}, {"text": "I'm gonna use a thin strip of aluminum tape and tape them together. This should get rid of the edge between the two balls to", "start": 445.929, "duration": 6.951}, {"text": "There, and now I want to further cover it with electric tape", "start": 455.28, "duration": 3.28}, {"text": "The last thing I want is for my precious charges to find a way and run away. There. Hopefully, it's good", "start": 458.56, "duration": 6.72}, {"text": "You remember the piece of Bowl I cut using the aluminum tape", "start": 465.35, "duration": 3.739}, {"text": "I will tape the top brush wire to my bowl", "start": 469.09, "duration": 5.19}, {"text": "And then glue it on top right here", "start": 475.28, "duration": 2.779}, {"text": "Why did I put that piece on top you ask, because now I can simply put this bowl right on top", "start": 478.13, "duration": 5.239}, {"text": "And I'm done", "start": 484.16, "duration": 0.89}, {"text": "I'm gonna run the motor from my power supply so that I can adjust the belt speed the way I want and", "start": 485.05, "duration": 5.369}, {"text": "For the belt brush down there", "start": 490.49, "duration": 2.029}, {"text": "I can connect the wire either to earth or my body or any other", "start": 492.52, "duration": 3.39}, {"text": "conductor like this and these two will pick up", "start": 496.22, "duration": 2.779}, {"text": "opposing charges and can arc to each other now the downside of this is that my entire room is now covered in dust and", "start": 499.12, "duration": 6.62}, {"text": "garbage and  **BLEEP**", "start": 505.82, "duration": 1.89}, {"text": "Who's gonna clean all this? Now It may look like that", "start": 507.71, "duration": 2.77}, {"text": "It took me five minutes to put this together because I'm wearing the same shirt", "start": 510.49, "duration": 3.27}, {"text": "But the fact is that it took me a whole week to put this together", "start": 513.76, "duration": 3.149}, {"text": "So you better like, share, subs...  After running it for a while. My pantyhose got caught in a crack and was torn apart", "start": 516.909, "duration": 6.299}, {"text": "Thanks a lot DIY trying", "start": 523.599, "duration": 2.0}, {"text": "I have to go back to using my belt, it took a long time", "start": 526.13, "duration": 3.229}, {"text": "Foohwow, I hope you appreciate my sacrifice for consistency what I'm trying to do is that instead of a fixed PVC pipe on the top", "start": 531.23, "duration": 7.67}, {"text": "I'm making a rotating one by putting a pipe here and then this guy can just rotate around it", "start": 538.9, "duration": 6.62}, {"text": "There will be much less rubbing between the PVC and the belt but I'm still hoping that it makes decent static electricity", "start": 545.8, "duration": 6.28}, {"text": "Okay", "start": 552.64, "duration": 0.5}, {"text": "Well, let's give it a try", "start": 555.52, "duration": 2.0}, {"text": "It's actually better than the, ouch, pantyhose", "start": 560.98, "duration": 2.84}, {"text": "Aagh!", "start": 565.22, "duration": 0.5}, {"text": "This is shaving the shit out of my PVC pipe", "start": 565.94, "duration": 2.0}, {"text": "This is driving me crazy. This took me six hours to make, it better work", "start": 569.32, "duration": 6.04}, {"text": "Oh yeah!", "start": 577.54, "duration": 0.56}, {"text": "It barely makes any static electricity now", "start": 579.96, "duration": 2.64}, {"text": "This whole business of PVC pipe and pantyhose and rubber belt is quite temporary", "start": 585.66, "duration": 4.42}, {"text": "I will just swich back to pantyhose and make sure it doesn't get cut and **BLEEP**", "start": 590.44, "duration": 3.32}, {"text": "Now this is a pantyhose protector", "start": 594.4, "duration": 2.42}, {"text": "And I'm gonna make a ground ball by taping two more IKEA bowls together and tape a wire to it and just mount it on", "start": 597.13, "duration": 6.26}, {"text": "a PVC pipe", "start": 603.39, "duration": 2.0}, {"text": "And here's our ground ball and finally it's done what time is it", "start": 612.529, "duration": 4.169}, {"text": "Yeah, it took me around a week and a half", "start": 617.399, "duration": 2.179}, {"text": "Well, it seems to be working fine just at the motor is a bit too noisy", "start": 620.669, "duration": 3.65}, {"text": "And I have a feeling my rubber band was creating more static electricity and the pantyhose will probably wear out soon.", "start": 624.319, "duration": 7.679}, {"text": "I don't know why I'm following that guy", "start": 633.329, "duration": 2.0}, {"text": "recipe using a pantyhose. Why didn't I use some stronger fabric like", "start": 636.509, "duration": 4.609}, {"text": "Like a legging, back to my wife's drawer", "start": 642.089, "duration": 3.529}, {"text": "Here I found this legging with a much stronger fabric and stretchy too, good to make a belt. Let's see how much electricity it makes", "start": 645.619, "duration": 7.049}, {"text": "Hey, not bad, you hear that", "start": 654.72, "duration": 2.0}, {"text": "**BLEEP**", "start": 668.1, "duration": 0.5}, {"text": "It's electricity is now like half the pantyhose", "start": 668.88, "duration": 3.2}, {"text": "Well now it's quite a solid belt, but I think it's combination with the top roller PVC doesn't generate enough static electricity", "start": 672.329, "duration": 7.529}, {"text": "I think I have to change it to something like acrylic glass or something", "start": 679.859, "duration": 3.6}, {"text": "For now, I guess I'm stuck with the pantyhose", "start": 683.98, "duration": 3.26}, {"text": "Now I'd like to try and remove the aluminum tape I put there, I'm thinking maybe it's sharp edges are making it worse", "start": 687.24, "duration": 5.16}, {"text": "I think the aluminum cave had actually made it a bit better. Whatever. I'm done", "start": 694.82, "duration": 3.92}, {"text": "You thought the video was finished, didn't you?", "start": 699.96, "duration": 2.06}, {"text": "You can stop watching if you want but I'm gonna continue on till I get some large manly sparks, you know", "start": 702.02, "duration": 5.26}, {"text": "some people like to buy large cars, I like my arcs large", "start": 707.28, "duration": 3.899}, {"text": "I don't like how sharp these edges are even with the aluminum tape", "start": 711.179, "duration": 3.27}, {"text": "I think a lot of charges might be running away from these so I'm gonna hot glue a piece of wire around these edges", "start": 714.449, "duration": 6.869}, {"text": "The wire is to keep a round shape and then I'm gonna put aluminum tape around it nice and round", "start": 723.279, "duration": 7.459}, {"text": "There I'm hoping that such curvy edge would be much better than the sharp edges before", "start": 732.549, "duration": 4.429}, {"text": "well, it doesn't look like a bit stronger than before I", "start": 737.56, "duration": 3.1}, {"text": "I guess the next step is to find a different material for the top roller to make more static electricity", "start": 741.42, "duration": 6.68}, {"text": "Looking at the triboelectric series table", "start": 748.86, "duration": 3.2}, {"text": "that lists a bunch of different material depending on how they like to get charged from all the way positives all the way negative", "start": 752.12, "duration": 5.7}, {"text": "shows that cotton which is 95% of this belt doesn't like to get charged and the", "start": 757.959, "duration": 5.089}, {"text": "combination of nylon pantyhose close to maximum positive and", "start": 763.18, "duration": 3.38}, {"text": "PVC closed maximum negative is actually a very good combination and the size of arcs shown by DIY tryin proves that fact", "start": 766.72, "duration": 7.46}, {"text": "So there must be something else you might design that's sucking away", "start": 776.16, "duration": 2.72}, {"text": "the charges one thing I can think of is the huge **BLEEP* size of this hole I made at the bottom for experiment,", "start": 778.88, "duration": 5.76}, {"text": "let me close it with some aluminum tape, although it doesn't quite get rid of the sharp edges", "start": 784.64, "duration": 4.38}, {"text": "Yeah", "start": 790.36, "duration": 1.08}, {"text": "Not any significant difference. I think I should have designed the whole small from the beginning", "start": 791.44, "duration": 4.7}, {"text": "I'm gonna try one last idea before I completely give up to my smaller arcs", "start": 796.33, "duration": 4.309}, {"text": "I'm gonna change this top PVC with a much thicker one to increase the friction surface area and hopefully make much more static electricity", "start": 800.64, "duration": 6.989}, {"text": "And I'll probably increase the number of these brushes too to pick up as much charge as possible", "start": 807.88, "duration": 4.88}, {"text": "And I had to buy 10 foot of these PVC pipe because I only needed three inches", "start": 812.92, "duration": 4.52}, {"text": "So at the end of the video I'll give away", "start": 817.44, "duration": 2.28}, {"text": "117 inches of...   No, this is what I made. A bigger PVC pipe, a new brush here", "start": 820.22, "duration": 5.36}, {"text": "This is the original brush and a new brush and this side", "start": 825.66, "duration": 3.5}, {"text": "Agh...", "start": 830.5, "duration": 0.5}, {"text": "Seems like with just original brush it was doing fine", "start": 831.06, "duration": 2.98}, {"text": "Actually the PVC pipe made the biggest difference", "start": 834.85, "duration": 2.389}, {"text": "Adding the new brushes didn't make much of a difference or in case of this one", "start": 837.34, "duration": 4.309}, {"text": "It actually made it a bit worse, maybe because it's pointing outside the hole and the charges are running away", "start": 841.65, "duration": 4.979}, {"text": "Yeah, I think the bigger PVC be the original brush is doing just fine", "start": 847.72, "duration": 3.739}, {"text": "now for the last thing to try I covered all the sharp edges in multiple layers of", "start": 852.85, "duration": 4.699}, {"text": "electric tape and see how far the arcs jump now", "start": 857.86, "duration": 3.05}, {"text": "It jumps from all the way back here. Of course, we don't quite see them because they're long distance ones are weaker", "start": 864.14, "duration": 5.789}, {"text": "but if I get close", "start": 869.94, "duration": 2.0}, {"text": "They are pretty strong now", "start": 872.24, "duration": 2.0}, {"text": "Yeah, I think this is a success. But wait! There is something else", "start": 875.78, "duration": 4.42}, {"text": "I just added this brush right at the bottom of the belt and it", "start": 880.22, "duration": 5.64}, {"text": "Significantly increases the chance of finding a mate. I mean picking up the all the charges", "start": 886.1, "duration": 4.66}, {"text": "Look at this now, so much power. Ow, ow", "start": 892.34, "duration": 3.92}, {"text": "I can really go back to making out full video now", "start": 897.8, "duration": 4.3}, {"text": "one school called", "start": 906.18, "duration": 1.98}, {"text": "Gymnasium Matija Mesić in Croatia wins one Keysight scope", "start": 908.16, "duration": 4.28}, {"text": "Thanks to Keysight and a whole bunch of optical and magnetic lab components purchased by the support of my patrons at patreon.com", "start": 912.44, "duration": 7.16}, {"text": "It's a gymnasium. Why do they need a scope?", "start": 919.68, "duration": 2.599}, {"text": "Hmm, make sure to enter your school from the link in the description if it needs a tool and thanks to Keysight", "start": 922.38, "duration": 5.63}, {"text": "I'll giveaway another one of these babies which is a hundred megahertz two channel scope with the built-in 20 megahertz", "start": 928.01, "duration": 6.69}, {"text": "Function generator if you could see response analyzer", "start": 935.22, "duration": 3.18}, {"text": "Frequency counter the digital voltmeter. To my patrons and viewers", "start": 939.5, "duration": 4.7}, {"text": "So either become a patron to support my channel and thr school giveaways and for this or just enter the draw from the link in", "start": 944.2, "duration": 6.66}, {"text": "the description. Good luck!", "start": 950.86, "duration": 2.0}, {"text": "**UNIBROW DANCE**", "start": 953.08, "duration": 3.64}]