[{"text": ">> community transcription <<\nThis episode of modern rogue is brought to you by Square Space.", "start": 0.2, "duration": 1.76}, {"text": "Head on over to squarespace.com/rogue sign up for your free trial when you do check out", "start": 1.96, "duration": 2.98}, {"text": "Use promo code \"Rogue\" and get ten percent off, that's a bargain!", "start": 4.98, "duration": 4.32}, {"text": "and thats foreshadowing. No I did fine, I got it right (Unintelligible noises) No no no", "start": 9.3, "duration": 4.58}, {"text": "Brian do you know how batteries generate power?", "start": 13.88, "duration": 2.06}, {"text": "Yes, because I wish it.", "start": 16.12, "duration": 1.94}, {"text": "Oh good! Is it your midichlorians? Is that what it is?  I dont know, why'd you have to make this a racist thing?", "start": 18.06, "duration": 6.16}, {"text": "Okay, so in all seriousness how do you know, absent a battery charger whether or not the batteries worth a damn?", "start": 27.16, "duration": 6.46}, {"text": "You drop it. Wait you just drop it? And then thats it? Exactly, you can based on its bounce, tell if its been discharged to a certain point.", "start": 33.82, "duration": 7.56}, {"text": "Okay now I saw this animated gif of a battery dropping, and everyone's like \"Erh its clearly dead\" or whatever, is that for reals?", "start": 41.7, "duration": 7.0}, {"text": "Is there a chemical reason for that? There is zinc in here. its more of a gel at first, and as it becomes discharged it starts to turn into a ceramic.", "start": 48.7, "duration": 8.02}, {"text": "This is like the whole thing about telling a hard boiled egg, from a raw egg.  Its like you spin the raw egg, and it sorta like lazily", "start": 56.76, "duration": 7.0}, {"text": "flops around, because there is this liquid inside. Where as a hard boiled egg will spin around super fast.", "start": 63.76, "duration": 4.78}, {"text": "I havent considered that, but I imagine there are some parallels. Yeah yeah yeah, so when its a gel, what is what? What makes a battery,", "start": 68.54, "duration": 5.74}, {"text": "Well you got your zinc in there, you have your magnesium dioxide. Theres a anode and a cathode,", "start": 74.28, "duration": 5.08}, {"text": "Woah woah woah professor! What is an Anode and a Cathode?", "start": 79.36, "duration": 3.1}, {"text": "Okay one of them negatively charged and one of them is positively charged.", "start": 82.46, "duration": 2.46}, {"text": "Okay got it. Once you connect the two they start circulating in  the air and it starts to turn the zinc into zinc oxide.", "start": 84.92, "duration": 7.72}, {"text": "Okay so the fresh battery is more gel? Or more ceramic? Its more gel. more gel, so fresh batteries are more gel", "start": 92.64, "duration": 5.82}, {"text": "Which I would imagine if you were to spin it, it would slow down faster, and I would imagine, I am just guessing here", "start": 98.46, "duration": 7.24}, {"text": "But if you dropped it on a hard surface a fresh battery would not bounce? You are correct. Good good good. As it turns into Zinc oxide", "start": 105.72, "duration": 6.74}, {"text": "all of the gel turns into ceramic with springy little links, a bouncy lattice work. It becomes a super ball. In fact a lot of the patents for golf balls include Zinc Oxide", "start": 112.46, "duration": 11.88}, {"text": "To give it more bounce. Thats amazing! A lot of people actually believe that batteries only bounce when they are completely drained.", "start": 124.44, "duration": 5.42}, {"text": "But the study from Princeton showed that thats not the case. They actually start bouncing at about 50% of their drain.", "start": 129.98, "duration": 7.0}, {"text": "For the record, how cool is it that Princeton is spending money to find this stuff out for us, that is amazing.", "start": 137.1, "duration": 5.18}, {"text": "Alright so we got two batteries, is it just as simple as just dropping it on the concrete?", "start": 142.28, "duration": 3.36}, {"text": "It is. You have to have the right surface.", "start": 145.72, "duration": 2.72}, {"text": "This table for instance, is a little to bouncy, it has to much give.", "start": 148.44, "duration": 2.52}, {"text": "Lets test it on a hard surface.", "start": 151.08, "duration": 1.86}, {"text": "(Screeching of tables)", "start": 152.94, "duration": 1.74}, {"text": "Alright, so one of these is allegedly 100% fully charged, the other is completely dead, completely drained.", "start": 154.68, "duration": 6.58}, {"text": "I drained it myself, Pinky promise.", "start": 161.26, "duration": 2.5}, {"text": "Okay what does that mean, you drained it yourself? You dont need to know. Okay fine", "start": 163.76, "duration": 2.36}, {"text": "So dead batteries bounce, live batteries not so much . Exactly", "start": 166.12, "duration": 3.96}, {"text": "Okay here we go. 3. 2. 1.", "start": 170.08, "duration": 3.04}, {"text": "Okay so I dont know if, that was a big bounce or a small bounce.", "start": 173.3, "duration": 2.22}, {"text": "Its going to be relative right?", "start": 175.52, "duration": 1.78}, {"text": "I mean its like I, I dont know.", "start": 177.48, "duration": 2.32}, {"text": "Try the other one, you will see. Holy cow! Are you kidding me?  1... 2... 3", "start": 180.02, "duration": 8.12}, {"text": "Wow! That is dramatic", "start": 190.72, "duration": 1.62}, {"text": "Markedly different, and it works doubles a's, triple a's, C cells, D cells, and 9 volts.", "start": 192.34, "duration": 4.7}, {"text": "This is fantastic, okay so it seems like it doesn't identify a dead battery  because anything under 50% will bounce.", "start": 197.04, "duration": 6.36}, {"text": "But, it does confirm a good battery.", "start": 203.4, "duration": 2.4}, {"text": "Correct, and again it is not a linear relationship, it could be 50% or 40% or even dead. Anything under 50% is gonna bounce.", "start": 205.8, "duration": 8.2}, {"text": "Got it, so if it bounce, smoke dead ounce, if its flat put it in your marksmen.", "start": 214.0, "duration": 7.68}, {"text": "Oh no, this one! Marksmen? what the hell are you talking about?", "start": 221.68, "duration": 7.18}, {"text": "Alright Brian can you tell everyone all of the reasons why they should use SquareSpace?", "start": 228.86, "duration": 5.54}, {"text": "Course I can, why wouldnt I be able to?", "start": 234.4, "duration": 0.9}, {"text": "Are you sure about that?", "start": 235.3, "duration": 2.1}, {"text": "Okay yep, this is a bad idea... bad idea, this is a bad idea.", "start": 237.64, "duration": 4.48}, {"text": "Be good at your job.", "start": 242.12, "duration": 1.28}, {"text": "I am not gonna mess up a single time.", "start": 243.4, "duration": 1.52}, {"text": "Hello everyone! I am here to talk to you about Square Space, whats great about Square Space?", "start": 244.92, "duration": 3.6}, {"text": "Not only are they super fast to set up, but your templates look absolutely incredible.", "start": 249.12, "duration": 5.36}, {"text": "Designed by award winning professionals, the folks who-  Oh my God no no no *Hysterical screaming*", "start": 254.48, "duration": 8.46}, {"text": "Never gets old.", "start": 262.94, "duration": 0.5}, {"text": "Here we go, from the top. Hey folks! Its your old friend Brian Brushwood. When we designed themodernrogue.com", "start": 263.44, "duration": 6.14}, {"text": "Our new all time favorite website on SquareSpace.com, we did it by signing up to SquareSpace.com/rogue. We got a free trial,", "start": 270.1, "duration": 6.98}, {"text": "set up. Fell in love with it instantly- Ah God I messed it up *Unintelligible Yelling*", "start": 277.08, "duration": 5.72}, {"text": "People ask me all the time, go to the-  (Bad words, bad words)", "start": 284.8, "duration": 7.82}, {"text": "Whats that? Three? I don't even wanna begin, I am afraid to begin.", "start": 292.74, "duration": 4.5}, {"text": "Why did we go to Square Space? Well in addition to having exeptional 24/7 customer service, and having beautiful", "start": 297.24, "duration": 6.68}, {"text": "templates, their ease of-  *More Yelling* God Da**it! Four! Four zaps!", "start": 303.92, "duration": 8.02}, {"text": "We love SquareSpace.com me, because we went to SquareSpace.com/rogue for a free trial when we set up", "start": 316.1, "duration": 7.36}, {"text": "themodernrogue.com. The website looks absolutely gorgeous! Thanks to their incredibly simple tools,", "start": 323.46, "duration": 4.36}, {"text": "You get award winning design work, and you dont have to have any skills what-so-ever!", "start": 327.82, "duration": 4.38}, {"text": "Dont take my word for it, head on over to SquareSpace.com/rogue, sign up for your free trial,", "start": 332.2, "duration": 4.4}, {"text": "and when you do check out, make sure to use promo code rogue. Thats r-o-g-u-e to get ten percent off.", "start": 336.6, "duration": 5.78}, {"text": "Is that good?", "start": 342.38, "duration": 0.88}, {"text": "I think you got it.", "start": 343.28, "duration": 1.2}, {"text": "please say I got it.", "start": 344.48, "duration": 1.28}, {"text": "You got it", "start": 346.48, "duration": 0.64}]