[{"text": "Cloud Flare launched their New 1.1.1.1 (we're going to just call it \"One Dot\" from now on)", "start": 0.1, "duration": 5.92}, {"text": "DNS Server last year which promised to make your Internet connection faster and more private for free", "start": 6.02, "duration": 5.22}, {"text": "Now, we already did a video talking about its benefits and why you might want to switch to it, which you can check out here.", "start": 11.24, "duration": 6.14}, {"text": "But, since we released that video, Cloud Flare has launched an app that allows you to enable One Dot on IOS and Android with a single button", "start": 17.54, "duration": 12.36}, {"text": "Easy, right? Everyone should just switch to it, right?", "start": 29.9, "duration": 1.9}, {"text": "Well, it might not be quite that simple...", "start": 33.36, "duration": 2.42}, {"text": "So as a quick refresher, the Domain Name System, or DNS is kind of like a phonebook for the internet", "start": 57.84, "duration": 6.98}, {"text": "So just like when you tell your phone to call JZ and it looks up and dials JZ's number...", "start": 64.98, "duration": 8.22}, {"text": "Hello?", "start": 79.02, "duration": 1.16}, {"text": "Hey Hey! Is this JZ?", "start": 80.3, "duration": 1.26}, {"text": "I told you not to call me at this number!", "start": 81.56, "duration": 2.36}, {"text": "*Inhales*", "start": 85.76, "duration": 0.64}, {"text": "Um... So, so yea...", "start": 86.74, "duration": 1.28}, {"text": "Its Basically like that..", "start": 88.04, "duration": 1.6}, {"text": "When you enter a website name in your browser, the DNS Resolver looks up the IP Address and connects you to the server.", "start": 89.64, "duration": 7.78}, {"text": "Now, it's a touch more complicated, but that's all we really need to know for now.", "start": 97.42, "duration": 4.08}, {"text": "Now by default, most devices use your internet service provider's DNS resolver", "start": 101.5, "duration": 5.32}, {"text": "But ISPs have been known to collect and sell data on their users to advertisers and in some cases, block certain IP addresses from being accessed", "start": 106.96, "duration": 9.96}, {"text": "Thankfully, there are many DNS services available that can help you avoid those issues with", "start": 116.92, "duration": 5.4}, {"text": "1. Better Privacy \n2. Better Security\nAnd, 3. even Better Speed", "start": 122.32, "duration": 3.4}, {"text": "*inhales*", "start": 125.88, "duration": 0.48}, {"text": "Including Google's public DNS, Open DNS, and of course, Cloud Flare's offering, One Dot", "start": 126.54, "duration": 5.6}, {"text": "Now, usually, in order to change your DNS resolver, you have to go into your phones network settings and change it manually", "start": 132.4, "duration": 8.34}, {"text": "AND! While on Android 9.0 Pie, you can just change it on a system wide level and forget about it,", "start": 140.92, "duration": 6.24}, {"text": "on all previous versions of Android, and on IOS, you have to change it for each and WiFi network that you connect to!", "start": 147.48, "duration": 9.5}, {"text": "AWW THATS THE WORST!!", "start": 157.24, "duration": 1.56}, {"text": "So thats the problem that Cloud Flare is trying to solve with the One Dot App, on both Android and IOS,", "start": 160.76, "duration": 6.64}, {"text": "it uses a VPN Profile to automagically direct all DNS Queries from your phone to 1.1.1.1, regardless of which WiFi, or even Cellular Network that you're connected to", "start": 167.54, "duration": 11.54}, {"text": "I n N o V a T i O n ! !11!@!!11121", "start": 179.58, "duration": 1.14}, {"text": "Weaa ai Wa  well,  I mean, actually there have been apps to do the same thing for quite a while.", "start": 180.72, "duration": 4.32}, {"text": "Like the Paid DNS Override app on IOS, and DNS Changer on Android", "start": 185.08, "duration": 5.3}, {"text": "However, using a VPN profile to change your DNS resolver creates another problem", "start": 190.38, "duration": 5.18}, {"text": "particularly for people who use an actual VPN like Private Internet Access", "start": 195.62, "duration": 5.02}, {"text": "*inhales*", "start": 200.64, "duration": 0.5}, {"text": "So, you can't have two VPNs Enabled at once, that is unless you want to create like a self destructive VPN loop that could potentially collapse", "start": 201.4, "duration": 9.3}, {"text": "the very structure of the space time continuum", "start": 210.7, "duration": 2.78}, {"text": "*inhales*", "start": 213.68, "duration": 0.5}, {"text": "Which means that you'll have to switch between using the One Dot VPN and your Actual VPN,", "start": 214.46, "duration": 5.84}, {"text": "Depending on whether you're prioritizing speed or privacy", "start": 220.3, "duration": 3.48}, {"text": "*inhales*", "start": 223.78, "duration": 0.5}, {"text": "Now, as I mentioned if your phone is running Android 9.0 Pi, this isn't an issue and you can follow the steps", "start": 224.28, "duration": 6.4}, {"text": "on screen to enable One Dot as you default  DNS resolver in you network settings", "start": 230.68, "duration": 4.44}, {"text": "So, no app, or VPN profile is required, then you can simply toggle your VPN on and off as you normally would", "start": 235.48, "duration": 6.66}, {"text": "But then, I mean, hold on a second, why would you even need a VPN then, if One Dot makes the internet faster and protects you privacy?", "start": 243.22, "duration": 6.74}, {"text": "*inhales*", "start": 249.96, "duration": 0.5}, {"text": "Well, about that, it does protect you privacy compared to other DNS resolvers", "start": 253.08, "duration": 5.2}, {"text": "But One Dot is not as private, or secure as a real VPN, like Private Internet Access", "start": 259.84, "duration": 5.44}, {"text": "Wasn't sure if I mentioned our sponsor PIA in this video already, making sure I get that in there.", "start": 265.28, "duration": 4.36}, {"text": "*inhales*", "start": 269.7, "duration": 0.5}, {"text": "Rather, One Dot is kind of like a DNS server delivered in a VPN wrapper", "start": 270.42, "duration": 5.36}, {"text": "*inhales*", "start": 275.98, "duration": 0.5}, {"text": "So when you use it, your DNS Queries go through a VPN tunnel between your PC or Phone, and Cloud Flare's", "start": 276.48, "duration": 6.12}, {"text": "Servers so no one except Cloud Flare can see those queries", "start": 282.6, "duration": 3.4}, {"text": "And then Cloud Flare has committed to only keeping data logs for 24 hours after which they're purged.", "start": 286.0, "duration": 6.34}, {"text": "*inhales*", "start": 292.54, "duration": 0.5}, {"text": "Unfortunately, though using One Dot, your ISP, your cellphone provider and the WiFi network you're connected to can still see the site you visit", "start": 293.26, "duration": 8.64}, {"text": "With a true VPN, both your DNS queries and your actual internet activity are hidden from everyone", "start": 302.26, "duration": 6.48}, {"text": "That is, except the VPN company.", "start": 309.08, "duration": 1.48}, {"text": "OHKAY so, a VPN is more private and secure than One Dot, but using a VPN usually has a negative impact on your internet speed.", "start": 310.92, "duration": 7.88}, {"text": "As it takes a bit longer for all that data to get routed through an extra loop.", "start": 318.8, "duration": 4.42}, {"text": "And that's how One Dot makes its case,  Cloud Flare says that their service is faster and more private than other DNS services across the board.", "start": 323.36, "duration": 8.22}, {"text": "Because they had already built this worldwide network of servers to provide their other web services like DDOS protection", "start": 331.68, "duration": 6.72}, {"text": "*inhales*", "start": 338.54, "duration": 0.5}, {"text": "And while DNSperf shows that Cloud Flare IS the fastest DNS resolver on average worldwide, just remember,", "start": 339.04, "duration": 6.16}, {"text": "Your milage may vary depending on your location", "start": 345.2, "duration": 2.66}, {"text": "And, another reminder, speeding up DNS resolution does make loading webpages feel snappier but it won't speed up", "start": 348.14, "duration": 8.16}, {"text": "Actually downloading the data of the page, so if your internet plan is just slow or there's a lot of network congestion,", "start": 356.3, "duration": 6.88}, {"text": "Or like, if Cthulu broke an underwater fiber line again, then there's nothing One Dot can do to help", "start": 363.32, "duration": 6.02}, {"text": "Now, let's look at our results:", "start": 369.38, "duration": 2.06}, {"text": "So, here in Vancouver BC, One Dot, traded the top spot with OpenDNS, Quad9, and the AdGuards DNS Service with those four usually resolving in under 10 milliseconds", "start": 371.6, "duration": 11.92}, {"text": "On a Google Pixel 3", "start": 383.72, "duration": 1.36}, {"text": "That is an order of magnitude faster than some other DNS providers, and this would result in a noticeable improvement in page load times", "start": 385.3, "duration": 8.86}, {"text": "One One Hundredth of a second (0.01 Seconds) is a lot faster than than a tenth (0.1 Seconds)", "start": 394.16, "duration": 4.28}, {"text": "Then, in our head to head test, with two Pixel 3s running on the ??? network, one with One Dot, and one without,", "start": 398.44, "duration": 6.58}, {"text": "Our One Dot phone in particular when we loaded up a site, that we hadn't accessed recently, or ever before,", "start": 405.02, "duration": 6.86}, {"text": "Almost always came out ahead", "start": 412.08, "duration": 1.92}, {"text": "As for our ishould'vegottenanotherPhone Xs Max, this one was consistently faster with Cloud Flares App enabled as well", "start": 414.0, "duration": 5.96}, {"text": "Compared to just of a vanilla Xs Max", "start": 419.96, "duration": 2.22}, {"text": "So, There you have it!", "start": 422.3, "duration": 2.26}, {"text": "Again, your milage may vary, but in our testing, OneDot WAS able to improve a our website loading responsiveness", "start": 424.56, "duration": 6.72}, {"text": "and for FREE, both on WiFi, and when we were on the go.", "start": 431.68, "duration": 4.3}, {"text": "So, should you use Cloud Flare's app on your phone? Sure. Most of the time, you'll get a snappier browsing experience, whether you're on WiFi or mobile internet", "start": 436.18, "duration": 8.92}, {"text": "And, you'll gain a little bit more privacy while you're at it.", "start": 445.1, "duration": 3.08}, {"text": "The only thing that we'd really like to see improved here is on Apple's side with IOS adding System-wide Private DNS Capability,", "start": 448.18, "duration": 7.62}, {"text": "So that we could use it in conjunction with a VPN, but until then, having to press this one button, really uhh, it doesn't seem that hard.", "start": 455.9, "duration": 9.78}]