[{"text": "Okay, so I went to anime North this past weekend", "start": 5.319, "duration": 2.66}, {"text": "Which is a convention I've been going to every year for the past four years and at some point. I thought to myself hmm", "start": 7.98, "duration": 6.749}, {"text": "I'm turning 27 this year, ooh", "start": 14.73, "duration": 2.34}, {"text": "And then I just suddenly", "start": 17.199, "duration": 2.03}, {"text": "felt old. I looked around in the vicinity and just saw an ocean of youth, and for a few minutes", "start": 19.689, "duration": 5.42}, {"text": "I kind of felt out of place", "start": 25.109, "duration": 2.0}, {"text": "Wait, wait hold up. I Know what you're thinking~", "start": 27.46, "duration": 2.64}, {"text": "(Spits a bunch of times)", "start": 30.2, "duration": 3.769}, {"text": "Dom.", "start": 33.969, "duration": 1.431}, {"text": "Twenty-seven? That's not old at all. Do you know how old I am?", "start": 35.52, "duration": 3.02}, {"text": "I'm [insert a number greater than 27.] Yeah, okay, fair. That's true.", "start": 38.94, "duration": 5.16}, {"text": "You may be the age of that number which happens to be greater than my number.", "start": 44.1, "duration": 4.439}, {"text": "But I'm pretty sure there's someone else older than you", "start": 48.61, "duration": 2.629}, {"text": "And there's probably someone else older than them. In fact at any given time, did you know this? There can only be ONE", "start": 51.239, "duration": 7.02}, {"text": "oldest person in the world.", "start": 58.989, "duration": 1.98}, {"text": "(Provided everyone knows the time of their birth down to the millisecond.)", "start": 60.969, "duration": 2.931}, {"text": "Does that mean there can only be one person in the world who has the right to feel old?", "start": 64.0, "duration": 4.429}, {"text": "No, of course not. It's all relative. Again, I am turning 27 this year.", "start": 68.68, "duration": 5.33}, {"text": "I am around the age my parents were when they had my older sister", "start": 74.11, "duration": 4.699}, {"text": "And here I am not even married yet. In fact, neither are my sisters", "start": 78.81, "duration": 3.51}, {"text": "And I'm pretty sure my parents would like to have some grandkids at some point in this lifetime.", "start": 82.32, "duration": 4.619}, {"text": "These are the kind of pressures that get to me. Every now", "start": 87.48, "duration": 2.84}, {"text": "And then I go through my Facebook and catch a glimpse of", "start": 90.32, "duration": 3.04}, {"text": "my feed and it's like \"so and so just got married", "start": 93.36, "duration": 1.88}, {"text": "[oh] [so-and-so], just had their second kid oh\"", "start": 95.249, "duration": 3.191}, {"text": "And here I am, thinking I'm still a kid. Well, at heart anyway", "start": 99.13, "duration": 5.18}, {"text": "And I'm pretty sure I'll be this way for the rest of my life. My body may start feeling old", "start": 104.32, "duration": 5.36}, {"text": "I'm already feeling it right now with my declining metabolism, am I right?", "start": 110.11, "duration": 3.409}, {"text": "(Laughing)", "start": 113.52, "duration": 1.28}, {"text": "(Sobbing)", "start": 114.8, "duration": 1.0}, {"text": "But I will do what it takes to keep my mind", "start": 115.8, "duration": 2.36}, {"text": "youthful. I don't want to become one of those old grumpy dudes who just sit on the rocking chair on the front porch critiquing", "start": 118.299, "duration": 5.707}, {"text": "everything in their field of vision.", "start": 124.006, "duration": 1.573}, {"text": "I want to be seventy years old and still be able to make puns that my", "start": 126.079, "duration": 3.58}, {"text": "Grand kids develop a grudging tolerance for. It makes me wonder if I'm just slow with these life events", "start": 129.88, "duration": 5.25}, {"text": "Of course I know I shouldn't compare the pace of my life with others because everyone travels at their own speed", "start": 135.23, "duration": 5.929}, {"text": "But it still makes me worry sometimes about when will things", "start": 141.2, "duration": 3.44}, {"text": "Actually feel late.", "start": 145.12, "duration": 1.68}, {"text": "You know it's fun to witness? When high school kids", "start": 147.08, "duration": 2.8}, {"text": "Think they feel old. They go through freshman year ready to discover themselves and develop their teenage", "start": 150.38, "duration": 5.959}, {"text": "identities. The moment they hit the 10th grade they begin spiting the new freshman just for being younger than them.", "start": 156.46, "duration": 5.3}, {"text": "\"Oh my god, Betty, did you see the freshmen this year? Like, ew.\"", "start": 161.76, "duration": 4.98}, {"text": "\"Ewwwwww.\"", "start": 168.8, "duration": 4.28}, {"text": "\"Oh my god, right? Like, ugh, freshmen, like, we weren't totally them six months ago.\"", "start": 173.08, "duration": 6.14}, {"text": "(Deep Breath)", "start": 179.22, "duration": 2.0}, {"text": "\"Ew.\"", "start": 181.22, "duration": 0.56}, {"text": "\"You want to, like, go to, like, star, like, bucks or something?\"", "start": 181.78, "duration": 4.72}, {"text": "...Like?\" And this just continues every year until senior year where their pompous elitist looking-ass selves", "start": 187.85, "duration": 6.47}, {"text": "are just looking down on every underclassmen like they've somehow earned this authority over a kingdom.", "start": 194.32, "duration": 5.309}, {"text": "But then, a reset happens. They graduate and head to college. (Most of them anyway.)", "start": 200.03, "duration": 5.75}, {"text": "And they become first-years again who are then being looked down on by the upper years! It's an infinite cycle in both directions!", "start": 205.78, "duration": 7.589}, {"text": "Let me give you guys a tip. Stop", "start": 213.77, "duration": 2.0}, {"text": "automatically thinking that older means smarter or wiser and thus making younger mean dumber and more naïve.", "start": 215.87, "duration": 6.44}, {"text": "I say automatically because some of the youth are actually pretty freaking stupid, you gotta admit.", "start": 222.31, "duration": 5.25}, {"text": "It's almost painful to witness some of them make all the poor decisions in their lives.", "start": 227.56, "duration": 3.72}, {"text": "But, that's what I mean. Some of those dumbass kids...stay dumbass kids, for the rest of their lives.", "start": 231.74, "duration": 6.529}, {"text": "They just happen to grow older and have more freedom to be dumbasses in the adult world. Some people grow old,", "start": 238.28, "duration": 6.47}, {"text": "But they never grow up.", "start": 244.75, "duration": 1.63}, {"text": "But, aside from those people, when you think about it, in the long run the following generations will always be smarter than the previous.", "start": 246.38, "duration": 7.91}, {"text": "Or, they should be anyway, because they have more information available for them to learn at a younger age", "start": 254.99, "duration": 5.479}, {"text": "Every time something new happens in the world, whether it's a historical event or a technological advancement, it's collected into the cumulative knowledge", "start": 260.81, "duration": 7.13}, {"text": "That's been existing and will continue to exist from now and forever. The only reason", "start": 267.94, "duration": 5.309}, {"text": "This is true is because people... die. If people were immortal then we'd have our whole lives to expand our intelligence", "start": 273.25, "duration": 6.69}, {"text": "But we're not. We live, we pass on what we know to the next generation", "start": 280.069, "duration": 4.07}, {"text": "Then we die, and hope the people we leave behind are able to deal with the problems", "start": 284.139, "duration": 3.779}, {"text": "We caused and weren't able to solve. The fact that the human species have made it this far is simply amazing.", "start": 287.919, "duration": 6.029}, {"text": "So when can you feel old?", "start": 294.349, "duration": 2.27}, {"text": "Is it anytime? Is it different per person depending on the consequences of their lives and the", "start": 296.949, "duration": 5.49}, {"text": "environmental factors that affected their upbringing?", "start": 302.66, "duration": 2.359}, {"text": "I think it's when you become the oldest that you yourself can ever be.", "start": 305.9, "duration": 4.339}, {"text": "So...like, right before you die, then?", "start": 311.21, "duration": 4.339}, {"text": "Yeah, I guess so.", "start": 316.699, "duration": 2.0}, {"text": "Damn...that's poetic.", "start": 319.039, "duration": 2.6}, {"text": "Or just morbid...", "start": 322.46, "duration": 2.0}, {"text": "True.", "start": 325.94, "duration": 2.0}, {"text": "This video has been brought to you by Crunchyroll. One thing I know I'll still be watching in my senior years is anime. Head over to Crunchyroll.com/Domics,", "start": 329.03, "duration": 8.77}, {"text": "(Link below) and go ham and cheese on some anime because you'll get a free premium membership for 30 days", "start": 338.2, "duration": 5.549}, {"text": "\"Premium? What's that?\" 🤔", "start": 344.419, "duration": 2.059}, {"text": "Well, let me tell you! Ad free and 1080p episodes as soon as one hour after release in Japan. Not to mention they're", "start": 346.479, "duration": 6.45}, {"text": "Professionally subtitled, none of that weak dub nonsense, and a convenient app on nearly every device", "start": 353.15, "duration": 5.329}, {"text": "Aside from Attack on Titan, Boku no Hero Academia is getting pretty lit. I definitely recommend it. Again, that's Crunchyroll.com/Domics", "start": 358.94, "duration": 8.66}, {"text": "Link in the description. Enjoy 😊❤", "start": 367.8, "duration": 2.349}]