[{"text": "Hey, this video is sponsored by CuriosityStream.", "start": 0.0, "duration": 3.92}, {"text": "Rio de Janeiro, aka just Rio, and São Paulo often called SP", "start": 3.92, "duration": 6.88}, {"text": "The two largest cities in Brazil.", "start": 10.8, "duration": 2.36}, {"text": "Heck, with a metropolitan area population of 21.3 million people, São Paulo is the largest Portuguese speaking city in the world, the second largest city in the entire Southern Hemisphere and 12th largest in the world overall.", "start": 13.16, "duration": 15.0}, {"text": "It’s actually part of an even bigger São Paulo Macrometropolis, which has about 31.5 million people. Geez.", "start": 28.16, "duration": 9.44}, {"text": "Rio de Janeiro, with a metropolitan area population of 13 million people, is the fourth largest city in the Southern Hemisphere and 37th largest city in the world.", "start": 37.6, "duration": 10.56}, {"text": "About 437 km, or 272 miles apart, or a five and a half hour drive by car, the Brazilian government recently postponed plans to build a $9 billion high speed rail line connecting the two cities that would reduce the trip to just 80 minutes because it would cost...you know…$9 billion.", "start": 48.16, "duration": 18.48}, {"text": "But it would be pretty cool if they completed it because it would reduce the trip to just 80 minutes.", "start": 66.64, "duration": 4.28}, {"text": "Don’t be fooled...even though they seem to be hiding down there in the southeast corner of Brazil, both are megacities that dominate the economy and culture of the entire country.", "start": 70.92, "duration": 10.24}, {"text": "Both are near the coast of the Atlantic Ocean. Ok, well Rio is right on the coast, and SP is about an hour from it.", "start": 81.16, "duration": 7.64}, {"text": "Rio de Janeiro is the capital city of the state of Rio de Janeiro.", "start": 88.8, "duration": 5.32}, {"text": "Well hey what a coincidence because São Paulo is the capital city of the state of São Paulo.", "start": 94.12, "duration": 5.48}, {"text": "Citizens in Rio are often called Cariocas, while citizens of São Paulo are often called Paulistanos or Paulistanas.", "start": 99.6, "duration": 9.56}, {"text": "Both cities are located in the rugged area known as the Brazilian Highlands, an area filled with cliffs, large hills, and mountains.", "start": 109.16, "duration": 9.08}, {"text": "Both are near the Serra do Mar, a system of mountain ranges that go along the coast. But no worries.", "start": 118.24, "duration": 5.76}, {"text": "There are no volcanoes and hardly any earthquakes here.", "start": 124.0, "duration": 3.08}, {"text": "However, both do have to worry about flooding, mudslides, and the occasional droughts.", "start": 127.08, "duration": 5.28}, {"text": "Wait, droughts? I thought they get a lot of rain?", "start": 132.36, "duration": 2.76}, {"text": "Well, both do get a lot of rain...it just sometimes comes all at once and then will go away for awhile.", "start": 135.12, "duration": 6.24}, {"text": "São Paulo does get a lot more rain, though. (1,441 mm or 56.73 inches in SP, 1,069 mm or 42.1 inches in Rio)", "start": 141.36, "duration": 2.6}, {"text": "Rio has a tropical savanna climate, but it’s pretty darn close to a tropical monsoon climate, getting lots of rain during the summer months.", "start": 143.96, "duration": 8.36}, {"text": "São Paulo has a humid subtropical climate. Both cities are fairly warm all year long.", "start": 152.32, "duration": 6.24}, {"text": "I mean, they technically have four seasons but in Rio it’s mostly a wet season and a dry season.", "start": 158.56, "duration": 7.04}, {"text": "Summers are wet and warm and winters are more dry but still pleasant.", "start": 165.6, "duration": 4.56}, {"text": "Since São Paulo is further south, that Antarctic air creeps up a bit more, so it gets a bit cooler in the winter and not as hot in the summer.", "start": 170.16, "duration": 9.8}, {"text": "Plus, it’s at a higher elevation. And yeah, the more you creep up into the mountains in both cities the cooler it gets, obviously.", "start": 179.96, "duration": 7.36}, {"text": "Similar to Melbourne, Australia, São Paulo famously can have sporadic weather that quickly changes.", "start": 187.32, "duration": 7.0}, {"text": "Similar to other South American cities, the wealthier parts of both cities tend to be more toward the city center, and the further out you go the more poverty and favelas, the Brazlian slums.", "start": 194.32, "duration": 12.12}, {"text": "These favelas historically have been unregulated by local governments, and you’ll often see makeshift shacks built there.", "start": 206.44, "duration": 8.24}, {"text": "Since the 1970s, many Brazilians have fled rural areas to find work in Rio and SP, but have been unable to find places to live near the city center and forced to live in the favelas.", "start": 214.68, "duration": 10.88}, {"text": "Due to unavailable land, many favelas creep up into steep hillsides, like these in Rio, and thus are constantly at risk from landslides.", "start": 225.56, "duration": 11.08}, {"text": "Several drug lords also rule these areas, and the local police often have a hard time controlling them.", "start": 236.64, "duration": 5.52}, {"text": "Some of the more established favelas, like Rocinha in Rio, have become iconic and are even regularly visited by tourists.", "start": 242.16, "duration": 9.0}, {"text": "Both cities have pretty big celebrations for the Carnival of Brazil, but Rio’s Carnival is legendary.", "start": 251.16, "duration": 7.8}, {"text": "Rio Carnival, aka “the biggest show on Earth,” is the biggest carnival in the world with more than 2 million people per day out dancing, singing, and partying in the streets.", "start": 258.96, "duration": 12.0}, {"text": "One of the big Rio Carnival events is the Rio Samba Parade, which is actually a huge competition of the top samba schools from the region.", "start": 270.96, "duration": 9.16}, {"text": "Samba? Heck yeah. You can’t do Brazil without samba, a Brazlian music and dance style with roots in West Africa.", "start": 280.12, "duration": 7.16}, {"text": "While samba is big in both Rio de Janeiro and São Paulo, Rio is where the music genre began.", "start": 287.28, "duration": 6.92}, {"text": "If you identify as a man, you’re going to be a minority if you go to either one of these cities.", "start": 294.2, "duration": 4.84}, {"text": "Both have a high proportion of women compared with most global cities. (Rio 53.2% SP 52.6%)", "start": 299.04, "duration": 3.76}, {"text": "What about religion? Well, the majority of Cariocas and Paulistanos identify as Roman Catholic.", "start": 302.8, "duration": 6.84}, {"text": "Both cities also have residents who have ethnic backgrounds from all over the place, not just Portugal.", "start": 309.64, "duration": 5.52}, {"text": "Both have hosted the FIFA World Cup. Oh, and soccer, aka football, is kind of a big freaking deal in both cities.", "start": 315.16, "duration": 7.56}, {"text": "EVERYTHING revolves around people watching their favorite soccer teams.", "start": 322.72, "duration": 3.88}, {"text": "Both have horrible traffic, although its worse in Rio.", "start": 326.6, "duration": 4.28}, {"text": "One solution to this traffic is bikes, and both have a bike sharing system.", "start": 330.88, "duration": 4.32}, {"text": "You can drink alcohol in public in both cities. I mean, that makes sense with Carnival and all.", "start": 335.2, "duration": 5.48}, {"text": "Wealth inequality is really bad in both cities, and often neighborhoods are extremely segregated based on wealth.", "start": 340.68, "duration": 6.2}, {"text": "Now how about some differences?", "start": 346.88, "duration": 1.6}, {"text": "First of all, Rio has a 34% lower population density. Public transportation is also cheaper in Rio.", "start": 348.48, "duration": 7.52}, {"text": "São Paulo has a couple of big human-made lakes nearby, the Billings and Guarapiranga reservoirs, which help generate electricity for the city.", "start": 356.0, "duration": 10.32}, {"text": "São Paulo has been around longer.", "start": 366.32, "duration": 2.72}, {"text": "It was the first permanent Portuguese settlement in the Americas.", "start": 369.04, "duration": 3.48}, {"text": "Portuguese Jesuit priests founded it on January 25, 1554.", "start": 372.52, "duration": 5.32}, {"text": "Although a Portuguese expedition first came across the area that would become Rio de Janeiro a few decades before that, it wasn’t officially founded until March 1, 1565.", "start": 377.84, "duration": 10.72}, {"text": "Before European arrival, what would become both cities were settled by the Tupi people, although other American Indian nations lived in the area as well.", "start": 388.56, "duration": 9.6}, {"text": "Rio de Janeiro was named Rio de Janeiro because the Portuguese happened to first encounter Guanabara Bay in January.", "start": 398.16, "duration": 7.96}, {"text": "The Jesuits named São Paulo for Paul the Apostle.", "start": 406.12, "duration": 4.4}, {"text": "During the Portuguese colonial period, São Paulo was a poor and isolated village, while Rio de Janeiro was constantly raided by French pirates.", "start": 410.52, "duration": 9.36}, {"text": "At the end of the 1600s, after the Bandeirantes found gold nearby, São Paulo became more of a big deal, and so did Rio, as it now became a big port city.", "start": 419.88, "duration": 10.8}, {"text": "Oh, and Rio became the capital of Colonial Brazil.", "start": 430.68, "duration": 2.56}, {"text": "Sadly, it also became a popular place to buy and sell African slaves. Hundreds of thousands of slaves ended up there at one point or another.", "start": 433.24, "duration": 8.2}, {"text": "In 1808, the Portuguese royal family fled after Napoleon invaded Portugal, moving to Rio de Janeiro.", "start": 441.44, "duration": 7.92}, {"text": "And thus, it became the new capital of the entire Kingdom of Portugal.", "start": 449.36, "duration": 4.4}, {"text": "A few years later, São Paulo played an important role in the Brazilian independence movement led by Dom Pedro I.", "start": 453.76, "duration": 7.48}, {"text": "After Pedro declared independence from Portugal and named himself emperor of the new Empire of Brazil, he kept Rio as the capital.", "start": 461.24, "duration": 8.4}, {"text": "For the rest of the 1800s, Rio would greatly overshadow São Paulo.", "start": 469.68, "duration": 4.4}, {"text": "When Brazil became an independent republic, it remained the capital.", "start": 474.08, "duration": 3.44}, {"text": "That century, both cities now made most of their money from growing sugar cane and São Paulo became a major center for trading my favorite beverage ever, coffee.", "start": 477.52, "duration": 10.16}, {"text": "Thanks to the coffee boom and a mining boom, the city attracted lots of immigrants, and the city began to industrialize and catch up with Rio.", "start": 487.68, "duration": 7.88}, {"text": "By the early 1900s, it was the richest city in Brazil.", "start": 495.56, "duration": 3.92}, {"text": "But Rio’s population exploded with immigrants, too, and after slavery was finally abolished, many former slaves ended up there to find work.", "start": 499.48, "duration": 8.0}, {"text": "The 1920s through the 1950s were Rio’s golden age as it began to attract tourists from around the world.", "start": 507.48, "duration": 8.08}, {"text": "However, beginning in the 1950s, São Paulo surpassed Rio de Janeiro in population due to rapid industrialization, especially in the automotive industry.", "start": 515.56, "duration": 10.08}, {"text": "In 1960, Brazil built Brasilia as the new capital city so Rio’s reign as the capital ended.", "start": 525.64, "duration": 6.2}, {"text": "Today, São Paulo is more cosmopolitan and far more diverse.", "start": 531.84, "duration": 4.52}, {"text": "It huge communities from Italy, Bolivia, Japan, Lebanon, Syria, and Palestine.", "start": 536.36, "duration": 7.36}, {"text": "More Paulistanos are of Italian descent than residents of Rome.", "start": 543.72, "duration": 4.24}, {"text": "Due to this, São Paulo tends to have more variety of food choices.", "start": 547.96, "duration": 4.48}, {"text": "Rio has hosted the Olympics, São Paulo has not. The São Paulo Gay Pride Parade is the largest of its kind in the world.", "start": 552.44, "duration": 9.44}, {"text": "Rio claims fame as the birthplace of bossa nova, a distinct style of Brazilian music which became popular worldwide in the 1960s.", "start": 561.88, "duration": 8.64}, {"text": "SP has the largest fleet of helicopters in the world.", "start": 570.52, "duration": 4.08}, {"text": "Many helicopters travel back and forth between Rio and SP, as a matter of fact.", "start": 574.6, "duration": 4.68}, {"text": "The cost of living is lower in Rio. But it’s important to know that both cities are a bargain compared to most global cities, especially since Brazil’s economy has struggled in recent years.", "start": 579.28, "duration": 12.04}, {"text": "And yeah, both cities have high unemployment, but Rio has less. (SP- 14.2%, Rio- 12.6%)", "start": 591.32, "duration": 4.6}, {"text": "Still, the per capita income is higher in São Paulo (SP- R$33,624 per capita, Rio- R$31,064)", "start": 595.92, "duration": 3.76}, {"text": "And São Paulo has a bigger economy overall, the biggest in Brazil actually. It’s the 10th richest city in the world.", "start": 599.68, "duration": 7.16}, {"text": "São Paulo is known for business tourism, while Rio is known for tourism...um, tourism.", "start": 606.84, "duration": 6.44}, {"text": "While air pollution is bad in both, it’s worse in São Paulo.", "start": 613.28, "duration": 3.2}, {"text": "Crime is also very bad in both, but it’s worse in Rio. The life expectancy is a little higher in Sao Paulo. (SP-80.4 Rio- 78.8)", "start": 616.48, "duration": 6.76}, {"text": "São Paulo has a “clean city law” which prohibits billboards.", "start": 623.24, "duration": 5.48}, {"text": "When the city first implemented it back in 2007, hundreds of thousands of signs were taken down, and it kind of made the city look more dreary.", "start": 628.72, "duration": 8.12}, {"text": "Since then, the city has allowed artists to create more murals to add some beauty to the cityscape.", "start": 636.84, "duration": 6.84}, {"text": "Rio’s natural beauty is certainly more well known. I mean, look at that. Just look at that.", "start": 643.68, "duration": 6.56}, {"text": "São Paulo looks like many other global cities with its concrete jungle, but the unique landscape of Rio de Janeiro makes it really difficult to take a bad picture of the place.", "start": 650.24, "duration": 11.36}, {"text": "It’s beautiful. I mean, is this Photoshopped?", "start": 661.6, "duration": 3.28}, {"text": "Anyway, major attractions in São Paulo include Paulista Avenue, Ibirapuera Park, Municipal Market of São Paulo, Italy Building, and the Pinacoteca do Estado de São Paulo.", "start": 664.88, "duration": 12.96}, {"text": "Major attractions in Rio de Janeiro include the Christ the Redeemer statue, Sugarloaf Mountain, Copacabana Beach, the Museum of Tomorrow, and Tijuca National Park.", "start": 677.84, "duration": 10.88}, {"text": "That’s right, there’s a freaking national park in the middle of the city.", "start": 688.72, "duration": 3.2}, {"text": "Tijuca is arguably the largest urban rainforest in the world.", "start": 691.92, "duration": 5.16}, {"text": "The stereotypes portray Rio de Janeiro as the carefree, tourist hub of Brazil where folks go to party and São Paulo has the busy financial hub where folks are workaholics, but this is an oversimplification.", "start": 697.08, "duration": 13.72}, {"text": "For example, many argue the night life in São Paulo is better than Rio, and Rio has one of the fastest growing economies in the world.", "start": 710.8, "duration": 7.28}, {"text": "The fact is, there is something for everyone in both of these fine Brazilian cities, and if you ever get the chance to visit Brazil, I recommend trying to visit both.", "start": 718.08, "duration": 9.88}, {"text": "Ok, so if you want to learn more about Rio de Janeiro,", "start": 727.96, "duration": 2.88}, {"text": "there is this documentary that I really appreciated.", "start": 730.84, "duration": 2.52}, {"text": "It's called Rio, the Great Saga.", "start": 733.36, "duration": 3.52}, {"text": "This is a documentary about the history of Rio de Janeiro.", "start": 736.88, "duration": 3.6}, {"text": "It takes a much deeper dive than I could in this video.", "start": 740.48, "duration": 3.76}, {"text": "It's about an hour long, and it goes into the rich history of the city.", "start": 744.24, "duration": 3.16}, {"text": "And you know where you can find that documentary at?", "start": 747.44, "duration": 3.16}, {"text": "CuriosityStream, baby!", "start": 750.6, "duration": 2.68}, {"text": "So yeah, this episode is brought to you by CuriosityStream.", "start": 753.28, "duration": 4.28}, {"text": "A subscription service made for those of you who have no shame in your nerd game.", "start": 757.56, "duration": 5.12}, {"text": "With over 2400 documentaries", "start": 762.68, "duration": 3.08}, {"text": "and non-fiction titles from some of the world's", "start": 765.76, "duration": 2.8}, {"text": "best filmmakers.", "start": 768.56, "duration": 1.44}, {"text": "including exclusive originals.", "start": 770.0, "duration": 2.36}, {"text": "Get unlimited access, starting at just $2.99 a month", "start": 772.36, "duration": 4.04}, {"text": "and for my audience", "start": 776.4, "duration": 2.08}, {"text": "the first 31 days are completely free", "start": 778.48, "duration": 2.88}, {"text": "if you sign up at curiositystream.com/mrbeat", "start": 781.36, "duration": 4.92}, {"text": "and use the promo code \"mrbeat\"", "start": 786.28, "duration": 2.88}, {"text": "during the sign up process.", "start": 789.16, "duration": 2.2}, {"text": "So check that documentary out for free for the first 31 days.", "start": 791.36, "duration": 3.0}, {"text": "Again, go to curiositystream.com/mrbeat. Click the link in the description to get 31 days free.", "start": 794.36, "duration": 5.52}, {"text": "Thanks to CuriosityStream for sponsoring this video.", "start": 799.88, "duration": 3.08}, {"text": "Which city do you like better? What did I get right? What did I get wrong?", "start": 802.96, "duration": 3.96}, {"text": "What did I leave out? I mean, I know I left out a lot but this is just a brief overview, you know?", "start": 806.92, "duration": 5.24}, {"text": "And as always, I love seeing more suggestions for places to compare next.", "start": 812.16, "duration": 4.0}, {"text": "Again, I’m sorry for the pronunciations...I know they are pronounced differently in Brazil...", "start": 816.16, "duration": 4.48}, {"text": "I pronounced everything like I’m an American. But thanks for watching anyway.", "start": 820.64, "duration": 4.1}]