[{"text": "We have to digitize Keanu's essence", "start": 0.04, "duration": 2.22}, {"text": "Action!", "start": 2.26, "duration": 2.0}, {"text": "I think we could do all of Keanu Reeves in a day.", "start": 4.94, "duration": 2.06}, {"text": "If Keanu's not right, the video doesn't work.", "start": 7.12, "duration": 2.02}, {"text": "Yeah, Keanu Reeves", "start": 9.32, "duration": 1.18}, {"text": "[weird noises]", "start": 10.5, "duration": 3.5}, {"text": "I'm such a big fan of Keanu Reeves man.", "start": 16.48, "duration": 3.04}, {"text": "Like I've loved him since speed. That was an awesome movie", "start": 19.52, "duration": 2.53}, {"text": "Of course the matrix, I mean", "start": 22.05, "duration": 1.47}, {"text": "\"He's the one\"", "start": 23.52, "duration": 0.63}, {"text": "There's all these articles about how nice Keanu Reeves is.", "start": 24.85, "duration": 2.46}, {"text": "Keanu gives all of his money away", "start": 27.31, "duration": 1.399}, {"text": "Keanu takes the time to hang out with homeless people", "start": 28.869, "duration": 2.78}, {"text": "I think the world needs more people like Keanu Reeves.", "start": 31.65, "duration": 3.41}, {"text": "You guys remember the Tom Cruise video, right?", "start": 35.06, "duration": 1.269}, {"text": "We had a Tom Cruise impersonator to come in, do his thing and we put a Tom Cruise deep fake over his face", "start": 36.48, "duration": 5.79}, {"text": "right", "start": 42.27, "duration": 0.29}, {"text": "The result was jaw-dropping.", "start": 42.56, "duration": 2.34}, {"text": "Nikko learned about the technology in the Tom Cruise video, and I thought well", "start": 44.9, "duration": 3.24}, {"text": "How funny would it be if Keanu Reeves stopped the armed robbery with kindness?", "start": 48.149, "duration": 3.27}, {"text": "So look if I can't work with Keanu right now, I think this is the next best thing", "start": 52.36, "duration": 4.669}, {"text": "We have to digitize Keanu's essence.", "start": 57.3, "duration": 2.5}, {"text": "So we got to run a test", "start": 59.94, "duration": 1.14}, {"text": "We got to see if we can put Keanu Reeves face on my body. Just see if it works", "start": 61.18, "duration": 4.0}, {"text": "So we're doing this Keanu Reeves thing and since I'm done let's do a real test", "start": 66.46, "duration": 3.979}, {"text": "I got a wig, I put a suit on,  just so I did here's the goofiest looking thing", "start": 70.439, "duration": 5.34}, {"text": "Sorry, Keanu Reeves?", "start": 75.78, "duration": 2.38}, {"text": "H-hi, how you doin'", "start": 78.16, "duration": 1.44}, {"text": "Wow, man!", "start": 79.66, "duration": 0.86}, {"text": "That wig, man!", "start": 82.38, "duration": 2.0}, {"text": "It's very strange it looks a little better than I thought it would like it was so few iterations to you know,", "start": 84.72, "duration": 5.3}, {"text": "He like definitely like he bends his hands like all the way back. Full palm, you know", "start": 90.909, "duration": 4.7}, {"text": "And he's constantly trying to open those pickle jars", "start": 95.61, "duration": 2.819}, {"text": "It's like you tell me to smile scan or if you feel like suppressants", "start": 101.47, "duration": 3.199}, {"text": "yeah, the wig makes it look like off his meds or something like that", "start": 104.67, "duration": 3.629}, {"text": "Got a loop being lost", "start": 109.32, "duration": 2.0}, {"text": "I can't wait to make this video", "start": 113.41, "duration": 2.059}, {"text": "You may have seen our Tom Cruise deep fake video, which we titled the best deep picture on the Internet. It look great", "start": 115.69, "duration": 4.669}, {"text": "But if you look closely you could tell is the deep pit", "start": 120.36, "duration": 2.04}, {"text": "It wasn't perfect, but we learned a lot", "start": 122.4, "duration": 1.65}, {"text": "And now for this Keanu Reeves video it's time to put that training to use and make this one perfect", "start": 124.05, "duration": 4.31}, {"text": "So here's what we're gonna do.", "start": 128.36, "duration": 1.58}, {"text": "Lesson 1 Keanu Reeves has long black hair so we get to frame the entire face", "start": 130.04, "duration": 3.8}, {"text": "It's just black but Keanu Reeves has a widow peak and it's hard to find wigs that have widow Peaks that look good", "start": 134.1, "duration": 5.54}, {"text": "So we're wearing a baseball cap. those two things alone frame the face very nicely.", "start": 139.83, "duration": 4.61}, {"text": "lesson two", "start": 144.44, "duration": 0.5}, {"text": "We're going to light this seam. Anyway, that gives us flat underneath lighting", "start": 144.94, "duration": 3.679}, {"text": "So we're not getting a lot of shadow on the face or not getting really direct solid lighting", "start": 148.62, "duration": 4.26}, {"text": "We're not getting crisp shadows that has to be recreated. The bill of the Hat casts a shadow on the face", "start": 152.88, "duration": 4.5}, {"text": "There's gonna get some nice even under lighting", "start": 157.5, "duration": 2.94}, {"text": "lesson 3: profile shots", "start": 160.46, "duration": 1.04}, {"text": "Tthe deep fake can kind of do profile shots", "start": 161.6, "duration": 2.56}, {"text": "But the problem is if somebody else's nose is bigger than say your actor's nose. It can be putting on to the face", "start": 164.16, "duration": 5.579}, {"text": "Well, you just have another big nose sticking out below their nose, and that's a problem", "start": 169.74, "duration": 3.24}, {"text": "So we need to plan the scene in such a way to never have the issue really looking sideways", "start": 172.98, "duration": 4.36}, {"text": "Lesson 4", "start": 177.38, "duration": 1.06}, {"text": "deep fakes are really only 128 by 128 pixels in the screen here of 1080p", "start": 178.44, "duration": 5.54}, {"text": "That's where is only this big. The problem is you can't film any close-up", "start": 184.02, "duration": 4.1}, {"text": "So what we're doing right now, you can't do that with the deep fake so it would look really blurry", "start": 188.13, "duration": 2.91}, {"text": "But we don't worry about that", "start": 191.04, "duration": 1.14}, {"text": "If we film it on the cellphone, we're gonna film the whole thing", "start": 192.18, "duration": 2.369}, {"text": "Like it's found footage on a cell phone and we're gonna film it vertical", "start": 194.549, "duration": 3.75}, {"text": "So that's gonna let us keep the face tinier in the frame", "start": 198.299, "duration": 2.37}, {"text": "So the last thing we're gonna do is we're going to teach Rai a much better face compared to the Tom Cruise one", "start": 200.67, "duration": 4.77}, {"text": "I think I trained the Tom Cruise face for like a hundred thousand iterations meaning that it's running a calculation over and over and over", "start": 205.44, "duration": 5.519}, {"text": "And over and over again it did that a hundred thousand times. I thought that was great", "start": 210.96, "duration": 3.24}, {"text": "I thought that was enough.", "start": 214.2, "duration": 1.3}, {"text": "Turns out I was wrong", "start": 215.58, "duration": 1.18}, {"text": "we're going to giving it a really good Keanu Reeves data set with a lot of different examples of his face from a lot of", "start": 216.76, "duration": 5.14}, {"text": "Different angles and I've been training this Keanu Reeves deep fake model for like ten days straight", "start": 221.9, "duration": 6.06}, {"text": "Boy, this is satisfying seeing those faces just crisp up nicely", "start": 227.96, "duration": 3.44}, {"text": "We had a great response to the \"Boston Dynamics\" video", "start": 231.4, "duration": 2.12}, {"text": "it came out and we wonder this thing with this one. We need to strike while the iron's hot", "start": 233.52, "duration": 3.26}, {"text": "It's important. This video comes out in a timely manner because we wait too long", "start": 236.79, "duration": 2.94}, {"text": "All that hard work goes to waste. The problem is we kind of like are perfectionists here, especially Clint", "start": 239.739, "duration": 4.97}, {"text": "So I need to sit down with the team. We got to talk about this", "start": 244.709, "duration": 2.279}, {"text": "We've gotta make sure it's going to look as good as it can look but that it's also going to come out when it needs", "start": 246.989, "duration": 3.51}, {"text": "To come out. There's a ticking time bomb on this video. E3 was when all the keanu love came back", "start": 250.5, "duration": 5.85}, {"text": "And right now it's the end of June we just released the deep fake video about a week ago", "start": 261.239, "duration": 4.109}, {"text": "If want to follow suit with the success we've had over the last two months", "start": 265.36, "duration": 3.29}, {"text": "Basically, we have two to three weeks to release the video", "start": 268.84, "duration": 3.619}, {"text": "If you're telling me that Wednesday is the day then that's what it is", "start": 272.56, "duration": 4.009}, {"text": "If you wait any longer", "start": 276.63, "duration": 1.05}, {"text": "There's no point in even making the video and I think it's a great video and you should make it", "start": 277.68, "duration": 3.149}, {"text": "I know that by Wednesday", "start": 280.83, "duration": 1.86}, {"text": "We can make it happen and we'll be doing the best what we got we've done more with less in the past", "start": 282.69, "duration": 5.97}, {"text": "We know it can be a success. The clock is ticking. All right, Wednesday it is", "start": 288.66, "duration": 4.739}, {"text": "Is that meeting about you filmed this video or we don't film it?", "start": 293.949, "duration": 4.339}, {"text": "We don't have an actor, but we need someone who can impersonate Keanu Reeves", "start": 298.63, "duration": 2.959}, {"text": "I still think there's something to be said about", "start": 301.59, "duration": 2.069}, {"text": "Getting a look like actor and then dubbing it after with someone who can do the voice", "start": 303.909, "duration": 4.49}, {"text": "Plan C", "start": 309.37, "duration": 2.0}, {"text": "Jake", "start": 312.25, "duration": 1.44}, {"text": "I told you about my shallow fakes. So these deep fakes are pretty sweet. Right but something that I've been doing it's called shallow fakes", "start": 313.69, "duration": 7.759}, {"text": "whoa", "start": 322.479, "duration": 1.381}, {"text": "Now I might look like Keanu Reeves, right?", "start": 323.86, "duration": 2.96}, {"text": "You might be buying it, but I'm taking it to the next level but using this piece of tape right here", "start": 326.82, "duration": 4.949}, {"text": "Okay", "start": 331.77, "duration": 0.36}, {"text": "Keanu Reeves is one of the nicest guys known to the world and we've got these wonderful", "start": 332.13, "duration": 4.019}, {"text": "Wonderful patrons out there and that made me want to go out and do something nice for everyone in the studio", "start": 336.639, "duration": 5.6}, {"text": "Let me show you what I mean", "start": 342.25, "duration": 2.0}, {"text": "Hey Nick, hey, I just wanted to do something nice for you because our patrons do such nice things. We're", "start": 345.87, "duration": 5.929}, {"text": "over have you heard Astro DG or are we Abu Bakr have you heard of Philip Oxford or", "start": 352.62, "duration": 5.299}, {"text": "Helen Almanza war master 2 3 6 if you tell you have to do all of this told me to do all this", "start": 358.35, "duration": 5.48}, {"text": "Ok, I also Matt. He said to clean your keyboard for you", "start": 363.89, "duration": 2.97}, {"text": "Actually Thank You Keanu hey, are you Peter France? It's really not it, huh?", "start": 369.99, "duration": 4.76}, {"text": "It's great to meet you Oh, have you heard of will Robertson our patrons? Yeah, we ready Adolf Oh", "start": 374.99, "duration": 5.309}, {"text": "Have you heard of not a Canadian spy my favorite person on the planet?", "start": 381.3, "duration": 3.529}, {"text": "Actually, it looks like your phone could use a little bit here. Yeah. Hey Ren. Have you heard a radio Guerrero? Jr", "start": 384.83, "duration": 5.489}, {"text": "Or Mitch plan ski they do something nice for everyone in the studio. Yeah, let me do something nice for you", "start": 390.32, "duration": 5.309}, {"text": "That's real it's it's beyond what is this, you know, have you heard of glitch cube", "start": 398.46, "duration": 4.19}, {"text": "Use Bailey that's got some smudges on it", "start": 402.65, "duration": 2.039}, {"text": "Looks like Christians not here, but I'm gonna tell him about Brian and Togiak and Raymond - bought because they're also two great patrons", "start": 404.69, "duration": 7.17}, {"text": "Ok, what's this ok?", "start": 411.86, "duration": 2.0}, {"text": "So so if you guys are interested in supporting everything that they do in this studio consider patreon", "start": 414.439, "duration": 6.59}, {"text": "It supports all of these videos me nice guy Keanu Reeves. I just I gotta go. I gotta go got some things to do. I", "start": 421.03, "duration": 7.5}, {"text": "Was at my wit's end we scoured the Internet we scoured the internet for anyone who looked like Keanu Reeves", "start": 431.3, "duration": 5.48}, {"text": "I was like it has to be right if Kennedy was not right video doesn't work and I fail Keanu Reeves", "start": 436.78, "duration": 4.679}, {"text": "I was scrolling through Facebook and I found the only person who I know of that can pull this off", "start": 441.46, "duration": 6.359}, {"text": "they just called me up and said hey, I want you to be counter Reeves and I said", "start": 448.009, "duration": 4.1}, {"text": "Okay, I can try that. Everybody's a voice actor. He's a stuntman he is", "start": 452.719, "duration": 4.46}, {"text": "511 we'll see if it works", "start": 458.599, "duration": 2.0}, {"text": "These habanero crackling sound we got Keanu Reeves here today", "start": 467.34, "duration": 3.829}, {"text": "Anyone that Keanu interacts with it's gonna change their soul, it's like Jesus", "start": 473.16, "duration": 4.489}, {"text": "Generally speaking. The only rules you have to really follow is avoid doing profile", "start": 483.509, "duration": 3.86}, {"text": "We also want to avoid obstructions in front of States", "start": 487.37, "duration": 2.16}, {"text": "But as long as you can see the camera and I can see your eyebrows from the camera. It's fine", "start": 489.53, "duration": 3.869}, {"text": "Now in 20 minutes I still have this stunt hopefully Clinton can do this the flip guys let's rehearse", "start": 511.849, "duration": 5.9}, {"text": "If any shots going to like be a hard one this is it", "start": 520.34, "duration": 2.959}, {"text": "I'm a little worried about this because that bent over and he's gonna be doing a lot of moving like she's got a lot of", "start": 523.3, "duration": 3.929}, {"text": "Hair we're gonna in his face and I just I might be a bit of an issue. What's the EDFA?", "start": 527.23, "duration": 3.119}, {"text": "No, Pratt doesn't hurt himself 3 2 1 actually", "start": 530.57, "duration": 3.229}, {"text": "It was less than an hour to finish the day", "start": 541.94, "duration": 2.0}, {"text": "So, it's Monday week after the shoot and we're finally looking at the final edit here I think it feels pretty good", "start": 549.8, "duration": 5.059}, {"text": "Oh my god, Keanu Reeves", "start": 554.86, "duration": 2.04}, {"text": "I", "start": 560.12, "duration": 2.0}, {"text": "Thought the Edit was pretty solid from the deep fake territory here", "start": 571.01, "duration": 2.779}, {"text": "That's a little challenging that hair in front of space", "start": 576.02, "duration": 3.199}, {"text": "I'm a little worried about so see if there's maybe one other take where the hair is not hanging", "start": 579.22, "duration": 3.75}, {"text": "I'm not saying we need to change it right now. I'm just saying be aware. This one might become an issue as well", "start": 582.97, "duration": 4.619}, {"text": "Lawrence was really solid. We were thinking we're gonna have to do ADR, which is your voice replacement for the actor down the line", "start": 588.17, "duration": 5.54}, {"text": "But he sounds a lot like eonni once said there's no way we compute", "start": 593.71, "duration": 3.509}, {"text": "Effectively you have guns pointed at each other's hands", "start": 597.77, "duration": 2.719}, {"text": "I mean Ruben, here's a voice actor in the voice for Ken's in a smash brothers ultimate bring it on", "start": 600.67, "duration": 4.44}, {"text": "Got some chops. So the next step here is plenties to lock the edit", "start": 605.87, "duration": 2.869}, {"text": "He needs to export all the clips that are going to have the deep baked some of it", "start": 608.74, "duration": 2.76}, {"text": "You need to take those image sequences. We need to extract the faces from all them", "start": 611.5, "duration": 3.419}, {"text": "We need to check the alignment on the faces making sure that the eyes are exactly on the eyes and mouth", "start": 614.92, "duration": 4.23}, {"text": "That's exactly on the mouth. Otherwise, the face will jump around train the algorithm Allen the final images and then export Alton", "start": 619.15, "duration": 6.0}, {"text": "Over here, I've no mustache. Do you guys know this one? So you might not but whatever. He'll take a look", "start": 627.4, "duration": 6.14}, {"text": "We don't hurt Brett so we have to do this as an effect", "start": 639.85, "duration": 2.419}, {"text": "Unfortunately because it's nice to do things practical when Brett's involved. We got to keep him safe", "start": 642.46, "duration": 4.13}, {"text": "We've already heard him in a previous video didn't want to do that again. We have the background plate right here", "start": 646.59, "duration": 3.78}, {"text": "There's still a bunch of pieces of his head that are there, you know, that would be in the background behind the spinning heads", "start": 650.56, "duration": 5.299}, {"text": "We got to take those out remove Brett's head from the shot", "start": 655.86, "duration": 2.609}, {"text": "And then we added in the shot of Brett doing a little spinny spoon", "start": 658.47, "duration": 4.679}, {"text": "If you want to take this clip and animate it into a music video of sorts and then upload it", "start": 667.63, "duration": 4.34}, {"text": "Please tweet it at me. And so basically what I did was I I saluted his head and stabilized the footage to his head", "start": 672.43, "duration": 6.889}, {"text": "So we can take that we can", "start": 679.36, "duration": 2.0}, {"text": "Superimpose it on to the shot to merge these two shots together as a fine frames where the faces in each shot lined up", "start": 681.37, "duration": 6.859}, {"text": "roughly and we have normal Brett face right here and then", "start": 688.39, "duration": 2.9}, {"text": "We're good to go", "start": 692.74, "duration": 2.0}, {"text": "Pretty simple effect actually, but very effective an effective effect. All right, Nico", "start": 699.85, "duration": 5.09}, {"text": "I have the final cut of the counter video. I can export some final frames for you", "start": 704.94, "duration": 4.229}, {"text": "Will you be able to do some stuff overnight? Ah?", "start": 709.17, "duration": 2.0}, {"text": "It's been a long day clamp I mean the thing is I could keep baking it", "start": 712.45, "duration": 3.559}, {"text": "but honestly at this point", "start": 716.01, "duration": 0.81}, {"text": "I'm like two hundred and thirty thousand iterations into this fake and it looks about as good as it's gonna get", "start": 716.82, "duration": 5.039}, {"text": "I think this should be a concern of mine considering all the other cost of the studio", "start": 721.92, "duration": 3.33}, {"text": "But it cost 50 cents for every hour that I'm running this GPU. Really? Yeah", "start": 725.25, "duration": 4.619}, {"text": "I've been running deep fake crunches around the clock for two weeks now three weeks right three times seven times", "start": 729.9, "duration": 5.94}, {"text": "24 times 0.5 you spent", "start": 736.42, "duration": 2.57}, {"text": "$250 of deep fakes Wow if we're not doing any key on your baking tonight", "start": 739.96, "duration": 3.95}, {"text": "Then that gives us literally two days to do all of it. You think it's possible to fix a scorpion game tomorrow also", "start": 743.91, "duration": 5.309}, {"text": "I think we could do all of Keanu Reeves in a day", "start": 751.2, "duration": 2.449}, {"text": "My new computer", "start": 762.87, "duration": 1.5}, {"text": "Pocket Puget systems Thank You, Nick. Give a knife. Oh my god", "start": 764.37, "duration": 4.82}, {"text": "I can find the that's rendered four times faster. Now, it's gonna help me do this key on a deep fake a lot faster", "start": 769.19, "duration": 6.719}, {"text": "It's gonna help us make this deadline", "start": 775.91, "duration": 2.0}, {"text": "My octane renders are gonna go so fast", "start": 782.46, "duration": 2.3}, {"text": "Let's take a look at what's in this thing video cards RTX cards atti", "start": 804.12, "duration": 7.039}, {"text": "It smells like a new car in here", "start": 813.839, "duration": 2.0}, {"text": "Holy crap", "start": 817.8, "duration": 1.19}, {"text": "I can I can bake some deep fakes and render out of cinema 4d and octane at the same exact time", "start": 818.99, "duration": 5.549}, {"text": "You guys watching this video right now who know anything about computers? You're probably screaming. I plugged my harddrive into the motherboard, right? I", "start": 824.639, "duration": 7.58}, {"text": "Got my this league mistress thing right now because literally today's third like midway through Thursday, I only have Friday to finish this video", "start": 837.18, "duration": 7.01}, {"text": "So I am hoping I can get all of these deep fakes done by the end of the day program called face swap", "start": 844.19, "duration": 5.819}, {"text": "Nico turned me on to this program. Give me a little tutorial how to use it and how to harness its power", "start": 850.11, "duration": 4.969}, {"text": "It's true power. I'm cranking through", "start": 855.089, "duration": 2.059}, {"text": "we got 13 shots of", "start": 857.149, "duration": 1.541}, {"text": "Rubin to deep bay Keanu Reeves on to the shots get longer and longer as the video goes on once it's out of phase", "start": 858.69, "duration": 5.479}, {"text": "Whap it has to be composited in After Effects. So we're really kind of crunched for time here", "start": 864.17, "duration": 5.369}, {"text": "I'm eager to get working on the face flop stuff myself a big list of things to", "start": 869.54, "duration": 3.15}, {"text": "To do which is just how things go here sometimes", "start": 872.79, "duration": 2.359}, {"text": "Face whopping yet. I'll get there", "start": 876.149, "duration": 2.0}, {"text": "I'm using my computer in Nico's computer to", "start": 880.8, "duration": 2.839}, {"text": "Make this deadline while I'm actually training up my computer and then I'm setting up all the other shots on Nico's computer", "start": 884.04, "duration": 5.45}, {"text": "Thank goodness to puget is saving me some time", "start": 889.5, "duration": 4.429}, {"text": "Two thousand iterations is just what I need", "start": 903.36, "duration": 2.72}, {"text": "What suppose that's basically like it's getting more crystal-clear the more iterations you have in two thousand iterations for like a wide medium shot", "start": 906.62, "duration": 7.229}, {"text": "That's gonna be just right, but for the close-up shot 13, David", "start": 913.85, "duration": 3.66}, {"text": "I need like 15 thousand iterations doesn't take a couple hours Daniel. Luckily. Niko's P trains model to the moon and back so", "start": 917.51, "duration": 7.409}, {"text": "We're in safe hands", "start": 925.71, "duration": 2.0}, {"text": "Huge dude, I don't why I'm being weird. Yes. We're on the home stretch right now. Today's Friday video goes up tomorrow", "start": 940.599, "duration": 5.63}, {"text": "I'd say we're like a little over halfway me Peter and Nico are comping", "start": 946.439, "duration": 4.529}, {"text": "Everything together sim is mixing together sound and we're all on it. We're all having a good time. Isn't that right Peter?", "start": 950.969, "duration": 7.44}, {"text": "For puzzling it faces. It's pretty easy people. But this really cool idea actually and Peter had nothing to do with it", "start": 959.829, "duration": 6.079}, {"text": "All we have to do is add grain and compression because it's iPhone footage. It's garbage", "start": 966.459, "duration": 4.039}, {"text": "So we got to make him look like garbage even though he's in a very handsome man, Nico. I just wanna rap out 13", "start": 970.499, "duration": 5.669}, {"text": "So shot 13 is 32 seconds long we had to do manual face alignments for the first time and it's looking pretty good", "start": 980.469, "duration": 6.44}, {"text": "Try 13. I", "start": 987.149, "duration": 1.63}, {"text": "Think that's pretty good. It's really weird. It's like I'm generating a new face. That's not our original actor", "start": 988.779, "duration": 5.6}, {"text": "It's not quite key on you. It's like in-between, but it's better than nothing. It's better than really blurry and obviously fake", "start": 994.379, "duration": 4.799}, {"text": "I'm just super impressed by these programs", "start": 999.179, "duration": 2.0}, {"text": "5 and 6 are done", "start": 1001.259, "duration": 1.32}, {"text": "We were being daring mirrors said we were gonna have all the effects on like one or two days turns out it's happening", "start": 1002.579, "duration": 5.089}, {"text": "Here 7 we're like 85%", "start": 1008.009, "duration": 2.179}, {"text": "So yeah, once you guys are done with that and your computer's a free effort an hour-long render", "start": 1010.949, "duration": 3.799}, {"text": "Then we'll knock it out. I think we're gonna be able to get a beer and a Smash Bros duel", "start": 1015.629, "duration": 5.659}, {"text": "and I think it's gonna be one of those fridays so", "start": 1021.289, "duration": 3.119}, {"text": "Dean watch this", "start": 1035.419, "duration": 2.0}, {"text": "That leaves one more shot. Nico's working on it now", "start": 1037.699, "duration": 2.66}, {"text": "Waiting on me now, it's the last thing it's going out right now. It's ready put it in", "start": 1041.959, "duration": 5.03}, {"text": "Every all the files are in tier 3 everything's finished", "start": 1047.72, "duration": 2.869}, {"text": "You can't be dead now get up", "start": 1072.34, "duration": 3.53}, {"text": "Now we're going to work", "start": 1083.47, "duration": 2.0}, {"text": "All right here is stuff together", "start": 1089.7, "duration": 2.0}, {"text": "Is anyone that Keanu interacts with", "start": 1093.24, "duration": 2.659}, {"text": "It's gonna change their soul. It's like Jesus", "start": 1097.2, "duration": 3.17}, {"text": "Get ready to see a million copycats of this", "start": 1110.61, "duration": 3.079}, {"text": "I'm also kind of worried that like Keanu is not gonna be chill with this and we'll see you see how this goes", "start": 1113.69, "duration": 4.5}, {"text": "Yeah, no, don't hurt me, please Gianni. Oh if you're watching I hope you enjoyed the video", "start": 1118.25, "duration": 2.909}, {"text": "Rendering the switch is coming out", "start": 1121.769, "duration": 2.0}, {"text": "Beers here switches in hand guys", "start": 1124.2, "duration": 2.479}, {"text": "Dean we're missing you, dude", "start": 1128.789, "duration": 2.0}, {"text": "I'll give a shout to the face flop devs. They've been helping me learn a lot about deep fakes and algorithms", "start": 1133.74, "duration": 4.579}, {"text": "You guys can find faceswap on the programs to use on github. Thank you so much", "start": 1138.32, "duration": 3.719}]