[{"text": "What would happen if you were to bring \na tiny piece of the Sun to Earth?", "start": 0.94, "duration": 3.76}, {"text": "Short answer: you die.\nLong answer: it depends which piece of the Sun.", "start": 4.72, "duration": 5.42}, {"text": "Like most of the matter in the universe, \nour Sun is neither solid, liquid or gas, but plasma.", "start": 10.42, "duration": 6.48}, {"text": "Plasma is when stuff is so hot that the nuclei and electrons can separate and flow around freely,\nwhich creates a goo like substance.", "start": 16.96, "duration": 8.6}, {"text": "So, you can imagine our Sun as an extremely big, spherical ocean of very hot goo.", "start": 25.56, "duration": 5.64}, {"text": "The deeper you, go the denser and weirder the goo becomes.", "start": 31.2, "duration": 4.8}, {"text": "So let's bring 3 samples (each the size of a house), \nto our lab here on Earth and see what happens.", "start": 36.0, "duration": 5.68}, {"text": "First sample: \nthe chromosphere.", "start": 53.34, "duration": 2.62}, {"text": "The chromosphere is the atmosphere of the Sun, \na layer of sparse gas up to 5,000 kilometers deep,", "start": 56.34, "duration": 6.3}, {"text": "that's covered in a forest of plasma spikes that can be almost as big as Earth.", "start": 62.64, "duration": 4.32}, {"text": "It's pretty hot here between 6,000 and 20,000 degrees Celsius, but if we brought a solvent of it to Earth,", "start": 67.3, "duration": 5.98}, {"text": "we're not really getting our money's worth.", "start": 73.28, "duration": 2.28}, {"text": "Where we take our sample, the chromosphere is over a million times less dense than air.", "start": 75.56, "duration": 5.52}, {"text": "So, compared to our atmosphere at sea level,\nit's basically the same as bringing the vacuum of space down to Earth.", "start": 81.08, "duration": 5.9}, {"text": "The moment our sample arrives, it would immediately be crushed by Earth's atmospheric pressure and implode.", "start": 87.0, "duration": 6.48}, {"text": "Air would rush to fill the vacuum and use as much energy as 12 kilograms of TNT in the process.", "start": 93.48, "duration": 5.86}, {"text": "This creates a high pressure shockwave, which shatters glass, ruptures ear drums,", "start": 100.48, "duration": 4.12}, {"text": "and maybe some internal organs. If you're standing too close it could kill you, so you'd better keep your distance", "start": 104.609, "duration": 6.071}, {"text": "Let's go deeper.", "start": 111.64, "duration": 2.0}, {"text": "Second sample, the photosphere", "start": 113.98, "duration": 2.0}, {"text": "Beneath the chromosphere, is the glowing surface of the Sun: the photosphere, which produces the light we see.", "start": 116.98, "duration": 5.809}, {"text": "It's covered in a grid of a million hot spots called granules. Each of them about as big as the United States,", "start": 123.22, "duration": 5.7}, {"text": "and over 5,000 degrees Celsius.", "start": 128.94, "duration": 2.9}, {"text": "These granules are the tops of convective columns, churning gas that brings the heat up from the center of the Sun to its surface.", "start": 131.86, "duration": 6.949}, {"text": "In these columns, a few hundred kilometres down, we take our second plasma sample. It has about the same pressure as our atmosphere on earth", "start": 139.269, "duration": 7.28}, {"text": "Though still much less dense for there. Its heat supports it, so it won't implode.", "start": 147.18, "duration": 4.9}, {"text": "Our sphere now carries twice as much energy, as much as 25 kilograms of TNT, that this time as heat.", "start": 152.4, "duration": 6.74}, {"text": "For a dazzling instant, this plasma would glow with a million times the brightness of the Sun seen from Earth,", "start": 160.03, "duration": 5.51}, {"text": "instantly lighting fires throughout our lab, but a few milliseconds later. Those fires are all that's left.", "start": 166.0, "duration": 5.479}, {"text": "The plasma has cooled to harmless gas, floating up from the flaming ruins.", "start": 172.319, "duration": 3.929}, {"text": "What if we go deeper?", "start": 176.95, "duration": 2.0}, {"text": "Third sample. The radiative zone.", "start": 179.74, "duration": 2.42}, {"text": "Here, the plasma is about two million degrees Celsius, and so dense and tightly packed, that it creates a sort of maze for itself.", "start": 183.24, "duration": 7.1}, {"text": "Energy in the form of photons tries to escape,", "start": 191.019, "duration": 2.3}, {"text": "but has to wander for hundreds of thousands of years, bouncing endlessly from particle to particle, until it eventually finds an exit.", "start": 193.32, "duration": 6.86}, {"text": "Bringing matter from here to our lab, is what experts call, a very bad idea.", "start": 200.94, "duration": 5.4}, {"text": "As soon as it arrives in our lab, the extreme pressure that holds the plasma tightly together is gone,", "start": 206.44, "duration": 5.9}, {"text": "and the material explodes with the power of a thermonuclear weapon. Our lab as well as the city around it will be destroyed in an instant.", "start": 212.52, "duration": 7.22}, {"text": "On the bright side, there won't be any radioactive fallout.", "start": 220.26, "duration": 2.88}, {"text": "With our lab destroyed, we can abandon the illusion that we're trying to do any science today. What if we go much, much deeper?", "start": 223.62, "duration": 6.86}, {"text": "Last sample. The core", "start": 232.12, "duration": 2.0}, {"text": "Here in the central 1% of the star, we find a third of the sun's mass.", "start": 234.78, "duration": 4.7}, {"text": "The matter here is compressed by the weight of the entire star above it. In the center of the core,", "start": 239.86, "duration": 5.749}, {"text": "the temperature is 15 million degrees,", "start": 245.609, "duration": 2.651}, {"text": "hot enough to make helium by smashing together hydrogen, powering the Sun by nuclear fusion.", "start": 248.28, "duration": 5.78}, {"text": "In billions of years after the death of the Sun, this core will remain as a white dwarf.", "start": 254.92, "duration": 5.6}, {"text": "If we brought a sample of it to Earth, it would cause a lot of inconvenience", "start": 260.919, "duration": 3.65}, {"text": "The biggest nuclear weapon ever detonated, had an energy of 40 megatons of TNT, or a cube the size of the Empire State Building.", "start": 265.18, "duration": 7.82}, {"text": "Our sample has the equivalent of 4,000 megatons.", "start": 273.0, "duration": 3.5}, {"text": "This is four billion tons of TNT, or a cube 1.3 kilometers high.", "start": 277.08, "duration": 5.96}, {"text": "To give you a sense of scale this is the cube inside Manhattan.", "start": 283.26, "duration": 3.98}, {"text": "Once the sphere arrives on Earth, this super dense matter expands instantly and creates an explosion with the force of well,", "start": 288.2, "duration": 7.76}, {"text": "the Sun.", "start": 295.96, "duration": 1.689}, {"text": "If we get the sample in Paris, in the morning the citizens of London would see what looks like a second sunrise.", "start": 297.649, "duration": 5.9}, {"text": "But, one that gets brighter and brighter, and hotter and hotter, until London burns to ashes.", "start": 303.74, "duration": 5.629}, {"text": "In a radius of about 300 kilometres around the blast, everything would be burnt.", "start": 309.98, "duration": 4.92}, {"text": "The shockwave would travel around the Earth multiple times.", "start": 315.28, "duration": 3.38}, {"text": "Most buildings in Central Europe would be flattened, eardrums would rupture, and windows break across the continent.", "start": 319.819, "duration": 6.32}, {"text": "The explosion would be apocalyptic.", "start": 326.54, "duration": 2.32}, {"text": "possibly humans civilization ending.", "start": 328.86, "duration": 2.8}, {"text": "If humans did survive, we could count on the dust blown into the atmosphere to create a small ice age.", "start": 332.419, "duration": 5.089}, {"text": "So, if there is one tiny bright side, it would be that the explosion might be an effective way to control", "start": 337.9, "duration": 5.7}, {"text": "human-caused climate change for a few decades.", "start": 343.66, "duration": 2.28}, {"text": "While this is definitely a good thing, all in all we conclude, that we should not try to bring the Sun to earth", "start": 346.52, "duration": 5.42}]