[{"text": "Shoutout to Corsair for sponsoring our coverage of Computex 2018", "start": 0.0, "duration": 3.0}, {"text": "Checkout their new HS-70 gaming headset through the links below.", "start": 3.14, "duration": 3.64}, {"text": "Check our their new HS70 gaming headsets through the links below.", "start": 3.38, "duration": 3.42}, {"text": "We are here for a really exciting announcement in the ASUS ROG event.", "start": 6.78, "duration": 4.8}, {"text": "We are here for a really exciting announcement in the ASUS ROG event!", "start": 7.46, "duration": 4.56}, {"text": "This, my friends, is the ROG Phone and they are calling it 'a game changer'", "start": 11.58, "duration": 3.22}, {"text": "This, my friends, is the ROG Phone and they are calling it 'a game changer'", "start": 12.02, "duration": 6.92}, {"text": "And they are calling it a game-changer", "start": 14.8, "duration": 2.72}, {"text": "With epic performance, unbeatable visuals, and total control.", "start": 17.52, "duration": 3.92}, {"text": "with epic performance, unbeatable visuals and total control.", "start": 18.94, "duration": 3.88}, {"text": "And there are actually some pretty compelling arguments to make for that,", "start": 21.46, "duration": 3.94}, {"text": "And there are actually some pretty compelling arguments to make for that:", "start": 22.82, "duration": 4.04}, {"text": "So first of all they're using Qualcomm's fastest bin-ed Snapdragon 845 processor", "start": 25.4, "duration": 5.2}, {"text": "So first of all they're using Qualcomm's fastest Snapdragon 845 processor – this thing is clocked at 2.98 GHz under use.", "start": 26.86, "duration": 10.0}, {"text": "This thing is clocked at 2.98 GHz, under use", "start": 30.6, "duration": 6.46}, {"text": "It's got 8 GB of RAM, 128 or 512 GB of storage, so it's basically balls-to-the-wall specs", "start": 37.06, "duration": 7.82}, {"text": "It's got 8 GB of RAM, 128 or 512 GB of storage, so it's basically balls-to-the-wall spec", "start": 38.86, "duration": 5.76}, {"text": "and their plan to keep this thing cool is a vapor-chamber cooler", "start": 44.98, "duration": 4.6}, {"text": "and their plan to keep this thing cool is a vapor-chamber cooler", "start": 46.18, "duration": 4.24}, {"text": "so if you're one of those people who is not in to the whole \"yes, phones need to be much slimmer, slimmer every time\"", "start": 49.58, "duration": 5.98}, {"text": "so if you're one of those people who is not in to the whole 'yes, phones need to be much slimmer, slimmer every time'", "start": 50.42, "duration": 5.64}, {"text": "then you're going to like this, because it's got some heft to it, it's got some thickness to it,", "start": 55.56, "duration": 4.06}, {"text": "then you're going to like this, because it's got some heft to it, it's got some thickness to it, but it's also got some cooling muscle to it", "start": 56.06, "duration": 6.28}, {"text": "But its also got some cooling muscle to it.", "start": 59.62, "duration": 2.22}, {"text": "and, get this, it includes a separate cooling accessory", "start": 61.96, "duration": 4.5}, {"text": " ", "start": 65.18, "duration": 0.5}, {"text": "that clips on to a second USB Type-C port that is on the side of the phone", "start": 66.62, "duration": 6.14}, {"text": "so it's a customised one that allows you to clip this baby on, lock the phone in to place", "start": 72.76, "duration": 5.4}, {"text": "it automatically locks the phone in to landscape mode, check that out, and then you get a Type-C port down here for charging", "start": 78.38, "duration": 7.0}, {"text": "and a 3.5 mm jack so that whether you're just gaming on the phone directly like this", "start": 85.44, "duration": 6.06}, {"text": "or whether you strap on one of the optional accessories:", "start": 91.84, "duration": 3.64}, {"text": "so they're going to have a game-controller piece, and then they've also got this like dual-screen doodad", "start": 95.48, "duration": 4.6}, {"text": "that'll allow you to see like your mini-map on one display and then your game on another display for something like PUBG", "start": 100.08, "duration": 6.12}, {"text": "and then use on-screen displays.", "start": 106.2, "duration": 0.96}, {"text": "Sorry, here's a working one!", "start": 107.16, "duration": 1.74}, {"text": "And then use on-screen controls down here.", "start": 108.96, "duration": 2.88}, {"text": "You will never be bothered by your auto-rotate needing to either be set, or accidentally rotate your phone or whatever else like that", "start": 111.84, "duration": 6.88}, {"text": "Now, I know a lot of you are probably going 'well, that's terrifying, because if I need a separate doodad for my 3.5 mm jack I'm going to cry!'", "start": 118.86, "duration": 7.64}, {"text": "No no, don't worry, so on the bottom you'll find a separate USB-C port for charging, and a dedicated 3.5 mm jack.", "start": 126.66, "duration": 7.48}, {"text": "Now, not to be one-upped by Razer, they're also going after some of the key selling-points of the Razer phone:", "start": 134.28, "duration": 5.96}, {"text": "it includes dual stereo speakers, each with their own separate amplification", "start": 140.24, "duration": 5.28}, {"text": "and anecdotally we've got a couple of reps here saying it's as loud, if not louder", "start": 145.76, "duration": 5.54}, {"text": "and they've got a 4,000 mAh battery, meaning that even if you don't plug-in to this guy", "start": 151.3, "duration": 6.1}, {"text": "which has a separate 6,000 mAh battery and charges the phone while you're gaming", "start": 157.4, "duration": 4.04}, {"text": "you should be able to get a reasonably long lifetime out of this thing.", "start": 161.44, "duration": 3.7}, {"text": "Now they don't have a 120 Hz display.", "start": 165.14, "duration": 2.6}, {"text": "it's 90Hz, but from playing around in the menus it looks like it runs at 90 Hz all the time", "start": 167.86, "duration": 5.5}, {"text": "and it's an AMOLED display, so you get that 1 ms response time", "start": 173.5, "duration": 5.04}, {"text": "to go along with the 90 Hz \"Mmm\" buttery-smoothness.", "start": 178.54, "duration": 4.74}, {"text": "One last trick up its sleeve is that it has capacitive buttons at the top of the phone", "start": 183.52, "duration": 4.9}, {"text": "that you can actually use as dedicated triggers, and you can re-map them however you see fit.", "start": 188.42, "duration": 5.24}, {"text": "So I am looking forward to a full review here, where I can dig in to the camera –", "start": 193.66, "duration": 4.62}, {"text": "apparently it's similar to the Zenfone 4, which I haven't actually played with –", "start": 198.28, "duration": 5.08}, {"text": "but uhh, I mean the lighting in this room is so terrible that it's impossible for me to really draw any conclusions about it.", "start": 203.36, "duration": 6.0}, {"text": "Oh yeah – software! It's using a skin, ZenUI, so um haven't used it in a while maybe it's improved!?", "start": 209.76, "duration": 6.48}, {"text": "Thanks again to Corsair for sponsoring our content here at Computex 2018.", "start": 216.26, "duration": 4.96}, {"text": "Corsair's new HS70 wireless gaming headset offers great comfort and sound-quality", "start": 221.22, "duration": 4.64}, {"text": "with a fully-detachable microphone and up to 16 hours of battery life.", "start": 225.86, "duration": 3.66}, {"text": "It's got a wireless range of up to 40 ft with plush memory-foam and adjustable ear-cups.", "start": 229.76, "duration": 5.18}, {"text": "Check it out today at the link below.", "start": 234.94, "duration": 1.88}, {"text": "Thanks for watching guys! Subscribe so you don't miss any of our content here at Computex 2018.", "start": 236.82, "duration": 4.14}, {"text": "We'll see you at the next amazing product demo!", "start": 240.96, "duration": 3.64}, {"text": "[spooky laugh]", "start": 246.7, "duration": 1.98}, {"text": "Checkout their new HS-70 gaming headset through the links below", "start": 248.185, "duration": 0.5}]