[{"text": "This video is sponsored by Vikings: War of Clans.", "start": 0.0, "duration": 3.28}, {"text": "Build, plan and conquer in the game that lets you choose your own play-style.", "start": 3.66, "duration": 4.46}, {"text": "What kind of leader will you be as you work towards pitting your nation against others?", "start": 8.3, "duration": 4.36}, {"text": "Played by over 20 million people around the world, Vikings lets you write your own history.", "start": 12.78, "duration": 4.84}, {"text": "Click on the link in the description below and not only will you be supporting our channel", "start": 17.72, "duration": 4.18}, {"text": "but you will begin your conquest with a defensive shield and an extra 200 gold, to secure your legacy!", "start": 21.9, "duration": 7.46}, {"text": "It is the year 1033.", "start": 36.56, "duration": 2.16}, {"text": "Four years have passed since the defeat of exiled King, Olaf Haraldsson, near Stiklestad.", "start": 38.72, "duration": 5.66}, {"text": "The battle was a botched effort by Olaf to reclaim his kingdom that cost him his very life.", "start": 44.52, "duration": 6.32}, {"text": "With his supporters either dead or scattered, his remaining family sought refuge at the court of their ally, Kievan grand prince Yaroslav.", "start": 50.84, "duration": 8.08}, {"text": "Among his exiled relatives were his only son and heir (though illegitimate), 8 year old Magnus", "start": 58.92, "duration": 7.0}, {"text": "and his half-brother Harald Sigurdsson who at the age fifteen fought and was wounded alongside Olaf at the disastrous battle.", "start": 65.92, "duration": 8.82}, {"text": "Over the next three years, Harald won local renown in the military service of Yaroslav.", "start": 74.74, "duration": 5.6}, {"text": "He proved his valour and skill in various feuds against the grand prince’s opponents", "start": 80.34, "duration": 4.3}, {"text": "such as the Pechenegs, Finnic tribes and even Byzantine Empire.", "start": 84.64, "duration": 4.48}, {"text": "Though he climbed to the rank of captain, Harald quickly grew restless with the limited possibilities of serving in Kievan Rus.", "start": 89.12, "duration": 7.6}, {"text": "In 1035 he, along with a skilled retinue, left the service of Yaroslav and ventured south", "start": 96.72, "duration": 6.86}, {"text": "eventually reaching the walls of the mighty city of Constantinople, known to the Vikings as Miklagard.", "start": 103.58, "duration": 7.28}, {"text": "There he managed to find employment as a mercenary to the emperor, Michael IV.", "start": 110.86, "duration": 5.7}, {"text": "Whilst in the service of the empire, Harald saw military action in Asia Minor, Mesopotamia and the Eastern Mediterranean", "start": 116.56, "duration": 7.86}, {"text": "where his Norse naval skills were well utilised fighting Arab pirates.", "start": 124.42, "duration": 5.0}, {"text": "According to sagas, he also visited the Holy Land", "start": 129.42, "duration": 3.32}, {"text": "where he played a part in the signing of peace treaty between Emperor Michael and the Fatimid Caliphate.", "start": 132.74, "duration": 6.4}, {"text": "Over time, Harald moved through the ranks of the Byzantine army and eventually became a member of the renowned Varangian Guard", "start": 139.14, "duration": 8.04}, {"text": "which at the time consisted of many Norse mercenaries.", "start": 147.18, "duration": 3.78}, {"text": "As a commander, he took part in the Roman expeditionary force invading the Emirate of Sicily.", "start": 151.18, "duration": 6.28}, {"text": "Yet again Harald proved his cunning and ability,", "start": 157.46, "duration": 3.04}, {"text": "capturing Arab strongholds and giving rise to near-fantastical tales of his exploits.", "start": 160.5, "duration": 5.38}, {"text": "He even supposedly once faked his own death to get into a city in order to assault his enemies by surprise.", "start": 165.88, "duration": 6.84}, {"text": "Although the success of the Byzantine Empire on Sicily was short-lived,", "start": 172.88, "duration": 4.88}, {"text": "Harald always ensured that he was well rewarded for his victories, lining his own pockets.", "start": 177.76, "duration": 6.02}, {"text": "Over the years serving the emperor, he amassed a significant amount of wealth,", "start": 183.88, "duration": 4.82}, {"text": "all of which was sent to his friend Yaroslav in Kiev for safekeeping.", "start": 188.7, "duration": 4.46}, {"text": "Gaining renown within the Varangian Guard brought Harald into close contact with the Byzantine court and its affairs.", "start": 193.16, "duration": 7.38}, {"text": "His employer, Michael IV, gained the position of emperor through his marriage to Empress Zoe", "start": 200.54, "duration": 5.36}, {"text": "and earned a certain amount of independence as a ruler.", "start": 205.9, "duration": 3.24}, {"text": "But as is often the way, things changed.", "start": 209.14, "duration": 2.82}, {"text": "In 1041 Michael died. And without his benefactor, Harald found himself embroiled in the political power struggle that followed.", "start": 212.1, "duration": 7.46}, {"text": "True or not, several stories arose surrounding Harald including his imprisonment", "start": 219.56, "duration": 5.12}, {"text": "for either defrauding the throne, defiling a noblewoman or simply just for murder.", "start": 224.68, "duration": 4.42}, {"text": "It was also rumoured that he was involved in the blinding of the successor, Emperor Michael V.", "start": 229.1, "duration": 5.42}, {"text": "Clearly, courtly intrigue was far too dangerous for Harald’s liking, so he departed for his homeland of Norway… to start a civil war.", "start": 234.52, "duration": 8.12}, {"text": "He had heard of the death of King Canute and wanted to see if he could leverage this to his advantage.", "start": 242.64, "duration": 5.2}, {"text": "He made a hasty escape from Constantinople, as the new emperor forbade him and his men from leaving,", "start": 247.84, "duration": 5.84}, {"text": "but before returning to Norway, he first took his battle-hardened retinue through the Black Sea back to Kievan Rus.", "start": 253.68, "duration": 6.92}, {"text": "He reunited with his old friend, Yaroslav, promptly married his daughter and reclaimed his amassed riches.", "start": 260.6, "duration": 7.42}, {"text": "With his wealth secured, he departed for Scandinavia and in 1046, arrived in Sweden.", "start": 268.02, "duration": 6.12}, {"text": "Upon his arrival, he learned that not only was Cnut dead but so too were all his sons.", "start": 274.14, "duration": 6.02}, {"text": "The creator of the North Sea Empire had left no other heirs.", "start": 280.16, "duration": 5.12}, {"text": "What was more; Denmark and Norway were ruled by young Magnus the Good, Olaf’s bastard son and Harald’s nephew.", "start": 285.28, "duration": 8.54}, {"text": "This was a problem.", "start": 294.12, "duration": 2.06}, {"text": "Harald had ambitions of becoming king but Magnus was considered a popular ruler", "start": 296.18, "duration": 4.92}, {"text": "and his claim to the throne was far stronger than his.", "start": 301.1, "duration": 3.1}, {"text": "Nevertheless, Harald made the decision to challenge his nephew for the throne.", "start": 304.2, "duration": 5.08}, {"text": "He allied himself with another royal claimant, Sweyn Estridsen,", "start": 309.28, "duration": 4.12}, {"text": "Canute’s nephew, who unsuccessfully fought Magnus for control over Denmark.", "start": 313.4, "duration": 4.92}, {"text": "To undermine Magnus’s rule and display their dominance,", "start": 318.92, "duration": 3.08}, {"text": "they embarked on a campaign of raids along the Danish coast.", "start": 322.0, "duration": 4.08}, {"text": "Their constant harassment of the coastline eventually yielded results as Magnus proposed a political compromise.", "start": 326.08, "duration": 7.14}, {"text": "He offered Harald, and Harald alone, joint-rule over Norway.", "start": 333.22, "duration": 4.72}, {"text": "Magnus would continue to rule Denmark but also be regarded as overlord of the entire realm.", "start": 337.94, "duration": 5.64}, {"text": "Harald was reluctant to break his pact with Sweyn, who was excluded from this arrangement,", "start": 343.58, "duration": 5.14}, {"text": "but eventually accepted the deal with his nephew.", "start": 348.82, "duration": 2.96}, {"text": "It was an uneasy rule between Harald and Magnus with the two seldom able to cooperate.", "start": 352.02, "duration": 5.86}, {"text": "Harald was on the brink of taking up arms once again against his nephew", "start": 358.06, "duration": 3.9}, {"text": "but a year after their accord, Magnus suddenly died.", "start": 361.96, "duration": 3.28}, {"text": "The path to ruling the entire realm suddenly opened for Harald.", "start": 365.24, "duration": 4.58}, {"text": "But even in death, Magnus had one last card to play to spite his uncle.", "start": 369.82, "duration": 4.96}, {"text": "Magnus had named Harald’s betrayed ally, Sweyn Estridsen, as his successor to rule Denmark.", "start": 374.78, "duration": 7.96}, {"text": "This came as a shock to Harald.", "start": 383.32, "duration": 1.76}, {"text": "Immediately he launched naval attacks on the Danish coast as he had done before.", "start": 385.08, "duration": 4.76}, {"text": "But he struggled to maintain a foothold in Denmark.", "start": 389.84, "duration": 2.98}, {"text": "As soon as Harald returned to Norway after an attack, Sweyn stormed in and reclaimed his lost territory.", "start": 393.06, "duration": 7.0}, {"text": "The stalemate between the two lasted for nearly 12 years and took a great economic toll on both rulers.", "start": 400.32, "duration": 7.4}, {"text": "It was not without major victories for Harald. In 1049 he captured and burned Hedeby,", "start": 407.72, "duration": 5.72}, {"text": "a large Norse trade centre situated in southern Denmark.", "start": 413.44, "duration": 3.56}, {"text": "Still, neither side could truly overcome the other through this conflict.", "start": 417.14, "duration": 4.6}, {"text": "But Harald refused to stop. It was during this time that he earned his famous nickname, Hardrada, hard ruler.", "start": 421.74, "duration": 8.68}, {"text": "It was not until 1062 when things finally changed.", "start": 430.96, "duration": 4.08}, {"text": "Whether pushed by his people or simply exhausted by the constant attacks,", "start": 435.08, "duration": 4.14}, {"text": "Sweyn conceded to facing Hardrada in a final decisive battle.", "start": 439.36, "duration": 4.68}, {"text": "The agreed upon place would be at the mouth of Nisa river in Halland to settle things once and for all.", "start": 444.24, "duration": 7.72}, {"text": "On the 9th of August 1062, Hardrada sailed his fleet of 300 ships to the appointed spot at mouth of the river Nisa.", "start": 452.36, "duration": 8.42}, {"text": "But when he arrived, Sweyn’s fleet was nowhere to be seen.", "start": 460.94, "duration": 4.36}, {"text": "Believing Estridsen had a change of heart over the battle, Harald dismissed half of his ships,", "start": 465.44, "duration": 5.32}, {"text": "mostly consisting of farmers and inexperienced militia, back to Norway.", "start": 470.76, "duration": 4.24}, {"text": "He then prepped the remaining fleet to resume raiding the Danish coast.", "start": 475.2, "duration": 4.22}, {"text": "But as evening arrived so too did Sweyn’s fleet, having no doubt heard that half of the Norwegian fleet had departed.", "start": 479.64, "duration": 7.08}, {"text": "Estridsen had double the number of Harald’s forces but Hardrada refused to flee.", "start": 487.06, "duration": 5.46}, {"text": "Years of raiding had hardened the Norwegian navy and his were the better warriors.", "start": 492.76, "duration": 5.4}, {"text": "Hardrada ordered his longships to be roped together with his own drekar in the centre.", "start": 498.36, "duration": 4.7}, {"text": "Ships on the flanks remained untied and were led by Norwegian Jarl, Haakon Ivarsson.", "start": 503.56, "duration": 5.8}, {"text": "Though Sweyn mirrored Hardrada’s tactic and also lashed his ships together,", "start": 509.78, "duration": 4.32}, {"text": "he placed his second-in-command, Jarl Arnesson at the centre.", "start": 514.1, "duration": 4.42}, {"text": "Encouraged by his superior numbers, Estridsen took the initiative and slowly rowed forward to engage.", "start": 518.78, "duration": 6.2}, {"text": "When they got close enough, both sides traded volleys of arrows hoping to gain an early advantage.", "start": 525.06, "duration": 6.3}, {"text": "It took some time, but eventually Hardrada shortened the distance and clashed with Estridsen’s line.", "start": 531.64, "duration": 6.16}, {"text": "As the sun dipped below the horizon, fierce melee broke out.", "start": 538.08, "duration": 4.38}, {"text": "As the battle raged through the night, it seemed like neither side could gain the upper-hand.", "start": 542.58, "duration": 5.04}, {"text": "Although out-numbered, Harald’s men proved their mettle and fought the Danes in a bloody deadlock.", "start": 547.96, "duration": 6.12}, {"text": "As the battle raged on, Hardrada slowly realised that if the encounter continued as it was, he would not win.", "start": 554.44, "duration": 7.56}, {"text": "The numbers were simply against him in spite of his superior troops.", "start": 562.0, "duration": 3.78}, {"text": "But if he could not crush the Danes from the front, he would need to take them from the side.", "start": 565.78, "duration": 5.22}, {"text": "He commanded Jarl Hakon to manoeuvre his detached longboats around the battle line and attack the Danish flank.", "start": 571.46, "duration": 7.24}, {"text": "Hakon quickly overwhelmed the smaller enemy vessels on the left and applied massive pressure to the side of the Danish line.", "start": 578.98, "duration": 7.4}, {"text": "This move turned the tide of the battle.", "start": 586.68, "duration": 2.88}, {"text": "Soon Hardrada’s men started clearing the first line of Danish vessels which eventually resulted in a general retreat.", "start": 589.8, "duration": 7.12}, {"text": "The majority of Sweyn’s retinue were able to escape.", "start": 597.4, "duration": 3.18}, {"text": "The Danish King himself was taken aboard Jarl Hakon’s ship", "start": 600.72, "duration": 3.44}, {"text": "but Hardrada’s commander either didn’t recognise him or simply decided to free him, sending him to the shore.", "start": 604.4, "duration": 6.16}, {"text": "More likely, it was the latter as Hakon once served under Sweyn. Either way, Estridsen was able to escape the slaughter.", "start": 610.78, "duration": 8.88}, {"text": "As great as this victory was for Hardrada, battling through the night and winning against superior numbers,", "start": 619.66, "duration": 5.82}, {"text": "his efforts had gained him nothing.", "start": 625.48, "duration": 2.4}, {"text": "Sweyn along with the majority of the Danish fleet had escapedand Harald’s fleet had suffered losses.", "start": 627.88, "duration": 5.6}, {"text": "He was no closer to actually claiming Denmark.", "start": 633.48, "duration": 3.86}, {"text": "Weeks later, Hardrada discovered that Hakon had helped Sweyn and he ended up exiling the jarl that all but won him the battle of Nisa.", "start": 637.62, "duration": 8.58}, {"text": "The status quo persisted.", "start": 646.58, "duration": 1.98}, {"text": "Hardrada assaulted the Danish coasts for two more years but to no avail.", "start": 648.56, "duration": 4.84}, {"text": "His feud against Sweyn Estridsen could not be won.", "start": 653.62, "duration": 4.1}, {"text": "And due to the economic harm his constant campaigning brought on his kingdom,", "start": 658.06, "duration": 4.34}, {"text": "he finally agreed to sign a peace treaty ending all hostility between the two kingdoms.", "start": 662.4, "duration": 5.5}, {"text": "Even in death, Magnus had won.", "start": 667.9, "duration": 2.6}, {"text": "But Hardrada did not dwell on this as his attention was now drawn to new conquests, specifically to the shores of England.", "start": 670.5, "duration": 8.26}, {"text": "But that’s another story.", "start": 678.76, "duration": 2.92}]