[{"text": "Today’s video is sponsored by ExpressVPN.", "start": 0.22, "duration": 3.32}, {"text": "So someone slid into my Twitter DMs a little\nbit ago and asked an intriguing question.", "start": 12.14, "duration": 4.1}, {"text": "He said: I struggle a lot with holding onto\nand processing all the info in a fight, stuff", "start": 16.25, "duration": 4.81}, {"text": "like the opponent's habits and combos. Do\nyou have any advice for this?", "start": 21.06, "duration": 3.28}, {"text": "I interpreted “processing all the info in\na fight” as adaptation, and was instantly", "start": 24.34, "duration": 4.419}, {"text": "hit with a burst of inspiration for a new\nvideo. Adaptation is extremely important.", "start": 28.759, "duration": 4.991}, {"text": "It’s arguably the most important thing outside\nof knowing how to use a controller. It’s", "start": 33.75, "duration": 3.949}, {"text": "how players go from being down the whole match\nto miraculously winning. It’s why top players", "start": 37.699, "duration": 4.281}, {"text": "play 3-2 sets so often. It’s how people\nmake the sickest reads. It’s how cavemen", "start": 41.98, "duration": 4.79}, {"text": "manage to still live in the Amazon rainforest.\nNot only is it crucial to learn how to adapt,", "start": 46.77, "duration": 5.089}, {"text": "but also how to make it a natural process.\nSo, why don’t we just start the whole video", "start": 51.859, "duration": 4.0}, {"text": "thing and talk about it.", "start": 55.86, "duration": 1.4}, {"text": "I like to define adaptation as: Changing your", "start": 59.86, "duration": 2.3}, {"text": "in-game behavior based on knowledge gained\nduring a match. Now, you probably at least", "start": 62.17, "duration": 4.15}, {"text": "know how to adapt a little bit. Congrats,\nyou’ve already completed the first step.", "start": 66.32, "duration": 3.95}, {"text": "Okay, back up, what do I mean by this? Well\nlet’s say you get hit by a Pikachu thunder", "start": 70.27, "duration": 3.64}, {"text": "jolt and you’re seeing that all he’s doing\nis spamming those things. Chances are, you’ll", "start": 73.91, "duration": 4.2}, {"text": "probably avoid a thunder jolt eventually with\nshield, jump, or whatever. That’s a really", "start": 78.11, "duration": 3.83}, {"text": "simple example, but it demonstrates that you’re\nactively using your brain throughout your", "start": 81.94, "duration": 3.89}, {"text": "matches. This means that by practicing and\nlearning these principles, anyone can get", "start": 85.83, "duration": 3.81}, {"text": "good at the adapting process.", "start": 89.64, "duration": 1.79}, {"text": "Alright, now adaptation naturally gets more\nand more complex as you reach higher levels.", "start": 91.43, "duration": 3.75}, {"text": "Going back to the previous example, Pikachu\nmight notice that you’re shielding the t-jolts", "start": 95.18, "duration": 3.77}, {"text": "so he grabs you. Then you might start jumping\nto avoid the grab. Then he’ll forward air", "start": 98.95, "duration": 3.6}, {"text": "your jump and so on.\nSo how on earth are you supposed to get to", "start": 102.55, "duration": 2.89}, {"text": "this level of complexity? Thinking during\na match is distracting and it often makes", "start": 105.44, "duration": 3.67}, {"text": "people play worse. Don’t worry, I’ll cover\nthat later in this video. But first, I’m", "start": 109.11, "duration": 3.78}, {"text": "simply going to talk about how to adapt and\nthe different forms of it. Making it natural", "start": 112.89, "duration": 3.71}, {"text": "is the next step.\nAlright, so it’s important to know that", "start": 116.6, "duration": 2.58}, {"text": "adaptation isn’t always necessary. You don’t\nwant to only rely on it to do well in a match.", "start": 119.18, "duration": 5.3}, {"text": "See, you shouldn’t have to make a bunch\nof mistakes to learn that getting hit by something", "start": 124.48, "duration": 3.65}, {"text": "is bad. To use a simple example, let’s say\na Falcon throws out a Falcon punch in neutral.", "start": 128.13, "duration": 4.51}, {"text": "It shouldn’t take you getting hit by that\nfalcon punch for you to realize that it’s", "start": 132.64, "duration": 3.48}, {"text": "not good to get hit by falcon punch. It\nwould be best if you were already aware that", "start": 136.12, "duration": 3.619}, {"text": "it deals a lot of damage and knockback, and\nthat avoiding it would give you a huge window", "start": 139.739, "duration": 3.86}, {"text": "to punish.\nSame general rule applies for more complex", "start": 143.599, "duration": 2.841}, {"text": "situations. If you land unsafely on Isabelle’s\nshield, it’s usually not too much of a big", "start": 146.44, "duration": 4.53}, {"text": "deal, and you can play a bit risky around\nher hurtbox. The worst she can really do is", "start": 150.97, "duration": 3.859}, {"text": "nair. But if you’re fighting a Mario, knowing\nthat one grab could lead to either extremely", "start": 154.829, "duration": 4.001}, {"text": "high damage or a stock may get you to think\ntwice before playing the same way against", "start": 158.83, "duration": 4.189}, {"text": "him. Knowing this before the match even starts\ncan be super beneficial. It won’t take you", "start": 163.019, "duration": 4.181}, {"text": "getting Mario laddered to learn that it’s\na pretty hecking lame situation to be in.", "start": 167.2, "duration": 3.98}, {"text": "So yeah, character and game knowledge are\npretty important. Thankfully, you don’t", "start": 171.18, "duration": 3.6}, {"text": "need to play against the best player of every\nsingle character in the game 500 times to", "start": 174.78, "duration": 3.799}, {"text": "get a general idea of what to look out for.\nJust know the basic stuff like their best", "start": 178.579, "duration": 4.06}, {"text": "kill moves, how they normally get their damage,\nwhat they do in neutral, etc. This can be", "start": 182.639, "duration": 3.97}, {"text": "done by watching at least decent-level VODs\nof that character, preferably ones where they", "start": 186.609, "duration": 4.13}, {"text": "win and/or are fighting against your character.\nYou can also play around in training mode", "start": 190.739, "duration": 4.17}, {"text": "and discover what’s good about each fighter\nyourself. Now, getting high level practice", "start": 194.909, "duration": 3.59}, {"text": "in matchups can certainly help a ton, and\nyou definitely don’t want to turn down any", "start": 198.499, "duration": 3.85}, {"text": "opportunity for it. But I understand most\npeople don’t have the resources to play", "start": 202.349, "duration": 3.81}, {"text": "every good player in the world like that’s\nkinda hard, so it’s important to at least", "start": 206.159, "duration": 3.59}, {"text": "use what’s available.\nThis is all to prevent you from losing a match,", "start": 209.749, "duration": 3.061}, {"text": "even if you adapted so well. It’s way better\nto preemptively know Ivysaur dair can destroy", "start": 212.81, "duration": 5.09}, {"text": "low recoveries instead of mindlessly recovering\nlow against him and losing a stock for free.", "start": 217.9, "duration": 4.669}, {"text": "You may still adapt to the player’s patterns\nand habits eventually, but by then, you’ll", "start": 222.569, "duration": 3.791}, {"text": "have already lost to the character, regardless\nof who’s actually the better player.", "start": 226.36, "duration": 3.95}, {"text": "Alright, so you’ve got a general idea of\nevery character’s moveset. Or at least the", "start": 230.31, "duration": 3.69}, {"text": "important ones. Now, how do I do what this\nvideo’s title advertised? Adapt.", "start": 234.0, "duration": 3.919}, {"text": "A lot of the time, when people talk about\nadapting, they refer to shifting from a negative", "start": 237.919, "duration": 4.04}, {"text": "situation to a positive or at least neutral\none. There are other forms of it, but for", "start": 241.959, "duration": 4.191}, {"text": "now we’ll focus on negative to positive.\nLuigi keeps grabbing you, just adapt and don’t", "start": 246.15, "duration": 4.44}, {"text": "get grabbed. Peach keeps dairing you, just\nadapt. Yoshi keeps nairing you, just adapt.", "start": 250.59, "duration": 4.42}, {"text": "Hero keeps crit smash attacking you, ok there's\nno way to adapt to that.", "start": 255.01, "duration": 3.33}, {"text": "The most important thing is to understand\nwhy a bad situation happens and how to either", "start": 258.34, "duration": 3.69}, {"text": "combat or avoid it. Let’s say you keep landing\nhorribly and Luigi’s pivot grabbing you", "start": 262.03, "duration": 4.14}, {"text": "for it. You can solve this problem in many\nways. Land further away from him, mix up your", "start": 266.17, "duration": 4.25}, {"text": "double jump timing, land then immediately\nroll or spot dodge, the list goes on.", "start": 270.42, "duration": 3.95}, {"text": "At its core, that’s really all adapting\nis. Learning something from a match and adjusting", "start": 274.37, "duration": 3.82}, {"text": "your gameplay accordingly. But there’s also\nsomething very important to keep in mind.", "start": 278.19, "duration": 3.7}, {"text": "A good player will adapt to Luigi pivot grabbing\nand turn it into a neutral situation. A great", "start": 281.89, "duration": 4.51}, {"text": "player will turn it into a positive one for\nthem instead of Luigi. They might instantly", "start": 286.4, "duration": 4.35}, {"text": "start pressuring Luigi after he whiffs, for\nexample, abusing their stage control. They", "start": 290.75, "duration": 3.921}, {"text": "might be fast enough to just punish the grab\noutright. They might know generally what the", "start": 294.671, "duration": 3.609}, {"text": "Luigi’s gonna do after the grab and punish\nthat.", "start": 298.28, "duration": 2.37}, {"text": "So that’s how to go from a negative situation\nto a neutral or positive situation. But there’s", "start": 300.65, "duration": 4.22}, {"text": "also neutral to positive and positive to positive.\nBoth play a crucial role in controlling the", "start": 304.87, "duration": 4.31}, {"text": "pace of a game and can legit make the opponent\nfeel lost if they don’t know how to deal", "start": 309.18, "duration": 3.82}, {"text": "with them. We’re gonna cover these topics\nin just a second.", "start": 313.0, "duration": 2.45}, {"text": "But first, I’d like to take the time to\nthank today’s sponsor, ExpressVPN. Similar", "start": 315.45, "duration": 4.37}, {"text": "to how you’re gonna be adapting to opponents\nin this game, many wifi networks and hackers", "start": 319.82, "duration": 4.02}, {"text": "like to adapt to your browsing activity to\ndo who-knows-what with. ISPs sell people’s", "start": 323.84, "duration": 4.5}, {"text": "information on a regular basis, which is pretty\ndisturbing, already. But even if you’re", "start": 328.34, "duration": 4.13}, {"text": "simply using public wifi like at a Starbucks,\nhackers can still try and access everything", "start": 332.47, "duration": 4.16}, {"text": "you do, such as giving out your credit card\ninformation. We all need our privacy on the", "start": 336.63, "duration": 4.44}, {"text": "internet, and ExpressVPN allows for just that.\nThey have servers in 94 countries. Connecting", "start": 341.07, "duration": 4.57}, {"text": "to them keeps everything you do safe from\npredators, and your information is never logged.", "start": 345.64, "duration": 4.51}, {"text": "Setting up is the easiest thing in the world.\nJust select your desired location, hit this", "start": 350.15, "duration": 3.89}, {"text": "big red power button, and you’re ready to\ngo. I’ve been using the service for almost", "start": 354.04, "duration": 3.54}, {"text": "a year now and it’s been really nice knowing\nthat no one’s gonna randomly steal my Twitter", "start": 357.58, "duration": 3.84}, {"text": "password whenever I work on a video. It’s\nless than $7 a month, and there’s a 30-day", "start": 361.42, "duration": 4.171}, {"text": "money back guarantee. So find out how you\ncan get 3 months FREE by going to expressvpn.com/bananaboy.", "start": 365.591, "duration": 6.479}, {"text": "Take back your privacy today with ExpressVPN.\nSo now, how do you turn a neutral situation", "start": 372.07, "duration": 4.65}, {"text": "into a positive one? I usually like to demonstrate\nmy points with examples, but coming up with", "start": 376.72, "duration": 4.42}, {"text": "one this time was kinda hard. This is because\na truly neutral interaction in Smash is rare", "start": 381.14, "duration": 4.64}, {"text": "to come across. Even if you take a super even\ninteraction like Wolf Mario Party spamming", "start": 385.78, "duration": 4.41}, {"text": "his blaster and the opponent shielding it,\nI’d still have to give the advantage to", "start": 390.19, "duration": 3.67}, {"text": "Wolf, since he’s doing shield damage and\nis opening up opportunities to approach.", "start": 393.86, "duration": 3.53}, {"text": "But anyway, I did eventually think of an example.\nZero Suit and Pichu are dash dancing back", "start": 397.39, "duration": 4.69}, {"text": "and forth, trying to find an opening to get\nin. It happens multiple times, and Zero Suit", "start": 402.08, "duration": 4.22}, {"text": "seems to notice that it really just results\nin neither player getting an advantage. To", "start": 406.3, "duration": 4.01}, {"text": "capitalize on this, ZSS finally takes the\nopportunity and overshoots with a dash attack", "start": 410.31, "duration": 4.19}, {"text": "to hit Pichu while her defenses are down.\nThis is an example of taking a situation that’s", "start": 414.5, "duration": 4.58}, {"text": "not in either player’s favor, and adapting\nto turn it into a positive one.", "start": 419.08, "duration": 3.76}, {"text": "Lastly there’s positive to positive adaptation.\nNow, I know this sounds stupid, like how do", "start": 422.84, "duration": 4.18}, {"text": "you turn a good situation into a good situation?\nWell, prepare to be amazed because this is", "start": 427.02, "duration": 4.01}, {"text": "like the coolest thing ever.\nI actually have a real example of this from", "start": 431.03, "duration": 2.8}, {"text": "a tournament a little while ago. I’ll show\nthe clip and explain it right after.", "start": 433.83, "duration": 9.39}, {"text": "So against BestNess’s Joker, I predicted\na roll in and punished it with nair to force", "start": 443.22, "duration": 4.2}, {"text": "another tech situation. Because I already\npunished his roll in, and I was pretty sure", "start": 447.42, "duration": 3.96}, {"text": "he wouldn’t do it again since he’s good\nat the game, I covered both roll away and", "start": 451.38, "duration": 3.58}, {"text": "tech in place with a grab. The grab was intentional,\ntoo because the last punish was with a nair,", "start": 454.96, "duration": 4.54}, {"text": "so I figured he might shield to avoid it.\nThat was me acknowledging a good situation,", "start": 459.5, "duration": 3.77}, {"text": "and using my knowledge of BestNess’s playstyle\nto turn it into a better one. See, one thing", "start": 463.27, "duration": 4.15}, {"text": "I haven’t mentioned yet is that adapting\nis often times taking bits and pieces of someone’s", "start": 467.42, "duration": 4.66}, {"text": "gameplay and using it to predict the general\nkind of player they are. I know that BestNess", "start": 472.08, "duration": 3.92}, {"text": "is smart and calculated, so I was pretty sure\nthat he wouldn’t choose the same option", "start": 476.0, "duration": 3.44}, {"text": "twice in a row. The opposite applies for if\nI’m fighting a relatively new player. I", "start": 479.44, "duration": 3.67}, {"text": "assume that, since they’re not very advanced,\nit might take one or two more tech rolls in", "start": 483.11, "duration": 3.92}, {"text": "for them to finally start doing something\nelse.", "start": 487.03, "duration": 1.94}, {"text": "Now, this tech chase happened instantly, but\nyou can use positive to positive adaptation", "start": 488.97, "duration": 4.3}, {"text": "at any time throughout a game or even a whole\nset. Let’s say you hit Fox who recovers", "start": 493.27, "duration": 3.91}, {"text": "low with an Ivysaur dair. When he goes offstage\nthe next stock, feel free to try and call", "start": 497.18, "duration": 4.02}, {"text": "out a high recovery and punish.\nFinally, let’s answer the question that", "start": 501.2, "duration": 3.54}, {"text": "I know is on many of you guys' minds. How\nin the world do you do this in an actual match?", "start": 504.74, "duration": 4.96}, {"text": "It’s so difficult to keep track of every\nminiscule detail of a set within fractions", "start": 509.7, "duration": 3.98}, {"text": "of a second, store it in my brain forever,\nand pull it out in some situation I didn’t", "start": 513.68, "duration": 4.039}, {"text": "even know would be good for me. No human has\nthat kind of concentration power.", "start": 517.719, "duration": 3.56}, {"text": "Guess what? You’re right. This is all way\ntoo hard and complex for anyone to actively", "start": 521.279, "duration": 4.071}, {"text": "concentrate on during a match. So then how\ndo top players do it all the time? How do", "start": 525.35, "duration": 4.45}, {"text": "they consistently gather information on people\nand apply it with seemingly no effort?", "start": 529.8, "duration": 4.209}, {"text": "Well, that’s the key. It’s not that hard\nto them, or at least compared to how it is", "start": 534.009, "duration": 4.161}, {"text": "for most people. These people have played\nenough matches that required gargantuan amounts", "start": 538.17, "duration": 4.279}, {"text": "of brain power for said matches to eventually\nbecome manageable. See, your goal is to make", "start": 542.449, "duration": 4.671}, {"text": "this whole process of learning about the opponent\nand how to punish them natural. This doesn’t", "start": 547.12, "duration": 4.73}, {"text": "happen overnight, and you kinda just have\nto know when you’ve gotten good at it.", "start": 551.85, "duration": 3.12}, {"text": "I kinda don’t want to say this. I wish I\ncould just give you some cool piece of advice", "start": 554.97, "duration": 3.729}, {"text": "that solves all your Smash problems and makes\nadapting easy for everyone. But sadly, it", "start": 558.699, "duration": 4.57}, {"text": "is what it is. You’re gonna need a lot of\npractice against people that challenge you", "start": 563.269, "duration": 3.681}, {"text": "to really get good at adapting. This can be\ngained by playing at tournaments, Smash fests,", "start": 566.95, "duration": 4.28}, {"text": "online where there’s good connection, everything\nthat involves playing against real people.", "start": 571.23, "duration": 3.81}, {"text": "Still, it may be at least a little bit comforting\nto know that adapting started out awkward", "start": 575.04, "duration": 3.76}, {"text": "for me, too. I made the same mistakes over\nand over again, without me realizing it, for", "start": 578.8, "duration": 4.2}, {"text": "what felt like forever at the time. I thought\nI was never gonna get good at Smash. Obviously", "start": 583.0, "duration": 4.089}, {"text": "I’m not perfect now, but thankfully, after\nmany hours of practice, I finally learned", "start": 587.089, "duration": 4.35}, {"text": "how to adapt to, well, most players.\nBut yeah, the main takeaway is that it’s", "start": 591.439, "duration": 3.981}, {"text": "natural to feel lost or like you’re just\nnot smart enough to play the game yet. Trust", "start": 595.42, "duration": 3.25}, {"text": "me, everyone goes through this. What matters\nis that you keep pushing yourself and start", "start": 598.67, "duration": 3.81}, {"text": "setting goals that can be achieved realistically\nwith hard work. It won’t be easy, but if", "start": 602.48, "duration": 3.94}, {"text": "you have a passion for this game, there’s\nno doubt in my mind that you will succeed.", "start": 606.42, "duration": 3.93}, {"text": "OK last thing before I go. Meditation and\nanalyzing matches helped me a lot with adapting.", "start": 610.35, "duration": 4.2}, {"text": "I found I was able to point out my flaws easier\nand faster with these two things and focus", "start": 614.55, "duration": 3.92}, {"text": "on the match a lot more. To learn more about\nmeditation, check out my “Keeping a Good", "start": 618.47, "duration": 4.07}, {"text": "Mentality” video right here, and I’ll\nhave an analysis video coming eventually™.", "start": 622.54, "duration": 3.72}, {"text": "You don’t even have to analyze just your\nown matches. Watching VODs of top players", "start": 626.26, "duration": 4.03}, {"text": "and trying to understand their thought processes\ncan really go a long way.", "start": 630.29, "duration": 3.339}, {"text": "Oh and last last thing, I’ll be in Japan\nfor the next 2 weeks, so if I do end up releasing", "start": 633.629, "duration": 4.68}, {"text": "a video during that time, it’ll be a travel\nvlog of some sorts. My upload schedule’s", "start": 638.309, "duration": 4.171}, {"text": "great, huh? Jeez, I need to do something about\nit. OK bye.", "start": 642.48, "duration": 2.7}]