[{"text": "Ask most people what they know about trams in London, and they'll say...", "start": 0.0, "duration": 3.5}, {"text": "Erm... I know there's trams in Croydon.", "start": 3.925, "duration": 3.34}, {"text": "But I think that's it..?", "start": 7.265, "duration": 1.34}, {"text": "But did you know London used to have the biggest tram network in Europe?", "start": 9.745, "duration": 3.26}, {"text": "So what happened to it? And why is Croydon the only part of London that has trams today?", "start": 13.005, "duration": 4.575}, {"text": "♫ ♫ ♫", "start": 19.0, "duration": 2.08}, {"text": "In oldy woldy times, when pretty much every mode of transport involved a horse", "start": 25.56, "duration": 3.5}, {"text": "the best way of getting lots of people to the same place was an omnibus.", "start": 29.16, "duration": 3.38}, {"text": "It was an uncomfortable and bumpy ride.", "start": 32.64, "duration": 2.02}, {"text": "But a clever solution would be brought to London by an eccentric Victorian billionaire from America", "start": 34.88, "duration": 4.1}, {"text": "whose name was George Francis Train.", "start": 39.02, "duration": 2.16}, {"text": "Ha! Really?", "start": 41.3, "duration": 0.94}, {"text": "Mr. Train's cleverly simple idea was to have omnibuses run on rails running along the street.", "start": 42.4, "duration": 4.3}, {"text": "Mr. Train called them \"trams\".", "start": 47.16, "duration": 1.86}, {"text": "Suddenly horses could carry much heavier loads, and go much faster and smoother", "start": 49.5, "duration": 3.8}, {"text": "without giving everyone an orgasm.", "start": 53.3, "duration": 2.02}, {"text": "This also made them affordable. Fares were set at the reasonable price of half a penny.", "start": 55.66, "duration": 3.76}, {"text": "But other road users hated Train's trams.", "start": 60.02, "duration": 2.52}, {"text": "The rails weren't recessed into the road, they stuck out good and proper", "start": 62.74, "duration": 2.84}, {"text": "tripping up other vehicles and causing their wheels to break off.", "start": 65.74, "duration": 2.36}, {"text": "But Train continued to build his tramways all over London without ever asking permission first.", "start": 68.52, "duration": 4.14}, {"text": "Until he was stopped in his tracks in 1861 when he was arrested for \"Breaking and injuring the Uxbridge Road\".", "start": 72.88, "duration": 4.98}, {"text": "From now on, any entrepreneur wanting to build tramways in...", "start": 78.82, "duration": 2.54}, {"text": "From now on, any entrepreneur wanting to build tramways in London would have to bury their tracks", "start": 82.24, "duration": 3.82}, {"text": "nicely into the road out of harm's way, and pay for the maintenance of the entire road surface.", "start": 86.16, "duration": 4.9}, {"text": "This meant they now had to solve a rather sticky problem.", "start": 91.34, "duration": 3.2}, {"text": "The average horse produced between 15 and 35 pounds of manure per day.", "start": 95.46, "duration": 3.32}, {"text": "It was famously predicted that if London's horse traffic continued to increase", "start": 99.14, "duration": 3.08}, {"text": "it would be nine foot deep in horse manure by 1950.", "start": 102.38, "duration": 2.915}, {"text": "The solution eventually came at the end of the nineteenth century", "start": 105.64, "duration": 2.555}, {"text": "with a source that was safe, efficient, cheap, clean and reliable.", "start": 108.2, "duration": 3.48}, {"text": "Electricity.", "start": 111.8, "duration": 1.54}, {"text": "Electricity could be harvested either from cables above the road, or a conduit below.", "start": 116.76, "duration": 3.76}, {"text": "Now that horses were no longer required and the trams were totally turd free", "start": 120.96, "duration": 3.26}, {"text": "the network was able to grow and grow.", "start": 124.58, "duration": 2.02}, {"text": "The London County Council built new connections linking working class suburbs with industrial areas", "start": 127.0, "duration": 4.06}, {"text": "to help get people to work, making it the first truly public transport system in London.", "start": 131.06, "duration": 4.2}, {"text": "They spread particularly far in south and east London", "start": 135.72, "duration": 2.2}, {"text": "to areas which, by no coincidence at all, continue to be poorly served by the Tube.", "start": 137.96, "duration": 3.84}, {"text": "Everywhere in London was getting electric trams.", "start": 142.44, "duration": 2.96}, {"text": "Well, almost everywhere.", "start": 145.4, "duration": 1.82}, {"text": "If you look at this map of the network, you'll see a vast area close to central London", "start": 147.68, "duration": 3.7}, {"text": "where tram tracks fear to tread.", "start": 151.46, "duration": 1.66}, {"text": "These were the posh parts of town: Kensington and Westminster.", "start": 153.38, "duration": 3.2}, {"text": "Well, that's understandable I suppose. Westminster had historic streets.", "start": 157.0, "duration": 3.04}, {"text": "And those overhead cables were so ugly.", "start": 160.16, "duration": 2.22}, {"text": "That was the reason they weren't wanted here, right?", "start": 162.38, "duration": 2.48}, {"text": "Wrong. Many trams used the conduit system with no visible cables.", "start": 165.32, "duration": 3.58}, {"text": "So, if it wasn't cables, why were they so trams-phobic?", "start": 169.1, "duration": 3.42}, {"text": "Trams, for want of a better expression, were for poor people.", "start": 172.98, "duration": 2.94}, {"text": "Local campaigners complained that trams catered for \"an undesirable class of person\"", "start": 176.74, "duration": 3.9}, {"text": "and successfully kept the entire central London area unbetrammed.", "start": 180.8, "duration": 2.96}, {"text": "- Thank you, Sir.", "start": 184.02, "duration": 0.92}, {"text": "Because of this, two vast networks north and south of the river remained unconnected.", "start": 185.36, "duration": 4.26}, {"text": "Not because of the Thames, but because of toffs.", "start": 189.78, "duration": 2.32}, {"text": "And it would stay like this until 1906, when a big and very impressive tramfrastructure project was built here.", "start": 192.26, "duration": 6.12}, {"text": "Kingsway in Holborn was built by bulldozing straight down the middle of the slums.", "start": 199.04, "duration": 3.8}, {"text": "The Victorians used to do this sort of thing all the time", "start": 203.22, "duration": 2.1}, {"text": "but Kingsway was special because it came with its very own tram tunnel", "start": 205.46, "duration": 3.66}, {"text": "something never done in London before, or since.", "start": 209.18, "duration": 2.38}, {"text": "This small but truly unique piece of track linking north to south meant that by 1914", "start": 211.9, "duration": 4.34}, {"text": "London had the biggest tram network in Europe.\n- Yaay!", "start": 216.46, "duration": 3.3}, {"text": "But not for long.\n- Awww.", "start": 219.76, "duration": 2.42}, {"text": "After WWI, money was tight, and tram rails were expensive to maintain.", "start": 222.64, "duration": 4.04}, {"text": "So the tram operators began turning to a newer, cheaper piece of technology - the trolleybus.", "start": 226.98, "duration": 4.94}, {"text": "Trolleybuses were like trams but on pneumatic tyres.", "start": 232.78, "duration": 2.44}, {"text": "They didn't need rails, which meant they were quieter and more flexible", "start": 235.54, "duration": 2.66}, {"text": "and they could overtake things, like this dick.", "start": 238.38, "duration": 2.08}, {"text": "It was the beginning of the end for the tram. And the middle of the beginning for the trolleybus.", "start": 240.84, "duration": 4.04}, {"text": "But alas, alack, London's trolleybuses were not long for this world.", "start": 245.02, "duration": 4.06}, {"text": "One person whose fault this was, was Minister for Transport Ernest Marples", "start": 249.86, "duration": 3.14}, {"text": "the man responsible for provisional driving licences, MOTs, traffic wardens,", "start": 253.06, "duration": 2.96}, {"text": "single yellow lines, double yellow lines, Doctor Beeching, and several affairs with prostitutes.", "start": 256.02, "duration": 3.48}, {"text": "Marples wanted people driving more, partly because the car was a symbol for individual freedom", "start": 259.88, "duration": 4.16}, {"text": "but partly because Marples's family ran a tarmac company.", "start": 264.04, "duration": 3.12}, {"text": "Marples got councils to change their streets to make more room for cars", "start": 267.92, "duration": 3.0}, {"text": "which meant cables had to be torn down.", "start": 270.92, "duration": 1.7}, {"text": "London's vast network of trams and trolleybuses would need to be replaced by motor buses.", "start": 272.78, "duration": 4.08}, {"text": "Until then, the idea of getting motor buses to take on such a big job was unthinkable.", "start": 277.24, "duration": 4.04}, {"text": "Motor buses were small and heavy and noisy and inefficient.", "start": 281.36, "duration": 3.18}, {"text": "But that would all change...\n* ding ding *\nin 1959.", "start": 284.92, "duration": 2.78}, {"text": "The new Routemaster bus which was super efficient and ran on diesel", "start": 288.76, "duration": 2.76}, {"text": "could carry almost as many people as a trolleybus, but had two massive advantages.", "start": 291.52, "duration": 3.92}, {"text": "1. Drivers wouldn't have to worry about the trolley poles coming loose", "start": 295.54, "duration": 2.76}, {"text": "and 2. They could overtake each other. In fact, they could go literally anywhere.", "start": 298.5, "duration": 3.8}, {"text": "With diesel fuel now cheaper than ever, it was a no-brainer.", "start": 303.12, "duration": 2.86}, {"text": "From 1959, Routemasters began replacing tram and trolleybus routes all over London.", "start": 306.14, "duration": 4.74}, {"text": "The network's capacity was reduced slightly.", "start": 311.44, "duration": 1.72}, {"text": "but since passenger numbers were dwindling anyway, nobody cared.", "start": 313.34, "duration": 3.14}, {"text": "Well, lots of people cared and they were really upset about it. But nobody who mattered cared.", "start": 316.94, "duration": 4.2}, {"text": "It was out with the... *electric motor noise*,\nand in with the... *diesel engine noise*", "start": 321.56, "duration": 5.18}, {"text": "So is there anything left of London's tram and trolleybus network that you can still see today?", "start": 328.22, "duration": 3.96}, {"text": "Well...", "start": 333.26, "duration": 1.02}, {"text": "There are a few surviving tram sheds, some still with tram tracks in.", "start": 334.82, "duration": 2.86}, {"text": "Eh.", "start": 338.16, "duration": 0.6}, {"text": "There's a couple of trolley poles still there that are now used as lamp posts.", "start": 339.2, "duration": 2.8}, {"text": "Ooh!", "start": 342.04, "duration": 0.94}, {"text": "There's a bus route in west London that still uses the number 607, the same as the original trolley...", "start": 343.28, "duration": 3.92}, {"text": "Boring!", "start": 347.2, "duration": 1.46}, {"text": "And this building in Walthamstow has the word \"tramway\" on it.", "start": 348.84, "duration": 2.9}, {"text": "So the answer is no, not really. Nothing impressive.", "start": 352.4, "duration": 3.08}, {"text": "With one massive exception.", "start": 355.86, "duration": 2.32}, {"text": "This...  this...", "start": 358.54, "duration": 2.02}, {"text": "This is what's left of the Kingsway Tunnel.", "start": 360.84, "duration": 2.66}, {"text": "You can still see very very very clearly where the tram tunnel entrance used to be.", "start": 364.18, "duration": 3.3}, {"text": "Sometimes they open it up for tours, sometimes they use it as an art gallery", "start": 367.92, "duration": 2.915}, {"text": "but at the moment it's being used to help Crossrail construction.", "start": 370.94, "duration": 2.4}, {"text": "Down at the other end, the entrance has been turned into the door of a night club", "start": 373.78, "duration": 3.06}, {"text": "and the middle half has been turned into the Strand Underpass.", "start": 377.08, "duration": 3.04}, {"text": "And so, the trams and trolleybuses had gone, and London forgot about them.", "start": 380.88, "duration": 3.98}, {"text": "And so did the whole country.", "start": 385.0, "duration": 1.46}, {"text": "Cities up and down the UK were ripping up their tram tracks and pulling down their trolley cables.", "start": 386.78, "duration": 4.34}, {"text": "The only place in the country that kept its tram was Blackpool pleasure beach.", "start": 391.54, "duration": 3.16}, {"text": "Trams, for decades, evoked images of nostalgia and the olden days.", "start": 395.08, "duration": 3.26}, {"text": "- I used to take the tram for a farthing.", "start": 398.52, "duration": 2.615}, {"text": "Even the word \"tram\" was funny.", "start": 401.3, "duration": 1.52}, {"text": "- ...straight in front of a tram.", "start": 403.1, "duration": 1.38}, {"text": "But then, something changed.", "start": 404.8, "duration": 2.34}, {"text": "Traffic congestion was worsening,", "start": 407.82, "duration": 1.8}, {"text": "Demand for public transport was increasing,", "start": 409.76, "duration": 2.2}, {"text": "Pollution became a thing,", "start": 412.02, "duration": 1.48}, {"text": "and trams, suddenly, all of a sudden, had gradually started to suddenly become appealing again.", "start": 413.74, "duration": 4.36}, {"text": "Croydon in south London which had a growing town centre and no Tube", "start": 418.7, "duration": 3.28}, {"text": "was the perfect place for a 21st century experiment.", "start": 421.98, "duration": 3.06}, {"text": "For the first time in 48 years, trams were coming back.", "start": 425.34, "duration": 3.72}, {"text": "These trams would be a fair bit different from the 20th century ones.", "start": 430.12, "duration": 2.7}, {"text": "They were single, not double decker", "start": 433.02, "duration": 1.58}, {"text": "And they were multiple articulated units.\nWhich basically means they're bendy.", "start": 434.8, "duration": 3.32}, {"text": "As well as running on the streets, the new trams would make use of bits of disused or underused railways", "start": 439.02, "duration": 4.24}, {"text": "combining the on-street convenience of buses, with the separate-ness and speed of trains.", "start": 443.36, "duration": 4.24}, {"text": "The Croydon Tramlink, opened in 2000, was an instant hit, attracting 15m passengers in its first year", "start": 448.14, "duration": 5.8}, {"text": "and that number's kept going up ever since.", "start": 453.94, "duration": 2.1}, {"text": "At around the same time, very similar tram schemes opened in Manchester, Nottingham, Sheffield,", "start": 456.36, "duration": 3.6}, {"text": "Birmingham, and Edinburgh. And don't get me started on the resurgence of trams in the rest of Europe.", "start": 459.96, "duration": 3.96}, {"text": "So trams are very much back in business for the 21th century.", "start": 464.46, "duration": 2.96}, {"text": "But what about London? Are there plans for any more new tram routes in London?", "start": 468.0, "duration": 3.34}, {"text": "The Cross River Tramway, planned to open in 2016", "start": 472.08, "duration": 2.6}, {"text": "was meant to run from Camden Town to Peckham/Brixton.", "start": 474.74, "duration": 2.54}, {"text": "The route used Kingsway, but bafflingly had no intention of using the old Kingsway tunnel,", "start": 477.74, "duration": 3.38}, {"text": "instead running on the street above.", "start": 481.3, "duration": 1.68}, {"text": "The scheme had plenty of support, but not enough plenty of money. So it never happened.", "start": 483.38, "duration": 3.52}, {"text": "Then there was the West London Tram", "start": 487.76, "duration": 1.56}, {"text": "planned to run along one of London's busiest bus corridors from Shepherds Bush to Uxbridge.", "start": 489.32, "duration": 3.8}, {"text": "But two burly men in suits holding a big sign were stood in the way", "start": 493.4, "duration": 2.78}, {"text": "so this never happened either.", "start": 496.26, "duration": 1.4}, {"text": "To be fair, a road like this isn't suitable for modern trams, and most of London isn't.", "start": 498.1, "duration": 3.94}, {"text": "To dig up a street this narrow to build the tracks would be prohibiti-tively impractica-cactical.", "start": 502.08, "duration": 4.02}, {"text": "Some campaigners tried to save the West London Tram by suggesting a compromise", "start": 506.94, "duration": 3.06}, {"text": "where they just put the electricity cables up and make it a West London Trolleybus instead.", "start": 510.12, "duration": 3.82}, {"text": "Personally, I think that would have been a brilliant idea.", "start": 514.38, "duration": 2.26}, {"text": "A trolleybus is the best of both worlds: Cheaper and easier to build than a tram", "start": 516.64, "duration": 3.6}, {"text": "but it still replaces noisy polluting buses.", "start": 520.24, "duration": 2.42}, {"text": "In fact, come to think of it, why don't we do that everywhere?", "start": 523.12, "duration": 3.12}, {"text": "London's more than 8,000 buses are a huge source of dangerous pollutey air that kills", "start": 526.68, "duration": 3.66}, {"text": "that kills 9,500 people per year.", "start": 530.34, "duration": 2.24}, {"text": "TfL have tried to make them greener, but the best they've been able to come up with", "start": 533.22, "duration": 3.14}, {"text": "is a hybrid bus that uses its diesel engine a mere most of the time.", "start": 536.36, "duration": 3.28}, {"text": "The bad news is, the technology for a 100% pollution-free bus that doesn't need cables at all", "start": 540.06, "duration": 4.74}, {"text": "is not coming any time soon. So I say, let's get a groove on and hang those cables back up!", "start": 544.8, "duration": 4.92}, {"text": "A modern trolleybus would only need cables on two thirds of its route", "start": 550.44, "duration": 2.86}, {"text": "and those cable wouldn't need to be so spider webby anymore.", "start": 553.42, "duration": 2.92}, {"text": "There's no avoiding it, those overhead wires would still be fugly", "start": 556.72, "duration": 2.94}, {"text": "But it's not just technology that's moved on, it's our priorities too.", "start": 559.94, "duration": 3.32}, {"text": "And if 21st century Londoners finally get to breathe clean air", "start": 563.44, "duration": 2.98}, {"text": "then those hideous wires might end up looking quite beautiful.", "start": 566.62, "duration": 3.38}, {"text": "- Hey do you want to hear my new podcast?\n- No.", "start": 573.56, "duration": 1.96}, {"text": "Great! It's called \"Mates Bants\" with an 8 and a Z.", "start": 575.64, "duration": 3.42}, {"text": "(very muffled, crackly, barely audible male chatting and laughing)", "start": 579.98, "duration": 7.8}, {"text": "- The audio quality's really terrible.\n- Oh! I knew I was no good at recording podcasts.", "start": 588.18, "duration": 5.72}, {"text": "I don't have the knowledge how to do it. I'm rubbish.", "start": 594.12, "duration": 4.32}, {"text": "There there. I have a solution for you.", "start": 598.74, "duration": 2.02}, {"text": "Why don't you sign up for a monthly subscription to Skillshare?", "start": 601.0, "duration": 2.46}, {"text": "Skillshare is an online learning tool where you can take a course about how to make podcasts sound good", "start": 603.8, "duration": 4.18}, {"text": "or if podcasts aren't the thing you want to get better at", "start": 607.98, "duration": 2.48}, {"text": "there are courses about music production, or video editing", "start": 610.46, "duration": 2.64}, {"text": "That's my favourite!", "start": 613.1, "duration": 1.1}, {"text": "or animation. What's more, if you click the link in the description below", "start": 614.24, "duration": 3.04}, {"text": "the first 500 of you will get Skillshare for free for the first two months.", "start": 617.28, "duration": 3.48}, {"text": "Oh my gosh, thank you! How can I ever repay you?", "start": 621.06, "duration": 3.16}, {"text": "Just under ten dollars per month should do it.", "start": 624.44, "duration": 1.94}, {"text": "That's how much it costs for an annual subscription to Skillshare.", "start": 626.44, "duration": 2.6}, {"text": "- When I say \"skillsh\", you say \"air\". Skillsh!\n- Air!", "start": 629.42, "duration": 2.6}, {"text": "- Skillsh! - Air! - Skillsh! - Air!", "start": 632.12, "duration": 1.62}, {"text": "...\n- Air!", "start": 633.96, "duration": 0.84}, {"text": "- Ah, I didn't say \"Skillsh\"\n- Ohh!!", "start": 635.0, "duration": 1.0}]