[{"text": "Hey guys, welcome back to Basics with Babish", "start": 0.069, "duration": 1.931}, {"text": "This week I'm a little under the weather,", "start": 2.1, "duration": 1.289}, {"text": "But that's not gonna stop me from teaching you how to make bread.", "start": 3.389, "duration": 3.411}, {"text": "A process that takes a little more than plain old flour, and turns it into something delicious", "start": 6.9, "duration": 4.3}, {"text": "You can actually eat.", "start": 11.3, "duration": 0.9}, {"text": "Let's get down to basics", "start": 12.2, "duration": 0.699}, {"text": "(intro music)", "start": 16.3, "duration": 10.3}, {"text": "Basics with Babish and the all-new Basics with Babish.com are brought to you by Squarespace.", "start": 30.89, "duration": 5.01}, {"text": "Head there now to checkout recipes from the show, kitchen equipment lists,", "start": 35.9, "duration": 3.3}, {"text": "My personal blog post, and more", "start": 39.2, "duration": 2.4}, {"text": "Get 10% off your first Squarespace order with offer code: Babish.", "start": 41.6, "duration": 3.5}, {"text": "Whether you need a domain, or website, or online store, make your next move with Squarespace.", "start": 45.1, "duration": 4.4}, {"text": "All right, so we're gonna start off with Jim Lahey's now-famous: No-Knead bread technique", "start": 49.5, "duration": 4.809}, {"text": "this is gonna start with", "start": 54.309, "duration": 1.511}, {"text": "400 grams of bread flour. Bread flour has a higher protein content and, it's going to help us develop better gluten in our bread", "start": 55.82, "duration": 6.28}, {"text": "To this we are going to add one gram, or 1/4 teaspoon, of any kind of yeast, instant or active dry", "start": 62.1, "duration": 5.59}, {"text": "We're gonna whisk these together with our cute little whisk and then we're going to add about 10 grams, or one and a half teaspoons,", "start": 67.69, "duration": 5.429}, {"text": "Of kosher salt. If you use table salt, keep it at 10 grams,", "start": 73.119, "duration": 3.21}, {"text": "But use more like three-quarters of a teaspoon", "start": 76.33, "duration": 2.039}, {"text": "Then to this we're going to add one and 1/3 cups of room-temperature water. And here's where the easy part starts.", "start": 78.38, "duration": 6.139}, {"text": "We're going to gently mix the whole affair together, until a rough ball of dough forms.", "start": 84.52, "duration": 4.709}, {"text": "No kneading as they say. Cover with plastic wrap and let sit at room temperature for 12 to 24 hours, or until it", "start": 89.229, "duration": 6.96}, {"text": "looks like this. Lacy, filled with big beautiful bubbles, and reeking of", "start": 96.19, "duration": 3.93}, {"text": "Fermentation. And we're going to turn this out onto a very heavily floured work surface", "start": 100.3, "duration": 3.6}, {"text": "Now in this step we're just trying to punch it down and shape it", "start": 104.08, "duration": 3.0}, {"text": "We're not trying to work any of the flour into the dough. So make sure that you're not needing it", "start": 107.08, "duration": 4.76}, {"text": "we're just grabbing the corners and pulling them in towards the center until we have a heavily floured smooth and taut top to our", "start": 111.85, "duration": 7.11}, {"text": "Loaf once you've got a large round smooth surface start pulling the dough in towards the bottom", "start": 118.96, "duration": 4.139}, {"text": "Shaping it into a little pool as it's called and placing onto some flour", "start": 123.17, "duration": 4.16}, {"text": "Parchment paper and now we're going to heavily dust and clean kitchen towel", "start": 127.46, "duration": 3.379}, {"text": "I hope I don't have to stay clean", "start": 130.84, "duration": 1.8}, {"text": "But you know", "start": 132.64, "duration": 0.629}, {"text": "Don't be a monster use a clean towel and flour it liberally so it does not stick to the dough because it's going to cover", "start": 133.269, "duration": 5.55}, {"text": "The dough for the next one to two hours or until it has grown by about 50% not quite double during this time", "start": 138.819, "duration": 6.3}, {"text": "we're preheating our oven as hot as it can go with a", "start": 145.12, "duration": 2.429}, {"text": "cast-iron Dutch oven inside of it for at least an hour", "start": 147.62, "duration": 2.6}, {"text": "Then we are cutting our parchment paper down to size for easy droppage scoring the top of the loaf with", "start": 150.22, "duration": 4.799}, {"text": "Pattern you like using a bread knife or a razor blade and dropping below rectly into our preheated cast iron then right before we cover", "start": 155.28, "duration": 7.11}, {"text": "It in place in the oven we're going to spray it down. Liberally with plain old water", "start": 162.39, "duration": 3.69}, {"text": "this is gonna help the ovens spring as it's called or the", "start": 166.08, "duration": 2.789}, {"text": "Rising that the bread does in the oven with a little grimace at how hot our oven is", "start": 168.94, "duration": 3.679}, {"text": "We're and make this guy for about 30 minutes removing the lid and giving it one last spritz of water", "start": 172.62, "duration": 4.29}, {"text": "But halfway through the baking process at the end of which we are going to be", "start": 176.91, "duration": 3.569}, {"text": "Rewarded with a site that looks a little bit like this and trust me", "start": 180.55, "duration": 3.86}, {"text": "There are very few sensations in life finer than smelling the bread that you've made from scratch emerge from the oven", "start": 184.41, "duration": 5.699}, {"text": "But we've got to be patient and let this guy cool completely before digging in about two hours", "start": 190.11, "duration": 4.199}, {"text": "I know that's a long time to wait", "start": 194.32, "duration": 1.669}, {"text": "But you will ruin the texture of your bread if you cut into it too early now", "start": 195.989, "duration": 3.57}, {"text": "There are a thousand different factors that can change the size of the holes and the crumb of your bread to the brownness of its", "start": 199.56, "duration": 5.1}, {"text": "Crust to the largeness of its oven spring but the no need method is a very reliable way to end up with a delicious loaf", "start": 204.66, "duration": 6.75}, {"text": "Almost every time we'll cover the trickier techniques in the bread part two. But for now it's time to move on to another easy riser", "start": 211.41, "duration": 6.72}, {"text": "So to speak that's right", "start": 219.22, "duration": 2.0}, {"text": "Focaccia with a recipe adapted from bone Appetit into the bowl of a stand mixer with the dough hook affixed", "start": 221.22, "duration": 5.489}, {"text": "We are dumping 850 grams of bread flour followed by 2 and 1/2 cups of room-temperature water", "start": 226.709, "duration": 5.58}, {"text": "We're gonna mix those on low speed for a few minutes while they're mixing", "start": 232.329, "duration": 3.11}, {"text": "We're going to combine a half a cup of water measuring about 105 degrees Fahrenheit with a whole packet of active dry yeast", "start": 235.44, "duration": 6.119}, {"text": "along with a small pinch of sugar", "start": 241.81, "duration": 1.709}, {"text": "This is just gonna give the yeast a little bit more to eat. Whisk those together", "start": 243.519, "duration": 3.529}, {"text": "Let them stand at room temperature for about 5 minutes until foamy and add them to the shaggy ball of dough you have forming in", "start": 247.049, "duration": 6.45}, {"text": "Your stand mixer as the extra water is fully absorbed", "start": 253.5, "duration": 2.489}, {"text": "We're going to add in 2 tablespoons", "start": 255.989, "duration": 1.661}, {"text": "Of kosher salt and then knead with the dough hook on medium speed for about 5 minutes when you're done", "start": 257.65, "duration": 5.899}, {"text": "You're gonna be left with this very sticky dough, but do not fear. That's what we're after focaccia dough is usually very hydrated", "start": 263.55, "duration": 6.239}, {"text": "So it has an open airy crumb we're gonna let it rise in a large", "start": 269.789, "duration": 3.84}, {"text": "Generously oiled Bowl covered in plastic wrap for about 2 hours or until it has doubled in size", "start": 273.88, "duration": 5.029}, {"text": "Now to continue encouraging gluten formation", "start": 279.31, "duration": 2.33}, {"text": "We're going to fold the dough onto itself a couple times by pulling it away from the edges of the bowl", "start": 281.64, "duration": 4.489}, {"text": "This might not look like much but it actually does a lot then we are hitting an 18 by", "start": 286.13, "duration": 4.2}, {"text": "13 rimmed baking sheet or half sheet with about a half a cup of olive oil", "start": 290.52, "duration": 4.429}, {"text": "This might seem like a lot but you could actually do even more than this and it would only make your focaccia better", "start": 294.95, "duration": 4.589}, {"text": "We're gonna fold the dough onto itself a couple more times again to encourage gluten development and then it's time to start shaping it", "start": 299.54, "duration": 6.119}, {"text": "Into the size of the pan. It might show some", "start": 305.85, "duration": 2.45}, {"text": "resistance and spring back on you if it does oil it and cover it with plastic wrap for 15 minutes to let the gluten to", "start": 308.46, "duration": 6.079}, {"text": "Relax, you might have to do this one or two times, but you will find by the end of this process", "start": 314.54, "duration": 4.11}, {"text": "It will easily be coasts into the edges of the pan. Once you've got the pan filled out", "start": 318.65, "duration": 4.5}, {"text": "it's time to generously oil the top of our dough cover once again in plastic wrap and", "start": 323.15, "duration": 4.589}, {"text": "Ferment overnight in the fridge about 12 hours as you can see here. Mine is really large and bubbly", "start": 328.17, "duration": 5.179}, {"text": "I kind of over fermented it so I'm popping bubbles and pulling it away from the sides of the pan so it doesn't stick in", "start": 333.35, "duration": 5.07}, {"text": "the oven and then with oiled fingers", "start": 338.42, "duration": 1.32}, {"text": "I'm placing those characteristic dimples on top of the focaccia", "start": 339.74, "duration": 3.0}, {"text": "Hitting it with a little bit of olive oil and letting it come up to room temperature", "start": 342.9, "duration": 3.019}, {"text": "Under plastic wrap about an hour while it's doing that", "start": 346.14, "duration": 2.69}, {"text": "we are preheating our oven again for a full hour at", "start": 348.83, "duration": 2.549}, {"text": "450 degrees Fahrenheit for giving this guy one last drizzle of oil and a generous sprinkle of big", "start": 351.72, "duration": 5.059}, {"text": "flaky", "start": 356.91, "duration": 0.57}, {"text": "Bolden's salt and popping it in the oven for about half an hour until it looks like this it should pull away from the pan", "start": 357.48, "duration": 6.35}, {"text": "Pretty easily if you oiled it properly", "start": 363.83, "duration": 1.83}, {"text": "If not, just try to get under there with a sharp spatula and scrape it off. Just like our other loaf of bread", "start": 365.66, "duration": 5.04}, {"text": "We're letting this guy cool completely on a rack about an hour and a half before finally cracking him open first", "start": 370.7, "duration": 5.609}, {"text": "We got to admire it a little bit. I mean look at it you made this", "start": 376.31, "duration": 2.49}, {"text": "Well, I made this but you'll make the one that you make and if you think about it, that's pretty cool", "start": 378.8, "duration": 4.739}, {"text": "This stuff works great for big fat Italian sandwiches like a praise a and prosciutto eaten with cheese or meats", "start": 383.54, "duration": 5.94}, {"text": "and it's a pretty impressive relatively forgiving way to enter the world of bread baking but my favorite way to eat it is with", "start": 389.48, "duration": 6.359}, {"text": "even more oil that is cut into strips like you get in a restaurant and dipped into a waiting pool of", "start": 396.09, "duration": 5.51}, {"text": "Extra-virgin olive oil salt freshly ground pepper and what the hell some grated Parmesan cheese", "start": 401.82, "duration": 5.48}, {"text": "I mean, we're making bread here not zucchini noodles. We might as well do it right", "start": 407.3, "duration": 3.269}, {"text": "So I just want to talk a little bit about designing my new website with Squarespace", "start": 411.33, "duration": 3.92}, {"text": "They have this really intuitive easy-to-use platform. That made it super easy", "start": 415.53, "duration": 3.619}, {"text": "Even for somebody like me who's never done web design ever they have templates", "start": 419.15, "duration": 4.29}, {"text": "They do domain stamp really good customer service is really an all-in-one one-stop shop for building a really slick website", "start": 423.44, "duration": 6.599}, {"text": "And I was really happy with the way mine came out if you want to try it for yourself", "start": 430.04, "duration": 3.48}, {"text": "You can start your free trial today at squarespace.com and enter offer code \"babish\" to get 10% off your first purchase", "start": 433.52, "duration": 5.7}]