[{"text": "In last week's VFX artists react video we talked about the muzzle flashes in John wick and how they're not an accurate", "start": 0.03, "duration": 5.1}, {"text": "Representation of real muzzle flashes they serve the purpose of the movie, but I think we can improve them", "start": 5.41, "duration": 4.7}, {"text": "I think we can make them better. So that's one of the things we do here at corridor fake guns", "start": 10.11, "duration": 3.51}, {"text": "Now this is not going to be quite as crazy of a change as a Scorpion King instead of we're going to see as us", "start": 17.05, "duration": 4.729}, {"text": "Taking an artistry in craft that we have spent years honing", "start": 21.779, "duration": 3.06}, {"text": "We're gonna try to make them more accurate to real-life muzzle flashes would be an improvement. Would it be unnoticeable?", "start": 24.85, "duration": 5.809}, {"text": "What does matter in the world of action and what subtle things can make a difference you will see?", "start": 30.76, "duration": 4.969}, {"text": "Some scenes for John wick with the gun effects completely redone by us and you let us know if you think it's an improvement", "start": 36.04, "duration": 5.929}, {"text": "It's time to get to work", "start": 42.37, "duration": 2.0}, {"text": "Are you thinking John wick a lot John wick dude me too? I love it an amazing choreography those gun effects", "start": 46.39, "duration": 6.59}, {"text": "I just I don't think they look all that great. Here's the first house", "start": 52.98, "duration": 3.959}, {"text": "The most important thing is the burst of light and they're getting that the exposure of the muzzle flashes feels off", "start": 66.58, "duration": 5.599}, {"text": "Like I feel like they need to be more blown out. They're shooting in almost complete darkness. Yeah. I mean the gun handling is great", "start": 72.18, "duration": 5.43}, {"text": "We do a lot of action videos here at corridor, especially with guns you've been doing gun videos for a long time", "start": 80.08, "duration": 5.449}, {"text": "We've hardened real guns for various videos. We've done blank firing guns for various videos", "start": 85.53, "duration": 4.08}, {"text": "We've done a lot of CG muzzle flashes because when you're on set both real guns and blank firing guns", "start": 89.61, "duration": 5.279}, {"text": "Tend not to be too practical", "start": 94.89, "duration": 1.18}, {"text": "the thing is if blank firing guns are actually dangerous because you're still", "start": 96.07, "duration": 3.169}, {"text": "Ejecting a ton of force from the front of the pistol", "start": 99.49, "duration": 2.06}, {"text": "Now we talked about this in our visual effects artist react ever", "start": 101.55, "duration": 2.309}, {"text": "So that went up last week, but when you're in this close quarters", "start": 103.86, "duration": 2.699}, {"text": "You can't use a blank firing gun because it can actually hurt and kill the person in front you with just that muzzle explosion", "start": 106.6, "duration": 6.26}, {"text": "So if we leave close quarter combat scenes, they're using barrel plug blank guns functionally, very similar to a gas blowback airsoft gun", "start": 112.86, "duration": 6.809}, {"text": "And they're adding the effects afterwards of the gunshots. Thanks to our experience doing it. For real", "start": 119.67, "duration": 4.979}, {"text": "We know what it should look like. So let's break it down friend by frame for a second here", "start": 124.81, "duration": 4.04}, {"text": "We have a muzzle flash and we have some fake lighting being added to the scene, you know", "start": 128.85, "duration": 3.599}, {"text": "They're kind of lightening up the people around it", "start": 132.45, "duration": 1.62}, {"text": "but the fake lighting is only right here and the side of this guy's not getting hit with light the background here is not really", "start": 134.07, "duration": 5.639}, {"text": "Getting it with light. There's no shadow of like John wick on the background and in the second frame", "start": 139.709, "duration": 3.809}, {"text": "There's just a weird half transparent muzzle flash. That's not what happens in real life when you film blank firing guns", "start": 143.519, "duration": 5.85}, {"text": "You shouldn't have a big puff of fire with another half transparent smaller puff of fire as if the guns", "start": 149.38, "duration": 5.119}, {"text": "Inhaling the muzzle flash back into it", "start": 154.66, "duration": 2.0}, {"text": "this is like one of the most common errors of muzzle flashes is having it stick to the gun like", "start": 156.94, "duration": 6.619}, {"text": "It came out here the guns moving but the air the expanding gasses that are the muzzle flash", "start": 164.53, "duration": 4.16}, {"text": "Are there in front and that they're not parented with the gun. They would stay where they were initially", "start": 168.76, "duration": 4.46}, {"text": "I mean, we don't know that he's not firing a fully auto pistol", "start": 173.22, "duration": 3.419}, {"text": "Right on two shots off", "start": 177.79, "duration": 2.0}, {"text": "There's also no smoke coming out of this guns", "start": 179.87, "duration": 1.47}, {"text": "and it's one of the things that really sells the power of the gun that shows you those expanding gases those forces that are", "start": 181.34, "duration": 6.21}, {"text": "injecting that little piece of metal out of the gun because in real life if you shoot a pistol", "start": 187.68, "duration": 3.47}, {"text": "Within a third of a second just smoke for the muzzle flash", "start": 191.55, "duration": 3.02}, {"text": "will have you ejected out about six feet the smoke from a muzzle flash is what gives a gun it's powered by not having the", "start": 194.67, "duration": 5.54}, {"text": "Smoke in these scenes with John wick they're missing a huge portrait of what could really make these muzzle flashes hit hard", "start": 200.21, "duration": 5.699}, {"text": "actually the thing that bugs me when I watch this scene is", "start": 206.1, "duration": 4.129}, {"text": "The sound design to be honest if you listen to it, you hear the Zips and zaps your lips", "start": 210.6, "duration": 4.279}, {"text": "That actually sounds closer to what an airsoft pistol sounds like yeah than a real gun", "start": 218.43, "duration": 4.25}, {"text": "So that's literally just the sound of the mechanical elements because then when you're listening to in the scene you can just", "start": 224.58, "duration": 5.149}, {"text": "Hear that happening. No gunshots. I'm gonna go back a few frames", "start": 230.25, "duration": 2.899}, {"text": "Let's just make sure we know Gunny's using and that looks like an HK something with an extended", "start": 233.15, "duration": 4.2}, {"text": "compensator awesome", "start": 237.87, "duration": 2.0}, {"text": "Okay, so it's not a suppressor", "start": 240.209, "duration": 1.431}, {"text": "It shouldn't be going pew I want to feel the effect of the sound of these guns filling every corner of the room", "start": 241.64, "duration": 7.349}, {"text": "Let's do a quick demonstration", "start": 249.0, "duration": 1.47}, {"text": "So pay attention not to the initial bang because that lasts for a friend pay attention to the tail this time", "start": 250.47, "duration": 5.389}, {"text": "Everyone just shuts up explodes. You'll hear it", "start": 256.08, "duration": 2.449}, {"text": "Tail is a lot shorter, but it's got that boom eNOS. So it's hard to describe what the Frick is booming", "start": 279.03, "duration": 4.639}, {"text": "It's like it's like imagine of marshmallow", "start": 283.669, "duration": 2.7}, {"text": "exploding really hard", "start": 286.979, "duration": 2.0}, {"text": "Yeah", "start": 298.67, "duration": 2.0}, {"text": "All right, so let's see we can make John wick even better", "start": 300.89, "duration": 2.269}, {"text": "Let's see if we can fix the molar flashes and try something in the sound design to really make these guns feel powerful", "start": 303.16, "duration": 4.83}, {"text": "So I'm gonna do is I'm gonna start with a couple scenes that we erase the second muzzle flash that's there for a second frame", "start": 311.3, "duration": 4.789}, {"text": "And put our Mosel flash elements in there. I'm going to try to adjust the lighting. I'm going to add smoke", "start": 316.09, "duration": 4.47}, {"text": "I'm gonna add counter bloom. What are you gonna do? No, but it's gonna be sick", "start": 320.56, "duration": 4.86}, {"text": "What I'm thinking is I'm actually going to snag some of these firecrackers", "start": 327.89, "duration": 3.199}, {"text": "Record them that's gonna make the whole thing way more punch here", "start": 331.91, "duration": 2.869}, {"text": "It's gonna get a really transform the scene the guns sound different as well as look different. Let's do it", "start": 334.78, "duration": 4.559}, {"text": "Hey guys, it's John here Jake. How are you?", "start": 342.77, "duration": 3.139}, {"text": "Hey, since everyone is trying to make the muzzle flash is in my movie a little bit better", "start": 345.91, "duration": 4.649}, {"text": "I thought I'd come in here and offer everyone a little bit of advice on how today's sponsor Squarespace can make your lives better", "start": 350.56, "duration": 6.9}, {"text": "How's that sound guys sound good?", "start": 357.58, "duration": 2.159}, {"text": "Hey guys. John here. What are you working on now?", "start": 360.53, "duration": 2.69}, {"text": "So you don't have a problem in the future making sure our robot is rigged up in unity", "start": 363.22, "duration": 4.019}, {"text": "well", "start": 367.24, "duration": 0.3}, {"text": "Guess what with Squarespace you can make one post on your Squarespace website and that'll post", "start": 367.54, "duration": 5.009}, {"text": "Automatically on all those profiles like Twitter Facebook and Tumblr also", "start": 372.83, "duration": 4.159}, {"text": "It's optimized so you don't to worry about the titles not fitting or the number of words you're using not working", "start": 376.99, "duration": 4.98}, {"text": "Consider that next time you do a presentation", "start": 382.4, "duration": 2.239}, {"text": "Definitely to get this I consider that I'm John you're working again. I'm always working. I'm retired. How do you know that?", "start": 385.37, "duration": 6.23}, {"text": "What are you working on? We're fixing your movie. Do you know who's gonna own this video at the end of the day?", "start": 391.6, "duration": 5.16}, {"text": "Corridor digital well with Squarespace they offer 100%", "start": 397.39, "duration": 3.169}, {"text": "content ownership meaning that all the stuff that you put onto your Squarespace website you own so will in this video I", "start": 400.81, "duration": 5.93}, {"text": "Hope so if you decide you don't want to use Squarespace one day they offer one-click portability", "start": 407.02, "duration": 5.149}, {"text": "Meaning that you get all that information right back to you. What are you working on Sam? Yeah", "start": 412.17, "duration": 4.049}, {"text": "I'm just working trying to get this robot working in real time and unity for a state grant presentation", "start": 416.22, "duration": 5.04}, {"text": "How many people are gonna work on this robot with you know one I work a lot?", "start": 421.26, "duration": 3.42}, {"text": "It would probably really helpful if you worked with other people. That's not true", "start": 424.9, "duration": 4.759}, {"text": "And so that's what's great about square space square space offers multiple contributors to the same website", "start": 429.66, "duration": 5.79}, {"text": "Also, you can toggle access meaning that if you don't like that guy over there selim. Hey, guess what?", "start": 435.45, "duration": 5.04}, {"text": "You can't actually have that permission butBut you can your robot is going through. Thank you. You would if it's gonna work", "start": 440.49, "duration": 4.889}, {"text": "Yeah, it's great. Now. I'm psyched. Jake's dressed up like John Wayne is coming over here", "start": 445.44, "duration": 4.8}, {"text": "Hey, what are you working on?", "start": 452.44, "duration": 2.0}, {"text": "Squarespace offers you traffic oversight on any of your websites meaning that if you need to know who comes to your website", "start": 455.59, "duration": 5.99}, {"text": "Where they come from scores cuase can tell you that super useful actually less detects it out", "start": 461.86, "duration": 4.819}, {"text": "so if you're interested in starting your own Squarespace just goes", "start": 466.68, "duration": 3.39}, {"text": "Just go to squarespace.com slash corridor crew and you get 10% off. Your first purchase is your leg, okay?", "start": 470.74, "duration": 5.63}, {"text": "that's", "start": 477.43, "duration": 1.86}, {"text": "I'm working on it. Hold on guys. Okay. Jake's being weird today, baby. Yeah", "start": 479.29, "duration": 5.15}, {"text": "So like what they're using it's kinda like 80s drums gated reverb the drums cuz they have a normal gun sound effect where it goes", "start": 485.47, "duration": 6.529}, {"text": "They're cutting it off shorts that goes", "start": 495.73, "duration": 2.0}, {"text": "They're not using indoor samples they're using like gun on the range sound effects, it's Michael to fix that", "start": 500.71, "duration": 5.51}, {"text": "So I'm just gonna do a quick little audio pass here to punch it up a bit two things one", "start": 506.22, "duration": 4.019}, {"text": "Get some custom explosion Foley using some firecrackers and then I'm also gonna dig into my sound packs touch it up a little bit", "start": 510.43, "duration": 6.41}, {"text": "Here don't be alarmed", "start": 520.51, "duration": 2.0}, {"text": "Let's do that again, but I", "start": 526.57, "duration": 2.0}, {"text": "Hope I don't need the the pop so much I I need everything", "start": 534.58, "duration": 6.53}, {"text": "The thing is is that when it explodes everyone needs to be totally quiet or else it's unusable", "start": 547.43, "duration": 3.92}, {"text": "No, thanks", "start": 562.43, "duration": 2.0}, {"text": "Now takes me to my happy place entirely honest like that", "start": 569.36, "duration": 2.929}, {"text": "Sulfur smell is this like ball rocket fights 4th of July all sorts of shenanigans", "start": 572.29, "duration": 4.26}, {"text": "Well, Sam's blowing scrap that I'm sitting here working on the effects for this shot. So here's the raw scene", "start": 577.28, "duration": 5.539}, {"text": "Okay, focus on one muzzle flash here. This one this guy shoots right here all the flashes", "start": 582.82, "duration": 3.989}, {"text": "Don't just move stuck to the end of the gun. Once they come out the gun. That's where it comes out of", "start": 586.81, "duration": 3.72}, {"text": "It's like blowing smoke, you know, you can move your mouth the smoke stays where you blew it out not to mention", "start": 590.53, "duration": 4.409}, {"text": "It's kind of fading out and looking weird in the second frame and muzzle flashes. Only exists for one frame", "start": 594.94, "duration": 4.59}, {"text": "So the very first thing you have to do is I said erase the second muzzle flash here. We have that", "start": 599.53, "duration": 4.949}, {"text": "so the next thing I did is I added one of our muzzle flash elements that we filmed ourselves out in the desert from an", "start": 604.82, "duration": 5.0}, {"text": "Actual pistol so a couple interesting things to point out here", "start": 609.82, "duration": 2.429}, {"text": "You can see a really bright point where it's coming out of the gun", "start": 612.25, "duration": 2.25}, {"text": "You can see sparks the sparks continue for a couple of frames that element brings a lot of light", "start": 614.5, "duration": 5.94}, {"text": "I'm taking this muzzle flash then putting it on top of the other muzzle flash for the very first frame their base muzzle flash isn't", "start": 620.47, "duration": 5.729}, {"text": "That bad but it's missing some of these details and that's what I'm bringing back in with mine", "start": 626.2, "duration": 3.599}, {"text": "It also doesn't just stick to the gun arbitrarily that look really weird. So the next thing the most", "start": 629.83, "duration": 4.739}, {"text": "Important thing in my opinion is the smoke smoke gives the guns their punch back in the day", "start": 635.15, "duration": 5.149}, {"text": "We were filming sync. We needed some smoke for our muzzle flashes", "start": 640.3, "duration": 3.57}, {"text": "and so we got an air compressor and some flour and we shot the flour out of an air compressor and then we ramp the", "start": 643.87, "duration": 5.82}, {"text": "Footage so you get a more acceleration at the beginning and that first come out of the gun", "start": 649.69, "duration": 4.289}, {"text": "Works so well for showing the power of a there it is boom", "start": 654.29, "duration": 3.339}, {"text": "The smoke should be about twice the length the muzzle flash", "start": 657.88, "duration": 2.42}, {"text": "Based on all my studying of actual gun shooting and then should move at a pretty good speed", "start": 660.61, "duration": 4.429}, {"text": "Alright, so now we have our flash and our smoking there. The last thing I need to do is add some fake lighting", "start": 665.32, "duration": 4.43}, {"text": "So there's already a little bit of fake lighting in the scene", "start": 669.75, "duration": 1.89}, {"text": "but it feels a little dark like this the wall behind the guy should be lit up the wall below key on his arm should", "start": 671.64, "duration": 4.5}, {"text": "Be lit up. I'm going to brighten them myself and when everything is said and done you get something kind of like this", "start": 676.14, "duration": 4.53}, {"text": "You can see the smoke you can see the sparks looks pretty good and pretty punchy", "start": 684.4, "duration": 3.32}, {"text": "Kind of Babur awesome some muzzle flashes here for you guys. Happy a little flare. Yeah", "start": 687.97, "duration": 3.89}, {"text": "This is like one of my biggest pet peeves. I'm happy. I can show you guys how I would do it", "start": 691.86, "duration": 4.139}, {"text": "I'm just a passionate individual that loves action movies terminator. I watch this every night when I go to sleep", "start": 696.01, "duration": 6.5}, {"text": "Check out Brian frenzies video t2 muscle spray Brian frenzy played the law and vghs", "start": 710.069, "duration": 4.369}, {"text": "I'm being completely serious", "start": 714.599, "duration": 1.28}, {"text": "If anybody from John wick production team sees this video and would like us to do muzzle flashes for your movie", "start": 715.879, "duration": 5.729}, {"text": "I would love to do that. It would be super cool. Send us an email", "start": 721.609, "duration": 3.36}, {"text": "And so I'm starting to chop up the original audio track and do some creative fades at which time the gun fires", "start": 725.339, "duration": 5.63}, {"text": "The sound in the original audio disc. So this is basically what's happening on the original audio track that", "start": 731.069, "duration": 4.849}, {"text": "Initial like spike. I'm taking them out and replacing them with my own punchy elements these tails here", "start": 739.229, "duration": 6.32}, {"text": "This is the gun and just for reference", "start": 748.529, "duration": 4.399}, {"text": "That's where I'm at a little more punchy a little more poppy", "start": 757.349, "duration": 2.72}, {"text": "Ready to show some the effects here might be effects sir. I'm really nervous about a sound design", "start": 767.729, "duration": 7.07}, {"text": "We're more professional muzzle flashes than we are professional sound designers. So be nice to me", "start": 774.799, "duration": 4.77}, {"text": "Okay, so I haven't actually seen any of this. These are these are fresh eyeballs. Seeing your muzzle flashes hear this", "start": 779.569, "duration": 6.929}, {"text": "Let's get a refresher of the original the original", "start": 786.499, "duration": 2.039}, {"text": "Jonathan walk", "start": 789.72, "duration": 2.0}, {"text": "That's pretty deep right back wait, that's actually Keanu", "start": 793.1, "duration": 3.959}, {"text": "Here's our version these are the improved ones", "start": 803.22, "duration": 2.0}, {"text": "Sit-outs home. That looks so much better", "start": 813.079, "duration": 2.78}, {"text": "Everything looks really good. I'm gonna be completely honest. I didn't really notice a difference", "start": 816.379, "duration": 5.36}, {"text": "I noticed the smoke the smoke made them feel a little less like Video Copilot", "start": 826.399, "duration": 5.869}, {"text": "Tutorial no friends Andrew. I", "start": 832.91, "duration": 2.9}, {"text": "Noticed the the nice sparks coming out of the gun - those look really good and just like show you guys some before and after", "start": 836.629, "duration": 4.97}, {"text": "Like here's the original of John wick Bing", "start": 841.6, "duration": 2.219}, {"text": "here's that same shot that", "start": 845.209, "duration": 2.0}, {"text": "Looks so much better. See that's the thing about muzzle flashes in motion", "start": 848.0, "duration": 4.219}, {"text": "It's really hard to tell the difference, but when you actually pause and look at the flash, it's very clear", "start": 852.22, "duration": 4.32}, {"text": "The sparks look so good trying some fake shadows under the wall. It really makes it feel like it's an actual lighting", "start": 856.569, "duration": 5.309}, {"text": "That's there. These are such better muzzle flashes. What muzzle flashes did you guys use? What collection did you use?", "start": 861.879, "duration": 5.34}, {"text": "These are the pistol side desert muzzle flashes that you filmed out in the desert with Adrian back in the day", "start": 867.22, "duration": 4.799}, {"text": "Just saying paid off speaking of weak-ass guns. I actually decided to go the other way, so", "start": 872.019, "duration": 5.13}, {"text": "It's nothing but you guys just buckle your seatbelts hold onto your pants because we're about to get", "start": 881.6, "duration": 4.13}, {"text": "Don't let me dad some bigwig energy. Let's do it", "start": 885.949, "duration": 2.48}, {"text": "We don't", "start": 930.91, "duration": 2.0}, {"text": "An improvement", "start": 940.63, "duration": 2.0}, {"text": "Mortar round", "start": 943.99, "duration": 1.56}, {"text": "No joke. No, I feel like once they make like the tents John wick movie is actually going to look like", "start": 945.55, "duration": 4.429}, {"text": "Cracking the last bullet is like Michelangelo inside the wall. I would he shoots through the wall quote", "start": 950.62, "duration": 6.409}, {"text": "I was like, I was like to bleep blow up a whole wall", "start": 957.029, "duration": 2.0}, {"text": "Alright, well, let us know what you guys thought was this an improvement on the original John wick", "start": 960.399, "duration": 3.65}, {"text": "do you feel like our muzzle flashes are better or do you feel like Peters muzzle flashes were the best muzzle flashes that anybody could", "start": 964.05, "duration": 5.52}, {"text": "Ever make and that's what the next John wick movie should have inside of them", "start": 969.57, "duration": 2.459}, {"text": "Also, please leave a comment if there are any other scenes you would like us to take a look at any other movies", "start": 972.029, "duration": 3.809}, {"text": "Whatever it is, please leave a comment below and don't forget to subscribe", "start": 975.839, "duration": 3.69}, {"text": "Just in case we do it", "start": 980.25, "duration": 2.0}, {"text": "For some reason when everyone does their muzzle flashes it's this shape", "start": 983.86, "duration": 3.349}, {"text": "It's either this or the dreaded like", "start": 988.899, "duration": 2.36}, {"text": "You know what I'm saying? Like it's it's more it's more this one. It's the most common one. They do it's like this", "start": 992.35, "duration": 5.179}, {"text": "Way me no, no, I'm not done", "start": 999.67, "duration": 2.0}, {"text": "What for this shape in the most of the old ones", "start": 1004.5, "duration": 2.179}]