[{"text": "This video was made possible by Skillshare, an online learning community with over 17,000 classes in just about anything you can imagine. (jeez they're sponsoring everyone nowadays)", "start": 0.0, "duration": 6.899}, {"text": "Keep watching until the end of the video to learn how you can get your first two months for free.", "start": 7.419, "duration": 4.1}, {"text": "England in the Middle Ages.", "start": 12.4, "duration": 1.949}, {"text": "The sun is shining . The birds are singing.", "start": 14.349, "duration": 2.42}, {"text": "The children are playing in the village square.", "start": 17.32, "duration": 2.439}, {"text": "\"What a wonderful time to be alive!\"", "start": 19.76, "duration": 1.84}, {"text": "\"Hey, you're dying of dysentary.\" (welp)", "start": 21.6, "duration": 1.44}, {"text": "\"Aaaaaaand,", "start": 24.08, "duration": 0.5}, {"text": "also, we're being raided by Vikings.\"", "start": 24.58, "duration": 1.755}, {"text": "\"What an awful time to be alive!\"", "start": 26.335, "duration": 1.714}, {"text": "It's the Year 900.", "start": 28.449, "duration": 1.2}, {"text": "Europe is a Vikings wet dream.", "start": 29.649, "duration": 1.76}, {"text": "Raids galore.", "start": 31.409, "duration": 0.78}, {"text": "\"Hey, you wanna go raid Paris?\"", "start": 32.189, "duration": 1.86}, {"text": "Okay, that particular raid didn't go too well, but the King of the Francs said,", "start": 34.18, "duration": 2.94}, {"text": "\"You guys are pretty tough and scary.\"", "start": 37.12, "duration": 1.7}, {"text": "\"How about we give you land in northern France?\"", "start": 38.82, "duration": 1.62}, {"text": "\"And in return, you protect us from other Vikings.\"", "start": 40.44, "duration": 2.217}, {"text": "And it was agreed.", "start": 42.66, "duration": 1.04}, {"text": "The Vikings set up the Duchy of Normandy", "start": 43.7, "duration": 1.96}, {"text": "And then they went full-on French.", "start": 45.66, "duration": 1.175}, {"text": "Converting to Christianity, learning the language, and making babies with the locals. ( ͡° ͜ʖ ͡°)", "start": 46.835, "duration": 3.354}, {"text": "England also had its fair share of Viking problems.", "start": 50.28, "duration": 2.66}, {"text": "In the 800s, Danish Vikings had conquered most of the country, but the Anglo-Saxons eventually managed to kick them out.", "start": 52.94, "duration": 4.46}, {"text": "Although they left behind a bunch of Viking settlers.", "start": 57.66, "duration": 1.815}, {"text": "Now this guy's king.", "start": 59.475, "duration": 0.685}, {"text": "\"He sucks. Replace him with his brother!\" (k)", "start": 60.42, "duration": 1.505}, {"text": "and he was like, \"Hey, baby.\"", "start": 61.925, "duration": 0.954}, {"text": "\"How you doin?\" and had a son, and then turned around and was like, \"Hey, baby.\"", "start": 62.879, "duration": 2.639}, {"text": "\"How you doin?\" and had another son. (damn)", "start": 65.519, "duration": 2.081}, {"text": "And then he died and no one was sure which son to make King.", "start": 67.6, "duration": 1.62}, {"text": "\"This one, cause he's older!\"", "start": 69.22, "duration": 0.9}, {"text": "\"Not if I have anything to do with it.\"", "start": 70.12, "duration": 1.12}, {"text": "\"That works for us, too!\"", "start": 71.24, "duration": 1.62}, {"text": "Then he grew up and married the Duke of Normandy's daughter and had a bunch of kids.", "start": 73.0, "duration": 3.16}, {"text": "Remember this one, he's important.", "start": 76.16, "duration": 1.82}, {"text": "Then his advisors came to him and said,", "start": 78.0, "duration": 1.7}, {"text": "\"Hey, man, all those Viking settlers that are living here?\"", "start": 79.7, "duration": 2.44}, {"text": "\"They might band together and kill you.\"", "start": 82.16, "duration": 2.16}, {"text": "\"Well, then why don't we kill them first?\"", "start": 84.84, "duration": 1.88}, {"text": "And so it was.", "start": 86.8, "duration": 1.22}, {"text": "This pissed off the Danish king, who launched an invasion.", "start": 88.02, "duration": 2.244}, {"text": "And the Vikings conquered England once again.", "start": 90.264, "duration": 1.676}, {"text": "Then the Anglo-Saxons unconquered it.", "start": 92.04, "duration": 1.64}, {"text": "Then the Vikings reconquered it.", "start": 93.68, "duration": 1.611}, {"text": "The King's family had to go into exile, including Edward", "start": 95.291, "duration": 2.769}, {"text": "Remember him? He went to Normandy where he lived for thirty years.", "start": 98.259, "duration": 2.48}, {"text": "He and his brother Alfred tried to return to England to retake the throne from the Vikings.", "start": 100.74, "duration": 3.75}, {"text": "But they were betrayed by the Earl of Wessex, who said,", "start": 104.49, "duration": 1.47}, {"text": "\"Hey friend, I'll take you to London where all the nobles are waiting to make you King\"", "start": 105.96, "duration": 3.72}, {"text": "\"Oh, no, look out, red-hot poker in the eyes.\" (trolled)", "start": 109.71, "duration": 1.65}, {"text": "\"I can't see!\"", "start": 111.36, "duration": 1.34}, {"text": "And thus you can't be King. (jerk)", "start": 112.7, "duration": 1.7}, {"text": "Edward then escaped back to Normandy.", "start": 114.4, "duration": 1.24}, {"text": "After a few more Viking Kings came and went, one finally died without an heir and Edward was called back to England,", "start": 115.76, "duration": 4.26}, {"text": "where he became king.", "start": 120.06, "duration": 1.027}, {"text": "And that's where our story begins", "start": 121.087, "duration": 1.733}, {"text": "[Intro]", "start": 123.04, "duration": 4.34}, {"text": "Here's the thing about becoming a king in the Middle Ages.", "start": 127.56, "duration": 2.32}, {"text": "Often your entire country won't support you at first.", "start": 129.88, "duration": 2.2}, {"text": "You can be vulnerable to rebellions and it's up to you to take control.", "start": 132.08, "duration": 2.96}, {"text": "Fortunately for Edward, there was already a super powerful guy who had a lot of control over England", "start": 135.04, "duration": 4.04}, {"text": "and if Edward could get his support then England would be his.", "start": 139.08, "duration": 2.82}, {"text": "\"Who is this guy?\"", "start": 141.9, "duration": 1.211}, {"text": "\"Aw piss,\"", "start": 143.111, "duration": 0.619}, {"text": "\"It's the guy who gave my brother the red-hot poker in the eyes.\"", "start": 143.73, "duration": 2.63}, {"text": "After an awkward moment where Edward exiled Godwin from the country,", "start": 146.36, "duration": 2.679}, {"text": "He eventually had to give in and let him keep his earldom.", "start": 149.04, "duration": 1.76}, {"text": "Possibly after Godwin gave him a bunch of gold and said he was very very sorry.", "start": 150.8, "duration": 3.18}, {"text": "King Edward also married Godwin's daughter then Godwin died and his massive fortune was passed down to his sons who all became Earl's in", "start": 154.2, "duration": 6.539}, {"text": "Particular this one became the new Earl of Wessex Harold Godwinson was now King Edward's brother-in-law", "start": 160.9, "duration": 4.85}, {"text": "he was a close advisor to the King a brave warrior who had proven himself in battle against the Welsh and in many ways he", "start": 165.75, "duration": 5.279}, {"text": "Was almost like a Co-King, uh-oh Edward got old and he's on his deathbed (rip)", "start": 171.03, "duration": 3.569}, {"text": "Possibly for religious reasons or maybe because he wasn't happy about having to marry her", "start": 175.12, "duration": 3.47}, {"text": "He didn't boink his wife and as a result has no kids. Meaning, there's no obvious heir to the throne", "start": 178.59, "duration": 4.679}, {"text": "\"Meaning I'm gonna be king.\" \"He does have a grand nephew. It could be him\"", "start": 183.299, "duration": 2.94}, {"text": "\"Hmm no let's go with me\"", "start": 187.98, "duration": 1.28}, {"text": "Just one problem.", "start": 189.68, "duration": 1.1}, {"text": "I mentioned that Edwards mother was in Norman Edward grew up in Normandy and he had a lot of Norman friends", "start": 190.78, "duration": 4.58}, {"text": "The current Duke of Normandy was William the bastard", "start": 195.5, "duration": 2.16}, {"text": "Why was he called the bastard one day his father was sneaking out of his castle", "start": 197.76, "duration": 3.619}, {"text": "When his advisors said, \"Where are you going?\"", "start": 201.38, "duration": 1.94}, {"text": "\"Uh, to the tanner's shop?\"", "start": 203.32, "duration": 1.5}, {"text": "\"Why?\"", "start": 204.82, "duration": 0.78}, {"text": "\"To get a...\"", "start": 205.6, "duration": 2.0}, {"text": "\"Tan?\"", "start": 208.24, "duration": 0.94}, {"text": "But that was a lie firstly because tanner's give you leather not tans and", "start": 209.19, "duration": 3.619}, {"text": "Secondly because he was really going to see the Tanners daughter one thing leads to another and out comes baby William born out of wedlock", "start": 212.91, "duration": 6.319}, {"text": "Thus an absolute bastard", "start": 219.6, "duration": 1.77}, {"text": "His father died when William was seven or eight and he became the new Juke he spent most of his childhood narrowly avoiding assassination", "start": 221.37, "duration": 6.5}, {"text": "Which probably turned him into the big balls tough guy?", "start": 227.87, "duration": 2.19}, {"text": "He's remembered as today in", "start": 230.06, "duration": 1.4}, {"text": "1051 the town of Aleçon tried to rebel against him and the townspeople beat on dead animal skins as an insult to his commoner mother", "start": 231.46, "duration": 5.88}, {"text": "William was furious and he responded by well, let's just say it wasn't pretty that's the kind of guy", "start": 237.58, "duration": 4.27}, {"text": "We're dealing with here William and Edward were good friends and Edward allegedly promised that William could have the English throne after him", "start": 241.85, "duration": 5.87}, {"text": "A decade later Harold Godwinson even visited William and pledged an oath to him over", "start": 247.76, "duration": 3.9}, {"text": "Holy relics promising that William could be the next king of England", "start": 251.78, "duration": 3.0}, {"text": "Although it's possible Harold only did it because William was holding his family hostage", "start": 255.0, "duration": 3.41}, {"text": "So when William heard that the king was on his deathbed he said hooray. I'm gonna be king", "start": 258.72, "duration": 4.04}, {"text": "So now you have two extremely powerful men who both think they're about to become the next king.", "start": 262.76, "duration": 4.32}, {"text": "But wait", "start": 267.46, "duration": 1.18}, {"text": "This guy is the king of Norway", "start": 268.64, "duration": 2.0}, {"text": "He spent most of his life as a warrior for hire. Fighting for whoever would give him the most gold", "start": 270.65, "duration": 4.17}, {"text": "You name a place. He probably fought a war then Poland. Yep. Estonia. Yep. Against pirates in the Mediterranean", "start": 274.82, "duration": 6.059}, {"text": "Yep, the holy lands Sicily and Bulgaria. Yep", "start": 280.88, "duration": 2.789}, {"text": "He got crazy rich off the back of it and was swimming in gold", "start": 283.669, "duration": 3.03}, {"text": "Then he returned home and became King", "start": 286.83, "duration": 1.88}, {"text": "One of the previous Norwegian kings had made an agreement with one of England's Viking kings saying that when that Viking King died the king", "start": 288.71, "duration": 6.149}, {"text": "Of Norway would get the English throne. Hardrada felt that because of this agreement", "start": 294.86, "duration": 3.54}, {"text": "He was now entitled to the English throne", "start": 298.43, "duration": 1.65}, {"text": "He was also eager to go on one last big conquest that would turn him into a legend", "start": 300.08, "duration": 4.109}, {"text": "So when he got word that Edward was on his deathbed he thought I'm gonna invade England and then I'm gonna be king", "start": 304.19, "duration": 4.769}, {"text": "So now we have three extremely powerful men who all think they're about to become the next king of England and that means somebody's probably", "start": 309.45, "duration": 6.139}, {"text": "About to get hurt back in England Harold Godwinson is watching over the dying King Edward. Suddenly. He comes out with a shocking announcement", "start": 315.59, "duration": 6.119}, {"text": "Hey, everyone gather in. That's it. Come closer. Don't be shy. Okay, so I've got bad news. The king is dead", "start": 321.9, "duration": 6.829}, {"text": "I know very sad, but good news. He said that I should be the next king. So", "start": 328.79, "duration": 4.769}, {"text": "hooray for me and", "start": 334.389, "duration": 1.981}, {"text": "Oh, yeah", "start": 336.37, "duration": 1.13}, {"text": "He said that if he once told anyone else", "start": 337.5, "duration": 1.5}, {"text": "They could be king that he doesn't like them anymore and they should just stay in Normandy", "start": 339.0, "duration": 3.58}, {"text": "And also he said that no one should ask any further questions", "start": 343.3, "duration": 2.0}, {"text": "Okay. Good talk. Go um.", "start": 345.85, "duration": 2.0}, {"text": "Go do whatever it is you do", "start": 348.49, "duration": 2.0}, {"text": "Usually it took months of preparation to crown a new king", "start": 350.74, "duration": 2.54}, {"text": "But Harold rushed it and he had himself crowned the same day King Edward was buried in Normandy", "start": 353.28, "duration": 4.32}, {"text": "William's advisors came to him and said: \"Hey Big Willie, bad news, Harold Godwinson has taken the English throne.\" And William was furious", "start": 357.6, "duration": 5.97}, {"text": "So he sent an envoy to Harold who said: \"William says you stole the throne and demands you immediately return it to him.\" Hmm", "start": 363.57, "duration": 4.919}, {"text": "Let me think about that", "start": 368.489, "duration": 1.991}, {"text": "thinking", "start": 370.48, "duration": 1.8}, {"text": "No. (good answer)", "start": 372.28, "duration": 0.54}, {"text": "\"He said no.\" \"That bastard.\" \"Wait, I thought you were the bastard\". (lol)", "start": 373.36, "duration": 3.5}, {"text": "\"Dude.", "start": 376.92, "duration": 0.5}, {"text": "Uncool.\"", "start": 379.48, "duration": 0.64}, {"text": "William immediately began gathering his armies together and preparing for an invasion of England", "start": 380.64, "duration": 4.12}, {"text": "Now killing a king was generally frowned upon in old-time Europe because they were considered to have been chosen by God himself", "start": 385.71, "duration": 5.66}, {"text": "So back in Normandy, William had to get God on his side. He needed the Pope's blessing for his conquest", "start": 391.37, "duration": 4.47}, {"text": "So he went to the Pope and said \"Godwinson made an oath to me over Holy relics", "start": 395.84, "duration": 3.269}, {"text": "And then he usurped the throne. Can I kill him?\"", "start": 399.11, "duration": 2.22}, {"text": "\"Yeah, sure. Why not.\" So the Pope gave William his blessing meaning William now had God on his side. Everything was ready to go", "start": 402.36, "duration": 6.829}, {"text": "Just one problem. The wind. It was blowing the wrong way and William had to wait with his army in Normandy", "start": 409.2, "duration": 5.63}, {"text": "While Godwinson waited with his army in the South of England, they waited and waited and waited", "start": 414.98, "duration": 4.86}, {"text": "and waited.", "start": 420.4, "duration": 0.64}, {"text": "And then William said screw it and sailed for England and got shipwrecked because the wind was blowing the wrong way", "start": 421.24, "duration": 4.2}, {"text": "So then he decided to keep on waiting", "start": 425.49, "duration": 1.73}, {"text": "They waited for two months and the wind never changed eventually Godwinson got bored and also ran out of food for his soldiers", "start": 427.22, "duration": 5.759}, {"text": "So he sent them all home, and he returned to London", "start": 432.98, "duration": 1.83}, {"text": "The south coast was undefended and all William could do was keep waiting while the northerly wind kept William in Normandy", "start": 434.81, "duration": 6.179}, {"text": "It was carrying Hardrata and his Viking army to England", "start": 440.99, "duration": 2.97}, {"text": "Hardrata landed near the old Viking city of York and defeated a regional army led by the northern Earl's and York's surrendered", "start": 444.27, "duration": 5.869}, {"text": "When Godwinson heard about this, he must have been pretty upset", "start": 450.33, "duration": 2.66}, {"text": "He had just disbanded his army. And now he had to gather them all together again and march all the way north", "start": 453.26, "duration": 4.29}, {"text": "He made the exhausting journey in just FOUR days (hm, impressive)", "start": 457.67, "duration": 2.25}, {"text": "Which is crazy quick and he caught the Vikings off guard and unprepared for battle. The two armies stood on either side of the river Derwent", "start": 459.96, "duration": 6.9}, {"text": "Legends says that a beserker Viking single handedly held the only way crossing the river", "start": 466.86, "duration": 4.46}, {"text": "dodging arrows and fending off attackers", "start": 471.32, "duration": 1.75}, {"text": "Until some English soldiers got under the bridge in a barrel and gave him the old spear in the jewels", "start": 473.07, "duration": 4.07}, {"text": "This gave the Vikings enough time to form a shield wall. But because they'd been caught off guard", "start": 477.33, "duration": 3.739}, {"text": "Many weren't wearing their chainwear and armour and the English eventually defeated them, killing Hardrada,", "start": 481.58, "duration": 4.229}, {"text": "and with him bringing the Viking era in England to an end", "start": 485.96, "duration": 3.02}, {"text": "just keep waiting...just keep waiting..", "start": 489.44, "duration": 1.7}, {"text": "well...this is BOOORING!", "start": 491.94, "duration": 1.06}, {"text": "*squeak*", "start": 493.88, "duration": 0.64}, {"text": "ayyy there we go!", "start": 494.52, "duration": 2.0}, {"text": "Finally!", "start": 496.54, "duration": 1.26}, {"text": "Williams fleet of over 700 ships and", "start": 497.8, "duration": 2.0}, {"text": "14,000 men set sail and landed on the English coast at Pevensey and set up camp near Hastings and", "start": 499.93, "duration": 4.699}, {"text": "Harold was still all the way in York his", "start": 504.72, "duration": 2.18}, {"text": "exhausted army had to march all the way south just days after their battle with the Vikings. Harold made it to London and considered just", "start": 506.98, "duration": 5.6}, {"text": "Staying there waiting for William to come to him but William forced Harold's hand by burning down a bunch of villages", "start": 512.58, "duration": 4.4}, {"text": "Harold's army set out and met Williams on the 14th of October", "start": 517.06, "duration": 3.02}, {"text": "1066", "start": 520.51, "duration": 0.65}, {"text": "and both sides prepared themselves for the Battle of Hastings the English were on a hill so they decided to stay there because it was", "start": 521.16, "duration": 4.979}, {"text": "A good defensive position the Normans approached and the two sides probably spent a while yelling at each other", "start": 526.14, "duration": 4.409}, {"text": "William and the Normans had a few tactical advantages over the English the first were the archers the Normans sent volley after volley of arrows", "start": 530.7, "duration": 6.0}, {"text": "Of the English who formed a shield wall in defence", "start": 536.7, "duration": 2.159}, {"text": "Then Williams sent his infantry up the hill", "start": 538.86, "duration": 2.0}, {"text": "The English threw anything they had at them and the Normans couldn't break through the shield wall", "start": 540.99, "duration": 3.63}, {"text": "Then the Normans next tactical advantage came into play", "start": 544.62, "duration": 2.46}, {"text": "William sent his cavalry up the hill but even they struggled to break through the shield wall defences. Wave after wave of", "start": 547.38, "duration": 5.429}, {"text": "Infantry and cavalry came and Harold knew", "start": 552.91, "duration": 1.97}, {"text": "All he had to do was let the Normans exhaust themselves and he would win but then something a bit strange happened", "start": 554.88, "duration": 4.65}, {"text": "It's possible the Normans incorrectly believed William had been killed", "start": 559.53, "duration": 2.64}, {"text": "Maybe they lost their will to fight against the shield wall, or maybe it was an intentional deception tactic", "start": 562.17, "duration": 4.079}, {"text": "But suddenly the norman forces turned and ran away from the english believing they had won the english broke their shield wall and chased down", "start": 566.25, "duration": 6.299}, {"text": "The retreating Normans who then turned around encircled the English troops and cut them down in the chaotic fighting that followed Harold Godwinson was killed", "start": 572.55, "duration": 6.54}, {"text": "The most popular theory being that he took an arrow in the eye the English were defeated and William had won", "start": 579.18, "duration": 4.65}, {"text": "He was no more just a bastard now", "start": 583.83, "duration": 1.98}, {"text": "He was a conqueror at first English Nobles were reluctant to make him King but William burned down a few more villages and the nobles", "start": 585.81, "duration": 5.489}, {"text": "Eventually gave in and offered him the crown as he was coronated the local villages and Westminster let out a cheer of support but William", "start": 591.3, "duration": 5.67}, {"text": "Thought it was a riot", "start": 596.97, "duration": 0.69}, {"text": "So he burned down the village (they just love burning down the villages..) William then had to go on a long and costly campaign of quelling", "start": 597.66, "duration": 3.94}, {"text": "rebellions and burning down villages all over England *insert burning down village compilation*", "start": 601.66, "duration": 2.12}, {"text": "To force the people into submission and England went through a massive transformation under its new Norman rule English Nobles were replaced with Normans", "start": 603.78, "duration": 6.75}, {"text": "They built castles and grand cathedrals", "start": 610.53, "duration": 1.62}, {"text": "But one of the most interesting changes occurred within the English language", "start": 612.15, "duration": 3.059}, {"text": "The Normans brought their dialect of French to England and emerged with Old English and ways we still live with today", "start": 615.39, "duration": 4.919}, {"text": "First of all,", "start": 620.31, "duration": 0.57}, {"text": "The Normans were obviously the ones in power", "start": 620.88, "duration": 1.56}, {"text": "So words related to power like government judge castle and crown come from norman's words that are considered", "start": 622.44, "duration": 4.78}, {"text": "Posher are more refined are usually the norman ones at first the anglo-saxons", "start": 627.47, "duration": 3.829}, {"text": "probably weren't that friendly to the Normans while the Normans likely weren't that amiable towards the", "start": 631.3, "duration": 3.57}, {"text": "Anglo-Saxons.", "start": 635.06, "duration": 0.59}, {"text": "An Anglo-Saxon might come into a room, but a Norman would enter into a chamber, an Anglo Saxon might buy themselves a shirt", "start": 635.65, "duration": 5.82}, {"text": "While the Norman would purchase a blouse, and while that filthy peasants new shirt may be fair", "start": 641.47, "duration": 3.899}, {"text": "The Norman blouse is absolutely beautiful!", "start": 645.37, "duration": 2.0}, {"text": "The Normans actually considered some anglo-saxon words so crude that I can't even say them on YouTube. But there's more! Ask an anglo-saxon", "start": 647.59, "duration": 5.82}, {"text": "What job he does and he might respond with some low-level trade such as a baker, a Miller, or a shoemaker", "start": 653.41, "duration": 5.219}, {"text": "But a Norman has a skilled trade like a painter, a tailor, or a merchant the", "start": 658.76, "duration": 4.4}, {"text": "anglo-saxon farmers working in the fields owned many cows, pigs and sheep", "start": 663.32, "duration": 3.14}, {"text": "But once they were served up in a Norman banquet,", "start": 666.46, "duration": 2.01}, {"text": "they became beef, pork, and mutton and written English changed to since many Anglo Saxons couldn't write the written language was", "start": 668.47, "duration": 5.849}, {"text": "romanticized your annoying friend that says Cool Hwip might just be speaking an old English dialect as the", "start": 674.75, "duration": 4.76}, {"text": "anglo-saxons originally wrote it hwen hwere and hwat but the Normans swapped the w and h around and the long English 'a' vowel sounded more like an", "start": 679.67, "duration": 7.099}, {"text": "'O' to the Normans so you can thank them that you live in a home not a ham (thx Normans! :D)", "start": 686.77, "duration": 3.419}, {"text": "Hey, fun fact about William. The man couldn't read or write not in French not in English not in anything (he have dyslexia)", "start": 691.34, "duration": 5.0}, {"text": "well", "start": 696.34, "duration": 0.42}, {"text": "What if I told you there is a place where you could learn French English?", "start": 696.76, "duration": 2.609}, {"text": "even Japanese if you wanted and not just that pick up a musical instrument learn to code games and apps", "start": 699.71, "duration": 4.729}, {"text": "Animation photography and film anything you could dream up old taught by genuine experts and you can get your first two months for free", "start": 704.63, "duration": 5.9}, {"text": "I'm talking about skill share with over 17,000 classes in the arts business", "start": 710.53, "duration": 4.589}, {"text": "Technology and more I get a lot of comments asking how I create these videos and the answer is a mixture of After Effects Photoshop", "start": 715.61, "duration": 5.96}, {"text": "And illustrator you can find classes for all skill levels on Skillshare", "start": 721.67, "duration": 3.799}, {"text": "pair those new design and animation skills with some coding and you're on your way to making your first indie game or app you can", "start": 725.63, "duration": 5.66}, {"text": "Get unlimited access to all of this for a very affordable ten dollars a month", "start": 731.29, "duration": 3.299}, {"text": "But if you want to try it out first you can get two months for free by using this link", "start": 734.59, "duration": 4.589}, {"text": "Which can also be found in the description below. So check it out improve your skills and learn something new today with skill share", "start": 739.18, "duration": 6.57}]