[{"text": "a few weeks ago", "start": 0.0, "duration": 0.57}, {"text": "I lost my wallet which made me sad because it is a pain to get everything replaced", "start": 0.57, "duration": 3.99}, {"text": "Then I thought, what kind of person doesn't return a wallet", "start": 4.63, "duration": 2.989}, {"text": "And then I thought I'm a firm believer in the scientific method,", "start": 7.62, "duration": 2.069}, {"text": "I should test some hypothoses.", "start": 9.689, "duration": 1.631}, {"text": "So I got 200 identical wallets in order to drop them in each of the 20 cities you see here the goal being not", "start": 11.44, "duration": 6.02}, {"text": "Only to see which cities were the most and least honest, but to ask", "start": 17.46, "duration": 2.94}, {"text": "questions of anyone who called in to see if I could pick out some patterns among the honest ones and I wanted to make the", "start": 20.41, "duration": 5.119}, {"text": "Wallets look as real as possible so in each of them", "start": 25.529, "duration": 2.31}, {"text": "I put a fake ID with no picture so as not to bias people six American dollars and 200 Filipino dollars", "start": 27.84, "duration": 6.569}, {"text": "This is a way to make it look like a lot of money when in reality this is only worth 4 bucks", "start": 34.41, "duration": 4.229}, {"text": "Then I put in an ultrasound picture and on the back we hand wrote a date from four years ago", "start": 38.64, "duration": 4.439}, {"text": "And then this adorable picture of a puppy I found on reddit. The goal was in addition to the ID and the money I wanted", "start": 43.079, "duration": 5.58}, {"text": "To make a look like the wallet had sentimental value to the owner.", "start": 48.66, "duration": 2.729}, {"text": "I was trying to remove any excuse for someone not to return the wallet such as it looked fake", "start": 51.39, "duration": 4.709}, {"text": "Or it wouldn't be worth hassle", "start": 56.1, "duration": 1.65}, {"text": "If there was only 2 bucks inside of a blank wallet. So in our case if they didn't return it", "start": 57.75, "duration": 4.169}, {"text": "It would only be because they weren't being honest. Then we had a fake loyalty card and a random business card", "start": 61.92, "duration": 5.04}, {"text": "And then critically a card that looked like he came with the wallet", "start": 66.96, "duration": 2.879}, {"text": "That said if found please call and then we wrote the phone number.", "start": 69.84, "duration": 3.0}, {"text": "And then because it's impractical for me to actually visit 20 cities", "start": 72.84, "duration": 2.79}, {"text": "I went on the Instagram page from a YouTube channel to ask for help and right away the response was awesome. Once I'd selected my", "start": 75.63, "duration": 5.58}, {"text": "20 helpers I sent them instructions and shipped them each 10 wallets and then last Monday all across, North America", "start": 81.21, "duration": 5.43}, {"text": "operation wallet drop commenced.", "start": 87.38, "duration": 2.0}, {"text": "(music)", "start": 89.4, "duration": 11.28}, {"text": "I asked them after they dropped the wallets to try and get some secret footage if", "start": 100.68, "duration": 3.36}, {"text": "Possible and to do that they came up with some pretty clever methods.", "start": 104.17, "duration": 2.959}, {"text": "I'm actually gonna tuck the wallet underneath my car so I Drive away it stays in the parking lot", "start": 110.68, "duration": 4.759}, {"text": "Almost immediately calls started pouring in from all of the cities so when people call in we ask them eight", "start": 127.36, "duration": 5.389}, {"text": "Questions such as if they were religious or not or if there was still money in the wallet when they found it and if so", "start": 132.91, "duration": 5.119}, {"text": "Of course we told them just keep it. So after three days of collecting data:", "start": 138.03, "duration": 3.449}, {"text": "Here's what we found for starters and this blew my mind two-thirds of the wallets were returned and of those that were returned", "start": 141.7, "duration": 7.099}, {"text": "96 percent still had the money inside. The average age of one of the caller's was", "start": 149.2, "duration": 4.43}, {"text": "36 which is almost exactly the average age of a person in the U.S.", "start": 153.819, "duration": 3.62}, {"text": "So how old you are it doesn't seem to affect honesty.", "start": 157.44, "duration": 2.579}, {"text": "There's a pretty big disparity in which cities were the most and least honest", "start": 160.019, "duration": 3.42}, {"text": "and I'll get to the rankings in just a minute.", "start": 163.44, "duration": 1.41}, {"text": "But first I wanted to test a", "start": 164.85, "duration": 1.24}, {"text": "hypothesis that a person without a lot of money in considered poor would be less likely to return the wallet than someone who had a", "start": 166.09, "duration": 6.44}, {"text": "lot of money. And to do this I looked at publicly available census data and found the zip codes with the highest and lowest", "start": 172.53, "duration": 5.369}, {"text": "medium income then I instructed my friends helping in each city to randomly drop half the wallets in the high-income area of the city and", "start": 178.06, "duration": 6.35}, {"text": "then the other half in the low-income area. In each while it was marked with a unique number on the back of this card", "start": 184.41, "duration": 4.799}, {"text": "so we knew exactly which city and location if somebody called it in. And when we tallied it up:", "start": 189.209, "duration": 4.14}, {"text": "60 wallets were called in from the high-income areas and", "start": 193.45, "duration": 2.75}, {"text": "exactly 60 wallets were also returned from the low-income areas which I thought was pretty cool. So a rich person is no more likely to return", "start": 196.269, "duration": 6.44}, {"text": "A wallet than someone in the lowest income bracket who could probably use the money.", "start": 202.709, "duration": 4.08}, {"text": "In fact: we had one person calling who is homeless, two people calling who are living in shelters, and a fourth person who is a", "start": 206.79, "duration": 4.889}, {"text": "panhandler. All four of them had full wallets. Another question", "start": 211.87, "duration": 3.35}, {"text": "I wanted a test was if women were more honest than men it turns out a majority of the wallets were returned by men but", "start": 215.22, "duration": 5.639}, {"text": "Think about it that doesn't necessarily mean. They are more honest because maybe the locations they were dropped", "start": 221.03, "duration": 4.32}, {"text": "There's typically more men like in front of a sports bar or a hardware store so to control for this", "start": 225.35, "duration": 4.619}, {"text": "I had all my helping friends in each city dropped two of the ten wallets in a men's restroom", "start": 229.97, "duration": 4.319}, {"text": "And then two in a women's bathroom", "start": 234.29, "duration": 1.89}, {"text": "This way we could control the gender of the wallet finder once again this came up nearly identical", "start": 236.18, "duration": 4.559}, {"text": "with 23 wallets returned for men versus", "start": 240.93, "duration": 2.75}, {"text": "24 for women so gender doesn't seem to play a role in a person's honesty either", "start": 243.81, "duration": 3.919}, {"text": "And I should mention here one of the questions", "start": 247.73, "duration": 1.41}, {"text": "We asked the caller's was if they thought the wallet looked fake", "start": 249.14, "duration": 2.279}, {"text": "or", "start": 251.42, "duration": 0.46}, {"text": "Suspicious at all and only a very small minority did so this confirms that for those who didn't call it was likely because they were", "start": 251.88, "duration": 6.139}, {"text": "Dishonest and not because they thought it wasn't a real person's wallet another thing we tested was small town versus big city", "start": 258.019, "duration": 5.91}, {"text": "So you notice four of the cities you've probably never heard of before that's because they have populations of around a thousand people", "start": 264.11, "duration": 5.67}, {"text": "whereas the rest were the largest cities in North America and here we did see a", "start": 269.88, "duration": 3.589}, {"text": "Significant difference in the small towns the average rate of return was eight wallets whereas in the big cities", "start": 273.6, "duration": 4.669}, {"text": "It was six", "start": 278.27, "duration": 0.869}, {"text": "And I think this sort of makes sense to me because small towns tend to foster a sense of community", "start": 279.139, "duration": 3.72}, {"text": "Where everyone knows everyone versus the anonymity of a big city and now for a rundown of all the cities?", "start": 283.32, "duration": 5.029}, {"text": "I'll break them into three categories starting with the least honest", "start": 288.35, "duration": 2.79}, {"text": "We've got Detroit with three wallets returned and New York City with four I was really rooting for Detroit and hoping they would just surprise", "start": 291.14, "duration": 7.079}, {"text": "Everyone but looks like maybe they're still in the process of their rebuilding efforts then for the middle of the pack at five wallets return", "start": 298.22, "duration": 5.88}, {"text": "We've got Seattle, Los Angeles Miami Dallas and Edmonton and at six well. It's return", "start": 304.13, "duration": 4.38}, {"text": "We've got Huntsville, Alabama and New London Connecticut, which is one of our small towns next at seven wallets", "start": 308.51, "duration": 5.159}, {"text": "We've got San Francisco, Winnipeg and Washington DC", "start": 313.669, "duration": 2.7}, {"text": "The final category is the Honest Abe cities with Parma, Idaho and Las Vegas at eight wallets", "start": 316.729, "duration": 5.19}, {"text": "And I should mention for Vegas instead of high-income and low-income we put half on the strip and then half in the suburbs and for", "start": 321.919, "duration": 5.79}, {"text": "What it's worth all five dropped on the strip were returned and then at a remarkable nine wallets return", "start": 327.71, "duration": 5.04}, {"text": "We've got two more small cities with Nashua, Idaho and Hill City, South Dakota and then Portland", "start": 332.75, "duration": 5.279}, {"text": "Oregon Macon Fred and Carrie proud and finally there were two cities with an astounding", "start": 338.03, "duration": 4.259}, {"text": "100% return rate vote for big cities with Chicago which I didn't see coming", "start": 343.08, "duration": 3.98}, {"text": "And then Salt Lake City and before he just shot, Salt Lake City up to those gosh darn super nice Mormons", "start": 347.39, "duration": 4.559}, {"text": "It's like of the eight people wearable the interview only three said they were religious and only one", "start": 351.95, "duration": 4.359}, {"text": "Attended church in fact about 40% of the people who turn in wallet said they were not religious", "start": 356.44, "duration": 4.279}, {"text": "And this is close enough to the average for a large city that", "start": 360.72, "duration": 1.92}, {"text": "it's fair to say that whether or not a person was religious seem to have no outcome on their honesty according to our data and", "start": 362.64, "duration": 5.609}, {"text": "I should also mention that while our two Canadian cities finished right in the middle of the pack my Canadian friend saw this on his", "start": 368.25, "duration": 5.489}, {"text": "Facebook page right after dropping his wallets and going the extra mile with a", "start": 373.74, "duration": 3.3}, {"text": "Blanket Facebook post to find a random wallet owner is just about the most Canadian thing ever", "start": 377.11, "duration": 4.579}, {"text": "He also dropped ten wallets in Disneyland, and we were hoping to get a large number back", "start": 381.96, "duration": 3.51}, {"text": "But we only got four calls from individuals", "start": 385.47, "duration": 1.51}, {"text": "and then too from", "start": 386.98, "duration": 1.44}, {"text": "Security who were super confused when they had identical wallets turned in at which point they made it very clear", "start": 388.42, "duration": 5.059}, {"text": "They would not be calling us back if more wallets came in because they hate science so we had a third Disney Line now as", "start": 393.48, "duration": 5.309}, {"text": "A data point because we just don't know how many got turned into security", "start": 398.79, "duration": 2.549}, {"text": "So those were the findings", "start": 401.34, "duration": 1.14}, {"text": "And I'd say from all this I learned two things", "start": 402.48, "duration": 2.1}, {"text": "The first is that it's a really good idea to put your phone number somewhere in your wall", "start": 404.8, "duration": 4.43}, {"text": "That's probably one of the reasons we have such a high rate of return also", "start": 409.23, "duration": 3.089}, {"text": "I found out if you find a wallet you can drop it in any u.s.", "start": 412.32, "duration": 3.299}, {"text": "Post office box, and then we return it to the address found on the driver's license free of charge", "start": 415.62, "duration": 4.26}, {"text": "I tested this out and it totally works and the second thing is that in general", "start": 419.88, "duration": 3.839}, {"text": "People are way more honest than I originally thought having just lost my wallet", "start": 423.91, "duration": 3.889}, {"text": "I was anticipating a return rate of maybe 20%", "start": 427.8, "duration": 2.91}, {"text": "so to get two out of every three wallets back blew my mind in one city a", "start": 430.84, "duration": 4.25}, {"text": "Convenience order loved what we were doing so she kept putting the wallet back in the bathroom received someone would steal it and after six", "start": 435.22, "duration": 5.779}, {"text": "Times of somebody bringing the wallet back with all of the money inside she gave up trying", "start": 441.0, "duration": 4.26}, {"text": "Lately it seems like so much of what you see online is meant to stoke", "start": 445.48, "duration": 3.319}, {"text": "Outrage at some group of people versus ourselves because that's what gets shared and that begins to warp our", "start": 448.93, "duration": 5.809}, {"text": "Perspectives that the only good people out there are those within our own group", "start": 454.9, "duration": 3.11}, {"text": "but this cold hard data shows that across any age or gender or", "start": 458.01, "duration": 3.479}, {"text": "socio-economic background", "start": 461.77, "duration": 1.17}, {"text": "cross the whole religious spectrum through middle of", "start": 462.94, "duration": 2.69}, {"text": "America and along the coast there are lots of good people everywhere and not only that but they constitute a majority", "start": 465.7, "duration": 6.029}, {"text": "these people didn't call it for some reward or", "start": 471.98, "duration": 2.269}, {"text": "Facebook lights or because they knew someone was watching they did it because it was simply the right thing to do and I think that's", "start": 474.35, "duration": 6.26}, {"text": "Pretty cool and something worth remembering", "start": 480.61, "duration": 2.22}, {"text": "The science in this video was brought to you by my longtime friends at audible summer is coming which means between long road trips hitting", "start": 484.7, "duration": 6.709}, {"text": "the gym or working in the yard you can make", "start": 491.41, "duration": 2.22}, {"text": "Previously boring stretches of time something you actually look forward to by listening to audiobooks and to test that out for free you can go", "start": 493.79, "duration": 6.29}, {"text": "To audible.com slash mark Rober or simply text mark over to 500 500 in fact while doing my wallet Steakhouse for this video", "start": 500.08, "duration": 6.959}, {"text": "I was listening to astrophysics for people in a hurry by Neil deGrasse Tyson", "start": 507.04, "duration": 3.57}, {"text": "Besides energy in", "start": 512.84, "duration": 2.0}, {"text": "1904 the even with my background in space I learned a ton about the universe", "start": 515.06, "duration": 3.919}, {"text": "And how we came to discover it", "start": 518.979, "duration": 2.16}, {"text": "It's written for people who don't have PhDs in astrophysics, but I've genuinely curious minds about the amazing universe all around us", "start": 521.14, "duration": 7.049}, {"text": "And if you download it and for some crazy reason you don't like it, audible will let you swap it out for something else no", "start": 528.19, "duration": 4.71}, {"text": "Questions asked. So if you want to make your brain bigger by listening to this book or any other book for free again go to", "start": 532.9, "duration": 5.309}, {"text": "Audible.com slash Mark Rover or simply text Mark Rover to 500 500. Thanks for watching", "start": 538.21, "duration": 5.339}]