[{"text": "Three months ago, despite my better judgment", "start": 0.0, "duration": 2.38}, {"text": "I put liquid metal inside my 2017 MacBook Pro. And by so doing", "start": 2.38, "duration": 4.42}, {"text": "improved the thermal performance of the laptop by over 15% from the stock thermal pace", "start": 7.12, "duration": 5.689}, {"text": "That's a lot! And since then my computer has been both as quiet--and as cool--as a cucumber", "start": 12.91, "duration": 5.42}, {"text": "...yes cucumbers are quiet. But has the magical conductive liquid caused any damage inside of my machine?", "start": 19.27, "duration": 6.289}, {"text": "That's the real question, because there are warnings all over about how dangerous liquid metal can be. Well, let's find out.", "start": 25.84, "duration": 6.889}, {"text": "Do you know what else is magical? Our sponsor \"Setapp\". Get this: You pay $10 per month, and you get access to", "start": 32.95, "duration": 5.75}, {"text": "thousands of dollars of premium and beloved Mac apps. Click the link in the video description to start your free trial today--no credit card required.", "start": 38.92, "duration": 7.08}, {"text": "So, as I mentioned previously, both the thermal performance, and my perceived longevity of the hardware with liquid metal has been excellent.", "start": 46.51, "duration": 6.92}, {"text": "However, I've become a little nervous in recent weeks because, well, for one the laptop is not a stationary one", "start": 53.699, "duration": 6.36}, {"text": "so the liquid metal has more than certainly been jostled about. Though, the conformal coating that I applied", "start": 60.059, "duration": 5.941}, {"text": "is supposed to create an invisible barrier between the very conductive metal and sensitive", "start": 66.0, "duration": 5.249}, {"text": "electronics--and I'm also nervous about the fact that liquid metal is highly corrosive to aluminum.", "start": 71.47, "duration": 5.0}, {"text": "Gallium, the main ingredient in liquid metal, can penetrate the porous grain structure of aluminum and it chemically", "start": 76.72, "duration": 6.739}, {"text": "amalgamates--it basically breaks down the strength of the aluminum as", "start": 83.68, "duration": 3.409}, {"text": "demonstrated to us by our friends at Business Insider.", "start": 87.64, "duration": 3.29}, {"text": "Now, we only applied liquid metal to the CPU dye itself and to the thin copper shim", "start": 90.93, "duration": 4.199}, {"text": "which is attached to the cooler sheet pipe. None of that is aluminum.", "start": 95.13, "duration": 3.15}, {"text": "However, if the liquid metal has spread around a bit, as I suspect it might. It may have come in contact with the cooler mounting assembly.", "start": 98.28, "duration": 7.769}, {"text": "Which is aluminum [speaks Spanish]", "start": 106.049, "duration": 2.761}, {"text": "And, so, it's time to pull this thing apart again and see if there's any damage.", "start": 110.2, "duration": 4.01}, {"text": "First, we've got to shut 'er down, and then we will flip the laptop upside down,", "start": 114.909, "duration": 4.25}, {"text": "undo the rear screws. And, then, remove the rear cover which requires that you slide the lid away from the hinge before lifting.", "start": 119.59, "duration": 7.819}, {"text": "Once you get a hang of this thing, it's pretty easy. But holy smokes the first few time are really hard!", "start": 127.78, "duration": 6.169}, {"text": "Anyways, the rest of the disassembly is actually pretty straightforward, boring and relatively easy.", "start": 134.409, "duration": 5.06}, {"text": "In fact, it only took me eight minutes and thirty seconds. So I'm pretty proud of myself for that", "start": 139.47, "duration": 5.25}, {"text": "Now it comes time to actually pull the cooling assembly away from the motherboard.", "start": 145.0, "duration": 3.799}, {"text": "Well, I guess we've got to unscrew the tightening fasteners at the back. That's boring. Come on. Hurry up. Let's go. Let's go", "start": 149.14, "duration": 5.239}, {"text": "Okay, now it's time for the moment of truth... and it actually looks pretty great!", "start": 154.569, "duration": 4.94}, {"text": "Well, the dye, that is. We'll get to the cooler in a second.", "start": 159.7, "duration": 3.289}, {"text": "The liquid metal on the dye is just as liquidy as it was when I applied it.", "start": 163.42, "duration": 4.459}, {"text": "Which is great because good liquid metal (like the Thermal Grizzly Conductonaut I used)", "start": 167.879, "duration": 4.521}, {"text": "only dries out if it's exposed to direct airflow. Which, if your cooler is seated properly--it won't be", "start": 172.4, "duration": 6.6}, {"text": "The liquid also hasn't shifted around at all", "start": 179.0, "duration": 2.108}, {"text": "which is excellent! And I was probably worried a little bit over nothing.", "start": 181.109, "duration": 3.81}, {"text": "That said, I am a little concerned about the copper cooler shim, because it does not look shiny or wet", "start": 185.109, "duration": 5.57}, {"text": "certainly not like the dye", "start": 191.019, "duration": 1.481}, {"text": "And not even as shiny as it was when I applied the gallium directly to it three months ago", "start": 192.819, "duration": 4.22}, {"text": "It has kind of a soaked in look. And liquid metal does this:", "start": 197.23, "duration": 3.77}, {"text": "It penetrates every metal just copper, more slowly.", "start": 201.0, "duration": 3.929}, {"text": "But even most of the videos I've seen online show a relatively wet copper surface after several months.", "start": 205.06, "duration": 5.94}, {"text": "And mine, well, it's not it's not even slightly wet", "start": 211.5, "duration": 2.97}, {"text": "in fact, it's basically 100% dry", "start": 214.47, "duration": 1.53}, {"text": "and it's not until I rub the block with a rubbing alcohol doused rag", "start": 217.0, "duration": 4.129}, {"text": "that I can pick any of the liquid metal up", "start": 221.23, "duration": 2.389}, {"text": "Now, that would lead me to believe that maybe the cooler shim wasn't making contact with the CPU dye.", "start": 224.319, "duration": 5.539}, {"text": "But, that also seems pretty highly unlikely given the", "start": 230.44, "duration": 2.76}, {"text": "a. Insane mounting pressure that Apple uses on its coolers.", "start": 233.3, "duration": 3.6}, {"text": "b. The excellent temperatures that I've been getting ever since install, and", "start": 236.9, "duration": 3.049}, {"text": "c. The fact that the dye is not dried out.", "start": 239.949, "duration": 3.151}, {"text": "Do you have any thoughts? 'Cause I honestly am a little bit perplexed", "start": 243.2, "duration": 3.399}, {"text": "Regardless, after a rubbing alcohol infused cleanup, there is visible alloying on top of the CPU dye.", "start": 247.03, "duration": 5.869}, {"text": "See how it isn't really shiny anymore? And the CPU cooler", "start": 253.0, "duration": 2.929}, {"text": "Well, it still looks super silver. It doesn't even look like I did anything. Even after a ton of alcohol rag treatment", "start": 256.87, "duration": 6.109}, {"text": "Now, this doesn't effect performance in any way", "start": 263.349, "duration": 2.6}, {"text": "But I still wanted to see if I could remove it", "start": 266.08, "duration": 2.419}, {"text": "Especially because Apple might give me trouble if I ever need to get my keyboard repaired under their new extended replacement program", "start": 268.72, "duration": 7.01}, {"text": "Thank you for finally admitting fault for crappy design Apple", "start": 275.73, "duration": 2.91}, {"text": "So I used an ultrasonic cleaner to penetrate the tiny pores of the copper metal.", "start": 278.95, "duration": 4.819}, {"text": "I heated up a solution of rubbing alcohol and simple green, which can be flammable. So don't do it...", "start": 284.08, "duration": 5.659}, {"text": "...but I did it. And I heated the liquid to nearly 80 degrees Celsius", "start": 290.71, "duration": 3.89}, {"text": "After 20 minutes of short and long-wave treatment. It actually looks significantly better", "start": 295.03, "duration": 5.209}, {"text": "But, the copper does still show signs of liquid metal presence and is over all discolored. Again, doesn't impact performance", "start": 300.46, "duration": 6.589}, {"text": "but it does look a little goofy. Now, well, it's not that big of a deal.", "start": 307.18, "duration": 3.679}, {"text": "Confession time. While I've liked the idea of having liquid metal inside my laptop,", "start": 311.38, "duration": 4.429}, {"text": "it really only provided an improvement of about 7 percent over a high-quality thermal paste", "start": 315.85, "duration": 5.63}, {"text": "which is much lower risk, and doesn't require annual replacement.", "start": 321.48, "duration": 4.049}, {"text": "So, I just decided to settle, and put in standard Arctic mx2 instead and not have to worry about it.", "start": 325.53, "duration": 6.209}, {"text": "You'll still get a seven-to-ten percent improvement from the stock Apple paste job--and you'll save money and stress in the process", "start": 331.84, "duration": 6.92}, {"text": "without any damage to your computer. Do you know what else saves money and stress? \"Setapp\"", "start": 338.76, "duration": 4.649}, {"text": "these guys are a new sponsor and I'm already a huge fan. For less than $10 a month, you get access to over", "start": 343.41, "duration": 5.279}, {"text": "120 premium Mac apps. And, this isn't like shovelware stuff. These are fantastic", "start": 348.7, "duration": 4.49}, {"text": "Mac apps. Apps like the writing tool Ulysses, which I included in my top 5 favorite Mac apps video last year. And bartender", "start": 353.38, "duration": 7.459}, {"text": "which is a favorite amongst Mac power users and has been for over a decade. You can sign up for a 7-day free trial", "start": 360.84, "duration": 6.149}, {"text": "no credit card required, and the app that you download has a great UI for discovering new apps in every category", "start": 366.99, "duration": 6.24}, {"text": "utilities, education, development, creativity, Mac apps, writing, personal finance, et cetera. Apps take just a second to install and, well,", "start": 373.78, "duration": 7.22}, {"text": "you name the app you want and they probably have something like it. Become one of more than half a million users,", "start": 381.09, "duration": 5.1}, {"text": "including myself. To give setup a try for free today, please do so through the link below and let them know that I sent you.", "start": 386.38, "duration": 5.62}, {"text": "While regular thermal paste may not be as exciting as liquid metal, I'm honestly much more at ease", "start": 392.47, "duration": 5.53}, {"text": "and I will leave the crazy hardware modifications to my stationary desktop tank.", "start": 398.0, "duration": 4.639}, {"text": "If you enjoyed this video, please give it a like! If you didn't, well that other button seems to work okay, too.", "start": 402.709, "duration": 5.291}, {"text": "Check out my other awesome videos over here and get subscribed to the channel for more excellent videos like these.", "start": 408.1, "duration": 4.768}, {"text": "But most importantly, and as always, thank you for watching and stay snazzy!", "start": 412.969, "duration": 4.459}]