[{"text": "[singing]", "start": 7.94, "duration": 2.0}, {"text": "Ash: You come here!... Or just hit your head against the mic!", "start": 45.56, "duration": 3.34}, {"text": "You gonna sniff the Google Doc in front of you?", "start": 48.9, "duration": 2.28}, {"text": "Is this what you want? [kissing noises]", "start": 51.18, "duration": 1.22}, {"text": "I know, you're so needy. [cat meows] I know. [meow] Meow.", "start": 52.4, "duration": 3.74}, {"text": "Oh, thanks for showing me your tummy. That's a good tummy.", "start": 56.14, "duration": 2.8}, {"text": "Good morning, world.", "start": 58.94, "duration": 1.24}, {"text": "Since I graduated college in 2014, I have been dealing with eating disorder behavior. Oh my gosh.", "start": 60.18, "duration": 6.36}, {"text": "I have been really afraid to talk about this online, because – I hope it comes across that I strive to be thoughtful and careful", "start": 66.54, "duration": 7.42}, {"text": "regarding the content I discuss and how I discuss it, and ED issues just require extra thought and care, undoubtably.", "start": 73.96, "duration": 7.72}, {"text": "Also, I'm not fully recovered.", "start": 81.68, "duration": 1.54}, {"text": "And tackling the subject while I'm still working through it makes me feel like a bit of an imposter.", "start": 83.22, "duration": 6.28}, {"text": "A phony, a hack, a self-righteous dinkle dork.", "start": 89.5, "duration": 4.06}, {"text": "Basically just a human who's really unqualified to preach – Like a hypocrite –", "start": 93.56, "duration": 3.82}, {"text": "But here's the deal. If I wait until my words are perfect, or I'm \"all better\",", "start": 97.38, "duration": 5.04}, {"text": "I will never talk about this stuff on my channel.", "start": 102.42, "duration": 3.52}, {"text": "And I want to because the way my eating disorder interacts with my dysphoria and trans identity", "start": 105.94, "duration": 5.8}, {"text": "is a huge source of my struggle. And it seems like a lot of trans people feel this way, too.", "start": 111.74, "duration": 5.08}, {"text": "But no one is talking about it. I'd like to put the conversation on the table.", "start": 116.82, "duration": 3.68}, {"text": "Plus, I don't think I'll ever be fully recovered. [click] Like ever.", "start": 120.5, "duration": 5.22}, {"text": "Although this last year has been one of the best years ever regarding the issue, so that's cool. Self high five. [clap]", "start": 125.72, "duration": 7.3}, {"text": "I'm gonna go make coffee.", "start": 133.02, "duration": 1.56}, {"text": "[music]", "start": 136.14, "duration": 2.0}, {"text": "I think I'm just gonna be vulnerable and trust that you folks will point out if I do or say something that's not great.", "start": 165.74, "duration": 7.38}, {"text": "You point it out, you tell me I'm being problematic. [bark] If I'm problematic, just do that. You're a good girl!", "start": 173.12, "duration": 6.22}, {"text": "Right off the bat, I know that I don't want to romanticize eating disorders.", "start": 179.34, "duration": 3.78}, {"text": "I don't want to talk about the specifics of any of my unhealthy behaviors, 'cause I don't want anyone to get ideas.", "start": 183.12, "duration": 5.72}, {"text": "That can really happen when you talk about this stuff. I don't want to do that.", "start": 188.84, "duration": 3.58}, {"text": "I also don't want to body shame anyone. Um, including myself.", "start": 192.42, "duration": 3.76}, {"text": "You're a good body. You take me places and help me do things. [smooch]", "start": 196.18, "duration": 4.04}, {"text": "If something does come out of my mouth though that is unintentionally icky, I'm sorry.", "start": 200.22, "duration": 4.0}, {"text": "Let me know and I will do my best to note it and not do the thing in the future.", "start": 204.22, "duration": 4.6}, {"text": "The reason this is on my mind is 'cause I'm going to therapy today and we talk a lot about this there. It's great.", "start": 208.82, "duration": 7.86}, {"text": "[sneezes]", "start": 216.68, "duration": 1.22}, {"text": "Gesundheit. Thank you. [cat meowing in background] Meow.", "start": 218.64, "duration": 3.6}, {"text": "I don't think you understand how many pets I have. – Really? Really?", "start": 222.24, "duration": 4.18}, {"text": "There are so many animals.", "start": 226.42, "duration": 1.68}, {"text": "As my top surgery date approaches, it actually increases my urge to eat or not eat in unhealthy ways.", "start": 228.1, "duration": 5.9}, {"text": "It's weird. But my therapist thinks it makes total sense, and he has a theory for why.", "start": 234.0, "duration": 4.9}, {"text": "He poses that I don't want to feel rejected by society. True. Can confirm. I don't want that.", "start": 238.9, "duration": 5.38}, {"text": "Many of us work to be loved, and/or admired by others.", "start": 244.28, "duration": 3.06}, {"text": "Top surgery makes me anxious because I'm doing something that society is not into.", "start": 247.34, "duration": 4.58}, {"text": "And I'm afraid that afterwards, people will think... I am like, a \"freak\".", "start": 251.92, "duration": 5.7}, {"text": "To counteract this, I'm trying to become appealing to society in another way – by being \"thin\" and \"fit\".", "start": 257.62, "duration": 7.46}, {"text": "Spoiler: You're actually not that fit if you have an eating disorder, so, my logic is flawed. –", "start": 265.08, "duration": 5.96}, {"text": "– Are you pushing me? [kissing noises]", "start": 271.04, "duration": 1.84}, {"text": "Your feet are probably so dirty, and I kissed them, yucky.", "start": 272.88, "duration": 4.18}, {"text": "It's super messed up, but, an insecure part of my psyche feels like it will lessen the blow", "start": 277.06, "duration": 5.88}, {"text": "of being seen as an outcast by society,", "start": 282.94, "duration": 2.92}, {"text": "if I can look at the world and say, \"Hey you think I'm a freak, but at least I'm a sexy freak!\"", "start": 285.86, "duration": 5.68}, {"text": "That's messed up, isn't it? Yep. I know. I'm... working through some stuff.", "start": 291.54, "duration": 5.54}, {"text": "On the inside, though, I don't feel sexy at all.", "start": 297.08, "duration": 2.12}, {"text": "When I'm ruled by this train of thought I feel miserable and exhausted and mentally drained and empty.", "start": 299.2, "duration": 6.38}, {"text": "So, clearly it isn't working for me.", "start": 305.58, "duration": 2.74}, {"text": "Again, eating disorders aren't cute. They're just... eating disorders.", "start": 308.32, "duration": 7.0}, {"text": "I'm not like, relatably tortured, I'm just tired.", "start": 315.32, "duration": 3.48}, {"text": "Coffee's gone. I'm gonna go take a shower or a walk or something.", "start": 319.92, "duration": 3.58}, {"text": "[music]", "start": 324.66, "duration": 2.0}, {"text": "[clap] I went swimming.", "start": 409.389, "duration": 1.131}, {"text": "So in therapy we try to unpack where that defense mechanism I mentioned earlier comes from,", "start": 410.52, "duration": 5.28}, {"text": "kind of why I developed it in the first place, and how it served me in the past.", "start": 415.8, "duration": 4.06}, {"text": "This helps me understand myself more and find healthier ways to cope.", "start": 419.86, "duration": 3.84}, {"text": "I know that not everyone can afford or gain access to therapy. So I want to tell you about BetterHelp,", "start": 423.7, "duration": 4.86}, {"text": "which is this video's sponsor.", "start": 428.56, "duration": 2.22}, {"text": "But first I have to hop in the shower. I smell like chlorine", "start": 430.8, "duration": 3.34}, {"text": "[music]", "start": 434.14, "duration": 2.0}, {"text": "BetterHelp is an affordable and convenient way to receive counseling from home.", "start": 438.48, "duration": 5.16}, {"text": "This means you can be in bed or in PJs or just hopped out of the shower when you get therapy – How cool!", "start": 443.64, "duration": 5.64}, {"text": "It's legit, too, they provide professional licensed therapists for only 35 to 70 US dollars a week,", "start": 449.28, "duration": 5.86}, {"text": "Which is significantly lower than traditional therapy, which usually ranges from 150 to 300 dollars a session.", "start": 455.14, "duration": 6.86}, {"text": "And what's even more rad is financial assistance is available for those who can't afford it.", "start": 462.0, "duration": 4.86}, {"text": "[music]", "start": 466.86, "duration": 2.0}, {"text": "They also take matching with the right therapist very seriously, which is dope.", "start": 474.04, "duration": 4.04}, {"text": "You put tons of info into your profile – Perhaps including if you're non-binary. That's an option.", "start": 478.08, "duration": 6.26}, {"text": "Also, you can request an LGBT+ professional and switch at any time if you and your person aren't vibing.", "start": 484.34, "duration": 5.8}, {"text": "I've used BetterHelp before, I dig it. I like that you can talk as much as you want", "start": 490.14, "duration": 3.92}, {"text": "Through emails, messages, phone calls, et cetera,", "start": 494.06, "duration": 2.48}, {"text": "And yeah, I have to get dressed now. It's time. Time to put on clothes!", "start": 496.54, "duration": 4.94}, {"text": "[music]", "start": 501.48, "duration": 2.0}, {"text": "I'll put BetterHelp's site in the description,", "start": 514.02, "duration": 1.94}, {"text": "And if you're feeling any of the ways I've been feeling –", "start": 515.96, "duration": 2.38}, {"text": "dysphoric, ugly-ish, rejected, alone-ish, afraid of being alone –", "start": 518.34, "duration": 5.9}, {"text": "then you should definitely click the link and check them out.", "start": 524.24, "duration": 1.88}, {"text": "Processing these feelings with someone else is super helpful.", "start": 526.12, "duration": 2.64}, {"text": "Also, I'm gonna be vulnerable for a second, I'm super happy that BetterHelp asked to partner up with me,", "start": 528.76, "duration": 5.2}, {"text": "'cause I have been putting off this video for so long. Like, so, so long. Years long.", "start": 533.96, "duration": 4.1}, {"text": "Um, I've recorded it and deleted it and recorded it and deleted it about a hundred times.", "start": 538.06, "duration": 6.36}, {"text": "In January, I even recorded a collab about this topic with the wonderful Aaron Ansuini.", "start": 544.42, "duration": 5.02}, {"text": "Ash: What has your experience been with eating disorders?\nAaron: [hums in thought]", "start": 549.44, "duration": 5.76}, {"text": "Ash: And I never posted it because I was scared.", "start": 555.2, "duration": 2.46}, {"text": "Aaron posted his video, you should totally go check it out. It's about gender euphoria, it's great.", "start": 557.66, "duration": 4.8}, {"text": "And then I had to Whatsapp him and be like, \"I'm so sorry Aaron, I'm just not ready, please don't hate me, please.\"", "start": 562.46, "duration": 5.74}, {"text": "But now, I don't know. When BetterHelp approached me something just felt right,", "start": 568.2, "duration": 4.5}, {"text": "It felt like this is the time you should talk about it, especially because all your feelings are so bubbly right now.", "start": 572.7, "duration": 5.2}, {"text": "You should do it. Just start talking about it, because it's so important to you and you want to talk about it.", "start": 577.91, "duration": 4.53}, {"text": "This is cool, because now I can link y'all. Now, I'm not just talking about it,", "start": 582.44, "duration": 3.38}, {"text": "now I'm also linking y'all to a resource that could be helpful if you can relate.", "start": 585.82, "duration": 4.62}, {"text": "I'm also gonna link a lot of other resources below.", "start": 590.44, "duration": 3.7}, {"text": "The problem with some of the resources that I find, none of them are geared like specifically towards trans people,", "start": 594.14, "duration": 6.02}, {"text": "and like, a lot of the reasons that trans people have issues with weight are like trans-specific,", "start": 600.16, "duration": 5.38}, {"text": "so, sometimes treatment unintentionally geared towards cis folk, it's just not helpful for me.", "start": 605.54, "duration": 5.84}, {"text": "Those aren't the feels I'm feeling.", "start": 611.38, "duration": 1.24}, {"text": "That's one of the reasons that I do really like therapy, because I get to make it all about me.", "start": 612.62, "duration": 4.18}, {"text": "So, yeah.", "start": 618.18, "duration": 0.8}, {"text": "Mom's home! [dog barks] Mom's home! Mom's home! Mom's home!", "start": 618.98, "duration": 2.24}, {"text": "Ash: Mom's home on lunch! Aah, Mom's home!\nGrace: Mom's working from home for the rest of the day.\nAsh: Mom's working from home for the rest of the day!", "start": 621.22, "duration": 6.7}, {"text": "Ash: [singing] Mom home for the rest of the day is the best surprise ever.", "start": 627.92, "duration": 3.64}, {"text": "(A): I love when Mom's home for the rest of the day, it's the best surprise ever.", "start": 631.56, "duration": 4.38}, {"text": "(A): I love when Mom's home for the rest of the day, it's the best surprise ever!", "start": 635.94, "duration": 4.68}, {"text": "(A): [inarticulate singing]", "start": 640.62, "duration": 6.02}, {"text": "Grace: Are you squeezing my head with your feet?\nAsh: No, you are!", "start": 646.64, "duration": 2.54}, {"text": "(G): Ow! Ow! Ow!\n(A): [laughing] You are a goofy goober.\n(G): I know.", "start": 650.76, "duration": 6.66}, {"text": "[clap]\nAsh: I think today in therapy,", "start": 660.4, "duration": 2.1}, {"text": "I'm gonna talk about my fear of gaining weight during top surgery recovery,", "start": 662.5, "duration": 4.16}, {"text": "and how ashamed I am for holding that fear.", "start": 666.66, "duration": 2.74}, {"text": "It makes me feel fatphobic and transphobic and hypocritical,", "start": 669.4, "duration": 3.64}, {"text": "And clearly illustrates some internalized beliefs about under what conditions I feel worthy/desirable.", "start": 673.04, "duration": 6.88}, {"text": "– Only when I'm skinny and pandering to the world's expectations of me.", "start": 679.92, "duration": 3.28}, {"text": "I am very embarrassed that I care about my weight.", "start": 683.2, "duration": 3.34}, {"text": "How unfeminist of me, right?... I don't know. Maybe. But that's how it feels.", "start": 686.54, "duration": 6.46}, {"text": "Ash: Guy walking a dog. –\nGuy: Don't fall!\nAsh: I won't fall, thank you! Hello! Oh! I'm okay!", "start": 693.0, "duration": 6.32}, {"text": "And I truly believe that all kinds of bodies are beautiful, attractive, desirable, healthy, et cetera.", "start": 699.32, "duration": 5.88}, {"text": "Except when it comes to my own. All of that rings true for me, except when it's about me.", "start": 705.2, "duration": 4.9}, {"text": "I hold myself to an unrealistic, destructive standard. It's not cute.", "start": 710.1, "duration": 4.72}, {"text": "Mostly, when I go to therapy, I end up talking less about my fear of gaining weight and more about how horrible I feel for caring in the first place. It's fun.", "start": 714.82, "duration": 9.84}, {"text": "Okay, time to go to therapy. [laughs]", "start": 724.66, "duration": 4.12}, {"text": "I'm glad dog guy was nice.", "start": 730.28, "duration": 1.9}, {"text": "[music]", "start": 732.88, "duration": 2.0}, {"text": "Yay, I'm in downtown Minneapolis about to go to therapy. See you in 50 minutes.", "start": 749.42, "duration": 3.76}, {"text": "[clock ticking] [Ding!]", "start": 755.08, "duration": 2.0}, {"text": "So that went well, I guess. I cried a lot. I always cry a lot though, so.", "start": 757.2, "duration": 6.32}, {"text": "Scott basically said to be patient and compassionate with myself.", "start": 763.52, "duration": 3.0}, {"text": "To understand that it's human to have ingrained problematic thoughts.", "start": 766.52, "duration": 4.1}, {"text": "Apparently I'm not a horrible person. Easier said than internalized.", "start": 770.62, "duration": 4.84}, {"text": "Scott is also encouraging me to actively practice loving my body, always. Especially when I feel least attractive.", "start": 775.46, "duration": 6.08}, {"text": "When that happens, I think I'm gonna find a mirror, make eye contact with myself and say, \"Hey body,", "start": 781.58, "duration": 3.94}, {"text": "\"you are a good body. Without you, I wouldn't be. Thank you for being my house You are appreciated and loved,", "start": 785.52, "duration": 6.28}, {"text": "\"and beautiful, just as you are, exactly in this moment.\"", "start": 791.8, "duration": 4.04}, {"text": "My therapist and I also dove deep into when and where these problematic beliefs might have formed.", "start": 795.84, "duration": 5.84}, {"text": "That was terribly emotionally draining.", "start": 801.68, "duration": 2.28}, {"text": "The idea, however, is the better we understand where these ideas come from,", "start": 803.96, "duration": 3.66}, {"text": "the easier it will be to unpack, reframe, and deconstruct them.", "start": 807.62, "duration": 4.58}, {"text": "[laughing] We have to, like, learn their origin story. I love therapy. It's so easy.", "start": 812.2, "duration": 5.4}, {"text": "No, it's not. It's really hard, but it's super helpful! I ten out of ten would recommend it.", "start": 817.6, "duration": 5.0}, {"text": "I will – I'll be going to therapy for the rest of my, life for sure, so.", "start": 822.6, "duration": 3.26}, {"text": "Well, I hope you liked this, um, it's super fancy and edit-y because I'm trying to distract from like, the things I'm saying.", "start": 825.86, "duration": 6.78}, {"text": "Like, I'm really worried that y'all are gonna judge me for being weak, or being a bad person, or being vulnerable, or whatever.", "start": 832.64, "duration": 8.46}, {"text": "There's a hundred thousand different reasons to judge me and I'm really scared about that happening, so.", "start": 841.1, "duration": 5.82}, {"text": "My defense mechanism is like, throwing flashy editing at you.", "start": 846.92, "duration": 3.04}, {"text": "Um... Yep, that's all. [whispers] People are coming, I have to go.", "start": 849.96, "duration": 3.3}, {"text": "Okay, bye! [pop]", "start": 853.26, "duration": 2.0}, {"text": "[music]", "start": 856.18, "duration": 2.0}]