[{"text": "Cancelling birthright citizenship would be\nlegally difficult. Donald Trump has said he's", "start": 0.9, "duration": 5.27}, {"text": "interested in it. He's interested in exploring\ncanceling birthright citizenship. But for", "start": 6.17, "duration": 4.349}, {"text": "now, if you are born in the physical United\nStates, you are a citizen unless Donald Trump", "start": 10.519, "duration": 5.261}, {"text": "gets that changed. It's not happening in the\nimmediate, but the Trump administration has", "start": 15.78, "duration": 4.87}, {"text": "maybe found a sort of preemptive proxy to\ntest eliminating birthright citizenship. And", "start": 20.65, "duration": 6.43}, {"text": "the Trump administration has changed the policy\nfor children born to some military service", "start": 27.08, "duration": 5.77}, {"text": "members and other government employees and\ndiplomats physically outside of the borders", "start": 32.85, "duration": 5.03}, {"text": "of the United States. Historically, if you\nwere born in an overseas military base or", "start": 37.88, "duration": 6.05}, {"text": "if your parents are diplomats and you're born\nin a foreign hospital, I have friends who", "start": 43.93, "duration": 4.71}, {"text": "are in this situation right now. While your\nparents or parent is on diplomatic duty, you", "start": 48.64, "duration": 5.731}, {"text": "are automatically an American citizen. It's\njust, it's an automatic thing that takes place.", "start": 54.371, "duration": 4.359}, {"text": "The Trump administration is changing this\nnow. They're not eliminating it. They are", "start": 58.73, "duration": 3.68}, {"text": "changing the process. Starting October 29th\nthe process is going to change to one where", "start": 62.41, "duration": 5.41}, {"text": "the parents must apply for citizenship before\ntheir kid turns 18. Interestingly, I went", "start": 67.82, "duration": 6.3}, {"text": "through this process to become a citizen.\nWhen my parents became citizens. I then had", "start": 74.12, "duration": 4.41}, {"text": "the possibility of becoming a citizen up until\nage 18 merely by going through a simple administrative", "start": 78.53, "duration": 5.75}, {"text": "procedure. So for people who don't know, uh,\nI and my parents were all born in Argentina", "start": 84.28, "duration": 5.26}, {"text": "in 1989 my family came to the United States\nfrom Argentina as permanent residents. I was", "start": 89.54, "duration": 4.14}, {"text": "five years old at the time and then I think\nit must have been the mid to late nineties", "start": 93.68, "duration": 3.83}, {"text": "my parents became citizens of the u s they\nhad been here, I believe it was seven years", "start": 97.51, "duration": 3.35}, {"text": "at the time as permanent residents. They went\nthrough the process. They had the entire thing.", "start": 100.86, "duration": 4.88}, {"text": "It was then up to me whether I wanted to become\na citizen. Now I had two options. If I waited", "start": 105.74, "duration": 4.85}, {"text": "until age 18 and did not become a citizen,\nI would have to go through the entire process.", "start": 110.59, "duration": 5.17}, {"text": "From the beginning. I would have to apply.\nI would have to have the interview and the", "start": 115.76, "duration": 3.46}, {"text": "entire thing, but until age 18 my parents\ncould simply go to the post office and request", "start": 119.22, "duration": 6.43}, {"text": "a passport for me and I would automatically\nbecome a citizen of the United States and", "start": 125.65, "duration": 4.249}, {"text": "that's what we did. The new Trump policy is\nthat if your parents are US citizens, but", "start": 129.899, "duration": 5.782}, {"text": "you happen to be born abroad in a number of\nthese situations, not all of them. You need", "start": 135.681, "duration": 5.039}, {"text": "to be naturalized as the phrase is as the\nword is. Just like I had to be naturalized", "start": 140.72, "duration": 6.02}, {"text": "as someone who immigrated to the United States\nfrom another country.", "start": 146.74, "duration": 3.3}, {"text": "This is ridiculous and it's especially ridiculous\nbecause it serves no real purpose other than", "start": 150.04, "duration": 4.709}, {"text": "a bureaucratic obstacle. There is no advantage\nto this. There was no benefit to this. The", "start": 154.749, "duration": 4.02}, {"text": "explanation that the u s cis is giving, this\nis the u s citizenship and immigration services.", "start": 158.769, "duration": 7.33}, {"text": "They're saying that this is to align federal\nimmigration law with State Department procedures.", "start": 166.099, "duration": 7.021}, {"text": "This is a completely incredible explanation.\nBy incredible, I mean it is, it is not believable.", "start": 173.12, "duration": 4.72}, {"text": "It is not credible. This is merely a continuation\nof the trends that we've been seeing with", "start": 177.84, "duration": 4.869}, {"text": "Donald Trump. Trump's not good to the military.\nThis is a continuation of that. Trump attacks,", "start": 182.709, "duration": 4.741}, {"text": "gold star gold star families. This is a continuation\nof that. Trump attacked prisoner of war, John", "start": 187.45, "duration": 5.14}, {"text": "McCain for being a prisoner of war, saying\nhe prefers his war heroes not be captured", "start": 192.59, "duration": 4.64}, {"text": "or whatever the case may be, and now he wants\nto strip military and diplomatic babies of", "start": 197.23, "duration": 6.569}, {"text": "automatic citizenship.", "start": 203.799, "duration": 1.95}, {"text": "That's it. That's the storyline. That's the\nexplanation and if these people, if people", "start": 205.749, "duration": 4.92}, {"text": "reacted to these things correctly, the military\nwould turn on Trump and not vote for him in", "start": 210.669, "duration": 6.25}, {"text": "2020 the farmers would already have turned\non Trump and would not be voting for him in", "start": 216.919, "duration": 5.6}, {"text": "20 as we've been covering and in the background,\nyou only need to look at who's running the", "start": 222.519, "duration": 5.091}, {"text": "u s cis. It's Ken Cuccinelli. Ken Cuccinelli\nis an extremist idealog Republican who has", "start": 227.61, "duration": 7.709}, {"text": "previously said he would like to ban oral\nsex. He's a horrible person. He's the acting", "start": 235.319, "duration": 5.5}, {"text": "director of USC. Of course, there is no permanent\ndirector as is the trend, the status quo under", "start": 240.819, "duration": 4.73}, {"text": "Donald Trump, but Ken Cuccinelli is the acting\ndirector and the reality of this is that this", "start": 245.549, "duration": 4.962}, {"text": "is a test to see, can Trump take a baby step\ncloser to repealing birthright citizenship", "start": 250.511, "duration": 6.378}, {"text": "altogether? Can he get this through and make\nbirthright citizenship in total?", "start": 256.889, "duration": 6.221}, {"text": "The next thing that he wants to repeal, we\nshould not be confused about the real objectives", "start": 263.11, "duration": 4.76}, {"text": "here. They are terrible. They are the lowest\nof the low. And the question is, will Donald", "start": 267.87, "duration": 4.94}, {"text": "Trump be given another four years with which\nto try to do more of this stuff? Let me know", "start": 272.81, "duration": 5.13}, {"text": "what you think about this. Let me know what\nyou think about, uh, the prospects of Trump", "start": 277.94, "duration": 3.969}, {"text": "re-election. Uh, as of now on Twitter at d\npacman. The show is also on Twitter at David", "start": 281.909, "duration": 6.22}, {"text": "Pakman show. Follow us both and make sure\nthat you are watching the live stuff,", "start": 288.129, "duration": 4.021}, {"text": "dreams that I'm doing on twitch or twitch.tv/gabe", "start": 292.15, "duration": 17.43}, {"text": "and Pacman, the David Pakman", "start": 309.58, "duration": 66.899}, {"text": "show@davidpacmandotcomthedavidpakmanshowatdavidpacman.com.", "start": 376.479, "duration": 0.77}]