[{"text": "The MBX MKII is a PC case that, by all accounts, has no right to exist.", "start": 5.259, "duration": 5.33}, {"text": "It was 7 years in the making, weighs a shocking 100 pounds fully-loaded and", "start": 11.1, "duration": 5.12}, {"text": "everything about it was purpose-built from the 8mm thick aluminum motherboard tray to the", "start": 16.22, "duration": 6.64}, {"text": "274 screws required for its assembly.", "start": 23.08, "duration": 3.72}, {"text": "It's the brainchild of Charles Harwood, the creator of Murderbox and fellow BC boy, and integrates more PC industry firsts than I can keep track of", "start": 27.3, "duration": 8.74}, {"text": "including defused basement lighting,", "start": 36.42, "duration": 2.0}, {"text": "integrated comprehensive cable management,", "start": 38.92, "duration": 2.0}, {"text": "frameless cooling fans and an utterly unique visual design, that doesn't scream performance so much as it whispers it.", "start": 41.4, "duration": 6.76}, {"text": "It's built to be the case that you use for the next 10 years, and it's", "start": 48.24, "duration": 3.84}, {"text": "manufactured to the highest standard, but it comes with a price tag that reflects its pedigree.", "start": 52.18, "duration": 5.719}, {"text": "Let's get up close and personal with it.", "start": 58.449, "duration": 2.72}, {"text": "AD: Roseville's closed-loop CPU coolers feature a performance copper base,", "start": 66.12, "duration": 3.96}, {"text": "PWM fan speed control and more for an affordable price.\nCheck them out today at the link below.", "start": 70.2, "duration": 4.64}, {"text": "It was 10 years ago, but I remember the day I met this guy like it was yesterday.", "start": 75.3, "duration": 4.72}, {"text": "He drove 2 hours", "start": 80.28, "duration": 2.06}, {"text": "to pick up some $10 water cooling fittings from me because a customer", "start": 82.64, "duration": 4.56}, {"text": "commissioned one of his already famous murder box gaming machines and", "start": 87.52, "duration": 5.08}, {"text": "No other fitting was good enough for him.", "start": 92.8, "duration": 2.84}, {"text": "It was this rejection of good enough that drove Charles to do things the rest of us thought were crazy.", "start": 95.88, "duration": 5.4}, {"text": "I still remember him explaining to me that \"wires shouldn't be hidden, they should just be beautiful\"", "start": 101.46, "duration": 5.9}, {"text": "when he unveiled the first individually sleeved power supply. \"No one is gonna spend that kind of time and money on a power supply\" I said,", "start": 107.48, "duration": 7.42}, {"text": "but I think we all know how that played out.", "start": 115.18, "duration": 2.78}, {"text": "Every one of his creations was like that, a work of art utterly unique and always pushing the limits, whether it was", "start": 120.3, "duration": 6.38}, {"text": "tubing layouts, lighting or design with zero compromises on build quality.", "start": 127.02, "duration": 5.16}, {"text": "Unfortunately, Charles had a problem. \nBuilding a single murder box, an $8,000 to $18,000 machine,", "start": 133.02, "duration": 8.16}, {"text": "often including in person delivery,", "start": 141.66, "duration": 1.8}, {"text": "is a 2-4 week endeavor.", "start": 143.7, "duration": 1.94}, {"text": "And that's assuming that nothing goes wrong with sourcing and building whatever cutting-edge new design or material he working on.", "start": 145.7, "duration": 7.08}, {"text": "He'd never get the parts production economical like that. The business model had to shift.", "start": 153.7, "duration": 4.52}, {"text": "That's where murder mod came in.", "start": 158.64, "duration": 2.46}, {"text": "Charles partnered with Niels, a pioneer in the sleeving space, to create a lineup of aftermarket", "start": 161.56, "duration": 5.66}, {"text": "faceplates, mid plates, mounts and other accessories that would allow", "start": 167.22, "duration": 4.52}, {"text": "TJ07 owners to upgrade their existing systems to something worthy of the million dollar PC galleries.", "start": 171.86, "duration": 6.94}, {"text": "These two business models complemented each other well", "start": 178.98, "duration": 2.96}, {"text": "On paper...", "start": 182.56, "duration": 0.8}, {"text": "the higher margins and sales volumes of accessories would help to absorb the cost of", "start": 183.36, "duration": 5.52}, {"text": "prototyping and development, while the boutique system business would give murder mod a high-profile avenue for showing off its latest creations,", "start": 188.88, "duration": 8.18}, {"text": "Except for another small problem", "start": 197.58, "duration": 2.0}, {"text": "Accessories are only high-volume if they're compatible with more than a single high-end case from niche manufacturer", "start": 200.04, "duration": 6.34}, {"text": "Silverstone, and they're only high margin if you have the upfront funding and the know how to navigate the quagmire of", "start": 206.4, "duration": 6.42}, {"text": "overseas mass production.", "start": 212.82, "duration": 1.78}, {"text": "so he forged a relationship with", "start": 214.6, "duration": 2.02}, {"text": "Silverstone with the plan of bringing a tweaked and pre modded TJO7 to market and then iterating from there", "start": 216.7, "duration": 7.64}, {"text": "another great in theory idea that turned into an endless cycle of prototyping and refinement until", "start": 224.92, "duration": 7.4}, {"text": "Finally four years later. Thanks to a cash bailout from a community member named Richard", "start": 232.58, "duration": 5.46}, {"text": "It was ready to ship to the early backers", "start": 238.09, "duration": 2.9}, {"text": "Every component of the Mark II has a story", "start": 242.02, "duration": 2.779}, {"text": "literally every one", "start": 245.5, "duration": 1.64}, {"text": "but i won't bore you guys talking about the 50,000 unit minimum order quantity on each", "start": 247.72, "duration": 4.88}, {"text": "individual variation of the custom made hex screws", "start": 252.68, "duration": 3.58}, {"text": "Let's start with the luminous panel, ten years ago PC lighting was done with cheesy", "start": 256.42, "duration": 5.3}, {"text": "Plastic cathode tubes with cheap inverters that usually burned out quite, literally burned out, in a year or two", "start": 261.76, "duration": 6.94}, {"text": "There had to be a better way, and the inspiration came from runway fashion shows", "start": 269.08, "duration": 5.149}, {"text": "Now building a panel that looks like this is easy", "start": 274.78, "duration": 3.889}, {"text": "If you have a bunch of space behind it for light distribution and diffusion", "start": 279.07, "duration": 4.549}, {"text": "But Charles had to do it without taking up any of the space for radiators on the bottom, or for the system itself on top", "start": 283.99, "duration": 7.07}, {"text": "so he ended up with LEDs on one side firing into what he calls the core", "start": 291.58, "duration": 5.449}, {"text": "a proprietary material that he modified and etched with a grid to project the light upward", "start": 297.79, "duration": 5.869}, {"text": "the remaining three edges were lined with reflective material to bounce back and", "start": 304.2, "duration": 4.98}, {"text": "recycle the light that would normally pass right through and be wasted", "start": 309.22, "duration": 3.8}, {"text": "a final piece of semi translucent", "start": 313.74, "duration": 1.88}, {"text": "Material was added on top to diffuse the light giving the finished luminance panel a glow strong enough to be seen in daylight", "start": 315.62, "duration": 6.9}, {"text": "But subtle enough to game next to at night, and  at a thickness of just 15mm", "start": 322.69, "duration": 5.66}, {"text": "The blood drips in the front have an equally fascinating backstory", "start": 329.28, "duration": 3.979}, {"text": "The first iteration, was a murder mod faceplate a very rudimentary solution to the TJO 7's", "start": 333.72, "duration": 6.739}, {"text": "Dated, even then, septuple five and a quarter inch Bay design optical drives were already on their way out", "start": 340.919, "duration": 6.26}, {"text": "It was water cut and used an LED strip mounted inside a Hammond project box reflecting off a piece of white acrylic", "start": 347.46, "duration": 6.949}, {"text": "simple", "start": 355.319, "duration": 1.021}, {"text": "but in the mark two the entire basement where the TJO 7 mount storage drives by default", "start": 356.34, "duration": 6.22}, {"text": "is taken up by up to six by one, 20 millimeters worth of radiators and the power supply", "start": 362.78, "duration": 6.28}, {"text": "and the front is a modular space that can be adapted for three and a half inch storage, water cooling controllers,", "start": 369.64, "duration": 6.54}, {"text": "Pumps two, a half inch storage, a slim optical drive", "start": 376.38, "duration": 3.349}, {"text": "You pretty much name it so there's potentially a lot of stuff that has to go in there", "start": 379.919, "duration": 5.0}, {"text": "He needed something more compact", "start": 385.68, "duration": 2.0}, {"text": "So Charles created a lighting solution using only a single", "start": 387.69, "duration": 3.229}, {"text": "LED firing upward through an acrylic block with silver. Mylar edges, like the luminance panel", "start": 391.259, "duration": 5.839}, {"text": "But this time using a piece of adhesive vinyl at the back that's printed with a gradient", "start": 397.099, "duration": 5.13}, {"text": "Graphic on it to control light reflection toward the front and a strip of a photographic", "start": 402.42, "duration": 4.86}, {"text": "Material called dura trans to diffuse the light coming out", "start": 407.36, "duration": 3.5}, {"text": "this combination ensures that the drips fade to black effect will be perfect and seamless even in complete darkness", "start": 411.14, "duration": 7.52}, {"text": "a characteristic that not only looks sick", "start": 419.24, "duration": 1.66}, {"text": "But also helps hide the optional stealth slot load optical drive that you didn't see that one coming", "start": 420.9, "duration": 5.839}, {"text": "the top grille was also designed as a TJO 7 nod that you could just..", "start": 427.11, "duration": 4.85}, {"text": "Drop into the existing flange and was inspired by ceiling fans", "start": 432.24, "duration": 4.429}, {"text": "Why do we need frames in a position where we don't need to create static pressure?", "start": 437.099, "duration": 4.67}, {"text": "To build this Charles bought almost literally", "start": 442.319, "duration": 3.35}, {"text": "Every cooling fan on the market to find the ideal one", "start": 446.13, "duration": 3.679}, {"text": "He needed a clean aesthetic, the right hub size,", "start": 449.96, "duration": 3.2}, {"text": "Easily removable fan blades in case painting was required to match the look of a particular build", "start": 453.36, "duration": 5.7}, {"text": "and quiet operation out of the box without fan control because there would be no room", "start": 459.62, "duration": 5.64}, {"text": "for PWM wires in the tiny 2 by 4 millimetre wire management channel", "start": 465.54, "duration": 5.36}, {"text": "every unit was shipped to kallen in Australia", "start": 471.7, "duration": 2.64}, {"text": "where he painstakingly hand assembled them.", "start": 474.66, "duration": 2.04}, {"text": "this process involves removing the fan frames, removing the existing wiring from the fan hub,", "start": 477.14, "duration": 5.22}, {"text": "soldering the new leads specially designed for the top mount, epoxying in the hubs, running the wiring around the internally machined frame", "start": 482.74, "duration": 7.79}, {"text": "and terminating to a single sleeved 3 pin connector that will work with basically any motherboard", "start": 490.99, "duration": 5.09}, {"text": "One of a kind looks and drop in compatibility like this are really really tough things to combine", "start": 496.57, "duration": 6.139}, {"text": "Which I guess brings us finally to my ulterior motive for making this video. So this video isn't sponsored", "start": 502.86, "duration": 6.9}, {"text": "I mean after all the money he's lost on this Charles couldn't afford our rates and I wouldn't ask him anyway", "start": 510.58, "duration": 4.22}, {"text": "But there is something in it for me. I want to see what he'll create next", "start": 515.16, "duration": 5.12}, {"text": "so I offered to do a profile of the mark ii and its history in hopes that they'll all sell so he can repay his", "start": 520.58, "duration": 6.4}, {"text": "investors and work on something new", "start": 526.98, "duration": 2.36}, {"text": "there are 142 mark ii cases left in the world", "start": 529.5, "duration": 3.58}, {"text": "You'll find the where to buy link in the video description", "start": 533.08, "duration": 2.68}, {"text": "the config that we showed would run a whopping 2,000 US dollars", "start": 536.08, "duration": 3.52}, {"text": "But, for this video Charles and mod 1 created a more basic", "start": 540.34, "duration": 4.579}, {"text": "Limited time promotional bundle including everything that you need to get started", "start": 545.4, "duration": 3.68}, {"text": "the case, its 150 page user manual and a quad radiator mount as well as the optional luminance panel for $12.99", "start": 549.4, "duration": 9.36}, {"text": "It's still eye wateringly expensive but there will never be another production run of the mark ii, it was a financial disaster", "start": 559.24, "duration": 6.96}, {"text": "for everyone involved", "start": 566.26, "duration": 1.53}, {"text": "So if you want to own a piece of PC history the case equivalent of something like a DeLorean", "start": 568.18, "duration": 5.08}, {"text": "Something only a fanatical person would build well, you know where to get it", "start": 573.66, "duration": 4.229}, {"text": "Blue apron delivers all the farm-fresh ingredients that you need right to your doorstep in exactly the right proportions for delicious", "start": 578.71, "duration": 7.549}, {"text": "home-cooked meals no trips to the grocery store", "start": 586.54, "duration": 3.11}, {"text": "No waste from unused", "start": 589.72, "duration": 1.77}, {"text": "Ingredients their recipes are chef-inspired and they offer two types of plans the two-person plan and the family plan and there are now eight", "start": 591.49, "duration": 7.549}, {"text": "Recipes to choose from each week instead of six, blue apron recipes are delivered in a refrigerated box", "start": 599.29, "duration": 6.32}, {"text": "So the ingredients will stay fresh", "start": 605.61, "duration": 1.35}, {"text": "Even if you're not at home when your package arrives and blue apron ships to most of the United States", "start": 606.96, "duration": 5.219}, {"text": "There's no commitment", "start": 612.34, "duration": 1.31}, {"text": "you can skip or cancel the service at any time and prices start as low as", "start": 613.65, "duration": 3.479}, {"text": "$9 per serving the first", "start": 617.56, "duration": 1.92}, {"text": "50 people to sign up at our link below are gonna get 50 bucks off their first two weeks of blue apron so go check", "start": 619.48, "duration": 6.29}, {"text": "It out now", "start": 625.77, "duration": 1.63}, {"text": "So thanks for watching guys. If you just liked this video you can hit that button", "start": 627.4, "duration": 3.529}, {"text": "But if you liked it, let us know in the comments hit that like button", "start": 630.93, "duration": 2.94}, {"text": "Maybe get subscribed and while you're at it check out the link to where to buy the stuff", "start": 633.87, "duration": 3.809}, {"text": "We featured in the video description while you're down there", "start": 637.68, "duration": 3.09}, {"text": "We'll have a list of everyone who contributed parts for Charles to do the showcase build including silverstone", "start": 640.77, "duration": 4.979}, {"text": "EK mod 1 gigabyte nvidia and aqua computer as well as a link to our merch store which has cool shirts like this one", "start": 646.12, "duration": 7.28}, {"text": "I", "start": 654.51, "duration": 0.91}, {"text": "Forgot to call it the forum", "start": 655.42, "duration": 2.0}, {"text": "for", "start": 657.61, "duration": 2.0}, {"text": "Forum", "start": 660.37, "duration": 2.0}]