[{"text": "This video was sponsored by The Great Courses Plus.", "start": 1.0, "duration": 3.38}, {"text": "It's May of the year 326 BC.", "start": 7.12, "duration": 2.94}, {"text": "The unbeaten Macedonian army invades the Punjab region of the Indian subcontinent.", "start": 10.26, "duration": 4.5}, {"text": "Despite the pouring rain, the insatiable Alexander, King of Macedon, Asia and Persia", "start": 15.28, "duration": 4.76}, {"text": "stands on the western bank of the Hydaspes river,", "start": 20.26, "duration": 3.14}, {"text": "considering how to overcome the next daunting challenge waiting for him on the other side of the river.", "start": 23.68, "duration": 5.38}, {"text": "His last great battle, against a formidable Indian King and his vast army is just about to happen.", "start": 29.34, "duration": 6.06}, {"text": "It's spring of the year 330 BC.", "start": 55.06, "duration": 3.32}, {"text": "With the troublesome crossing of the Zagros Mountains behind, the Macedonian army reaches its final destination – the city of Persepolis.", "start": 58.58, "duration": 7.72}, {"text": "Alexander quickly discovered, that a good part of the royal treasury had been moved to Ecbatana in Media,", "start": 66.52, "duration": 5.46}, {"text": "where defeated king Darius struggled to form yet another army.", "start": 72.16, "duration": 3.28}, {"text": "The Macedonian king had taken the majority of the most important Achaemenid cities", "start": 75.76, "duration": 4.38}, {"text": "and decided to celebrate the Persian New Year in the just captured capital.", "start": 80.46, "duration": 4.02}, {"text": "He requested local aristocracy to pledge allegiance to his rule,", "start": 84.7, "duration": 3.58}, {"text": "but only a few nobles together with freshly appointed satraps attended the festivities.", "start": 88.5, "duration": 5.32}, {"text": "It became obvious, that despite naming himself King of Asia, Alexander's claim to the Persian throne needed to be beyond reproach.", "start": 94.02, "duration": 7.88}, {"text": "The only way to do that, was by killing Darius, who still formally remained, King of Persia.", "start": 102.24, "duration": 5.68}, {"text": "Prior to his departure for Ecbatana, Alexander burned and looted Persepolis,", "start": 108.2, "duration": 4.66}, {"text": "wanting to avenge the Persian capture of Athens 150 years earlier.", "start": 113.22, "duration": 5.0}, {"text": "The pursuit had begun. The Macedonians arrived at Ecbatana in June, only to learn that Darius was no longer there.", "start": 118.54, "duration": 7.24}, {"text": "The Persian King was well informed regarding his enemy’s movement and left the city some days earlier,", "start": 126.2, "duration": 5.2}, {"text": "marching north-east with his treasuries and followers,", "start": 131.64, "duration": 2.48}, {"text": "hoping to reach the yet unconquered easternmost part of the empire.", "start": 134.4, "duration": 3.88}, {"text": "Still, there were subjects willing to obey royal authority,", "start": 138.52, "duration": 3.16}, {"text": "but upon learning of the Macedonian chase, Darius' ranks began to thin out due to desertions.", "start": 141.88, "duration": 5.9}, {"text": "Eventually he was arrested by his courtiers lead by Bessus, satrap of Bactria,", "start": 148.16, "duration": 5.2}, {"text": "who hoped that handing the Persian king over to the Macedonians would avert the conquest of their eastern provinces.", "start": 153.54, "duration": 6.7}, {"text": "Yet Alexander turned down the disloyal satraps’ offer.", "start": 160.52, "duration": 3.08}, {"text": "It was probably a better choice regarding his claim to the Persian throne, as Bessus then killed Darius.", "start": 163.74, "duration": 5.64}, {"text": "While Darius was buried in Persepolis with all due honors, Bessus crowned himself as the new Persian King under the name Artaxerxes.", "start": 169.7, "duration": 9.18}, {"text": "He expected the Macedonians to finally return to Europe, just like other reasonable invaders would do,", "start": 179.2, "duration": 5.42}, {"text": "but it wasn't the case for Alexander.", "start": 184.92, "duration": 1.78}, {"text": "Another extraordinary campaign began and in the matter of one year Alexander crossed and subjugated the vast plains of Central Asia.", "start": 186.92, "duration": 8.04}, {"text": "Around that time, the first serious fractures started to appear in the Macedonian war machine.", "start": 195.76, "duration": 5.66}, {"text": "After the conquest of Persepolis and death of Darius, many regular soldiers expected Alexander to return home,", "start": 201.64, "duration": 7.14}, {"text": "as five long years had passed since they crossed the Hellespont to fight the Persians.", "start": 209.04, "duration": 5.02}, {"text": "Moreover, it looked like their beloved King had changed.", "start": 214.3, "duration": 3.82}, {"text": "He often demanded godlike treatment, took over many of the Persian customs and surrounded himself with Persian advisors.", "start": 218.4, "duration": 8.26}, {"text": "He also became gradually more suspicious.", "start": 227.3, "duration": 2.62}, {"text": "When a plot against his life was discovered,", "start": 230.16, "duration": 2.14}, {"text": "he put one of his commanders Philotas on trial and had him killed, despite the lack of sufficient evidence.", "start": 232.5, "duration": 7.3}, {"text": "It was a troublesome deed, as Philotas was the firstborn son of Parmenion,", "start": 240.16, "duration": 4.7}, {"text": "Alexander's trusted general and second-in-command.", "start": 244.98, "duration": 3.82}, {"text": "The execution of the son meant that the father must die too.", "start": 249.22, "duration": 3.36}, {"text": "Alexander hastily sent couriers back west with clear orders.", "start": 252.8, "duration": 4.46}, {"text": "Death met the old general in Ecbatana, where he guarded the royal treasury and supervised reinforcements.", "start": 257.62, "duration": 6.96}, {"text": "Parmenion remained loyal to the last.", "start": 264.9, "duration": 2.82}, {"text": "In the meantime, Alexander's troops were about to cross the Hindu Kush range,", "start": 268.44, "duration": 4.58}, {"text": "one of the last obstacles on their way to attack Bessus' domain.", "start": 273.36, "duration": 3.5}, {"text": "It was late winter, and Bessus didn't believe that Alexander would risk marching through the snowy mountain passes,", "start": 277.26, "duration": 6.02}, {"text": "yet it soon became clear that he once again underestimated the Macedonian King.", "start": 283.48, "duration": 4.52}, {"text": "Alexander managed to cross the mountains unopposed with minor losses to manpower, and completely surprised Bessus.", "start": 288.46, "duration": 6.66}, {"text": "Soon, the Macedonians acquired Bactria, forcing the usurper to flee north of the river Oxus.", "start": 295.58, "duration": 5.98}, {"text": "But nothing could stop Alexander.", "start": 301.9, "duration": 1.78}, {"text": "Despite Persian efforts to disrupt his progress, he marched through the desert,", "start": 303.92, "duration": 4.38}, {"text": "crossed the river and directly confronted Bessus’ force.", "start": 308.38, "duration": 3.42}, {"text": "Finally, the usurper was imprisoned by his own men fearing the rage of the Macedonian King and was handed over to Alexander.", "start": 312.12, "duration": 8.04}, {"text": "He was then tortured and crucified. Now, Alexander could crown himself as the unopposed king of Persia.", "start": 320.56, "duration": 7.8}, {"text": "He spent over a year quelling the unrests in his newly conquered lands.", "start": 329.44, "duration": 4.3}, {"text": "To calm the tribes inhabiting the eastern satrapies, Alexander married Bactrian princess, Roxana.", "start": 333.86, "duration": 6.66}, {"text": "With the northeast border secured, he turned his eyes on to populous and fertile lands of the Indian subcontinent.", "start": 341.04, "duration": 7.66}, {"text": "Probably the primary motivation for the new Indian campaign was Alexander's impertinence and uncontrollable desire for conquest,", "start": 349.18, "duration": 8.5}, {"text": "as the possible gains were dubious and the risk of failure was significant.", "start": 357.82, "duration": 4.68}, {"text": "Regardless, the Macedonian armies entered Punjab in late 327 BC, and soon reached the lands inhabited by the Taxile people.", "start": 363.34, "duration": 9.5}, {"text": "Alexander was greeted by their king and soon expected all neighbouring states to pledge allegiance to the new Macedonian overlord.", "start": 373.14, "duration": 7.92}, {"text": "Indeed, many local rulers bent the knee to the exotic invaders.", "start": 381.4, "duration": 4.36}, {"text": "But there was one chieftain on the other side of the Hydaspes river, who refused to surrender.", "start": 386.02, "duration": 5.88}, {"text": "King Porus of the Pauravians was a noble and courageous leader with a significant army and solid border in the form of a wide river.", "start": 392.26, "duration": 9.9}, {"text": "Of course, his refusal was totally unacceptable to Alexander, and soon the Macedonian troops reached the western bank of the Hydaspes.", "start": 402.76, "duration": 8.24}, {"text": "King Porus was already there, guarding the possible crossing. It was May, and he could easily stall for time.", "start": 411.22, "duration": 6.58}, {"text": "Melting snow in the Himalayas together with upcoming monsoon rains could render the river almost impassable for many months.", "start": 418.06, "duration": 7.14}, {"text": "Alexander knew this too, and tried to act as quickly as possible.", "start": 425.74, "duration": 3.68}, {"text": "Closer examination of the river convinced him,", "start": 429.66, "duration": 2.56}, {"text": "that a direct crossing with the enemy guarding the other side was an easy way to lose his army.", "start": 432.32, "duration": 5.58}, {"text": "Another solution had to be found. Porus' troops patiently shadowed the Macedonian movements, who sought an opportunity to cross the river.", "start": 438.28, "duration": 8.34}, {"text": "In fact, this was just a feint to let the Indian guard down.", "start": 447.08, "duration": 4.06}, {"text": "Upon finding a suitable ford 30 kilometres upstream,", "start": 451.32, "duration": 3.28}, {"text": "he gathered his best units and during the stormy night transported them across the river.", "start": 454.84, "duration": 4.76}, {"text": "Porus couldn't believe the rumours about the Macedonian crossing,", "start": 460.34, "duration": 3.34}, {"text": "and sent a 2,000 strong mounted detachment under his son to investigate.", "start": 463.76, "duration": 5.22}, {"text": "Young Porus encountered Alexander completing the crossing, and decided to repel them immediately.", "start": 469.24, "duration": 5.28}, {"text": "Yet his brave charge was easily stopped by the Greeks, who after a short skirmish routed the Indian patrol.", "start": 474.92, "duration": 6.2}, {"text": "The young prince didn't survive the fight.", "start": 481.36, "duration": 3.18}, {"text": "Though he failed to stop the crossing, Porus at least learned that the enemy was now on the same side of the river,", "start": 485.08, "duration": 5.96}, {"text": "and began deploying his troops.", "start": 491.18, "duration": 2.14}, {"text": "The Macedonian army was considerably larger, yet the majority of the troops were still on the west bank of Hydaspes,", "start": 493.5, "duration": 6.46}, {"text": "thus Alexander's detachments which crossed the river were heavily outnumbered by the Indian army.", "start": 500.06, "duration": 5.52}, {"text": "Though their numerical advantage was partially diminished by the superior Macedonian training, discipline and experience.", "start": 505.86, "duration": 7.06}, {"text": "Yet the Indians employed more than 100 formidable war elephants,", "start": 513.28, "duration": 4.54}, {"text": "which posed a serious threat to the Macedonian units,", "start": 517.98, "duration": 2.84}, {"text": "as it was the first time they had to face such an extraordinary enemy on the battlefield.", "start": 520.94, "duration": 5.22}, {"text": "The battle started with the attack of Scythian hired horse archers, who tried to harass the elephants.", "start": 526.72, "duration": 6.36}, {"text": "Shortly, Companion cavalry lead by Alexander struck the Indian left flank.", "start": 533.2, "duration": 5.54}, {"text": "He tried to avoid the enemy's elephants, as Macedonian horses were not trained to fight such a threat.", "start": 539.14, "duration": 6.36}, {"text": "They feared these big animals and often refused to cooperate.", "start": 545.62, "duration": 3.62}, {"text": "The sarissa phalanx reached the Indian line in the centre and engaged the elephant units.", "start": 549.7, "duration": 5.52}, {"text": "Although their sarissa spears were lengthened in order to fight elephants prior to the battle, they still had a tough time engaging them.", "start": 555.44, "duration": 7.46}, {"text": "War elephant units even managed to temporarily penetrate the Macedonian line here and there.", "start": 563.1, "duration": 5.76}, {"text": "King Porus saw that his left flank was clearly losing,", "start": 569.16, "duration": 3.78}, {"text": "so he sent chariots and cavalry from the right to aid the collapsing left.", "start": 573.14, "duration": 4.28}, {"text": "This was a clear signal for Coenus, commander of the remaining cavalry units.", "start": 577.64, "duration": 4.92}, {"text": "He quickly moved his mounted troops and rushed through the Indian right flank,", "start": 582.84, "duration": 4.74}, {"text": "encircled them and attacked the left flank from the rear.", "start": 587.58, "duration": 3.9}, {"text": "Some of the elephant drivers in the centre were killed, and the panicked animals fled, trampling their own infantry.", "start": 591.8, "duration": 7.3}, {"text": "Seeing that the enemy was slowly gaining an upper hand in the centre and especially on the left flank,", "start": 599.36, "duration": 5.58}, {"text": "a couple of infantry units started to waver and flee the battlefield.", "start": 605.26, "duration": 3.9}, {"text": "But they quickly realized, that leftover Macedonian troops under Craterus had crossed the river and attacked the running Indians.", "start": 609.44, "duration": 8.5}, {"text": "Just after slaughtering the fleeing units, Craterus moved forward and engaged the Indian rear.", "start": 618.18, "duration": 5.78}, {"text": "King Porus, still fighting on his elephant, was aware that he had lost the battle, yet refused to surrender.", "start": 624.3, "duration": 7.38}, {"text": "Finally, he was captured, and the remaining part of his army avoided slaughter.", "start": 632.02, "duration": 5.42}, {"text": "The casualties on the Indian side were significant, almost their entire cavalry and a good part of their infantry was killed,", "start": 638.34, "duration": 7.18}, {"text": "while the Macedonians lost around 1,000 soldiers, mostly in the centre.", "start": 645.7, "duration": 4.76}, {"text": "King Porus, who was a humongous warrior over 7 feet tall, was asked by Alexander how he wished to be treated.", "start": 650.76, "duration": 6.88}, {"text": "He replied: „Treat me like a king would treat another king”.", "start": 657.64, "duration": 4.52}, {"text": "Alexander was impressed by Porus' attitude and appointed him as the new satrap of Punjab.", "start": 662.5, "duration": 5.74}, {"text": "Although the Battle of Hydaspes River was the last major battle of the Macedonian king", "start": 668.78, "duration": 4.44}, {"text": "fought against a capable opponent, his story is yet to be concluded.", "start": 673.6, "duration": 5.18}, {"text": "If you don't want to wait until the next episode goes online, there's a neat way to learn more about Alexander and the empire he created.", "start": 679.4, "duration": 7.14}, {"text": "Our sponsor today – The Great Courses Plus provides an insightful 18 hour long series", "start": 686.86, "duration": 5.36}, {"text": "of lectures covering Alexander's achievements titled Alexander the Great and the Macedonian Empire, taught by Professor Kenneth Harl.", "start": 692.28, "duration": 7.4}, {"text": "If that's not enough, there's another interesting collection of lectures about decisive battles throughout history worth checking out.", "start": 700.08, "duration": 5.68}, {"text": "The Great Courses Plus is a subscription on-demand video learning service with top-notch lectures on history and various other topics,", "start": 705.98, "duration": 7.5}, {"text": "lectured by leading professors and experts from the world's best universities and research centers.", "start": 713.56, "duration": 5.88}, {"text": "If you want to support our channel and get one-month’s free trial, visit thegreatcoursesplus.com/bazbattles or simply click the first link in the description.", "start": 719.66, "duration": 11.26}]