[{"text": "This video was made possible by SquareSpace", "start": 0.0, "duration": 2.52}, {"text": "start building your website for free", "start": 2.52, "duration": 1.34}, {"text": "at squarespace.com/RLL", "start": 4.04, "duration": 1.98}, {"text": "and then when you ready to launch", "start": 6.02, "duration": 2.0}, {"text": "use the code 'RLL' to get 10% off and check out.", "start": 8.02, "duration": 2.8}, {"text": "The Russian Empire was one of the largest empire to have ever existed in history", "start": 10.94, "duration": 4.22}, {"text": "It began with Peter the Great in 1721 and came crashing down with Nicholas II in 1917.", "start": 15.28, "duration": 6.82}, {"text": "Nicholas II advocated the throne and was executed the following year along with his entire family by the Bolsheviks.", "start": 22.1, "duration": 6.54}, {"text": "And ever since there have a literally hundreds of peoples who have claimed to be his rightful heir to the empty and increasingly irrelevant Russian throne.", "start": 28.86, "duration": 8.86}, {"text": "100 years now after his death and the questions still remains incredibly open to interpretations", "start": 37.72, "duration": 6.38}, {"text": "But, there is one man who just seem to be a bit more serious than just about anybody else.", "start": 44.64, "duration": 5.76}, {"text": "This guy, Anton Bakov, a multimillionaire Russian businessman who found his fortune by starting one of the first privately owned businesses in Russia", "start": 50.64, "duration": 8.84}, {"text": "as the Soviet Union was collapsing.", "start": 59.5, "duration": 2.04}, {"text": "And to say that he's eccentric is, well, a bit of an understatement.", "start": 61.54, "duration": 4.6}, {"text": "As a devoted monarchist, Bakov started the only legal monarchist party in Russia", "start": 66.14, "duration": 4.94}, {"text": "since the 1917 revolution, and has been working ever since to try and restore", "start": 71.08, "duration": 4.92}, {"text": "the Romanov Monarchy back to the country.", "start": 76.0, "duration": 2.52}, {"text": "But, he's had a bit of a problem.", "start": 78.52, "duration": 2.48}, {"text": "Nobody in Russia really wants to, or cares to see a return of the", "start": 81.0, "duration": 4.04}]