[{"text": "*closed captions by authors linked in the description*", "start": 0.0, "duration": 0.74}, {"text": "This is the motherboard for the Super Nintendo: a 16-bit video game console", "start": 1.36, "duration": 4.32}, {"text": "that came out in 1991 in America.", "start": 5.68, "duration": 2.46}, {"text": "And these are the sound chips that worked in tandem to create all the audio sound effects and music", "start": 8.26, "duration": 5.42}, {"text": "that you heard in Super Nintendo games", "start": 13.68, "duration": 2.36}, {"text": "The first chip, the SMP, or the SPC 700, was a", "start": 22.86, "duration": 3.36}, {"text": "processing core, where a video game musician could essentially", "start": 26.22, "duration": 3.2}, {"text": "write the program that would tell the other chip, the DSP:", "start": 29.42, "duration": 3.66}, {"text": "what sounds to make.", "start": 33.08, "duration": 1.18}, {"text": "Whereas the original NES sound chip had just 5 channels,", "start": 34.26, "duration": 3.36}, {"text": "and could really only do creative variations on the same basic sound,", "start": 37.62, "duration": 4.2}, {"text": "The Super Nintendo had eight dedicated channels,", "start": 41.82, "duration": 2.7}, {"text": "and used a sampling system", "start": 44.52, "duration": 1.649}, {"text": "which meant that artists could load in noises or sound effects from instruments of their choosing.", "start": 46.169, "duration": 4.891}, {"text": "With room for 8 simultaneous instruments", "start": 54.66, "duration": 1.9}, {"text": "and the ability to sample different sounds, the Super Nintendo", "start": 56.56, "duration": 2.72}, {"text": "was a big improvement over its predecessor.", "start": 59.28, "duration": 2.28}, {"text": "But there was still one huge limitation. Between the two chips, the system could only accommodate for", "start": 61.74, "duration": 4.58}, {"text": "64 kilobytes of audio RAM.", "start": 66.32, "duration": 2.68}, {"text": "To give you a sense of how small that is,", "start": 69.2, "duration": 1.76}, {"text": "an average 3 minute mp3 song that you might buy on iTunes", "start": 70.96, "duration": 3.64}, {"text": "is around 6 megabytes,", "start": 74.6, "duration": 2.04}, {"text": "which is a hundred times the size of the Super Nintendo's full capacity,", "start": 76.64, "duration": 4.32}, {"text": "and that's just for one song :(", "start": 80.96, "duration": 1.64}, {"text": "The 64 kilobytes had to hold all the music and the sound effects for an entire game.", "start": 82.6, "duration": 5.54}, {"text": "Which is why you often got music that sounded... well, not that great.", "start": 91.42, "duration": 4.6}, {"text": "When you think of sampling in popular music, you might think of someone taking", "start": 96.32, "duration": 3.52}, {"text": "a few seconds of an old drum beat, and using it in a new song.", "start": 99.84, "duration": 3.66}, {"text": "But a sample that's even a few seconds long carries a whole lot of information.", "start": 106.56, "duration": 4.42}, {"text": "In order to stay within the allotted 64k, Super Nintendo music samples had to be *tiny*,", "start": 110.98, "duration": 5.56}, {"text": "often all the way down to a single cycle of a waveform.", "start": 116.72, "duration": 3.06}, {"text": "In order to make good music with these limitations,", "start": 119.94, "duration": 2.44}, {"text": "you had to be creative.", "start": 122.38, "duration": 1.84}, {"text": "What you're hearing now is Aquatic Ambience from 1994's Donkey Kong Country:", "start": 131.2, "duration": 5.14}, {"text": "a classic by one of video games' best composers, David Wise.", "start": 136.34, "duration": 3.9}, {"text": "Wise was able to ring beautiful music from the limitations of the Super Nintendo sound chips.", "start": 140.58, "duration": 4.76}, {"text": "For example, the evolving, swimming background pads that you're hearing in this song.", "start": 145.52, "duration": 4.02}, {"text": "Sweeps like this just weren't possible on the Super Nintendo,", "start": 149.7, "duration": 3.14}, {"text": "and sampling something this long and complex would have quickly exceeded the capacity of the system.", "start": 152.84, "duration": 5.44}, {"text": "So Wise had to think outside of the box.", "start": 158.74, "duration": 2.66}, {"text": "*a nerdwriter video transition*", "start": 161.4, "duration": 0.82}, {"text": "One of the most important new features of the Korg wave station is the ability to string together a number of waves.", "start": 162.22, "duration": 6.7}, {"text": "Waves can be defined as single or multi-cycle loops with more than 400 internal waves available.", "start": 169.22, "duration": 6.52}, {"text": "You can select up to 255 different waves to play in any order including choice of pitch, duration, and crossfade times.", "start": 175.74, "duration": 8.84}, {"text": "*again*", "start": 184.58, "duration": 0.94}, {"text": "Wise took inspiration from the Korg Wavestation,", "start": 185.52, "duration": 2.98}, {"text": "a synthesizer that came out in the early 90s, and used something called wave sequencing", "start": 188.5, "duration": 4.58}, {"text": "to take a number of tiny samples and play them in quick succession so that they made unique, evolving sounds.", "start": 193.08, "duration": 5.94}, {"text": "Of course, the Super Nintendo couldn't arrange and rearrange samples on its own.", "start": 199.24, "duration": 4.02}, {"text": "So in order to achieve this effect, Wise painstakingly recorded individual waveforms at different frequencies", "start": 203.44, "duration": 6.1}, {"text": "and placed them all in the coding program one by one.", "start": 209.54, "duration": 3.9}, {"text": "This program, by the way, is called a music tracker, where music is essentially boiled down to numbers.", "start": 213.58, "duration": 6.1}, {"text": "Each tiny sound is placed on a vertical timeline, and the columns represent your note, octave, sample choice", "start": 219.68, "duration": 7.7}, {"text": "volume, and some simple effects like panning, fade, and echo.", "start": 227.38, "duration": 3.88}, {"text": "It took Wise five full weeks to input every sample for aquatic ambience. It's a tedious process", "start": 231.5, "duration": 6.5}, {"text": "But the results speak for themselves.", "start": 238.34, "duration": 2.18}, {"text": "*typical*", "start": 251.04, "duration": 0.5}, {"text": "*interruption*", "start": 262.06, "duration": 0.54}, {"text": "The Super Nintendo was a restrictive system for composers, there's no doubt. But, as with anything", "start": 272.08, "duration": 5.9}, {"text": "limitation breeds creativity,", "start": 277.98, "duration": 2.48}, {"text": "and just because the sound system consists of two chips, 64 kilobytes of RAM, and a lot of hexadecimal code,", "start": 280.92, "duration": 7.02}, {"text": "doesn't mean it can't make beautiful music.", "start": 288.66, "duration": 2.4}, {"text": "Hey everybody, thank you so much for watching!", "start": 300.74, "duration": 1.86}, {"text": "This episode was brought to you by VRV.", "start": 302.6, "duration": 2.32}, {"text": "If you don't know, VRV is a service that pulls together a lot of great content channels like", "start": 304.92, "duration": 4.26}, {"text": "Roosterteeth, Mondo, Crunchyroll, and Funimation all into one place, so you can watch some of the best anime there,", "start": 309.18, "duration": 5.62}, {"text": "but, they've also added new channels like Mubi, which hosts a rotating roster of 30 indie movies", "start": 314.8, "duration": 5.68}, {"text": "which is something that I love. Another show that I would personally like to recommend is", "start": 320.48, "duration": 3.9}, {"text": "Gary and His Demons, about a dude who is destined to fight demons, but doesn't really want to do it.", "start": 324.42, "duration": 6.36}, {"text": "It's-it's a funny show, kinda like Rick and Morty if you like that.", "start": 330.78, "duration": 3.22}, {"text": "With VRV premium, you can get ad free access to Gary and His Demons and everything else, all the channels", "start": 334.0, "duration": 5.76}, {"text": "and for a limited time you can use the first link in the description to get a 30-day free trial of VRV.", "start": 339.76, "duration": 4.62}, {"text": "Definitely try that out. Thanks guys, I'll see you next time.", "start": 344.68, "duration": 2.76}]