[{"text": "Hey guy, welcome back to the toilet.", "start": 0.0, "duration": 2.0}, {"text": "Danny kicked me out.", "start": 3.84, "duration": 1.36}, {"text": "It's so weird. I thought everything was going great.", "start": 5.78, "duration": 3.22}, {"text": "But then last week I came home from my racquetball tournament and I was in a good mood.", "start": 9.0, "duration": 3.6}, {"text": "So I got in last place and I noticed Danny had packed up all my stuff. Like in bags", "start": 12.76, "duration": 4.68}, {"text": "I looked at him and I said, \"Danny, why did you do that? Can you put it back?\"", "start": 17.46, "duration": 3.74}, {"text": "And he said, \"No it's time for you to go home.\"", "start": 21.2, "duration": 3.72}, {"text": "And I said, \"I thought I was home.\"", "start": 24.92, "duration": 2.96}, {"text": "Anyway long story short he kicked me out and I'm back in Florida with my wife. So...", "start": 28.56, "duration": 4.7}, {"text": "F's in the chat I guess", "start": 34.12, "duration": 1.38}, {"text": "Hey, let's talk about the Internet", "start": 35.6, "duration": 1.82}, {"text": "Remember like a thousand years ago when they invented the internet,", "start": 37.42, "duration": 2.88}, {"text": "and everyone was like, \"This is awesome!", "start": 40.3, "duration": 1.88}, {"text": "\"The world has changed", "start": 42.18, "duration": 1.26}, {"text": "\"and nothing, but good will come from this,\"?", "start": 43.44, "duration": 3.24}, {"text": "And now people just use the internet to get really famous for doing dumb shit.", "start": 46.68, "duration": 3.6}, {"text": "Yeah, I remember that too.", "start": 50.28, "duration": 2.46}, {"text": "So you probably heard about this story by now, I saw a lot of people talking about it.", "start": 52.8, "duration": 3.46}, {"text": "It really took the internet by storm.", "start": 56.26, "duration": 1.98}, {"text": "Um- but I'm going to talk about it as well because it made me really mad.", "start": 58.46, "duration": 3.145}, {"text": "This video went viral of a girl going to Walmart,", "start": 61.605, "duration": 2.995}, {"text": "opening up a tub of ice cream, and licking the top of it.", "start": 64.6, "duration": 3.24}, {"text": "And here's the funny part", "start": 67.84, "duration": 1.52}, {"text": "Then she puts it back in the freezer.", "start": 69.52, "duration": 2.78}, {"text": "-[Inaudible] Lick it, lick it. Oh! You foul! Put it back, put it back, put it back. Put it back. Oh!", "start": 72.3, "duration": 5.06}, {"text": "God that's so funny. I love how funny that is", "start": 77.36, "duration": 3.88}, {"text": "Now right away, everybody turned on this woman, and they were pretty pissed at her for doing this", "start": 81.24, "duration": 4.04}, {"text": "Cause it's gross and you shouldn't do this", "start": 85.32, "duration": 2.44}, {"text": "The problem is when shitty people do shitty things online, and they get negative attention for it,", "start": 87.96, "duration": 5.4}, {"text": "That's really all they wanted because negative attention is still attention.", "start": 93.58, "duration": 3.76}, {"text": "So it didn't end there it, became a trend.", "start": 97.34, "duration": 2.68}, {"text": "Oh, what's she gonna do?", "start": 100.02, "duration": 2.0}, {"text": "Aw! She licked the ice cream!", "start": 102.579, "duration": 1.581}, {"text": "*funny, upbeat music*", "start": 104.16, "duration": 1.08}, {"text": "That's why it's funny, cause she licked it.", "start": 105.3, "duration": 2.56}, {"text": "There's a couple things about this that I love.", "start": 107.86, "duration": 2.12}, {"text": "Number one It's so funny, but it's also smart.", "start": 109.98, "duration": 2.96}, {"text": "You see because what these people are doing is a crime,", "start": 112.94, "duration": 2.78}, {"text": "that would be very easy to get away with if they didn't film themselves doing it.", "start": 115.74, "duration": 6.06}, {"text": "As far as crimes go, this would actually be one of the easiest to get away with", "start": 121.8, "duration": 3.6}, {"text": "Because no one would be able to tell that it happened if you didn't show it to them.", "start": 125.4, "duration": 4.12}, {"text": "So why would you do this?", "start": 129.52, "duration": 1.08}, {"text": "I know that's kind of a dumb question", "start": 130.61, "duration": 1.36}, {"text": "Because obviously the point of this challenge isn't to lick the ice cream and put it back,", "start": 131.97, "duration": 3.739}, {"text": "It's to film yourself doing that so you can get a bunch of clout for it.", "start": 135.709, "duration": 3.271}, {"text": "A bunch of well-deserved clout, for all the hard work you're doing.", "start": 139.06, "duration": 3.38}, {"text": "But wait, there's more. This guy did it, too", "start": 142.44, "duration": 2.4}, {"text": "-Want some?", "start": 150.36, "duration": 1.62}, {"text": "That's so funny", "start": 153.44, "duration": 1.78}, {"text": "I know I'm not technically like a fashion icon or anything like that", "start": 155.4, "duration": 3.2}, {"text": "So maybe my opinion doesn't mean anything, but is he wearing baseball pants?", "start": 158.6, "duration": 3.655}, {"text": "What, does he have a game tonight?", "start": 162.255, "duration": 1.234}, {"text": "Also, he like kind of fucked up the whole challenge", "start": 163.769, "duration": 2.54}, {"text": "I guess he was in a hurry to get to his baseball game", "start": 166.31, "duration": 2.07}, {"text": "because he ran out so fast that he forgot to put the lid back on.", "start": 168.48, "duration": 3.18}, {"text": "Not that I want him to be successful at the challenge.", "start": 171.66, "duration": 2.1}, {"text": "I'm glad he failed, but isn't the point of this to make it look like the ice cream has not been touched?", "start": 173.76, "duration": 4.06}, {"text": "Or more specifically licked?", "start": 177.82, "duration": 1.86}, {"text": "I don't think anyone would buy that, cause the lids off.", "start": 179.68, "duration": 2.92}, {"text": "They'd probably be like, \"Why is the lid off? Did someone lick this?\"", "start": 182.6, "duration": 4.82}, {"text": "Don't worry though. I know you're probably pretty frustrated with these people. I am too", "start": 187.42, "duration": 3.42}, {"text": "He responded to his own tweet with this video of a police officer at his door.", "start": 190.84, "duration": 5.28}, {"text": "Hold on, let me try to wrap my head around this.", "start": 196.12, "duration": 2.42}, {"text": "So you're saying if you film yourself doing a crime, and then you put that video on the internet,", "start": 198.54, "duration": 5.9}, {"text": "The police can find you? And then they have evidence? Of you doing the crime?", "start": 204.44, "duration": 6.2}, {"text": "That's so weird that that's all it would take to get arrested", "start": 210.64, "duration": 2.82}, {"text": "Is submitting your own evidence to the police", "start": 213.86, "duration": 2.42}, {"text": "Speaking of the police, the girl from the first video apparently got arrested as well.", "start": 216.28, "duration": 5.04}, {"text": "The official charge is food tampering.", "start": 221.32, "duration": 2.64}, {"text": "Which is a felony in most US states, and carries a maximum sentence of up to 20 years.", "start": 224.36, "duration": 7.0}, {"text": "If she gets sentenced to 20 years in prison", "start": 231.36, "duration": 2.0}, {"text": "for filming herself licking ice cream, I will wake up every for the rest of my life laughing out loud.", "start": 233.88, "duration": 6.28}, {"text": "I will be- I will laugh so loud that that's what's gonna wake me up every morning", "start": 240.22, "duration": 4.7}, {"text": "When something like this has such a poetic ending, it feels pretty good.", "start": 244.92, "duration": 3.76}, {"text": "This is a very satisfying resolution.", "start": 248.68, "duration": 2.34}, {"text": "It really sucks thought that the damage was already done.", "start": 251.06, "duration": 2.94}, {"text": "When someone does something stupid and gets rewarded for it,", "start": 254.0, "duration": 3.4}, {"text": "people see that and then they do the same stupid thing.", "start": 257.4, "duration": 2.6}, {"text": "That's why other videos like this are going viral.", "start": 260.019, "duration": 2.581}, {"text": "Like this guy did one too and it's really funny because,", "start": 262.6, "duration": 2.78}, {"text": "instead of ice cream he did mouthwash.", "start": 265.38, "duration": 1.72}, {"text": "*Drew laughs*", "start": 276.52, "duration": 0.9}, {"text": "He spitted in it and he put it back on the shelf and that's really funny to me because I'm a little baby.", "start": 277.42, "duration": 5.16}, {"text": "I'm two years old and I got poop in my diaper and I'm laughing at this cause it's funny", "start": 282.58, "duration": 4.72}, {"text": "and I'm the target audience for a joke like this. Me a two year-old.", "start": 287.3, "duration": 3.86}, {"text": "The thing with theses Listerine bottles is these are all sealed.", "start": 291.16, "duration": 3.32}, {"text": "To set up this shot, they must have gone over there and taken the seal off", "start": 294.68, "duration": 3.88}, {"text": "So he could then select that specific one. That they had already taken the seal off of,", "start": 298.56, "duration": 4.82}, {"text": "and then put it back on the shelf when he was done and it still doesn't have a seal.", "start": 303.38, "duration": 4.46}, {"text": "No one's gonna buy it. You've failed at your own shitty prank you moron", "start": 307.84, "duration": 4.11}, {"text": "I understand that the feeling of clout can be very addicting", "start": 311.95, "duration": 2.99}, {"text": "and sometimes a pursuit of it comes at the cost of being a decent human being.", "start": 314.94, "duration": 4.78}, {"text": "But what are you really getting out of this?", "start": 319.84, "duration": 1.957}, {"text": "Like with these ice cream lickers, and people like Boonk.", "start": 321.8, "duration": 3.18}, {"text": "And uh, Plain Potatoes who Eddie's made videos about. What is the goal?", "start": 325.12, "duration": 3.98}, {"text": "What tangible accomplishment do you have to show for yourself?", "start": 329.1, "duration": 2.58}, {"text": "Other than the most temporary clout that I would put an asterisk next to", "start": 331.7, "duration": 4.76}, {"text": "Cause it's not like- it's not like you're being rewarded for something.", "start": 336.6, "duration": 2.9}, {"text": "There are numbers involved", "start": 339.5, "duration": 1.48}, {"text": "There are a lot of people paying attention to you", "start": 340.99, "duration": 2.279}, {"text": "But they're all mad at you", "start": 343.27, "duration": 1.56}, {"text": "And then as soon as they're done being mad at you", "start": 344.83, "duration": 1.99}, {"text": "Which is gonna happen, people have already forgotten about this, then they move on", "start": 346.82, "duration": 4.82}, {"text": "There's no sustainability with this type of clout. It's so temporary. It's so worthless", "start": 351.64, "duration": 4.7}, {"text": "So yeah, you got like 10,000 people yelling at you on the internet, which is good, I guess", "start": 356.68, "duration": 5.68}, {"text": "But then what happens? You get arrested?", "start": 362.92, "duration": 3.02}, {"text": "You get a million followers on Instagram but then your account gets deleted because you're a shitty person?", "start": 365.94, "duration": 4.18}, {"text": "So what do you have to show for it, other than just being an asshole?", "start": 370.13, "duration": 3.169}, {"text": "The crazy thing is though that these people's brains are so broken and dumb,", "start": 373.37, "duration": 4.05}, {"text": "that even when they face consequences, like getting arrested,", "start": 377.42, "duration": 3.62}, {"text": "they still think it was all worth it in the end", "start": 381.32, "duration": 2.82}, {"text": "\"Just left the police station too much. Too much clout to care\"", "start": 384.14, "duration": 2.7}, {"text": "He's so cool. *air horns*", "start": 387.36, "duration": 0.82}, {"text": "You're probably thinking that if he considers the clout he received to be worth spending the day at the police station", "start": 388.18, "duration": 5.1}, {"text": "He probably got a lot of followers, right?", "start": 393.28, "duration": 2.78}, {"text": "Like a hundred thousand or two hundred thousand or", "start": 396.06, "duration": 3.86}, {"text": "eight thousand. Eight thousand followers. That's what this is all about?", "start": 399.92, "duration": 3.78}, {"text": "Also I'm still just concerned about this guy's baseball game that he clearly missed.", "start": 403.7, "duration": 3.32}, {"text": "You can't let your team down like that.", "start": 407.02, "duration": 1.64}, {"text": "Also, where'd you get those boots? Is one of Santa's elves going through a goth phase?", "start": 408.8, "duration": 4.04}, {"text": "What did you raid the dumpster behind Hot Topic?", "start": 412.84, "duration": 2.52}, {"text": "I don't care that I'm not fashionable enough to make these jokes.", "start": 415.36, "duration": 2.3}, {"text": "Look if you're ever on the internet and you see a dumb person doing a dumb thing", "start": 417.669, "duration": 4.17}, {"text": "But getting a lot of attention for it, don't feel tempted to also do that dumb thing", "start": 421.84, "duration": 5.07}, {"text": "So you can also maybe get a similar amount of attention. It's not worth it", "start": 426.91, "duration": 5.16}, {"text": "Plus there's plenty of wholesome challenges going around that you can take part in.", "start": 432.13, "duration": 3.69}, {"text": "The bottle cap challenge is pretty cool", "start": 435.82, "duration": 1.979}, {"text": "There's a cucumber challenge. I'm not sure what that is. I haven't looked it up yet", "start": 437.8, "duration": 4.049}, {"text": "But if it involves vegetables, it's probably wholesome", "start": 441.849, "duration": 2.311}, {"text": "All I'm saying is there's so much potential for more wholesome content and no one's making it.", "start": 444.16, "duration": 5.12}, {"text": "Which is why today I'm starting a brand new trend:", "start": 449.28, "duration": 2.62}, {"text": "Going-to-your-local-grocery-store,-buying-all-your-groceries-at-full-price,-and-respecting-the-employees-challenge", "start": 451.9, "duration": 4.98}, {"text": "And don't forget your reusable bag!", "start": 457.38, "duration": 0.5}, {"text": "*fun music*", "start": 458.98, "duration": 1.66}, {"text": "Yep! And now I just wait for the retweets to start pouring in.", "start": 469.88, "duration": 4.52}, {"text": "Oh! [\"this is boring\"]", "start": 482.48, "duration": 1.98}, {"text": "Yeah, they're right", "start": 484.469, "duration": 1.811}, {"text": "I forgot. It's way more fun to get mad at dumb people than it is to praise people for doing the bare minimum", "start": 486.28, "duration": 5.14}, {"text": "That's my whole channel: is getting mad at dumb people", "start": 491.78, "duration": 3.12}, {"text": "One last update on this situation um, it looks like the ice cream revolution has gotten so out of hand", "start": 494.9, "duration": 5.52}, {"text": "that stores are now having to lock their frozen dessert section", "start": 500.42, "duration": 5.36}, {"text": "because people won't stop licking ice cream", "start": 505.78, "duration": 4.509}, {"text": "Y'know, it was bad enough that you guys committed a felony", "start": 510.289, "duration": 4.191}, {"text": "But now if I want to so much as buy some popsicles, I have to talk to someone", "start": 514.48, "duration": 6.96}, {"text": "Congratulations ice cream lickers. You just posted cringe you're going to lose subscriber", "start": 522.24, "duration": 5.27}, {"text": "Well, it looks like I've officially ended the video more angry than when I started. So mission accomplished", "start": 527.639, "duration": 5.33}, {"text": "Let's hear a word from our sponsor", "start": 533.22, "duration": 1.84}, {"text": "Does this ever happen to you?", "start": 535.06, "duration": 1.029}, {"text": "You're trying to sell a really great product", "start": 536.089, "duration": 2.1}, {"text": "But no one knows where they can buy it because you set up shop in the woods", "start": 538.19, "duration": 3.63}, {"text": "And so your dad tells you you should build a website, but you don't know what that means", "start": 541.82, "duration": 4.319}, {"text": "So you start hammering stuff together because you thought that's what building was", "start": 546.139, "duration": 4.801}, {"text": "But then you hammer your finger real hard on accident and start crying so loud that your dad", "start": 550.94, "duration": 4.94}, {"text": "comes into your room and tells you have to move out because you're 75 years old and", "start": 555.88, "duration": 4.6}, {"text": "So you're homeless now all cause you didn't know how to make a website", "start": 560.48, "duration": 3.38}, {"text": "Has ever happened?", "start": 563.86, "duration": 0.6}, {"text": "Well then you gotta use Squarespace ya dummy.", "start": 564.5, "duration": 2.22}, {"text": "It's the easiest way to make a beautiful functioning website in no time at all and without any coding experience", "start": 566.72, "duration": 5.46}, {"text": "You don't even need a hammer. Just go to Squarespace.com/drew", "start": 572.4, "duration": 2.74}, {"text": "Choose from a bunch of great templates to get started and then it's all just drag-and-drop from there", "start": 575.84, "duration": 4.559}, {"text": "You'll even get 10% off your first purchase when you use my link!", "start": 580.4, "duration": 3.26}, {"text": "Now when people want to buy your product", "start": 583.66, "duration": 1.6}, {"text": "They don't have to try to figure out what woods you're in because you didn't know what address to give them", "start": 585.26, "duration": 5.159}, {"text": "So they accidentally go to the wrong woods and get eaten by three bears", "start": 590.42, "duration": 3.599}, {"text": "They can just go to your website on their home computer or cellular device!", "start": 594.019, "duration": 4.341}, {"text": "Now, that's easy", "start": 598.36, "duration": 0.789}, {"text": "And with this new awesome website, I bet your dad's gonna totally regret kicking you out.", "start": 599.38, "duration": 4.98}, {"text": "But don't take it from that guy, take it from me.", "start": 604.38, "duration": 2.88}, {"text": "I've used Squarespace a bunch of times for", "start": 607.26, "duration": 2.04}, {"text": "drewgoodenshop.com, littlestinkerclub.com, to fart.com, and every time it's been a breeze.", "start": 609.68, "duration": 5.58}, {"text": "Thanks Squarespace", "start": 615.274, "duration": 1.436}, {"text": "For sponsoring today's video, please use my link.", "start": 617.35, "duration": 2.27}, {"text": "Well guy that's gonna do for today's video. Thank you so much for watching", "start": 619.62, "duration": 2.31}, {"text": "Sorry this one is a little shorter than what I usually post. It's been a very hectic month", "start": 622.33, "duration": 4.88}, {"text": "We did not expect have to move when we did", "start": 627.73, "duration": 2.47}, {"text": "If you want to see more stuff from me, I did post a sketch last week", "start": 630.2, "duration": 2.16}, {"text": "About Facebook marketplace. That's on my Twitter and Instagram", "start": 632.36, "duration": 2.08}, {"text": "I also tweeted about stranger things and made a bunch of people really angry", "start": 634.44, "duration": 3.09}, {"text": "so you should go see what that is", "start": 637.53, "duration": 2.64}, {"text": "And follow me", "start": 640.54, "duration": 0.96}, {"text": "As always the links to buy tour tickets and merch are in the description if you feel so inclined", "start": 641.5, "duration": 3.9}, {"text": "And when I get back from VidCon, I promise to figure out what to do with my background.", "start": 645.4, "duration": 4.46}, {"text": "Well, that's about it.", "start": 649.86, "duration": 0.81}, {"text": "I gotta go explain to my neighbors why they saw me walk into the woods wearing three different shirts", "start": 650.67, "duration": 3.63}, {"text": "So see you next time", "start": 654.85, "duration": 2.0}]