[{"text": "So if Thor's hammer is supposed to weigh as much as a planet, what do you think would happen if he smashes someone with it?", "start": 0.34, "duration": 6.8}, {"text": "Well, they wouldn't go flying...", "start": 7.92, "duration": 2.0}, {"text": "...they will be completely OBLITERATED.", "start": 11.36, "duration": 2.72}, {"text": "I love the action scenes in Marvel movies, but every once in a while", "start": 15.96, "duration": 2.38}, {"text": "I can't help but think they're holding back just a little bit. Especially after seeing Logan and Deadpool.", "start": 18.359, "duration": 4.8}, {"text": "We've seen what it looks like when superheroes truly unleash their powers. Today using VFX", "start": 24.789, "duration": 4.91}, {"text": "we're gonna bring some of that to our favorite Marvel movies. What would they look like if they are Rated R?", "start": 29.699, "duration": 5.82}, {"text": "So the first step in this process is going through some of our favorite scenes, and seeing which ones bend the rules", "start": 39.66, "duration": 4.86}, {"text": "just a little too much for our liking.", "start": 44.52, "duration": 1.24}, {"text": "We're gonna take a look with these things with Niko and Peter. 'Sup guys, my name is Peter", "start": 45.76, "duration": 4.46}, {"text": "I'm 21 years old and I'm a fat Marvel nerd. I've seen every single Marvel movie.", "start": 50.22, "duration": 2.72}, {"text": "I literally saw Iron Man in 2008 when it came out. I was like I was 10 years old.", "start": 53.04, "duration": 5.2}, {"text": "I didn't watch the most recent Avengers, because I think anytime somebody breaks like a finale in the two movies", "start": 58.58, "duration": 4.84}, {"text": "I just don't care about the second movie.", "start": 63.56, "duration": 2.22}, {"text": "Wren was talking about this one.", "start": 71.58, "duration": 1.34}, {"text": "\"All of his internal organs would be squished from the momentum.\"", "start": 73.18, "duration": 3.14}, {"text": "\"It's the same with Superman when he catches someone who's falling outta the air, they'd be dead.\"", "start": 76.56, "duration": 4.5}, {"text": "\"immediately they'd just, agh\"", "start": 81.12, "duration": 1.26}, {"text": "His body would just", "start": 82.38, "duration": 1.5}, {"text": "liquidify. There'd be like a juice coming out the feet right there when turned around.", "start": 83.88, "duration": 2.509}, {"text": "Iron Man would probably have cancer from the gamma radiation. Just construct a scene of like Tony Stark in a hospital room.", "start": 86.67, "duration": 6.38}, {"text": "Alright so Loki, so he gets bonked off his air scooter.", "start": 94.1, "duration": 3.26}, {"text": "\"I am a god, you dull creature.\"", "start": 97.76, "duration": 2.0}, {"text": "\"And I will not be bullied by-\"", "start": 100.56, "duration": 1.7}, {"text": "It's not realistic.", "start": 105.06, "duration": 1.01}, {"text": "It would look like taking a towel, dipping it in red food coloring, and then", "start": 106.07, "duration": 3.48}, {"text": "slapping that wet towel around but is it because he's a god? He's an alien technically.", "start": 109.71, "duration": 5.359}, {"text": "He's not a god. So if you smacked an alien into a floor would they die?", "start": 115.1, "duration": 3.54}, {"text": "Iron Man just flew all the way to Afghanistan. Juice, just so he lands in juice on the ground.", "start": 123.48, "duration": 5.24}, {"text": "He loses control of his bowels too because he's traveling fast, there's just a brown splat on the ground - did you hear the farting?", "start": 129.08, "duration": 4.02}, {"text": "YaAaAa there we go, that's the first shot.", "start": 133.88, "duration": 1.82}, {"text": "Look at that, it's just doOooOomhsajd", "start": 136.02, "duration": 2.4}, {"text": "That's...DEATH", "start": 138.42, "duration": 1.4}, {"text": "This is like straight, like, obliteration. This is , like, shreds.", "start": 139.84, "duration": 3.56}, {"text": "It reminds me of True Lies, when she's like, \"Did you kill them?", "start": 143.4, "duration": 2.54}, {"text": "He's like, \"Yeah but they were all bad.\"", "start": 146.02, "duration": 1.56}, {"text": "So this is the opening scene of Captain America Civil Wa-", "start": 154.42, "duration": 2.0}, {"text": "-oh that guy would be dead. Sorry, just, that guy'd be dead,", "start": 156.54, "duration": 2.62}, {"text": "that guy would be sliced in half.", "start": 159.16, "duration": 2.0}, {"text": "I'm just imagining that blood splat on the wall.", "start": 161.32, "duration": 2.66}, {"text": "Captain America just wasted like four upstanding SWAT team officers that all have children who are like two years old.", "start": 163.98, "duration": 5.64}, {"text": "The visual effects I'll be doing is the crying wife as the car rolls up with the two people dressed in suits.", "start": 169.82, "duration": 4.46}, {"text": "Straight up", "start": 174.28, "duration": 1.28}, {"text": "shot him in the FACE.", "start": 176.16, "duration": 2.0}, {"text": "Wait this scene's perfect.", "start": 178.92, "duration": 1.86}, {"text": "You see blood drippin' outta him right there.", "start": 181.44, "duration": 1.74}, {"text": "Oh my God.", "start": 183.22, "duration": 0.82}, {"text": "Dude right there, this guy just gets his head chopped off by the shield.", "start": 184.2, "duration": 3.12}, {"text": "Coming, BOOF.", "start": 187.72, "duration": 0.62}, {"text": "Oh yeah he's done.", "start": 188.34, "duration": 0.94}, {"text": "Oh then he just kicks the corpse.", "start": 189.28, "duration": 2.0}, {"text": "Dude what if he just runs up, kicks him in the head,", "start": 192.54, "duration": 1.3}, {"text": "it stays in the spot and the body goes.", "start": 193.96, "duration": 1.84}, {"text": "So after scouring through these scenes, it seems like really some of the best clips we're finding are in Captain America.", "start": 195.8, "duration": 5.16}, {"text": "We have a superhero, and superheroes fighting actual humans.", "start": 201.12, "duration": 4.08}, {"text": "If they were fighting real people it would look very different than what you're seeing in the movie.", "start": 205.3, "duration": 3.36}, {"text": "People would be decapitated.", "start": 208.84, "duration": 1.36}, {"text": "They would have their spines broken.", "start": 210.2, "duration": 1.39}, {"text": "They would kind of turn into meat sponges and splatter everywhere.", "start": 211.59, "duration": 3.65}, {"text": "Out of all the scenes that we could tweak to make it look realistic, that one kinda stands out to me.", "start": 215.42, "duration": 3.86}, {"text": "So, we have a lot of work to do. We're gonna divvy these shots up because we're all gonna tackle it as a team.", "start": 219.3, "duration": 6.44}, {"text": "There's gonna be a lot of 2D compositing, maybe a little bit of 3D work, we'll see.", "start": 225.86, "duration": 3.14}, {"text": "And then I think at the very end top it off with a little bit of sound design to hopefully", "start": 229.16, "duration": 3.22}, {"text": "make all the extra visuals really pop.", "start": 232.38, "duration": 1.7}, {"text": "This scene is gonna feel like it's straight out of John Wick.", "start": 234.08, "duration": 3.0}, {"text": "Hey Jake,", "start": 242.62, "duration": 1.479}, {"text": "sooo what's goin' on here, man?", "start": 244.1, "duration": 1.9}, {"text": "I know you guys are getting used to seeing me and thinkin'", "start": 246.58, "duration": 2.519}, {"text": "oh here comes a brand integration 'cause Jake's on camera. Well, guess what?", "start": 249.1, "duration": 4.5}, {"text": "Today is absolutely no different because this video is sponsored by Squarespace. But let me tell you why that's important.", "start": 254.5, "duration": 5.02}, {"text": "I really think the guys pay a lot more attention to me", "start": 259.54, "duration": 2.88}, {"text": "when I'm dressed up as their favorite characters from pop culture. So we have this Iron Man suit just sitting there", "start": 262.6, "duration": 5.28}, {"text": "Let's see how believable I pull this off and I think at the end everyone's gonna learn something about Squarespace.", "start": 267.88, "duration": 5.489}, {"text": "Hey guys, billionaire playboy philanthropist Tony \"Iron Man\" Stark here. I'm gonna go tell the guys a something or two about Squarespace.", "start": 273.699, "duration": 7.14}, {"text": "Yeah, yeah, this is how Iron Man gets around.", "start": 285.38, "duration": 2.3}, {"text": "Hey, are you a billionair- uhhh do you know billionaire playboy philanthropist Tony \"Iron Man\" Stark?", "start": 288.52, "duration": 4.82}, {"text": "I thought I'd come down here and tell you a little bit about Squarespace", "start": 293.34, "duration": 2.88}, {"text": "I'd love to hear about their award-winning customer support.", "start": 296.22, "duration": 3.68}, {"text": "They also allow simultaneous posting", "start": 299.9, "duration": 2.26}, {"text": "Meaning that you can post to your Twitter, Facebook, and tumblr profiles.", "start": 302.16, "duration": 3.64}, {"text": "To my tumblr as well?!", "start": 305.8, "duration": 1.8}, {"text": "Look at how much he's paying attention.", "start": 307.6, "duration": 2.0}, {"text": "Hey Wren, it's billionaire playboy philanthropist. Tony \"Iron Man\" Stark here.", "start": 310.34, "duration": 5.12}, {"text": "Hey! Nice to meet you Iron Man!", "start": 315.46, "duration": 1.54}, {"text": "Be careful with those. Those are lasers.", "start": 317.06, "duration": 1.94}, {"text": "Did you know that Squarespace now supports audio podcasts? Meaning that you could put your podcasts on Squarespace?", "start": 319.0, "duration": 6.32}, {"text": "Didn't actually know that.", "start": 325.42, "duration": 1.16}, {"text": "See, you learn somethin' new every day!", "start": 326.58, "duration": 1.26}, {"text": "Look how much you paid attention to me when I said that.", "start": 327.84, "duration": 1.94}, {"text": "Oh hey, Niko.", "start": 329.78, "duration": 1.18}, {"text": "Hi, Mr. Stark.", "start": 330.96, "duration": 2.32}, {"text": "Using Squarespace we're also able to do multiple contributors.", "start": 333.28, "duration": 4.3}, {"text": "That's cool. Hey, which version of the suit is this?", "start": 337.66, "duration": 1.88}, {"text": "UhHh this is one of the. um, early ones. He thinks I'm Iron Man.", "start": 339.54, "duration": 3.76}, {"text": "Hey Christian, did you know that Squarespace allows for traffic overviews and content ownership?", "start": 343.34, "duration": 6.02}, {"text": "So everything you post on the website you own. We use it all the time at Stark Industries.", "start": 349.36, "duration": 3.98}, {"text": "That's why Squarespace is the best.", "start": 353.34, "duration": 1.32}, {"text": "Hey, that's great. I'm glad we're on the same page.", "start": 354.68, "duration": 2.14}, {"text": "Thanks, Tony.", "start": 356.82, "duration": 0.76}, {"text": "You just remember guys. Hey guys, remember?", "start": 357.58, "duration": 2.68}, {"text": "ᵀʰᵃᵗ'ˢ ᴶᵃᵏᵉ ʳᶦᵍʰᵗˀ", "start": 360.26, "duration": 1.18}, {"text": "Go to squarespace.com/corridorcrew and get 10% off your first purchase. It's great meeting everyone. See you guys later.", "start": 361.58, "duration": 8.0}, {"text": "I'll see you later.", "start": 370.54, "duration": 2.0}, {"text": "ᴰᵒ ʸᵒᵘ ᵗʰᶦⁿᵏ ᵗʰᵉʸ ᵇᵉˡᶦᵉᵛᵉᵈ ᶦᵗ?", "start": 376.58, "duration": 2.0}, {"text": "Alright.", "start": 386.77, "duration": 1.29}, {"text": "I'm kicking my teeth and I'm not gonna put this in my mouth.", "start": 388.06, "duration": 2.839}, {"text": "I was tasked with this beautiful shot. It's like throwing a frisbee. Look he's throwing a frisbee at him and", "start": 390.9, "duration": 6.58}, {"text": "it ricochets off and the guy goes pOoF.", "start": 397.62, "duration": 2.34}, {"text": "We're thinking well the velocity that thing's travelling at is pretty high.", "start": 399.96, "duration": 4.02}, {"text": "Captain America's shield is so strong. It deflects explosions and bullets and", "start": 404.06, "duration": 3.979}, {"text": "lasers and hammers, so it probably can slice through a man like butter. I'm cutting him in half.", "start": 408.04, "duration": 5.46}, {"text": "I want the bottom half still, the legs are great", "start": 413.7, "duration": 1.82}, {"text": "but basically I need to replace his top half with a new top half. I resorted to one of my favorite websites, Mixamo.", "start": 415.53, "duration": 5.91}, {"text": "They have a really great SWAT model, same model that Peter's using.", "start": 421.52, "duration": 3.38}, {"text": "I take that I basically just deleted the second half, put kind of like a meatball", "start": 425.1, "duration": 4.62}, {"text": "I threw this like big ol' meatball in there and jammed it up in there man, dude, Mamma Mia.", "start": 430.06, "duration": 5.22}, {"text": "That's the shot. Okay, I'm regretting everything.", "start": 435.28, "duration": 2.62}, {"text": "I think he's thinking about his family, his life choices, and country. And patriotism is worth more than a paycheck from an evil corporation", "start": 438.22, "duration": 7.12}, {"text": "Basically a little color correction and I just kind of add that. Here's what really is making this shot good:", "start": 445.48, "duration": 4.78}, {"text": "the shield bounces back still. If it''s slicing through him, let's yank the shield out completely after it hits him like this.", "start": 450.38, "duration": 7.08}, {"text": "Let's just kind of have it carry on for a little bit more. It may be a little bit wobbly, wUuUoOowUuoO", "start": 457.58, "duration": 4.24}, {"text": "And I think that really helps sell it. Now it feels like you know, it's a slice here.", "start": 461.82, "duration": 4.24}, {"text": "So that's the finishing touch on this shot. We're doing a fan-made, re-release of the whole movie Rated R.", "start": 466.08, "duration": 4.74}, {"text": "Actually, that would be pretty dope actually, you know, there's the proof of concept for anyone out there who is interested.", "start": 470.98, "duration": 5.22}, {"text": "All right. I'm doing the guy who gets ostrich knees", "start": 476.7, "duration": 3.26}, {"text": "So here's the finished shot.", "start": 480.5, "duration": 1.8}, {"text": "Oh my God, dude.", "start": 483.42, "duration": 1.06}, {"text": "Yeah that works,", "start": 484.82, "duration": 1.08}, {"text": "Bskthchthc, cronch", "start": 485.9, "duration": 2.0}, {"text": "Just turns into an ostrich man. So it's quick and dirty.", "start": 488.16, "duration": 2.82}, {"text": "So here's base shot right here. Gone through and I've masked out the lower halves of the legs so I can erase them.", "start": 491.06, "duration": 4.44}, {"text": "So here he is with his legs painted out. And something I noticed, 'cause I need to put legs back in,", "start": 495.64, "duration": 3.48}, {"text": "is that his leg rotates just the right way that would match the perspective shift", "start": 499.32, "duration": 3.64}, {"text": "where I can see the bottom of his feet after they flip up all the way.", "start": 502.96, "duration": 2.9}, {"text": "I stuck my two ostrich legs, and here we go.", "start": 505.96, "duration": 4.1}, {"text": "Kchhhchh", "start": 510.06, "duration": 0.84}, {"text": "ErrRr", "start": 510.9, "duration": 0.5}, {"text": "Erwhrhh", "start": 511.4, "duration": 0.72}, {"text": "AhhHh my knees", "start": 512.12, "duration": 0.94}, {"text": "Ewhww", "start": 513.9, "duration": 0.7}, {"text": "Next up is the guy who gets hit in the neck with Captain America's shield.", "start": 514.6, "duration": 3.12}, {"text": "RIP", "start": 522.04, "duration": 0.54}, {"text": "Alright I'm back, took me a day I got a little busy.", "start": 524.0, "duration": 2.42}, {"text": "I thought it'd be really funny to do kinda like one of those anime things where the guy gets sliced,", "start": 526.42, "duration": 2.86}, {"text": "but then when he gets hit he breaks into pieces.", "start": 529.28, "duration": 2.0}, {"text": "So the very first thing I had to do was I had to erase his head.", "start": 531.46, "duration": 2.76}, {"text": "Now you can kinda see some feathering and some issues around it", "start": 534.64, "duration": 2.08}, {"text": "but once all the other effects are in there", "start": 536.72, "duration": 1.799}, {"text": "you can't tell. So let me put the other effects in there.", "start": 538.519, "duration": 2.309}, {"text": "The next thing I had to do is I had to cut out the guy's head. Then after that animated it to fall down.", "start": 540.828, "duration": 4.652}, {"text": "The last touch here is I need to put in blood splatters.", "start": 545.52, "duration": 2.04}, {"text": "What I'm looking for with the blood here is that it needs to be going in the right direction.", "start": 547.64, "duration": 2.74}, {"text": "So when the shield hits him I need it to splatter out sideways.", "start": 550.4, "duration": 2.62}, {"text": "If I were just to drop that blood in without any effects, this is what it would look like.", "start": 553.1, "duration": 3.2}, {"text": "Totally doesn't match, the color is completely wrong.", "start": 556.36, "duration": 2.06}, {"text": "If you look at the image, the image is kind of all one color and that's because of the smoke and the lighting.", "start": 558.68, "duration": 3.76}, {"text": "So the blood just has to be the same darkness as the guy and it looks great.", "start": 562.44, "duration": 2.9}, {"text": "mwAH", "start": 566.72, "duration": 0.5}, {"text": "And once again, it's not the most sophisticated VFX shot, a pretty simple approach.", "start": 567.42, "duration": 3.5}, {"text": "But I didn't have a lot of time and I'm imagining that a lot of Peter's 3D effects are gonna steal the show anyways.", "start": 570.94, "duration": 4.8}, {"text": "I looked over Peter's shoulder. There's a lot of good stuff he's working on.", "start": 575.94, "duration": 3.76}, {"text": "Just doing some fluid simulations for this blood. Using FLIP fluids, a plugin for Blender, which I like very much.", "start": 580.26, "duration": 5.48}, {"text": "I was having a problem before where the blood was sliding all over the place which isn't too realistic,", "start": 585.74, "duration": 4.46}, {"text": "and FLIP fluids has this nice viscosity feature so I can turn that up a bit and you can see in the next shot here", "start": 590.26, "duration": 5.02}, {"text": "it's sticking to the ground and kind of clumping together a bit more and it's still kind of janky because it's a fluid simulation", "start": 595.3, "duration": 5.58}, {"text": "but it looks just good enough it's pass.", "start": 600.88, "duration": 2.74}, {"text": "Oh, I put bugs on Falcon's face, you know, if you're flying that fast you're gonna get a load of bugs.", "start": 603.9, "duration": 4.4}, {"text": "I decided to do the Falcon head slice here. It was actually similar effects to Brett's head spin in the Keanu video.", "start": 609.32, "duration": 6.84}, {"text": "So we go ahead and paint his head out. We take the original footage and we stabilize the position to his head.", "start": 616.16, "duration": 5.9}, {"text": "So the head spins around its center of gravity. With the sound design this is gonna be so funny.", "start": 622.06, "duration": 4.58}, {"text": "I keep telling Sam and Niko we have to record our own ADR for everybody screaming.", "start": 626.64, "duration": 3.6}, {"text": "We're gonna add some extra screams and kind of take it up a notch as far as audio is concerned.", "start": 630.6, "duration": 4.42}, {"text": "I really think the finishing touch is going to be fixing up the audio here because the visuals are gonna be", "start": 635.12, "duration": 4.92}, {"text": "substantially different so we'll want the sound to match that.", "start": 640.2, "duration": 3.24}, {"text": "We've done this before, you just take the mic and you give it a hundred percent. Just yelling as loud as possible.", "start": 643.6, "duration": 5.1}, {"text": "Okay, sure, I'll just do my best and I'm mhgHmhH", "start": 652.36, "duration": 3.44}, {"text": "AhgGh", "start": 655.8, "duration": 1.02}, {"text": "I'n just gonna wing it.", "start": 656.82, "duration": 0.9}, {"text": "nwAAAhHAHha", "start": 658.38, "duration": 0.84}, {"text": "RharHghhAaa", "start": 659.72, "duration": 1.08}, {"text": "ugRrrhg", "start": 660.8, "duration": 1.0}, {"text": "ᵒᵘᶜʰ", "start": 662.26, "duration": 0.76}, {"text": "aHaHhha", "start": 663.02, "duration": 1.46}, {"text": "NuaHHHah", "start": 664.82, "duration": 0.84}, {"text": "AHHHHhhhₕₕₕₕ", "start": 666.06, "duration": 2.6}, {"text": "ᴏᴜᴄʜ", "start": 669.08, "duration": 0.76}, {"text": "nwWaGgghaaₐₐₐ", "start": 669.94, "duration": 2.64}, {"text": "ᴬᴴ", "start": 672.7, "duration": 0.5}, {"text": "AH", "start": 673.2, "duration": 0.5}, {"text": "ₕₕ", "start": 673.7, "duration": 0.5}, {"text": "AHHH", "start": 674.2, "duration": 0.64}, {"text": "ahHHHHAa", "start": 675.08, "duration": 1.06}, {"text": "ᵃᵃᵃᶜʰʰʰʰ", "start": 676.2, "duration": 1.68}, {"text": "ʸᴬᵘ ʏAᴜ", "start": 677.88, "duration": 0.5}, {"text": "AHHHHHuuAaHheheheEh", "start": 678.38, "duration": 2.26}, {"text": "huWehwEh", "start": 680.64, "duration": 0.5}, {"text": "oWie", "start": 681.14, "duration": 0.78}, {"text": "ᵃᶜʰʰʰʰᶜʰʰʰʰᶜʰʰᶜʰ", "start": 682.02, "duration": 2.0}, {"text": "AHHHHHHHHHH", "start": 684.3, "duration": 1.48}, {"text": "gWrwghRgwhhh", "start": 685.78, "duration": 1.34}, {"text": "ᶜᶜʰʰʰᶜʰʰᵉᴳᵍʰᵍᵍʰʷʰᴜEʜGʜʜɢʜʷʰᵃᵍᵉʰʷʰʰ", "start": 687.2, "duration": 3.04}, {"text": "nwHA", "start": 690.24, "duration": 0.5}, {"text": "AH", "start": 690.74, "duration": 0.5}, {"text": "ouwGhHghbwhbhwbwh", "start": 691.6, "duration": 1.54}, {"text": "See how the stocks crash? Yeah the portfolio's just not", "start": 693.14, "duration": 2.56}, {"text": "what the fhhwd oh shi-", "start": 695.7, "duration": 1.86}, {"text": "uAWHAAwAaᶜʰʰʰʰᶜʰʰᶜʰ", "start": 697.56, "duration": 2.0}, {"text": "Hoᵒᵒ I feel sweaty it's hot in here, but we got some good stuff and it's gonna be disturbing.", "start": 704.5, "duration": 4.58}, {"text": "Dude, this is so brutal.", "start": 711.26, "duration": 3.08}, {"text": "Ahh, it's good, it's good.", "start": 718.76, "duration": 2.0}, {"text": "What do we got?", "start": 723.08, "duration": 0.62}, {"text": "Got sum 'ffects ere", "start": 723.72, "duration": 0.74}, {"text": "Y'all boys wanna watch sum 'ffects?", "start": 724.54, "duration": 1.56}, {"text": "All the shots are finally done. This is my favorite part of any video like this where all the shots finally come together.", "start": 726.1, "duration": 6.74}, {"text": "Now there's a lot of shots in here,", "start": 732.84, "duration": 2.1}, {"text": "and honestly we really have to give it up to Peter because he did a lot of stuff on this.", "start": 734.98, "duration": 4.6}, {"text": "He did multiple effects shots, but he also did the sound design for the whole piece.", "start": 739.58, "duration": 4.0}, {"text": "Guys, where is Peter?", "start": 743.58, "duration": 1.46}, {"text": "ₚₑₐₜₑᵣ", "start": 745.1, "duration": 0.5}, {"text": "ᴘᴇATER", "start": 745.6, "duration": 0.74}, {"text": "ᴏɴᴇ sᴇᴄᴏɴᴅ", "start": 746.34, "duration": 0.72}, {"text": "This is also really really special because", "start": 747.74, "duration": 2.66}, {"text": "this is Peter's last day in the studio this summer after which he has to go back to school and keep learning more things.", "start": 750.56, "duration": 5.94}, {"text": "Goddamit.", "start": 756.62, "duration": 1.14}, {"text": "Here's the original scene for context. Here we go.", "start": 757.8, "duration": 2.0}, {"text": "It's such a great scene still.", "start": 771.94, "duration": 2.0}, {"text": "Dude, iced him.", "start": 777.12, "duration": 1.12}, {"text": "Last part here.", "start": 784.22, "duration": 1.24}, {"text": "I mean it's, this is the beginning of Civil War, right? It's okay.", "start": 788.58, "duration": 3.78}, {"text": "It's a great action scene.", "start": 792.44, "duration": 1.1}, {"text": "Captain America, uh Captain Falcon, whatever their names are.", "start": 793.78, "duration": 3.3}, {"text": "Cap'n Planet, they're all actually super powerful beings, you know whippin' a metal shield at somebody wouldn't just make em go eUwhW and like be all woozy.", "start": 801.94, "duration": 6.96}, {"text": "I'm really curious to see your shots how they turned out, Peter's shots as well.", "start": 809.54, "duration": 3.0}, {"text": "I am a little nervous to hear the sound design because you lose control a little bit", "start": 812.54, "duration": 4.94}, {"text": "you're like it wouldn't be funny if it's even crazier and even more over-the-top, and I'm just hoping that Peter has kept this at a", "start": 817.5, "duration": 4.88}, {"text": "restrained, respectable level that still honors the original action scene.", "start": 822.62, "duration": 3.78}, {"text": "ᵤₘₘ...yeah you guys watch, I'm just gonna...I'll be back.", "start": 826.5, "duration": 2.9}, {"text": "So it's already an incredible scene.", "start": 829.4, "duration": 2.12}, {"text": "Here's", "start": 831.64, "duration": 0.64}, {"text": "what happened", "start": 832.7, "duration": 0.78}, {"text": "to it.", "start": 834.06, "duration": 0.58}, {"text": "Here we go.", "start": 836.78, "duration": 0.64}, {"text": "ᴏʜ sʜɪᴛ", "start": 840.02, "duration": 0.7}, {"text": "AUAGHHHhh", "start": 840.72, "duration": 1.24}, {"text": "AhAaHH", "start": 842.4, "duration": 0.88}, {"text": "AH", "start": 843.7, "duration": 0.64}, {"text": "ᴬᵁᴴ", "start": 844.58, "duration": 0.5}, {"text": "ᴬᴴ", "start": 845.08, "duration": 0.5}, {"text": "ᴬᴼᵂᴴʷʰ", "start": 845.7, "duration": 0.76}, {"text": "nwhAUh", "start": 847.76, "duration": 0.76}, {"text": "AGHh", "start": 848.52, "duration": 0.5}, {"text": "ᵃᵘʰᵃᴴʰᵃ", "start": 857.84, "duration": 0.56}, {"text": "ᵍᵃʰ", "start": 860.8, "duration": 0.5}, {"text": "AHHh", "start": 861.36, "duration": 0.82}, {"text": "ᵒ ᵇᵒᶦ", "start": 866.8, "duration": 0.5}, {"text": "ᴬᴳᴴHH", "start": 867.3, "duration": 1.06}, {"text": "ᴬᴳᴴHHᴴᴴ", "start": 871.36, "duration": 1.42}, {"text": "ᵐʸ ᵇᵃᶜᵏ", "start": 872.78, "duration": 1.06}, {"text": "ᵘʷᴬʰʰᴬᵃᵃHhh", "start": 875.68, "duration": 1.36}, {"text": "ᴡᴀHhʰʰʰ", "start": 879.22, "duration": 1.26}, {"text": "ᴜʜᴀᴡʜ", "start": 880.78, "duration": 0.72}, {"text": "ᵍᵂᴬʰ", "start": 881.5, "duration": 0.5}, {"text": "Holy shit, wow.", "start": 883.44, "duration": 2.14}, {"text": "ᵒʰ ᵐʸ ᴳᵒᵈ", "start": 886.9, "duration": 1.06}, {"text": "ᵘⁿᵍʰʰ", "start": 888.64, "duration": 0.5}, {"text": "ɢᴡAUHᴀʜ", "start": 889.78, "duration": 1.2}, {"text": "ᵃʰᵉᵘᵃʰʷʰᵃ", "start": 893.68, "duration": 2.06}, {"text": "ʜɢʜᴡᴀʜɢᴀA", "start": 898.56, "duration": 1.02}, {"text": "ᴀHHʜɢᴡAʜᴇʜEʜᴡᴇ", "start": 899.6, "duration": 2.0}, {"text": "Wow, that was great. That was so good. Can you guys guess whose screams are whose?", "start": 903.42, "duration": 5.98}, {"text": "Alright, so Sam was obviously the first one.", "start": 910.42, "duration": 2.0}, {"text": "I see this guy flyin' down outta the sky", "start": 915.04, "duration": 2.64}, {"text": "That's- That was me", "start": 917.68, "duration": 2.24}, {"text": "Oh that was you!", "start": 920.0, "duration": 0.68}, {"text": "The bugs in the face was so good. That's why he's wearing goggles.", "start": 922.34, "duration": 3.08}, {"text": "I just hear the wet slaps like", "start": 926.52, "duration": 1.28}, {"text": "ᵐʷᵘᵒᵖ ᵐʷᵘᵒᵖʰ ᵐʷᵘᵒᵖʰ ᵐʷᵘᵒᵖʰ ᵐʷᵘᵒᵖ ᵐʷᵘᵒᵖʰ", "start": 927.8, "duration": 1.52}, {"text": "ʷᵒᵒᵒᴼᴼᴼOOO", "start": 930.04, "duration": 1.4}, {"text": "That's a hot clip!", "start": 931.5, "duration": 1.64}, {"text": "That was so tasteful and respectful.", "start": 933.14, "duration": 2.82}, {"text": "It's almost like all that vicarious like, cathartic violence you see in John Wick.", "start": 936.3, "duration": 3.959}, {"text": "I would really enjoy a movie doing things like that. I could totally watch an hour and half of that", "start": 940.259, "duration": 4.559}, {"text": "How will we do without Peter? I don't know 'cause he brings this like glee to it all.", "start": 944.82, "duration": 4.38}, {"text": "ᴏᴏᴏʜ", "start": 949.52, "duration": 0.5}, {"text": "I'm gonna have to like step up and try to channel my inner Peter.", "start": 950.24, "duration": 3.219}, {"text": "This was really fun to do and if you guys can think of any other really cool scenes in Marvel movies that we should make Rated R,", "start": 953.46, "duration": 5.14}, {"text": "let us know in the comments below and we might just take a crack at it.", "start": 958.6, "duration": 2.62}, {"text": "Also consider subscribing so you don't miss it.", "start": 961.22, "duration": 1.9}, {"text": "Aw school, dude. I'm out of here dude. Corridor sucks, dawg.", "start": 963.14, "duration": 3.64}, {"text": "So we just happened to be working on making the specific Marvel scene R-Rated and it turns out that one of the stunt", "start": 968.14, "duration": 7.02}, {"text": "performers randomly here on the same day, we're making the scene he's in R-Rated.", "start": 975.18, "duration": 3.8}, {"text": "Yeah, what's up guys?", "start": 978.98, "duration": 1.14}, {"text": "My first stunt gig ever was the elevator fight scene in Captain America: Winter Soldier.", "start": 980.12, "duration": 4.1}, {"text": "So they pulled me along through the journey. Civil War, I'm a Rumlow agent. Cap jumps in catches us off guard,", "start": 986.04, "duration": 4.66}, {"text": "There's Victim #1, me.", "start": 990.76, "duration": 1.54}, {"text": "He just rips my mask off and then back kicks me through the door. It was a good time.", "start": 993.58, "duration": 3.56}, {"text": "Oooh", "start": 1002.14, "duration": 1.0}, {"text": "Yo", "start": 1008.14, "duration": 0.5}, {"text": "Yeah he's dead", "start": 1010.2, "duration": 0.76}, {"text": "Ohhh, with the wings?", "start": 1013.72, "duration": 1.64}, {"text": "Oh he's gonna kick me in half, kick me in half.", "start": 1024.3, "duration": 2.48}, {"text": "YES", "start": 1028.14, "duration": 0.54}, {"text": "Aw James, dead", "start": 1033.96, "duration": 1.46}, {"text": "Yeah, he's dead. That is *SUBSCRIBE* sick.", "start": 1040.3, "duration": 2.66}, {"text": "DAMN man", "start": 1043.38, "duration": 1.34}, {"text": "I replaced your voice we'll have to rerecord you.", "start": 1045.56, "duration": 2.0}, {"text": "Yeah, we should. I'm down let's go. This is me getting immortalized in the Corridor Digital fam. Go for it.", "start": 1047.74, "duration": 5.7}, {"text": "ᵘⁿᴺᵍʰᵘᴴʰ", "start": 1053.88, "duration": 0.86}, {"text": "ᵍʰ", "start": 1054.8, "duration": 0.5}, {"text": "ʜᴜAHHHWAᴜAʜᴜUHᴀ", "start": 1055.3, "duration": 1.9}, {"text": "Perfect, amazing. *SUBSCRIBE* yeah, woo.", "start": 1059.96, "duration": 3.68}, {"text": "Yo, pleasure.", "start": 1064.24, "duration": 1.72}, {"text": "*Song: Cᴏʟᴀ ʙʏ Pᴇᴛᴇʀ Fʀᴀɴᴄᴇ & Gʟᴀᴍ Cᴏᴡɢɪʀʟ*", "start": 1070.54, "duration": 19.7}, {"text": "If you're watching this I'm already gone. Up to a place up north a better place.", "start": 1091.34, "duration": 4.659}, {"text": "I thought before I left I would make you guys one last goof.", "start": 1095.999, "duration": 3.18}, {"text": "Just to remember me by, you know me, always making those goofs. Maybe you can save it to your desktop and watch it every day.", "start": 1099.24, "duration": 6.44}, {"text": "Hopefully you enjoyed this video I also make music.", "start": 1136.26, "duration": 2.6}, {"text": "So this is a shameless plug for that too, under Peter France on Spotify or whatever streaming service.", "start": 1138.86, "duration": 5.2}, {"text": "See you on the other side.", "start": 1144.26, "duration": 1.0}]