[{"text": "It is the beginning of August of the year 378.", "start": 0.0, "duration": 3.44}, {"text": "For the last two months Flavius Julius Valens, Roman emperor of the East,", "start": 3.82, "duration": 4.3}, {"text": "patiently awaits reinforcements for his imperial troops stationed but a few kilometres from Constantinople.", "start": 8.36, "duration": 6.74}, {"text": "With the promised aid of his western counterpart, Valens hoped to finally put down the Gothic revolt", "start": 15.1, "duration": 5.54}, {"text": "that had been raging in the region for the last two years.", "start": 20.74, "duration": 2.98}, {"text": "But none could expect that the impending finale of the Roman peacekeeping campaign", "start": 23.96, "duration": 4.8}, {"text": "would soon become one of the most significant battles of late antiquity.", "start": 28.76, "duration": 5.32}, {"text": "Like the empires of antiquity, we at the channel, are looking to expand.", "start": 35.02, "duration": 3.66}, {"text": "But to do this we need allies and support. Your support!", "start": 38.94, "duration": 3.54}, {"text": "Today’s video is sponsored by our newest ally, Art of Conquest.", "start": 42.48, "duration": 4.1}, {"text": "Art of Conquest is a free to play mobile strategy game", "start": 46.58, "duration": 2.92}, {"text": "focusing on real-time multi-player pvp granting you, full control.", "start": 49.5, "duration": 4.32}, {"text": "If you’re into in-depth tactical gameplay, building on social teamwork to conquer vast kingdoms controlled by other players,", "start": 53.92, "duration": 6.5}, {"text": "then you should definitely check out, Art of Conquest.", "start": 60.54, "duration": 2.72}, {"text": "With hundreds of different units, dozens of heroes and a battle system that constantly evolves,", "start": 63.42, "duration": 4.84}, {"text": "no conflict is ever the same as you directly control the outcome.", "start": 68.3, "duration": 3.64}, {"text": "Click on the link in the description below from your mobile device,", "start": 72.1, "duration": 3.8}, {"text": "support our channel and play the epic, Art of Conquest: War with no limits!", "start": 75.9, "duration": 5.36}, {"text": "It’s the year 371. The vast Roman Empire, though still a prominent power of late antiquity is already past its prime,", "start": 86.08, "duration": 8.36}, {"text": "and struggles to defend its borders against the rising pressure of both the Persian Sassanid dynasty and various barbarian tribes.", "start": 94.44, "duration": 7.74}, {"text": "For the last several years, the empire was led by the seasoned commander, Valentinian the Great, a rough yet effective ruler,", "start": 102.46, "duration": 7.9}, {"text": "who upon his election in 364 had to face the common view that such a broad and unwieldy state", "start": 110.36, "duration": 7.18}, {"text": "needed two Augusti to handle the empire’s administration, military and civil affairs.", "start": 117.54, "duration": 6.22}, {"text": "Thus Valentinian was essentially compelled to pick an overseer of the eastern part of the empire,", "start": 123.96, "duration": 6.16}, {"text": "and unsurprisingly, he had chosen his undistinguished younger brother – Flavius Julius Valens,", "start": 130.34, "duration": 6.04}, {"text": "who shortly became the imperial authority to the East.", "start": 136.52, "duration": 3.22}, {"text": "Certainly, appointing Valens wasn’t the best choice, as he simply lacked the necessary qualities and experience to become an emperor,", "start": 140.02, "duration": 8.7}, {"text": "but Valentinian seemed to value Valens’ loyalty which at least gave hope to maintaining the empire’s integrity.", "start": 148.92, "duration": 8.02}, {"text": "Soon after his accession, Valens had to face a revolt under Procopius,", "start": 157.68, "duration": 4.82}, {"text": "who bribed a couple of legions and proclaimed himself as emperor in Constantinople.", "start": 163.0, "duration": 4.86}, {"text": "Valens revealed his timid demeanour when upon hearing the news, considered abdication and even possibly committing suicide.", "start": 168.14, "duration": 7.72}, {"text": "But he was quickly sobered by his generals and loyalist forces cracked down on the rebellion.", "start": 176.12, "duration": 5.14}, {"text": "Following which, Valens had Procopius executed.", "start": 181.26, "duration": 3.96}, {"text": "Though it took some time to clean up the mess of the recent revolt", "start": 185.3, "duration": 4.04}, {"text": "and deal with the Gothic troops which were called to support Procopius’ insurrection", "start": 189.34, "duration": 4.64}, {"text": "(being late for the party and ravaging the Thracian countryside instead)", "start": 193.98, "duration": 4.26}, {"text": "Valens gained some acclaim thanks to the moderately successful Gothic campaign north of the Danube", "start": 198.24, "duration": 6.14}, {"text": "and his attempts to improve Rome’s position against the Sassanid Empire.", "start": 204.38, "duration": 4.0}, {"text": "In fact, since 370 he spent most of his days as Augustus on the Eastern frontier,", "start": 208.38, "duration": 6.38}, {"text": "and by the year 375 was sketching out a major campaign against the Persians.", "start": 214.76, "duration": 5.94}, {"text": "But Valens’ eastern expedition never came to fruition.", "start": 220.88, "duration": 3.6}, {"text": "In summer of the year 376 a large Gothic group led by a chieftain named Fritigern arrived at the northern bank of the Danube", "start": 224.98, "duration": 9.06}, {"text": "and requested permission to settle inside the Empire.", "start": 234.22, "duration": 3.42}, {"text": "In the 4th century the Gothic people were inhabiting lands north and west of the Black Sea,", "start": 237.78, "duration": 5.62}, {"text": "but during the reign of Valens they were already hard pressed by the expanding Hunnic tribes,", "start": 243.52, "duration": 5.52}, {"text": "and forced to either fall under Hunnic control or to migrate south, eventually reaching the line of the Danube.", "start": 249.2, "duration": 6.82}, {"text": "Valens, at the time was gathering troops in Antioch for the upcoming Persian campaign,", "start": 256.02, "duration": 5.54}, {"text": "and upon learning of Fritigern’s request, saw this more as a potential threat than an opportunity.", "start": 261.56, "duration": 6.04}, {"text": "Some of Valens’ legions were busy in the western part of the Empire,", "start": 267.72, "duration": 3.54}, {"text": "and the bulk of his mobile comitatenses units under Valens’ command were deeply embroiled in the eastern front.", "start": 271.26, "duration": 6.48}, {"text": "This meant, that the local governor of Thracia, comes Lupicinus", "start": 278.12, "duration": 4.4}, {"text": "had just a few thousand border limitanei troops at his command to supervise the migration.", "start": 282.52, "duration": 5.76}, {"text": "It was clear to Valens, that such a force was not sufficient to stop the Goths from crossing the river", "start": 288.6, "duration": 5.84}, {"text": "and with the majority of his forces already occupied; he seemingly had little choice than to give them permission to pass.", "start": 294.44, "duration": 7.24}, {"text": "Lupicinus was certainly not in a favourable position,", "start": 302.1, "duration": 3.22}, {"text": "as Fritigern’s group was far larger than expected, and additional Gothic parties crossed the river without permission.", "start": 305.38, "duration": 7.48}, {"text": "Barbarian migrations in general weren’t really a novelty for the Romans", "start": 313.14, "duration": 4.4}, {"text": "as they faced similar problems multiple times in the past,", "start": 317.62, "duration": 3.58}, {"text": "but in this instance, not only was the Gothic band a numerous one,", "start": 321.2, "duration": 4.48}, {"text": "but also the Roman governor simply lacked the manpower and resources", "start": 325.68, "duration": 4.92}, {"text": "to properly handle this potentially dangerous situation.", "start": 330.6, "duration": 4.32}, {"text": "Matters worsened for the Romans as they failed to properly disarm the migrating Goths during their crossing", "start": 334.92, "duration": 6.86}, {"text": "and with not enough food for the influx of refugees, malcontent started to spread.", "start": 341.78, "duration": 5.68}, {"text": "To counter this, Lupicinus pulled troops from the Danubian border", "start": 347.78, "duration": 4.42}, {"text": "to relocate the Goths to the Roman regional headquarters of Marcianople.", "start": 352.2, "duration": 4.96}, {"text": "But all this accomplished was allowing even more unchecked Greuthungi Gothic bands to cross the river", "start": 357.52, "duration": 6.38}, {"text": "and join the swelling number of immigrants.", "start": 363.9, "duration": 2.42}, {"text": "With the Greuthungi joining Fritigern’s Thervingi Goths and adding their voice to the outcry of Roman mistreatment and lack of food,", "start": 366.68, "duration": 7.84}, {"text": "Lupicinus tried an age-old yet poorly conceived manoeuvre.", "start": 374.64, "duration": 4.56}, {"text": "He invited the Thevingi leaders, including Fritigern to a feast and promptly seized them hoping to cut off the head of the now rebellious Goths.", "start": 379.38, "duration": 10.02}, {"text": "This however failed to quell the Goths as news spread that Fritigern had been killed by the Romans.", "start": 389.74, "duration": 6.78}, {"text": "Immediately, his kin made preparations to storm the city of Marcianople.", "start": 396.7, "duration": 5.36}, {"text": "Seeing that an attack was imminent, Lupicinus wavered and released Fritigern.", "start": 402.2, "duration": 5.2}, {"text": "But all this accomplished was open conflict", "start": 407.72, "duration": 2.78}, {"text": "as the Gothic leader now realised just how tenuous the Roman position was in the region.", "start": 410.62, "duration": 6.32}, {"text": "With his people starving, Fritigern led the Goths away from Marcianople in search of food and much needed supplies.", "start": 417.42, "duration": 7.48}, {"text": "In a last ditch effort to crush the rebellion, Lupicinus mustered his troops.", "start": 425.1, "duration": 4.76}, {"text": "But the ensuing battle spelt disaster for the Romans.", "start": 430.0, "duration": 3.42}, {"text": "The far more numerous Gothic troops overran the Lupicinus’ forces and more than half of his men were killed.", "start": 433.76, "duration": 7.06}, {"text": "Although Lupicinus survived by fleeing the massacre,", "start": 440.82, "duration": 3.02}, {"text": "this defeat meant that the Roman Empire now faced a serious problem within its borders", "start": 443.84, "duration": 6.64}, {"text": "thousands of starving Goths uncontrollably ravaging the Thracian countryside.", "start": 450.48, "duration": 5.6}, {"text": "Upon hearing the disastrous news, Valens had no other choice than to quickly conclude peace with the Sassanids", "start": 456.46, "duration": 7.9}, {"text": "and move his legions back to Thracia.", "start": 464.36, "duration": 3.08}, {"text": "This didn’t happen in the blink of an eye,", "start": 467.72, "duration": 1.88}, {"text": "as he had to make sure that the Persians would not attack the Roman eastern flank having been abruptly stripped of its defences.", "start": 469.6, "duration": 7.54}, {"text": "Valens also requested help from his western counterpart – emperor Gratian, son of the recently deceased Valentinian.", "start": 477.28, "duration": 8.56}, {"text": "Meanwhile, the Thracian countryside was set ablaze by the Goths.", "start": 485.96, "duration": 4.44}, {"text": "Those who were fortunate enough, sought refuge within walled cities,", "start": 490.54, "duration": 3.74}, {"text": "which were relatively safe, as Fritigern had no means to besiege walled towns and settlements.", "start": 494.28, "duration": 5.72}, {"text": "His numbers though, constantly rose, as various Gothic groups one by one joined the charismatic leader,", "start": 500.32, "duration": 6.46}, {"text": "who actually cared for the fate of his people.", "start": 506.78, "duration": 3.1}, {"text": "Following the defeat of Lupicinus’ contingent, Fritigern’s men gained some decent equipment and at last were well fed.", "start": 509.98, "duration": 7.98}, {"text": "Hastily assembled units from both parts of the empire attempted to contain the Gothic revolt from spreading throughout the year 377.", "start": 518.4, "duration": 8.64}, {"text": "But only one major, yet indecisive encounter occurred during that time.", "start": 527.04, "duration": 5.32}, {"text": "It was not until the following year, that the Gothic incursion came to its final culmination.", "start": 532.44, "duration": 6.1}, {"text": "Emperor Valens arrived with most of his troops in Constantinople at the end of May 378", "start": 538.88, "duration": 6.1}, {"text": "and soon set a camp to the west, waiting for Gratian’s reinforcements.", "start": 545.36, "duration": 4.44}, {"text": "In an attempt to bolster the morale of his army Valens gave rousing speeches", "start": 549.94, "duration": 4.88}, {"text": "and made sure that his soldiers were well paid and supplied.", "start": 554.82, "duration": 3.98}, {"text": "But two summer months passed by, and there was no sign of the western army,", "start": 559.0, "duration": 4.42}, {"text": "and the Goths were still on the loose pillaging the countryside.", "start": 563.58, "duration": 3.36}, {"text": "Yet Valens was patient.", "start": 566.94, "duration": 1.82}, {"text": "In the beginning of August a letter from Gratian arrived detailing the young emperor’s victories on the Rhine", "start": 569.5, "duration": 6.38}, {"text": "and that he was already on the move to help his uncle.", "start": 575.88, "duration": 3.34}, {"text": "But Valens’ patience was vanishing, as his troops were becoming restless", "start": 579.22, "duration": 4.7}, {"text": "and a good part of the campaigning season was already behind him.", "start": 583.92, "duration": 3.92}, {"text": "Moreover he received reports that the Gothic army moving slowly towards the city of Adrianople", "start": 588.28, "duration": 6.52}, {"text": "counted about 10,000 men, substantially fewer than what Valens was expecting.", "start": 594.8, "duration": 6.06}, {"text": "This made him indecisive. His generals were divided as some advised caution while others urged boldness.", "start": 601.08, "duration": 8.1}, {"text": "It was indeed a good opportunity to gain immense popularity which would surely help Valens in his later reign,", "start": 609.44, "duration": 6.9}, {"text": "and he eventually yielded to his flattering courtiers, who urged him to make all haste,", "start": 616.62, "duration": 5.52}, {"text": "so that Gratian would not share in the victory which, as they assured, was already all but won.", "start": 622.14, "duration": 6.98}, {"text": "Trumpets sounded the advance of the imperial army marching towards Adrianople.", "start": 629.34, "duration": 5.04}, {"text": "A marching camp was constructed outside the city", "start": 634.64, "duration": 2.9}, {"text": "and Valens’ units moved about fifteen kilometres north, where the Goths were camping.", "start": 637.54, "duration": 5.56}, {"text": "Fritigern saw the Roman advance and made every attempt to delay the battle.", "start": 643.16, "duration": 4.7}, {"text": "He sent multiple groups of peace envoys and attempted to exchange hostages in order to slow Valens’ advance.", "start": 647.96, "duration": 7.54}, {"text": "Eventually, around noon of the 9th of August,", "start": 655.62, "duration": 3.34}, {"text": "the Roman force arrived in the vicinity of the Gothic camp and began deployment.", "start": 658.96, "duration": 5.38}, {"text": "Fritigern had set a largely defensive stance,", "start": 664.6, "duration": 2.92}, {"text": "using baggage carts to form a wagon fort along the hill guarded by Gothic infantry.", "start": 667.52, "duration": 6.08}, {"text": "His number of fighting men were more or less what Valens expected,", "start": 673.6, "duration": 4.24}, {"text": "but considering the mass of Gothic women and children hiding behind in the camp,", "start": 677.84, "duration": 4.54}, {"text": "it certainly looked more numerous than it was.", "start": 682.38, "duration": 3.22}, {"text": "As it was a hot day and the Roman forces spent the entire morning marching to the battlefield,", "start": 685.6, "duration": 4.98}, {"text": "Fritigern decided to make use of favourable wind conditions and set flames to the grasses,", "start": 690.58, "duration": 6.06}, {"text": "hoping that the fire and smoke would further decrease Roman endurance.", "start": 696.64, "duration": 4.7}, {"text": "Valens, who had around 20,000 men at his disposal, was still being harassed by Gothic envoys sent by Fritigern,", "start": 701.54, "duration": 7.66}, {"text": "when some of his mounted units on the right flank, without having been ordered to do so,", "start": 709.2, "duration": 5.42}, {"text": "surged forward and began skirmishing with the Goths.", "start": 714.62, "duration": 3.54}, {"text": "Seeing this, the cavalry of the other flank yearning for battle after months of waiting", "start": 718.34, "duration": 5.6}, {"text": "also rushed forward and engaged Fritigern’s infantry on the hill.", "start": 723.94, "duration": 4.68}, {"text": "The bulk of the heavy Roman infantry in the centre also moved forward to attack the Gothic centre.", "start": 728.72, "duration": 6.22}, {"text": "Battle raged. Roman cavalry on the right flank was pushed back,", "start": 735.12, "duration": 4.54}, {"text": "but mounted men on the other side managed to push the Gothic infantry straight into the wagon line,", "start": 739.66, "duration": 5.44}, {"text": "killing many defenders in the process.", "start": 745.1, "duration": 2.46}, {"text": "The struggle in the centre seemed to be even, at least in the beginning.", "start": 747.56, "duration": 4.4}, {"text": "Tightly packed Roman heavy infantry had a tough time", "start": 752.1, "duration": 3.72}, {"text": "trying to overcome the fierce Thervingi warriors led by Fritigern.", "start": 755.82, "duration": 5.0}, {"text": "Eventually, after some hours since the battle ensued,", "start": 761.28, "duration": 3.52}, {"text": "Valens realised why Fritigern was so eager to send multiple parleying offers and thus buy time.", "start": 764.8, "duration": 7.44}, {"text": "Several thousand Greuthungi and Alan cavalrymen had answered Fritigern’s call for aid and arrived on the battlefield,", "start": 772.48, "duration": 7.4}, {"text": "dashing towards the surprised Roman mounted troops fighting on both flanks.", "start": 779.88, "duration": 5.18}, {"text": "In a matter of minutes, Valens’ flanks were overwhelmed and routed from the battlefield,", "start": 785.46, "duration": 4.82}, {"text": "leaving the heavy corpus of the army isolated in the centre.", "start": 790.44, "duration": 4.18}, {"text": "The battle was certainly far from over, but the Romans were at a severe tactical disadvantage,", "start": 794.7, "duration": 5.7}, {"text": "soon facing full encirclement by the Gothic forces.", "start": 800.58, "duration": 3.4}, {"text": "It wasn’t an easy task for lightly armored Goths to crush well-disciplined and heavily equipped Roman legionnaires.", "start": 804.48, "duration": 6.6}, {"text": "The battle lasted until evening. Valens was aware, that there was no way out of this disastrous situation", "start": 811.58, "duration": 6.56}, {"text": "and only a miracle could save his army from destruction.", "start": 818.28, "duration": 3.7}, {"text": "But that miracle never occurred, and after eight hours of bloody struggle,", "start": 821.98, "duration": 5.3}, {"text": "the majority of the Eastern Roman army lay dead on the battlefield.", "start": 827.28, "duration": 4.42}, {"text": "Only about a third was able to escape the slaughter during the final phase of the battle.", "start": 831.7, "duration": 6.34}, {"text": "The body of the emperor was never found.", "start": 838.3, "duration": 2.38}, {"text": "Not only was Valens killed, by many of his generals, officers and even mid-level officials perished near Adrianople.", "start": 840.68, "duration": 8.42}, {"text": "It was a massive blow for the Roman state and one of the biggest defeats in Roman military history.", "start": 849.38, "duration": 6.14}, {"text": "As a result of Valens’ failed gamble, the Gothic revolt lasted for four more years,", "start": 855.72, "duration": 5.74}, {"text": "greatly weakening the already strained empire.", "start": 861.46, "duration": 3.44}, {"text": "Eventually, the barbarian threat in the Balkans was temporarily contained by Valens’ successor Theodosius,", "start": 864.9, "duration": 7.7}, {"text": "but that is a completely different story.", "start": 872.6, "duration": 4.06}]