[{"text": "Let me tell you a story it's a murder mystery it's a human drama", "start": 0.06, "duration": 4.799}, {"text": "But it's also the most famous game theory problem ever proposed", "start": 5.109, "duration": 3.319}, {"text": "Big thanks to Nord VPN for sponsoring this episode", "start": 14.32, "duration": 2.6}, {"text": "Start protecting your internet experience today with seventy five percent off a three year plan and one month free when you use the code extra", "start": 17.369, "duration": 6.78}, {"text": "credits at the link below", "start": 24.15, "duration": 0.5}, {"text": "A call comes in to the station. There's been a murder the police rush out to the scene", "start": 28.09, "duration": 4.43}, {"text": "The scene's clean no prints, no weapons, no leads. it's time to round up the usual suspects and see who talks", "start": 34.94, "duration": 7.22}, {"text": "Word on the street is that Alice two guns McKenzie and Bob the knife Stefano did the deed?", "start": 44.809, "duration": 4.91}, {"text": "Everyone knows it, but no one's willing to go on record and help us make the case", "start": 50.15, "duration": 3.589}, {"text": "So it's time to bring in the suspects and see if we can get one of them to flip", "start": 53.93, "duration": 3.799}, {"text": "Alice and Bob or as our files refer to them a and B are in two separate holding cells. The detectives are pressing them", "start": 60.409, "duration": 7.4}, {"text": "They both have outstanding warrants for minor crimes", "start": 67.81, "duration": 2.37}, {"text": "So if neither of them talk they're both going to still get a year in the slammer", "start": 70.31, "duration": 3.319}, {"text": "But the cops don't want that. They need a conviction", "start": 74.02, "duration": 3.03}, {"text": "So they offer both a and B the same deal if they rat out the other one", "start": 77.21, "duration": 4.489}, {"text": "Then the one who did the squawkin gets to do the walkin no jail time and old warrants swept under the rug", "start": 81.7, "duration": 5.55}, {"text": "But a and B know that if they both blame one another the cops are just going to call them both", "start": 87.47, "duration": 5.389}, {"text": "Accessories to the murder and they're each going to get 10 years upstate", "start": 93.05, "duration": 2.869}, {"text": "They have no way to communicate with each other and they're told they have an hour to decide", "start": 96.289, "duration": 4.46}, {"text": "Time's up what do A and B do now assuming that there's no later repercussions like getting whacked for being a snitch", "start": 103.56, "duration": 6.889}, {"text": "There's actually only one rational course of action here", "start": 110.64, "duration": 2.99}, {"text": "But the reason this problem is so interesting is that that course of action is bad for everyone and it's why the prisoner's dilemma", "start": 113.63, "duration": 6.959}, {"text": "serves to provide us with an understanding of why so often as a", "start": 120.78, "duration": 3.65}, {"text": "Species or as a group we'll all agree that a particular course of action is bad and get proceed to do it", "start": 124.71, "duration": 5.569}, {"text": "Anyway, how well let's look at the prisoner's dilemma more closely", "start": 130.28, "duration": 3.48}, {"text": "You can think of it as a 2x2 grid with participants, choices, and outcomes", "start": 133.76, "duration": 4.5}, {"text": "So as you can see here", "start": 138.51, "duration": 1.43}, {"text": "if a turns over b and b", "start": 139.94, "duration": 1.93}, {"text": "Stays silent a gets to walk out free and B gets a lifetime in jail", "start": 141.87, "duration": 4.279}, {"text": "If a stays silent and B turns over a then a gets a lifetime in jail and B gets to walk free", "start": 146.15, "duration": 6.0}, {"text": "If they both rat each other out though, they both spend 10 years in prison", "start": 152.4, "duration": 4.16}, {"text": "And if both stay silent they both get off with only one year in jail", "start": 156.56, "duration": 4.38}, {"text": "So what's the best option for the two of them to both stay?", "start": 161.22, "duration": 3.889}, {"text": "Silent if they did that they'd serve a sum of 2 years total, but what's the best option for either of them individually?", "start": 165.24, "duration": 7.55}, {"text": "Clearly to turn state's evidence because in this situation it's the choice", "start": 173.73, "duration": 4.069}, {"text": "You'll never regret if your partners stay silent and you give up the goods on them", "start": 177.8, "duration": 3.99}, {"text": "You get to walk away free, but if your partner tries to pin the murder on you, well at least this way", "start": 181.79, "duration": 5.549}, {"text": "You're only going to be serving 10 years instead of a life sentence", "start": 187.34, "duration": 3.48}, {"text": "If both players are playing optimally for themselves, then the only logical choice is to blame the other person", "start": 190.95, "duration": 6.02}, {"text": "in fact", "start": 196.97, "duration": 0.81}, {"text": "the only outcome where neither", "start": 197.78, "duration": 1.72}, {"text": "Participant regrets their decision or feels as though they should have done something else when both players decisions are revealed is both a and B", "start": 199.5, "duration": 6.589}, {"text": "blame each other", "start": 206.1, "duration": 1.32}, {"text": "This is called a Nash equilibrium and it's something we might talk about in detail some other day", "start": 207.42, "duration": 4.25}, {"text": "But you can see that outcome is actually terrible even though it's the only rational choice from each individual players perspective", "start": 211.67, "duration": 6.84}, {"text": "This behavior comes into play all the time in teamwork based games ever play a mobo where one player hogs all the kills", "start": 218.76, "duration": 6.649}, {"text": "This is why or if you've ever been in a game where one of the DPS characters spams", "start": 225.48, "duration": 4.609}, {"text": "I need a shilling when it's clear", "start": 230.09, "duration": 2.22}, {"text": "You should be healing the tank the root of that behavior can be found here, too", "start": 232.31, "duration": 3.839}, {"text": "but nowhere is this clearer than in the real world and a great example of this is as a group the", "start": 236.46, "duration": 5.209}, {"text": "overwhelming majority of nations agree", "start": 241.98, "duration": 1.97}, {"text": "It would be best for the world if we banded together and did something about climate change", "start": 243.95, "duration": 3.99}, {"text": "But let's look at that decision grid for any individual country", "start": 248.31, "duration": 3.199}, {"text": "Your country can either opt in to lower its carbon output and pay for research or not", "start": 251.85, "duration": 4.489}, {"text": "If you do and the rest of the world does not then you're baring the majority of the cost", "start": 256.44, "duration": 4.85}, {"text": "your economy is weaker for not exploiting fossil fuels and climate change still isn't solved because it required a group effort if", "start": 261.45, "duration": 6.169}, {"text": "you don't and the rest of the world does everyone else is left shouldering the cost of fighting climate change while you", "start": 267.81, "duration": 6.17}, {"text": "Still get to reap your oily rewards if you and everyone else decide to actually fight climate change", "start": 274.14, "duration": 5.179}, {"text": "Well, then you had to bear some of the costs but climate change might actually get solved and finally", "start": 279.71, "duration": 5.369}, {"text": "Let's say you nor any other country tries to do anything at all", "start": 285.08, "duration": 3.87}, {"text": "Well, at least you didn't have to pay any cost for trying so with all that in mind", "start": 289.05, "duration": 4.16}, {"text": "What's the only rational answer from an individual actors perspective to not try?", "start": 293.34, "duration": 5.269}, {"text": "Of course, this is terrible reasoning and it shows the fundamental problem with the prisoner's dilemma", "start": 298.61, "duration": 5.52}, {"text": "It's not actually how real-world problems work. It's a simplification that ends up leaving out a lot", "start": 304.35, "duration": 5.389}, {"text": "I mean on the positive side", "start": 309.74, "duration": 1.51}, {"text": "There's all sorts of ancillary benefits to getting off fossil fuels or developing alternative energy technologies or if Alice rats out", "start": 311.25, "duration": 7.549}, {"text": "Bob she's going to have to watch her back for the rest of her life, which is a pretty big negative", "start": 318.8, "duration": 4.77}, {"text": "Unfortunately people in real-life situations do often think in terms of the prisoner's dilemma", "start": 324.15, "duration": 4.22}, {"text": "Especially when those individuals involved are actually large bureaucratic organizations like governments or corporations", "start": 328.979, "duration": 6.08}, {"text": "Which leads us to a world where individual actors are?", "start": 335.49, "duration": 3.44}, {"text": "Continuously making decisions that appear to be the right one for them that really end up being worse for everyone", "start": 339.27, "duration": 5.99}, {"text": "themselves included but with all that said we can actually end this episode on a positive note because a large number of", "start": 345.99, "duration": 6.14}, {"text": "psychological studies have shown that at least when dealing with each other as active individuals as", "start": 352.38, "duration": 4.91}, {"text": "Specific human beings where we know other human beings welfare are at stake. We tend to choose cooperation", "start": 357.51, "duration": 5.839}, {"text": "Perhaps it's an evolutionary holdover. Perhaps it's out of some sense of fairness or community, but we do often opt to work together", "start": 363.57, "duration": 6.72}, {"text": "Well beyond the bounds of any statistical noise, so in the spirit of that", "start": 370.48, "duration": 4.429}, {"text": "Please don't be an Alice or a Bob or even a bad Genji because sometimes the best possible outcome requires a decision", "start": 374.98, "duration": 6.889}, {"text": "That doesn't seem best for you. We'll see you next week", "start": 381.87, "duration": 3.149}, {"text": "once again", "start": 385.99, "duration": 0.78}, {"text": "Thanks so much to Nord VPN for sponsoring this episode and solving my personal dilemma of how to protect my information online", "start": 386.77, "duration": 5.93}, {"text": "Nord doesn't log and keep your data which means it's not being saved and shared with big brother plus they use military-grade encryption have", "start": 393.04, "duration": 7.489}, {"text": "24/7 customer support and use thousands of servers across", "start": 400.78, "duration": 3.08}, {"text": "60 countries one of which our internet overlords think I've logged in from right now", "start": 404.05, "duration": 4.85}, {"text": "[laugh]", "start": 408.9, "duration": 1.33}, {"text": "start protecting your internet experience today with", "start": 410.23, "duration": 2.59}, {"text": "75% off a three-year plan and one month free by using the code extra credits at the link below", "start": 412.96, "duration": 5.6}, {"text": "Subtitles by Dylan Miller", "start": 420.04, "duration": 13.82}]