[{"text": "Thank you to LastPass for sponsoring PBS Digital Studios", "start": 0.02, "duration": 3.16}, {"text": "Our universe started with the Big Bang.", "start": 3.4, "duration": 2.52}, {"text": "But only for the right definition of our universe", "start": 5.92, "duration": 3.22}, {"text": "and", "start": 9.62, "duration": 0.5}, {"text": "\"started\" for that matter. In fact, the Big Bang is probably nothing like what you were taught.", "start": 10.54, "duration": 4.36}, {"text": "A hundred years ago, we discovered the beginning of the Universe.", "start": 21.12, "duration": 3.56}, {"text": "Observations of the retreating galaxies by Edwin Hubble and Vesto Slipher,", "start": 25.08, "duration": 4.64}, {"text": "combined with Einstein's - then - brand-new general theory of relativity,", "start": 29.72, "duration": 4.3}, {"text": "revealed that our universe is expanding and if we reverse that expansion far enough -", "start": 34.02, "duration": 6.22}, {"text": "mathematically - purely according to Einstein's equations,", "start": 40.24, "duration": 3.94}, {"text": "it seems inevitable that all space and mass and energy", "start": 44.18, "duration": 4.64}, {"text": "should once have been compacted into an infinitesimally small point -", "start": 48.82, "duration": 4.66}, {"text": "a singularity. It's often said that the universe started with this singularity", "start": 53.48, "duration": 4.14}, {"text": "and the Big Bang is thought of as the explosive expansion that followed.", "start": 57.62, "duration": 4.46}, {"text": "And before the Big Bang singularity, well, they say that there was no 'before' because time and space simply didn't exist.", "start": 62.08, "duration": 7.8}, {"text": "Now, if you think you've managed to get your head around this bizarre notion,", "start": 70.26, "duration": 4.5}, {"text": "then I have some bad news: that picture is wrong.", "start": 74.76, "duration": 3.6}, {"text": "And at least according to pretty much every serious physicist who studies the subject.", "start": 78.62, "duration": 4.32}, {"text": "The good news is that the truth is way cooler, at least as far as we understand it", "start": 82.94, "duration": 5.38}, {"text": "Now, before a certain crowd starts", "start": 88.78, "duration": 3.48}, {"text": "with \"all the scientists keep changing their minds - they don't know anything\", or \"the Big Bang Theory is just a theory\"", "start": 92.26, "duration": 6.4}, {"text": "Let me be very clear, the evidence for a hot dense early universe is practically incontrovertible.", "start": 99.02, "duration": 7.0}, {"text": "The Cosmic Microwave Background is a direct line of sight to the universe as it was", "start": 106.28, "duration": 4.56}, {"text": "Only a few hundred thousand years after the hypothetical beginning of time.", "start": 111.16, "duration": 4.24}, {"text": "We can see pretty much directly that all space and matter in the universe was once crunched at least a thousand times closer together", "start": 116.08, "duration": 7.52}, {"text": "There's also the relative abundance of simple elements hydrogen and helium in particular", "start": 124.06, "duration": 4.78}, {"text": "Whose ratio is exactly what we expect if the entire universe was a dense", "start": 129.069, "duration": 4.48}, {"text": "billions of degrees nuclear furnace for the first several minutes of its existence", "start": 133.88, "duration": 4.28}, {"text": "In fact,", "start": 138.6, "duration": 0.88}, {"text": "There's powerful evidence that we should not rewind Einstein's equations that far, at least without introducing some very new physics", "start": 139.48, "duration": 7.48}, {"text": "For one thing there's also convincing observational evidence that the time before around 10 to the power of negative 32 seconds", "start": 147.51, "duration": 7.79}, {"text": "Included a period of extremely rapid expansion called cosmic inflation", "start": 155.52, "duration": 4.339}, {"text": "We've talked about the reasons we need inflation in previous episodes and I'll come back to it in a bit", "start": 160.44, "duration": 6.319}, {"text": "adding that initial growth spurt solves a couple of the big problems with the Big Bang Theory, but it doesn't change the fact that", "start": 167.58, "duration": 6.979}, {"text": "Rewinding the expansion of the universe even at different speeds still leads us towards the T equals zero", "start": 175.12, "duration": 7.1}, {"text": "singularity. I'm going to come back to why we need to forget the idea of this singularity", "start": 182.72, "duration": 4.98}, {"text": "Doing so will change the way we think about cosmic inflation and about the beginning of the universe", "start": 188.7, "duration": 6.38}, {"text": "But before we kill the whole idea of the Big Bang singularity, we need to understand what we're killing", "start": 195.66, "duration": 6.589}, {"text": "What does it really mean for all of space to be compacted into a single point?", "start": 202.68, "duration": 4.22}, {"text": "This idea is especially weird if the universe is infinite", "start": 207.209, "duration": 3.2}, {"text": "Now the universe may or may not be infinite", "start": 210.959, "duration": 2.18}, {"text": "but if we can understand this for the infinite case", "start": 213.14, "duration": 3.029}, {"text": "Then getting all of this for the finite case is baby stuff at least by comparison", "start": 216.54, "duration": 5.419}, {"text": "It's tricky to talk about the size of an infinite universe", "start": 222.39, "duration": 3.02}, {"text": "Instead of the overall volume or radius we talk about the size of an expanding infinite universe in terms of the scale factor", "start": 226.32, "duration": 7.699}, {"text": "That's the distance between any two points in space at some moment in time", "start": 234.81, "duration": 4.309}, {"text": "Relative to their distance at some other reference moments that reference moment is typically taken to be right now", "start": 239.549, "duration": 7.76}, {"text": "So the scale factor of the universe is currently one", "start": 247.94, "duration": 4.1}, {"text": "Several billion years ago, the scale factor was half, all points in the universe were half as far apart as they are today.", "start": 252.74, "duration": 6.64}, {"text": "So when I talk about rewinding the expansion,", "start": 260.22, "duration": 3.02}, {"text": "I mean running the clock backwards to track a shrinking scale factor.", "start": 263.58, "duration": 4.26}, {"text": "One way to do that is to keep halving the scale factor.", "start": 268.6, "duration": 3.1}, {"text": "Do that enough times and any two points, no matter how far apart they were, will end up", "start": 272.06, "duration": 4.36}, {"text": "as close together as you'd like.", "start": 276.5, "duration": 1.56}, {"text": "Do it enough times and the universe could end up as hot and dense as you like", "start": 278.18, "duration": 4.86}, {"text": "But it'll still be infinite, spatially, the scale factor is incredibly small", "start": 283.49, "duration": 5.39}, {"text": "But an incredibly small number times infinity is still infinity", "start": 288.88, "duration": 4.24}, {"text": "Rewinding the universe this way doesn't leave us with a singularity", "start": 294.26, "duration": 3.68}, {"text": "The singularity is when all points are not just next to each other", "start": 298.28, "duration": 3.38}, {"text": "but literally in the same spot", "start": 301.98, "duration": 2.46}, {"text": "at which point temperature and density are infinite.", "start": 304.44, "duration": 2.66}, {"text": "That last tiny step is a doozy", "start": 307.4, "duration": 2.72}, {"text": "The scale factor goes from incredibly small to zero.", "start": 310.9, "duration": 4.1}, {"text": "So the infinite universe becomes", "start": 315.58, "duration": 2.26}, {"text": "infinitesimal all points become the same point and", "start": 318.24, "duration": 3.64}, {"text": "three-dimensional space becomes zero dimensional", "start": 322.669, "duration": 2.99}, {"text": "That's the singularity", "start": 326.3, "duration": 2.0}, {"text": "We say that it didn't happen in any one place because a point is zero dimensional there weren't", "start": 328.61, "duration": 6.559}, {"text": "spatial dimensions for it to happen in", "start": 335.389, "duration": 2.27}, {"text": "At the same time we say the Big Bang happened", "start": 338.21, "duration": 2.329}, {"text": "Everywhere at once because even the tiniest fraction of a second later", "start": 341.03, "duration": 3.739}, {"text": "The universe has infinite size and everywhere is expanding equally", "start": 344.9, "duration": 4.489}, {"text": "Even if the universe is not infinite then whatever space there is", "start": 350.18, "duration": 4.279}, {"text": "Comes into being at the same time from that singularity. But what happens to time at the Big Bang singularity?", "start": 354.88, "duration": 7.02}, {"text": "To get that you can't think about the universe as having one big clock that", "start": 362.78, "duration": 4.74}, {"text": "Rewinds and then winks out of existence of the Big Bang or into existence if you're going forward", "start": 367.78, "duration": 5.42}, {"text": "No, you have to think about time in the way Einstein", "start": 373.76, "duration": 3.139}, {"text": "Intended there is no universal clock time is relative", "start": 377.539, "duration": 4.64}, {"text": "Clocks are attached to each observer each moving frame of reference to see what time does at the Big Bang", "start": 382.52, "duration": 6.32}, {"text": "We have to trace a path through space and time", "start": 388.849, "duration": 2.69}, {"text": "back to the singularity", "start": 392.419, "duration": 1.8}, {"text": "We trace a path called a geodesic which in general relativity is the shortest path between two space-time coordinates", "start": 394.219, "duration": 7.33}, {"text": "These are the grids we use to map space-time", "start": 402.04, "duration": 3.229}, {"text": "Remember that in our rewind all points in the universe get arbitrarily close together before merging at T equals zero", "start": 406.09, "duration": 7.82}, {"text": "Well, that's the same as saying that all geodesics in the universe converge at the Big Bang singularity", "start": 414.43, "duration": 5.899}, {"text": "In the same way all lines of longitude converge at the North Pole", "start": 421.12, "duration": 3.98}, {"text": "so each", "start": 426.25, "duration": 1.41}, {"text": "Geodesic tracks earlier and earlier times as it approaches the Big Bang", "start": 427.66, "duration": 4.25}, {"text": "infinite clocks rewinding toward zero and then they all converge and", "start": 432.49, "duration": 5.54}, {"text": "Then what? well, then nothing.", "start": 438.61, "duration": 2.99}, {"text": "All geodesics end at the Big Bang singularity and their timelines end with them", "start": 442.12, "duration": 5.869}, {"text": "Or they start depending on how you want to think about it", "start": 448.27, "duration": 3.89}, {"text": "The point is that in the pure Einsteinian picture", "start": 452.56, "duration": 3.44}, {"text": "There is no before the Big Bang because no time line in this universe can be traced there. This is called", "start": 456.0, "duration": 7.46}, {"text": "geodesic in completeness and it also happens at the singularity in the center of a black hole all", "start": 463.46, "duration": 5.92}, {"text": "timelines end this time in the forward direction", "start": 469.75, "duration": 3.17}, {"text": "The analogy with the North Pole is a good one and Einstein himself used it.", "start": 472.92, "duration": 5.26}, {"text": "Lines of longitude end at the North Pole and it's meaningless to ask what is north of the North Pole?", "start": 478.18, "duration": 6.26}, {"text": "from the pure Einsteinian point of view", "start": 484.96, "duration": 2.42}, {"text": "It's meaningless to ask what happened before the Big Bang or after reaching the black hole Center?", "start": 487.45, "duration": 6.44}, {"text": "Okay, so I'm taking my time to explain something", "start": 494.14, "duration": 2.72}, {"text": "I already told you is wrong", "start": 496.86, "duration": 1.93}, {"text": "But it's important because the extreme weirdness of the Big Bang singularity is part of what tells us. It's wrong", "start": 498.79, "duration": 6.739}, {"text": "Any time you encounter a singularity in the mathematics of a physical theory you have good reason for skepticism", "start": 506.05, "duration": 6.05}, {"text": "It's probably telling you that your physical theory is incomplete and that you push that theory too far", "start": 512.86, "duration": 6.709}, {"text": "That's what's happening here", "start": 520.09, "duration": 1.89}, {"text": "We used general relativity to rewind the universe, but we already know that despite its incredible successes", "start": 521.98, "duration": 6.71}, {"text": "GR Is an incomplete theory?", "start": 529.3, "duration": 2.239}, {"text": "At the crazy densities and temperatures of the Big Bang singularity, and just after, GR comes into terrible conflict with quantum mechanics", "start": 532.22, "duration": 8.64}, {"text": "We've talked about that conflict and its possible resolutions before", "start": 540.98, "duration": 3.24}, {"text": "But the upshot is that we just don't know how the universe behaves in those conditions", "start": 544.79, "duration": 4.7}, {"text": "But we do know that pure general relativity is not a good description", "start": 550.61, "duration": 5.51}, {"text": "and so he probably shouldn't believe its prediction that all space was compacted into a single point and that this is where", "start": 556.12, "duration": 7.2}, {"text": "Time started. Ok. So what are the alternatives?", "start": 563.68, "duration": 4.12}, {"text": "Can we really track Geodesics?", "start": 567.8, "duration": 2.7}, {"text": "and the timelines they embody through the Big Bang and out the other side", "start": 570.5, "duration": 4.2}, {"text": "If so, what do we find there?", "start": 575.27, "duration": 2.419}, {"text": "There are several possibilities and they deserve their own episodes and we'll actually get to those soon", "start": 578.2, "duration": 5.78}, {"text": "But to whet your appetite, first up, cosmic inflation can offer a temporary reprieve from the singularity.", "start": 584.44, "duration": 7.28}, {"text": "eternal inflation suggests that our universe appeared as a", "start": 592.22, "duration": 3.66}, {"text": "regularly expanding bubble in an", "start": 596.54, "duration": 2.39}, {"text": "unimaginably larger continuously inflating space-time in that case before the Big Bang was a period of", "start": 599.54, "duration": 7.28}, {"text": "exponential expansion that could have lasted", "start": 607.13, "duration": 2.27}, {"text": "indefinitely", "start": 609.92, "duration": 1.08}, {"text": "We'll get to the nitty-gritty of that with its inflow tongs and bubble universes real soon", "start": 611.0, "duration": 5.21}, {"text": "There are also various cyclic universe options", "start": 616.58, "duration": 3.019}, {"text": "the first cyclic universe idea was the Big Bounce in which the", "start": 619.76, "duration": 3.979}, {"text": "Gravitational attraction of all matter in the universe was enough to cause it to re-collapse and then presumably bounce outwards again", "start": 623.9, "duration": 6.619}, {"text": "We now know that there isn't anywhere near enough matter to do that", "start": 631.19, "duration": 3.559}, {"text": "unless we bring in string theory the", "start": 635.54, "duration": 2.78}, {"text": "Steinhardt-Turok model suggests that our universe floats in a higher dimensional space", "start": 639.29, "duration": 4.97}, {"text": "living on geometric objects called brains", "start": 644.78, "duration": 2.839}, {"text": "collisions between those brains initiate cycles of expansion of contraction", "start": 648.44, "duration": 4.369}, {"text": "Then there's Roger Penrose", "start": 653.36, "duration": 2.0}, {"text": "Conformal cyclic cosmology it's even weirder because it postulates the infinite future", "start": 655.52, "duration": 5.599}, {"text": "boundary of an eternally expanding universe", "start": 661.55, "duration": 2.179}, {"text": "Looks like the Big Bang of a new universe", "start": 664.819, "duration": 2.46}, {"text": "Mathematically so our heat death is someone else's Big Bang?", "start": 668.489, "duration": 3.739}, {"text": "There are some less abstract ways to get a new universe out of an old one", "start": 672.689, "duration": 4.099}, {"text": "for example an extreme quantum fluctuation could initiate a new Big Bang given infinite time or", "start": 677.009, "duration": 6.65}, {"text": "The same amount of time could lead to all particles randomly converging back to the same spot", "start": 684.269, "duration": 5.059}, {"text": "Or maybe black holes birth new universes as in Lee Smolin's \"Fecund Universe\" hypothesis.", "start": 690.02, "duration": 6.08}, {"text": "There's a poetry to that last one. The geodesics approaching the black hole singularity", "start": 696.42, "duration": 4.92}, {"text": "Become the geodesics emerging from the new Big Bang singularity", "start": 701.64, "duration": 3.96}, {"text": "people love cyclic and regenerating universes", "start": 706.319, "duration": 2.719}, {"text": "They appeal to our sense of narrative which might be a reason to be wary of these hypotheses", "start": 709.079, "duration": 6.109}, {"text": "Now they also appeal to our intuition for causality", "start": 715.919, "duration": 3.71}, {"text": "Things happen because prior events caused them many of our ideas", "start": 720.569, "duration": 4.76}, {"text": "Just push back the uncomfortable something from nothing moments", "start": 725.789, "duration": 3.8}, {"text": "physicists have a thing or two to say about that from quantum fluctuations from nothing - Stephen Hawking's", "start": 730.589, "duration": 6.109}, {"text": "timeless interpretation of internal inflation that draws on the holographic principle", "start": 736.949, "duration": 4.669}, {"text": "all things we'll discuss in the future as we travel beyond the beginning of Space-Time.", "start": 742.6, "duration": 7.16}, {"text": "A big thank you to LastPass for sponsoring previous digital studios", "start": 750.2, "duration": 3.04}, {"text": "LastPass remembers your passwords for you by Auto filling your usernames and passwords", "start": 753.64, "duration": 4.84}, {"text": "LastPass is designed to store the count walkouts, which means you won't need to answer security questions like 'What is your favorite childhood pet's name?'", "start": 759.4, "duration": 8.26}, {"text": "or, 'what street did your paternal grandmother live on growing up?' they protect your data and", "start": 767.66, "duration": 5.18}, {"text": "give you the power to make your passwords impenetrable", "start": 772.96, "duration": 2.84}, {"text": "You could also easily and safely share passwords through LastPass if others need to access your accounts", "start": 775.86, "duration": 6.14}, {"text": "the service works on mobile sites and on apps for iOS and Android", "start": 782.35, "duration": 4.219}, {"text": "The service provides unlimited password storage. There are additional service options available. Click on the link in description below to start today", "start": 787.09, "duration": 7.969}]