[{"text": "A while ago. I realized that I got quite a few solar panels laying around", "start": 0.88, "duration": 5.02}, {"text": "that are not being used for anything", "start": 5.9, "duration": 2.88}, {"text": "Due to the nature of solar panels, it is obviously not possible though", "start": 8.96, "duration": 3.98}, {"text": "To directly connect them to projects and thus use them as power sources", "start": 13.12, "duration": 4.9}, {"text": "They're constantly altering output voltage and current due to different solar radiations is the reason for that", "start": 18.44, "duration": 7.04}, {"text": "But feel free to watch my basics video about solar panels to better understand their working behaviour", "start": 25.94, "duration": 6.62}, {"text": "The solution to this problem would be a circuit that uses a solar panel to charge up a Lipo or Lithium-Ion battery", "start": 32.88, "duration": 7.8}, {"text": "Which we can then use as a power source for our projects", "start": 41.04, "duration": 3.66}, {"text": "But that such a circuit actually exists was my initial question", "start": 45.43, "duration": 3.95}, {"text": "While searching for it on eBay and the answer is yes such a circuit does apparently exist", "start": 49.63, "duration": 6.259}, {"text": "The only problem is that after I did a couple of tests with its I realized that it is not perfect for my application", "start": 56.739, "duration": 6.89}, {"text": "So in this video, I'm going to ask the age-old question once again", "start": 64.87, "duration": 4.25}, {"text": "Does it make sense to DIY such a solar battery charger, or should we just buy the commercial solution instead?", "start": 69.67, "duration": 6.739}, {"text": "Let's find out", "start": 77.38, "duration": 1.64}, {"text": "[2011 Lookalike by Bartlebeats playing]", "start": 79.58, "duration": 10.24}, {"text": "This video is sponsored by JLCPCB whose service I utilize to order 10 PCB's for this project", "start": 90.84, "duration": 8.04}, {"text": "For only $2. They were produced in 24 hours and shipped to Germany in only three days", "start": 99.2, "duration": 6.38}, {"text": "So feel free to give JLCPCB a shot by uploading your gerber files today", "start": 105.7, "duration": 6.84}, {"text": "First off, let's take a closer look at the Buy option", "start": 113.22, "duration": 3.36}, {"text": "At first sight, the board quality, as well as all the solder joints seem pretty decent", "start": 116.82, "duration": 6.92}, {"text": "The only thing I subjectively disliked were the JST connectors", "start": 123.96, "duration": 4.04}, {"text": "But thankfully the board offers breakout points for the solar and battery connections", "start": 128.22, "duration": 5.6}, {"text": "The main IC of the board is the CN3065", "start": 134.97, "duration": 2.539}, {"text": "constant current/constant voltage linear charger for single cell lithium ion and lithium polymer batteries", "start": 138.02, "duration": 7.28}, {"text": "Say that three times fast", "start": 145.62, "duration": 2.34}, {"text": "After inspecting its pin description, as well as its detailed description in the data sheets", "start": 148.28, "duration": 5.76}, {"text": "It seemed like a suitable choice for small solar panels", "start": 154.26, "duration": 3.62}, {"text": "that deliver 4.4 volts to 6 volts", "start": 157.88, "duration": 2.78}, {"text": "Thankfully I got such solar panels laying around", "start": 161.94, "duration": 2.58}, {"text": "Like this 110 by 60 millimeter one that can do 6 volts and up to 1 watts. So", "start": 165.02, "duration": 6.64}, {"text": "So for testing purposes, I directly connected the solar panel to the PCB", "start": 172.04, "duration": 6.06}, {"text": "through two thin wires and", "start": 178.1, "duration": 2.32}, {"text": "As you can see by shining light on the panel, the solar charger does react to it,", "start": 180.44, "duration": 5.3}, {"text": "which was a good sign", "start": 185.74, "duration": 2.34}, {"text": "next it was time to find a test battery which ultimately turned out to be a", "start": 188.24, "duration": 4.74}, {"text": "1200 milliamp-hour Lipo battery", "start": 192.98, "duration": 3.38}, {"text": "But right before I was done soldering it to the PCB", "start": 196.68, "duration": 3.14}, {"text": "I realized that the solar charger IC here", "start": 199.86, "duration": 3.2}, {"text": "only features an over-voltage protection during charging", "start": 203.06, "duration": 3.42}, {"text": "But misses and over-discharge protection and more importantly a short-circuit protection", "start": 206.48, "duration": 6.0}, {"text": "This is especially important since the battery voltage is simply bridged over to the SYS OUT JST connector", "start": 212.84, "duration": 7.12}, {"text": "Which means we could easily short the battery here if we make a mistake", "start": 220.34, "duration": 4.72}, {"text": "So to protect the Lipo for now,", "start": 225.2, "duration": 1.92}, {"text": "I added an additional protection circuit to it", "start": 227.12, "duration": 3.54}, {"text": "before hooking it up to the solar charger", "start": 230.66, "duration": 2.78}, {"text": "At this point I wanted to test the circuit setup outside but surprise", "start": 233.54, "duration": 6.0}, {"text": "it is December and the sun did not feel like working with me", "start": 239.54, "duration": 4.14}, {"text": "As an alternative I had to create my own sun with an LED panel", "start": 244.1, "duration": 5.12}, {"text": "After attaching the solar panel to its with duct tape and cranking up the brightness", "start": 249.54, "duration": 5.46}, {"text": "The charge LED turned on and the battery started charging move around to 27.5 milliamps", "start": 255.24, "duration": 6.74}, {"text": "After then measuring the input current at the solar panel side", "start": 262.54, "duration": 4.18}, {"text": "as well as its voltage and the battery charge voltage", "start": 266.72, "duration": 3.72}, {"text": "I came to the conclusion that I was dealing with an efficiency of around 70% at the time", "start": 270.6, "duration": 6.74}, {"text": "Since this circuit works in a linear fashion and does not utilize", "start": 277.56, "duration": 4.68}, {"text": "MPPT for the solar cell, that is definitely acceptable and", "start": 282.38, "duration": 3.94}, {"text": "Because the circuit had no problem reactivating the charging", "start": 286.46, "duration": 4.36}, {"text": "while the solar radiation strength was oscillating a bit", "start": 290.82, "duration": 3.38}, {"text": "I have to say that the circuit is definitely usable for small projects", "start": 294.26, "duration": 5.68}, {"text": "But then again it got not sufficient protection features for the battery", "start": 300.18, "duration": 4.64}, {"text": "No boost converter to create stable 5V for your projects", "start": 304.96, "duration": 3.78}, {"text": "and no MPPT feature for the solar panel", "start": 308.74, "duration": 3.46}, {"text": "So naturally, those were the goals for my DIY solution", "start": 312.38, "duration": 4.24}, {"text": "Which is why I visited the website of Consonance Electronics next", "start": 316.88, "duration": 4.4}, {"text": "Which are in fact the manufacturers of the CN3065 IC", "start": 321.5, "duration": 5.6}, {"text": "There I found out that they got a whole section with solar panel powered charger IC's", "start": 327.3, "duration": 6.56}, {"text": "After comparing all of those, I decided on the CN3791", "start": 334.04, "duration": 5.36}, {"text": "Which works with a single cell as well", "start": 340.08, "duration": 2.149}, {"text": "But uses a switching technique which should guarantee a higher efficiency at higher input voltages", "start": 342.38, "duration": 6.78}, {"text": "Works with up to 28 volts solar panels charges with up to four amps and features MPPT functionality", "start": 349.4, "duration": 8.44}, {"text": "Along side its other features which were mentioned in the data sheets. It seemed like a perfect fit and", "start": 358.04, "duration": 6.52}, {"text": "Luckily, the IC was also easily available", "start": 364.76, "duration": 4.44}, {"text": "So I used the typical applications circuit of the data sheet as a reference", "start": 369.28, "duration": 5.04}, {"text": "to create my own schematic with the Easy EDA software", "start": 374.4, "duration": 4.24}, {"text": "The datasheet also provided guidelines for the capacitor selection", "start": 378.94, "duration": 4.16}, {"text": "as well as the inductor, MOSFETs and diode selection", "start": 383.1, "duration": 3.6}, {"text": "Which was certainly helpful while creating the schematic", "start": 386.84, "duration": 4.2}, {"text": "the only thing which I was uncertain about at this point were the resistors R8 and R9", "start": 391.32, "duration": 5.88}, {"text": "Which are used for setting the MPPT voltage but more about that later", "start": 397.52, "duration": 5.24}, {"text": "Once the solar charge IC schematic part was complete", "start": 403.24, "duration": 3.07}, {"text": "I simply opened up my old Lipo charge protect boost project and added the protect/", "start": 406.31, "duration": 6.13}, {"text": "boost components to my new Solar Charger schematic and", "start": 412.96, "duration": 3.46}, {"text": "Through this simple addition. I added an overcharge", "start": 416.94, "duration": 3.88}, {"text": "over-discharge and over current protection", "start": 420.96, "duration": 2.8}, {"text": "as well as a 5 volt boosted output", "start": 423.76, "duration": 2.98}, {"text": "Which means that all my goals for my DIY solution were fulfilled", "start": 427.0, "duration": 4.66}, {"text": "Next I clicked the convert to PCB button", "start": 432.08, "duration": 3.0}, {"text": "and started arranging all the components in a logical and functional order", "start": 435.12, "duration": 4.68}, {"text": "After then creating all the traces and turning the top and bottom layer into a ground top layer", "start": 439.88, "duration": 6.26}, {"text": "The boards did not look half bad", "start": 446.46, "duration": 2.94}, {"text": "So I exported the gerber files of it", "start": 449.54, "duration": 2.88}, {"text": "and then ordered the boards for pretty cheap", "start": 452.42, "duration": 2.52}, {"text": "Just like I mentioned it earlier from JLCPCB", "start": 455.1, "duration": 4.44}, {"text": "Alongside, I also ordered all the mandatory components for the board and", "start": 459.9, "duration": 3.94}, {"text": "after waiting for a few days", "start": 464.02, "duration": 2.44}, {"text": "I was not only greeted with a ton of components but also the PCBs", "start": 466.46, "duration": 5.4}, {"text": "which made a good first impression under the microscope", "start": 472.04, "duration": 3.74}, {"text": "That means it was time to solder the teeny-tiny components to the PCB", "start": 475.92, "duration": 5.1}, {"text": "For which I mainly utilized a soldering iron with a very fine tip", "start": 481.28, "duration": 4.78}, {"text": "as well as a bit of additional flux and solder", "start": 486.06, "duration": 3.74}, {"text": "The whole process took me around 2 hours", "start": 490.16, "duration": 3.34}, {"text": "and to my own surprise did not turn out that badly this time", "start": 493.5, "duration": 3.82}, {"text": "At least in my opinion", "start": 497.52, "duration": 2.32}, {"text": "Anyway, after soldering all the SMD components", "start": 500.06, "duration": 3.42}, {"text": "I added the through-hole components and just like that", "start": 503.48, "duration": 4.14}, {"text": "My DIY solution was complete, but did it work?", "start": 507.62, "duration": 4.52}, {"text": "To find that out. I firstly hooked up my lipo battery", "start": 512.42, "duration": 3.64}, {"text": "this time though without the protection circuits and", "start": 516.06, "duration": 3.34}, {"text": "After flipping the power switch the output of the board", "start": 519.62, "duration": 3.62}, {"text": "delivered 5.13 volts. Perfect.", "start": 523.24, "duration": 3.54}, {"text": "Through the help of the USB constant loads and my lab bench power supply,", "start": 527.36, "duration": 4.04}, {"text": "I then calculated the efficiency of the boost converter", "start": 531.54, "duration": 4.1}, {"text": "which turned out to be at a maximum of 81 percent", "start": 535.64, "duration": 4.0}, {"text": "and features a maximum current draw of eight hundred and seventy milliamps", "start": 539.9, "duration": 4.7}, {"text": "Afterwards, I also tested all the protection features which worked just fine", "start": 544.88, "duration": 5.56}, {"text": "Now for the solar panel tests,", "start": 550.8, "duration": 2.02}, {"text": "I did not feel like working with such a tiny panel", "start": 552.82, "duration": 3.54}, {"text": "instead I went with this 10 watt one,", "start": 556.58, "duration": 2.9}, {"text": "which features a maximum voltage of 21 volts,", "start": 559.48, "duration": 3.24}, {"text": "a maximum current of 0.61 amps and an MPPT voltage of 18 volts", "start": 563.0, "duration": 6.84}, {"text": "This voltage is important for our DIY board", "start": 570.04, "duration": 2.7}, {"text": "Since the MPPT pin of the IC", "start": 573.06, "duration": 2.66}, {"text": "needs to be at a voltage of 1.205 volts", "start": 575.72, "duration": 2.58}, {"text": "when those 18 volts are applied to the resistor network", "start": 578.48, "duration": 5.24}, {"text": "So after a bit of calculating I got the required resistor values", "start": 584.06, "duration": 4.78}, {"text": "and thus soldered them in place on the PCB", "start": 588.84, "duration": 3.82}, {"text": "Once that was done. I hooked up my solar panel", "start": 592.8, "duration": 2.38}, {"text": "to the boards and positioned it very professionally", "start": 595.18, "duration": 3.64}, {"text": "next to my LED panel", "start": 599.02, "duration": 1.8}, {"text": "After cranking up the brightness to the maximum.", "start": 600.96, "duration": 3.14}, {"text": "The circuits came to life and charged up the battery successfully and", "start": 604.1, "duration": 4.34}, {"text": "Yes, you can charge it while outputting a constant 5 volts for your projects", "start": 608.68, "duration": 5.78}, {"text": "but after measuring the input power", "start": 614.94, "duration": 2.54}, {"text": "/output power, it seemed like the efficiency of the circuits was still a bit lacking to say the least", "start": 617.52, "duration": 6.64}, {"text": "As a result, I went outside in order to find some proper sunlight", "start": 624.5, "duration": 4.94}, {"text": "while monitoring a couple of important values", "start": 629.44, "duration": 3.36}, {"text": "But no matter how much I tried I never got any decent results", "start": 633.0, "duration": 4.82}, {"text": "due to inconsistent solar radiation", "start": 637.82, "duration": 3.5}, {"text": "But what I can say from the outdoor test,", "start": 641.66, "duration": 2.42}, {"text": "is that the MPPT tracking seems to function correctly", "start": 644.08, "duration": 3.74}, {"text": "even though the set voltage seems to be a bit higher and", "start": 648.08, "duration": 3.98}, {"text": "Luckily, I was able to perform a successful indoor efficiency test", "start": 652.32, "duration": 3.64}, {"text": "later on which turned out to be around 62 percent", "start": 655.96, "duration": 5.42}, {"text": "which was acceptable considering the terrible experiment conditions", "start": 661.48, "duration": 5.42}, {"text": "So all in all I'm pretty happy with my DIY solution", "start": 667.06, "duration": 4.02}, {"text": "Since it adds all the important missing functions of the commercial products", "start": 671.18, "duration": 4.08}, {"text": "While still being versatile due to its wide voltage input range", "start": 675.46, "duration": 4.74}, {"text": "The only negative things are they spent time for soldering and the money aspects?", "start": 680.5, "duration": 4.92}, {"text": "But for me that is definitely worth it,", "start": 685.58, "duration": 2.84}, {"text": "which is why DIY is this time the winner", "start": 688.42, "duration": 3.12}, {"text": "But what do you think?", "start": 691.84, "duration": 1.72}, {"text": "Let me know in the comment section below", "start": 693.56, "duration": 2.78}, {"text": "As always, thanks for watching. Don't forget to Like, share, subscribe", "start": 696.58, "duration": 4.68}, {"text": "Stay creative, and I will see you next time!", "start": 701.6, "duration": 4.74}]