[{"text": "Youtuber movies much like video game movies are", "start": 0.13, "duration": 2.63}, {"text": "Impeccable masterpieces that no one can judge. Why watch The Godfather or Citizen Kane when you can watch Fred the movie", "start": 3.22, "duration": 6.95}, {"text": "(Seizure)", "start": 10.24, "duration": 3.58}, {"text": "Or Fred 2, night of the living Fred? [Movie] Grab His head like this!", "start": 13.82, "duration": 4.08}, {"text": "Turn His neck sideways, Like this!", "start": 17.9, "duration": 1.88}, {"text": "Actually never mind that was a good film. now jokes aside youtuber movies are usually terrible they're usually made with one goal in mind", "start": 21.76, "duration": 7.0}, {"text": "M o n e y", "start": 29.28, "duration": 0.88}, {"text": "But the problem is youtubers usually work solo maybe like with or without an editor and", "start": 30.34, "duration": 5.38}, {"text": "Translating the comfy feel of a youtuber to the big screen. It's pretty difficult", "start": 36.01, "duration": 4.369}, {"text": "So companies have tried to add dangerous new chemicals to the youtuber movie equation", "start": 40.54, "duration": 4.969}, {"text": "Relatability and funny firstly they tried it with Shane Dawson", "start": 45.94, "duration": 3.83}, {"text": "Yeah, I do have some pretty sick moves, you know in high school. They used to call me a depressed dog. [Girl] Oh No, why?", "start": 49.77, "duration": 5.039}, {"text": "Well, cuz I ain't got no ball", "start": 55.39, "duration": 2.0}, {"text": "(laughing)", "start": 58.22, "duration": 1.8}, {"text": "Then they tried it was Smosh", "start": 60.22, "duration": 2.0}, {"text": "[Man] Siri!", "start": 63.4, "duration": 0.8}, {"text": "[Siri?] Leading you to... yelp, leave a review online!", "start": 66.12, "duration": 3.5}, {"text": "[Other man] what?", "start": 69.62, "duration": 0.5}, {"text": "[Man] I hate you!", "start": 70.12, "duration": 1.3}, {"text": "And now finally we have Logan Paul who released airplane mode", "start": 71.42, "duration": 4.2}, {"text": "(I'm sorry, i can't understand funny man language)", "start": 75.62, "duration": 5.2}, {"text": "The film's premise is Logan Paul and other funny man youtubers traveling to Australia for a convention", "start": 82.0, "duration": 5.8}, {"text": "now if you're wondering why Logan looks different here, this was actually filmed way back in 2016 a whole year before our", "start": 87.81, "duration": 7.02}, {"text": "certain events", "start": 95.59, "duration": 1.74}, {"text": "that's why he looks so adorable and pure he'll", "start": 97.33, "duration": 2.899}, {"text": "Bite his little millionaire cheeks, but also because this was filmed in 2016. The film is just full of stale memes", "start": 100.84, "duration": 7.309}, {"text": "[Antoine Dodson] Hide yo knifes, hide yo drugs and hide yo liquor cause we searching everyone around here", "start": 108.149, "duration": 5.411}, {"text": "[Movie News Reporter] An incredible chain of events has lead to...", "start": 117.74, "duration": 2.38}, {"text": "...I love my wife dearly. the official Twitter account of the movie hasn't been active since 2017", "start": 120.13, "duration": 6.56}, {"text": "Thankfully Facebook came in clutch shoutouts to the skeleton still running that account for more proof", "start": 129.67, "duration": 6.05}, {"text": "There's a behind-the-scenes video on Logan's second Channel in full", "start": 135.72, "duration": 3.209}, {"text": "360 degrees. Oh my god Wow. It actually feels like I'm here with Logan Paul", "start": 139.45, "duration": 4.699}, {"text": "Looks good", "start": 144.97, "duration": 1.86}, {"text": "No (MLG Screaming)", "start": 146.83, "duration": 1.26}, {"text": "now Logan has starred in various films beforehand like", "start": 148.09, "duration": 3.199}, {"text": "The thinning which was this T rated purge film where if you failed an exam, you got game ended that somehow got a sequel", "start": 151.72, "duration": 7.369}, {"text": "I'm sure they had a lot of outside funding. He also cameoed in mainstream films like Baywatch", "start": 159.09, "duration": 5.22}, {"text": "He was removed from the film entirely his scene can only be found in the extended cut DVD", "start": 164.68, "duration": 5.3}, {"text": "No idea why I like his acting was impeccable. What's your name? Funny guy? I'm Zane", "start": 169.98, "duration": 4.16}, {"text": "Your Zane?", "start": 174.48, "duration": 0.72}, {"text": "I'm Zane [woman] get the (bruh) off my beach", "start": 176.2, "duration": 2.52}, {"text": "Now there are rips on the film online already Thank You soldiers you're doing God's work", "start": 180.86, "duration": 3.77}, {"text": "But they're all horrendous quality and plus I don't want to go to jail", "start": 184.63, "duration": 3.119}, {"text": "My VPN just expired so I actually did the worst thing imaginable", "start": 188.05, "duration": 3.0}, {"text": "I gave Logan Paul my money and bought the movie", "start": 191.59, "duration": 2.43}, {"text": "Well, I I rented it, you know, it sounds a bit more impactful when you say buying also", "start": 194.33, "duration": 5.449}, {"text": "It's only available from iTunes. We appreciate it very much Tim Apple", "start": 199.78, "duration": 3.869}, {"text": "So I had to download the launcher", "start": 203.65, "duration": 1.75}, {"text": "Read the license agreement gives me conniptions take a quick look at the credits and oh my god Logan and Jake are screenwriters", "start": 205.4, "duration": 6.529}, {"text": "Now if the film actually opens up with a parody of airline safety PSA is which to be fair is pretty clever", "start": 212.96, "duration": 5.719}, {"text": "Then they ruin it with a puke joke", "start": 219.22, "duration": 2.0}, {"text": "(Can't understand)", "start": 221.74, "duration": 3.36}, {"text": "My god they got david dobrik in this didn't they after a stroke inducing intro with", "start": 225.88, "duration": 4.52}, {"text": "Emojis, we're introduced to our protagonist Logan Paul. I cannot believe I just said those words out loud", "start": 231.68, "duration": 5.36}, {"text": "Don't worry... it's just me (wink ding sound)", "start": 238.66, "duration": 2.0}, {"text": "[Man] Hey you have any almond milk", "start": 245.36, "duration": 2.24}, {"text": "[Man] oh... you're jerking off", "start": 247.6, "duration": 2.0}, {"text": "Now one thing you'll notice throughout the entire film is shot like a lot of the Fred films", "start": 249.6, "duration": 4.73}, {"text": "You've got these awkward angles that linger for too long and jokes that don't even hit the mark so they'll keep going with the joke", "start": 254.33, "duration": 6.539}, {"text": "Hoping you'll laugh", "start": 261.06, "duration": 1.41}, {"text": "But you don't one thing I'll give Logan he's a brain lit. But his is a pretty confident brain lit scenes with him", "start": 262.47, "duration": 6.859}, {"text": "Don't feel too awkward. Just incredibly forced. Of course, I can't say the same for", "start": 269.33, "duration": 4.619}, {"text": "the rest of the cast", "start": 274.979, "duration": 2.0}, {"text": "i have 9 hundred and 11 reasons not to trust this guy", "start": 277.5, "duration": 3.0}, {"text": "[Woman] What about your real brother... Jake?", "start": 281.98, "duration": 2.22}, {"text": "[Pyro] Goddamn it! why did i laugh!, Alright logan, you get this one, But i only laughed once", "start": 287.8, "duration": 6.08}, {"text": "but then", "start": 294.32, "duration": 1.38}, {"text": "something terrible happens", "start": 295.71, "duration": 1.86}, {"text": "Lele pons appears in the film and her humor is just as subtle as it was on vine ready for the test", "start": 297.57, "duration": 6.409}, {"text": "obviously", "start": 305.04, "duration": 2.0}, {"text": "(Screaming)", "start": 310.74, "duration": 5.94}, {"text": "Check in with how you're performing and yeah, just put your fingers in your ears [Lele Backround] You fucking Bitch!", "start": 316.96, "duration": 4.08}, {"text": "Also, nice tweet about showing Logan's face, even though you clearly didn't get that angle with your phone", "start": 323.24, "duration": 4.88}, {"text": "They literally just NAB to the actual footage from the film and put it into a tweet", "start": 328.12, "duration": 4.289}, {"text": "That's what goes they also have this shot of Logan's crotch getting closer to the camera that adds nothing", "start": 333.59, "duration": 4.94}, {"text": "Apart from making Paul stands cream their pants. I guess. I wanted to interrupt the video really quick (Skip to 6:26 if event passed already)", "start": 338.81, "duration": 4.519}, {"text": "I'll be at the insomnia gaming event in Birmingham UK from the 23rd to the 26th of August", "start": 343.33, "duration": 5.729}, {"text": "We're gonna be bring an exclusive merge the you can't buy online", "start": 349.06, "duration": 2.67}, {"text": "So, please calm down, please God do it or I'll I'll tell the police you touch me", "start": 351.95, "duration": 6.38}, {"text": "Also, I'm bringing out my own little figure you can buy it's called u2's they're not available for pre-order yet", "start": 358.4, "duration": 6.049}, {"text": "But they will be sold on the 23rd of august so mark that on your calendar", "start": 364.45, "duration": 4.47}, {"text": "Scribble it onto your wall or tell your local eldritch guards so he can give you nightmares to remind you once they're gone", "start": 369.2, "duration": 5.51}, {"text": "They'll never be restocked again", "start": 374.72, "duration": 1.82}, {"text": "So remember August 23rd, check the link in the description below to check them out", "start": 376.54, "duration": 4.32}, {"text": "If you don't buy one, I'll make a reddit text-to-speech video. Don't you dare tell me", "start": 380.86, "duration": 5.22}, {"text": "It's the biggest social media convention ever", "start": 388.12, "duration": 2.34}, {"text": "(A bunch of people talking about a convention)", "start": 391.24, "duration": 7.92}, {"text": "Apparently, it's comedy when loads of people walk into the same room", "start": 401.5, "duration": 3.92}, {"text": "They talk about flying to the convention and we cut to a flashback of why Logan doesn't like flying", "start": 405.43, "duration": 4.919}, {"text": "[Kid] It's gonna go on youtube! [Logan] i don't know it looks high from here", "start": 410.5, "duration": 4.96}, {"text": "Now we know that Logan wasn't doing that 10 years ago he was doing this", "start": 416.5, "duration": 4.4}, {"text": "(Logan Calling a pizza place as a little kid)", "start": 421.12, "duration": 5.84}, {"text": "Also, man does funny jump and floor fallen funny because injury happened and injury bad law this", "start": 427.91, "duration": 7.67}, {"text": "Opening scene alone just shows that the film has no direction", "start": 435.62, "duration": 3.59}, {"text": "it's almost like they thought of a bunch of jokes before the concept of the movie and the movie only exists to", "start": 439.21, "duration": 6.449}, {"text": "Justify having all these jokes in it using jokes with rather large quotation marks, by the way", "start": 445.82, "duration": 5.149}, {"text": "I really don't see how a CGI termite laying mad pipe is classified as", "start": 450.97, "duration": 4.44}, {"text": "Comedy. Oh, yeah one joke. I forgot to mention", "start": 456.29, "duration": 2.75}, {"text": "If you can even call it that", "start": 459.04, "duration": 1.72}, {"text": "logan gives up his lube because he's gonna go meet his girlfriend in person and then he has a", "start": 460.76, "duration": 4.579}, {"text": "conversation with the lube time to say goodbye old friend", "start": 466.1, "duration": 2.57}, {"text": "No making this harder than it has to be", "start": 473.9, "duration": 2.929}, {"text": "This is the only scene in the entire film where an inanimate object talks", "start": 478.28, "duration": 4.31}, {"text": "So I thought I'd do the scene justice and replace the dialogue with Conker's Bad Fur Day. I was think about the friend", "start": 482.6, "duration": 6.589}, {"text": "Making this harder than it has to be", "start": 495.2, "duration": 2.0}, {"text": "Okay, one thing I will give them is that they introduced Vitaly the Russian prank youtuber and they do it", "start": 505.58, "duration": 5.389}, {"text": "Is this weird vain Hannibal Lecter hybrids? And I really don't think they understood how funny that was", "start": 510.97, "duration": 5.97}, {"text": "It's only really because of how explosive my tally is in person", "start": 516.94, "duration": 3.479}, {"text": "65 videos. I may be fake 5 videos Joey salad you perhaps respected my mother", "start": 523.55, "duration": 4.91}, {"text": "And then they totally ruined that scene by showing a girl making out with her parents it goes on for just way too long also", "start": 537.71, "duration": 7.369}, {"text": "Remember when I said Casey nice that was in the film", "start": 545.24, "duration": 2.21}, {"text": "He's got one scene and he has the most wooden acting I've ever seen why sir?", "start": 547.79, "duration": 4.819}, {"text": "You've been randomly selected by our advanced safety algorithm for an extensive anal cavity search to be fair, though", "start": 553.52, "duration": 7.429}, {"text": "It's not like I'd fare much better if I tried acting well, maybe you should open your mouth and start talking", "start": 560.95, "duration": 4.799}, {"text": "The aliens are coming. We've been compromised then it out. Cabron Oh Colonel", "start": 565.75, "duration": 4.17}, {"text": "We are so proud also, like I said earlier david dobrik is in this film", "start": 570.44, "duration": 4.22}, {"text": "He has a scene where he walks onto the plane and grabs his ass", "start": 574.82, "duration": 3.979}, {"text": "That's it literally I think another problem with this film is all the pointless youtuber cameos", "start": 581.45, "duration": 5.239}, {"text": "And it's really apparent that most of the youtubers have had no acting experience and most of the humor is pretty much loud", "start": 586.69, "duration": 7.26}, {"text": "equal", "start": 594.23, "duration": 1.5}, {"text": "funny", "start": 595.73, "duration": 2.0}, {"text": "Okay, so look at this clip of actual actors and then when a youtuber is introduced", "start": 603.65, "duration": 5.0}, {"text": "Ah as passengers in the emergency well, are you willing and capable to assist in the event of an emergency", "start": 611.43, "duration": 4.559}, {"text": "All right good enough", "start": 619.12, "duration": 2.0}, {"text": "Most people in this film who aren't youtubers are actually pretty capable with the script. Keep in mind", "start": 623.11, "duration": 5.089}, {"text": "it's a terrible script, but they've done pretty good with what they've been given or so just to prove how", "start": 628.2, "duration": 5.46}, {"text": "Flaccid Logan's acting can be look at the shock on his face", "start": 633.76, "duration": 3.32}, {"text": "When he realizes someone his game ended on the plane and then three seconds later when his friend shows up", "start": 637.15, "duration": 5.419}, {"text": "Like where is the funny in that scene is it how he went from distressed to happy in seconds?", "start": 647.26, "duration": 4.85}, {"text": "I mean the guy's got holes in his brains", "start": 652.18, "duration": 2.449}, {"text": "We already know that on the inside what parts are active with art art", "start": 654.63, "duration": 3.27}, {"text": "which one should be which one shouldn't be broke his skull he was in the seventh grade and he goes", "start": 657.9, "duration": 5.7}, {"text": "But I didn't hurt my brain and you see these holes and you heard it", "start": 663.6, "duration": 4.289}, {"text": "Which means you're gonna have trouble with focus and forethought and follow through an organization planning", "start": 668.56, "duration": 7.55}, {"text": "empathy so for elation God and learning", "start": 676.93, "duration": 3.889}, {"text": "They also have a texting scene that looks like every texting scene from every film ever", "start": 683.26, "duration": 5.599}, {"text": "You know the one where the text message pops up on the side of the screen", "start": 688.86, "duration": 3.42}, {"text": "I mean we're even spider-man on the ps4 did it but at least that had actual acting compared to just someone", "start": 692.55, "duration": 5.28}, {"text": "Staring blankly at a screen for 40 seconds. Also a slight nitpick", "start": 698.23, "duration": 4.34}, {"text": "But these texts are appearing way too quickly for an actual person to be typing", "start": 702.57, "duration": 4.38}, {"text": "You've taken the film from a 9 to an", "start": 710.05, "duration": 2.27}, {"text": "8.5 one thing I've noticed about this film as well is that there's so much swearing", "start": 712.66, "duration": 4.099}, {"text": "Most of it is pretty or needed and the way most jokes go if the swearing was removed", "start": 716.8, "duration": 4.85}, {"text": "This could have actually just been a really bad family-friendly film", "start": 721.75, "duration": 3.26}, {"text": "So I really don't understand the age demographic they were going for here because the film is basically just Fred but with swearing", "start": 732.7, "duration": 7.25}, {"text": "Also back on david dobrik for a second, did anyone tell him he's actually in a movie holy SH", "start": 747.28, "duration": 5.63}, {"text": "The way he acts is exactly like how we act in his vlogs, especially when girls try to hit on him", "start": 754.9, "duration": 5.269}, {"text": "And he clearly doesn't want them to what's your least favorite part about having?", "start": 760.17, "duration": 2.94}, {"text": "A montage sequence as well", "start": 770.11, "duration": 2.0}, {"text": "Montages are usually used in films to cover a large passage of time or a series of events quickly", "start": 772.6, "duration": 5.63}, {"text": "They can actually usually be the highlights of a film, you know condensing several microcosms into a short but thrilling sequence here", "start": 778.23, "duration": 6.99}, {"text": "They just use it to show them all taking selfies. Yeah, I got nothing", "start": 786.07, "duration": 4.159}, {"text": "Please turn your cellular and electronic devices to airplane", "start": 790.26, "duration": 4.77}, {"text": "setting", "start": 795.76, "duration": 2.0}, {"text": "Oh, yeah, remember the plot neither do I the pilots died because no one turned their phones on to airplane mode I", "start": 801.44, "duration": 6.71}, {"text": "Mean to be honest, I totally forgot they were there after Lele pons screamed for the 40th time", "start": 810.53, "duration": 4.789}, {"text": "a", "start": 815.84, "duration": 1.11}, {"text": "Little side note here", "start": 816.95, "duration": 1.25}, {"text": "Lele pons had an entire video dedicated to skits on an airplane and it is is just as bad as you think", "start": 818.2, "duration": 5.609}, {"text": "We are far also", "start": 828.65, "duration": 1.25}, {"text": "This film has a lot of joke stealing which I'm gonna sprinkle examples throughout the video and also the movie actually NAB's", "start": 829.9, "duration": 6.719}, {"text": "a lot of tropes that Lele pons video had well", "start": 836.83, "duration": 2.729}, {"text": "We got here the worried passenger is dangerous time on a plane is three minutes after take the people of insects on the plane", "start": 839.56, "duration": 6.57}, {"text": "Yeah, I just, you know came out here because my co-pilot, you know", "start": 846.14, "duration": 2.63}, {"text": "Look if you need to nap from Lele puns for ideas, you you've hit a new lower, right? Hey, that's it", "start": 852.44, "duration": 5.659}, {"text": "That's a series I used to do. Also another joke still here this gag with the kids", "start": 858.13, "duration": 4.109}, {"text": "This was totally stolen from the film airplane and actually funny movie", "start": 862.34, "duration": 4.549}, {"text": "I just swapped the kids genders around thinking that that's enough to change the scene", "start": 867.68, "duration": 3.98}, {"text": "Thank you. I take it back. Like my man. Would you like it like", "start": 872.69, "duration": 4.52}, {"text": "black and full of trees", "start": 878.3, "duration": 2.0}, {"text": "Now there's another montage of people partying on the plane literally two minutes after the first montage of them taking selfies", "start": 880.73, "duration": 7.34}, {"text": "Hopefully the rest of the film is a giant montage so it'll be over quicker", "start": 888.44, "duration": 3.679}, {"text": "Also, I want to mention this until later in the video", "start": 892.12, "duration": 2.34}, {"text": "So the Susan Bart doesn't D monetize the video, but that there are a lot of sexual innuendos in this film", "start": 894.46, "duration": 5.519}, {"text": "You've got people grinding on each other", "start": 900.07, "duration": 2.0}, {"text": "Termites lame madpipe people pass out on each other looking like they're given heads this stuff is the equivalent of rude thing funny", "start": 902.15, "duration": 7.219}, {"text": "Yeah, beautiful from head to toe to camel toe. I", "start": 909.52, "duration": 4.14}, {"text": "Would say one of the best things about this film though is the flight attendant", "start": 914.48, "duration": 3.65}, {"text": "He's not great. But these leagues above everyone else in this movie", "start": 918.13, "duration": 3.869}, {"text": "He actually feels like he's a character compared to just youtubers thrown on here with the scripts. I need you to figure this out. Okay?", "start": 922.0, "duration": 6.059}, {"text": "To put my seed into a woman's vagina before I hi", "start": 928.65, "duration": 3.269}, {"text": "I think I like him because you can tell that he's just having so much fun with what he was given", "start": 931.92, "duration": 4.559}, {"text": "I can hear you", "start": 939.28, "duration": 2.0}, {"text": "There's this one scene where he actually pranked character it just starts - laughs you're skinny weird a Selena Gomez", "start": 947.74, "duration": 6.65}, {"text": "Look-alike Brad go get on your phone and go find a girl to suck", "start": 954.39, "duration": 3.869}, {"text": "I think it's because he realized in that moment that Logan Paul thinks he's an actor I", "start": 958.26, "duration": 4.799}, {"text": "Don't think I've noticed as well is that there are just so many plot threads in this film that go absolutely nowhere", "start": 964.09, "duration": 5.36}, {"text": "One scene you got the bus baby he walks around the plane", "start": 972.07, "duration": 3.019}, {"text": "I thought he'd go and lean on some control panel or something. But no mom picks him up. And yeah, but that's it", "start": 975.12, "duration": 5.46}, {"text": "Literally nothing of note. You called me last night at 3:00 a.m", "start": 980.61, "duration": 3.0}, {"text": "I think it's because I called the boss living without your permission and then the baby goes missing again and the guy picks him off", "start": 986.44, "duration": 6.44}, {"text": "and tries to breastfeed him and then they do some weird Lion King parody because", "start": 992.88, "duration": 3.69}, {"text": "Lion King relevant film now in cinema law", "start": 997.09, "duration": 3.469}, {"text": "There's just so many gags that make no sense. And they they add nothing to the overall plot. Look at these people making out", "start": 1001.59, "duration": 6.229}, {"text": "It's funny because they're small. Look at this woman doing yoga when the plane is about to crash", "start": 1007.82, "duration": 4.44}, {"text": "It's funny because it's not something you do in that situation", "start": 1012.27, "duration": 2.479}, {"text": "Look at this flashback where doctor pukes on Logan Paula's kids funny because wouldn't happen in hospital. Look, there's key factors with jokes", "start": 1015.41, "duration": 6.989}, {"text": "All right", "start": 1022.4, "duration": 0.39}, {"text": "You need to have rhythm or timing", "start": 1022.79, "duration": 1.47}, {"text": "You need to be confident with your delivery and you need to know your target audience, but sir", "start": 1024.26, "duration": 4.41}, {"text": "Just pretend you didn't see most of the jokes in this film. Do not abide by any of these rules", "start": 1028.67, "duration": 4.979}, {"text": "There's no timing jokes just happen. And by the time you process the joke, you've already been hit with five more", "start": 1033.83, "duration": 5.579}, {"text": "Yeah about him the jokes usually have terrible awkward delivery that drowns out any possible humor and the film like I said earlier", "start": 1042.72, "duration": 7.25}, {"text": "Clearly does not know its target audience", "start": 1050.34, "duration": 1.89}, {"text": "It feels like a Nickelodeon film but it can't be because it has constant sexual innuendos and swearing", "start": 1052.23, "duration": 6.17}, {"text": "What else oh, yeah the plot later in the film Logan Paul and", "start": 1068.64, "duration": 3.829}, {"text": "Woman have to try and land the plane and this is where the airplane joke stealing becomes really apparent", "start": 1073.23, "duration": 5.03}, {"text": "They're both possible lovers inexperienced with flying. They have a contact on the ground who's mentally insane", "start": 1078.299, "duration": 5.3}, {"text": "Meanwhile the passengers in the back become brilliant rule II also I really don't like how this Australian guys portrayed", "start": 1084.809, "duration": 6.17}, {"text": "It's incredibly offensive. Like do you really think an australian would sound like this?", "start": 1090.98, "duration": 4.559}, {"text": "When in real life they sound like this a Blee Blee long neck at 22 wait", "start": 1102.809, "duration": 6.32}, {"text": "more than", "start": 1109.83, "duration": 1.44}, {"text": "Disgusting you'll be speaking to my lawyer. Oh", "start": 1111.27, "duration": 2.209}, {"text": "Yeah, remember vitaliy one of the funny things about this film", "start": 1114.12, "duration": 3.169}, {"text": "Yeah, he is not even mentioned until the last third of the film where he escapes the restraints and much like the cabin staff", "start": 1117.299, "duration": 6.8}, {"text": "He's clearly just not taking his role. Seriously, which makes it so much better", "start": 1124.1, "duration": 3.839}, {"text": "I", "start": 1129.1, "duration": 1.51}, {"text": "Like to think of him as Russia's Nicolas Cage any scene, he's in after breaking out is just pure insanity", "start": 1130.61, "duration": 6.049}, {"text": "He's just amazing and honestly really helped me get through the film bless you bite Ally", "start": 1138.98, "duration": 4.939}, {"text": "Please seek help", "start": 1144.2, "duration": 1.28}, {"text": "then Logan Paul comes in and ruins the scene by giving the stands another excuse to jerk off by ripping off his pants and he", "start": 1145.48, "duration": 6.0}, {"text": "Also does the most inhumane thing possible? Absolutely, correct. He removed Vitaly from the movie. I", "start": 1151.48, "duration": 6.089}, {"text": "Hope you were cast into the tenth circle of hell", "start": 1162.5, "duration": 2.899}, {"text": "How much is left of the film ten minutes we can do that so Logan tries to land the plane by watching a YouTube tutorial", "start": 1170.779, "duration": 6.47}, {"text": "There's a monkey there for some reason no it's gone", "start": 1183.559, "duration": 2.359}, {"text": "They land a low-budget CG plane", "start": 1185.96, "duration": 2.089}, {"text": "And the rest of the film takes place on the green-screen", "start": 1188.049, "duration": 2.64}, {"text": "Logan's friends sleeps with a girl Logan sleeps with a girl the guy who obviously isn't in the film", "start": 1191.12, "duration": 5.299}, {"text": "Awkwardly tries to get out the frame and that's it. Overall. I just don't understand why this film was made", "start": 1196.639, "duration": 5.93}, {"text": "Apart from money. I mean it's basically a cameo of the most ad friendly youtubers on the site. I mean, there's no PewDiePie", "start": 1203.48, "duration": 5.779}, {"text": "There's no me. I'm actually quite offended. I wasn't asked to be on this film", "start": 1209.259, "duration": 3.66}, {"text": "All I would have done is changed the ending whereby Talia is the protagonist and Logan Paul is the bad guy", "start": 1212.919, "duration": 5.55}, {"text": "Your boys going to jail. That's right. Like that would have actually been a half-decent film. Thank you for watching", "start": 1219.93, "duration": 5.219}, {"text": "I'd like to give a shout out to my newest patreon Chairman Mao. They'll go away videos over", "start": 1225.18, "duration": 5.01}, {"text": "If you would be so good as to climb on and start the rotors we could bring back", "start": 1242.2, "duration": 5.569}]