[{"text": "This video is sponsored by Book Walker.", "start": 0.02, "duration": 2.46}, {"text": "I want you to cast your mind back to 2013.", "start": 2.54, "duration": 2.68}, {"text": "This current generation console war had just begun, Harlem Shake was a thing and Youtube rewind was...", "start": 5.28, "duration": 5.12}, {"text": "full of Youtubers.", "start": 10.44, "duration": 2.28}, {"text": "Now if you were to head towards the anime community however, what you would have found it...", "start": 12.96, "duration": 3.36}, {"text": "This was the year Attack on Titan took over and I don't just mean for the anime fandom,", "start": 21.1, "duration": 4.06}, {"text": "it blasted the shackles of the community to find a wider vast mainstream appeal which had never been done before for a single season...", "start": 25.16, "duration": 6.14}, {"text": "Excuse me for a second...", "start": 31.36, "duration": 1.0}, {"text": "...for a single season of anime.", "start": 33.16, "duration": 1.98}, {"text": "Conventions were flooded with people in a Survey Corps uniform, memes were absolutely", "start": 35.14, "duration": 3.58}, {"text": "inescapable on the internet and somewhere in between all that Attack on Titan also aired.", "start": 38.76, "duration": 3.78}, {"text": "I knew something was fucking weird when my", "start": 42.54, "duration": 2.0}, {"text": "co-workers in my office job at that time started off handedly mentioning attack on Titan in the same conversation as Game of Thrones.", "start": 44.58, "duration": 5.56}, {"text": "Mostly because people are saying: \"IT'S BASICALLY LIKE GAME OF THRONES!\" (excect it hasn't shit itself)", "start": 50.38, "duration": 3.98}, {"text": "For anyone who's gotten into anime more recently is kind of hard to convey how unprecedented of phenomenon this show was.", "start": 54.36, "duration": 5.78}, {"text": "There'd never been such a meteoric rise in the history of the medium and the only thing has come close is the One Punchy Boy.", "start": 60.14, "duration": 4.6}, {"text": "Anime nowadays has become a much more accepted medium and I honestly think Attack on Titan was what set the ball rolling for that.", "start": 65.0, "duration": 6.26}, {"text": "The franchise had the entire community in the palm of his hand and all it had to do to continue that hype train was anything...", "start": 71.26, "duration": 6.22}, {"text": "and then it didn't.", "start": 78.36, "duration": 0.98}, {"text": "But after four years it returns with season 2 and has been going strong since then with Attack on Titan Season 3 Part 2 Episode 12 Chapter 3 having just finished.", "start": 79.62, "duration": 9.48}, {"text": "I'm not gonna pretend that the series isn't still immensely popular", "start": 89.1, "duration": 2.94}, {"text": "but the hype is certainly just a fraction of what it was. Which is a shame because with this later season the series has evolved", "start": 92.079, "duration": 6.23}, {"text": "and changed so much that as someone who is initially very lukewarm about the series, I think where it is right now", "start": 98.31, "duration": 5.61}, {"text": "it's shaping up to be -", "start": 103.92, "duration": 2.0}, {"text": "One of the greatest anime of the modern age.", "start": 105.939, "duration": 3.161}, {"text": "And I don't use those words lightly.", "start": 109.1, "duration": 1.869}, {"text": "What I'm trying to say is the Attack on Titan is pretty Great", "start": 110.97, "duration": 2.25}, {"text": "and has turned into something pretty Great,", "start": 113.22, "duration": 1.829}, {"text": "and as the series goes on it gets even more Great,", "start": 115.049, "duration": 2.13}, {"text": "so I just wanted to make a video about how Great it was.", "start": 117.18, "duration": 2.62}, {"text": "Originally this was just gonna be a short video talking about how good the new season is,", "start": 120.78, "duration": 3.88}, {"text": "then the more I worked in it the more I realized I really couldn't do it justice without talking about the entire journey we took to get here.", "start": 124.66, "duration": 6.16}, {"text": "Because every season is so vastly different from each other and yet builds on and adds to the overall experience.", "start": 130.86, "duration": 5.04}, {"text": "There will be spoilers in this video", "start": 136.1, "duration": 1.56}, {"text": "but I won't be spoiling anything from the latest season because it's my long-winded way of saying you should drop everything because this later season", "start": 137.66, "duration": 6.779}, {"text": "is absolutely worth it.", "start": 144.44, "duration": 2.2}, {"text": "So buckle up your seat belts, put your phone on silent,", "start": 146.64, "duration": 2.7}, {"text": "take a break from your JoJo memes because it's gonna be a long one.", "start": 149.34, "duration": 3.82}, {"text": "Because as one of the few people who waited all these years without buckling in to read the manga,", "start": 153.3, "duration": 4.26}, {"text": "experiencing all this for the first time now, all I can say is...", "start": 157.86, "duration": 2.84}, {"text": "I WAS ALL ALONG YOU FUCKERS! IT WAS WORTH IT!", "start": 162.0, "duration": 3.4}, {"text": "If I can give season one credit for anything, it's that it immediately grabbed your attention until you can't look in any other direction.", "start": 170.82, "duration": 6.8}, {"text": "I think many people can agree that the first few episodes is one of the best hooks you can find in anime.", "start": 177.62, "duration": 4.22}, {"text": "In contrast to the rest of the season where you'll find a whole mixed bag of opinions ranging from:", "start": 181.86, "duration": 4.54}, {"text": "I personally thought it was OK but lacking in a few places.", "start": 194.78, "duration": 2.9}, {"text": "And I know everyone's given their two cents on this by now, so I'll try to avoid repeating any common things.", "start": 197.68, "duration": 4.44}, {"text": "Yes, everyone got bored of seeing it everywhere. We all know you're not a real critic unless you complain about the...", "start": 202.12, "duration": 5.56}, {"text": "And I really don't care if you're a special flower who thinks the second opening is better than the first.", "start": 214.96, "duration": 4.78}, {"text": "'Cause it's not (Set playback speed to 0.25 to see this frame)", "start": 220.14, "duration": 0.94}, {"text": "So before I get into what I thought the series was lacking compared to what we have now,", "start": 221.08, "duration": 3.32}, {"text": "I want to shine a spotlight about what I thought it was doing right entire time and what it continues to do to this day.", "start": 224.4, "duration": 5.78}, {"text": "Aside form the obvious spectacle of the amazing action Isayama was able to craft is really believable world with what felt like a unique premise.", "start": 230.2, "duration": 7.06}, {"text": "I've always loved the world building in Attack on Titan because it never needed huge exposition,", "start": 237.26, "duration": 4.12}, {"text": "dumps of dialogue and lore to lend to his credibility that it existed because it just felt like it did.", "start": 241.38, "duration": 5.7}, {"text": "It's the attention to detail that gave the world so much life and made it so interesting.", "start": 247.08, "duration": 3.46}, {"text": "And I know I'm speaking very broadly here,", "start": 250.55, "duration": 2.46}, {"text": "so let me give you a counter example.", "start": 253.01, "duration": 1.87}, {"text": "Let's throw all this out of the window for a second and talk about Naruto. (Believe it!)", "start": 254.88, "duration": 3.769}, {"text": "Naruto has a world with a rich lore that intertwines all the different clans and bloodlines, creating a believable history that you can totally immerse yourself into.", "start": 258.649, "duration": 7.691}, {"text": "But there's one thing that's always bothered me about it.", "start": 266.44, "duration": 3.18}, {"text": "What the fuck is the technology in this world?", "start": 270.2, "duration": 2.48}, {"text": "These ninjas have cameras, computers, satellite dishes, bloody television sets and they are just randomly there and they're not there throughout the series.", "start": 272.7, "duration": 8.4}, {"text": "These are all very small superficial things that shouldn't affect your overall enjoyment of the franchise,", "start": 281.1, "duration": 4.34}, {"text": "but if you really think about it, it really fucks some of the worlds logic and raises way more questions than it should.", "start": 285.44, "duration": 5.52}, {"text": "Like you have magic ninjas controlling mystical beast that could level entire cities with the single fart?", "start": 291.0, "duration": 4.62}, {"text": "But having a whole room of meditating ninjas singing Kumbaya for chakra communication when wireless transmitters have clearly been used before?", "start": 297.84, "duration": 6.86}, {"text": "What?!", "start": 304.7, "duration": 0.5}, {"text": "Radio waves and satellite dishes obviously exist so why is important inventions like radar not a thing on the battlefield?", "start": 305.2, "duration": 5.58}, {"text": "Or why is technology not more widely used in warfare in general?", "start": 310.78, "duration": 3.32}, {"text": "And here you got Akatsuki using some high-level communication jutsu what is basically a Google Hangouts.", "start": 314.1, "duration": 5.74}, {"text": "Christ guys, stop being so try-hard and just start a fucking discord server.", "start": 319.88, "duration": 4.4}, {"text": "I'm not saying I want to see ninjas running around with fucking air pods", "start": 324.29, "duration": 3.029}, {"text": "but if you're gonna add some of these elements in your fictional world for some kind of aesthetic reason,", "start": 327.32, "duration": 4.4}, {"text": "while it doesn't matter in the grand scheme of things and I'm sure some theory can explain it,", "start": 331.72, "duration": 4.0}, {"text": "It just doesn't feel organic.", "start": 335.72, "duration": 2.52}, {"text": "Now this all may sound like nitpicking to you cuz it totally is but the point I'm trying to get at is that", "start": 338.24, "duration": 5.4}, {"text": "in the world of Attack on Titan everything just makes sense.", "start": 343.64, "duration": 3.96}, {"text": "From the social-political structure, to the protocols for certain situations, to the wall having a religion, to the sophisticated mechanics of how the ODN gear works -", "start": 347.6, "duration": 7.58}, {"text": "every aspect of this world seems to have been intricately crafted from the ground up.", "start": 355.18, "duration": 3.96}, {"text": "The way it functions and develop seems like a logical product of the initial rules that is set and as the series goes on and more aspects get explored you're like:", "start": 359.22, "duration": 7.54}, {"text": "\"Oh, shit! Yeah! Of course that's how things work. I didn't think about that until now.\"", "start": 366.76, "duration": 4.78}, {"text": "You can tell a lot of thoughts has been puts into even the tiniest details, even if they don't explain everything.", "start": 371.54, "duration": 4.74}, {"text": "Like, I don't need a five-minute explanation on how they have an invention to get horses up and over the walls,", "start": 376.28, "duration": 4.319}, {"text": "but it's there in the background and it's not exactly something you'd immediately think about, but yeah, of course they'd obviously need one.", "start": 380.6, "duration": 5.94}, {"text": "Sometimes it's the smallest details that can lend the credibility of your world", "start": 386.64, "duration": 3.52}, {"text": "and one thing that made Titans such a convincing threat was that they set up its rules then they dear to them under real world logic.", "start": 390.16, "duration": 6.02}, {"text": "if you don't have anywhere to grapple onto -", "start": 396.18, "duration": 2.54}, {"text": "If you run out of gas -", "start": 398.92, "duration": 1.84}, {"text": "If you sustained an injury from some random debris, shot a landing or an ape thrown a fucking horse fastball at you -", "start": 400.76, "duration": 6.36}, {"text": "Because of course you are.", "start": 407.12, "duration": 1.32}, {"text": "This isn't the usual anime logic where you have high school kids being flung through five walls of pure concrete", "start": 408.44, "duration": 4.68}, {"text": "and then no one's even remotely surprised when they dig through four tons of rubble with only a single scratch being like:", "start": 413.12, "duration": 5.1}, {"text": "\"you thought it was over\"", "start": 419.62, "duration": 2.0}, {"text": "Which is something everybody likes and has stayed consistent throughout the series.", "start": 421.62, "duration": 3.42}, {"text": "But(t) to get back to why I never held the series in the highest regards,", "start": 425.06, "duration": 3.66}, {"text": "the biggest problem about it was that after everything was said and done it all felt very superficial.", "start": 428.72, "duration": 5.5}, {"text": "What I mean by that is a lot of the appeal came from shallower elements that were there to maximize impact but not really leave a lasting impression.", "start": 434.3, "duration": 6.92}, {"text": "From the bombastic action", "start": 441.22, "duration": 1.46}, {"text": "TO THE  DRAMATIC SHOUTING", "start": 442.68, "duration": 1.9}, {"text": "to soundtracks blaring in your face at full volume", "start": 444.58, "duration": 3.78}, {"text": "There was always some kind of twist and turn to keep you watching even if it relied on cheap shock factor.", "start": 451.2, "duration": 4.54}, {"text": "But I can't force feeding you something every episode so you never get a chance to rest and reflect on it.", "start": 455.74, "duration": 5.1}, {"text": "Cheap thrills took priority over actually taking time to develop these characters with the possible exception of", "start": 460.84, "duration": 5.18}, {"text": "Meaning most of them were just recognizable for a single quirk or were one no characters introduced for the purpose of being killed off.", "start": 467.78, "duration": 5.96}, {"text": "The developments contributed to constant shocking and hype moments, but once the initial adrenaline wears off you've realized there was not much else there", "start": 473.8, "duration": 7.48}, {"text": "OH MY GOD! THEY KILLED THE MAIN CHARACTER IN EPISODE 5!", "start": 481.28, "duration": 3.6}, {"text": "Ha ha just kidding! He's actually a Titan. It was a prank. It's just prank bro.", "start": 484.98, "duration": 3.82}, {"text": "Be sure to like and subscribe for more content", "start": 489.69, "duration": 3.01}, {"text": "When I equate season 1 to is a rollercoaster ride.", "start": 492.7, "duration": 2.78}, {"text": "And I'm not talking about those donkey pop-up coasters uou find in your local carnaval or whatever.", "start": 495.48, "duration": 3.92}, {"text": "I'm talking Nemesis Inferno at Thorpe Park, King the car at Six Flags, the fucking", "start": 499.4, "duration": 4.88}, {"text": "Attack on Titan riding Fuji-Q Japan... wait a minute", "start": 504.74, "duration": 2.8}, {"text": "It was a high budget premium thrill ride but it was a thrill ride nonetheless.", "start": 507.82, "duration": 3.58}, {"text": "Because of this when the show ended I undoubtedly had a great time watching it but looking back I had zero emotional attachment to it.", "start": 511.44, "duration": 6.44}, {"text": "And that's how it was for a long, long, long-ass time...", "start": 517.94, "duration": 4.66}, {"text": "And then", "start": 524.58, "duration": 1.18}, {"text": "If the reception for season 1 was unbridled hype and excitement,", "start": 532.94, "duration": 3.24}, {"text": "When season two aired it was much more like: \"Hey guys, Attack on Titan season 2 it's coming out!\"", "start": 536.2, "duration": 5.06}, {"text": "Alright we can fix this. Can you get me the hype button please?", "start": 546.139, "duration": 3.02}, {"text": "A lot of this can be attributed to the four year gap", "start": 554.3, "duration": 2.239}, {"text": "but I think another big reason was that it was just vastly different in tone and pacing causing a lot of people to feel a bit underwhelmed by it in comparison.", "start": 556.54, "duration": 7.04}, {"text": "Despite this however, it may come as a shock to many of you that I actually prefer to Attack on Titan Season 2 over Season 1!", "start": 563.58, "duration": 7.08}, {"text": "Oh you know, it would be shocking if I didn't already make a video literally called \"Why I Actually Preferred Attack On Titan S2 Over S1!\"", "start": 571.78, "duration": 7.18}, {"text": "Season 2 made me infinitely more invested in the franchise than I had ever been before and the way it was able to make me do this was by", "start": 578.96, "duration": 6.28}, {"text": "stopping the rollercoaster, letting you get off the ride and just explore the theme park at a slower pace.", "start": 585.25, "duration": 4.049}, {"text": "I swear this is where a theme park analogy ends, I just really want to go to Thorpe park.", "start": 589.3, "duration": 3.34}, {"text": "It added a lot of these mystery elements which really enriched my interest in the world and added a layer of tension to it.", "start": 592.64, "duration": 5.22}, {"text": "J.J. Abrams has this great little TED talk where he explains his theory behind the mystery box.", "start": 597.88, "duration": 4.54}, {"text": "Where when watching a show or movie you can always find these mystery boxes where information is fed to you", "start": 602.46, "duration": 5.2}, {"text": "but just enough is withheld to create a mystery and it's the withholding of the", "start": 607.66, "duration": 3.72}, {"text": "information that is far more engaging for the viewer because we invest ourselves to find out", "start": 611.44, "duration": 4.54}, {"text": "\"What's in a box?!\"", "start": 615.98, "duration": 1.16}, {"text": "And that's exactly what happens here.", "start": 617.14, "duration": 1.68}, {"text": "It constantly gave you these little tidbits and flashback of conversations that implied", "start": 618.84, "duration": 3.64}, {"text": "that there was something much larger going on in the grand scheme of things", "start": 622.48, "duration": 2.82}, {"text": "but not giving you enough information for any of it to make sense.", "start": 625.3, "duration": 2.58}, {"text": "And it got you curious and invested to see what was in this mystery box,", "start": 627.88, "duration": 3.539}, {"text": "which in the series was literally", "start": 631.42, "duration": 1.86}, {"text": "\"What's in a basement?\"", "start": 633.28, "duration": 0.96}, {"text": "There was real tension in the air because you didn't know what was going on.", "start": 634.3, "duration": 2.98}, {"text": "Who was a Titan? Who was in there? Who wasn't?", "start": 637.28, "duration": 2.26}, {"text": "What did this flashback mean? Why is there talking gorilla?", "start": 639.54, "duration": 2.36}, {"text": "It can't be a talking gorilla because I'm already Winston.", "start": 641.92, "duration": 2.22}, {"text": "And the more you found out the more questions that were raised.", "start": 644.14, "duration": 2.28}, {"text": "There was a lot more emotions evoke than just shock and awe and improved me that the series could do more than one thing.", "start": 646.42, "duration": 5.62}, {"text": "Also gave a good amount of screen time on characters who hardly got any before so much so that the main trio were barely there in the first half", "start": 652.04, "duration": 6.86}, {"text": "and one of the most popular characters, Levi was almost non-existent.", "start": 658.92, "duration": 3.22}, {"text": "Levi more like Lebye, amIright?", "start": 662.26, "duration": 2.96}, {"text": "Season 2 managed to make you invest and care about these characters who you didn't even remember existed in season one.", "start": 674.08, "duration": 5.12}, {"text": "Like I remember back when the first season was in the prime of his hype I actually got spoiled about the reveal of who the Colossal and Armored Titan was.", "start": 679.2, "duration": 6.98}, {"text": "And my actual response back then was:", "start": 686.18, "duration": 2.16}, {"text": "\"Oh for fuck's sake! I can't believe the internet done this again!", "start": 688.34, "duration": 3.26}, {"text": "This has ruined the entire fucking thing for me! Goddamn it, I'm so fuckin' pissed!", "start": 691.6, "duration": 5.429}, {"text": "Wait, who?\"", "start": 701.69, "duration": 0.79}, {"text": "Bertholdt, Reiner, Ymir and Krista all took the spotlight for a good portion of the season and I ended up really liking all of them.", "start": 702.48, "duration": 6.52}, {"text": "Which is incredible because going to this all I remember about them was -", "start": 709.0, "duration": 3.16}, {"text": "I'm pretty sure you had two lines before.", "start": 712.16, "duration": 1.82}, {"text": "You were a background character I think.", "start": 713.98, "duration": 2.14}, {"text": "Cheap waifu baits.", "start": 716.12, "duration": 1.16}, {"text": "I don't even think you're in season 1.", "start": 717.28, "duration": 1.8}, {"text": "It's in taking time to establish these characters and building up the mystery of the world", "start": 719.08, "duration": 3.719}, {"text": "I felt they were setting up a story with an actual foundation rather than setting up the next big shocking moment.", "start": 722.8, "duration": 5.7}, {"text": "And that's honestly why I preferred this season.", "start": 728.5, "duration": 2.1}, {"text": "It felt less like a string of moments and more like a narrative that followed a set of characters with their own drives and motivations", "start": 730.68, "duration": 5.22}, {"text": "with moments that organically resulted from it.", "start": 735.9, "duration": 2.16}, {"text": "Because there was still some great moments, even if they came there on lower quantity.", "start": 738.12, "duration": 3.94}, {"text": "Now, while I can understand that as a standalone season", "start": 742.06, "duration": 2.96}, {"text": "not everyone will agree that this slow methodical build-up was more entertaining than the action-packed thrill ride,", "start": 745.03, "duration": 5.309}, {"text": "I don't think anyone can argue about the results that this foundation paved the way for.", "start": 750.34, "duration": 5.52}, {"text": "Season 2 was where we had some breathing room to really get to know the characters more,", "start": 767.8, "duration": 3.3}, {"text": "Season 3 straight-up explored aspects of them we've never seen before by putting them in really interesting scenarios.", "start": 771.1, "duration": 5.54}, {"text": "Because out of nowhere the series turns into this political thriller where it's all about scheming, conspiracies, vying for power and more importantly", "start": 776.98, "duration": 7.38}, {"text": "some good-old human on human killing action.", "start": 784.36, "duration": 2.6}, {"text": "Gun was a simple premise of the heroic humans versus the monstrous Titans", "start": 786.96, "duration": 4.18}, {"text": "and while a big reason for the show's popularity and appeal was the fact that this was a conflict so simple anyone could get behind it,", "start": 791.14, "duration": 6.72}, {"text": "it was refreshing to see these characters be put in a morally gray situation.", "start": 797.86, "duration": 4.06}, {"text": "Levi and the whole Hanji squad went from these simple badass characters who were really good at fighting titans", "start": 801.92, "duration": 4.94}, {"text": "to decisive cutthroat soldiers who didn't hesitate to get the hands dirty in order to get the job done.", "start": 806.98, "duration": 4.72}, {"text": "And we get to see the young trainees we grew up with having to make that same difficult decision of joining them in killing fellow humans or...", "start": 811.84, "duration": 6.36}, {"text": "dying.", "start": 818.99, "duration": 0.77}, {"text": "And I just enjoy seeing them be putting in moral dilemmas where they like:", "start": 819.76, "duration": 2.72}, {"text": "\"What the fuck?! Why are we fighting humans?!\"", "start": 822.48, "duration": 1.989}, {"text": "\"Because humans are trying to kill us now!\"", "start": 824.47, "duration": 2.0}, {"text": "\"Where are the titans?! I thought this show is called Attack on Titan!\"", "start": 826.47, "duration": 2.89}, {"text": "\"We can call it Attack on Mikasa's Sweet Ass With Sugar On Top if we'll get you just shut the fuck up and kill that bloke over there!\"", "start": 829.36, "duration": 6.2}, {"text": "There wasn't any new revolutionary writing technique on display here.", "start": 836.82, "duration": 3.18}, {"text": "All Isayama did was put his characters in interesting scenarios to see how they would react.", "start": 840.02, "duration": 5.22}, {"text": "And it worked.", "start": 845.24, "duration": 1.24}, {"text": "It really added a layer of complexity when the enemy wasn't just some mindless giant zombie", "start": 846.48, "duration": 3.9}, {"text": "but a human being acting with their own reasons,", "start": 850.38, "duration": 2.72}, {"text": "meaning the resulting consequences of everyone's actions had far more weight than ever used to.", "start": 853.1, "duration": 4.94}, {"text": "Once again we get a swap on the character to getting the majority of the focus, is Levi", "start": 858.04, "duration": 3.62}, {"text": "went from having a minute of screen time to being in every episode.", "start": 861.66, "duration": 2.96}, {"text": "Lebye more Lehye.", "start": 864.68, "duration": 1.98}, {"text": "Ok, that's the last time, I swear to God", "start": 866.66, "duration": 1.88}, {"text": "And it's really cemented the strengths showcased last season that the series really isn't dependent on anyone character to carry this show", "start": 868.54, "duration": 6.44}, {"text": "because they all can.", "start": 874.98, "duration": 1.62}, {"text": "It doesn't matter if some characters had like 10 minutes of screen time before the series is able to bring any character to the forefront and make them interesting.", "start": 876.7, "duration": 7.08}, {"text": "Or so, the other thing is allow the season to do was to have outstanding moments that didn't need to rely on action.", "start": 883.78, "duration": 5.74}, {"text": "In fact, the best scenes purely revolved around character decisions, like the phenomenal scene with Historia AKA", "start": 889.52, "duration": 6.96}, {"text": "So the scene basically revolves around is whether she should accept her heritage or reject it.", "start": 897.42, "duration": 5.42}, {"text": "Now, I'm not really an animated guy when watching anime. There could be this really hype scene and", "start": 902.84, "duration": 5.68}, {"text": "Cool", "start": 917.84, "duration": 0.84}, {"text": "So I surprised even myself, when the waifu formerly known as Krista smacks a vial out of the hand,", "start": 918.68, "duration": 4.54}, {"text": "I've visibly lapped out my seat and shouted -", "start": 923.5, "duration": 2.18}, {"text": "YES! YOU FUCKING GO, GIRL!", "start": 925.68, "duration": 2.62}, {"text": "God, I fucking love this moment so much.", "start": 928.36, "duration": 1.72}, {"text": "And what I loved about it was that like the rest of the season Isayama presented a difficult character choice", "start": 930.1, "duration": 5.24}, {"text": "and you genuinely did not know what they would choose", "start": 935.34, "duration": 2.74}, {"text": "especially because what she chose to do was the harder choice.", "start": 938.12, "duration": 3.78}, {"text": "By doing this not only does she have to reject her father and a more cushty life", "start": 941.9, "duration": 3.36}, {"text": "but also her right to attain the power of essentially a titan God,", "start": 945.26, "duration": 3.16}, {"text": "meaning humanity will now have to go down in unknown but far more challenging path.", "start": 948.42, "duration": 4.38}, {"text": "So it give this so much more weight when she chooses not only to reject all that", "start": 952.82, "duration": 4.01}, {"text": "but fucking do it by judo flipping her dick father, breaking his back,", "start": 956.83, "duration": 3.63}, {"text": "smacking Eren in a head and telling him to stop being such a bloody cry-baby,", "start": 960.46, "duration": 3.36}, {"text": "landing the killing blow so the public will have faith in her as a new queen and then just for good measure", "start": 963.82, "duration": 4.16}, {"text": "having the balls to punch Levi all in a good day's work.", "start": 968.06, "duration": 3.24}, {"text": "Peopel say that there's legitimate argument on who's best girl in this show!", "start": 971.3, "duration": 4.42}, {"text": "\"You're my queen.\" Press F to GoT S8", "start": 975.72, "duration": 0.82}, {"text": "Pure and simple, this is just great writing and that was the point when I realized -", "start": 976.54, "duration": 4.66}, {"text": "Holy crap! This series might actually be something really special.", "start": 981.2, "duration": 4.08}, {"text": "Hopefully you're getting the idea by now that every arc so far has taken what's been previously established", "start": 985.4, "duration": 4.18}, {"text": "and added something new and built upon that foundation, but that doesn't really happen in the next arc.", "start": 989.6, "duration": 6.24}, {"text": "Because it kind of just does everything at ones.", "start": 996.44, "duration": 2.5}, {"text": "OST Attack on Titan Season 3 OST -  Apple Seed by Hiroyuki Sawano ft. Laco & Mpi", "start": 999.54, "duration": 3.32}, {"text": "Remember when Attack on Titan was about Titans?", "start": 1006.9, "duration": 2.58}, {"text": "Remember when it was about humanity taking back the walls?", "start": 1009.48, "duration": 2.5}, {"text": "Remember when it was about getting to Eren's basement ?", "start": 1011.98, "duration": 3.64}, {"text": "Here you go. Are you happy now?", "start": 1015.62, "duration": 1.38}, {"text": "Are you happy? Are you finally gonna shut the fuck up?", "start": 1017.0, "duration": 2.52}, {"text": "Attack on Titan Season 3 Part 2, god that name never rolls off the tongue no matter how many times I say it.", "start": 1019.66, "duration": 4.62}, {"text": "It's a combination of everything the series has built up.", "start": 1024.28, "duration": 2.4}, {"text": "Its the action-packed rollercoaster of the first season with the weight of the second, the emotional complexity of the third", "start": 1026.68, "duration": 5.26}, {"text": "and holy fuck, is it an amazing sight to behold.", "start": 1031.94, "duration": 3.08}, {"text": "You may not like it, but this is what peak Attack on Titan looks like.", "start": 1035.12, "duration": 4.24}, {"text": "It's like the series is going through a greatest hits compilation of everything it was able to achieve", "start": 1039.36, "duration": 4.24}, {"text": "where the final product is even better than all the individual elements it added.", "start": 1043.6, "duration": 4.38}, {"text": "You've still got the amazingly directed action sequences, the epic reveal of the world and the mysteries build-up,", "start": 1048.16, "duration": 5.26}, {"text": "really difficult character decisions, consequence to every action and all this equates to an experience you can rarely find in anime.", "start": 1053.42, "duration": 7.88}, {"text": "I really hate how cliche the term Edge-of-your-seat has become because this is truly edge-of-your-seat stuff.", "start": 1063.26, "duration": 5.72}, {"text": "But I don't feel that term is justice to convey just how well it's built up its characters", "start": 1068.98, "duration": 3.86}, {"text": "and stakes so you go to every episode with a mix of fear, excitement and anticipation", "start": 1072.84, "duration": 4.08}, {"text": "because you genuinely do not know what is going to happen.", "start": 1077.04, "duration": 4.34}, {"text": "You watch with bated breath knowing not everyone is going to make it out of this.", "start": 1081.38, "duration": 3.76}, {"text": "It's not a matter of if, it's a matter of who, when and how many.", "start": 1085.14, "duration": 3.86}, {"text": "And now that we've reached a point where you actually care about these characters and it's not fucking two-lined Lenny riding to his death.", "start": 1089.0, "duration": 5.58}, {"text": "Every event whether that be a small victory in battle or someone's unfortunate demise has tremendous weight behind it.", "start": 1094.58, "duration": 6.3}, {"text": "Side characters no longer feel like side characters.", "start": 1101.08, "duration": 2.98}, {"text": "Most of them now you've gotten to know for a decent amount of time with meaningful development.", "start": 1104.06, "duration": 3.72}, {"text": "And I'm not talking about something like -", "start": 1107.78, "duration": 2.78}, {"text": "That's some premium character development right there!", "start": 1117.46, "duration": 2.62}, {"text": "You're invested, you're hopeful, you've gone through this long arduous journey with them", "start": 1120.16, "duration": 4.02}, {"text": "and seeing everyone playing this giant game of russian roulette every episode,", "start": 1124.18, "duration": 3.74}, {"text": "brings the same kind of squeaky bum, gut-wrenching tension as when it's the 90th minute in the World Cup final, it's stoppage time", "start": 1127.98, "duration": 6.32}, {"text": "and your team is one goal away from winning or losing the entire tournament.", "start": 1134.309, "duration": 5.051}, {"text": "Except this isn't some live sporting event,", "start": 1139.36, "duration": 2.629}, {"text": "It's a premade animation.", "start": 1142.1, "duration": 1.66}, {"text": "It brings an emotional weight that has never been reached before by this show and is rarely reached by any show.", "start": 1143.76, "duration": 5.6}, {"text": "And none of this would have been possible without the way it's constantly evolved and build-up upon itself.", "start": 1149.36, "duration": 5.12}, {"text": "Essentially, the series itself went on this 26 episode hyperbolic time chamber training arc,", "start": 1154.48, "duration": 5.94}, {"text": "level up every aspect to continue its journey stronger than ever.", "start": 1160.42, "duration": 3.88}, {"text": "So now I hope you understand why I've needed to spend 19 minutes of your time going through every season,", "start": 1164.309, "duration": 5.28}, {"text": "explaining what's all the individual seasons have done", "start": 1169.78, "duration": 2.56}, {"text": "and that's because where we are at right now would not be possible without the combined effort of every season.", "start": 1172.34, "duration": 5.98}, {"text": "And now that we're at this point looking back at season 1, there were a lot of elements, I wasn't too fond of back then that now I'm glad they did.", "start": 1178.32, "duration": 8.62}, {"text": "I'm glad people can change into Titans.", "start": 1186.94, "duration": 2.18}, {"text": "I'm glad they didn't just take the wall back straight away.", "start": 1189.12, "duration": 2.82}, {"text": "I'm glad they took the time to introduce the female Titan and this mysterious external entity who wants to destroy humanity.", "start": 1191.94, "duration": 6.52}, {"text": "I'm glad they didn't just stay on that simple rollercoaster and stick to humans versus mindless titans", "start": 1198.46, "duration": 4.6}, {"text": "because now the story is far more intricate and diverse than anything I had predicted when I first started watching it.", "start": 1203.06, "duration": 6.7}, {"text": "After this latest reveal of what's in the basement and the secrets of the world have been unpacked,", "start": 1209.76, "duration": 4.04}, {"text": "once again the show has evolved into something entirely new.", "start": 1213.8, "duration": 3.44}, {"text": "It doesn't even feel like the same show anymore.", "start": 1217.24, "duration": 2.54}, {"text": "And I mean that in a good way.", "start": 1219.78, "duration": 1.72}, {"text": "It's resulted in a far more interesting world with a richer history than I ever thought it was going to be", "start": 1221.5, "duration": 5.16}, {"text": "while still sticking to the same themes presented in Episode 1.", "start": 1226.66, "duration": 3.32}, {"text": "And through me realizing this I've just come to appreciate how rare and enigma of this show has become.", "start": 1230.16, "duration": 5.2}, {"text": "Because it's one that has been fully able to realize its potential until the very end.", "start": 1235.4, "duration": 4.94}, {"text": "How many of you have had an anime you like so you go off to read the source material,", "start": 1240.38, "duration": 3.96}, {"text": "only to find that the anime barely scratched the surface", "start": 1244.44, "duration": 2.7}, {"text": "And the source material reaches heights you can only dream of seeing in the anime.", "start": 1247.16, "duration": 4.74}, {"text": "Well, Attack on Titan, is that one in a million adaptation.", "start": 1252.1, "duration": 3.34}, {"text": "Not just a really good short hard-hitting series that said its piece and ended", "start": 1255.46, "duration": 4.06}, {"text": "but a full epic that we've gone on this long ride with and has been able to hit its final form with no compromise.", "start": 1259.52, "duration": 7.14}, {"text": "In the process of making this video Season 4 was announced which is going to be the final season.", "start": 1266.76, "duration": 5.44}, {"text": "We are going to see a conclusion to this story and if word of mouth of every manga reader I've talked to is true,", "start": 1272.2, "duration": 5.72}, {"text": "things are going to get even better which considering how things have been set up now,", "start": 1277.92, "duration": 4.42}, {"text": "I absolutely believe.", "start": 1282.34, "duration": 1.92}, {"text": "So here I am now, in 2019, unironically telling you that you should watch Attack on Titan.", "start": 1284.26, "duration": 6.26}, {"text": "Whether you're a new fan, or old one or even someone who wasn't too hot on season 1", "start": 1290.52, "duration": 4.58}, {"text": "because when I say I like Attack on Titan, a lot of people still associate it with that one dimensional rollercoaster season 1 was.", "start": 1295.1, "duration": 7.02}, {"text": "And it's just so much more than that now.", "start": 1302.12, "duration": 2.46}, {"text": "Believe the hype.", "start": 1304.58, "duration": 1.78}, {"text": "Believe the anticipation.", "start": 1306.42, "duration": 1.36}, {"text": "Forget what I said about The Death of Classic Anime because when this ends", "start": 1307.78, "duration": 4.06}, {"text": "if by some miracle it is able to continue to get the same amazing treatment this adaptation has received thus far -", "start": 1311.9, "duration": 6.36}, {"text": "This could very much be THE anime that defines this generation...", "start": 1318.4, "duration": 5.12}, {"text": "Attack on Titan Season 3 OST - Zero Eclipse by Hiroyuki Sawano ft. Laco", "start": 1333.2, "duration": 4.74}, {"text": "Hey guys, hope you enjoyed that video", "start": 1338.3, "duration": 2.0}, {"text": "Thank you to Book Walker for sponsoring me to just be able to talk about the Attack on Titan for 20 plus minutes", "start": 1340.409, "duration": 5.329}, {"text": "I really enjoyed making this video call me an Attack on Titan fanboy because I just", "start": 1345.739, "duration": 4.109}, {"text": "Freaking love it. Now. All the available attack on Titan volumes are available on their website in eBook form", "start": 1349.949, "duration": 5.63}, {"text": "In fact, you can pick up right where I left off where the anime ended by clicking on the link in the description", "start": 1355.579, "duration": 4.5}, {"text": "Which will take you straight to volume 23 onwards if you can't wait till season 4 to come out. Again if you're a first-time user", "start": 1360.08, "duration": 6.94}, {"text": "Anyway, that's it from me though", "start": 1369.98, "duration": 1.64}, {"text": "I hope you all have a wonderful day get on the Attack on Titan hype train and I'll see you all next time.", "start": 1371.629, "duration": 5.88}]