[{"text": "Sup you beautiful bastards, hope you're having a fantastic Monday.", "start": 0.2, "duration": 2.978}, {"text": "Welcome back to the philip defranco show and let's just jump into it!", "start": 3.179, "duration": 3.621}, {"text": "And the first thing we're going to talk about today is the heavily", "start": 6.8, "duration": 1.569}, {"text": "viewer-requested story from over the weekend and that is the controversy around Tyler \"Ninja\" Blevins.", "start": 8.4, "duration": 4.619}, {"text": "If you're not familiar with Tyler he is essentially the biggest name and online entertainment right now. He's been gaming for a long time.", "start": 13.019, "duration": 6.39}, {"text": "He blew up over the past year.", "start": 19.41, "duration": 1.5}, {"text": "I mean just the numbers and the rate, it's insane.", "start": 20.91, "duration": 3.119}, {"text": "But something happened in a recent interview that had certain pockets of the internet blowing up at Tyler.  In an interview with polygon at Samsung", "start": 24.029, "duration": 6.42}, {"text": "Unpacked twenty eighteen he said", "start": 30.449, "duration": 1.08}, {"text": "and part of his reasoning wasn't just the clickbait", "start": 42.426, "duration": 2.174}, {"text": "It was him saying that he was thinking about his wife.", "start": 44.6, "duration": 2.04}, {"text": "Tyler is married the Jago Steve, Jessica Blevins actually just celebrated their one-year anniversary", "start": 46.68, "duration": 4.0}, {"text": "on the note of not streaming with women he said..", "start": 50.683, "duration": 1.537}, {"text": "and during the interview  he also goes on to say that he doesn't think this decision has caused any problem..", "start": 60.95, "duration": 3.915}, {"text": "All this story blew up it started on polygon, but then I was on Variety, the BBC was covering this,", "start": 74.25, "duration": 3.95}, {"text": "and online you had some people saying that Blevins doing this was", "start": 78.2, "duration": 3.36}, {"text": "discrimination, it was sexist and people saying because of his size", "start": 81.94, "duration": 2.94}, {"text": "he is in a position where he could change the culture if that's the way the culture really is.", "start": 85.02, "duration": 3.54}, {"text": "He also had some people sharing their non specific", "start": 88.56, "duration": 2.25}, {"text": "aming stories like Miss booth who tweeted..", "start": 91.08, "duration": 3.96}, {"text": "Some like Emma Evans saying this is punishment of women via exclusion.", "start": 102.66, "duration": 3.6}, {"text": "But at the same time you had a lot of people defending ninja pointing to other situations", "start": 106.26, "duration": 3.0}, {"text": "like two creators by the name of Myth and Pokeman.  People taking screenshot of video after video that seems to just be all about", "start": 109.5, "duration": 6.26}, {"text": "the clickbait gossip. And ultimately here is where I stand on this issue,", "start": 115.769, "duration": 3.056}, {"text": "I understand that It must be extremely frustrating", "start": 118.825, "duration": 2.135}, {"text": "to essentially be told because of the way you were born,  the gender that you were born, you could not get the same", "start": 121.06, "duration": 5.62}, {"text": "opportunity to stream with ninja, get that boost with ninja. It can feel very much like it's even more of a boys club", "start": 126.76, "duration": 5.64}, {"text": "because the most popular people has this standard other people might follow but at the same time I am extremely", "start": 132.58, "duration": 6.1}, {"text": "sympathetic to what Tyler is talking about here.  The longest time any time", "start": 138.88, "duration": 3.8}, {"text": "we had a woman on the vlog or show Jessica Nigri, Ashley Skye", "start": 142.68, "duration": 4.169}, {"text": "Hell even even the first few months of staff and past", "start": 147.34, "duration": 3.229}, {"text": "I'd hire people like Meg Turney, Trisha Hershberger,", "start": 150.569, "duration": 2.729}, {"text": "whoever else, people would always take small key moments and go like oh look", "start": 153.7, "duration": 3.709}, {"text": "something's definitely happening there and from those situations you'd see comments in the comment section on social media,", "start": 157.409, "duration": 5.451}, {"text": "but then also people would contact my wife.  You'd send her stupid horrible shit", "start": 162.86, "duration": 4.7}, {"text": "And then I would end up feeling responsible", "start": 167.58, "duration": 1.989}, {"text": "because I just wanted to make this video.  Keep in mind my show now and my show then is just a", "start": 169.569, "duration": 4.88}, {"text": "fraction of what Tyler Blevins has now. \n So I understand his position as a husband of not wanting his wife to have to deal with that.", "start": 174.519, "duration": 5.75}, {"text": "And you could argue while he's in a position to help change the culture and a lot of people have been I think", "start": 180.269, "duration": 3.809}, {"text": "falsely saying that this is just gaming culture. Oh, yes the gaming community and the gaming world can be extremely toxic", "start": 184.389, "duration": 5.51}, {"text": "It is now limited to the gaming world for example over the weekend", "start": 189.9, "duration": 2.94}, {"text": "Tiger Woods was trending and it wasn't just because he came in second place", "start": 192.84, "duration": 2.699}, {"text": "He almost won he had an amazing final round", "start": 195.54, "duration": 2.819}, {"text": "It was also heavily because people kept sharing these pictures and short video clips of Tiger Woods hugging kept", "start": 198.359, "duration": 4.529}, {"text": "His girlfriend kept guys the golfer who beat him", "start": 202.889, "duration": 2.22}, {"text": "there's this one still that in the video seems innocent enough, but it looks like she's just like", "start": 205.109, "duration": 3.089}, {"text": "oh my god, Tiger Woods from there was just comments after comments of like, oh, you better watch a girl Oh,", "start": 208.199, "duration": 4.5}, {"text": "Jenna Sims wants Tiger Tigers back in all the ways", "start": 212.699, "duration": 2.61}, {"text": "So I look at Tyler Blevins in the situation and I go well I get where he's coming from", "start": 215.31, "duration": 3.419}, {"text": "I have personally not made the choice to not work with women or hire someone because of their gender", "start": 218.849, "duration": 4.74}, {"text": "I also hope this doesn't lead to more streamers that eventually adopt these same measures because well", "start": 223.739, "duration": 4.29}, {"text": "Why are you doing this a ninja doesn't but at the same time", "start": 228.03, "duration": 2.549}, {"text": "I can't find myself", "start": 230.579, "duration": 1.511}, {"text": "Criticizing the guy for trying to protect the person he cares most for in this world", "start": 232.09, "duration": 4.19}, {"text": "And to me personally", "start": 236.28, "duration": 0.449}, {"text": "It feels like a PR wise he's in this lose-lose situation and he's choosing the lose that involves his wife", "start": 236.729, "duration": 5.67}, {"text": "Most likely getting a lot less harassment", "start": 242.4, "duration": 1.86}, {"text": "But with all that said that's the story my personal feelings that I'm still trying to digest on it and I pass the questions off", "start": 244.26, "duration": 5.43}, {"text": "To you you feel like Tyler is being unjustly", "start": 249.69, "duration": 2.279}, {"text": "Criticized here or know what he's doing is an issue and and all opinions you have on this one", "start": 252.25, "duration": 4.549}, {"text": "I'd love to see those comments down below then and just some quickie", "start": 256.799, "duration": 2.7}, {"text": "random news if you were looking for a copy like a real-world copy of the New York Post today and have not been able to", "start": 259.69, "duration": 5.389}, {"text": "Find one it's because the New York Post has been the latest thing to be supreme", "start": 265.08, "duration": 4.11}, {"text": "And if this is a finger", "start": 269.19, "duration": 0.97}, {"text": "familiar with it's a thing that already exists in the world getting slapped with a supreme logo and all of a sudden becomes a collector's", "start": 270.16, "duration": 5.269}, {"text": "Item that is sold for much higher on a secondary mark Freeman today wrap around promotion of the paper and there were reports that people", "start": 275.43, "duration": 5.76}, {"text": "Are just going to newsstands and buying all of them your newsstands in New York at 7:15 a.m", "start": 281.19, "duration": 4.41}, {"text": "Saying you know someone came in they bought all of them for a dollar a pop", "start": 285.82, "duration": 3.109}, {"text": "We're sold out just hours. Later", "start": 288.93, "duration": 1.41}, {"text": "You had copies on eBay going for 10 12 dollars if people trying to sell them bulk on Twitter", "start": 290.34, "duration": 5.25}, {"text": "And here's the thing while I try to work past it, but I am incredibly", "start": 295.59, "duration": 2.82}, {"text": "Judgmental of anyone that is buying this for 10 20, whatever this goes for in the future", "start": 299.11, "duration": 5.51}, {"text": "And while I find it equally frustrating and amazing that people will pay top dollar for anything. Where you slap a", "start": 304.62, "duration": 5.7}, {"text": "Single-word logo on it. Although I will say you want to snag one of our pretentious tees. They're limited edition", "start": 310.57, "duration": 4.579}, {"text": "specifically they are limited to the number of people that will order them for the lifetime of the design the next 36 hours if you", "start": 316.0, "duration": 5.989}, {"text": "Use coupon code hypocrite, you'll get 10% off that shirt", "start": 321.99, "duration": 2.85}, {"text": "but I actually have a lot of respect for the people with the", "start": 324.84, "duration": 2.25}, {"text": "Forethought and the hustle to go buy all of these for a dollar knowing that there are cloud chasers out there", "start": 327.16, "duration": 5.72}, {"text": "That'll be like I have to have it if t dollars of course. I'm a Framus", "start": 332.88, "duration": 3.209}, {"text": "so I guess really just respect to them and only them and also this is a thing that exists in the world from that I", "start": 336.09, "duration": 5.399}, {"text": "want to share some stuff I loved today and today in awesome brought to you by Squarespace whether you need a domain a", "start": 341.49, "duration": 5.52}, {"text": "Website an online store make it with Squarespace", "start": 347.169, "duration": 2.36}, {"text": "It's just so easy to make a beautiful website or online store with Squarespace is all-in-one platform", "start": 349.53, "duration": 4.559}, {"text": "I mean you have nothing to install patch or upgrade ever", "start": 354.09, "duration": 3.029}, {"text": "But if you want to tweak and you want to make it your own you can and so if you want to make the smart", "start": 357.12, "duration": 4.529}, {"text": "Move like many from the nation already have go to squarespace.com", "start": 361.65, "duration": 2.07}, {"text": "Slash fails start your free trial and when you realize you love it", "start": 364.0, "duration": 3.079}, {"text": "Make sure you enter an offer code fail for 10% off your first purchase the first but of all we had today was Ken Jeong", "start": 367.08, "duration": 4.8}, {"text": "answering the web's most searched questions", "start": 371.889, "duration": 2.089}, {"text": "And if you're the mode question everything about existence", "start": 373.979, "duration": 2.58}, {"text": "We've got wormholes explain breaking space-time and we got a sneak peak for Ralph breaks", "start": 376.56, "duration": 3.779}, {"text": "The internet knows I need a dough brave teaching you bulgarian slang Cristiano", "start": 380.34, "duration": 3.529}, {"text": "Though on sneaker shopping got more awesome from the infographic show on weird things", "start": 384.689, "duration": 3.899}, {"text": "Americans do if you want to see the full versions of everything I just share the secret link of the day anything at all", "start": 388.659, "duration": 4.94}, {"text": "Links as always are in the description down below then let's talk about what happened at Seattle Tacoma International", "start": 393.729, "duration": 4.099}, {"text": "Airport if you didn't see on Friday horizon air employee Richard Russell stole a plane Russell was a ground service agent", "start": 398.319, "duration": 5.75}, {"text": "his", "start": 404.069, "duration": 0.4}, {"text": "Responsibilities included towing and pushing the aircraft for takeoff and gate approach the icing them handling baggage", "start": 404.469, "duration": 5.51}, {"text": "according to reports Russell used a pushback tractor to move a", "start": 410.009, "duration": 2.309}, {"text": "76 twin-engine turboprop plane from a maintenance area into a position where he was able to take off and at 7:32 p.m", "start": 412.449, "duration": 5.66}, {"text": "That's exactly what he did", "start": 418.11, "duration": 1.229}, {"text": "He took off without clearance and he ended up staying in the air for over an hour while he was up there", "start": 419.339, "duration": 3.6}, {"text": "He was followed by two", "start": 422.939, "duration": 0.7}, {"text": "F-15 jets from the air national guard's of Washington and Oregon and while Russell was up in the air", "start": 423.639, "duration": 3.979}, {"text": "He periodically spoke with air traffic control and for me. It was it's genuinely heartbreaking", "start": 427.619, "duration": 5.399}, {"text": "he seems apologetic and references his mental health a lot of people care about me and", "start": 433.05, "duration": 4.799}, {"text": "It's gonna disappoint them", "start": 439.779, "duration": 2.0}, {"text": "To you that I did this I would like to apologize to each and every one of them", "start": 443.289, "duration": 6.289}, {"text": "Just a broken guy", "start": 452.259, "duration": 2.0}, {"text": "Got a few screws loose", "start": 454.809, "duration": 1.46}, {"text": "I guess never really knew it", "start": 456.269, "duration": 2.0}, {"text": "till now and there are a few times during the audio that we have where air traffic control tries to get him to land but", "start": 458.349, "duration": 4.88}, {"text": "He keeps either either changing the subject or making excuses. That's McCord airfield. Oh", "start": 463.229, "duration": 4.739}, {"text": "Man, those guys were rough. I tried man in there. I think I I think I might mess something up there, too", "start": 468.939, "duration": 5.779}, {"text": "I wouldn't want to do that", "start": 474.719, "duration": 2.0}, {"text": "Hopefully, oh, they probably got anti-aircraft", "start": 476.86, "duration": 2.659}, {"text": "Now they don't have any of that stuff", "start": 480.219, "duration": 2.0}, {"text": "We're just trying to find a place for you to land safely", "start": 482.86, "duration": 2.509}, {"text": "As long as how he even knows how to fly the plane. He says that he's played video game", "start": 485.369, "duration": 3.45}, {"text": "They're just flying the plane around you seem comfortable with that", "start": 488.819, "duration": 3.509}, {"text": "And their other moments where you can't tell if Russell is joking around or it's just a", "start": 498.669, "duration": 3.979}, {"text": "Representative of his mental state then talks about how he wants to do a trick with the plane", "start": 502.959, "duration": 3.5}, {"text": "Safety same kind of banner think of", "start": 510.479, "duration": 2.359}, {"text": "In which I do a barrel roll and if that goes good, that's good. No Salman", "start": 513.63, "duration": 4.819}, {"text": "And there's also video of him actually doing all of this with the plane, but then you hear in the audio", "start": 519.18, "duration": 4.969}, {"text": "It seems he never planned on actually landing", "start": 524.149, "duration": 2.04}, {"text": "Alright richest captain bill", "start": 528.69, "duration": 2.0}, {"text": "Congratulations. He did know it's let's turn to playing that airplane safely and not hurt everybody on the ground. I", "start": 530.88, "duration": 5.959}, {"text": "Was kinda hoping I was gonna be it, you know and ultimately the plane crash into", "start": 543.63, "duration": 3.409}, {"text": "kietryn Island", "start": 547.04, "duration": 0.72}, {"text": "Which is approximately 25 to 30 miles away from the airport what they found was that there was a fire started from the crash", "start": 547.76, "duration": 4.589}, {"text": "Russell died, but there were also no other injuries and no other structures were hit and following all of this", "start": 552.48, "duration": 4.969}, {"text": "What we know now is that the FBI is leading an investigation", "start": 557.449, "duration": 2.0}, {"text": "into the incident with the help of the", "start": 559.649, "duration": 1.771}, {"text": "NTSB the FBI field office in Seattle saying in a statement", "start": 561.42, "duration": 2.39}, {"text": "We are going to be thorough which means taking the time needed to scour the area delve into the background of the individual believed responsible", "start": 563.81, "duration": 5.399}, {"text": "And review every aspect of this incident with all appropriate public and private partners also at a press conference on Saturday you had Alaska Air", "start": 569.43, "duration": 6.44}, {"text": "Group CEO Brad Tilden saying that he sent sympathy to the family saying that they'll try to learn what they can from this tragedy all", "start": 575.87, "duration": 5.849}, {"text": "23,000 of us", "start": 582.329, "duration": 2.0}, {"text": "What express our sincere sympathy?", "start": 584.339, "duration": 2.27}, {"text": "To his family his loved ones and his co-workers safety is our number-one", "start": 587.25, "duration": 5.269}, {"text": "Goal, there's nothing more important to us", "start": 593.04, "duration": 2.419}, {"text": "Last night's event is going to push us to learn what we can from this tragedy", "start": 595.829, "duration": 4.16}, {"text": "So that we can ensure this does not happen again at Alaska Air Group", "start": 600.329, "duration": 3.92}, {"text": "Or at any other airline but also seemingly calling into question how Russell could have known how to do what he did saying there were", "start": 604.8, "duration": 6.349}, {"text": "Some maneuvers that were done that were incredible maneuvers", "start": 611.149, "duration": 2.22}, {"text": "I don't know how he achieved the experience that he did but on that note as of right now. It's unclear for us", "start": 613.37, "duration": 3.929}, {"text": "Whatever taken flight", "start": 617.3, "duration": 0.789}, {"text": "lessons are used a flight simulator as far as his background according to reports Russell actually passed all of his necessary background checks and while", "start": 618.089, "duration": 5.6}, {"text": "The FBI says they don't believe that this is connected anyway to terrorism that this incident has exposed a security gap", "start": 623.69, "duration": 4.949}, {"text": "There was also a statement after this from the family where they say they were stunned and heartbroken", "start": 628.639, "duration": 3.69}, {"text": "He was a faithful husband a loving son a good friend right now", "start": 632.329, "duration": 2.88}, {"text": "I'm not fully sure where this story ends even showing his face and name", "start": 635.209, "duration": 4.2}, {"text": "I end up being conflicted even though it appeared that he never intended to harm another individual", "start": 639.649, "duration": 3.659}, {"text": "he ended up being the only", "start": 643.309, "duration": 0.88}, {"text": "Casualty from this does it make sense for us to use the same rules that we've had for years for mass murderers where we don't?", "start": 644.189, "duration": 4.91}, {"text": "want to essentially incentivize people to think if they do something big and", "start": 649.1, "duration": 3.419}, {"text": "Horrible to themselves that we'll talk about that right make their name and image", "start": 652.649, "duration": 3.619}, {"text": "Infamous or do we feature that person because it's important to remember that this was a human being who had mental health?", "start": 656.369, "duration": 6.11}, {"text": "Problems and by showcasing a person and their name you make them more relatable", "start": 662.639, "duration": 3.679}, {"text": "and so you make the mental health conversation more digestible to someone that maybe", "start": 666.319, "duration": 4.32}, {"text": "Scoffs at mental health topics or says it's for the weak", "start": 670.98, "duration": 2.809}, {"text": "So I'm torn on it and I'm trying to figure that part out then the other part of my brain", "start": 673.79, "duration": 3.239}, {"text": "I wonder about security", "start": 677.029, "duration": 1.59}, {"text": "I personally agree with Errol souther as a former FBI agent and", "start": 678.619, "duration": 2.76}, {"text": "Transportation security expert who said the greatest threat we have to aviation is the insider threat here", "start": 681.54, "duration": 4.19}, {"text": "We have an employee who was vetted to the level to have access to the aircraft and had a skill set proficient enough to take", "start": 685.73, "duration": 4.619}, {"text": "off with that plane", "start": 690.35, "duration": 0.719}, {"text": "And I wonder is there ever a way to fully be 100% secure when it comes to some sort of mental health issue?", "start": 691.069, "duration": 5.19}, {"text": "I mean the situation brings up memories and a slight comparison to Germanwings flight", "start": 696.259, "duration": 3.57}, {"text": "9525 back in 2015 the copilot of that flight", "start": 700.079, "duration": 2.96}, {"text": "Once the captain was outside lock the cockpit door deliberately crashed the plane and following that horrific tragedy", "start": 703.04, "duration": 5.399}, {"text": "There was a lot more conversation about how many people should be in the cockpit at minimum", "start": 708.439, "duration": 3.42}, {"text": "Oh, then let's have a renewed focus on mental health and and giving people opportunities and utilities and things in their lives", "start": 711.92, "duration": 5.969}, {"text": "I don't know and obviously I don't want to fully compare the two with with the person that we're talking about today", "start": 718.129, "duration": 4.65}, {"text": "They they seemingly did not want to hurt anyone else", "start": 722.939, "duration": 3.29}, {"text": "Whereas the deliberate crash in 2015 had a fatality count of 150 where I leave", "start": 726.35, "duration": 4.619}, {"text": "This story is a question to you on how do you feel about this whole situation?", "start": 730.97, "duration": 4.049}, {"text": "Then in every facet of life these days is a reality show news", "start": 735.24, "duration": 4.159}, {"text": "We have Omarosa and Donald Trump in the news.  Good ol Omarosa Manigault Newman.  If you don't know Omarosa is", "start": 739.399, "duration": 5.97}, {"text": "She popped through the spotlight back in 2004 when she was on Donald Trump's show The Apprentice", "start": 745.37, "duration": 3.899}, {"text": "She then had repeat appearances in 2008 and 2013", "start": 749.309, "duration": 2.54}, {"text": "she served as a director of", "start": 751.949, "duration": 1.44}, {"text": "african-american outreach for the Trump campaign and once he was elected she was hired as assistant to the president and director of", "start": 753.389, "duration": 4.669}, {"text": "Communications for the public office of public liaison and as you might remember in December of 2017 it was reported", "start": 758.129, "duration": 4.82}, {"text": "she was forced out of her job and fired by chief of staff John Kelly.  Some reports saying she had to be physically dragged from", "start": 762.949, "duration": 4.71}, {"text": "The White House after she allegedly tried to enter the presidential residence. While a stint on Celebrity Big Brother and a deal later", "start": 767.66, "duration": 5.05}, {"text": "And she is back in the news on Sunday", "start": 772.71, "duration": 1.95}, {"text": "Omorosa went on NBC's Meet the Press with Chuck Todd to promote her new book", "start": 774.66, "duration": 3.239}, {"text": "unhinged an insider account of the Trump White House in which she calls the president a racist a bigot and a", "start": 778.09, "duration": 5.0}, {"text": "misogynist before the interview even started Meet the Press played a secret according that Omarosa made of john kelly firing her there are", "start": 783.31, "duration": 6.649}, {"text": "pretty significant", "start": 790.87, "duration": 2.0}, {"text": "Legal issues that we hope don't develop into something that", "start": 794.23, "duration": 3.95}, {"text": "That will make it ugly for you. But I think it's important to understand that if we make this a friendly departure", "start": 799.03, "duration": 5.75}, {"text": "We can all be you know", "start": 805.84, "duration": 1.76}, {"text": "You can look at look at your time here. And the White House is a year of service to the nation", "start": 807.6, "duration": 5.52}, {"text": "and then you can go on without any type of", "start": 813.96, "duration": 2.04}, {"text": "difficulty in the future relative to your reputation and we then hear Omarosa ask if she can ask a couple of questions kelly says that", "start": 817.2, "duration": 5.78}, {"text": "Is a non-negotiable?", "start": 822.99, "duration": 1.23}, {"text": "Conversation and as far as where this recording took place reportedly it was in the Situation Room talking the real", "start": 824.23, "duration": 4.789}, {"text": "Situation Room not like where wolf Blitzer's plopping around? And so that was keeping score at home Omarosa", "start": 829.42, "duration": 5.0}, {"text": "just admitted to secretly reporting the White House chief of staff in one of the most sensitive rooms on the planet its secure room that", "start": 834.42, "duration": 6.539}, {"text": "She generally used for national security", "start": 840.96, "duration": 1.21}, {"text": "crises and where cell phones are not allowed during this interview Chuck Todd also asked if Donald Trump knew that she was being fired and", "start": 842.17, "duration": 5.63}, {"text": "This will be notable in a second, but she responds", "start": 847.8, "duration": 1.98}, {"text": "I know he knows because I've talked to him subsequently and he said he delegated I delegate it", "start": 849.78, "duration": 5.82}, {"text": "So he knew he knew that John Kelly was gonna take me into the Situation Room and lock me in there", "start": 855.82, "duration": 4.759}, {"text": "Threaten me and say that things were gonna get ugly for me and there would be damage to my reputation during the interview", "start": 860.89, "duration": 5.06}, {"text": "She also said she was complicit in the lying of this administration does and did also commenting on the president's mental health", "start": 865.95, "duration": 5.789}, {"text": "I was complicit with this White House deceiving this nation. They continue to deceive this nation by how mentally declined he is", "start": 871.74, "duration": 7.559}, {"text": "How difficult it is", "start": 879.3, "duration": 0.96}, {"text": "It is for him to process complex information how he is not engaged in some of the most important decisions that impacts our country", "start": 880.26, "duration": 7.71}, {"text": "I was complicit of for that. I regret she closed by saying several former employees have nba's where they're being paid", "start": 887.97, "duration": 5.549}, {"text": "$15,000 a month for their silence. In fact, there are several", "start": 894.07, "duration": 2.779}, {"text": "Former employees from the White House who actually signed this agreement who are all being paid", "start": 897.6, "duration": 4.4}, {"text": "$15,000 for their silence. So then this morning not even a full 24 hours later", "start": 902.48, "duration": 4.78}, {"text": "Omarosa is on the Today Show and she releases another audio clip and in this one she secretly recorded the President of the United States", "start": 907.38, "duration": 7.34}, {"text": "Who was saying that he was unaware of this fire?", "start": 914.89, "duration": 2.69}, {"text": "What happened general Kelly", "start": 921.7, "duration": 2.0}, {"text": "General Kelly came to me and said that you guys wanted me to leave", "start": 924.31, "duration": 3.109}, {"text": "No, I nobody even told me about it. No, you know, they run a big operation, but I", "start": 928.0, "duration": 4.94}, {"text": "Didn't like I said Omarosa statement the day before all of a sudden there appears to be a discrepancy on that note", "start": 939.01, "duration": 4.729}, {"text": "She says that there were subsequent conversations and this interview. She specifically uses the word probably right?", "start": 943.74, "duration": 4.86}, {"text": "This tape shows him saying I didn't know you were fired. Is he lying? Yes, because there were subsequent calls after that", "start": 948.6, "duration": 5.549}, {"text": "okay, there is a", "start": 954.31, "duration": 2.0}, {"text": "Complete organization between the two of them. He probably instructed general Kelly to do it", "start": 956.38, "duration": 6.14}, {"text": "So they keep his hands clean when he spoke to me", "start": 962.52, "duration": 2.07}, {"text": "we know that there's a recording but she also seems a lot less definitive as far as who actually", "start": 964.59, "duration": 3.149}, {"text": "Pulled the trigger as far as his Omarosa worried about the legal consequences here", "start": 967.9, "duration": 3.44}, {"text": "if she said are you concerned are you absolutely not because I have", "start": 971.34, "duration": 3.57}, {"text": "Protections the moment that I've decided to blow the whistle on a lot of the corruption going on in the White House there are protections", "start": 975.01, "duration": 5.33}, {"text": "That afforded it to me", "start": 980.34, "duration": 1.17}, {"text": "There's also a part of this interview about allegations that there's a tape with the president saying the n-word on it says there's multiple tapes", "start": 981.51, "duration": 4.919}, {"text": "Of it, but I'm not really covering that part because it doesn't really pertain to what we actually have right now", "start": 986.43, "duration": 4.14}, {"text": "And as far as the reaction from Trump's camp, obviously they were none too happy", "start": 990.57, "duration": 3.9}, {"text": "Even before these interviews aired you had White House", "start": 994.48, "duration": 1.94}, {"text": "Press secretary", "start": 996.42, "duration": 0.46}, {"text": "Sarah Huckabee Sanders saying it's sad that a disgruntled former White House employees trying to profit off these false attacks and even worse that the", "start": 996.88, "duration": 6.469}, {"text": "Media would now give her a platform after not taking her seriously when she had only positive things to say about the president during her", "start": 1003.35, "duration": 5.61}, {"text": "Time in the administration and on Sunday after the recording aired Sanders said that it was a blatant disregard for our national security", "start": 1008.96, "duration": 5.639}, {"text": "Then adding to brag about it on national television", "start": 1014.7, "duration": 2.029}, {"text": "Further proves a lack of character and integrity of this disgruntled former White House employee", "start": 1016.86, "duration": 3.98}, {"text": "You also have Rhonda McDaniel the chairwoman of the GOP tweeting that it isn't just wildly inappropriate", "start": 1020.84, "duration": 3.989}, {"text": "It's a threat to our national security if she broke federal law", "start": 1024.839, "duration": 2.869}, {"text": "She should be prosecuted from Slayer Giuliani on Fox and Friends said that it was violating national security regulation", "start": 1027.709, "duration": 5.58}, {"text": "She certainly violating national security regulations, which I think have the force of law", "start": 1033.32, "duration": 4.439}, {"text": "Yeah, I would think she is I mean I have to look at it more carefully and if she is she violating every", "start": 1039.34, "duration": 4.559}, {"text": "Every every bit of trust and that she that people should have in someone and then we had president Trump responding on Twitter", "start": 1044.84, "duration": 6.109}, {"text": "Whacky Omarosa who guy fired three times on the apprentice now got fired for the last time", "start": 1050.95, "duration": 3.959}, {"text": "She never made it never will he begged me for a job tears in her eyes?", "start": 1054.91, "duration": 3.119}, {"text": "I said okay people in the White House hated her she was vicious but not smart", "start": 1058.03, "duration": 3.54}, {"text": "I would rarely see her but heard really bad things nasty to people and would constantly miss meetings and work general", "start": 1061.57, "duration": 5.369}, {"text": "Kelly came on board. He told me she was a loser and nothing but problems", "start": 1066.94, "duration": 2.699}, {"text": "I told him to try working it out if possible because she only said great things about me until she got fired", "start": 1069.64, "duration": 4.47}, {"text": "well\nI know it's quote not presidential to take on a low-life like", "start": 1074.11, "duration": 2.789}, {"text": "Omarosa and while I would rather not be doing so this is a modern-day form of", "start": 1077.0, "duration": 3.5}, {"text": "Communication and I know the fake news media will be working overtime to make even wacky Omarosa look legitimate as possible", "start": 1080.63, "duration": 5.6}, {"text": "Sorry and adding wacky Omarosa already has a fully signed non-disclosure agreement", "start": 1086.23, "duration": 4.169}, {"text": "So that is where we are right now", "start": 1090.4, "duration": 1.05}, {"text": "but honestly the way the situation is just coming out there could be five more updates by tomorrow as far as where I personally", "start": 1091.45, "duration": 5.91}, {"text": "Land with this story is in the drama of this story really doesn't stand out to me", "start": 1097.43, "duration": 4.339}, {"text": "I'm not gonna be one of the people that buys her book because unless it is a 100%", "start": 1101.77, "duration": 3.989}, {"text": "valid recording that I can hear", "start": 1105.95, "duration": 2.03}, {"text": "I don't personally believe a word coming out of her mouth write your opinion on if someone is trustworthy or not should not immediately", "start": 1107.98, "duration": 4.949}, {"text": "Change once they switch team", "start": 1113.03, "duration": 1.58}, {"text": "I have a personal belief that in life paranoia and skepticism is a strength", "start": 1114.61, "duration": 4.139}, {"text": "and for now", "start": 1118.75, "duration": 0.48}, {"text": "what I'm wondering is the", "start": 1119.23, "duration": 1.27}, {"text": "legality of this", "start": 1120.5, "duration": 0.9}, {"text": "situation right strip away the names you're talking about the President of the United States being secretly recorded by someone who was a part of", "start": 1121.4, "duration": 5.78}, {"text": "His staff you have a member of staff secretly recording in the Situation Room", "start": 1127.18, "duration": 3.9}, {"text": "And we look to the laws in Washington DC and there is one party consent recording there", "start": 1131.08, "duration": 4.29}, {"text": "Meaning that legally speaking only one person has to approve the recording", "start": 1135.37, "duration": 2.939}, {"text": "So in that sense, you didn't break the law", "start": 1138.31, "duration": 1.26}, {"text": "But the White House has specific rules regarding national", "start": 1139.57, "duration": 2.189}, {"text": "Security and so if some scholars saying because this recording took place in an area that is normally used for highly sensitive national security meetings", "start": 1141.86, "duration": 6.049}, {"text": "She could be charged and specifically would be under Title 18 section seven nine three of the u.s", "start": 1147.91, "duration": 4.469}, {"text": "Code which makes it a crime to leak national defense information one", "start": 1152.38, "duration": 2.7}, {"text": "the information is", "start": 1155.08, "duration": 1.0}, {"text": "transmitted, two it is defense related information and three the person leaking that information has the intent or knowledge that the information will be used", "start": 1156.08, "duration": 6.349}, {"text": "For America's detriment or in other countries benefit", "start": 1162.43, "duration": 2.609}, {"text": "but also at the same time with the audio that we have heard thus far it doesn't necessarily seem to check all those boxes but", "start": 1165.04, "duration": 5.4}, {"text": "At the same time once again you could also argue", "start": 1170.44, "duration": 1.8}, {"text": "She did violate her agreement to abide by", "start": 1172.24, "duration": 1.75}, {"text": "Specific protocols when she applied for her security clearance as far as Omarosa saying she is safe because she's a whistleblower", "start": 1173.99, "duration": 5.6}, {"text": "I don't I don't know if necessarily with the recordings we have right now", "start": 1179.59, "duration": 3.51}, {"text": "What she is a whistleblower for we have so far as you were going to be fired", "start": 1183.26, "duration": 3.83}, {"text": "Here's a situation which could be seen as a veiled threat and the president acting surprised like oh man", "start": 1187.16, "duration": 4.91}, {"text": "You got fought what and then the same person that took the secret recording was like no we later had other conversations", "start": 1192.07, "duration": 4.589}, {"text": "And yeah, he actually probably no no", "start": 1196.66, "duration": 2.19}, {"text": "No\nThe last thing that I will say on this it is so interesting", "start": 1198.85, "duration": 2.97}, {"text": "Every time you have someone that worked at the White House leaving on bad terms because someone who was previously just all of the best", "start": 1201.89, "duration": 6.739}, {"text": "Thing is immediately characterized as the worst most disgusting most", "start": 1208.63, "duration": 3.96}, {"text": "Exploitive person which then leads to the question if that was the case. Why did you bring them into the White House?", "start": 1212.96, "duration": 6.469}, {"text": "How would seem to either not make sense or not be the best of decision-maker?", "start": 1219.46, "duration": 4.229}, {"text": "But with all of that said I do want to pass the question off to you", "start": 1223.81, "duration": 2.489}, {"text": "What are your thoughts about this train wreck of a situation you trust her. Do you kind of trust her?", "start": 1226.3, "duration": 4.8}, {"text": "You're skeptical or you think she's just outright lying why why not any of the good stuff? Let me know down below", "start": 1231.1, "duration": 4.77}, {"text": "That's we're going to end today's show. And of course remember, this is also a conversation", "start": 1235.88, "duration": 3.29}, {"text": "so whether it be the last story the first one anything in between", "start": 1239.17, "duration": 2.819}, {"text": "Let me know what you're thinking in those comments down below also while you're at it if you like this daily swing at the news", "start": 1241.99, "duration": 4.41}, {"text": "Hit that like button. If you're new here hit that subscribe button", "start": 1246.4, "duration": 2.369}, {"text": "So you don't miss a bus that said of course as always, my name is philip. Defranco. You've just been phill'd in a love", "start": 1248.77, "duration": 5.369}, {"text": "Yo faces, and i'll see you tomorrow", "start": 1254.14, "duration": 2.04}]