[{"text": "Sponsored by Squarespace from websites and online stores to marketing tools and analytics Squarespace is the all-in-one", "start": 0.52, "duration": 5.87}, {"text": "Platform to build a beautiful online presence. Ok, guys", "start": 6.73, "duration": 3.049}, {"text": "So a few years back on our patreon page some of the patrons were like hey, you guys should do a meetup in Nashville", "start": 9.78, "duration": 6.329}, {"text": "So that you know, we could all hang out", "start": 16.109, "duration": 1.441}, {"text": "well", "start": 17.55, "duration": 0.45}, {"text": "It turned out that it wasn't a few patrons that ended up being a lot more", "start": 18.0, "duration": 3.209}, {"text": "than we thought and then we did it the next year after that and it was even more and it was actually kind of", "start": 21.31, "duration": 5.12}, {"text": "Probably illegal how many people were stuffed into one house so we decided to get a venue and have it again this year", "start": 26.59, "duration": 5.84}, {"text": "I remember the first year we did blimey uh we were so nervous that", "start": 52.17, "duration": 4.44}, {"text": "we weren't going to know what to do with all of these people that were coming to our houses and", "start": 56.92, "duration": 4.79}, {"text": "But then I remember that first night that everybody got here", "start": 62.77, "duration": 3.38}, {"text": "We were all having so much fun and people were just like hanging out with each other and they'd all become such good friends", "start": 66.85, "duration": 4.819}, {"text": "That like there wasn't any pressure on us to like be entertaining. My favorite thing about blimeycon was probably coming and getting to meet all these really cool people", "start": 71.86, "duration": 7.549}, {"text": "My favorite thing about blimeycon was just meeting everyone meeting all the people", "start": 80.64, "duration": 5.389}, {"text": "This was the place where I got to meet my internet friends for the first time. Yeah, it's cool", "start": 86.04, "duration": 4.669}, {"text": "Looking around and seeing all these people who are such good friends now", "start": 90.71, "duration": 3.36}, {"text": "when they would have", "start": 94.56, "duration": 1.14}, {"text": "Probably never met if it wasn't for these only videos that we do", "start": 95.7, "duration": 3.95}, {"text": "I've become really good friends with a lot of the people - so it's blimeycon is like my favorite time of year", "start": 99.65, "duration": 4.949}, {"text": "Because all my friends are in one place, even if you don't know someone here you feel like you do anyway", "start": 104.76, "duration": 5.209}, {"text": "Just because you have so much in common already. You just become best friends through it", "start": 109.98, "duration": 3.559}, {"text": "From the moment it started I enjoyed myself immensely everybody's been so nice", "start": 113.54, "duration": 3.66}, {"text": "I'd say that the majority of people I could count as friends come from the blimeycow community. I became a patron", "start": 117.54, "duration": 6.26}, {"text": "Just to come to blimeycon. The film festival was really really cool to watch", "start": 124.35, "duration": 4.31}, {"text": "I loved seeing all the creativity from all the various patrons how they were working together", "start": 128.66, "duration": 4.559}, {"text": "And I mean, honestly", "start": 133.22, "duration": 1.41}, {"text": "It seemed like it was a real bonding experience for everybody and it was  just a lot of fun to watch", "start": 134.63, "duration": 4.109}, {"text": "I thought it was really cool that we had like an impromptu swing dance party", "start": 138.739, "duration": 3.75}, {"text": "There was something that was a little bit unexpected because we didn't know we were gonna be doing that", "start": 142.489, "duration": 3.24}, {"text": "but we got the suggestion to do that and that's something that", "start": 146.04, "duration": 2.539}, {"text": "Jordan and I really", "start": 148.89, "duration": 0.99}, {"text": "enjoy doing so it was really fun getting to share that with everyone if all of this looks really fun to you and you want", "start": 149.88, "duration": 4.819}, {"text": "To be a part of the cowMOOnity as it has been dubbed. That's cow Moo nity and go to", "start": 154.7, "duration": 4.949}, {"text": "Patreon.com/blimeycom and maybe you yes", "start": 160.17, "duration": 2.479}, {"text": "You will make the drive the truck the fly - blimeycon 2019 here and beloved, Nashville", "start": 162.65, "duration": 5.73}, {"text": "We planned this whole thing ourselves and it all came together really nicely but it was definitely stressful along the way", "start": 186.85, "duration": 6.11}, {"text": "Thankfully it was a lot easier this year because we used our website to disperse information about the event", "start": 193.03, "duration": 5.66}, {"text": "We set up a password protected page where all of our patrons could go to to get more information about the event", "start": 198.69, "duration": 6.24}, {"text": "So we want to say thank you to Squarespace where we built our site for helping us make blimeycon a lot easier to manage", "start": 204.93, "duration": 5.759}, {"text": "We built our site with Squarespace and I just love how easy it is to add pages and then quickly link people to it", "start": 210.99, "duration": 6.209}, {"text": "So that everyone can get the information", "start": 217.2, "duration": 2.43}, {"text": "We're trying to share very easily Squarespace is an all-in-one platform", "start": 219.63, "duration": 3.419}, {"text": "Which means that they do at all domains websites online stores marketing tools", "start": 223.05, "duration": 4.41}, {"text": "They'll give you a beautiful online presence", "start": 227.46, "duration": 2.25}, {"text": "Even if you have very little patience for building websites like me", "start": 229.71, "duration": 3.899}, {"text": "Their templates are award-winning and they have one no matter what you're trying to do", "start": 233.61, "duration": 3.66}, {"text": "They have 24/7 customer service if you ever need any help and now you can even transfer your third-party", "start": 237.27, "duration": 5.279}, {"text": "Domains very easily over to Squarespace. It's really easy to set up an online store, too", "start": 242.86, "duration": 4.55}, {"text": "So if you're ready to start a website make it with Squarespace", "start": 247.41, "duration": 2.699}, {"text": "Do what we did save yourself a bunch of hassle and get started at squarespace.com", "start": 250.24, "duration": 4.009}, {"text": "For a free trial and then when you're ready to launch go to Squarespace", "start": 254.83, "duration": 2.99}, {"text": ".com/cow because they're you're gonna get 10% off your first purchase again big thanks to Squarespace for all their help. Squarespace.com/cow", "start": 257.92, "duration": 8.38}, {"text": "It's just like III I could feel the the fun vibes", "start": 267.86, "duration": 3.62}, {"text": "(laughter)", "start": 273.68, "duration": 0.8}, {"text": "ow", "start": 275.8, "duration": 0.5}, {"text": "(laughter)", "start": 276.7, "duration": 0.8}, {"text": "Are you serious really", "start": 288.06, "duration": 6.5}, {"text": "Oh my gosh, you're gonna make me cry", "start": 299.4, "duration": 2.28}]