[{"text": "Dark patterns are features of interface design", "start": 8.6, "duration": 3.3}, {"text": "crafted to trick users into doing things that they might not want to do,", "start": 11.9, "duration": 4.4}, {"text": "but which benefit the business in question.", "start": 16.3, "duration": 2.8}, {"text": "Here's an example: have you ever tried to delete your Amazon account?", "start": 19.1, "duration": 4.4}, {"text": "Here's the Amazon homepage.", "start": 23.5, "duration": 1.6}, {"text": "What's the first thing you might think to do?", "start": 25.1, "duration": 2.0}, {"text": "The obvious place to look is the account drop-down, here.", "start": 27.1, "duration": 3.2}, {"text": "Once you're in here, you look around -- it's a lot of information.", "start": 30.3, "duration": 2.6}, {"text": "But if I'm interested in deleting my account, I'd think that 'Your Account' is probably a good place to go.", "start": 32.9, "duration": 5.6}, {"text": "Once I'm on this page, there's a lot more information:", "start": 38.5, "duration": 2.32}, {"text": "'Payment options', 'Login & security' and a bunch of stuff down here.", "start": 40.82, "duration": 3.98}, {"text": "Unfortunately, you could click every link on your account page", "start": 44.8, "duration": 3.2}, {"text": "but none would deliver you to a place where you could actually delete it, because it's not here.", "start": 48.0, "duration": 4.4}, {"text": "In order to actually delete your Amazon account, you have to go all the way down to the bottom of the page,", "start": 52.4, "duration": 4.4}, {"text": "and under 'Let Us Help You' click 'Help'.", "start": 56.8, "duration": 2.9}, {"text": "Once you're in here, you have to navigate to 'Need More Help?'", "start": 59.7, "duration": 2.72}, {"text": "because, y'know, putting it on this page would just be too easy.", "start": 62.42, "duration": 3.68}, {"text": "Then click 'Contact Us'.\n(This is where it starts to get ridiculous.)", "start": 66.1, "duration": 3.5}, {"text": "It's still nowhere to be seen, but of the four options on the top that you want help with,", "start": 69.6, "duration": 3.92}, {"text": "click 'Prime or Something else'.\n(You want the 'Something else'.)", "start": 73.52, "duration": 3.58}, {"text": "In this 'Tell us more about your issue' drop-down,", "start": 77.1, "duration": 2.9}, {"text": "there's still nothing that suggests account deletion;", "start": 80.0, "duration": 2.1}, {"text": "you just have to know to click 'Login and security',", "start": 82.1, "duration": 3.6}, {"text": "and then in a second drop-down,", "start": 85.7, "duration": 2.2}, {"text": "there it is, the magic button -- 'Close my account'.", "start": 87.9, "duration": 3.3}, {"text": "Except in order to actually do that, you now have to have a chat conversation with an Amazon associate", "start": 91.2, "duration": 4.0}, {"text": "who's going to tell you all the reasons account deletion is a bad idea.", "start": 95.2, "duration": 3.7}, {"text": "See, you can't delete the account yourself; \nthey have to do it for you.", "start": 98.9, "duration": 4.1}, {"text": "This is a dark pattern: a crappy user experience that intentionally makes it difficult,", "start": 103.0, "duration": 4.8}, {"text": "almost impossible without help,", "start": 107.8, "duration": 2.0}, {"text": "to do something that hurts Amazon.", "start": 109.8, "duration": 2.3}, {"text": "UX specialist Harry Brignull categorizes the specific kind of dark pattern as a 'roach motel':", "start": 112.1, "duration": 5.5}, {"text": "a design that makes it very easy for you to get into a situation, but very hard to get out.", "start": 117.6, "duration": 6.0}, {"text": "Brignull's actually the one who coined the term 'dark pattern' in 2010", "start": 123.6, "duration": 4.0}, {"text": "and he's been cataloguing and lecturing about the issue ever since.", "start": 127.6, "duration": 3.3}, {"text": "Many of these dark patterns we're all familiar with;", "start": 130.9, "duration": 2.5}, {"text": "I only have to search my email for a few seconds to find one.", "start": 133.4, "duration": 3.0}, {"text": "For example, here: I'm getting spam emails from Architectural Digest.", "start": 136.4, "duration": 4.0}, {"text": "I scroll down, and...", "start": 140.4, "duration": 2.2}, {"text": "Look at that. This is a mess, but it's a mess on purpose.", "start": 142.6, "duration": 4.1}, {"text": "The unsubscribe link is here but it's devilishly hard to see.", "start": 146.7, "duration": 3.78}, {"text": "That's because it's the same font and virtually the same color as the rest of the fine print.", "start": 150.48, "duration": 4.52}, {"text": "Here's another dark pattern that uses color to misdirect:", "start": 155.0, "duration": 2.6}, {"text": "over at the UserTestingBlog, Jennifer Derome points out that the mobile game Two Dots", "start": 157.6, "duration": 4.5}, {"text": "carries you through the experience by offering green buttons.", "start": 162.1, "duration": 3.5}, {"text": "A green button to start the game, a green button to pick a level, a green button to start the level", "start": 165.6, "duration": 4.4}, {"text": "and three green buttons to continue to the next level, and so on.", "start": 170.0, "duration": 3.7}, {"text": "But once you lose a level, the color scheme changes.", "start": 173.7, "duration": 3.34}, {"text": "The first screen button you see leads you right to an in-app purchase,", "start": 177.04, "duration": 3.46}, {"text": "while the continue button is just a little X that blends into the larger element.", "start": 180.5, "duration": 4.3}, {"text": "(I wonder how many people clicked 'Buy Moves' reflexively as a Pavlovian response.)", "start": 184.8, "duration": 5.1}, {"text": "Now to be fair, this is a pretty benign dark pattern,", "start": 189.9, "duration": 2.6}, {"text": "but it shows how companies can use something as simple as color to trick you into doing what they want.", "start": 192.5, "duration": 5.1}, {"text": "On the more egregious end of the spectrum, you have stuff like", "start": 197.6, "duration": 2.5}, {"text": "this banner ad for Chatmost, which is made to look like it has a speck of dust on it,", "start": 200.1, "duration": 4.5}, {"text": "causing people to brush it away and accidentally click the link.", "start": 204.6, "duration": 4.1}, {"text": "Or you have sites like Booking.com where they do everything in their power", "start": 208.7, "duration": 4.1}, {"text": "to increase the urgency of a purchase,", "start": 212.8, "duration": 3.1}, {"text": "going so far as to alert you in big red notifications of the hotel rooms that you *just* missed.", "start": 215.9, "duration": 6.6}, {"text": "(I mean, you better book now. You don't want to be left behind again, do you?)", "start": 222.5, "duration": 3.8}, {"text": "Every once in a while, a company goes a little too far and actually breaks the law.", "start": 226.3, "duration": 4.0}, {"text": "Remember when you used to get spam with all those LinkedIn invites from friends?", "start": 230.3, "duration": 3.8}, {"text": "Well, that was because of a confusing dark pattern on their 'Add Contacts' page", "start": 234.1, "duration": 3.6}, {"text": "which allowed LinkedIn to scoop up people's email contacts", "start": 237.7, "duration": 3.6}, {"text": "and send them messages repeatedly without their consent.", "start": 241.3, "duration": 3.3}, {"text": "In a comprehensive blog post, Dan Schlosser showed how LinkedIn tried to trick users eight times", "start": 244.6, "duration": 5.5}, {"text": "in their sign up and onboarding procedures into surrendering their email contacts.", "start": 250.1, "duration": 4.0}, {"text": "Unfortunately for LinkedIn, this proved to be a step too far;", "start": 254.1, "duration": 2.8}, {"text": "users filed a legal challenge claiming that", "start": 256.9, "duration": 2.1}, {"text": "sending multiple unwarranted emails hurt their professional reputation.", "start": 259.0, "duration": 4.1}, {"text": "LinkedIn settled the dispute for $13 million, which came out in the end to about $10 per user.", "start": 263.1, "duration": 6.4}, {"text": "It's rare for dark patterns face consequences like these.", "start": 269.5, "duration": 3.1}, {"text": "Mostly, they stay *just* on the right side of the law,", "start": 272.6, "duration": 3.1}, {"text": "understanding that it's hard to legislate around the psychological tricks of UX design.", "start": 275.7, "duration": 5.2}, {"text": "Everything on the internet is fighting for your attention,", "start": 280.9, "duration": 2.7}, {"text": "but there's a difference between those who are taking the time to build trust and loyalty", "start": 283.6, "duration": 5.2}, {"text": "and the special offer you clicked which actually enrolled you in a monthly subscription,", "start": 288.8, "duration": 4.1}, {"text": "or the social network that dark-patterned you into letting it sell data that you didn't even know it had.", "start": 292.9, "duration": 5.9}, {"text": "Some of the responsibility is on us but some is on design, too.", "start": 298.8, "duration": 4.4}, {"text": "And it's not the fault of the designers -- they're just doing what they're tasked to do,", "start": 303.2, "duration": 3.4}, {"text": "knowing full well that if they don't, others will.", "start": 306.6, "duration": 3.0}, {"text": "As Brignull says, \"Our best defense against the dark patterns is to be aware of them,", "start": 309.6, "duration": 5.2}, {"text": "and shame the companies who utilize them.\"", "start": 314.8, "duration": 2.4}, {"text": "Design is what mediates our interaction with the Internet: it's the language we read it in.", "start": 317.2, "duration": 5.7}, {"text": "It's not too much to ask that that language be comprehensible and honest.", "start": 322.9, "duration": 4.7}, {"text": "[Hey, everybody! Thank you so much for watching.]", "start": 333.3, "duration": 1.9}, {"text": "[This episode was brought to you by NordVPN.]", "start": 335.2, "duration": 3.1}, {"text": "[Now, if you care, like I do, a lot about your privacy and security online,]", "start": 338.3, "duration": 4.8}, {"text": "[you should absolutely be using a VPN or a virtual private network]", "start": 343.1, "duration": 5.2}, {"text": "[to keep your data safe by allowing you to connect to stuff remotely]", "start": 348.3, "duration": 4.3}, {"text": "[so that prying eyes can't see your IP address and private information.]", "start": 352.6, "duration": 4.1}, {"text": "[Personally, I've had a few hacking scares, so VPNs really help ease my mind when I'm online,]", "start": 356.7, "duration": 5.8}, {"text": "[and NordVPN is the best out there, bar none.]", "start": 362.5, "duration": 3.7}, {"text": "[If you're watching this right now, you can get 77% off a three-year plan]", "start": 366.2, "duration": 3.7}, {"text": "[by visiting www.NordVPN.com/NERDWRITER or using the promo code NERDWRITER at checkout.]", "start": 369.9, "duration": 6.9}, {"text": "[I've shopped around in this space and used a few VPNs -- NordVPN is definitely my favorite by a mile.]", "start": 376.8, "duration": 6.42}, {"text": "[Not only does it have military-grade encryption and a thousand servers in 61 countries,]", "start": 383.22, "duration": 4.98}, {"text": "[You can run it simultaneously on up to six devices, which means you can run it]", "start": 388.2, "duration": 3.7}, {"text": "[on your computers and your phones, so that when you're accessing Wi-Fi at a café (which I do a lot)]", "start": 391.9, "duration": 5.6}, {"text": "[or a restaurant or an airport, you know you'll be safe.]", "start": 397.5, "duration": 2.9}, {"text": "[And again, NordVPN is offering my viewers 77% off three-year plans.]", "start": 400.4, "duration": 4.7}, {"text": "[Just go to www.NordVPN.com/NERDWRITER or click the link in the description below]", "start": 405.1, "duration": 7.3}, {"text": "[to sign up and start protecting yourself.]", "start": 412.4, "duration": 2.2}, {"text": "[Thanks guys. I'll see you next time!]", "start": 414.6, "duration": 1.4}]