[{"text": "This video is brought to you by Squarespace.", "start": 0.36, "duration": 2.34}, {"text": "From websites and online stores, to marketing tools and analytics", "start": 2.7, "duration": 3.86}, {"text": "Squarespace is the all-in-one platform to build a beautiful online presence and run your business.", "start": 6.6, "duration": 5.04}, {"text": "[intro]", "start": 12.0, "duration": 9.2}, {"text": "This video is going to feature the conservation of a painting by the American master George Inness", "start": 21.52, "duration": 5.36}, {"text": "that was painted in 1874 during his second trip to Italy.", "start": 26.92, "duration": 4.26}, {"text": "This painting was owned by a university and a museum, and then, my clients.", "start": 31.18, "duration": 4.68}, {"text": "At some point, perhaps in the 1940s, the painting underwent a conservation", "start": 36.24, "duration": 4.16}, {"text": "whereby it was lined with an interleaf to a new piece of canvas and aluminum.", "start": 40.4, "duration": 4.98}, {"text": "After discussing this with my clients, we decided that we were going to undo all of that old", "start": 45.88, "duration": 4.84}, {"text": "conservation work and return the painting to its original state.", "start": 50.72, "duration": 3.42}, {"text": "And before I can do anything to the painting I need to face it, and the facing is really important because", "start": 54.579, "duration": 5.299}, {"text": "it will protect the painting during the handling process, and the removal of the lining.", "start": 60.1, "duration": 4.7}, {"text": "I'm using a fish gelatin glue here because I need to make sure that whatever adhesive I use", "start": 65.229, "duration": 5.96}, {"text": "to bond the washi kozo paper to the surface of the painting is soluble in a different solvent", "start": 71.35, "duration": 5.75}, {"text": "than the one I will use to remove the wax lining. For if it was soluble in the same solvent,", "start": 77.289, "duration": 5.54}, {"text": "when I remove the wax lining the facing would come off too, and it would have been all for naught.", "start": 83.229, "duration": 4.85}, {"text": "So once the washi kozo is on the surface", "start": 89.2, "duration": 3.05}, {"text": "I will add more fish gelatin glue to make sure that that bond is really, really strong.", "start": 92.25, "duration": 6.179}, {"text": "Once it's dry, I can start to remove the excess paper and begin removing the painting from the stretcher.", "start": 99.369, "duration": 7.13}, {"text": "Now this painting was secured to the stretcher with tacks,", "start": 109.6, "duration": 2.84}, {"text": "which always makes me happy; and removing them is pretty easy.", "start": 112.44, "duration": 3.98}, {"text": "Particularly given that when they penetrate through the wax, they get coated, and they become a little bit easier to pull out.", "start": 116.42, "duration": 7.2}, {"text": "Now removing the painting from the stretcher is easy", "start": 126.879, "duration": 3.11}, {"text": "but, I have to be delicate, because I don't want to cause any damage to the tacking edges.", "start": 129.989, "duration": 5.051}, {"text": "and when I remove this stretcher I'm surprised to find that at some point, probably the last conservator,", "start": 135.78, "duration": 5.82}, {"text": "decided to staple it together on the inside. And this renders it no longer able to provide", "start": 141.82, "duration": 6.169}, {"text": "tension, and a fixed strainer.", "start": 148.18, "duration": 2.0}, {"text": "Now before I can start removing this old wax lining, I need to do a little investigation.", "start": 151.24, "duration": 5.179}, {"text": "I need to figure out what adhesive is being used and to understand the construction method of this interleafed lining.", "start": 156.42, "duration": 6.84}, {"text": "I'll peel back a corner and try to take a sample of the adhesive. And in this case, it's just beeswax.", "start": 163.96, "duration": 6.11}, {"text": "There's been no resins or other modifiers to it.", "start": 170.4, "duration": 3.04}, {"text": "In addition, there's a thin sheet of what appears to be muslin attached to the aluminum.", "start": 173.44, "duration": 5.34}, {"text": "I'm going to take the painting back to my hot table", "start": 179.74, "duration": 2.56}, {"text": "which has been heating up over the past 20 or so minutes to about 135 degrees.", "start": 182.31, "duration": 4.68}, {"text": "One of the nice things about working with wax", "start": 187.51, "duration": 2.0}, {"text": "even though it's messy and an imperfect material, is that it's fairly easy to reverse with simple heat.", "start": 189.64, "duration": 5.72}, {"text": "I'll put a piece of P.E.T. film down on the aluminum of my hot table so that I don't make a mess", "start": 195.76, "duration": 5.08}, {"text": "and I'll allow the painting to rest on the heated up surface", "start": 200.84, "duration": 3.52}, {"text": "until the wax has started to become soft and soluble.", "start": 204.36, "duration": 4.14}, {"text": "I'll just very slowly begin to lift up the painting from the wax.", "start": 212.14, "duration": 5.68}, {"text": "I can use tools if necessary", "start": 217.82, "duration": 2.0}, {"text": "but I'm not putting a lot of stress, or tension, or force on the painting.", "start": 219.96, "duration": 5.34}, {"text": "The nice thing about wax is that once it melts it has no adhesive properties", "start": 225.3, "duration": 4.04}, {"text": "and so the painting releases fairly easily.", "start": 229.34, "duration": 2.62}, {"text": "One of the reasons I only used one layer of washi kozo", "start": 232.54, "duration": 3.78}, {"text": "is because of, had I built up multiple layers or even faced the painting with a piece of canvas,", "start": 236.32, "duration": 4.94}, {"text": "it would have been too rigid and wouldn't have allowed me to flex the canvas and the painting", "start": 241.36, "duration": 5.54}, {"text": "and to pull the painting off of this lining.", "start": 247.46, "duration": 3.3}, {"text": "Now it's nice to work over the hot table when it's winter, but during the summer", "start": 251.26, "duration": 4.26}, {"text": "spending an hour or so on top of a hundred and thirty-five degree piece of aluminum isn't so much fun.", "start": 256.06, "duration": 6.049}, {"text": "But there's no easy way to do this and there's no way to rush it. As you can see,", "start": 262.24, "duration": 4.309}, {"text": "it's a very slow process", "start": 266.55, "duration": 2.0}, {"text": "and where necessary I will use the tools to remove the canvas", "start": 268.68, "duration": 4.38}, {"text": "from the lining, because I want to make sure that nothing is lost.", "start": 273.25, "duration": 3.47}, {"text": "And I'll continue to work slowly just allowing", "start": 279.46, "duration": 4.01}, {"text": "the wax to release", "start": 284.16, "duration": 2.0}, {"text": "and pulling off this canvas", "start": 286.46, "duration": 2.04}, {"text": "from the lining.", "start": 288.669, "duration": 2.0}, {"text": "And as you can see, it doesn't take much effort to release the painting.", "start": 301.92, "duration": 4.679}, {"text": "That weight in the front", "start": 309.25, "duration": 1.46}, {"text": "Is there just to keep everything in place so that it doesn't slide or lift off the table while I'm working.", "start": 310.71, "duration": 6.569}, {"text": "And so you can see,", "start": 321.49, "duration": 2.0}, {"text": "the painting comes off pretty easily.", "start": 323.98, "duration": 2.48}, {"text": "Now, I want to make sure that any pieces of the original tacking edge that had been lost or separated", "start": 327.46, "duration": 5.76}, {"text": "are maintained, so that I can use them later when I put the painting back together.", "start": 333.44, "duration": 3.78}, {"text": "Now I'm just going to disassemble this", "start": 338.02, "duration": 2.0}, {"text": "construction so that you can see: that's the muslin, that's the aluminum sheet, and then that's the", "start": 340.63, "duration": 4.61}, {"text": "lining canvas. And this is a really thick piece of aluminum.", "start": 346.15, "duration": 3.169}, {"text": "It's almost an eighth of an inch thick which is kind of overkill, but it is what it is.", "start": 349.32, "duration": 5.399}, {"text": "I'm gonna throw that all away because I don't need it.", "start": 354.72, "duration": 2.0}, {"text": "So with the painting removed", "start": 358.45, "duration": 1.43}, {"text": "I can put it back down on the hot table, lower the heat just a little bit, and allow the wax to melt.", "start": 359.88, "duration": 5.01}, {"text": "Once that wax melts", "start": 365.53, "duration": 1.55}, {"text": "it's fairly straightforward to remove.", "start": 367.08, "duration": 3.1}, {"text": "I can use a little bit of solvent to encourage it, to thin it out, and then I'll just use some", "start": 370.18, "duration": 4.96}, {"text": "wadded up cotton balls to lift off that wax from the surface.", "start": 375.28, "duration": 4.429}, {"text": "It's not difficult, I'm not using a lot of force", "start": 382.48, "duration": 2.449}, {"text": "I'm just lifting off that wax and trying to allow the cotton balls to absorb it", "start": 384.93, "duration": 5.16}, {"text": "so that there's less wax on the painting.", "start": 390.52, "duration": 3.12}, {"text": "But, this is just the first step in removing the wax,", "start": 393.64, "duration": 3.52}, {"text": "because a lot of that wax has penetrated into the canvas, and so I have to desaturate that canvas.", "start": 397.16, "duration": 5.52}, {"text": "And that's done by placing the painting on an absorbent cotton blotter paper,", "start": 402.97, "duration": 3.77}, {"text": "wrapping it in a layer of P.E.T. film,", "start": 408.7, "duration": 2.779}, {"text": "keeping the heat on the table, and", "start": 412.0, "duration": 2.0}, {"text": "using the vacuum pump on my hot table to suck out all of the air and create downward pressure.", "start": 414.07, "duration": 5.029}, {"text": "Now the combination of the heat and the pressure and the absorbent blotter paper", "start": 419.5, "duration": 4.369}, {"text": "will suck out all of that excess wax from the painting into the paper.", "start": 424.27, "duration": 5.0}, {"text": "And sometimes this procedure has to be done multiple times depending on how much wax was used.", "start": 429.72, "duration": 4.16}, {"text": "Luckily in this case", "start": 433.88, "duration": 1.16}, {"text": "I only needed to do it once because it was fairly thin.", "start": 435.04, "duration": 2.98}, {"text": "With all the wax removed, I can now take that washi kozo off of the painting.", "start": 438.02, "duration": 4.68}, {"text": "The nice thing about using washi kozo is that distilled water", "start": 442.7, "duration": 3.2}, {"text": "will soften up the paper and the adhesive", "start": 446.55, "duration": 2.48}, {"text": "making it fairly easy to remove.", "start": 449.67, "duration": 2.269}, {"text": "I can peel it back slowly", "start": 453.0, "duration": 2.0}, {"text": "ensuring that nothing has stuck to the painting and that no paint is coming with.", "start": 455.85, "duration": 3.679}, {"text": "Unfortunately though, because the water makes the paper soft and kind of dissolves it,", "start": 460.62, "duration": 5.24}, {"text": "it's a little bit more difficult to remove than if it were a", "start": 465.86, "duration": 3.18}, {"text": "chemical adhesive that didn't degrade the paper.", "start": 469.04, "duration": 2.96}, {"text": "Sometimes I will have to use various tools to lift off the paper from the surface of the painting", "start": 472.58, "duration": 5.66}, {"text": "but it is a testament to how well the fish gelatin has worked and", "start": 478.26, "duration": 5.8}, {"text": "to the correct ratio that I mixed of fish gelatin to water", "start": 484.1, "duration": 4.06}, {"text": "to see that this bond has been really strong and really successful.", "start": 488.16, "duration": 3.42}, {"text": "It lets me know that", "start": 491.66, "duration": 1.98}, {"text": "it was providing adequate support and protection for the painting", "start": 493.64, "duration": 3.44}, {"text": "and it's always nice to know that the work you're doing has been successful.", "start": 497.08, "duration": 3.62}, {"text": "Hey! Enjoying the video so far?", "start": 502.32, "duration": 2.0}, {"text": "Yeah", "start": 504.6, "duration": 0.5}, {"text": "I knew you would.", "start": 505.1, "duration": 1.58}, {"text": "There's something really satisfying about watching a dumpster fire get fixed up into something really beautiful.", "start": 506.68, "duration": 6.16}, {"text": "I get it! I fix things all day long.", "start": 512.84, "duration": 2.7}, {"text": "But, you know there are some things I can't fix.", "start": 515.54, "duration": 3.12}, {"text": "Like your busted website.", "start": 518.66, "duration": 1.2}, {"text": "Nope, no way. Uh-uh.", "start": 519.86, "duration": 1.96}, {"text": "Luckily, that's where Squarespace comes in.", "start": 521.9, "duration": 1.88}, {"text": "With a few clicks, you can turn your hot mess of a website", "start": 523.78, "duration": 3.34}, {"text": "into a beautiful masterpiece that works everywhere.", "start": 527.12, "duration": 2.52}, {"text": "And Squarespace gets artists!", "start": 529.64, "duration": 1.89}, {"text": "If you don't already have a Flickr, Twitter, Instagram, or Foursquare full of images to import,", "start": 531.53, "duration": 5.51}, {"text": "they have a library of like 50 million", "start": 537.04, "duration": 2.0}, {"text": "that you can use, edit online, and be sure will scale and display properly everywhere.", "start": 539.24, "duration": 5.16}, {"text": "So go to Squarespace.com for your free trial", "start": 545.06, "duration": 3.08}, {"text": "and when you're ready to launch, go to squarespace.com/baumgartner", "start": 548.14, "duration": 4.8}, {"text": "for 10% off your first website or domain.", "start": 553.02, "duration": 3.34}, {"text": "And say thank you! They made this video happen", "start": 556.36, "duration": 2.86}, {"text": "And so with all of the facing removed,", "start": 560.54, "duration": 2.1}, {"text": "I can start the process of cleaning the painting.", "start": 562.64, "duration": 2.54}, {"text": "Now, since its 1940s conservation,", "start": 565.54, "duration": 2.56}, {"text": "this painting has been kept in pretty good condition. It's been in a museum,", "start": 568.3, "duration": 4.32}, {"text": "It's been in a university, and then several private collections.", "start": 572.63, "duration": 3.33}, {"text": "So it hasn't been subjected to a lot of the agents of change that can create problems for paintings:", "start": 576.0, "duration": 6.06}, {"text": "environmental degradation,", "start": 582.6, "duration": 1.92}, {"text": "pests,", "start": 584.52, "duration": 1.62}, {"text": "smoke, nicotine,", "start": 586.14, "duration": 2.0}, {"text": "handling.", "start": 588.3, "duration": 0.84}, {"text": "There are a ton of them that can have adverse impacts on paintings.", "start": 589.14, "duration": 3.72}, {"text": "So it's not terribly dirty.", "start": 592.92, "duration": 1.86}, {"text": "But, I still need to remove whatever is on the surface of the painting because it's no longer", "start": 594.78, "duration": 5.089}, {"text": "doing the job that it once did, it has changed and it's", "start": 600.21, "duration": 4.13}, {"text": "not appropriate for this stuff to be here anymore.", "start": 605.19, "duration": 2.21}, {"text": "Now during the process of removing the old varnish", "start": 607.7, "duration": 2.4}, {"text": "you can see that some of the areas of retouching have been revealed", "start": 610.1, "duration": 2.92}, {"text": "The old retouching paint has come off. I'll have to address those later.", "start": 613.02, "duration": 3.34}, {"text": "It's always interesting to see what you find when you remove a varnish.", "start": 616.37, "duration": 3.21}, {"text": "Now this piece wasn't terribly dirty,", "start": 621.84, "duration": 1.88}, {"text": "you can see the difference in sheen from where I have removed the varnish to where I haven't", "start": 623.72, "duration": 4.02}, {"text": "but interestingly enough,", "start": 627.92, "duration": 1.78}, {"text": "as I got into this painting more, I discovered that there was a lot of old varnish still on the painting.", "start": 629.7, "duration": 5.14}, {"text": "And those are those blotchy areas to the left.", "start": 634.84, "duration": 2.7}, {"text": "Now why that varnish is still there is, is anyone's guess.", "start": 637.8, "duration": 4.04}, {"text": "It could be that the conservator missed those spots,", "start": 641.84, "duration": 3.04}, {"text": "was taking a very cautious approach,", "start": 645.42, "duration": 2.0}, {"text": "or thought they had the painting fully cleaned.", "start": 648.2, "duration": 2.86}, {"text": "Nonetheless, all of those areas need to be removed of the old varnish.", "start": 651.06, "duration": 4.86}, {"text": "Now, George Inness was known for using a lot of glazes in his paintings", "start": 656.22, "duration": 4.44}, {"text": "and because of that I'm not going to take the approach of using solvents to remove this old varnish", "start": 660.66, "duration": 5.0}, {"text": "It would be easy to take a very aggressive  solvent and try to break down this old varnish", "start": 666.45, "duration": 5.15}, {"text": "But it also might run the risk of damaging any glazes that he applied to the sky.", "start": 671.82, "duration": 4.96}, {"text": "Instead, I'm taking a mechanical approach and I'm using a dental tool to scrape off this layer of old varnish.", "start": 676.78, "duration": 6.72}, {"text": "Now, I'm not using a lot of pressure here", "start": 683.5, "duration": 1.18}, {"text": "I'm really just letting the weight of the tool glide across the surface", "start": 684.78, "duration": 3.96}, {"text": "and to break up that layer of old varnish", "start": 688.74, "duration": 2.72}, {"text": "It doesn't require a lot of muscle and it doesn't require a lot of effort,", "start": 692.48, "duration": 4.06}, {"text": "but it does require patience, and attention to detail.", "start": 696.54, "duration": 3.6}, {"text": "Because I don't want to do any damage to the painting.", "start": 700.5, "duration": 2.9}, {"text": "But I also want to get as much, if not all of this", "start": 703.57, "duration": 3.26}, {"text": "old varnish off of the surface and out of the Impasto of the painting.", "start": 707.02, "duration": 5.08}, {"text": "So all of those little dark spots and the nooks and crannies of the paint", "start": 712.1, "duration": 4.06}, {"text": "texture, have to be removed. And so I'll just work slowly", "start": 716.26, "duration": 3.679}, {"text": "I'll take breaks if I need, I can switch tools if I need.", "start": 720.24, "duration": 3.09}, {"text": "The thing that I want to make sure of is that I'm getting the varnish off without damaging the paint layer.", "start": 723.64, "duration": 5.69}, {"text": "Now luckily for me", "start": 732.46, "duration": 1.71}, {"text": "There was a relatively small amount of old varnish that needed to be removed.", "start": 734.17, "duration": 4.22}, {"text": "If this had been a 5 foot by 10 foot painting", "start": 738.54, "duration": 2.98}, {"text": "and the whole thing would have been covered in varnish that needed to be removed by a dental tool...", "start": 741.52, "duration": 3.76}, {"text": "it would have been a very different equation. But in this case, it was relatively small.", "start": 746.04, "duration": 5.4}, {"text": "Now with the painting mostly cleaned,", "start": 751.44, "duration": 1.65}, {"text": "I need to address the areas of old retouching that I couldn't get off with mild solvent.", "start": 753.09, "duration": 4.61}, {"text": "These are areas of old oil paint that have fully oxidized and can't be removed with basic solvents.", "start": 758.17, "duration": 5.9}, {"text": "So I have to use a very aggressive gelled solvent to break down this oil paint.", "start": 764.07, "duration": 4.19}, {"text": "And this is one of the reasons we don't", "start": 768.26, "duration": 1.329}, {"text": "Use oil paint to do retouching anymore", "start": 769.589, "duration": 2.25}, {"text": "It's because once it oxidizes it basically becomes permanent,", "start": 771.84, "duration": 3.48}, {"text": "and it darkens and changes color over time", "start": 775.32, "duration": 2.0}, {"text": "And so what once looked good and looked like a good idea,", "start": 777.64, "duration": 3.56}, {"text": "will at some point not look correct and need to be removed.", "start": 781.69, "duration": 4.25}, {"text": "Now at this point with the painting fully cleaned, the surface grime, the old varnish,", "start": 789.46, "duration": 4.4}, {"text": "the old old varnish, and the retouching removed,", "start": 793.86, "duration": 2.0}, {"text": "I could start the structural work.", "start": 796.48, "duration": 1.86}, {"text": "Now when this painting came in, it was lined to a piece of canvas", "start": 798.34, "duration": 3.12}, {"text": "with an aluminum interleaf, but I don't see any reason for that.", "start": 801.46, "duration": 2.24}, {"text": "There's no tears. There are no holes. There's no catastrophic damage of the painting.", "start": 803.96, "duration": 3.78}, {"text": "So to put a new lining on would be unnecessary, excessive, and totally inappropriate.", "start": 807.76, "duration": 4.849}, {"text": "What I will do however is a strip lining, whereby I use a heat-activated", "start": 813.36, "duration": 4.66}, {"text": "reversible film adhesive, and a piece of Belgian linen,", "start": 818.02, "duration": 2.84}, {"text": "to add new material to the tacking edge where the tacking edge has been compromised or lost.", "start": 820.86, "duration": 6.24}, {"text": "and this is an approach I really like because it gives me the most bang for my buck.", "start": 827.28, "duration": 2.88}, {"text": "That is, I get all the structural reinforcement where the canvas needs it,", "start": 830.44, "duration": 4.64}, {"text": "yet I preserve as much of the original canvas as possible.", "start": 835.12, "duration": 2.86}, {"text": "And one thing that I noticed when working on this painting is that the canvas", "start": 838.42, "duration": 3.6}, {"text": "had two vertical creases and marks from a vertical crossbar on the original stretcher.", "start": 842.02, "duration": 6.7}, {"text": "And if we remember, the stretcher it came in on had no vertical cross bars.", "start": 848.72, "duration": 4.7}, {"text": "Which tells me that the stretcher it came in on is a replacement and not original to the painting.", "start": 853.42, "duration": 5.28}, {"text": "And that may seem like inside baseball, but to historians, and conservators,", "start": 858.9, "duration": 3.76}, {"text": "and some collectors, that's really important information", "start": 862.66, "duration": 2.68}, {"text": "and I want to do my part to make sure that that part of the painting's history lives on.", "start": 865.34, "duration": 4.4}, {"text": "So at this point, I can turn my attention to the stretcher bar that we talked about.", "start": 873.43, "duration": 3.529}, {"text": "You can see there's a pretty big bow in the stretcher right where that knot was,", "start": 877.24, "duration": 4.399}, {"text": "and that deformation is going to be a big problem when I go to stretch the painting back on to the support", "start": 881.74, "duration": 4.64}, {"text": "if I don't take corrective action.", "start": 886.38, "duration": 1.92}, {"text": "That bow is gonna create a divot or a dimple that, no matter how tight I stretch the painting or", "start": 888.3, "duration": 5.48}, {"text": "how much tension I add with the keys, will always be there. And so I have to correct it.", "start": 894.22, "duration": 5.6}, {"text": "And the first thing I need to do is disassemble this stretcher and get rid of those staples.", "start": 899.82, "duration": 4.48}, {"text": "Get rid of those old keys,", "start": 904.3, "duration": 2.0}, {"text": "and break it down into its four components.", "start": 906.52, "duration": 2.42}, {"text": "I'm going to also remove all of the old tacks and nails that are still embedded in the stretcher", "start": 911.32, "duration": 6.02}, {"text": "because those are gonna be problematic for the next couple steps and I need to make sure that there", "start": 917.34, "duration": 3.74}, {"text": "aren't any of these things in the way.", "start": 921.49, "duration": 2.0}, {"text": "Now I could rip this down and just make it smaller", "start": 925.56, "duration": 2.94}, {"text": "but then the painting would have to become smaller and that's not appropriate.", "start": 928.5, "duration": 3.16}, {"text": "So what I'm gonna do is take a piece of pine that I've ripped and I'm gonna fill in that gap", "start": 931.66, "duration": 4.84}, {"text": "so that we have a new edge.", "start": 936.819, "duration": 2.0}, {"text": "I'm gonna be using wood glue", "start": 939.3, "duration": 1.82}, {"text": "I'm not gonna using any mechanical fasteners because the glue bond will be plenty strong", "start": 941.12, "duration": 4.8}, {"text": "and I'm going to be using a very technologically advanced method of spreading this glue", "start": 945.92, "duration": 5.1}, {"text": "because I want to make sure that the entire surface has good purchase", "start": 951.02, "duration": 4.12}, {"text": "So I'll put the new pine onto the original and I will use clamps to hold it in place while the glue dries.", "start": 955.62, "duration": 7.76}, {"text": "Now at this point it's not accurately fit,", "start": 963.46, "duration": 2.97}, {"text": "there's too much wood and it doesn't match the profile, but I'll take care of all of that later. First things first", "start": 966.43, "duration": 6.209}, {"text": "I just need to make sure that that wood bonds to the original stretcher. I'll remove some of the excess glue", "start": 972.639, "duration": 5.88}, {"text": "I'll clamp it up and then through the magic of editing", "start": 978.62, "duration": 3.26}, {"text": "it's all dry and I can take it out of the clamps.", "start": 982.399, "duration": 2.869}, {"text": "Now at this point, there's too much wood and it's not properly shaped", "start": 987.92, "duration": 2.989}, {"text": "so I have to address that. So I'm going to take a ruler and I'm gonna go from edge to edge,", "start": 990.909, "duration": 4.371}, {"text": "high point to high point. I'm gonna make a line. And that's gonna be the material that needs to be removed.", "start": 995.48, "duration": 5.27}, {"text": "I'm gonna use a jig that I made and my table saw to rip down all of that excess wood.", "start": 1000.75, "duration": 5.95}, {"text": "And you'll see as I start at the edge", "start": 1006.82, "duration": 3.02}, {"text": "The table saw is going to remove almost all of the material", "start": 1010.56, "duration": 3.52}, {"text": "leaving a very very slim piece of new pine attached that stretcher.", "start": 1014.08, "duration": 4.3}, {"text": "You can see it. But as I move down towards the bow,", "start": 1018.64, "duration": 3.36}, {"text": "the table saw is going to be removing less material and", "start": 1022.96, "duration": 3.06}, {"text": "more wood is going to be adhered to the original support, filling in that gap.", "start": 1026.16, "duration": 5.66}, {"text": "And the table saw is a great tool here because it's gonna give me a very clean very precise new edge", "start": 1032.799, "duration": 5.78}, {"text": "that's gonna work really well when I go to stretch the painting.", "start": 1039.13, "duration": 3.859}, {"text": "And so I'll remove it from my jig", "start": 1044.7, "duration": 1.86}, {"text": "and I'll take a look at that cut, and you can see it's a really clean cut,", "start": 1046.56, "duration": 3.72}, {"text": "really nice sharp blade.", "start": 1050.58, "duration": 1.72}, {"text": "and, when I place it down on the table, you can see that that edge is now completely flat", "start": 1052.58, "duration": 6.4}, {"text": "But we're not done yet.", "start": 1058.99, "duration": 2.0}, {"text": "That piece of wood doesn't match the bevel on the original stretcher.", "start": 1061.419, "duration": 3.53}, {"text": "So I have to use a hand plane and just slowly remove off wood until that bevel is matched.", "start": 1064.95, "duration": 6.209}, {"text": "It's slow-going", "start": 1072.07, "duration": 1.41}, {"text": "until it's not,", "start": 1073.48, "duration": 1.24}, {"text": "and then with sped up video you can see just how efficient I can work.", "start": 1074.88, "duration": 4.5}, {"text": "So that edge is now okay", "start": 1080.56, "duration": 2.4}, {"text": "but the underside isn't.", "start": 1083.47, "duration": 2.089}, {"text": "There's no lip.", "start": 1085.87, "duration": 0.95}, {"text": "And one of the things that a stretcher needs is a lip", "start": 1086.82, "duration": 3.5}, {"text": "to remove the canvas from the wood", "start": 1090.32, "duration": 2.7}, {"text": "because if that canvas is touching the wood you can get a stretcher bar mark.", "start": 1093.04, "duration": 4.139}, {"text": "And so, I'll rip down a new piece of wood, and I'll build up this stretcher", "start": 1097.18, "duration": 4.4}, {"text": "and all of the other pieces so that there's an", "start": 1101.58, "duration": 2.0}, {"text": "adequate lip that will keep the canvas from touching that wood.", "start": 1103.9, "duration": 3.14}, {"text": "And once all those pieces have been modified, I can put the stretcher back together", "start": 1111.18, "duration": 4.12}, {"text": "and we can see how effective it's going to be at holding that canvas off of that wood.", "start": 1115.3, "duration": 5.54}, {"text": "You can see how the bow has been corrected and we have a nice square stretcher support.", "start": 1123.7, "duration": 5.209}, {"text": "I'm gonna be using some nails to hold the stretchers square because", "start": 1128.909, "duration": 3.551}, {"text": "I don't want it to deform as I'm stretching the painting.", "start": 1132.46, "duration": 2.7}, {"text": "It would be a real big bummer to do all this work only to stretch the painting all wonky", "start": 1135.16, "duration": 4.38}, {"text": "Now I'm gonna be using steel tacks to stretch this painting because that's what I prefer", "start": 1142.38, "duration": 4.84}, {"text": "and you guys know that.", "start": 1147.22, "duration": 1.26}, {"text": "I'm gonna start by putting a couple of tacks in the center of each edge of the canvas.", "start": 1148.48, "duration": 5.92}, {"text": "And I'm gonna do this so that I can get adequate tension in the center of the canvas.", "start": 1154.4, "duration": 4.78}, {"text": "And then, I will move towards the edges", "start": 1159.18, "duration": 3.02}, {"text": "and begin tacking the canvas down to the stretcher.", "start": 1162.2, "duration": 3.58}, {"text": "and I do this because if I were to start at one corner and just work across all four corners,", "start": 1165.78, "duration": 5.06}, {"text": "I might trap in a wrinkle or a", "start": 1171.029, "duration": 2.91}, {"text": "ripple or a bulge that would be almost impossible to remove", "start": 1174.22, "duration": 3.8}, {"text": "and then I have to take the canvas off and start over again", "start": 1178.02, "duration": 2.98}, {"text": "which is really a big bummer. So by working from the center out", "start": 1181.0, "duration": 4.22}, {"text": "I can ensure that there's even tension and no excess canvas.", "start": 1185.22, "duration": 4.26}, {"text": "I'm gonna remove", "start": 1190.43, "duration": 1.83}, {"text": "the excess strip lining, and I'm going to tidy up the edges.", "start": 1192.26, "duration": 3.28}, {"text": "Some conservators like to glue this down to the stretcher", "start": 1195.54, "duration": 3.06}, {"text": "I don't, because I think that's a terrible idea. It's messy and it makes it harder to remove later,", "start": 1198.6, "duration": 5.78}, {"text": "so I'll just use tacks to secure this excess folded canvas down.", "start": 1204.47, "duration": 5.54}, {"text": "And I like to make sure that the back of the canvas", "start": 1210.62, "duration": 2.54}, {"text": "looks as good as the front, and so I like to tidy up these corners.", "start": 1213.32, "duration": 3.53}, {"text": "Nobody ever sees this stuff but me", "start": 1217.28, "duration": 1.98}, {"text": "but, you know, my label's right there and my name is there", "start": 1219.26, "duration": 2.74}, {"text": "and so I want to make sure that everything is nice and tidy", "start": 1222.0, "duration": 2.86}, {"text": "and that I'm proud with the quality of work that leaves my studio.", "start": 1224.86, "duration": 3.24}, {"text": "Now because this is a loose canvas and not lying to an inch or leaf anymore", "start": 1228.98, "duration": 4.369}, {"text": "We're gonna use keys to expand that stretcher", "start": 1233.35, "duration": 2.43}, {"text": "You can see as I tap it, the stretcher gets bigger. And that takes up any excess material in the canvas", "start": 1235.94, "duration": 6.29}, {"text": "It adds tension and keeps it tight", "start": 1242.51, "duration": 2.27}, {"text": "These are new keys that I cut and I'm going to secure them to the stretcher using", "start": 1245.84, "duration": 4.42}, {"text": "a piece of fishing line and a tack,", "start": 1250.26, "duration": 2.0}, {"text": "so that they don't get lost, and they don't fall down", "start": 1252.42, "duration": 1.58}, {"text": "in between the canvas and the stretcher to create a bulge.", "start": 1254.08, "duration": 4.44}, {"text": "Now this painting didn't have much catastrophic loss there were no major tears or holes or", "start": 1261.64, "duration": 5.12}, {"text": "water damage, or really major losses of any kind", "start": 1267.28, "duration": 3.62}, {"text": "but there were some small areas where the paint had chipped off over time.", "start": 1270.9, "duration": 3.34}, {"text": "And,", "start": 1274.72, "duration": 0.5}, {"text": "Before I can do any retouching on these areas", "start": 1275.34, "duration": 2.1}, {"text": "I need to make sure that I fill them in; and this is important because", "start": 1277.45, "duration": 3.63}, {"text": "even if my color matching is spot-on, if I don't fill it in,", "start": 1281.5, "duration": 4.26}, {"text": "when viewed from a raking light or the side,", "start": 1285.76, "duration": 2.44}, {"text": "You would see all of the divots and it would look terrible.", "start": 1288.32, "duration": 3.14}, {"text": "So I'm going to fill in those areas where the paint has been lost", "start": 1291.82, "duration": 3.26}, {"text": "I'm not worried about over filling right now because I'll go ahead and", "start": 1295.08, "duration": 3.24}, {"text": "remove that excess with a swab and some distilled water.", "start": 1298.32, "duration": 3.54}, {"text": "This is also really important because I want to make sure that the only areas", "start": 1302.12, "duration": 4.36}, {"text": "where the fill in medium remains are areas", "start": 1306.48, "duration": 3.6}, {"text": "where there have been losses. I don't want to cover up any of the original paint.", "start": 1310.08, "duration": 4.3}, {"text": "So I'll use these swabs and I will remove all of that excess.", "start": 1314.84, "duration": 4.3}, {"text": "You can see it comes off pretty easily,", "start": 1319.14, "duration": 1.78}, {"text": "so it's not terrible difficult.", "start": 1320.92, "duration": 2.24}, {"text": "Now luckily in this case,", "start": 1323.16, "duration": 1.5}, {"text": "these losses are really small, and the painting is really smooth", "start": 1324.66, "duration": 3.38}, {"text": "so I don't have to sculpt or add texture to this filling medium.", "start": 1328.04, "duration": 3.929}, {"text": "But, if there was a lot of impasto- that is the physical texture of paint-", "start": 1331.97, "duration": 4.41}, {"text": "I would, because again,", "start": 1336.38, "duration": 1.69}, {"text": "viewed from a raking light the color may be right,", "start": 1338.07, "duration": 2.63}, {"text": "but the texture would be wrong, and you'd be able to see", "start": 1340.7, "duration": 2.74}, {"text": "all of that retouching.", "start": 1343.5, "duration": 1.68}, {"text": "I'm going to apply a synthetic resin isolation layer of varnish, and this is important for a couple of reasons.", "start": 1346.76, "duration": 5.98}, {"text": "One, it will help simulate what the painting will look like with final varnish.", "start": 1353.1, "duration": 4.7}, {"text": "That is, the colors will get more intense", "start": 1357.8, "duration": 2.38}, {"text": "and that'll allow me to do my retouching to the accurate colors,", "start": 1360.18, "duration": 4.54}, {"text": "not a washed out version. So that my retouching will match.", "start": 1364.76, "duration": 3.54}, {"text": "And, two, it separates my work from the original painting.", "start": 1368.3, "duration": 3.64}, {"text": "And you may ask why didn't I put the", "start": 1371.94, "duration": 2.0}, {"text": "isolation layer on before the fill in medium?", "start": 1374.28, "duration": 2.03}, {"text": "Well, a couple of reasons. this varnish, if I applied it directly to that", "start": 1376.31, "duration": 4.349}, {"text": "painting without the fill-in, would saturate those areas of raw canvas", "start": 1381.0, "duration": 3.58}, {"text": "and be almost impossible to remove.", "start": 1384.58, "duration": 2.0}, {"text": "And two, the fill-in medium just doesn't stick", "start": 1387.02, "duration": 2.56}, {"text": "very well to the varnish, and I don't want that fill-in medium to pop off at some point in the future.", "start": 1389.87, "duration": 4.979}, {"text": "And now the retouching process can begin.", "start": 1395.58, "duration": 2.0}, {"text": "Because the quality of light changes during the day and during different seasons,", "start": 1398.55, "duration": 4.489}, {"text": "I'm using adjustable stand lights so that I can calibrate the light that I'm using", "start": 1403.38, "duration": 5.119}, {"text": "I've found that using between 4800 and 5100 Kelvin is the best light for retouching.", "start": 1408.84, "duration": 6.83}, {"text": "4800 is a little bit warmer than 5100, whereas", "start": 1416.66, "duration": 3.74}, {"text": "2500 is incandescent and very yellow, and 6000 is", "start": 1421.1, "duration": 4.14}, {"text": "very blue.", "start": 1426.06, "duration": 1.77}, {"text": "48 to 5100 gives me a nice approximation of daylight and", "start": 1427.83, "duration": 5.0}, {"text": "Since the Sun has been around for as long as I've been alive and will be around for longer than I'm alive", "start": 1433.68, "duration": 5.359}, {"text": "It's a pretty good mark to retouch against.", "start": 1439.37, "duration": 2.219}, {"text": "Now there's a big misconception about retouching that you have to be a good painter", "start": 1445.64, "duration": 3.68}, {"text": "or that good painters make good retouchers,", "start": 1449.32, "duration": 2.68}, {"text": "and that's actually completely the opposite.", "start": 1452.0, "duration": 2.76}, {"text": "Retouching is not painting, and it is not about liberally applying color and medium and paint to a surface.", "start": 1455.4, "duration": 6.92}, {"text": "In fact retouching is the exact opposite.", "start": 1462.32, "duration": 2.58}, {"text": "It's about using a brush to apply a paint very conservatively", "start": 1464.9, "duration": 6.0}, {"text": "only where it's required.", "start": 1471.2, "duration": 1.7}, {"text": "and so you can see I'm using my brush not in a painterly method,", "start": 1472.9, "duration": 4.18}, {"text": "but more as a tool to apply little dots of paint just where the paint is missing.", "start": 1477.12, "duration": 5.28}, {"text": "So only these white areas will receive new paint.", "start": 1482.64, "duration": 3.16}, {"text": "It's inappropriate for me to apply paint where there's already paint.", "start": 1486.04, "duration": 4.3}, {"text": "I'm only here to make sure that the damage", "start": 1490.34, "duration": 2.84}, {"text": "disappears to the naked eye, so that the viewer can appreciate the painting", "start": 1493.46, "duration": 4.18}, {"text": "as a whole, and not see all of this damage.", "start": 1497.64, "duration": 2.82}, {"text": "And with areas that are small like this and not necessarily heavily consequential,", "start": 1502.18, "duration": 5.76}, {"text": "this isn't the face, or a hand, or a very exciting thing to retouch,", "start": 1508.14, "duration": 4.849}, {"text": "it's really easy to lose your focus and to phone it in or to", "start": 1512.989, "duration": 4.671}, {"text": "allow the brush to take over and to be less conservative than you need to be.", "start": 1517.94, "duration": 4.46}, {"text": "So taking breaks, and stepping away from the work is really important.", "start": 1522.64, "duration": 4.44}, {"text": "So I'll take some breaks and break up this retouching process into several sessions", "start": 1528.03, "duration": 5.869}, {"text": "even though there are only small areas to retouch.", "start": 1534.0, "duration": 2.7}, {"text": "Because I want to make sure that I'm really focused", "start": 1536.7, "duration": 1.96}, {"text": "And this altogether probably took maybe an hour and a half or so.", "start": 1539.58, "duration": 3.96}, {"text": "Obviously speeding up the video helps it seem like I'm working very fast and fluidly", "start": 1544.77, "duration": 4.609}, {"text": "but, I did take my time partially because this is a really important painting", "start": 1549.51, "duration": 4.13}, {"text": "It's going to be photographed for the catalog resume.", "start": 1553.64, "duration": 2.399}, {"text": "But also my clients trust me and they want the best quality of work", "start": 1556.04, "duration": 3.86}, {"text": "and I need to make sure that I set myself up", "start": 1559.9, "duration": 2.6}, {"text": "to deliver that.", "start": 1562.5, "duration": 0.88}, {"text": "And so working slowly, taking breaks, making sure that I'm intellectually and emotionally engaged,", "start": 1563.38, "duration": 5.6}, {"text": "is one way that I can ensure that I'm delivering the best possible product to my clients.", "start": 1568.98, "duration": 5.2}, {"text": "And now I'm using a paint made by the Maimeri Company", "start": 1578.5, "duration": 2.84}, {"text": "which is an oil free, archival, fully reversible paint", "start": 1581.34, "duration": 4.72}, {"text": "and it's important, because I want to make sure that my work can be undone in the future.", "start": 1586.12, "duration": 4.36}, {"text": "And so for an area like this, this tiny little scratch,", "start": 1590.92, "duration": 3.04}, {"text": "I'm just painting in that scratch.", "start": 1593.96, "duration": 2.0}, {"text": "I'm not adding pigment or paint around the scratch and to some degree", "start": 1596.4, "duration": 4.76}, {"text": "I'm not even really trying to make it completely disappear.", "start": 1601.18, "duration": 3.29}, {"text": "What I am trying to do is disguise it.", "start": 1604.5, "duration": 2.78}, {"text": "Camouflage it.", "start": 1607.44, "duration": 0.88}, {"text": "Make it so that the naked eye doesn't see the damage.", "start": 1608.32, "duration": 3.0}, {"text": "because if you don't see the damage,", "start": 1611.32, "duration": 1.82}, {"text": "then the damage doesn't really exist.", "start": 1613.26, "duration": 2.0}, {"text": "Does it?", "start": 1616.0, "duration": 1.16}, {"text": "And once I've completed the retouching I'm going to take the painting", "start": 1620.26, "duration": 3.0}, {"text": "and I'm going to go look at it under black light.", "start": 1623.26, "duration": 2.0}, {"text": "And sometimes I'll do this during the retouching process as well.", "start": 1625.78, "duration": 3.02}, {"text": "And it's helpful, because the black light will reveal all of the work that I've done.", "start": 1628.96, "duration": 4.12}, {"text": "That is, all of the paint that I have added", "start": 1633.08, "duration": 2.0}, {"text": "will show up under UV light.", "start": 1635.5, "duration": 2.14}, {"text": "And it's important because it keeps the conservator honest,", "start": 1637.64, "duration": 3.02}, {"text": "and it shows the quality of restoration work that's been done.", "start": 1640.66, "duration": 3.26}, {"text": "So while you can't see it with the naked eye under visible light", "start": 1644.98, "duration": 3.62}, {"text": "when I turn off the visible light and turn on the UV,", "start": 1649.57, "duration": 2.839}, {"text": "you could start to see all of these little dots of dark purple. And those are areas where I've added paint.", "start": 1653.08, "duration": 6.38}, {"text": "The paint I use is specially designed to fluoresce", "start": 1659.68, "duration": 2.929}, {"text": "so that you can see it under UV. And this is indicative of good retouching: lots of little dots.", "start": 1662.71, "duration": 5.509}, {"text": "Lots of little hits of paint. Not big brush strokes, not glazing, not painterly work.", "start": 1668.59, "duration": 6.199}, {"text": "Just where there's been losses.", "start": 1675.49, "duration": 2.03}, {"text": "And so this is how you can check your work", "start": 1678.28, "duration": 2.1}, {"text": "and make sure that you've done a good job for your client.", "start": 1680.38, "duration": 2.42}, {"text": "And with retouching complete I can apply the final layer of varnish.", "start": 1685.36, "duration": 3.06}, {"text": "I'm gonna spray it on because it'll give me more control over the sheen,", "start": 1688.56, "duration": 3.64}, {"text": "and because I don't want to disturb the isolation layer or the retouching.", "start": 1692.2, "duration": 3.76}, {"text": "So with the work done on the painting I can turn my attention to the frame.", "start": 1697.45, "duration": 3.739}, {"text": "This frame is original to the work, and at some point, probably in the 40s,", "start": 1701.6, "duration": 3.8}, {"text": "It was glazed over with brown-gray oil paint.", "start": 1705.4, "duration": 3.86}, {"text": "And unfortunately, there's no easy way to remove oil paint.", "start": 1709.64, "duration": 2.54}, {"text": "I have to use a pretty aggressive gelled solvent. And I have to work slowly, and carefully.", "start": 1712.18, "duration": 5.58}, {"text": "But, it's totally worth it.", "start": 1717.76, "duration": 2.92}, {"text": "Because what lies beneath all of this brown-gray glazing", "start": 1720.68, "duration": 4.84}, {"text": "is the original gold paint, and original gilding.", "start": 1725.54, "duration": 4.36}, {"text": "Now in this frame, the edges and the sides were painted with gold paint", "start": 1730.74, "duration": 4.66}, {"text": "whereas the front and all the ornamentation", "start": 1736.0, "duration": 2.419}, {"text": "was gilded with real gold.", "start": 1738.96, "duration": 2.06}, {"text": "Now this isn't necessarily common,", "start": 1741.84, "duration": 1.98}, {"text": "but it's not terribly uncommon either", "start": 1743.82, "duration": 1.98}, {"text": "because it allows the frame maker to make a really gorgeous frame while keeping the cost", "start": 1745.8, "duration": 4.02}, {"text": "much much more controllable for the client.", "start": 1750.24, "duration": 2.52}, {"text": "Now I'm going to apply this chemical", "start": 1755.34, "duration": 2.74}, {"text": "and I'm gonna use various tools to remove the chemical and the paint when it's ready.", "start": 1758.08, "duration": 5.32}, {"text": "I'll use a stiff bristle brush as I'm doing here to get into the nooks and the crannies and", "start": 1763.48, "duration": 4.96}, {"text": "then I'll switch to an old toothbrush. And you may say that's crazy to use a toothbrush, but I would ask you:", "start": 1768.52, "duration": 5.68}, {"text": "over decades, millions and millions of dollars have been spent to devise a device", "start": 1774.2, "duration": 5.26}, {"text": "that will gently and safely remove grime from the nooks and crannies of a delicate object.", "start": 1779.8, "duration": 5.869}, {"text": "And so, why would I reinvent the wheel when the toothbrush is the perfect tool?", "start": 1785.67, "duration": 4.32}, {"text": "I'll work slowly in controlled areas because this chemical is indiscriminate.", "start": 1794.89, "duration": 5.149}, {"text": "It doesn't stop just because I want it to stop, and so if I leave it on too long", "start": 1800.35, "duration": 4.939}, {"text": "it will not only remove the glazing but it will also remove the gilding, and", "start": 1805.289, "duration": 5.091}, {"text": "the bowl, and the gesso. It will go right down to the raw wood. So by working in small areas, I can keep control.", "start": 1810.78, "duration": 7.1}, {"text": "Now this frame had multiple different applications of gold. Some of it was painted,", "start": 1819.1, "duration": 4.22}, {"text": "some of it was leafed,", "start": 1823.45, "duration": 1.16}, {"text": "and some of it was leafed and then burnished.", "start": 1824.61, "duration": 2.309}, {"text": "This area of fluting was leafed and then burnished, and the burnishing makes the gold extremely bright.", "start": 1827.11, "duration": 6.819}, {"text": "Whereas the other areas that were just leafed are a little bit more satin.", "start": 1834.3, "duration": 3.74}, {"text": "And so removing this glazing from the fluted area", "start": 1838.04, "duration": 4.34}, {"text": "reveals just how bright and glorious this gold leafing was.", "start": 1842.38, "duration": 4.26}, {"text": "And it's really exciting for me to be able to take all of this old oil paint", "start": 1846.64, "duration": 5.3}, {"text": "off, and to reveal what the frame did look like, and should look like.", "start": 1851.94, "duration": 4.3}, {"text": "Now my clients didn't want this frame brand-new and perfect.", "start": 1858.02, "duration": 3.82}, {"text": "If they did, they probably would have had me strip it all the way down", "start": 1861.84, "duration": 3.02}, {"text": "and regild it, or they would have bought a new frame.", "start": 1864.86, "duration": 2.379}, {"text": "But, I'm working slowly to remove as much of the", "start": 1867.239, "duration": 3.23}, {"text": "glazing as possible and to reveal as much of the original gold as I can.", "start": 1870.78, "duration": 4.16}, {"text": "I have to work slowly, and carefully,  I have to use a full-face respirator and protective equipment.", "start": 1874.96, "duration": 5.3}, {"text": "But, it's well worth the effort.", "start": 1880.8, "duration": 2.0}, {"text": "Now this frame had several losses of the original composition ornamentation.", "start": 1883.34, "duration": 4.44}, {"text": "And to recreate it, I'm going to be using silicone to create a mold.", "start": 1888.56, "duration": 4.16}, {"text": "I'll start off by using plasticine clay to create a dam", "start": 1892.72, "duration": 3.22}, {"text": "so the silicone doesn't go everywhere.", "start": 1895.94, "duration": 2.02}, {"text": "And then I'll mix my silicone up in a", "start": 1897.96, "duration": 2.0}, {"text": "one-to-one ratio", "start": 1900.54, "duration": 1.259}, {"text": "using a scale,", "start": 1901.799, "duration": 1.8}, {"text": "and when ready, I will apply it directly to the frame.", "start": 1903.6, "duration": 3.7}, {"text": "And the great thing about silicone is that it captures great detail.", "start": 1907.3, "duration": 4.66}, {"text": "It doesn't stick to anything", "start": 1911.96, "duration": 1.7}, {"text": "so it's not gonna lift off all the leafing or the the paint.", "start": 1913.66, "duration": 4.16}, {"text": "And, it lasts forever, so I'm gonna have this mold for as long as I need it", "start": 1917.82, "duration": 4.94}, {"text": "and I can reuse it as many times as I want.", "start": 1922.76, "duration": 2.04}, {"text": "So the silicone doesn't stick, the plasticine is actually more of a problem", "start": 1925.98, "duration": 4.04}, {"text": "than silicone. But once I get it fully off and remove the plasticine from the silicone,", "start": 1930.1, "duration": 5.68}, {"text": "you'll start to see just how accurate it is and just how easy it's going to be to recreate the lost ornamentation.", "start": 1936.08, "duration": 6.74}, {"text": "Now because this ornamentation was really small,", "start": 1945.2, "duration": 2.74}, {"text": "I'm just using Plaster of Paris and water to recreate it.", "start": 1947.94, "duration": 2.839}, {"text": "If it were a large ornament or something that was very pronounced,", "start": 1950.78, "duration": 3.46}, {"text": "I might use PVA or some fiber-, fiberglass, or other fibers mixed in", "start": 1954.24, "duration": 5.52}, {"text": "to give it more support, but with small things like this, it's not really necessary", "start": 1959.76, "duration": 3.5}, {"text": "and there's diminishing returns for that amount of work.", "start": 1963.32, "duration": 2.069}, {"text": "So once the Plaster of Paris has been allowed to dry and hardened, I will remove it from the mold.", "start": 1967.14, "duration": 6.02}, {"text": "And, while the hardest part is removing the tape and the enclosure,", "start": 1973.16, "duration": 3.48}, {"text": "once I get this out and I remove the silicone you can see just how easily it comes off.", "start": 1976.98, "duration": 5.22}, {"text": "And when I do fully remove it, you can see just how accurate of a", "start": 1982.42, "duration": 4.36}, {"text": "piece this is.", "start": 1987.66, "duration": 2.0}, {"text": "So now I can just start to trim it down and modify it, shape it so that it fits the frame.", "start": 1989.82, "duration": 5.76}, {"text": "And there's nothing fancy about this,", "start": 1995.92, "duration": 2.22}, {"text": "it's cutting it down, sanding it down, shaping it,", "start": 1998.14, "duration": 3.72}, {"text": "using any tools- using all the tools that you have at your disposal", "start": 2001.86, "duration": 2.0}, {"text": "to get it to a place where it's going to accurately match what was there once before.", "start": 2005.42, "duration": 5.3}, {"text": "And so once I have it to a state where I'm satisfied", "start": 2013.37, "duration": 2.449}, {"text": "I can glue the piece down and make sure that it doesn't chip off.", "start": 2015.94, "duration": 4.7}, {"text": "And even though these are small areas,", "start": 2020.64, "duration": 2.0}, {"text": "simply replacing them with appropriate", "start": 2022.64, "duration": 2.72}, {"text": "castings makes a big difference in", "start": 2025.36, "duration": 2.3}, {"text": "allowing you to see the whole and not just the damage", "start": 2027.86, "duration": 2.9}, {"text": "and my clients really do appreciate this. And I really enjoy it, too.", "start": 2030.76, "duration": 4.38}, {"text": "Now there were some areas of this frame where the original gilding was just really damaged", "start": 2036.2, "duration": 5.28}, {"text": "and, I could strip down all of the gold, all of", "start": 2041.5, "duration": 3.48}, {"text": "the bowl, all of the gesso, and then regesso, rebowl, and water gild it", "start": 2045.34, "duration": 4.98}, {"text": "so that I could get a beautiful surface.", "start": 2050.32, "duration": 2.0}, {"text": "But I'm not intending on burnishing any of this area, so I don't need to use", "start": 2052.34, "duration": 4.96}, {"text": "water gilding. I can use an oil size.", "start": 2057.86, "duration": 2.27}, {"text": "Now I'm going to use 22 karat gold and it's incredibly delicate", "start": 2061.1, "duration": 3.92}, {"text": "and you'll see that I tear it just by lifting it off too quickly.", "start": 2065.04, "duration": 4.22}, {"text": "I'm gonna use a gilder's knife to cut it down into smaller more manageable pieces", "start": 2069.26, "duration": 3.94}, {"text": "because I don't want to waste any of this stuff and I want to be able to get it into the nooks and crannies", "start": 2073.2, "duration": 4.76}, {"text": "pretty accurately.", "start": 2078.29, "duration": 1.68}, {"text": "Using a statically charged gilder's brush, I can pick up the leaf and apply it down to the tacky size.", "start": 2079.97, "duration": 6.65}, {"text": "And, I really enjoy leafing. I'm not terribly great at it,", "start": 2087.89, "duration": 4.76}, {"text": "I'm learning, but everything I see I want to put gold leaf on now.", "start": 2092.65, "duration": 4.229}, {"text": "It's incredibly fun and incredibly exciting to do.", "start": 2097.75, "duration": 2.729}, {"text": "So once it's all been applied and it's let sit for a day or so", "start": 2100.94, "duration": 3.439}, {"text": "I can start to remove the excess gold with a soft animal hair brush", "start": 2104.38, "duration": 3.929}, {"text": "And I'll save all of that gold because it can be used again for another gilding project", "start": 2108.86, "duration": 4.58}, {"text": "and because it's /gold/ and it's expensive.", "start": 2113.44, "duration": 2.0}, {"text": "But by using a soft brush I can also tamp down and", "start": 2116.68, "duration": 3.26}, {"text": "make sure that the gold that I've applied is smooth.", "start": 2120.5, "duration": 2.98}, {"text": "And again, because I'm not burnishing this I don't need a", "start": 2123.48, "duration": 2.84}, {"text": "super smooth super hard surface.", "start": 2126.88, "duration": 2.0}, {"text": "But one thing I will have to do once I get all the gold well bonded and all of the excess gold off", "start": 2129.32, "duration": 6.82}, {"text": "is I'll have to tone and tint and work the gold so that it matches the original.", "start": 2136.14, "duration": 3.84}, {"text": "You can see that the gold that I use is a little bit more yellow than the gold wood that was originally used.", "start": 2140.39, "duration": 5.81}, {"text": "So I'm gonna have to work to make sure that those match, or at least that they don't look disparate.", "start": 2146.27, "duration": 5.029}, {"text": "I'm gonna do that by using ultra blonde shellac and aniline dye,", "start": 2151.76, "duration": 4.639}, {"text": "And so I'm going to add the dye to the shellac and", "start": 2156.4, "duration": 3.04}, {"text": "mix it up to a color that I think is gonna help bridge that difference.", "start": 2159.44, "duration": 3.38}, {"text": "In this case, it's kind of an orangey red.", "start": 2162.82, "duration": 2.0}, {"text": "So I will apply the shellac with a brush to the areas of new gold.", "start": 2165.7, "duration": 4.86}, {"text": "And you can see, almost Instantly, it starts to take on the look of the original.", "start": 2170.62, "duration": 5.0}, {"text": "And now I'm not trying to make a perfect frame here.", "start": 2176.24, "duration": 2.78}, {"text": "But what I am trying to do is make sure that the areas of damage", "start": 2179.02, "duration": 3.059}, {"text": "don't appear so damaged. That they fit in with the age of the frame,", "start": 2182.599, "duration": 4.28}, {"text": "They don't look new, but they don't look like a hot mess.", "start": 2187.14, "duration": 3.74}, {"text": "And so tinting and working this gold is completely appropriate and helps me achieve that effect", "start": 2190.88, "duration": 4.72}, {"text": "I'll use a little rotten stone, which is basically dust, to give it a little bit of age.", "start": 2196.49, "duration": 4.01}, {"text": "Now there were several labels on the back of this frame and several labels that had been lost,", "start": 2201.88, "duration": 5.58}, {"text": "and that's one thing that we want to make sure it doesn't happen in the future.", "start": 2207.88, "duration": 3.68}, {"text": "We don't want any of these labels to ever get lost", "start": 2211.569, "duration": 2.91}, {"text": "Now, if this frame is ever damaged or replaced,", "start": 2214.48, "duration": 2.79}, {"text": "we want to make sure that these labels which are really important to the provenance of the artwork,", "start": 2217.34, "duration": 4.52}, {"text": "Stay. With. The. Artwork.", "start": 2221.86, "duration": 1.8}, {"text": "So I'm going to remove these labels from the frame.", "start": 2223.66, "duration": 3.34}, {"text": "Luckily, they were applied with just a water-based glue so I can use water to soften up that adhesive and peel up those labels.", "start": 2227.0, "duration": 7.28}, {"text": "They're incredibly delicate and fragile", "start": 2234.44, "duration": 2.059}, {"text": "But once I get them off I can press them, allow them to dry, and then I can mount them to an acid-free", "start": 2237.019, "duration": 6.59}, {"text": "piece of eight ply museum board. And I can wrap that in mylar and then", "start": 2244.009, "duration": 4.64}, {"text": "adhere that to the back of the stretcher where it will stay with the painting forever.", "start": 2248.989, "duration": 4.28}, {"text": "And now my work on the painting, and the frame, are almost complete.", "start": 2256.24, "duration": 3.5}, {"text": "All that's left to do is put the two together.", "start": 2259.74, "duration": 2.0}, {"text": "So the painting goes back into the frame.", "start": 2262.84, "duration": 2.12}, {"text": "And the labels that we mounted to an eight ply acid-free board are mounted to the back of the stretcher using brass screws.", "start": 2265.849, "duration": 7.28}, {"text": "And this ensures that no matter where the painting goes, this provenance stays with it", "start": 2273.4, "duration": 4.6}, {"text": "I'll also add an acid free foam core backing.", "start": 2279.76, "duration": 3.579}, {"text": "And this helps protect the back of the painting and also create an air chamber", "start": 2283.34, "duration": 4.0}, {"text": "so that the flex on the canvas is minimal", "start": 2287.34, "duration": 2.0}, {"text": "which could cause cracking or", "start": 2289.9, "duration": 2.14}, {"text": "undue trauma on the painting.", "start": 2292.609, "duration": 2.0}, {"text": "I'm going to use the original mounting hardware because it worked, and there's no reason to replace it if it's not broken.", "start": 2295.88, "duration": 6.199}, {"text": "I'll use the brass screws and the original holes so that I don't do any more damage to the frame.", "start": 2302.749, "duration": 4.43}, {"text": "Now the original placard had the wrong title of the painting.", "start": 2307.91, "duration": 3.709}, {"text": "So while my clients didn't want it on the face, I'm saving it keep on the back", "start": 2311.62, "duration": 4.92}, {"text": "because once it's gone it's gone, and there's no reason for that.", "start": 2316.54, "duration": 3.96}, {"text": "And so now my work is complete.", "start": 2321.14, "duration": 2.0}, {"text": "The frame has been cleaned off of that grey-brown glazing.", "start": 2323.24, "duration": 5.0}, {"text": "Damage has been repaired. The paintings been cleaned.", "start": 2328.24, "duration": 3.8}, {"text": "The old, inappropriate interleaf lining has been removed.", "start": 2332.04, "duration": 3.32}, {"text": "It's as stable and sound as it has ever been.", "start": 2335.5, "duration": 3.04}, {"text": "And this was a really fun project, not only because of the scope of the work,", "start": 2338.64, "duration": 3.1}, {"text": "but because George Inness is is an American Master, who I studied when I was in art school,", "start": 2341.74, "duration": 4.56}, {"text": "and to play some small role in helping him ensure that his vision, his artwork, sustains, is really what it's all about.", "start": 2346.3, "duration": 8.52}, {"text": "And so you can see the before- the frame is drab and kind of ugly, and the painting is flat and lifeless, but", "start": 2354.82, "duration": 7.44}, {"text": "fully conserved,", "start": 2363.019, "duration": 1.83}, {"text": "It's a glorious painting, and you can see just why Inness was such a master.", "start": 2364.849, "duration": 5.01}]