[{"text": "Get this figure at the BigBadToyStore link in the description", "start": 0.13, "duration": 3.319}, {"text": "\"Reee!\"", "start": 3.449, "duration": 0.821}, {"text": "Hey my name is jobby, and today we're taking a look at a round boi, yes your also indeed a round boi", "start": 4.27, "duration": 5.27}, {"text": "but we're not talking about you, get out, the ocular max omne is a third party", "start": 9.54, "duration": 3.149}, {"text": "Representation of the transformers generation one character named cosmos and according to his bio on tf wiki: insert kejv joke in picture caption here", "start": 13.0, "duration": 7.309}, {"text": "\"the cosmos is also within us, we are made of star...\"", "start": 20.309, "duration": 2.0}, {"text": "And this little butterball transforms into an adorable little", "start": 23.41, "duration": 3.139}, {"text": "UFO so before we get into it, I should mention that my particular copy of the figure did not arrive in a box, this guy", "start": 26.74, "duration": 6.019}, {"text": "Was actually an early production sample sent to me directly from ocular max", "start": 32.759, "duration": 3.78}, {"text": "Themselves and I recieved the way before was in stock, so to them my apologize for the extreme delay", "start": 36.7, "duration": 4.879}, {"text": "PLEASE DON'T SUE ME, the painting and the sculpting on this figure is pretty good. I mean", "start": 41.579, "duration": 2.46}, {"text": "It's nothing spectacular, but that's pretty much", "start": 44.04, "duration": 1.98}, {"text": "How all transformers generation 1 designs were their blocky exceedingly simple", "start": 46.02, "duration": 4.049}, {"text": "But they've got that kind of charm that keeps getting suckers like me to keep buying merch", "start": 50.07, "duration": 3.779}, {"text": "what can I say I love transformers, and on the topic of charm my god is this thing C U TE", "start": 53.85, "duration": 3.42}, {"text": "I mean it barely even looks like a vehicle. It's just a tiny glorified hockey puck", "start": 57.27, "duration": 4.469}, {"text": "but when we take a closer look at the figure. You can definitely see that it is indeed a vehicle", "start": 61.75, "duration": 4.189}, {"text": "It's got some landing gear thrusters on the back and even a cockpit which reveals a very nicely sculpted bumblebee", "start": 65.939, "duration": 5.73}, {"text": "And there's even more of that cockpit when you look at the front of the figure, or is this the back", "start": 71.67, "duration": 3.66}, {"text": "Is this the front ? I don't know anymore  you're gonna need something to pry this open which kind of sucks", "start": 75.33, "duration": 4.019}, {"text": "ehe- and God diggity damn its blaster, and if you don't know who blaster is, I barely even know him either", "start": 80.049, "duration": 4.231}, {"text": "Blaster: \"Heh i'm have been waiting a long time for this...\"", "start": 84.28, "duration": 3.2}, {"text": "\" You poor excuse for a sound system\"", "start": 88.4, "duration": 2.5}, {"text": "Soundwave: \"ALL TALK NO SHOCK\"", "start": 91.0, "duration": 2.9}, {"text": "So not only does this guy look cute", "start": 95.82, "duration": 2.16}, {"text": "He feels", "start": 98.009, "duration": 1.15}, {"text": "Cute too- I don't even know what that means, what I'm saying is that he's nice to hold and he's got a really nice weight", "start": 99.159, "duration": 4.489}, {"text": "To him and that's due to some diecast metal pieces which of course I found through my *moan*, and for the most part this mode holds", "start": 103.649, "duration": 5.85}, {"text": "together really well", "start": 109.5, "duration": 0.57}, {"text": "But there is this one tab that refuses to go in all the way", "start": 110.07, "duration": 2.939}, {"text": "I have to assume this problem was fixed in the final release, and there's a problem then not even a final release can fix", "start": 113.009, "duration": 5.91}, {"text": "I'm not a fan of these gaps. I mean it's not the end of the world but come on", "start": 118.92, "duration": 2.819}, {"text": "It was almost the perfect circle, and as you can see here", "start": 121.74, "duration": 3.089}, {"text": "There's virtually no kibble on this guy which is amazing. So why don't we move on to his accessories", "start": 124.829, "duration": 4.379}, {"text": "There are no accessories, at least not with this production sample according to the instructions you get", "start": 129.52, "duration": 4.129}, {"text": "two mini cannon so I have to assume again that they're included in the final release, but you do get these two cannons", "start": 133.83, "duration": 5.85}, {"text": "Which you can easily", "start": 139.68, "duration": 2.0}, {"text": "*struggling*", "start": 141.68, "duration": 0.92}, {"text": "AHHHHHHHHHH", "start": 142.6, "duration": 0.9}, {"text": "Not easy at all to get these things out", "start": 143.5, "duration": 2.0}, {"text": "*more struggling*", "start": 145.5, "duration": 1.0}, {"text": "AHH F U C K", "start": 146.5, "duration": 0.56}, {"text": "*orgasm*", "start": 147.06, "duration": 0.79}, {"text": "That looks pretty cool and adorably non-threatening", "start": 147.85, "duration": 1.04}, {"text": "these things are also made out of metal which of course I found out (random non-sense), but there's really no point of talking", "start": 148.89, "duration": 4.559}, {"text": "About the possibility of a goddamn dumpling, so we could just move on to the size comparison", "start": 153.45, "duration": 3.389}, {"text": "Here's figma Madoka kaname, S.H. monsterarts Godzilla, Masterpiece Optimus Prime, and another transformable round boi, the masterpiece Bumblebee", "start": 156.84, "duration": 7.5}, {"text": "wait how does this guy fit into here just don't question it, and its no surprise that this guy transforms", "start": 164.34, "duration": 3.779}, {"text": "So we should just get into that, you simply push this button", "start": 168.12, "duration": 2.88}, {"text": "*Micheal bay like explosion* \"THE COSMOS IS ALSO WITHIN US, WE ARE MADE OF STAR STUFF\"", "start": 171.0, "duration": 5.0}, {"text": "*royalty free jazz*", "start": 176.0, "duration": 2.0}, {"text": "And here we have his robot mode, and as you can see it's very faithful to the original g1 drawing", "start": 198.06, "duration": 5.809}, {"text": "Just uhh, not as round", "start": 203.87, "duration": 1.77}, {"text": "He is still short and stocky, but he significantly slimmed down, which makes him look a bit cooler", "start": 205.64, "duration": 4.38}, {"text": "and I gotta admit the robot mode was pretty off-putting at first", "start": 210.23, "duration": 2.52}, {"text": "I'm just so used to my transformers figures vaguely resembling muscle men", "start": 212.75, "duration": 3.179}, {"text": "But after having this figure for about what is it now two months again? Sorry for the delay?", "start": 215.93, "duration": 3.75}, {"text": "Please don't sue me I've gotten used to these proportions, so this robot mode holds together extremely well", "start": 219.68, "duration": 4.11}, {"text": "But there's a little part of the arm. Did break on me", "start": 223.79, "duration": 2.49}, {"text": "This is no slide against the figure itself it might just be due to my own incompetence", "start": 226.28, "duration": 3.33}, {"text": "See I might have pulled it back to hard and there you go", "start": 229.68, "duration": 2.36}, {"text": "but a problem like that is easily fixable with superglue and it's still functional", "start": 232.04, "duration": 4.05}, {"text": "He also feels really nice to hold you to that diecast metal which in this mode is located on his feet", "start": 236.09, "duration": 4.5}, {"text": "It's kind of a common thing with masterpiece style transformers", "start": 240.59, "duration": 2.0}, {"text": "and a really cool detail that I'd noticed so the design on this chest here is a big version of the cockpit of the", "start": 242.67, "duration": 5.33}, {"text": "vehicle mode, so by way of simple transformation engineering this guy managed to pull off mass shifting", "start": 248.0, "duration": 4.2}, {"text": "and at this point I would have talked about accessories, if it had any......", "start": 252.3, "duration": 3.349}, {"text": "but the thrusters of the vehicle mode do become these arm cannon, and one of the landing gears of the vehicle mode becomes", "start": 255.65, "duration": 4.709}, {"text": "*insert dick joke here*", "start": 260.359, "duration": 1.091}, {"text": "so for such a short stocky piece of shit", "start": 261.45, "duration": 3.289}, {"text": "this guy is actually quite POSEABLE", "start": 265.44, "duration": 2.0}, {"text": "ball-joint at the head, can look up very far, and look down very far *chuckle*", "start": 267.479, "duration": 3.95}, {"text": "Rotation at the arm, arm moves out, double bend at the elbow, bicep swivel, wrist swivel, and all his fingers are on", "start": 271.62, "duration": 5.0}, {"text": "Individual hinge joints and it's kind of hard to get out there, thumb is on a ball-joint", "start": 277.2, "duration": 3.649}, {"text": "and on his index finger has a middle hinge-joint, forward movement at the shoulder, but it can't really move back that far", "start": 281.18, "duration": 4.649}, {"text": "*SWIVEL HERE*", "start": 285.829, "duration": 0.581}, {"text": "AB crunch, and this little flap moves to accommodate that, rotation at the leg and that's on a beautiful ratchet", "start": 286.41, "duration": 5.54}, {"text": "side skirts move out allows for it. YES . thigh swivel, landing gear can", "start": 291.95, "duration": 3.75}, {"text": "*more dick jokes*", "start": 295.7, "duration": 0.85}, {"text": "Double bend at the knee, ankle moves up, and you get a beautiful pivot, this guy has an incredible amount of joints", "start": 296.55, "duration": 5.27}, {"text": "But due to the awkward nature of his proportions the poses that you can get with them are kind of limited the arms are especially", "start": 301.82, "duration": 5.88}, {"text": "Awkward, but you can still manage to get some dynamic poses out of him", "start": 307.83, "duration": 2.87}, {"text": "Madoka, Godzilla, Prime, Bumblebee", "start": 312.0, "duration": 2.6}, {"text": "over all this thing is awesome", "start": 314.6, "duration": 1.3}, {"text": "*Godzilla kiss* \"aah\"", "start": 315.9, "duration": 0.96}, {"text": "Yes, the blocky and simple nature of the design might not be for everyone", "start": 316.86, "duration": 3.59}, {"text": "But if your into that g1 stuff, which is totally not outdated, definitely get this figure and for a third party figure", "start": 320.45, "duration": 5.75}, {"text": "it's actually a pretty good prize at the.......", "start": 326.2, "duration": 2.0}, {"text": "BigBadToyStore, so I got to give a big", "start": 338.3, "duration": 1.58}, {"text": "Thanks to all of you guys who suggested patreon alternatives in the last video", "start": 339.88, "duration": 3.72}, {"text": "B U T", "start": 343.6, "duration": 0.31}, {"text": "Fortunately patreon themselves recently announced that they're not gonna go through with the changes that drove a bunch of people away", "start": 343.91, "duration": 5.42}, {"text": "So you know if you were patrons before maybe you can come back maybe...", "start": 349.33, "duration": 2.609}, {"text": "But again my videos are always free and available on YouTube", "start": 351.94, "duration": 2.61}, {"text": "You don't even have to pay a single SHECKLE if you don't want to, but it would be greatly appreciated", "start": 354.55, "duration": 4.289}, {"text": "As for the next review I felt a great disturbance in the cosmos as if hundreds of none", "start": 358.97, "duration": 6.26}, {"text": "Transformers fans and weeaboos who suddenly", "start": 365.54, "duration": 2.389}, {"text": "unsubscribe", "start": 369.08, "duration": 2.0}, {"text": "What can I say I love transformers", "start": 377.78, "duration": 2.0}]