[{"text": "*LIT DOMICS INTRO*", "start": 0.0, "duration": 3.78}, {"text": "Dom: I finally moved out last summer", "start": 5.36, "duration": 2.4}, {"text": "Guy: Wait a minute Dom 20...2017, 2016 so you were.. 25 when you moved out??", "start": 8.0, "duration": 6.46}, {"text": "Dom: Yeah, I'm sorry. I couldn't move out in college, okay?I was broke, my parents were like", "start": 14.62, "duration": 5.46}, {"text": "Momma Dom: \"Oh? you want to move out, huh? No, that's too expensive.\"", "start": 20.18, "duration": 3.339}, {"text": "You could just commute two hours both ways ebrey (every) day.", "start": 23.519, "duration": 3.942}, {"text": "Dom: WHAT?! EVERY DAY?!", "start": 27.461, "duration": 1.488}, {"text": "Momma Dom: Yes.", "start": 29.0, "duration": 0.76}, {"text": "Dom: But that's like four hours every day?!", "start": 29.76, "duration": 1.919}, {"text": "SCARY PHILIPINO MOMMA: EBURI DE (EVERY DAY)", "start": 32.68, "duration": 2.1}, {"text": "Dom: And yeah, They were right.", "start": 34.78, "duration": 1.26}, {"text": "On average, a decent apartment downtown was about $550 to $600 a month.", "start": 36.18, "duration": 4.28}, {"text": "A Go Bus monthly pass was about $80.", "start": 40.46, "duration": 2.58}, {"text": "I mean yeah, I saved a couple hundred dollars a month.", "start": 43.04, "duration": 2.52}, {"text": "But waking up at 5:00 a.m., just to make sure I'm in time for an 8:00 a.m.", "start": 45.56, "duration": 2.979}, {"text": "class that I fall asleep in because I only got three hours of rest....", "start": 48.539, "duration": 3.06}, {"text": "Not really worth it in my opinion.", "start": 51.66, "duration": 1.62}, {"text": "And that is why you should try to make friends in college. (Unlike Dom)", "start": 53.74, "duration": 2.98}, {"text": "Because one of them is bound to have a place you can crash at when you have to build a 1 to 20 scale model", "start": 56.76, "duration": 4.94}, {"text": "of your architectural design and don't want to risk some random dude on the bus", "start": 61.7, "duration": 3.56}, {"text": "OBLITERATING IT because he didn't realize that his backpack was also a wrecking ball.", "start": 65.34, "duration": 3.92}, {"text": "Bird Dom: Anyway, I left the nest. Pretty big milestone in my life.", "start": 69.66, "duration": 3.66}, {"text": "I really didn't have an emergency to move,", "start": 73.32, "duration": 2.68}, {"text": "I mean, some people really want their independence early,", "start": 76.02, "duration": 3.18}, {"text": "and some people want to save money by staying with their parents,", "start": 79.2, "duration": 2.5}, {"text": "some people simply get kicked out.", "start": 82.16, "duration": 1.599}, {"text": "I won't judge. Living away can be pretty expensive.", "start": 83.76, "duration": 3.48}, {"text": "I was comfortable at home, but I knew I was capable of taking care of myself.", "start": 87.56, "duration": 4.62}, {"text": "I just thought it was finally time. (to leave my poor parents alone)", "start": 92.18, "duration": 2.2}, {"text": "My parents really pushed for not moving out and having to rent a place.", "start": 94.46, "duration": 3.22}, {"text": "But to just save up and put a good downpayment to actually own one.", "start": 97.72, "duration": 3.62}, {"text": "And I'm pretty glad I saved up and waited.", "start": 102.08, "duration": 2.5}, {"text": "However I think the move wasn't as dramatic as it should have been,", "start": 104.58, "duration": 2.88}, {"text": "since my place is only like a 20 minute drive from my parents.", "start": 107.46, "duration": 3.24}, {"text": "But I still have my freedom.", "start": 110.94, "duration": 2.1}, {"text": "The actual move itself, though, was a pain.", "start": 113.38, "duration": 3.16}, {"text": "I like to think I didn't own that much,", "start": 116.549, "duration": 1.911}, {"text": "but you really don't know how much you actually have", "start": 118.46, "duration": 2.48}, {"text": "until you try to Tetris it into a U-Haul truck.", "start": 120.94, "duration": 2.62}, {"text": "The place I picked out is a pretty nice condo", "start": 123.56, "duration": 2.46}, {"text": "with a downtown area of my", "start": 126.02, "duration": 1.54}, {"text": "suburban city.", "start": 127.56, "duration": 1.02}, {"text": "I went through a good amount of listings before deciding because a lot didn't have the right room layout", "start": 128.64, "duration": 5.06}, {"text": "I wanted some didn't allow pets some had an amazing view of the dumpsters in the alley (wow, Dom.)", "start": 133.71, "duration": 4.919}, {"text": "I know many people are pretty restricted when it comes to choosing a place, but this was my first owned home.", "start": 138.63, "duration": 6.0}, {"text": "I saved up.$$$", "start": 144.63, "duration": 1.39}, {"text": "Imma get what I want! The previous owner, we'll call him dude WHAT THE HELL, renovated the place before selling it,", "start": 146.02, "duration": 6.199}, {"text": "so it pretty much looked like an IKEA model house.", "start": 152.22, "duration": 2.34}, {"text": "And I know this because when I went to Ikea to shop for furniture. I noticed some decorations and shelves that dude WHAT THE HELL left behind when he moved out, but speaking of shelves?", "start": 154.56, "duration": 9.84}, {"text": "I don't think DUDE WHAT THE HELL knew how to assemble and mount the shelves or at least whoever he hired didn't.", "start": 164.43, "duration": 5.099}, {"text": "There was the shelf in the bedroom that I specifically asked DUDE WHAT THE HELL to dismount before the closing date.", "start": 169.53, "duration": 6.87}, {"text": "It looked nice with the furniture he had, but I knew it wouldn't match mine,", "start": 176.4, "duration": 3.839}, {"text": "but when I moved in what do I find? THE DAMN SHELVES!", "start": 180.37, "duration": 3.63}, {"text": "I was already kind of annoyed by DUDE WHAT THE HELL because he extended the closing date of the condo and was already late with moving out.", "start": 184.0, "duration": 6.9}, {"text": "So I just decided to make the best of it and just use the shelf until I decided to dismount it myself", "start": 190.99, "duration": 4.61}, {"text": "One day,", "start": 196.0, "duration": 0.71}, {"text": "I decided to put a paper flower basket on top of the shelf and then in the middle of the night while I was sleeping,", "start": 196.71, "duration": 5.129}, {"text": "I just hear this loud THUD that woke me up in a slight panic", "start": 201.97, "duration": 3.5}, {"text": "I find the basket and one of the shelf pieces on the floor. I was too tired to deal with it, so I went back to bed", "start": 205.47, "duration": 6.63}, {"text": "Totally could have been a murderer that knocked it over, but Nala (dog) wasn't barking at anything", "start": 212.14, "duration": 4.309}, {"text": "so I trusted that I was safe. The next day I try to figure out why it fell I discovered that the shelf piece...", "start": 216.45, "duration": 6.029}, {"text": "wasn't even nailed or screwed on to the support piece that was attached to the wall. In fact it was simply glued on", "start": 223.06, "duration": 6.559}, {"text": "judging by the ripped paint and no screw holes. So I decided to press lightly on the other shelf piece that was still attached.", "start": 230.17, "duration": 7.339}, {"text": "Didn't stay that way very long. The piece became loose as well and eventually detached so I was left with this support piece that just", "start": 238.21, "duration": 7.819}, {"text": "looked like a total eyesore. I decided screw the shelf!", "start": 246.34, "duration": 3.44}, {"text": "Figuratively, I want it gone. I tried looking for screw holes to figure out how I could dismount this off the wall;", "start": 250.39, "duration": 5.929}, {"text": "I couldn't find any. Tried to pull the piece off the wall...", "start": 256.32, "duration": 3.209}, {"text": "and then I realized, the whole thing was glued on! So I was left with this dumb ass block of wood", "start": 259.53, "duration": 7.05}, {"text": "stuck on the wall because I didn't want to ruin the paint and drywall underneath it. A couple of days later", "start": 266.99, "duration": 5.22}, {"text": "I go to Ikea to look for a desk. Passed by the shelving area and Lo and Behold", "start": 272.21, "duration": 4.079}, {"text": "I discovered the same damn shelf DUDE WHAT THE HELL installed on the wall", "start": 276.289, "duration": 3.9}, {"text": "Or should I say the same two shelves apparently the pieces that were assembled together", "start": 280.229, "duration": 5.9}, {"text": "don't even belong to the same build. The smaller pieces are meant to be hooked onto screws in a wall", "start": 286.62, "duration": 4.82}, {"text": "and the big piece is supposed to be mounted onto a protruding bracket that inserts into it.", "start": 291.44, "duration": 4.529}, {"text": "Dude, what the hell!?! You'd think that the moment you took out the glue you should have realized that something was off and that you", "start": 296.49, "duration": 6.32}, {"text": "have veered away from the instructions intended for the shelf!", "start": 302.81, "duration": 2.729}, {"text": "I got a hunch that they actually knew how it was meant to be done", "start": 306.539, "duration": 3.35}, {"text": "but were just too lazy to drill because later on I decided to mount a TV on the same wall in my room, and", "start": 309.889, "duration": 6.149}, {"text": "the wall is Concrete, and I don't know if you guys ever tried drilling into concrete, but it can be really annoying and yes", "start": 316.139, "duration": 6.98}, {"text": "I used a hammer drill with a proper drill bit so I think whoever mounted the shelf just couldn't be bothered with drilling and just", "start": 323.12, "duration": 7.132}, {"text": "decided to glue it on. Definetly can't do that with a TV. Nevertheless", "start": 330.252, "duration": 3.757}, {"text": "I do like my place overall. Great view of the city, convenient distance to nearby shops and my neighbours are", "start": 334.02, "duration": 6.679}, {"text": "...great? I know that's a lie, my neighbours aren't the most desirable of people, one specifically has caused my roommates", "start": 342.06, "duration": 7.25}, {"text": "and I much trouble but that's a story for another day.", "start": 349.31, "duration": 4.01}, {"text": "Might be a little bit inappropriate, but I'll tell you guys about it sometime.", "start": 353.32, "duration": 2.139}, {"text": "Far Away Dom: My neighbour's a prostitute", "start": 356.669, "duration": 2.291}, {"text": "My advice is you don't really have to rush trying to move out. Unless it's really", "start": 358.96, "duration": 3.279}, {"text": "toxic at home, and you really need to get away from your family,", "start": 362.34, "duration": 2.809}, {"text": "or you murdered someone *BEEP* or you have work or school obligations", "start": 365.15, "duration": 4.109}, {"text": "that would be more beneficial if you moved out, but if your parents will let you stay home", "start": 369.259, "duration": 3.93}, {"text": "*lip smack* save your rent money! Enjoy the homemade cooking while you still can.", "start": 373.189, "duration": 4.051}, {"text": "Not going to lie. This was really just a complain about the glued shelf.", "start": 379.16, "duration": 3.44}, {"text": "subtitles by: Diehard Domic fans", "start": 382.6, "duration": 2.46}, {"text": "Hey guys this video has been brought to you by Crunchyroll", "start": 385.12, "duration": 2.5}, {"text": "Head over to crunchyroll.com/domics (link in the description) to receive a FREE PREMIUM MEMBERSHIP for 30 days.", "start": 388.02, "duration": 6.64}, {"text": "That's a lot of time for some marathons. What perks do you get with premium?", "start": 394.949, "duration": 3.769}, {"text": "Well, ad free and 1080p episodes as soon as one hour after release in Japan, not to mention", "start": 398.82, "duration": 5.69}, {"text": "they are professionally subtitled for your \"authentic Japanese experience\".", "start": 404.51, "duration": 3.569}, {"text": "And there is also a convenient app on nearly every device", "start": 408.08, "duration": 3.63}, {"text": "I know we just watched the beginning of Boku no Hero Academia with Jack, that was a lot of fun,", "start": 411.71, "duration": 5.13}, {"text": "but the show is actually getting deep into season two right now.", "start": 416.84, "duration": 2.85}, {"text": "Plenty of time to catch up within those 30 days", "start": 420.2, "duration": 2.26}, {"text": "Again, that's crunchyroll.com/domics, link below", "start": 422.64, "duration": 4.16}, {"text": "ENJOY <3", "start": 427.18, "duration": 1.48}, {"text": "Hi! You discovered secret message from: SUBTITLE AUTHORS! We wrote this all out for you earless people out there!", "start": 428.92, "duration": 2.66}, {"text": "(You're welcome.)", "start": 432.0, "duration": 1.38}]