[{"text": "Part of this video was sponsored by LastPass. Stick around to the end for a word from our sponsor.", "start": 0.0, "duration": 4.86}, {"text": "In a recent study participants were placed in a room for between 6 and 15 minutes.", "start": 5.76, "duration": 5.14}, {"text": "They were given nothing except a button that they knew would shock them if they pressed it.", "start": 10.9, "duration": 4.6}, {"text": "They were asked to entertain themselves with their thoughts,", "start": 16.24, "duration": 2.94}, {"text": "but they could self administer the shock if they so chose.", "start": 19.18, "duration": 4.02}, {"text": "So what happened?", "start": 23.82, "duration": 1.26}, {"text": "Well, 25% of women and 67% of men shocked themselves.", "start": 25.08, "duration": 7.24}, {"text": "This is despite the fact that they had previously told the experimenters", "start": 32.32, "duration": 3.96}, {"text": "that they would pay money to avoid the shock.", "start": 36.28, "duration": 2.66}, {"text": "Apparently they'd rather experience physical pain than just be bored;", "start": 38.94, "duration": 4.64}, {"text": "to have nothing to keep them occupied but their thoughts.", "start": 43.58, "duration": 3.44}, {"text": "But they are not alone.", "start": 47.02, "duration": 2.3}, {"text": "Around 95% of American adults report participating in some leisure activities over the past 24 hours.", "start": 49.32, "duration": 6.7}, {"text": "But only 17% say they spent any time at all just relaxing and thinking,", "start": 56.02, "duration": 6.48}, {"text": "because that apparently is boring, and being bored is unpleasant.", "start": 62.5, "duration": 5.22}, {"text": "So what is boredom? Well contrary to popular belief, it's not when you have absolutely nothing to do.", "start": 67.72, "duration": 7.12}, {"text": "It's just when none of the options you have available to you appeal to you.", "start": 74.84, "duration": 4.28}, {"text": "Boredom is characterized by a lack of concentration, restlessness, but also feeling lethargic.", "start": 79.12, "duration": 6.7}, {"text": "It's really a state of being underwhelmed.", "start": 85.82, "duration": 3.04}, {"text": "And there are now more ways than ever to avoid boredom.", "start": 88.86, "duration": 4.2}, {"text": "With Facebook, Twitter, Instagram, Snapchat, YouTube,", "start": 93.06, "duration": 3.64}, {"text": "not to mention my chronic news I have waiting in line, sitting in a coffee shop, stopped at a traffic light.", "start": 96.7, "duration": 5.26}, {"text": "Many people reach for their phones to stave off boredom, and nowhere is sacred.", "start": 101.96, "duration": 5.64}, {"text": "Do you ever just let yourself be bored?", "start": 107.6, "duration": 1.94}, {"text": "No, no, I generally don't.", "start": 110.46, "duration": 2.04}, {"text": "But are we losing anything by avoiding boredom?", "start": 112.5, "duration": 3.2}, {"text": "Well, scientific research says yes, and what we're losing is important.", "start": 115.7, "duration": 5.74}, {"text": "When you're bored your mind wanders.", "start": 123.44, "duration": 2.8}, {"text": "That's only natural.", "start": 127.5, "duration": 2.0}, {"text": "The state of boredom is one where your attention is not focused on anything in particular.", "start": 130.42, "duration": 4.54}, {"text": "Researchers have shown this mind wandering is useful for creativity.", "start": 136.86, "duration": 4.2}, {"text": "They gave study participants a random boring task. The most boring one: reading the phone book.", "start": 142.18, "duration": 6.4}, {"text": "Then, they asked participants to be creative;", "start": 149.22, "duration": 2.48}, {"text": "generate as many ideas as they could for what you could do with a plastic cup.", "start": 151.7, "duration": 4.48}, {"text": "Those in the most boring read the phone book condition", "start": 156.18, "duration": 3.18}, {"text": "generated the most creative solutions compared to less bored controls.", "start": 159.36, "duration": 4.7}, {"text": "A major reason many researchers suspect that we experience boredom", "start": 165.81, "duration": 4.07}, {"text": "is because it gives you an indicator of your current state.", "start": 169.88, "duration": 3.06}, {"text": "I mean, if you find yourself feeling bored, you know something about that situation isn't working for you.", "start": 172.94, "duration": 5.16}, {"text": "Let me ask you this. When you're in class and you're a bit bored", "start": 178.1, "duration": 2.66}, {"text": "do you ever just pull out your phone and have a look at stuff?", "start": 180.76, "duration": 2.12}, {"text": "Yeah. All the time.", "start": 182.88, "duration": 1.7}, {"text": "So the paradox of boredom is that it makes you feel tired, sluggish and just disinterested.", "start": 185.6, "duration": 6.7}, {"text": "But it may actually spur you to action. It may get you to make changes that would be positive for your life.", "start": 192.3, "duration": 6.46}, {"text": "And changes like getting this guy's legs out of my face. That would be perfect.", "start": 199.52, "duration": 4.24}, {"text": "In the absence of boredom, one would remain trapped in unfulfilling situations", "start": 205.8, "duration": 5.1}, {"text": "and miss out on many emotionally, cognitively and socially rewarding experiences.", "start": 210.9, "duration": 5.24}, {"text": "Boredom is both a warning that we're not doing what we want to be doing,", "start": 216.14, "duration": 3.84}, {"text": "and a push that motivates us to switch goals and projects.", "start": 219.98, "duration": 3.94}, {"text": "Studies have also shown that boredom may make you more altruistic.", "start": 223.92, "duration": 4.32}, {"text": "Perhaps the acute sense of aimlessness you experience when you're bored gets out of control,", "start": 228.24, "duration": 4.82}, {"text": "and makes you question what you're doing with your life as a whole.", "start": 233.06, "duration": 3.18}, {"text": "But the silver lining is that it may trigger you to think about others and what you can do to help them.", "start": 236.24, "duration": 5.16}, {"text": "And that provides an immediate and concrete purpose to a life that might momentarily feel like it's lacking one.", "start": 241.4, "duration": 6.16}, {"text": "You know, studies designed to induce boredom have shown", "start": 247.56, "duration": 2.96}, {"text": "that more bored participants are more likely to donate to charity, or to give blood.", "start": 250.52, "duration": 4.7}, {"text": "Can I ask what led you to donate blood today?", "start": 255.22, "duration": 2.9}, {"text": "I had free time in my hands. You know, just, waiting for 2 hours, an hour and a half or so.", "start": 259.86, "duration": 4.12}, {"text": "So apparently the opportunity to do meaningful,", "start": 263.98, "duration": 3.28}, {"text": "even if unpleasant activities have more value if you're bored than if you're not.", "start": 267.26, "duration": 5.3}, {"text": "Similarly, this aimless state seems to cultivate thoughts about what you want to do with your life.", "start": 273.44, "duration": 5.98}, {"text": "To think of your life as a story and consider where you want it to go in the future.", "start": 279.42, "duration": 4.5}, {"text": "This is called autobiographical planning.", "start": 283.92, "duration": 2.86}, {"text": "When given tasks that only use a fraction of mental capacity,", "start": 286.78, "duration": 3.36}, {"text": "study participants frequently thought of the future and their plans for it.", "start": 290.14, "duration": 4.2}, {"text": "In this way being bored is essential for goal-setting.", "start": 294.34, "duration": 3.48}, {"text": "If your brain is always consumed with other stimuli,", "start": 297.82, "duration": 3.78}, {"text": "you'll rarely ponder the bigger picture and set long-term goals for yourself and consider how to achieve them.", "start": 301.6, "duration": 6.3}, {"text": "Does a phone get rid of your boredom?", "start": 307.9, "duration": 1.88}, {"text": "Yeah, actually, thinking about it, it does.", "start": 311.12, "duration": 3.52}, {"text": "So every time you're waiting for something,", "start": 314.64, "duration": 2.32}, {"text": "you have a decision to make which seems like a tiny one.", "start": 316.96, "duration": 3.6}, {"text": "Pull out your phone for a few seconds or minutes, or just be bored; experience only your thoughts.", "start": 320.56, "duration": 6.7}, {"text": "It seems like an insignificant decision.", "start": 327.26, "duration": 2.6}, {"text": "And if you don't give it much thought the obvious action is to see what's new on your app of choice", "start": 329.86, "duration": 5.08}, {"text": "And in making that decision you are alleviating a moment of boredom.", "start": 334.94, "duration": 4.26}, {"text": "But you are also likely making yourself less creative, less altruistic,", "start": 339.2, "duration": 4.84}, {"text": "less likely to assess your current state and less likely to set goals for your future.", "start": 344.04, "duration": 4.96}, {"text": "In short, you are the real world example of someone shocking themselves", "start": 349.0, "duration": 4.46}, {"text": "to avoid the unpleasantness of boredom.", "start": 353.46, "duration": 3.0}, {"text": "Except in your case, the pain goes much deeper to the very nature of who you are, and who you will become.", "start": 356.46, "duration": 7.2}, {"text": "So think carefully before pressing that button.", "start": 363.66, "duration": 3.34}, {"text": "So, being bored is apparently something our brains need to do.", "start": 371.98, "duration": 4.4}, {"text": "Something our brains don't need to do, is remember lots of random passwords.", "start": 376.38, "duration": 4.44}, {"text": "Which is why the sponsor of this video is LastPass.", "start": 380.82, "duration": 3.46}, {"text": "LastPass is a password manager", "start": 384.28, "duration": 2.2}, {"text": "that offers unlimited password storage plus free sync across all your devices, and password breach alerts.", "start": 386.48, "duration": 7.52}, {"text": "That way you never have to remember another password or write it down,", "start": 394.0, "duration": 4.1}, {"text": "look for one, forget your passwords, reset them.", "start": 398.1, "duration": 2.6}, {"text": "All of that hassle is just pushed aside and you can put your passwords on autopilot with LastPass.", "start": 400.7, "duration": 6.36}, {"text": "And that way you can free up your valuable brain space for", "start": 407.06, "duration": 3.48}, {"text": "just being bored and thinking about your life rather than remembering your passwords.", "start": 410.54, "duration": 4.8}, {"text": "Now, LastPass has multi-factor authentication which is super important because it keeps your accounts secure.", "start": 415.34, "duration": 5.24}, {"text": "It also interfaces with Microsoft and Yubikey's multi-factor authentication.", "start": 420.58, "duration": 4.56}, {"text": "And one feature I love about LastPass is it allows you to share,", "start": 425.14, "duration": 3.6}, {"text": "safely and securely, your passwords with other people who may need them for certain accounts.", "start": 428.74, "duration": 5.5}, {"text": "That's a very handy feature.", "start": 434.24, "duration": 1.96}, {"text": "So if you want to check out LastPass, click on the link in the description.", "start": 436.2, "duration": 3.98}]