[{"text": "Linus tech tips was hacked", "start": 1.0, "duration": 1.099}, {"text": "They were using a simple password and their website's database was dumped. You can buy it for five bucks", "start": 2.5, "duration": 6.29}, {"text": "Only one of those four rumors is true and even then only in a fairly loose sense more on that later", "start": 10.179, "duration": 5.78}, {"text": "Welcome to an impromptu episode of honest answers that I'm calling", "start": 16.6, "duration": 3.769}, {"text": "WTF is going on over there", "start": 21.43, "duration": 1.7}, {"text": "I'll be addressing the abrupt shift in branding of the @LinusTech Twitter handle the recent", "start": 23.13, "duration": 5.16}, {"text": "banning of our Amazon associates account and of course", "start": 28.599, "duration": 3.02}, {"text": "the hack", "start": 32.23, "duration": 2.0}, {"text": "The AKG K7XX headphones are back on Massdrop", "start": 42.55, "duration": 3.47}, {"text": "check out my review of them up here and check out the drop at the link in the video description", "start": 46.02, "duration": 4.829}, {"text": "so on June 14th 2016 Amazon sent me an email", "start": 51.52, "duration": 3.619}, {"text": "Warning me that my Amazon associates account was not in compliance with the operating agreement", "start": 55.51, "duration": 5.09}, {"text": "Specifically the part where associates are not permitted to disclose how their referral fees will be used", "start": 61.39, "duration": 5.93}, {"text": "I was instructed to make any and all necessary modifications to my site and", "start": 67.32, "duration": 4.44}, {"text": "Processes within five business days and notify them when I was done, one small problem", "start": 72.159, "duration": 4.79}, {"text": "My call-out for Amazon was baked into the tail end of nearly 500 linus tech tips videos dating back a couple of years", "start": 77.38, "duration": 7.819}, {"text": "With no way at least what I was aware of to alter previously uploaded youtube videos", "start": 85.81, "duration": 5.779}, {"text": "my efforts to reach anyone by phone or by email", "start": 92.079, "duration": 3.05}, {"text": "Basically resulted in a second email to which there was no way for me to even reply three days later", "start": 95.95, "duration": 5.87}, {"text": "Informing me that my business model wasn't a good fit for the program, and that my account had been terminated effective immediately", "start": 102.189, "duration": 6.35}, {"text": "long Story short, I'm not revealing names", "start": 109.0, "duration": 2.629}, {"text": "So they don't get flooded with requests to help with Amazon associates issues, but this right now is a huge", "start": 111.63, "duration": 7.379}, {"text": "Shout-out to some industry folks who helped me get in touch", "start": 119.71, "duration": 3.229}, {"text": "Giving me an opportunity to discuss the situation and plead my case over the phone on June 22nd", "start": 123.34, "duration": 6.139}, {"text": "You guys rock. The result though was not as some have speck related a green light to reactivate our account", "start": 129.479, "duration": 6.67}, {"text": "But rather an opportunity to reapply for a new account which has been approved", "start": 136.15, "duration": 5.159}, {"text": "So in summary our old associates. ID and all the tracked links under our old", "start": 141.77, "duration": 5.149}, {"text": "Non-compliant videos are inactive though. We are pursuing an interesting method that we could use to update those old videos and", "start": 147.59, "duration": 8.0}, {"text": "reactivate the Associated links under the new Tracking ID", "start": 156.38, "duration": 3.11}, {"text": "So we'll see how that goes but in the meantime", "start": 160.13, "duration": 2.27}, {"text": "because as many of you who watched how does LMG make money know the Amazon associates program has been a", "start": 163.37, "duration": 5.84}, {"text": "Significant source of our revenue, we are coming Back strong", "start": 169.61, "duration": 3.02}, {"text": "Speaking of which prime day is coming up", "start": 173.3, "duration": 2.119}, {"text": "So you might want to go shop on Amazon or sign up for a prime membership using the link in our description?", "start": 175.42, "duration": 4.8}, {"text": "Let's move on to the compromised @LinusTech Twitter handle", "start": 181.25, "duration": 3.74}, {"text": "Generally speaking", "start": 186.02, "duration": 1.2}, {"text": "We don't acknowledge attacks on our persons or business for what I'd hope are pretty obvious reasons", "start": 187.22, "duration": 6.5}, {"text": "but in this case", "start": 194.18, "duration": 1.26}, {"text": "It's part of a much larger problem. That's affecting other", "start": 195.44, "duration": 3.06}, {"text": "YouTubers and even more importantly could also affect you. The manner in which the LinusTech Twitter handle and my personal hotmail and Gmail", "start": 198.7, "duration": 7.56}, {"text": "Then by extension my domain name registrar account were compromised had almost", "start": 206.8, "duration": 5.22}, {"text": "Nothing to do with poor security practices on our part. Yes", "start": 212.39, "duration": 3.889}, {"text": "My registrar login email account should not have been a personal one", "start": 216.41, "duration": 4.369}, {"text": "that was just a legacy thing from before I even", "start": 220.78, "duration": 2.97}, {"text": "Registered a corporate domain name and that has since been rectified along with some other new security measures that again", "start": 223.97, "duration": 5.779}, {"text": "I hope you can understand this I won't be discussing publicly but other than that", "start": 229.75, "duration": 4.32}, {"text": "there was nothing I could have done to prevent this an", "start": 234.62, "duration": 2.3}, {"text": "Individual right now. It's not clear whether it was over the phone or by actually walking into a physical location", "start": 237.739, "duration": 5.27}, {"text": "Committed identity fraud and was able to convince Bell Canada to activate a sim card in my name which", "start": 243.709, "duration": 7.19}, {"text": "Deactivated my own sim card and began immediately forwarding all phone calls and text messages to that individuals phone", "start": 251.54, "duration": 7.699}, {"text": "My mother-in-law's first reaction when I told her about this was did they place any long-distance phone calls", "start": 259.79, "duration": 5.6}, {"text": "different generation, right", "start": 266.09, "duration": 1.82}, {"text": "So I explained to her and I guess in recounting the story also you but it's much more serious than that", "start": 267.91, "duration": 5.51}, {"text": "with access to my incoming calls and texts this person can break into any", "start": 273.64, "duration": 5.209}, {"text": "account where", "start": 279.46, "duration": 1.92}, {"text": "theoretically", "start": 281.38, "duration": 1.41}, {"text": "SMS account verification acts as a a pseudo", "start": 282.79, "duration": 3.619}, {"text": "physical authentication factor if you want more information about multi-factor authentication", "start": 287.02, "duration": 4.13}, {"text": "Check out this video and in some cases it can even act as a single", "start": 291.52, "duration": 5.419}, {"text": "authentication factor for lost password requests", "start": 297.91, "duration": 3.23}, {"text": "Now as a rule. I don't do youtube drama go subscribe to H3H3 productions or something if you're into that stuff", "start": 301.87, "duration": 6.739}, {"text": "I'll stay focused on tech, but even inside my bubble", "start": 308.91, "duration": 3.899}, {"text": "I've managed to catch wind a similar attacks being used on Boogie and", "start": 312.81, "duration": 3.87}, {"text": "Leafy with the same group claiming responsibility for stealing lily singh's account and a handful of others, so I felt the need to address it", "start": 317.14, "duration": 7.85}, {"text": "fortunately for us", "start": 325.84, "duration": 1.5}, {"text": "Even though I was in the middle of an on location video", "start": 327.34, "duration": 2.509}, {"text": "shoot picking blueberries of all things when my cell phone service turned off", "start": 329.85, "duration": 3.839}, {"text": "Which also made it harder for me to notice the army of loyal followers who were messaging me to inform me of the problem?", "start": 333.79, "duration": 5.839}, {"text": "Thank you very much guys. Nick and Yvonne great work too them to very quickly figured out the method of attack", "start": 339.67, "duration": 6.649}, {"text": "Deactivated my mobile account deactivated our Twitter account and called me back into the office to start locking everything down", "start": 346.75, "duration": 5.809}, {"text": "The Hijackers never got into the youtube channels so all they pretty much managed to do was vandalize my Twitter and use our", "start": 352.9, "duration": 7.639}, {"text": "registrar dashboard to redirect website traffic from LinusTechtips.com and", "start": 360.67, "duration": 4.309}, {"text": "incoming mail heading to the @Linusmediagroup.com domain both of which were happening for under an hour and", "start": 365.71, "duration": 6.109}, {"text": "Probably are where the worries about our forum users data comes from?", "start": 372.52, "duration": 3.529}, {"text": "Rest easy this was a simple social engineering exploit", "start": 376.75, "duration": 3.89}, {"text": "And they were nowhere near any of our servers let alone harvesting any data from them however", "start": 380.64, "duration": 6.0}, {"text": "Even if this is a social engineering trick", "start": 387.55, "duration": 3.019}, {"text": "And it has to be executed on a one-By-one basis", "start": 390.57, "duration": 2.97}, {"text": "Because this method of attack has been demonstrated to be so successful", "start": 394.0, "duration": 3.98}, {"text": "I feel like it's important to recommend to our viewers that they do a security audit ensuring that their accounts", "start": 398.17, "duration": 6.469}, {"text": "Do not have a single point of entry", "start": 404.639, "duration": 2.339}, {"text": "including through their phone and", "start": 407.649, "duration": 2.0}, {"text": "That they call a provider to check who is authorized to make changes to the account and what the process is for", "start": 409.869, "duration": 6.019}, {"text": "validating that person's identity", "start": 416.409, "duration": 2.0}, {"text": "Those guys aren't going to understand how serious this problem is until it starts increasing their call volumes and affecting their bottom lines", "start": 419.049, "duration": 7.46}, {"text": "anyway, make lemons out of lemonade right since I had to reset my profile picture anyhow I figured it was as good a time as", "start": 427.749, "duration": 6.709}, {"text": "any to finally make the transition, the @LinusTech Twitter handle moving forward will be the", "start": 434.459, "duration": 5.55}, {"text": "Official Twitter for the Linus tech tips video publication, and I will be starting a new personal Twitter account", "start": 440.529, "duration": 5.54}, {"text": "@linusgsebastian a similar transition will likely occur on Instagram very shortly the", "start": 446.589, "duration": 4.88}, {"text": "reason for this being that I feel like I am under utilizing the huge team of social media experts here at Linus media group and", "start": 451.839, "duration": 6.649}, {"text": "That by having everyone posting content and replies to these accounts. We can provide you guys with", "start": 458.489, "duration": 5.61}, {"text": "Much more behind the scenes more timely updates and more sexy shots of products and/or Dennis", "start": 464.679, "duration": 5.69}, {"text": "last order of business", "start": 470.979, "duration": 2.0}, {"text": "Congratulations to the Tech Quickie team which throughout its history has involved every single member of the company", "start": 473.199, "duration": 5.87}, {"text": "But currently is mostly the John and Dennis show with me and Luke hosting and also. Thanks to all of you for your support", "start": 479.139, "duration": 6.2}, {"text": "They just broke a million subscribers making us double gold", "start": 485.739, "duration": 4.37}, {"text": "Channel Super Fun next right, well might take a while, but it's gonna happen", "start": 490.809, "duration": 4.279}, {"text": "Well, that's probably going to be a while, but in the meantime if you have to fix any electronics", "start": 496.059, "duration": 5.48}, {"text": "ifixit.com is your go-to place from there", "start": 502.209, "duration": 3.679}, {"text": "19,000 free step-By-step repair guides to their huge inventory of replacement parts to their tools with lifetime", "start": 507.009, "duration": 6.59}, {"text": "Warranties, ifixit has got your repair needs covered we use their stuff all", "start": 513.849, "duration": 5.119}, {"text": "The time but my go-to is the pro tech tool kit which has actually been upgraded in the time that we have been", "start": 519.579, "duration": 7.82}, {"text": "Advertising for it and also since I bought my first one over three years ago, so instead of 54 bits it includes", "start": 527.92, "duration": 7.909}, {"text": "64 bits you know sixty four-bit am I right. It's like better more RAM", "start": 536.41, "duration": 4.52}, {"text": "no, there's no RAM in it", "start": 540.93, "duration": 1.26}, {"text": "But there's all kinds of stuff like their redesigned", "start": 542.19, "duration": 2.82}, {"text": "Screwdriver, their flex extension, their ESD tweezers including a pair of reverse tweezers, their plastic", "start": 545.29, "duration": 5.66}, {"text": "opening tools, their suction cups, the metal spudger,  the Jimmy pry tool and", "start": 551.11, "duration": 4.849}, {"text": "You've got an ESD bracelet that you can wear to make sure you're not zapping the components. You're working at it's priced at", "start": 557.14, "duration": 6.22}, {"text": "It's priced at $69.95 and the best part is that you can save 5 bucks just by using our offer code which is linked in the video description", "start": 563.36, "duration": 8.56}, {"text": "so that's code linus in the check out to save $5 on any purchase of $10 or", "start": 572.26, "duration": 5.74}, {"text": "more. So thanks for watching guys, if this video sucked", "start": 578.04, "duration": 3.4}, {"text": "You know what to do", "start": 581.52, "duration": 1.1}, {"text": "But if it was awesome get subscribed hit that like button or check out the link to where to buy the stuff we featured at", "start": 582.63, "duration": 5.969}, {"text": "Amazon in the video description or maybe even a prime membership", "start": 588.6, "duration": 3.03}, {"text": "I think that's actually the only thing I mentioned in this video also linked in the description is our merch store", "start": 591.63, "duration": 4.409}, {"text": "Which has cool shirts like this one and our community forum which you should totally join", "start": 596.04, "duration": 3.84}, {"text": "Now that you're done doing all that stuff", "start": 600.16, "duration": 1.429}, {"text": "You're probably wondering what to watch next so click that little button in the top right corner", "start": 601.589, "duration": 3.359}, {"text": "To check out the last episode of honest answers where I talk about how exactly it is that linus media group makes money", "start": 605.11, "duration": 6.95}]