[{"text": "Hi! AC motor is a founding father of our modern society. Without it,", "start": 0.039, "duration": 6.14}, {"text": "we would fall back to the steam engine, dark ages. People suffering in coal mines", "start": 6.18, "duration": 5.31}, {"text": "[screams in pain] F*ck [High Pitched]", "start": 11.49, "duration": 1.42}, {"text": "Loose wires, Avoid them...", "start": 12.91, "duration": 2.49}, {"text": "The Rise of the AC motor (by ElectroBoom)", "start": 15.78, "duration": 3.94}, {"text": "For a long time, AC motor was in hiding, until it was recognized by Nikola Tesla and Galileo Ferraris around the same time.", "start": 20.22, "duration": 9.48}, {"text": "Nikola Tesla would prove to be AC's strongest ally.", "start": 29.7, "duration": 3.94}, {"text": "After the civil war between AC and DC,", "start": 34.12, "duration": 2.72}, {"text": "Nikola Tesla triumphed and crowned the AC motor as the king of power in the modern society.", "start": 37.54, "duration": 7.46}, {"text": "That sums it up.", "start": 45.04, "duration": 1.16}, {"text": "I love documentaries. That's why this video is sponsored by...", "start": 46.2, "duration": 4.66}, {"text": "CuriosityStream", "start": 51.08, "duration": 1.46}, {"text": "With over 2400 documentaries and non-fiction titles including exclusive originals.", "start": 52.72, "duration": 6.82}, {"text": "Now starting at $2.99 a month, you get unlimited access to", "start": 59.82, "duration": 3.8}, {"text": "fantastic documentaries made by some of the world's best filmmakers.", "start": 63.62, "duration": 4.38}, {"text": "You can also get 31 days of free full access", "start": 68.04, "duration": 2.66}, {"text": "If you go to www.curiositystream.com/electroboom and use promo code \"ElectroBoom\" at checkout.", "start": 70.82, "duration": 6.1}, {"text": "So, Nikola Tesla suddenly found a solution to create rotating magnetic fields using three-phase AC.", "start": 77.1, "duration": 6.72}, {"text": "When he was working with his friend the solution came to him and he drew it in the sand", "start": 83.96, "duration": 4.1}, {"text": "And that resulted in two of the most popular AC motors, which are the induction motor and the permanent magnet AC motor", "start": 88.06, "duration": 7.74}, {"text": "I've talked in detail in one of my previous videos that you can create a rotating magnetic field,", "start": 96.0, "duration": 4.96}, {"text": "if you run three coils from three-phase AC", "start": 101.08, "duration": 2.76}, {"text": "Let's start with induction motors and that's where Eddy current comes in, which I talked about in detail in my other video you can watch.", "start": 103.98, "duration": 7.44}, {"text": "Basically, if you pass a changing magnetic field through any conductor,", "start": 111.58, "duration": 3.68}, {"text": "it creates currents inside that conductor called Eddy currents.", "start": 115.28, "duration": 3.7}, {"text": "As I showed, if you drop a magnet through a copper pipe or a roll of aluminum foil, the magnet slows down.", "start": 119.18, "duration": 6.36}, {"text": "Wheeeeee!!!", "start": 125.7, "duration": 1.64}, {"text": "Beautiful! Wheeeeee!!!", "start": 127.36, "duration": 2.26}, {"text": "It's because the generated Eddy currents in the pipe create opposing magnetic fields", "start": 129.76, "duration": 4.92}, {"text": "that push the magnet back up or looking at it the other way around the magnet is pushing the pipe down.", "start": 134.74, "duration": 4.92}, {"text": "So if I have a metal pipe, this is brass and move a magnet beside it, I can move it.", "start": 139.94, "duration": 5.16}, {"text": "There... I think my magnet has to move faster", "start": 146.79, "duration": 3.08}, {"text": "So I put a bunch of them on my drill bit and I'm gonna turn them fast beside the pipe.", "start": 149.87, "duration": 3.89}, {"text": "There you go.", "start": 155.9, "duration": 2.0}, {"text": "Still pretty weak though. Let's try with a low resistance copper pipe", "start": 158.84, "duration": 4.34}, {"text": "There you go.", "start": 164.68, "duration": 1.64}, {"text": "This is much faster.", "start": 166.98, "duration": 2.0}, {"text": "So if I have three phase coils around the metal pipe which is the rotor,", "start": 169.68, "duration": 4.2}, {"text": "The rotating magnetic fields create the same forces on the rotor and turn it.", "start": 173.92, "duration": 4.56}, {"text": "This is an induction motor because the current is induced in the rotor.", "start": 178.489, "duration": 3.63}, {"text": "It is also an asynchronous motor meaning that the speed of the rotation is not synchronized by the frequency of the AC power", "start": 182.48, "duration": 7.77}, {"text": "Like you saw here, the magnetic fields can turn much faster than the rotor", "start": 190.62, "duration": 4.46}, {"text": "But the rotor at no load can only turn as fast as magnetic fields are not faster.", "start": 195.48, "duration": 6.1}, {"text": "In permanent magnet motors, the rotor is made of magnets.", "start": 201.64, "duration": 3.52}, {"text": "These are synchronous motors meaning that you can't just drop any AC frequency on the rotor.", "start": 205.26, "duration": 5.72}, {"text": "Imagine this is the rotor and its magnets. And this is the changing magnetic field. If I move the magnet slowly,", "start": 210.98, "duration": 8.2}, {"text": "I can ramp up the speed of the rotor", "start": 219.18, "duration": 2.52}, {"text": "But if I start fast, the rotor doesn't have time to speed up and follow the fields and doesn't turn", "start": 222.04, "duration": 5.6}, {"text": "That's why in permanent magnet motors like this. You have to commutate the three-phase AC input frequency accurately.", "start": 227.72, "duration": 7.08}, {"text": "You need to know the position of the rotor and adjust the input voltage frequency and that becomes more complicated.", "start": 234.96, "duration": 6.14}, {"text": "That's why we need proper control electronics like this electronic control unit or ECU to run the motor.", "start": 241.14, "duration": 6.28}, {"text": "[Propeller Spins]", "start": 247.64, "duration": 1.32}, {"text": "F*ck", "start": 249.1, "duration": 0.54}, {"text": "These motors although they need three-phase AC input always come with these ECUs that run on DC and a control signal.", "start": 250.64, "duration": 8.02}, {"text": "so they are also called brushless DC motors", "start": 258.66, "duration": 3.02}, {"text": "Let's make an induction motor.", "start": 261.76, "duration": 1.78}, {"text": "To make my three-phase the stator windings, I'm using this steel strap and some steel screws and washers.", "start": 263.54, "duration": 5.42}, {"text": "It's important that they are steel or iron so that they can amplify the magnetic fields.", "start": 269.44, "duration": 5.3}, {"text": "Now I just glue the washer", "start": 274.74, "duration": 2.62}, {"text": "My screw", "start": 277.76, "duration": 0.98}, {"text": "The washer helps to keep the wires in place", "start": 278.74, "duration": 2.26}, {"text": "It is fortunate that my screws fit well into my strap holes.", "start": 281.42, "duration": 4.2}, {"text": "I'll put some crazy glue on this too so it won't jump out", "start": 285.62, "duration": 3.34}, {"text": "Then I'll wind many turns of magnet wire, which is basically", "start": 289.24, "duration": 4.2}, {"text": "coated copper wire around these screws, the same direction on all screws. You can get these wires from your old transformers", "start": 293.6, "duration": 7.3}, {"text": "I did 200 turns around this one and should do the same number of turns on the rest too. Hopefully it's enough.", "start": 303.38, "duration": 5.48}, {"text": "Okay. The good thing about these steel straps is that it", "start": 310.88, "duration": 2.9}, {"text": "short-circuits the magnetic fields and keeps them strong, the same as this steel body of the motor", "start": 313.78, "duration": 5.52}, {"text": "Now, to keep the wiring simple,", "start": 319.3, "duration": 1.56}, {"text": "I'm gonna do a Delta configuration like this. You can do a Y configuration too", "start": 320.86, "duration": 5.28}, {"text": "For the rotor, I'm going to use this smoked copper pipe. You probably remember these from one of my super old videos", "start": 326.14, "duration": 6.46}, {"text": "[One of Mehdi's Old Video] Let's see if I can weld these two pieces", "start": 332.61, "duration": 2.0}, {"text": "I'm gonna cut some extra piece of this off", "start": 336.84, "duration": 2.989}, {"text": "This is gonna take forever", "start": 342.78, "duration": 1.52}, {"text": "I really need to get a vise, I thought copper was easier to cut", "start": 350.64, "duration": 3.28}, {"text": "This is slightly easier", "start": 354.78, "duration": 2.0}, {"text": "Now I want to fill this with a whole bunch of steel nails to create an iron core", "start": 357.39, "duration": 4.429}, {"text": "So that's the magnetic field has a closed circuit to go through", "start": 361.82, "duration": 3.839}, {"text": "It is good that the nails are not touching each other because we want the eddy current to only flow through the copper", "start": 371.349, "duration": 5.63}, {"text": "Otherwise the nails would waste energy. They are here only to direct the magnetic field and amplify it", "start": 377.199, "duration": 5.6}, {"text": "There you go. A rotor with tons of nails in it", "start": 382.84, "duration": 2.809}, {"text": "Now we take one of these CD covers to make a housing for our motor", "start": 385.66, "duration": 3.619}, {"text": "Dammit! All my windings are shorted with chassis. I have to isolate them better", "start": 395.46, "duration": 4.62}, {"text": "There, I put some paper and tapes between the windings and the chassis and everything is isolated and the rotor is in too", "start": 400.1, "duration": 5.94}, {"text": "It's finished!", "start": 407.44, "duration": 1.52}, {"text": "If you recall, I have a three-phase generator here", "start": 414.04, "duration": 3.28}, {"text": "which is basically a brushless DC motor driving another brushless DC motor and the output of that one creates three phases", "start": 417.32, "duration": 6.64}, {"text": "[Mehdi's old video]", "start": 424.3, "duration": 1.66}, {"text": "There", "start": 426.25, "duration": 1.539}, {"text": "We have three-phase AC signal. Okay. Let's see if the motor turns. I control the drive with my function generator", "start": 427.789, "duration": 6.559}, {"text": "Nothing?", "start": 439.14, "duration": 0.72}, {"text": "Seems like there is no force on the rotor, maybe more speed?", "start": 442.36, "duration": 4.08}, {"text": "F**K!", "start": 451.24, "duration": 0.82}, {"text": "It doesn't work!", "start": 452.06, "duration": 1.28}, {"text": "I guess the problem is the rotor. You know, in real induction motors,", "start": 453.34, "duration": 3.2}, {"text": "There is something called a squirrel cage rotor that creates much more torque due to Eddy currents,", "start": 456.54, "duration": 5.32}, {"text": "compared to my solid copper", "start": 461.86, "duration": 1.58}, {"text": "You probably have seen my trusty AC fan, which is an induction motor", "start": 463.44, "duration": 3.9}, {"text": "See? The rotor looks like a cage", "start": 467.34, "duration": 1.36}, {"text": "These thicker areas are layers of laminated iron core that pass the magnetic field through but no eddy current is created through them", "start": 469.0, "duration": 7.26}, {"text": "but these thinner lines are", "start": 476.56, "duration": 2.0}, {"text": "shorted together and shorted on top and bottom with these metal pieces and eddy current is created through them that creates magnetic fields that helps", "start": 478.56, "duration": 7.96}, {"text": "the rotor turn.", "start": 486.52, "duration": 1.02}, {"text": "So I have to dismantle this and see if I can change my rotor into a cage", "start": 487.54, "duration": 4.9}, {"text": "But before that, I like to put some magnets on my rotor", "start": 492.72, "duration": 3.26}, {"text": "and see if the rotating magnetic fields actually exist and turn my rotor", "start": 495.98, "duration": 4.22}, {"text": "I have to make some super light and small rotor", "start": 500.38, "duration": 2.6}, {"text": "Dammit! With permanent magnets, I just turned it into a synchronous motor", "start": 503.16, "duration": 3.7}, {"text": "It doesn't work with straight up AC anymore. It just vibrates in place", "start": 507.18, "duration": 3.56}, {"text": "All you see is just some vibration.", "start": 511.82, "duration": 3.86}, {"text": "Whatever. Let's just make the cage", "start": 515.68, "duration": 2.0}, {"text": "Okay, I made some slots in this thing", "start": 521.58, "duration": 2.26}, {"text": "I don't know why they do them in an angle", "start": 523.84, "duration": 2.039}, {"text": "But I'm sure it has something to do with something that you can find in the comments down below", "start": 525.88, "duration": 3.72}, {"text": "Pssh.....", "start": 532.6, "duration": 0.6}, {"text": "Still, it's not turning at all. Maybe my wiring is wrong. Let me do a Y configuration. It's a bit simpler", "start": 533.2, "duration": 6.08}, {"text": "Okay. Y configuration and trying one more time", "start": 539.6, "duration": 2.64}, {"text": "Ahhh s**t!", "start": 545.58, "duration": 0.98}, {"text": "F**k!", "start": 548.12, "duration": 0.74}, {"text": "Well, I'm done with this s**t! Clearly, I can't make strong enough magnetic fields to make this garbage turn", "start": 549.2, "duration": 5.58}, {"text": "I mean, look at this tiny piece of copper. Just moving magnets beside it,", "start": 555.24, "duration": 5.3}, {"text": "I can easily move it", "start": 560.54, "duration": 1.16}, {"text": "I can't make any higher voltage AC out of this thing, and I don't have any more wire to make my winding thicker", "start": 561.85, "duration": 5.82}, {"text": "So I'm doomed", "start": 567.67, "duration": 1.48}, {"text": "but at the same time, I thought of something. If instead of my squirrel cage, I put my magnet rotor in there,", "start": 569.15, "duration": 6.83}, {"text": "I should be able to drive it like a brushless DC motor using this ECU", "start": 576.32, "duration": 3.92}, {"text": "Let's try this rotor. One magnet on each side.", "start": 580.4, "duration": 3.0}, {"text": "Ready?", "start": 583.4, "duration": 0.64}, {"text": "AH! HAHA!", "start": 587.34, "duration": 0.92}, {"text": "Look at that! It's turning", "start": 588.52, "duration": 1.68}, {"text": "Finally, something is turning!", "start": 590.72, "duration": 2.0}, {"text": "I made a brushless DC motor which is basically the same as an AC motor", "start": 593.26, "duration": 4.22}, {"text": "Ahhh... Tesla would be somewhat proud...", "start": 598.24, "duration": 2.6}, {"text": "And now I'm thinking, maybe the ECU can drive my induction rotor", "start": 601.44, "duration": 4.62}, {"text": "Okay, let's try it.", "start": 606.1, "duration": 1.22}, {"text": "Oh, look at that!", "start": 608.74, "duration": 1.14}, {"text": "AH! HAHA!", "start": 610.8, "duration": 1.08}, {"text": "I got some movement out of it", "start": 612.6, "duration": 1.38}, {"text": "Of course, the ECU is not designed to drive the induction motor, but hey", "start": 615.17, "duration": 4.459}, {"text": "It's moving a little bit. HAHAHA!", "start": 621.17, "duration": 2.0}, {"text": "So the magnetic fields are not strong enough for this, but I should be able to run it using my strong magnets", "start": 623.3, "duration": 5.989}, {"text": "See, this is how it should have turned", "start": 632.36, "duration": 2.62}, {"text": "Hmm...", "start": 635.82, "duration": 0.5}, {"text": "So the results are kind of disappointing", "start": 636.32, "duration": 2.24}, {"text": "I posted a short update video for my patrons at patreon.com", "start": 638.7, "duration": 3.72}, {"text": "and told them how the motor is not working, and I received tons of smart ideas,", "start": 642.42, "duration": 4.2}, {"text": "beside the one that said turn it on and off or call the IT department. For example,", "start": 647.0, "duration": 4.28}, {"text": "Increase the voltage to increase the current or run at lower frequency or increase the number of electromagnets", "start": 651.52, "duration": 6.22}, {"text": "All good ideas, but I couldn't implement.", "start": 657.94, "duration": 2.56}, {"text": "Increasing the number of electromagnets is something that's very commonly used", "start": 660.6, "duration": 3.5}, {"text": "For example, if I add another set of three-phase windings and run them from the same AC input,", "start": 664.4, "duration": 5.48}, {"text": "instead of one pair of rotating magnetic fields,", "start": 670.16, "duration": 2.9}, {"text": "I'll have two, like this. This creates higher Eddy current and more torque", "start": 673.06, "duration": 4.139}, {"text": "But it also draws double the current from the input. My problem is my AC source, which is this stupid little generator", "start": 677.2, "duration": 7.6}, {"text": "Initially, I need high currents to create strong magnetic fields and high torque", "start": 685.24, "duration": 4.08}, {"text": "Which this can't provide at low frequencies because the slower it turns, the lower the output", "start": 689.48, "duration": 5.149}, {"text": "but if I increase the generator speed, although the output voltage increases, so does the frequency.", "start": 694.629, "duration": 5.851}, {"text": "And you know that the impedance of an inductor is proportional to the frequency", "start": 700.48, "duration": 4.62}, {"text": "So although the voltage is higher, the current doesn't change much because the impedance is higher", "start": 705.24, "duration": 4.36}, {"text": "I need an AC source that can provide a lot of current at low frequencies", "start": 709.6, "duration": 4.14}, {"text": "So I guess I'll have to go and try and design a strong three-phase generator and then I can talk about more details", "start": 713.99, "duration": 5.63}, {"text": "In the meantime,", "start": 720.2, "duration": 0.86}, {"text": "you can entertain yourselves using your 31-day free full access and watch some quality", "start": 721.06, "duration": 5.56}, {"text": "documentaries at curiositystream.com/electroboom", "start": 726.62, "duration": 3.98}, {"text": "using promo code \"ElectroBOOM\" at checkout, after which the subscription is only $2.99 a month", "start": 730.6, "duration": 5.08}, {"text": "CuriosityStream is founded by the same guy who founded Discovery Channel, with original content", "start": 736.08, "duration": 5.44}, {"text": "featuring very well-known faces in science, technology,", "start": 741.9, "duration": 3.76}, {"text": "nature, history and more, available worldwide", "start": 745.68, "duration": 2.5}, {"text": "I was just browsing through some of their programs and suddenly, BAM! my pal, Derek from Veritasium and he's got", "start": 748.84, "duration": 6.42}, {"text": "97% thumbs up too. I should watch this", "start": 755.26, "duration": 2.7}, {"text": "My kids grow so fast", "start": 758.87, "duration": 2.0}, {"text": "[Outro]", "start": 760.87, "duration": 2.0}]