[{"text": "Sponsored by Squarespace. Whether you need a domain, website, or online store, make your next move with Squarespace.", "start": 0.479, "duration": 5.75}, {"text": "because getting an introvert to return your feelings can sometimes", "start": 17.4, "duration": 2.509}, {"text": "feel impossible. Guy: \"Return my feelings? I just want to get her to return my phone calls! *angry*", "start": 20.28, "duration": 5.599}, {"text": "So first things first", "start": 25.88, "duration": 1.96}, {"text": "We need to determine if you're actually crushing on an introvert and I have a joke that will help you figure it out", "start": 27.84, "duration": 5.479}, {"text": "Here's the joke:", "start": 33.51, "duration": 1.49}, {"text": "Answer: they already told you like five times. Yes, that's right,", "start": 38.2, "duration": 4.78}, {"text": "I'm declaring it here and now, introverts are the new vegans. Except there's even less meat in the conversation *audience booing*", "start": 42.98, "duration": 6.92}, {"text": "No shade intended, okay? I mean what's not to love about the introverts?", "start": 50.04, "duration": 3.829}, {"text": "There are so many pros to having an introvert as a significant other.", "start": 53.87, "duration": 3.479}, {"text": "They don't spend much money because they rarely leave the house. Cashier: \"All right, will this be cash check or charge?\"", "start": 57.35, "duration": 7.15}, {"text": "Introvert: \"Charge, charge, no, no, no recharge! I need to recharge. I gotta get out of here!\"", "start": 65.039, "duration": 3.86}, {"text": "They're low maintenance and there's very low chance that they will ever cheat on you", "start": 69.24, "duration": 5.659}, {"text": "Guy: \"Hey, hey, good lookin' you want to get some coffee later? Just as friends of course.\" Introvert: \"Are you kidding me?!?", "start": 74.939, "duration": 5.569}, {"text": "I can barely keep up with one relationship. I mean you're cute or whatever, but that sounds like a nightmare.\"", "start": 80.509, "duration": 5.19}, {"text": "So if you would like to have your very own", "start": 85.92, "duration": 2.779}, {"text": "introvert to have and to hold for as long as you both shall binge watch, here are four things to keep in mind when", "start": 88.859, "duration": 6.02}, {"text": "trying to woo an introvert. Number one:", "start": 94.95, "duration": 2.05}, {"text": "Very occasionally an introvert will share their feelings with you and you have to be ready!", "start": 99.0, "duration": 5.299}, {"text": "Introvert: \"I think it all started when I was six.\" *gasps* \"Really?", "start": 106.799, "duration": 3.979}, {"text": "Guy: \"Go on.\"", "start": 113.999, "duration": 1.001}, {"text": "There's no rhyme or reason to it but", "start": 115.0, "duration": 2.0}, {"text": "As the introvert feels more and more safe with you, they'll begin to, you know,", "start": 117.079, "duration": 4.98}, {"text": "open up. If you do not listen even just once,", "start": 122.06, "duration": 3.24}, {"text": "fare thee well, my friend. Introvert: \"I think it started when I was six.\"", "start": 127.02, "duration": 3.169}, {"text": "Guy: \"I think it started when I blew shelled Luigi! Victory feels so sweet!\"", "start": 130.229, "duration": 5.81}, {"text": "Number two:", "start": 137.59, "duration": 0.5}, {"text": "Just as important as listening to what they say when they talk to you is", "start": 140.0, "duration": 3.39}, {"text": "listening to what they're saying when they're not talking to you. Introverts just need their space and honestly the more understanding", "start": 143.73, "duration": 7.43}, {"text": "you are of this the more likely it is that, you know, they will include you in their quiet times. That's", "start": 151.56, "duration": 5.0}, {"text": "It's a paradox.", "start": 157.23, "duration": 1.27}, {"text": "Guy: \"Hey, do you wanna hang out tonight?\"", "start": 158.5, "duration": 2.5}, {"text": "Introvert: \"Oh, I don't know, I kind of have a lot of things on my to-do list.\" *sad music* Guy: \"Okay\"", "start": 161.23, "duration": 5.97}, {"text": "Guy: \"Hey, I heard you mention that you had a big to-do list today.", "start": 168.21, "duration": 2.269}, {"text": "I hope you can get it all done. If you want to hang out when it's over, let me know.\"", "start": 170.48, "duration": 3.75}, {"text": "Introvert: \"Oh, wow, that's so thoughtful. If you want you can tag along today.\"", "start": 174.23, "duration": 3.479}, {"text": "Guy: \"I did it!\"", "start": 178.3, "duration": 1.2}, {"text": "Number three: good surprises vs. bad surprises. Good surprise:", "start": 179.5, "duration": 4.39}, {"text": "Guy: \"Surprise! I bought you a book I thought you would like.\" Introvert: \"Oh, thank you! Now I can go read this alone!\"", "start": 184.56, "duration": 4.34}, {"text": "Guy: \"That was the point!\"", "start": 189.15, "duration": 1.35}, {"text": "Bad surprise:", "start": 190.6, "duration": 1.9}, {"text": "Guy and people: \"Surprise!\"", "start": 192.989, "duration": 1.711}, {"text": "Introvert: \"Oh, you threw me a surprise party.\"", "start": 194.7, "duration": 2.179}, {"text": "Guy: \"Yeah, I wanted to show you how I feel about you.\"", "start": 197.67, "duration": 3.259}, {"text": "Introvert: \"Noted.\"", "start": 201.81, "duration": 0.5}, {"text": "Good surprises give the introverts space to think", "start": 204.15, "duration": 3.35}, {"text": "and rest. Bad surprises my friend puts the introvert on the spot", "start": 207.75, "duration": 4.73}, {"text": "Okay, but here's the most important one, guys, number four: make them feel understood.", "start": 212.48, "duration": 5.609}, {"text": "Introverts", "start": 218.61, "duration": 1.29}, {"text": "they worry very often that they're a burden or that they're weird or that they're getting in the way. So they don't know how", "start": 219.9, "duration": 6.9}, {"text": "to express how they want to be loved because they don't want to be annoying.", "start": 227.0, "duration": 3.779}, {"text": "But if you go that extra mile and you let the introvert in your life know that you actually care enough to figure out", "start": 230.78, "duration": 6.239}, {"text": "what makes them tick--look I don't want to be hyperbolic but at that point, can you go ahead and start planning the wedding? Yes. *bridal chorus*", "start": 237.42, "duration": 8.58}, {"text": "If you can make an introvert feel understood and respected,", "start": 246.0, "duration": 4.399}, {"text": "then they shall fall in love with you. Happily ever after. And this video solved everything. You're welcome.", "start": 251.58, "duration": 6.11}, {"text": "Stay tuned for bloopers. Whether you are an introvert or an extrovert or somewhere in between", "start": 261.209, "duration": 5.57}, {"text": "We all have projects we're working on that need a permanent space on the web", "start": 267.41, "duration": 3.569}, {"text": "And I know building a website can feel daunting or stressful or even impossible, but I have good news", "start": 270.979, "duration": 6.06}, {"text": "Thanks to our friends at Squarespace. Now, It's super easy. They have professional", "start": 277.229, "duration": 4.07}, {"text": "award-winning templates to help get you started. And you do not have to know how to code or anything like that to publish your site", "start": 281.91, "duration": 5.479}, {"text": "Plus you don't have to worry about updates or patches. Once your site is up and running. You're good to go", "start": 287.389, "duration": 5.22}, {"text": "just use their tools to easily create your site whether you want to set up a shop, show off your", "start": 292.61, "duration": 4.619}, {"text": "Creations, or just have your own space on the internet,", "start": 297.419, "duration": 2.36}, {"text": "Squarespace has a design that will work great for you. And you can also set up a custom domain really easily as well", "start": 299.93, "duration": 6.089}, {"text": "So if you have a project that needs a website, it's time to make your next move", "start": 306.02, "duration": 3.45}, {"text": "Do what we did and head over to squarespace.com/cow", "start": 309.51, "duration": 3.99}, {"text": "to get started and use that link because if you do, you're gonna get 10% off your first purchase. That's squarespace.com", "start": 313.5, "duration": 4.97}, {"text": "/cow", "start": 319.32, "duration": 0.98}, {"text": "Oh, hey, I heard you mentioned earlier that you have it to do list for today. I hope you get it all done", "start": 324.67, "duration": 4.74}, {"text": "And if you want to hang out after it's over", "start": 329.41, "duration": 2.279}, {"text": "Guy: \"Hope you get it all done.\" Kelli: \"You sound like a--preacher.\"", "start": 333.38, "duration": 2.92}, {"text": "\"Hope you get it all done.\" Guy: \"Hey, I heard you mentioned earlier that you had a big to-do list for today, well,\"", "start": 336.59, "duration": 6.29}, {"text": "People: \"Surprise!\" Kelli: \"My voice cracked.\"", "start": 346.8, "duration": 3.0}, {"text": "Introvert: \"I mean you're super cute, but that sounds like--a nightmare\"", "start": 351.59, "duration": 2.239}]