[{"text": "There are two types of Linus Tech Tips viewers:", "start": 0.0, "duration": 2.61}, {"text": "The ones who can't remember trackball mice, and... the ones who are old...", "start": 3.18, "duration": 4.7}, {"text": "...like me.", "start": 8.38, "duration": 1.94}, {"text": "That's right, kids! In the late 90s, these bizarre", "start": 10.32, "duration": 4.96}, {"text": "pointing devices were almost as popular as a", "start": 15.28, "duration": 3.32}, {"text": "standard ball mouse—y'know,", "start": 18.74, "duration": 3.66}, {"text": "the kind that... had its balls down below,", "start": 22.4, "duration": 2.74}, {"text": "But then fell into obscurity as optical and laser mice gained dominance.", "start": 25.74, "duration": 4.7}, {"text": "But are trackballs", "start": 30.94, "duration": 2.0}, {"text": "bouncing back? Well, Logitech... err...", "start": 33.04, "duration": 3.34}, {"text": "...Lo-Logi? Logitech... is giving it a shot.", "start": 36.56, "duration": 3.86}, {"text": "Meet the MX Ergo, their first trackball in nearly a decade.", "start": 40.42, "duration": 6.26}, {"text": "And the video is brought to you by... TunnelBear,", "start": 47.2, "duration": 3.12}, {"text": "which makes it easy to privately and securely browse a more open Internet. To try TunnelBear for free, go to tunnelbear.com/ltt.", "start": 50.32, "duration": 8.08}, {"text": "♪ [Intro] Song: Lazlo Supernova ♪", "start": 58.78, "duration": 8.48}, {"text": "At 260 grams (9.17 Ounces), the Ergo is twice as heavy as your typical mouse.", "start": 67.86, "duration": 6.66}, {"text": "But... that's fine. Like other trackballs, it is not used by...", "start": 74.98, "duration": 6.08}, {"text": "sliding it around the desktop.", "start": 81.34, "duration": 2.0}, {"text": "Instead, you actually move the pointer by spinning this optically-tracked ball with your right thumb.", "start": 83.5, "duration": 7.14}, {"text": "The Ergo is beautifully designed; the soft touch rubber finish that covers the entire", "start": 91.18, "duration": 5.6}, {"text": "top of the mouse gives it a premium look. And... as for the feel;", "start": 96.78, "duration": 4.98}, {"text": "well, it can leave your hand a little hotter than you might be used to, but", "start": 101.98, "duration": 3.66}, {"text": "we're inclined to overlook this, because with the base set to its upright position,", "start": 106.0, "duration": 4.579}, {"text": "reducing pronation or scissoring of the arm bones, it positions the user's hand similarly to a vertical mouse.", "start": 111.7, "duration": 8.0}, {"text": "It is extremely comfortable. I guess that's probably where the name comes from.", "start": 120.369, "duration": 3.74}, {"text": "With that said, what's good for the wrist isn't always good for the thumb.", "start": 124.78, "duration": 5.209}, {"text": "Moving the cursor, especially a long distance downward, feels kinda like doing... thumb crunches... unless you reposition your hand.", "start": 130.54, "duration": 7.12}, {"text": "Let's take a look at the buttons. The left and right clicks are rated for 10 million and are otherwise...", "start": 138.48, "duration": 5.98}, {"text": "pretty darn standard. These back and forward buttons are both easily accessible with your index finger,", "start": 144.46, "duration": 6.68}, {"text": "as long as you don't have child-sized hands like I do, and the scroll wheel is rubberized,", "start": 151.14, "duration": 4.74}, {"text": "moves smoothly, and it comfortably tilts to either side.", "start": 156.04, "duration": 4.94}, {"text": "Now, we've got a couple of more interesting buttons. This one toggles precision mode, which, like a sniper button on a mouse,", "start": 161.7, "duration": 8.08}, {"text": "shifts the sensitivity for precision pointing, and this one is a Logitech easy switch, so that you can switch easily—", "start": 170.04, "duration": 8.46}, {"text": "—haha, I see what you guys did there—between devices, with one of them using the included 2.4 GHz dongle,", "start": 178.8, "duration": 6.72}, {"text": "and another one connected via Bluetooth.", "start": 185.76, "duration": 2.82}, {"text": "And you might actually find yourself doing just that.", "start": 188.58, "duration": 2.82}, {"text": "Trackballs are great for travel, because they require very little area to use.", "start": 191.68, "duration": 5.48}, {"text": "Air-go and airplane tray table or armrest", "start": 197.56, "duration": 3.4}, {"text": "will actually work nicely for much more comfortable mousing compared to trying to use a touchpad.", "start": 200.96, "duration": 5.88}, {"text": "And thanks to the Ergo's four-month battery, you won't even need a charging cable with you.", "start": 207.1, "duration": 6.44}, {"text": "Fun fact though: If it does die, it boasts a full workday's worth of battery after just one minute of charging.", "start": 213.62, "duration": 7.32}, {"text": "\"Okay then, Linus, that's all well and good, but what is it like to actually use it?\"", "start": 221.88, "duration": 7.12}, {"text": "Well, if you've never used a trackball before, you might actually be surprised at how easy it is to convert.", "start": 229.44, "duration": 6.64}, {"text": "Our writer James went into this thing with zero experience, and after a few days, reported it's... become second nature.", "start": 236.38, "duration": 8.54}, {"text": "And some actions, like middle-click scrolling, are actually even easier with a trackball.", "start": 244.92, "duration": 5.96}, {"text": "With that said, it's not like there wasn't a slight learning curve,", "start": 251.32, "duration": 4.14}, {"text": "and it has some clear disadvantages. If you use a multi-display setup or an ultra-wide monitor for example,", "start": 255.48, "duration": 7.32}, {"text": "you might find yourself having to crank the sensitivity just to cover all of that desktop real estate.", "start": 262.8, "duration": 6.28}, {"text": "And while \"Okay, that's true of any mouse,\"", "start": 269.8, "duration": 3.24}, {"text": "on the trackball in particular, this really made accurate pointing on fine things a feat of concentration, since it does tend to...", "start": 273.04, "duration": 8.72}, {"text": "jump a bit when being turned very small amounts. The solution, as it turns out though, is to turn on mouse acceleration, which uhh...", "start": 282.3, "duration": 8.48}, {"text": "...how about that? It turns out that setting does have an actual use.", "start": 291.44, "duration": 3.82}, {"text": "Though you will want to disable it while you're gaming on your trackball.", "start": 295.5, "duration": 4.54}, {"text": "Wait, gaming on a trackball?", "start": 301.18, "duration": 3.14}, {"text": "Yes, that's right. You can use a trackball for gaming.", "start": 304.33, "duration": 3.74}, {"text": "And it actually doesn't suck either.", "start": 308.07, "duration": 2.729}, {"text": "Our resident CS:GO guru Ed was actually up and pwning noobs in no time,", "start": 311.22, "duration": 5.94}, {"text": "though he did say that he was a little disappointed in the Ergo's tracking speed, which may prove to be insufficient for players who like to", "start": 317.16, "duration": 6.86}, {"text": "whip their mouse for quick turnarounds.", "start": 324.24, "duration": 2.42}, {"text": "\"Okay then, Linus, I'm interested. You got me. But why should I buy it then?\"", "start": 327.02, "duration": 5.64}, {"text": "\"The $100 MX Ergo over Logitech's own competing wireless trackball, the M570?\"", "start": 332.78, "duration": 5.78}, {"text": "\"Is the precision button, easy switch, and the smoother ball action", "start": 339.48, "duration": 4.42}, {"text": "really worth the extra $50?\"", "start": 344.64, "duration": 2.0}, {"text": "Maybe not.", "start": 347.4, "duration": 1.35}, {"text": "But they are nice to have, and the 20° tilt really is a lot more comfortable.", "start": 348.75, "duration": 6.17}, {"text": "And surely, there is no solution that exists to prop up the M570.", "start": 355.3, "duration": 4.96}, {"text": "Okay, but in all seriousness though, does the MX Ergo belong in your future?", "start": 361.22, "duration": 4.56}, {"text": "Well, there is still room to improve. A stepless scrolling mode on the wheel,", "start": 365.78, "duration": 4.14}, {"text": "a low-latency lightspeed connection,", "start": 370.28, "duration": 2.36}, {"text": "higher endurance switches, and the dedicated DPI switch would all go a long way towards making this feel like a true", "start": 372.64, "duration": 7.24}, {"text": "flagship. Maybe a, a G-series trackball is on the horizon", "start": 379.88, "duration": 3.7}, {"text": "But with that said, it's really good. If you're a trackballer, it's easy to recommend.", "start": 384.0, "duration": 6.78}, {"text": "As for if you're not; well, it is the kind of thing you do have to experience on your own, but...", "start": 391.38, "duration": 6.95}, {"text": "Logitech has a 30-day return policy, so...", "start": 399.12, "duration": 3.32}, {"text": "...if you're a little ball-curious, then there's nothing to lose from...", "start": 403.26, "duration": 4.32}, {"text": "...giving it a spin.", "start": 408.14, "duration": 2.0}, {"text": "Speaking of giving something a try, thanks to Crunchyroll for sponsoring today's video!", "start": 411.42, "duration": 5.68}, {"text": "Crunchyroll is the site created by anime fans for anime fans,", "start": 417.1, "duration": 4.34}, {"text": "and we have got a great offer for you! You guys can get 30 days of Crunchyroll Premium", "start": 421.44, "duration": 6.68}, {"text": "for nothing, by signing up at our link in the description.", "start": 428.12, "duration": 3.74}, {"text": "That'll give you the most current episodes of new shows straight from Japan,", "start": 431.86, "duration": 3.64}, {"text": "like Knight's and Magic and My Hero Academia season 2, with all the content on the site professionally subtitled.", "start": 435.5, "duration": 7.76}, {"text": "Coming out in October are Food Wars season 3 and Black Clover,", "start": 443.26, "duration": 4.54}, {"text": "and if you enjoy the many benefits of premium,", "start": 447.8, "duration": 2.84}, {"text": "like 1080p streaming, getting new episodes of shows straight from Japan within an hour of their premiere, and being able to stream anytime, anywhere,", "start": 450.64, "duration": 8.14}, {"text": "from a variety of devices like your phone, tablet", "start": 458.78, "duration": 2.19}, {"text": "or game console, you can sign up for Crunchyroll Premium for only $6.95 a month.", "start": 460.97, "duration": 4.93}, {"text": "So head over to crunchyroll.com/linus and sign up today.", "start": 465.9, "duration": 3.7}, {"text": "So thanks for watching, guys! If this video sucked, you know what to do,", "start": 471.16, "duration": 2.56}, {"text": "but if it was awesome, get subscribed, hit that like button", "start": 473.72, "duration": 1.96}, {"text": "or check out the link to where to buy the stuff we featured in the video description.", "start": 475.68, "duration": 4.82}, {"text": "Also down there is a link to our merch store, which has cool shirts like this one as well as...", "start": 480.5, "duration": 3.119}, {"text": "D E N    U    T R A I N !", "start": 484.8, "duration": 2.0}, {"text": "...our community forum, which you should totally join.", "start": 487.46, "duration": 2.62}]