[{"text": "Here's a mini theory to start things off.", "start": 0.08, "duration": 1.54}, {"text": "Endermites. What are they?", "start": 1.78, "duration": 1.7}, {"text": "They're the smallest hostile mob in the game,", "start": 3.48, "duration": 1.9}, {"text": "and they're one of the very few creatures in the game to possess the moniker of \"Ender\"", "start": 5.38, "duration": 0.5}, {"text": "But to me, the weirdest detail about them is that they don't get along with the Enderman.", "start": 5.88, "duration": 7.7}, {"text": "When confronted with each other, they just attack.", "start": 13.58, "duration": 2.86}, {"text": "It's a strange little detail to include, since so many of the other spawns in the End", "start": 16.44, "duration": 3.56}, {"text": "aren't hostile towards one another.", "start": 20.0, "duration": 1.56}, {"text": "But now, consider this:", "start": 21.56, "duration": 1.7}, {"text": "What if Endermites are actually silverfish, the obnoxious, little grey bugs that bother you up in the overworld?", "start": 23.26, "duration": 6.92}, {"text": "What if Endermites are just silverfish who went through an End portal?", "start": 30.18, "duration": 3.12}, {"text": "Or ate themselves a bunch of chorus fruit when they were out there in the End, or whatever?", "start": 33.3, "duration": 3.68}, {"text": "The proof here is actually surprisingly substantial.", "start": 36.98, "duration": 2.78}, {"text": "Cue up the checklist!", "start": 39.76, "duration": 1.34}, {"text": "Point Number One: Both Endermites and silverfish are small.", "start": 41.1, "duration": 2.6}, {"text": "In fact, they're both so small that they'll suffocate to death in the sinking depths of soul sand.", "start": 43.7, "duration": 4.92}, {"text": "They're the only two hostile mobs where this sort of thing happens.", "start": 48.62, "duration": 3.06}, {"text": "Speaking of their size, not only are they both small, technically speaking they're exactly the same size.", "start": 51.68, "duration": 6.1}, {"text": "According to Minecraft Gamepedia, both creatures are 0.3 blocks tall and 0.4 blocks wide.", "start": 57.78, "duration": 6.8}, {"text": "In fact, they're so similar that an early design of the Endermites was that just of silverfish.", "start": 64.58, "duration": 5.7}, {"text": "We see it right here on screen right now.", "start": 70.28, "duration": 1.8}, {"text": "The design was eventually changed during Java edition 1.8,", "start": 72.08, "duration": 3.28}, {"text": "but for a while there, the two looked almost identical", "start": 75.36, "duration": 3.78}, {"text": "Now, I know what you're thinking!", "start": 79.14, "duration": 0.96}, {"text": "That just means that they're recolored assets. It doesn't necessarily make them the same creature", "start": 80.1, "duration": 4.6}, {"text": "But think again", "start": 84.7, "duration": 0.92}, {"text": "To understand exactly why, we need to look at the enchantment, Bane of Arthropods", "start": 85.62, "duration": 4.28}, {"text": "If I'm being honest, Bane of Arthropods is pretty lame as far as enchantments go", "start": 89.9, "duration": 4.04}, {"text": "Sure, it increases your attack damage", "start": 93.94, "duration": 1.76}, {"text": "But it only works when fighting against one of four very specific mobs in the game", "start": 95.7, "duration": 4.86}, {"text": "And two of those mobs are spiders. So, 50% are supposedly diverse creatures in this universe", "start": 100.56, "duration": 5.6}, {"text": "And those two happen to be silverfish and Endermites", "start": 106.16, "duration": 3.42}, {"text": "Meaning that at the very least, they're in the same taxonomic phylum", "start": 109.58, "duration": 3.76}, {"text": "AP biology, what what!", "start": 113.34, "duration": 1.7}, {"text": "But here's the kicker", "start": 115.04, "duration": 1.32}, {"text": "The only way to get to the End is through portals that are hidden in strongholds deep underground, right?", "start": 116.36, "duration": 4.78}, {"text": "No big surprise there", "start": 121.14, "duration": 1.58}, {"text": "But look into how strongholds were generated, and you notice something interesting", "start": 122.72, "duration": 4.4}, {"text": "They always have to have a portal room", "start": 127.12, "duration": 3.08}, {"text": "That makes sense since they are the primary place that you find a portal to the endgame", "start": 130.2, "duration": 3.42}, {"text": "But the two features required of that portal room, obviously the portal, but also a silverfish spawner", "start": 133.62, "duration": 7.64}, {"text": "Ladies and gentlemen, I don't know about you, but this, to me, reads like the criminal's returning to the scene of the crime", "start": 141.26, "duration": 4.8}, {"text": "So, why don't Endermen and Endermites get along?", "start": 146.06, "duration": 2.82}, {"text": "Well, if my last theory was correct about Endermen being an ancient race of builders", "start": 148.88, "duration": 3.44}, {"text": "Then one of their old foes would've been the silverfish", "start": 152.32, "duration": 2.9}, {"text": "Silverfish, who are in the perfect position to leap through End portals at the same time as these ancient builders", "start": 155.22, "duration": 4.76}, {"text": "And so now, hundreds of generations and one End portal later, that battle is still being waged", "start": 159.98, "duration": 6.02}, {"text": "New names, new faces, but the same old enemies", "start": 166.0, "duration": 3.48}, {"text": "But hey, that's just a theory...", "start": 169.88, "duration": 3.3}, {"text": "A mini theory", "start": 173.18, "duration": 1.08}, {"text": "And I'm just getting started", "start": 174.26, "duration": 1.68}, {"text": "Hello, Internet!", "start": 179.46, "duration": 1.1}, {"text": "Welcome to Game Theory", "start": 180.56, "duration": 2.3}, {"text": "The show that, yes, does indeed still talk about games", "start": 182.86, "duration": 3.76}, {"text": "And not just why platforms need to respect their smaller creators", "start": 186.62, "duration": 3.42}, {"text": "Or why claiming video games causing violence is shortsighted", "start": 190.04, "duration": 3.0}, {"text": "The reason I call out both those episodes, by the way, is that both of them underperformed, one even got itself demonetized", "start": 193.04, "duration": 5.7}, {"text": "But there, in my honest opinion, two of the most important episodes that we've ever done on the channel", "start": 198.74, "duration": 4.54}, {"text": "So, if you happened to miss either one of those, which, there's a high likelihood that you did", "start": 203.28, "duration": 3.7}, {"text": "Please give them a watch after this video", "start": 206.98, "duration": 1.42}, {"text": "Link is at the upper right corner of screen, that little i-card", "start": 208.4, "duration": 3.64}, {"text": "Put that YouTube feature to use", "start": 212.04, "duration": 1.62}, {"text": "But today, we're not talking about those episodes", "start": 213.66, "duration": 1.9}, {"text": "Instead, I'm looking to build on another theory", "start": 215.56, "duration": 2.82}, {"text": "One that you all seemed to like, one that started us down the path towards deciphering the hidden lore of Minecraft", "start": 218.38, "duration": 6.18}, {"text": "Because there is lore here", "start": 224.56, "duration": 2.0}, {"text": "It's not all giant, golden wang monuments in the distance", "start": 226.56, "duration": 3.3}, {"text": "But unlike most games, Minecraft's lore isn't told through dialogue and cutscenes", "start": 229.86, "duration": 4.52}, {"text": "Instead, it's communicated through subtle design choices:", "start": 234.38, "duration": 3.16}, {"text": "Spawn conditions, character designs, achievement names, hostile versus friendly behavioral patterns", "start": 237.54, "duration": 5.88}, {"text": "And all of that will be important today as we explore the secrets of the wither", "start": 243.42, "duration": 4.56}, {"text": "Because last time, we looked at the End of the Minecraft story", "start": 247.98, "duration": 3.44}, {"text": "Today, we're talking about how it all began", "start": 251.42, "duration": 2.3}, {"text": "So, in case you missed it or just forgot", "start": 253.72, "duration": 2.3}, {"text": "During my last major Minecraft theory, we tallied up the evidence suggesting that the Endermen are actually an evolved form of an ancient race of builders", "start": 256.02, "duration": 7.76}, {"text": "They speak English", "start": 263.78, "duration": 0.9}, {"text": "*Enderman speaking*", "start": 264.68, "duration": 0.7}, {"text": "They're able to hold rudimentary blocks", "start": 265.38, "duration": 1.56}, {"text": "It would explain why strongholds are called \"strongholds\" in the first place", "start": 266.94, "duration": 3.02}, {"text": "And why mysterious structures like underwater monuments and old mineshafts are left abandoned, dotted all over the place", "start": 269.96, "duration": 4.68}, {"text": "Dotted all over the place, when no other living creature in this universe has neither the ability to mine nor craft", "start": 274.64, "duration": 6.84}, {"text": "The theory also explains the origins of End cities, why they contain abandoned chests full of supplies totally inappropriate for life in that hostile, purple environment", "start": 281.48, "duration": 8.0}, {"text": "There's obviously a lot more, but you should just watch that theory if you're interested", "start": 289.48, "duration": 3.54}, {"text": "Link is in the diddley doo", "start": 293.02, "duration": 1.32}, {"text": "Anyway, one key element that I was speculating about in that theory was what motivated this ancient race of people to wind up in the End in the first place", "start": 295.46, "duration": 7.42}, {"text": "They seemed like they were fleeing to it, but why?", "start": 302.88, "duration": 2.7}, {"text": "Curiosity? An accident?", "start": 305.58, "duration": 1.88}, {"text": "I ultimately conclude that it was to escape something, some big threat that existed out there in the overworld", "start": 307.46, "duration": 6.08}, {"text": "Now, obviously the world is populated with zombies and creepers and skeletons", "start": 313.54, "duration": 4.76}, {"text": "But that doesn't seem like enough to warrant building out a massive underground fortress, deep down near the bedrock", "start": 318.3, "duration": 6.24}, {"text": "Now, after doing the research, it's my belief that these ancient builders accidentally summoned the wither", "start": 324.54, "duration": 6.28}, {"text": "Which proceeded, then, to decimate where there's established society, killing them off by the hundreds", "start": 330.82, "duration": 5.52}, {"text": "Until they somehow managed to flee to the End and escape", "start": 336.34, "duration": 3.54}, {"text": "Now, why would I say this?", "start": 339.88, "duration": 1.16}, {"text": "Well first and foremost, let's look at the achievement list, shall we?", "start": 341.04, "duration": 2.9}, {"text": "When we defeat the Ender dragon, we get ourselves \"The End.\" achievement, and that makes a lot of sense, right?", "start": 343.94, "duration": 5.2}, {"text": "It's the quote-enquote \"final boss\" of the game after all", "start": 349.14, "duration": 2.62}, {"text": "It cues the end credits, you're literally in a place called \"The End,\" and it's an achievement name that totally works", "start": 351.76, "duration": 5.48}, {"text": "But for summoning the wither, you actually get the exact opposite", "start": 357.24, "duration": 3.56}, {"text": "\"The Beginning?\"", "start": 360.8, "duration": 1.1}, {"text": "With a question mark", "start": 361.9, "duration": 0.74}, {"text": "And then after its defeat, you get yourself \"The Beginning.\" again", "start": 362.64, "duration": 3.46}, {"text": "But this time, it's with a period", "start": 366.1, "duration": 2.08}, {"text": "It's a definitive statement that directly parallels how the Ender dragon achievements are handled, but with one problem", "start": 368.18, "duration": 5.8}, {"text": "The wither can be summoned at any time, and it very often happens after the dragon has been killed", "start": 373.98, "duration": 4.94}, {"text": "It's not really the beginning of anything in this game", "start": 378.92, "duration": 3.74}, {"text": "I was tempted to think that maybe it's the beginning of a new adventure post-Ender dragon", "start": 382.66, "duration": 3.62}, {"text": "But again, that doesn't seem like a whole lot of sense since summoning and defeating the wither is completely optional in the story", "start": 386.28, "duration": 5.82}, {"text": "And, if and when you do do it, nothing much comes of it really", "start": 392.1, "duration": 3.8}, {"text": "It gives you a Nether star, which, for as special and unique as that item is, just allows you to build a beacon that shoots lame buffs into the surrounding area", "start": 395.9, "duration": 7.96}, {"text": "It's not all that cool or all that meaningful", "start": 403.86, "duration": 2.72}, {"text": "But what if, WHAT IF, the wither was the beginning in a different way", "start": 406.58, "duration": 4.84}, {"text": "What if it's the beginning of the story for the ancient builders that started all this in motion in the first place", "start": 411.42, "duration": 5.64}, {"text": "Look for a minute at the strongholds", "start": 417.06, "duration": 1.48}, {"text": "They're buried super deep underground, like absurdly deep, and with literally no trace of their existence on the surface", "start": 418.54, "duration": 7.38}, {"text": "They're like bomb shelters, safety bunkers", "start": 425.92, "duration": 2.56}, {"text": "But they're defending against what? Zombies? Creepers?", "start": 428.48, "duration": 3.94}, {"text": "I don't think so", "start": 432.42, "duration": 1.0}, {"text": "You don't go to that extreme just to defend against a regular mob", "start": 433.42, "duration": 3.3}, {"text": "But a fearsome creature like the wither that spreads death and decay to anything in its sights?", "start": 436.72, "duration": 4.66}, {"text": "Absolutely", "start": 441.38, "duration": 1.28}, {"text": "Especially since we know the wither flies, and also destroys any block that it touches", "start": 442.66, "duration": 5.34}, {"text": "You're best way to avoid a creature like this is going to be by digging down far below where it can reasonably follow", "start": 448.0, "duration": 6.42}, {"text": "Exactly what we find with the stronghold placement", "start": 454.42, "duration": 3.56}, {"text": "In fact, it would explain why the only remaining structures from these ancient builders on the surface of the overworld are underwater monuments, underground mineshafts, and secluded desert temples", "start": 457.98, "duration": 9.84}, {"text": "They're the only structures that the wither wasn't likely to touch and immediately destroy", "start": 467.82, "duration": 4.98}, {"text": "And on that note, what's the key feature that exists inside of a stronghold", "start": 472.8, "duration": 3.4}, {"text": "Well, it's a portal to the End", "start": 476.2, "duration": 1.62}, {"text": "Now, we just established that the wither can destroy almost any block that it touches", "start": 477.82, "duration": 5.08}, {"text": "ALMOST any block, being the operative word there", "start": 482.9, "duration": 2.82}, {"text": "There are very few exceptions to things it can destroy", "start": 485.72, "duration": 4.08}, {"text": "Those exceptions include bedrock, command blocks, extended pistons, and End portal blocks and End portal frames", "start": 489.8, "duration": 7.8}, {"text": "I don't know about you, but it my society's being decimated and I'm trapped in my underground bunker, running away from this terrible beast that destroys everything it touches", "start": 497.6, "duration": 7.64}, {"text": "I'm making sure that I'm building that last ditch escape effort using supplies that are gonna be witherproof", "start": 505.24, "duration": 5.08}, {"text": "We also can be sure that the wither was known by the ancient builders", "start": 510.32, "duration": 3.54}, {"text": "If you look closely at the chiseled red sandstone that was used as decorations in ancient buildings like desert temples and underwater ruins", "start": 513.86, "duration": 6.52}, {"text": "You'll notice a hieroglyphic that clearly depicts the wither: straight body, three skeletal heads", "start": 520.38, "duration": 5.56}, {"text": "So, whoever created these structures in the first place certainly knew that this thing existed", "start": 525.94, "duration": 5.28}, {"text": "But how?", "start": 531.22, "duration": 1.0}, {"text": "Or, maybe more importantly, why?", "start": 532.22, "duration": 2.28}, {"text": "Why would anyone intentionally try to summon this thing in the first place?", "start": 534.5, "duration": 3.34}, {"text": "Well, let's look at how it's built, shall we", "start": 537.84, "duration": 2.16}, {"text": "The wither requires two very ingredients in order to be summoned", "start": 540.0, "duration": 4.36}, {"text": "The first is soul sand, found throughout the Nether", "start": 544.36, "duration": 3.18}, {"text": "Sand that's relatively unremarkable in every way", "start": 547.54, "duration": 2.44}, {"text": "Oh yeah, except for it being composed of the souls of the d*mned", "start": 549.98, "duration": 3.34}, {"text": "It's well known at this point that if you look at the pattern on soul sand close enough, you'll notice screaming faces staring right back at you", "start": 553.32, "duration": 6.94}, {"text": "It's also why you get sucked back down a bit when you're walking across it, almost like the lost souls are pulling you down into them, finally getting you to join them", "start": 560.26, "duration": 8.62}, {"text": "Yes ladies and gentlemen, this is me talking about Minecraft. Kid friendly, brand approved", "start": 568.88, "duration": 4.86}, {"text": "So ingredient number one: four cubic meters of d*mned souls", "start": 573.74, "duration": 3.42}, {"text": "Check mark there", "start": 577.16, "duration": 0.98}, {"text": "Secondly, you need three withered skeleton heads", "start": 578.14, "duration": 2.84}, {"text": "But why these particular heads and not just any skeleton head", "start": 580.98, "duration": 3.8}, {"text": "Well, to understand that, we need to find out what makes the withered skeleton so different from its brethren", "start": 584.78, "duration": 5.74}, {"text": "You see, withered skeletons are exclusive to Nether fortresses", "start": 590.52, "duration": 3.04}, {"text": "This is worth noting because think about how crazy this is", "start": 593.56, "duration": 2.66}, {"text": "We're basically in Minecraft's equivalent of H-E-double-toothpicks (HELL), a world of ghasts and blazes, where everything is set on fire and nothing can build", "start": 596.22, "duration": 9.16}, {"text": "Heck, most of the enemy spawns here don't even have arms", "start": 605.38, "duration": 2.84}, {"text": "And yet somehow there are fortresses here that are being supervised by large, cursed skeletons", "start": 608.22, "duration": 5.3}, {"text": "Fortresses, mind you, that contain chests full of gold and diamonds and iron, saddles, and horse armor, all materials that aren't found in the Nether naturally", "start": 613.52, "duration": 10.12}, {"text": "Supplies that had to have been brought down there and left by the original people who constructed these things in the first place", "start": 623.64, "duration": 6.68}, {"text": "The End city chests function much the same way", "start": 630.32, "duration": 2.46}, {"text": "And wouldn't you know it, they contain the same sorts of loot: iron and gold and diamonds and horse armor and saddles", "start": 632.78, "duration": 6.52}, {"text": "Almost like it's the same people carrying their major supplies from place to place", "start": 639.3, "duration": 4.0}, {"text": "So using this information, let me tell you a little story", "start": 643.3, "duration": 2.56}, {"text": "An ancient race of builders descends into the Nether to harvest its resources", "start": 645.86, "duration": 4.1}, {"text": "They construct fortresses down there to defend against the hostile environment and store their supplies", "start": 649.96, "duration": 4.74}, {"text": "But over time, as is natural, some of their ranks die", "start": 654.7, "duration": 3.52}, {"text": "The Nether is a dangerous and violent environment, after all", "start": 658.22, "duration": 3.08}, {"text": "So they bury their dead in the ground", "start": 661.3, "duration": 1.74}, {"text": "But they don't realize that this place works differently than the overworld they're used to", "start": 663.04, "duration": 4.5}, {"text": "What little soft ground there is actually sucks the soul out of the dead bodies, giving rise to soul sand", "start": 667.54, "duration": 6.82}, {"text": "And leaving these bodies as just an undead husk of what they once was", "start": 674.36, "duration": 4.0}, {"text": "It produces a withered skeleton, an aggressive, charred group of bones that, as an undead, lives on to complete the purpose it was given when it was alive:", "start": 678.36, "duration": 8.52}, {"text": "Defend its fortress", "start": 686.88, "duration": 1.9}, {"text": "Seeing all of this, the ancient ones start to piece together an idea", "start": 688.78, "duration": 2.68}, {"text": "If soul sand does indeed contain lost souls, and somehow gives rise to the skeletons of the dead", "start": 691.46, "duration": 5.24}, {"text": "Maybe there's a way to combine the two and bring their dead friends back to life", "start": 696.7, "duration": 4.78}, {"text": "These builders were a proud people", "start": 701.48, "duration": 2.1}, {"text": "I mean, they were builders, after all", "start": 703.58, "duration": 2.0}, {"text": "Whatever they dreamed came into being from their very hands", "start": 705.58, "duration": 3.32}, {"text": "They had conquered the earth, they had conquered the realms of heck, and now they would conquer the one thing impossible to any man: death", "start": 708.9, "duration": 7.54}, {"text": "They would build life itself", "start": 716.44, "duration": 2.92}, {"text": "I mean, with the raw materials you can construct anything, right?", "start": 719.36, "duration": 3.3}, {"text": "Why not a lost human?", "start": 722.66, "duration": 1.36}, {"text": "You have the soul in the soul sand. You have the body in the withered skeleton", "start": 724.02, "duration": 3.56}, {"text": "Why wouldn't it work?", "start": 727.58, "duration": 1.62}, {"text": "The last thing I'll call out here:", "start": 729.2, "duration": 1.26}, {"text": "You'll notice that none of the items in Nether chests are enchanted", "start": 730.46, "duration": 3.3}, {"text": "But by the time you get to the End, a lot of them are", "start": 733.76, "duration": 2.88}, {"text": "The reason I call this out is that it shows an escalation in the way these ancient builders started using magic", "start": 736.64, "duration": 5.56}, {"text": "By the time they end their journey in the End, they're full blown magic users", "start": 742.2, "duration": 4.46}, {"text": "They've start to go beyond just construction. They're starting to play with mystical forces", "start": 746.66, "duration": 5.84}, {"text": "So, how does this story all work out?", "start": 752.5, "duration": 1.8}, {"text": "Well, it's a classic tale of hubris", "start": 754.3, "duration": 2.28}, {"text": "The builders, having been to the fiery depths of heck, tried to harness the ultimate resource: the power of life and death itself", "start": 756.58, "duration": 7.72}, {"text": "They combined the soul and the body, the soul sand and the withered skeleton head, and it doesn't work", "start": 764.3, "duration": 6.78}, {"text": "But, by this point, they're obsessed", "start": 771.08, "duration": 2.26}, {"text": "There has to be a way to make it work like so many fictional characters before them, like Doctor Frankenstein, like the Elrics", "start": 773.34, "duration": 7.26}, {"text": "They're convinced that they have the right ingredients, and so they start going down darker, more supernatural paths in their quest to crack the mystery", "start": 780.6, "duration": 7.42}, {"text": "Magic, enchantment, potions", "start": 788.02, "duration": 2.06}, {"text": "Maybe they go to the witches, already outcasts from society for their use of soul sand to concoct awkward potions and strange brews", "start": 790.08, "duration": 7.52}, {"text": "And that's when the stumble upon it", "start": 797.6, "duration": 2.28}, {"text": "They finally manage to create something, but it wasn't what they expected", "start": 799.88, "duration": 4.6}, {"text": "Instead of bringing new life to a dead friend, they create a hideous and destructive beast", "start": 804.48, "duration": 5.46}, {"text": "One out to punish them for tampering with the laws of nature itself", "start": 809.94, "duration": 4.22}, {"text": "They make the wither, an unstoppable force", "start": 814.16, "duration": 3.24}, {"text": "A beast that, as we know, destroys the blocks that it touches and curses anything that gets in its way with decay", "start": 817.4, "duration": 6.52}, {"text": "Gone overnight are the great buildings that this ancient race once constructed", "start": 823.92, "duration": 4.38}, {"text": "The only things that remain standing are temples far out into the deserts, mineshafts hidden deep underground, monuments under the water", "start": 828.3, "duration": 7.7}, {"text": "Gone are all the people of this once great society", "start": 836.0, "duration": 2.92}, {"text": "One by one, consumed by the wither, a disease literally eating them away from the inside", "start": 838.92, "duration": 5.42}, {"text": "Friends, neighbors, dead, decayed", "start": 844.34, "duration": 2.8}, {"text": "Or worse–brought back to life in the form of skeletons and zombies, the living undead that roam the landscape to this day", "start": 847.14, "duration": 7.58}, {"text": "So for their own protection, the remaining ancient people hide underground, deep underground, down near the bedrock, in fortified bases called strongholds", "start": 854.72, "duration": 8.94}, {"text": "Far below where the flying wither will be able to reach", "start": 863.66, "duration": 2.38}, {"text": "With no trace of their existence on the surface, and its there where they plan their escape", "start": 866.04, "duration": 4.52}, {"text": "They've hopped to different realms before, using portal technology. Why not again?", "start": 870.56, "duration": 3.54}, {"text": "But this time, the portal has to be made to be witherproof, which is why End portal blocks are literally the only block type outside of bedrock immune to the wither's attacks", "start": 874.1, "duration": 7.76}, {"text": "And from there, we know the rest", "start": 881.86, "duration": 1.66}, {"text": "They manage to make the portal and hop to the End, but it's a one-way trip", "start": 883.52, "duration": 3.1}, {"text": "They don't realize that the portal won't be accessible behind them", "start": 886.62, "duration": 3.16}, {"text": "And what awaits them on the other side is something else, something completely unexpected, something that may have even been worse:", "start": 889.78, "duration": 7.24}, {"text": "The Ender dragon", "start": 897.02, "duration": 0.82}, {"text": "*Ender dragon roars*", "start": 897.84, "duration": 0.5}, {"text": "But, hey", "start": 898.34, "duration": 0.98}, {"text": "That's just a theory...", "start": 899.32, "duration": 2.12}, {"text": "A game theory!", "start": 901.44, "duration": 2.4}, {"text": "Thanks for watching", "start": 903.84, "duration": 1.24}, {"text": "And hey, before you disappear off into the Nether", "start": 905.08, "duration": 1.84}, {"text": "I need to tell you that this episode was made possible by our sponsor, Honey", "start": 906.92, "duration": 3.8}, {"text": "Who's doing everything they can to help us hold on to a few more of our precious emeralds", "start": 910.72, "duration": 3.6}, {"text": "They help the channel by sponsoring us", "start": 914.32, "duration": 1.82}, {"text": "Go to joinhoney.com/matpat to help us out", "start": 916.14, "duration": 2.94}, {"text": "And we help them by talking about how awesome they are by saving us a lot of money online", "start": 919.08, "duration": 4.48}, {"text": "So, basically, they help us twice over", "start": 923.56, "duration": 2.12}, {"text": "Don't tell them that we're all getting the good end of this deal", "start": 925.68, "duration": 2.18}, {"text": "And if you're an ancient builder who's been living deep underground in a stronghold and still don't know about Honey, then let me tell you", "start": 927.86, "duration": 5.28}, {"text": "It's basically the easiest way to save money online", "start": 933.14, "duration": 3.24}, {"text": "I've had the Honey plug-in on all of my browsers for two years now, and I have saved thousands of dollars", "start": 936.38, "duration": 4.2}, {"text": "And that's not an exhaggeration", "start": 940.58, "duration": 1.1}, {"text": "I have literally saved over a thousand dollars from using this little plug-in", "start": 941.68, "duration": 4.46}, {"text": "Between discounts for sales, free shipping and handling, holiday promos", "start": 946.14, "duration": 4.2}, {"text": "All things where Honey found me the discounts online, automatically, without having me do a single thing", "start": 950.34, "duration": 5.0}, {"text": "At all the places I shop anyway", "start": 955.34, "duration": 2.42}, {"text": "Honey saves me on shipping literally every time I buy my baby new clothes, like this zippety-zip here", "start": 957.76, "duration": 5.34}, {"text": "It's like a sleeping bag that they can wear anywhere", "start": 963.1, "duration": 2.7}, {"text": "It's great", "start": 965.8, "duration": 0.56}, {"text": "Literally last week, it saved me $50 on buying clothes that I bought at express", "start": 966.36, "duration": 3.56}, {"text": "I use it on Amazon and Best Buy for electronics", "start": 969.92, "duration": 2.86}, {"text": "It's on over 20,000 sites, so it's there for whatever I'm buying to make sure that I'm getting every possible discount without me having to search for sketchy websites or coupon codes", "start": 972.78, "duration": 9.1}, {"text": "It just works", "start": 981.88, "duration": 1.26}, {"text": "Right there", "start": 983.14, "duration": 0.76}, {"text": "I'm shopping and it's like, \"Hey, you're shopping right now. Did you know that you can save some money by clicking this button–\"", "start": 983.9, "duration": 4.36}, {"text": "And I'm like, \"YES, yes, I would love to save that money\"", "start": 988.26, "duration": 2.3}, {"text": "\"Thank you so much for doing the work for me, Honey\"", "start": 990.56, "duration": 2.04}, {"text": "But if you think I'm doing well, listen to this", "start": 992.6, "duration": 1.62}, {"text": "I actually asked Honey to calculate how much money you guys, my subscribers, have saved from using their plug-in", "start": 994.22, "duration": 6.72}, {"text": "Because they're able to attribute that those users installed the plug-in based on my recommendation using my signature link, right?", "start": 1000.94, "duration": 5.42}, {"text": "That's how they know that they're my subscribers", "start": 1006.36, "duration": 1.76}, {"text": "So get this", "start": 1008.12, "duration": 0.64}, {"text": "All you guys who are use Honey right now have collectively saved $1,545,000 from using this service", "start": 1008.76, "duration": 8.54}, {"text": "That's crazy!", "start": 1017.3, "duration": 1.0}, {"text": "And it's all free", "start": 1018.3, "duration": 1.22}, {"text": "That–There is no downside to it", "start": 1019.52, "duration": 1.96}, {"text": "You are literally putting more money in your pockets just by using this plug-in, and you know what? You're directly supporting this channel", "start": 1021.48, "duration": 5.2}, {"text": "So, support this channel, support your own wallet, and catch up on back-to-school sales", "start": 1026.68, "duration": 4.72}, {"text": "Or, just prepare for your holiday shopping because you better believe that Honey has got you covered on Black Friday", "start": 1031.4, "duration": 4.52}, {"text": "Download it now, it's completely free, and it's applied over 185 million coupons codes in the last year", "start": 1035.92, "duration": 6.92}, {"text": "That's it. 185 million coupons in one year", "start": 1042.84, "duration": 3.44}, {"text": "And they've done it for over 10 million users", "start": 1046.28, "duration": 2.6}, {"text": "It literally takes two clicks and two minutes to install", "start": 1048.88, "duration": 3.06}, {"text": "And then you get to experience the satisfaction of getting discounts forever", "start": 1051.94, "duration": 3.56}, {"text": "Again, go to joinhoney.com/matpat", "start": 1055.5, "duration": 2.66}, {"text": "Top line of the diggley-doo", "start": 1058.16, "duration": 1.42}, {"text": "And start saving money, and in turn, help support the channel by showing Honey that we're a good partner to them", "start": 1059.58, "duration": 4.56}, {"text": "You win, we win, they win", "start": 1064.14, "duration": 2.26}, {"text": "Rarely in life is there a win-win-win scenario, and this is it", "start": 1066.4, "duration": 3.38}, {"text": "It sounds too good to be true, but its not", "start": 1069.78, "duration": 1.78}, {"text": "They've been a trusted partner of ours for years now, and they deserve to be a trusted partner for yours as well", "start": 1071.56, "duration": 5.84}]