[{"text": "I don't want to get shot no no no no I don't wanna. I don't wanna die again", "start": 0.0, "duration": 4.41}, {"text": "All I heard was Wren Go (whooping)", "start": 5.1, "duration": 2.0}, {"text": "(Laughter)", "start": 7.1, "duration": 0.96}, {"text": "And the bells go jingle, jingle, jingle", "start": 8.06, "duration": 1.52}, {"text": "Is this like a morale booster yes, it's also really fun to play nerf games", "start": 12.48, "duration": 3.86}, {"text": "Why do we play this game cause it's fun to play nerf games Jake had to write too many emails and this is what happened", "start": 16.35, "duration": 4.859}, {"text": "When I start writing too many emails we were discussing the other day", "start": 21.52, "duration": 3.049}, {"text": "What elves do in their off time when it's not Christmas?", "start": 24.57, "duration": 2.52}, {"text": "We came to an answer", "start": 27.09, "duration": 1.109}, {"text": "There's an ongoing war", "start": 28.199, "duration": 1.511}, {"text": "With the southern elves who protect and defend Jack Frost things have gotten so bad", "start": 29.71, "duration": 4.13}, {"text": "With the war with Jack Frost that Santa has assembled a crack team of his best elves to sneak down and eliminate Jack Frost from", "start": 33.969, "duration": 7.34}, {"text": "The South Pole in the off season now here's the problem", "start": 41.309, "duration": 2.73}, {"text": "You're only gonna be armed with this you're gonna have to sneak into Jack Frost's warehouse", "start": 44.41, "duration": 4.459}, {"text": "Past armed century guards who will be blindfolded but can hear problem is your hat has bells on it", "start": 49.3, "duration": 6.799}, {"text": "Exactly. I think you get the idea steal a key sneak into his personal quarters take him out with this without waking him up sneak", "start": 56.8, "duration": 7.189}, {"text": "Out and get away clean, and here's the thing wait if we get shot do we do we get to try it again?", "start": 63.989, "duration": 5.94}, {"text": "No, no you're done.", "start": 69.929, "duration": 1.51}, {"text": "Straight up dead. I don't want to get shot any true Secret Agent Elf does not divulge his true identity", "start": 71.44, "duration": 5.6}, {"text": "So I'll be known as John Doe or enough name is sprinkle Stiltskin. I'm Queasy McSquiesy", "start": 79.52, "duration": 5.62}, {"text": "(Wren gets shot)", "start": 125.54, "duration": 2.0}, {"text": "Is everyone okay?", "start": 132.9, "duration": 1.62}, {"text": "Hi, I'm Jack Frost I feel pretty good about my chances of survival here because I got great sentries", "start": 134.52, "duration": 4.72}, {"text": "I took the best ones, I put them in this room, and I'm a pretty light sleeper in addition", "start": 139.25, "duration": 3.929}, {"text": "I keep my ice dagger on me at all times. I feel like between all the defenses. I have going on. I'll be fine", "start": 143.18, "duration": 5.67}, {"text": "I'm gonna sleep easy tonight a couple elves. I mean come on dude like no confidence that looks so difficult", "start": 148.85, "duration": 7.07}, {"text": "(Shots get fired)", "start": 161.36, "duration": 7.54}, {"text": "(Music Intensifies)", "start": 207.4, "duration": 2.06}, {"text": "I'm gonna try to change it up a little bit, so I'm gonna try a couple different methods first", "start": 209.46, "duration": 4.13}, {"text": "I'm actually gonna go around the side of the ramp and climb mine up went over the the gate there", "start": 213.59, "duration": 3.929}, {"text": "I'm also gonna remove my shoes so buy more control over the ground my feet", "start": 218.519, "duration": 4.55}, {"text": "(Wren laughs and runs away)", "start": 277.0, "duration": 7.0}, {"text": "That was so nerve racking! Oh My God!", "start": 284.0, "duration": 2.0}, {"text": "All I heard was Wren Go (whooping) (Laughter) and the bells going Jingle Jingle Jingle (More Laughter)", "start": 286.38, "duration": 5.46}, {"text": "(Talking and Laughter in the Background)", "start": 292.96, "duration": 9.6}, {"text": "(Keys Jingle)", "start": 315.22, "duration": 0.96}, {"text": "(Sentry Starts Firing", "start": 317.18, "duration": 4.34}, {"text": "And I think just a straight shot to the Jack Frost", "start": 322.52, "duration": 3.48}, {"text": "Now that we have three crack elves through the first phase it's time to go test their real capabilities stay tuned", "start": 328.33, "duration": 6.289}, {"text": "In a laboratory to wizard scientists forcefully dragon elf to a large metal press \"no no no no I don't wanna\"", "start": 335.34, "duration": 6.7}, {"text": "\"I don't want to die again! No!\"  A third scientist", "start": 342.06, "duration": 3.21}, {"text": "Helps hold him down and presses a large green button operating the press", "start": 345.27, "duration": 3.69}, {"text": "The press comes down and as soon as it makes contact with the elf blue magic pops out of it", "start": 349.09, "duration": 5.149}, {"text": "Slamming the press down to the metal base as the elf *snaps*", "start": 354.42, "duration": 2.48}, {"text": "Disappears cut to the wide shot of a group of Tour guests looking on in shock as an overly excited tour guide claps his hands", "start": 356.92, "duration": 7.16}, {"text": "\"Yes, yes, yes, yes, yes, what a magical experience.\" I'm working on it", "start": 364.08, "duration": 3.779}, {"text": "Adrienne's first pass on his rot\" video is complete, so we're gonna go out there and take a look at it", "start": 370.69, "duration": 6.17}, {"text": "I expect it to be well shot because he's a great cinematographer", "start": 376.86, "duration": 4.289}, {"text": "I expect it to look pretty which is part of it being well shot and then also", "start": 381.15, "duration": 4.71}, {"text": "Hopefully it accomplishes what he sought to create I mean", "start": 386.14, "duration": 3.619}, {"text": "I'm not nervous because it's a rough cut and I know it there's gonna be notes, but you know", "start": 389.92, "duration": 5.18}, {"text": "I hope they like it. I'm looking forward to this. So I put the sound effects in and", "start": 395.1, "duration": 3.3}, {"text": "Hopefully it works", "start": 399.12, "duration": 1.7}, {"text": "That is the beauty of a ruff cut", "start": 400.82, "duration": 1.6}, {"text": "Now gather around", "start": 403.58, "duration": 1.84}, {"text": "We're doing a, we're doing a (??? Wren noises)", "start": 405.42, "duration": 2.68}, {"text": "You know what's great? This video is going to come out Monday right?", "start": 408.1, "duration": 3.46}, {"text": "Monday of the what? This Monday, week from Monday", "start": 411.9, "duration": 2.92}, {"text": "Yeah, Yeah", "start": 414.82, "duration": 0.86}, {"text": "But that's not gonna come out on Monday", "start": 415.68, "duration": 2.0}, {"text": "(Laughter)", "start": 417.68, "duration": 1.74}, {"text": "What's happening", "start": 419.46, "duration": 2.0}, {"text": "I think the overall flow that works really well beginning hooks me it starts to slow down", "start": 435.83, "duration": 4.639}, {"text": "I start to feel T's de Lobos audience member and when it comes to YouTube others skip ahead doesn't want to avoid that happening", "start": 440.47, "duration": 4.769}, {"text": "The ending feels pretty good actually", "start": 445.43, "duration": 2.0}, {"text": "Adriean made what he sought to make that is extremely difficult to do especially in the setting in which it was done", "start": 447.98, "duration": 7.489}, {"text": "A bunch of production logistics were against him he was shooting a lot in a little amount of time", "start": 455.63, "duration": 5.029}, {"text": "He was working with a new crew he's coming into a new company. It's his first video", "start": 460.79, "duration": 4.13}, {"text": "There's a ton of pressure his experience in having filmed everything else that he's made", "start": 464.93, "duration": 5.059}, {"text": "I think really helped him out most features can't even do that with hundreds of millions of dollars", "start": 469.99, "duration": 4.53}, {"text": "we've given him our notes that we", "start": 474.56, "duration": 1.68}, {"text": "Collectively came up with he's gonna sit down with Nico tomorrow go over them try to implement some of them", "start": 476.24, "duration": 4.61}, {"text": "And we'll see what he does with them, and I think it'll be good", "start": 480.85, "duration": 3.51}, {"text": "I should use my audible integration time to actually clean the camera room. It's the only chance I have to do it", "start": 485.62, "duration": 4.74}, {"text": "I need to find this cable another audible integration another chance for me to recommend to you one of my favorite books", "start": 490.36, "duration": 5.999}, {"text": "I've really been wanting to recommend that you read Snow Crash. I read it this fall, and it blew my mind", "start": 496.36, "duration": 4.62}, {"text": "There's pizza delivery boys that if they don't get the pizza there on time", "start": 501.16, "duration": 3.269}, {"text": "They die sick motorcycle races a big floating aircraft carrier raft. There's also mini guns audibles introduced a new feature", "start": 504.43, "duration": 6.45}, {"text": "That's actually kind of cool you now listen to it on your Amazon echo", "start": 510.95, "duration": 3.409}, {"text": "Alexa read Snow Crash the wide specs on television screen resulting from weak recent Alexa pause so now you can just talk to your", "start": 514.49, "duration": 7.19}, {"text": "Echo I have to be careful. Not to say the q''-word otherwise it starts listening to me", "start": 522.2, "duration": 3.529}, {"text": "You can listen to audiobooks on your echo", "start": 526.01, "duration": 1.79}, {"text": "Anywhere you are and it's really cool because you actually resume it on your phone right from where you left off or any other device", "start": 527.8, "duration": 4.62}, {"text": "That you're listening on it keeps track of your progress through the story and keeps all your devices synced up", "start": 532.42, "duration": 4.32}, {"text": "What are these", "start": 538.3, "duration": 1.98}, {"text": "When we have helicopter headphones like actual functioning ones Snow Crash is a book about the future", "start": 540.29, "duration": 6.65}, {"text": "But also about the past part of takes place in a weird ultimate history America it takes place in the VR Metaverse", "start": 546.94, "duration": 6.75}, {"text": "and part of it takes place in", "start": 554.26, "duration": 2.0}, {"text": "History, I'm talking about linguistics so for example when you think what do you think about things?", "start": 557.21, "duration": 3.95}, {"text": "They think about solving a problem. You tend to think in the language that you speak", "start": 561.16, "duration": 2.729}, {"text": "I guess I do you know I think I think in English the book poses a question", "start": 563.89, "duration": 3.3}, {"text": "Which is what about in the origin of language when there wasn't past tense in future tense and pronouns the vocabulary wasn't that big?", "start": 567.19, "duration": 6.779}, {"text": "Did that affect how well people could think and how well they could?", "start": 574.13, "duration": 2.869}, {"text": "problem-solve", "start": 577.13, "duration": 0.5}, {"text": "and actually it's a really interesting question to pose and in the book then ties that into a sci-fi twist where it gets into the", "start": 577.63, "duration": 5.309}, {"text": "Depths of hacking how people's minds function, and if there's a language that allows you to do", "start": 582.94, "duration": 4.5}, {"text": "So so I highly recommend you check it out", "start": 587.44, "duration": 1.83}, {"text": "So you'd actually try it right now for free if you have an Amazon echo, just simply ask Alexa to read you a book", "start": 589.27, "duration": 5.34}, {"text": "now right now, Alexa", "start": 595.34, "duration": 2.0}, {"text": "You can also go to audible.com slash Sam and Nico or text Sam and Eko to five hundred five hundred", "start": 597.53, "duration": 5.69}, {"text": "To get a free book and a free one-month trial man. I'm never gonna find that cable now", "start": 603.53, "duration": 4.01}, {"text": "That boy is gone. It's too bad. It's really really useful because we could put her at her master's doesn't have a battery panel", "start": 608.39, "duration": 6.71}, {"text": "That's how we were plugging it into batteries and somebody straight-up lost it. What's this?", "start": 615.2, "duration": 4.22}, {"text": "Why is this here steal a key sneaked into his personal quarters take him out with this without waking him up?", "start": 619.42, "duration": 5.48}, {"text": "Sneak out and get away clean. There's no God only Santa (Laughing)", "start": 625.1, "duration": 4.96}, {"text": "Ow! (laughing)", "start": 654.0, "duration": 3.1}, {"text": "(Screaming)", "start": 689.02, "duration": 3.78}, {"text": "You're out of bullets", "start": 712.16, "duration": 1.06}, {"text": "(Niko thought he got away but got shot)", "start": 715.54, "duration": 0.72}, {"text": "(Laughter)", "start": 720.38, "duration": 8.48}, {"text": "Lie here I'm sleeping I'm sleeping away, and all I hear is one little Bell goat. I", "start": 742.04, "duration": 5.66}, {"text": "Open one. Eye and Nico's right there, and he like looks at me, and he sees my eyes are open. He goes", "start": 747.92, "duration": 4.19}, {"text": "So Neko technically still accomplished the mission he died a war hero, and they made a statue for him in the North Pole", "start": 752.989, "duration": 5.84}, {"text": "Looked like but it's so funny to see you", "start": 760.61, "duration": 2.089}, {"text": "Like now Nikko died a war hero, but Adrian has the chance to live as a war hero. We'll see what happens", "start": 765.98, "duration": 6.859}, {"text": "No pressure three two one game on", "start": 773.049, "duration": 2.31}, {"text": "You just like I wouldn't wake me as possible because when I was up there", "start": 845.34, "duration": 4.159}, {"text": "I had no idea Nikko made it that in that quick so like if I go even quicker", "start": 849.5, "duration": 4.26}, {"text": "They're probably not gonna have any idea. Oh my god", "start": 853.76, "duration": 2.729}, {"text": "I really just walk this way and like that at this Beach", "start": 857.3, "duration": 2.849}, {"text": "Dude I didn't think I'd make it through that first challenge both", "start": 863.4, "duration": 2.779}, {"text": "oh\nHere's the thing though both Nico and Adrian basically made it to the end Nico died out of sheer bad luck", "start": 866.18, "duration": 6.03}, {"text": "Adrian made it and his method was to go really fast", "start": 872.7, "duration": 2.57}, {"text": "But if I go really fast, I'm afraid I'll be hurt. I'm gonna try the shoe this game on", "start": 875.91, "duration": 4.669}, {"text": "For the kill is like I have no weapon", "start": 922.87, "duration": 2.059}, {"text": "Jack Frost slow ice dagger beats an unarmed elf every day Adrienne was the only one to make it home alive", "start": 928.72, "duration": 7.1}, {"text": "Through your senses top elf now until next time Christmas is save", "start": 936.76, "duration": 4.52}, {"text": "Takes yeah, till next winter sweetie. Well. That was a lot of fun now if you think we should play that again. Let us know", "start": 942.01, "duration": 4.85}, {"text": "Hey consider subscribing if you haven't already", "start": 947.89, "duration": 2.0}]