[{"text": "Well guys, it's finally here, the Nintendo Switch Lite has arrived.", "start": 4.72, "duration": 3.44}, {"text": "I ended up picking up my Nintendo Switch, the turquoise model one here on launch day, the Switch lite cost", "start": 8.16, "duration": 6.26}, {"text": "$199 in the US and it does have some", "start": 14.56, "duration": 3.14}, {"text": "noticeable omissions from the regular Nintendo Switch that we're going to talk about but in this video", "start": 17.8, "duration": 5.03}, {"text": "we're going to take a close", "start": 22.83, "duration": 1.19}, {"text": "Look at the Nintendo Switch Lite as well as do a teardown of the system and take a look and see what's inside", "start": 24.029, "duration": 6.21}, {"text": "and what's going on under the hood, but before we do that, we do have a sponsor on today's video that I want to thank", "start": 30.24, "duration": 5.999}, {"text": "Skillshare", "start": 36.76, "duration": 1.29}, {"text": "Skillshare is an online learning community that has over", "start": 38.05, "duration": 2.59}, {"text": "23,000 classes available over many different skills", "start": 40.78, "duration": 2.74}, {"text": "If you have a certain skill set that you want to learn more about you can sign up and join the classes and get started", "start": 43.53, "duration": 4.68}, {"text": "Or just browse around and take a look at the different things", "start": 48.21, "duration": 2.279}, {"text": "The platform has to offer now for me outside of my youtube channel. My biggest passion is music production", "start": 50.489, "duration": 5.069}, {"text": "None of which I had any formal training. There's so much to learn here and it can be overwhelming", "start": 55.559, "duration": 4.26}, {"text": "I understand how to use digital audio software how to read and write music how to mix and master songs", "start": 59.859, "duration": 5.57}, {"text": "But I'm no expert in any of these and Skillshare has all these courses and more available in order to take my music", "start": 65.47, "duration": 5.419}, {"text": "Production further one course that I'm really into right now is learning how to master music", "start": 71.08, "duration": 4.459}, {"text": "Mastering has always been a dark art for me", "start": 75.64, "duration": 1.88}, {"text": "And this course goes through everything from the basics of setting up your bedroom", "start": 77.52, "duration": 3.06}, {"text": "To EQ compression and recommended plugins to use to get that killer sound", "start": 80.71, "duration": 4.489}, {"text": "Skillshare is affordable while you do get some free courses. I recommend their Premium Membership", "start": 85.81, "duration": 4.519}, {"text": "it's less than ten dollars a month for an annual subscription and", "start": 90.329, "duration": 2.85}, {"text": "Skillshare is generous enough to offer viewers of my channel two months for free in the link in the description below once again big", "start": 93.46, "duration": 6.619}, {"text": "Thanks to Skillshare for sponsoring today's video", "start": 100.079, "duration": 2.1}, {"text": "No one does handhelds better than Nintendo and the Switch Lite represents the newest in their long line of successful", "start": 102.25, "duration": 5.899}, {"text": "Handhelds and one that was sure to continue that legacy", "start": 108.64, "duration": 2.869}, {"text": "Hybrid gaming came in 2017 with the launch of the switch", "start": 112.21, "duration": 3.5}, {"text": "But it was the Wii U that really planted the seed. The Wii U tablet could control your entire gaming experience", "start": 115.75, "duration": 6.11}, {"text": "The problem was you needed to be close to the base at all times", "start": 121.86, "duration": 3.089}, {"text": "oh and the battery life was terrible and no one bought the Wii U anyway, so it's no surprise to anyone that Nintendo announced a", "start": 124.949, "duration": 7.851}, {"text": "$199 handheld only Switch. The first thing you need to get out of the way is that this is a handheld only system", "start": 132.98, "duration": 7.48}, {"text": "You can't dock it, and you can't send video over USB C to a television", "start": 140.64, "duration": 4.14}, {"text": "I tested this of course and it didn't work", "start": 144.78, "duration": 2.54}, {"text": "This was also confirmed to me some time ago by let's say some industry insiders. Now at this point", "start": 147.78, "duration": 5.97}, {"text": "I'm not sure if this is a firmware thing or it's in the hardware, but one thing that I do know", "start": 153.75, "duration": 4.97}, {"text": "Is that this feature was never in Nintendo's plan for the Switch Lite.", "start": 158.72, "duration": 3.72}, {"text": "There's also no kickstand so you can't prop it up to play. But again people's expectations need to be reset", "start": 162.82, "duration": 6.88}, {"text": "This is a handheld", "start": 169.75, "duration": 1.95}, {"text": "something like the", "start": 171.7, "duration": 0.899}, {"text": "PlayStation Vita is the best thing that I can compare it to you'll be taking the Switch Lite with you on the subway", "start": 172.6, "duration": 5.6}, {"text": "When you're flying when you're traveling or visiting your friend's house, you can take it anywhere", "start": 178.32, "duration": 4.92}, {"text": "but you won't be able to dock it and you won't be able to use a kickstand. Going back to the", "start": 183.34, "duration": 4.82}, {"text": "PlayStation Vita if we compare the switch light, it's quite comparable", "start": 188.26, "duration": 3.22}, {"text": "The PS Vita has a 5-inch display while this switch light has a 5.5 inch display", "start": 191.53, "duration": 5.479}, {"text": "Incidentally the original switch has a 6.2 inch display", "start": 197.86, "duration": 3.8}, {"text": "The weight of the Switch Lite comes in at around 10", "start": 201.76, "duration": 2.8}, {"text": "Ounces very light and good for long play sessions and speaking of that", "start": 204.64, "duration": 3.92}, {"text": "The battery life is improved over the original switch model", "start": 208.56, "duration": 3.24}, {"text": "But not as good as the newest Switch model with Nintendo claiming 3-7 hours and around four on average", "start": 211.8, "duration": 7.08}, {"text": "That's pretty awesome for extended Link's Awakening sessions", "start": 219.12, "duration": 3.26}, {"text": "There's also some additional omissions including HD Rumble and the detachable joy cons", "start": 222.66, "duration": 5.16}, {"text": "But you can pair up external joy cons and you can use them just fine and yes a pro controller works just as well", "start": 227.92, "duration": 6.98}, {"text": "The switch light comes with a d-pad instead of the buttons and I think this is a welcome", "start": 235.74, "duration": 3.92}, {"text": "Inclusion with my playthrough of some SNES classic games the d-pad held up nicely and I think this was the right move", "start": 239.799, "duration": 5.63}, {"text": "However, there are some questions around fighting games", "start": 245.43, "duration": 2.82}, {"text": "And if the d-pad will hold up there especially compared to the SNES d-pad", "start": 248.25, "duration": 4.139}, {"text": "for example", "start": 252.389, "duration": 0.831}, {"text": "It's smaller and more compact and it reminds me of the Nintendo 2ds d-pad. Now onto the 5.5 inch display", "start": 253.22, "duration": 6.64}, {"text": "I absolutely love it. It's crisp and vibrant and one of the things that really makes the switch light stand out", "start": 259.98, "duration": 5.66}, {"text": "It's noticeable how great everything looks from all viewing angles, especially when we compare it to an original switch. You can see some differences here", "start": 265.88, "duration": 7.82}, {"text": "So tearing down the switch itself is pretty straightforward. You just need a tri wing screwdriver like the original switch", "start": 275.62, "duration": 6.94}, {"text": "There's our four screws at the back that you need to unscrew as well as two at the base of the system", "start": 282.56, "duration": 7.58}, {"text": "that you'll unscrew as well", "start": 290.4, "duration": 2.22}, {"text": "Which really is pretty straightforward to do there's not really much else that needs to happen here", "start": 292.98, "duration": 5.38}, {"text": "and then", "start": 298.379, "duration": 0.79}, {"text": "it's just a matter of getting the case after the back case there and", "start": 299.169, "duration": 4.25}, {"text": "the way that I did that was just to use like a guitar pick or some type of", "start": 303.61, "duration": 3.859}, {"text": "plastic tool that can really just slide underneath and", "start": 308.11, "duration": 3.019}, {"text": "Take the back case off and it should just come off pretty easily. I would definitely not force it. It's clipped on pretty good", "start": 311.439, "duration": 7.43}, {"text": "There's a lot of Clips around", "start": 318.869, "duration": 1.891}, {"text": "the case itself. So just take your time and be careful doing that. Now as you can see we have the", "start": 320.76, "duration": 7.64}, {"text": "Insides of the switch here and there's the big heat sink", "start": 329.02, "duration": 2.98}, {"text": "Which is very much similar to the original switch with the big shielding", "start": 332.009, "duration": 5.07}, {"text": "That's kind of wrapped around the most of the internals", "start": 337.26, "duration": 2.92}, {"text": "So unscrewing, this is pretty straightforward as well with the same tri-wing screwdriver", "start": 340.36, "duration": 4.4}, {"text": "There's I believe there's three or four screws two on either end", "start": 345.0, "duration": 4.259}, {"text": "And then there's one in the middle there by the fan that we'll do last.", "start": 349.26, "duration": 3.94}, {"text": "There's also one kind of just underneath the one that I'm doing right now", "start": 353.62, "duration": 4.14}, {"text": "Which really is all we need to do", "start": 358.36, "duration": 2.209}, {"text": "So once the last screw has been removed, it's just a matter of lifting off the shielding", "start": 361.779, "duration": 4.76}, {"text": "It should just come loose and come away pretty easily. And then the next thing we need to do is remove the", "start": 366.539, "duration": 5.97}, {"text": "Heat pipe which is pretty easy as well", "start": 373.029, "duration": 2.48}, {"text": "There are three screws to remove two on the right hand side", "start": 375.509, "duration": 3.329}, {"text": "And then there's one on the left hand side as you can see", "start": 378.939, "duration": 4.19}, {"text": "It's pretty straightforward to do but once again", "start": 383.129, "duration": 3.24}, {"text": "Just make sure you get all three screws. And then once you've done this then you'll have access to the", "start": 386.44, "duration": 6.58}, {"text": "CPU and the memory. Now these are contained in some metal shielding", "start": 393.72, "duration": 6.48}, {"text": "which is also", "start": 400.48, "duration": 1.86}, {"text": "used for heat transfer onto the the heat pipe itself", "start": 402.34, "duration": 4.49}, {"text": "so once we take away the heat pipe you can see there's a metal shielding there that's covering the", "start": 407.2, "duration": 4.639}, {"text": "CPU and the memory, so I just took that up. It's pretty easy to do", "start": 412.66, "duration": 2.9}, {"text": "I just used a stanley knife or an Xacto knife to get that off and", "start": 415.58, "duration": 5.1}, {"text": "Then we have access to the CPU and the memory now", "start": 421.08, "duration": 4.64}, {"text": "The first thing to mention is that this is indeed using the new tech or x1", "start": 425.73, "duration": 5.82}, {"text": "Mariko revision and we knew that going into the switch slight revision that it was using the america chip", "start": 431.89, "duration": 6.35}, {"text": "Which is the same one as the new revision switch, but just to confirm", "start": 438.24, "duration": 4.559}, {"text": "Yes", "start": 442.8, "duration": 0.39}, {"text": "It is using the Mariko chip and also the memory chips are", "start": 443.19, "duration": 5.01}, {"text": "Identical to the new revision switch as well and one thing that's very apparent to me looking", "start": 448.63, "duration": 6.109}, {"text": "Internally inside the switch here is that there is no video", "start": 455.23, "duration": 5.059}, {"text": "Display processor at all", "start": 460.99, "duration": 1.95}, {"text": "so in other words", "start": 462.94, "duration": 1.14}, {"text": "There is no way that this Switch Lite without any", "start": 464.08, "duration": 4.04}, {"text": "hardware modification or any aftermarket hardware modification can ever externally display to a television or an", "start": 468.46, "duration": 7.88}, {"text": "HDTV which really, you know answers that question because we weren't really sure if it was going to do that or not", "start": 476.86, "duration": 5.54}, {"text": "But there is no circuitry here at all. Okay, so we have the case off and we have a look at the internal", "start": 482.65, "duration": 7.339}, {"text": "So let's go ahead and walk through what we have going on here these two pieces of plastic are the internal speakers", "start": 489.989, "duration": 5.631}, {"text": "Which route the sound to the base of the Switch Lite. Now, this is the SD card slot", "start": 495.7, "duration": 4.92}, {"text": "There's nothing special here and then there's this compartment which contains the flash memory which is identical to the original switch", "start": 500.62, "duration": 7.28}, {"text": "the Tegra x1 and four gigabytes of RAM", "start": 508.12, "duration": 2.75}, {"text": "We've already talked about and the shielded portion houses the chip for the onboard Wi-Fi now", "start": 510.87, "duration": 5.85}, {"text": "Although there's no detachable joy cons on the Switch Lite", "start": 516.72, "duration": 3.42}, {"text": "These joysticks use separate PCBs that connect to the motherboard via ribbon cables", "start": 520.26, "duration": 5.0}, {"text": "Now the bad news appears to be that for those people that had drift issues on the original switch", "start": 525.54, "duration": 5.84}, {"text": "It appears as though the exact same analog sticks and design are being used in the Switch Lite", "start": 531.38, "duration": 5.4}, {"text": "So will we see any drifting issues in the Switch Lite?", "start": 536.82, "duration": 2.9}, {"text": "Well hopefully not but certainly time will tell then we have the USB-C connect at the base and the battery which is the smaller", "start": 539.86, "duration": 6.98}, {"text": "3570 mAh battery", "start": 547.02, "duration": 2.04}, {"text": "But we get one extra hour of battery life over the regular switch and that's thanks to the new Integra x1 chip. I", "start": 549.339, "duration": 6.679}, {"text": "Think it's a fantastic system. I love the handheld and it really is the next kind of generation", "start": 557.5, "duration": 5.839}, {"text": "Of handheld that I've been looking for, you know", "start": 563.88, "duration": 2.48}, {"text": "I've been a big fan of the PlayStation Vita and the Switch Lite does compare to the Vita in lots of ways", "start": 566.36, "duration": 6.18}, {"text": "Especially the form factor the way it feels the buttons the analog sticks", "start": 572.76, "duration": 4.46}, {"text": "There's a lot of similarities between the Switch Lite and the PlayStation Vita then", "start": 577.22, "duration": 4.92}, {"text": "You know more than you would actually think and I really appreciate the design of the Switch Lite", "start": 582.14, "duration": 5.8}, {"text": "I think it's a great handheld and it really is one that is going to be very successful", "start": 587.94, "duration": 4.76}, {"text": "For Nintendo in the coming years", "start": 592.78, "duration": 2.9}, {"text": "Now one quick thing to mention before we wrap up is the hacking attempts on the Switch Lite right now", "start": 595.68, "duration": 6.96}, {"text": "It's really too early to say what the future will bring for the Switch Lite", "start": 602.64, "duration": 4.86}, {"text": "Obviously the switch light has the new Mariko chip", "start": 607.52, "duration": 3.24}, {"text": "Which is the same one as the new revision switch and obviously there has been some work done", "start": 610.76, "duration": 6.54}, {"text": "to try to defeat security on that particular chip, but it's going to take some time and", "start": 617.67, "duration": 5.729}, {"text": "There's a likelihood that it may not even happen for a long long time", "start": 623.98, "duration": 4.19}, {"text": "But if history tells us anything guys, it's that everything gets exploited", "start": 628.24, "duration": 4.88}, {"text": "Eventually, it just depends on a, hell I mean it's going to take I mean", "start": 633.7, "duration": 3.529}, {"text": "it could very likely be the next revision of Nintendo hardware gets released before the", "start": 637.229, "duration": 7.591}, {"text": "Mariko revision switch hardware gets exploited", "start": 645.58, "duration": 2.64}, {"text": "I mean that's a possibility that you have to really consider when you think about these things but on the flip side", "start": 648.22, "duration": 6.26}, {"text": "There is work that's being done today", "start": 654.79, "duration": 2.539}, {"text": "That I know for a fact that people out there are trying to you know, do things like glitching", "start": 657.91, "duration": 5.059}, {"text": "In order to glitch the CPU in order to you know, boot into the system in some type of exploited or unsigned code fashion", "start": 663.51, "duration": 6.96}, {"text": "So there's kind of glitching attempts that are happening right now as well as the traditional stack and buffer overflow type", "start": 670.48, "duration": 5.81}, {"text": "Work that's being done in order to see if there's any exploit from a software perspective that can potentially open up the system", "start": 676.42, "duration": 7.19}, {"text": "But you know, the reality is right now there is no", "start": 683.74, "duration": 3.36}, {"text": "known method to modify or hack", "start": 687.2, "duration": 3.76}, {"text": "A Mariko revision switch which also includes the Switch Lite, so it may happen. It may happen this year", "start": 691.0, "duration": 6.92}, {"text": "It may happen next year. It may not happen for five years. It may not happen at all", "start": 697.92, "duration": 5.02}, {"text": "We'll just have to wait and see what the future holds but obviously Nintendo took the blows of the original switch", "start": 703.0, "duration": 7.369}, {"text": "Security being completely busted open pretty much from the beginning", "start": 710.89, "duration": 4.099}, {"text": "very very seriously and worked very diligently and put a lot of money and", "start": 715.54, "duration": 5.26}, {"text": "research into", "start": 720.98, "duration": 2.42}, {"text": "Ensuring that this doesn't happen again at least from the you know", "start": 723.4, "duration": 3.709}, {"text": "Jig approach in order to exploit the device from what happened in the first revision of the switch", "start": 727.11, "duration": 5.97}, {"text": "Well guys, I'm going to leave it here for this video", "start": 733.18, "duration": 2.0}, {"text": "Thank you so much for watching if you enjoyed it, you know what to do", "start": 735.18, "duration": 2.429}, {"text": "Leave me a thumbs up and let me know what you thought about it in the comments below as always", "start": 737.61, "duration": 3.57}, {"text": "Don't forget to Like and subscribe and I'll catch you guys in the next video. Bye for now", "start": 741.18, "duration": 4.679}, {"text": "(music)", "start": 745.86, "duration": 15.46}]