[{"text": "Hey everyone, Jared here.", "start": 9.36, "duration": 1.4}, {"text": "Today, we’re talking about a show that’s at the top of its game after almost 20 years on the air:", "start": 10.76, "duration": 4.48}, {"text": " South Park, specifically, season 19.", "start": 15.24, "duration": 8.46}, {"text": "Unlike much earlier seasons, Season 19 is a serialized narrative that tells an overarching story from episode to episode.", "start": 23.7, "duration": 6.92}, {"text": "They played with this idea a bit in Season 18, but, overall, it wasn’t nearly as comprehensive. ", "start": 30.62, "duration": 4.58}, {"text": "Season 19 is arguably the smartest season yet.", "start": 35.2, "duration": 3.14}, {"text": "It chronicles the small Colorado town as it experiences significant social changes,", "start": 38.34, "duration": 4.2}, {"text": "introduces a new central character, and comments on America’s current political climate.", "start": 42.54, "duration": 7.04}, {"text": "One of the cleverest aspects of this season\nis its layered commentary.", "start": 49.58, "duration": 6.52}, {"text": "Not only is it about our modern social condition, but also\nabout the show itself.", "start": 56.1, "duration": 4.48}, {"text": "The season opens with the firing of Principal Victoria over an incident referring to rape as a “hot cosby”.", "start": 60.58, "duration": 5.84}, {"text": "\"A new person has been appointed to try and make South Park Elementary a more progressive place", "start": 66.42, "duration": 4.98}, {"text": "that fits in with today's times.\"", "start": 71.4, "duration": 1.9}, {"text": "He might as well be talking about South Park the show.", "start": 73.3, "duration": 2.54}, {"text": "\"I'm here because this place is lost in a time-warp.\"", "start": 75.84, "duration": 3.66}, {"text": "In other words, can South Park’s signature vulgar sensibility possibly survive", "start": 79.5, "duration": 4.34}, {"text": "in our current politically correct world?", "start": 83.84, "duration": 2.36}, {"text": "You could go through the season and interpret these comments on the town changing", "start": 86.2, "duration": 3.36}, {"text": "as a meta commentary on the show itself facing change.", "start": 89.56, "duration": 3.04}, {"text": "\"The times changing so fast. Everybody wanna be PC, be updated. It's like I'm a relic.\"", "start": 92.6, "duration": 5.54}, {"text": "The Mayor later\nmakes this explicit to Officer Barbrady,", "start": 98.14, "duration": 2.88}, {"text": "\"You're from another time, Barbrady. And the last thing that needs to go.\"", "start": 101.02, "duration": 4.2}, {"text": "the Newsmen are constantly droning on about noticing “changes” to the town, and Mr. Garrison —", "start": 105.22, "duration": 4.98}, {"text": "himself a fountain of unbridled profanity\n— returns to South Park to save it from these changes.", "start": 110.2, "duration": 7.72}, {"text": "But what’s the deal with the PC plotline? One might be satisfied with the explanation that", "start": 117.92, "duration": 4.02}, {"text": " it’s Trey Parker and Matt Stone taking a dump on liberal politics as they've done in the past.", "start": 121.94, "duration": 4.38}, {"text": "The two have espoused their libertarian\nleanings in interviews before,", "start": 126.32, "duration": 3.2}, {"text": "but they often evade a simple left/right divide.", "start": 129.52, "duration": 2.6}, {"text": "If you felt slightly lost in this connection between the ads, PC culture, and gentrification, you’re not alone. ", "start": 132.12, "duration": 6.16}, {"text": "But find solace, because we've got an idea, and it all starts with neoliberalism.", "start": 138.28, "duration": 7.54}, {"text": "Welcome to this Wisecrack Edition on The Philosophy of South Park Season 19.", "start": 145.82, "duration": 7.56}, {"text": "In a nutshell, neoliberalism is an economic\nideology", "start": 153.38, "duration": 3.16}, {"text": "that stresses personal freedoms and market solutions to address society’s problems.", "start": 156.54, "duration": 4.2}, {"text": "Want to fix healthcare, the post\noffice or Chipotle? Let the market take care of it.", "start": 160.74, "duration": 4.16}, {"text": "Or as Philosopher Henry Giroux puts it, the\ntenants of neoliberalism are:", "start": 164.9, "duration": 3.82}, {"text": "1. Consumerism is the most important duty as a citizen, 2. Individual freedoms trump public freedoms", "start": 168.72, "duration": 6.14}, {"text": "and 3. All public social issues are addressed on a private level.", "start": 174.86, "duration": 3.78}, {"text": "Neoliberalism neatly ties together three seemingly\ndisparate themes in the show:", "start": 178.64, "duration": 4.28}, {"text": "gentrification, PC culture and advertising.", "start": 182.92, "duration": 2.84}, {"text": "Which leads us to one of the best lines of the season:", "start": 185.76, "duration": 2.44}, {"text": "\"What is PC but a verbal form of gentrification?", "start": 188.2, "duration": 3.7}, {"text": "\"Spruce everything up, get rid of all the ugliness, in order to create a false sense of paradise?", "start": 191.9, "duration": 4.82}, {"text": "\"Only one thing can actually live in that world: ads.\"", "start": 196.72, "duration": 3.76}, {"text": "Neoliberalism has one goal: make everything\nmarketable.", "start": 200.48, "duration": 3.3}, {"text": "Gentrification, for example, is the free market’s way of dealing with shitty neighborhoods.", "start": 203.78, "duration": 7.14}, {"text": " It’s the process whereby real estate developers and business interests", "start": 210.92, "duration": 3.06}, {"text": "take advantage of low prices and industrial chic to sell white people overpriced tapas", "start": 213.98, "duration": 4.72}, {"text": "without fixing the underlying problem of poverty.", "start": 218.7, "duration": 2.64}, {"text": "Even diversity and multiculturalism serve\nthe engines of profit.", "start": 221.34, "duration": 3.7}, {"text": "Wanna venture to Shi Tpa Town to experience exotic cuisines of other cultures?", "start": 225.04, "duration": 4.2}, {"text": "Well, don’t feel too dignified in your worldliness.", "start": 229.24, "duration": 2.54}, {"text": "By suggesting that advertisers are manipulating PC culture in order to gentrify run-down areas all over the world, ", "start": 231.78, "duration": 6.36}, {"text": "the show playfully points to something they've been saying for years; that in a neoliberal economy,", "start": 238.14, "duration": 4.4}, {"text": "otherness and diversity have just become marketable brands in order to sell anything and everything.", "start": 242.54, "duration": 5.84}, {"text": "This is all made pretty explicit in the show:", "start": 248.38, "duration": 1.94}, {"text": "\"Oh great. So now ads are using PC for their own games? That's a new low.\"", "start": 250.32, "duration": 4.74}, {"text": "One might say that the ads are a stand-in\nfor the grossly inhuman forces of neoliberal capitalism,", "start": 255.06, "duration": 5.08}, {"text": "\"And now, the ads have taken the next step in their evolution. They have taken human form.\"", "start": 260.14, "duration": 3.98}, {"text": "ready to assimilate or destroy everything and everyone in its path — ", "start": 264.12, "duration": 4.08}, {"text": "but always behind the scenes, and barely noticeable. Leslie and PC Principal stirs up an anxiety:", "start": 268.2, "duration": 5.52}, {"text": "what if my friend, family, or beloved TV shows are just ads or sponsored content?", "start": 273.72, "duration": 5.42}, {"text": "What if I’m an ad?", "start": 279.14, "duration": 3.02}, {"text": "In a world permeated by advertising, how can we know what ideas are truly our own, ", "start": 282.16, "duration": 4.56}, {"text": "rather than planted by clever commercials?", "start": 286.72, "duration": 2.0}, {"text": "What makes the ads so dangerous is their ability to cover up the reality of the situation, to distract us.", "start": 288.72, "duration": 5.24}, {"text": "In the end, as Nathan says, it’s only ads\nthat can live in this world.", "start": 293.96, "duration": 3.78}, {"text": "Reduced versions of ourselves, of cultures, that can be neatly packaged and sold.", "start": 297.74, "duration": 4.42}, {"text": "Cultures of social acceptance that are more of a brand than actual tolerance.", "start": 302.16, "duration": 4.02}, {"text": "Gay pride parades sponsored by TD Bank, or real standards of beauty sponsored by Dove,", "start": 306.18, "duration": 4.66}, {"text": "because who needs real revolution when there’s a clever hashtag?", "start": 310.84, "duration": 5.22}, {"text": "Now now, we’re not arguing that diversity is bad,\nand neither is South Park. ", "start": 316.06, "duration": 4.18}, {"text": "But one thing neoliberalism is really good at is a process called cooptation —", "start": 320.24, "duration": 4.12}, {"text": "to take what was once outside of the system and assimilate it so that it can serve the needs of capitalism.", "start": 324.36, "duration": 5.3}, {"text": "Neoliberalism absorbs identities and diversity, so that multiculturalism becomes a trendy brand to be purchased.", "start": 329.66, "duration": 6.52}, {"text": "\"Is there a reason the children with disabilities and black child are front and center?\"", "start": 336.18, "duration": 3.36}, {"text": "\"Oh no, that's just where they always sit. Next to our beloved Craig there, who is a homosexual.\"", "start": 339.54, "duration": 5.26}, {"text": "For the town of South Park to advance economically,", "start": 344.8, "duration": 2.5}, {"text": "they have to adopt these marks of tolerance to bring in businesses and new residents. ", "start": 347.3, "duration": 4.18}, {"text": "So how do you convince the world that your town isn’t some antiquated backwater shithole, ", "start": 351.48, "duration": 4.14}, {"text": "but rather a bastion of progressive ideals?", "start": 355.62, "duration": 2.4}, {"text": "Whole Foods. The show uses Whole Foods as a focal point for a ton of the progressive changes happening.", "start": 358.02, "duration": 5.04}, {"text": "\"Our town has only had a Whole Foods for three weeks, and we already have our first gay kids. So cool.\"", "start": 363.06, "duration": 5.68}, {"text": "When the whole town think Craig and Tweek are gay,", "start": 368.74, "duration": 1.84}, {"text": "Whole Foods serves as the setting where everyone congratulates Craig’s dad on the news.", "start": 370.58, "duration": 4.2}, {"text": "Randy even credits Whole Foods for their new police-free environment:", "start": 374.78, "duration": 3.04}, {"text": "\"We've only had a Whole Foods for a month, and already we don't need cops. So cool.\"", "start": 377.82, "duration": 5.0}, {"text": "Whole Foods has ceased to be a place where we can buy organic food", "start": 382.84, "duration": 3.34}, {"text": "and instead becomes a set of lofty ideals that we buy into every time we purchase that $6 bottle of Asparagus Water.", "start": 386.18, "duration": 6.959}, {"text": "That kind of branding is good for not only Whole Foods, but for television.", "start": 393.14, "duration": 3.56}, {"text": "Here the metacommentary gets pretty explicit again.", "start": 396.7, "duration": 2.8}, {"text": "People shower Craig and Tweak with money for being gay.", "start": 399.5, "duration": 3.0}, {"text": "The message is clear: the spectacle of inclusion is good for business.", "start": 402.5, "duration": 3.58}, {"text": "The episode ends with a crowd of voyeurs watching Craig and Tweek through a window,", "start": 406.08, "duration": 3.62}, {"text": " raising the question of whether the affirmation is for them or for the viewer.", "start": 409.7, "duration": 4.06}, {"text": "In the new neoliberal economy, the spectacle of inclusion is sold just like any other commodity. ", "start": 413.76, "duration": 4.96}, {"text": "We fork over some cash and, in return, we get a healthy dose of self righteousness.", "start": 418.72, "duration": 4.44}, {"text": "Slovenian theorist and curmudgeonly mountain-troll Slavoj Zizek", "start": 423.16, "duration": 3.34}, {"text": "thinks that modern political systems can be much more dangerous than they were in the days of yore", "start": 426.5, "duration": 4.78}, {"text": "because they’re just so dang pleasant.", "start": 431.28, "duration": 2.659}, {"text": "In the face of dictators, bad bosses, or the\nKKK, it’s easy to point a finger and say", "start": 433.94, "duration": 4.46}, {"text": "“Hey, that’s the bad guy, fuck him.” In\nother words, this —", "start": 438.4, "duration": 3.52}, {"text": "\"And then after we've f*cked every last one of them to death, we build a big wall.\"", "start": 441.92, "duration": 3.7}, {"text": " is easier to hate than this —", "start": 445.62, "duration": 1.76}, {"text": "\"Hello ladies, thanks for coming to our event!\"\n\"Hi!\"", "start": 447.38, "duration": 2.6}, {"text": "\"We're just tired of the way people with disabilities get treated. Can I get you some alcohol?\"", "start": 449.98, "duration": 3.4}, {"text": "Being a PC bro is still about getting laid\nand wasted,", "start": 453.38, "duration": 3.0}, {"text": "but now they have a pleasant facade to hide their real motivations.", "start": 456.38, "duration": 5.98}, {"text": "Zizek describes political correctness as ", "start": 462.36, "duration": 2.3}, {"text": "“just a form of self-discipline which doesn’t really allow you to overcome [racism, misogyny, and so on.]\"", "start": 464.66, "duration": 5.8}, {"text": "If PC culture is dangerous, it’s because it’s just a nice paint job over the same old discriminatory reality.", "start": 470.46, "duration": 10.0}, {"text": "There’s no longer a clear villain to rally against, just self-satisfying acts of social justice.", "start": 480.46, "duration": 5.78}, {"text": "The new “progressive” world of South Park is one where people regularly blow hundreds of dollars at Whole Foods,", "start": 486.24, "duration": 5.3}, {"text": "but are expected to feel good because they donated $1 to charity.", "start": 491.54, "duration": 3.78}, {"text": "Never mind the wasteful excess of your grocery\nlist, ", "start": 495.32, "duration": 2.34}, {"text": "you can wash yourself of the guilt with a token gesture of charity.", "start": 497.66, "duration": 3.44}, {"text": "\"$26 in fillet mignons, and $1 for hungry kids around the world.", "start": 501.1, "duration": 4.52}, {"text": "On the one hand, we have those who criticize neoliberalism but don't actually do anything about it.", "start": 505.62, "duration": 4.52}, {"text": "On the other, we have those who actively oppose it.", "start": 510.14, "duration": 2.54}, {"text": "Zizek argues that this kind of Whole Food style charity is the perfect marriage between these two camps —", "start": 512.68, "duration": 5.72}, {"text": "between inaction and action.", "start": 518.4, "duration": 1.96}, {"text": "You don’t actually have to change the world — change and rebellion become another commodity.", "start": 520.36, "duration": 4.78}, {"text": " Criticism is perfectly disarmed,", "start": 525.14, "duration": 2.04}, {"text": "because you can be a good neoliberal consumer,\nand still feel like you’re fighting against it.", "start": 527.18, "duration": 4.599}, {"text": "Zizek argues that rebelling against the system is tolerated, even promoted,", "start": 531.78, "duration": 3.94}, {"text": "so long as it stays within the acceptable bounds.", "start": 535.72, "duration": 2.66}, {"text": "He uses the term inter-passivity,", "start": 538.38, "duration": 1.8}, {"text": "which denotes the practice of doing things NOT in order to achieve something.", "start": 540.18, "duration": 4.2}, {"text": "\"Political correctness,” he says, \"fits the formula of ‘Let’s go on changing something all the time so that, globally,", "start": 544.38, "duration": 6.04}, {"text": "things will remain the same.’”", "start": 550.42, "duration": 1.36}, {"text": "Of course, South Park attacks the very heart of this hypocrisy.", "start": 551.78, "duration": 6.7}, {"text": "The town’s real feelings about the poor are brought to light when Whole Foods gets surrounded by the homeless.", "start": 558.48, "duration": 9.12}, {"text": "It’s not just economic hypocrisy that South Park targets.", "start": 567.6, "duration": 3.04}, {"text": " Multiculturalism becomes a kind of badge to wear, to buy into, rather than a real political project.", "start": 570.64, "duration": 5.56}, {"text": "\"What do you want?\"", "start": 576.2, "duration": 1.26}, {"text": "\"Now look, not all cops are racist trigger-happy assholes.\"", "start": 577.46, "duration": 2.98}, {"text": "\"Really? I'll bet you don't even know what 'farm to table' means.\"", "start": 580.44, "duration": 3.26}, {"text": "The denizens of South Park are still just as ignorant,", "start": 583.7, "duration": 2.72}, {"text": "but now know the benefits of feigning knowledge of other cultures.", "start": 586.42, "duration": 3.5}, {"text": "\"You know, a lot of people think that Asians decide who's gay and who's not.", "start": 589.92, "duration": 3.82}, {"text": "\"But it isn't all Asians. It's just specifically the Japanese, OK?\"", "start": 593.74, "duration": 4.16}, {"text": "\"You sure know a lot about this.\"\n\"Yes, I do.\"", "start": 597.9, "duration": 2.58}, {"text": "The show is criticizing the individual just as much as they’re calling out other shows.", "start": 600.48, "duration": 4.36}, {"text": "The metacriticism raises the question: does token inclusion really make for more inclusivity,", "start": 604.84, "duration": 5.4}, {"text": "or is it a shell of actual diversity that is meant to boost ratings rather than understand another culture?", "start": 610.24, "duration": 6.92}, {"text": "In the end, this show of tolerance is more\nabout making white liberals feel good than", "start": 617.16, "duration": 3.85}, {"text": "the marginalized people they seek to help.", "start": 621.01, "duration": 2.35}, {"text": "\"You know, there's still some people out there that say, 'What does being PC really mean?'", "start": 623.36, "duration": 3.2}, {"text": "\"Well I'll tell you what it means. It means you love nothing more than beer, working out,", "start": 626.56, "duration": 3.28}, {"text": "and that feeling you get when you rhetorically defend a marginalized community from systems of oppression.\"", "start": 629.84, "duration": 5.4}, {"text": "The PC frathouse, for all the talk about marginalized\npeople of color, is, well, entirely white.", "start": 635.24, "duration": 5.86}, {"text": "Even their fervent passion to help the disabled\nis just a cover to crush puss.", "start": 641.1, "duration": 4.02}, {"text": "French philosopher Jean Baudrillard uses the term charity cannibalism to denote the process whereby", "start": 645.12, "duration": 5.16}, {"text": "“Other people's destitution becomes\nour adventure playground...", "start": 650.28, "duration": 3.56}, {"text": "[where we continually seek to...] secure the conditions of reproduction of the catastrophe market.”", "start": 653.84, "duration": 5.38}, {"text": " According to Baudrillard, when we run out of tragedies to feel bad about, we start inventing our own.", "start": 659.22, "duration": 4.52}, {"text": "\"Why would a person with a disability not see that what I I'm trying to do is actually protect them?\"", "start": 663.74, "duration": 4.38}, {"text": "\"Sometimes, victims of oppression are so marginalized that they begin to sympathize with their oppressors.\"", "start": 668.12, "duration": 4.4}, {"text": "\"Yeah, brah!\"", "start": 672.52, "duration": 0.64}, {"text": "When PC Principle encounters a marginalized\nperson, Jimmy, who doesn’t want his help,", "start": 673.16, "duration": 4.84}, {"text": "he finds Nathan who more aptly suits his narrative of the world.", "start": 678.0, "duration": 3.44}, {"text": " Nathan plays the role of a helpless victim whose feelings of outrage reflect PC Principal’s.", "start": 681.44, "duration": 4.94}, {"text": "\"Could you tell Jimmy how you feel when people use the word 'retarded'?\"", "start": 686.38, "duration": 3.88}, {"text": "\"It hurts my feelings because I feel bad.\"\n\"... Are you serious right now?\"", "start": 690.26, "duration": 5.1}, {"text": "The point is not that using the word “retarded” is OK because someone with a disability uses it,", "start": 695.36, "duration": 4.78}, {"text": "it’s that this relation of protector-victim is always disempowering to the victim,", "start": 700.14, "duration": 4.36}, {"text": " who will only be validated by virtue of their helplessness.", "start": 704.5, "duration": 3.1}, {"text": "This is why, Zizek would argue, this sort\nof PC culture is more intolerant to other cultures:", "start": 707.6, "duration": 5.26}, {"text": "we lovingly accept everyone, so long as we can pigeonhole them into a type of difference we can consume.", "start": 712.86, "duration": 5.8}, {"text": "Nevermind that Caitlyn Jenner, who is of course a stunning and brave hero,", "start": 718.66, "duration": 3.54}, {"text": "was accused of killing a person and is critical of gay marriage,", "start": 722.2, "duration": 9.1}, {"text": "it’s much easier to congratulate ourselves as a society by plastering her on Vanity Fair. ", "start": 731.3, "duration": 4.9}, {"text": "It’s simple, it’s consumable, it sells.", "start": 736.2, "duration": 5.46}, {"text": "I should probably clarify here that people throw around the term “political correctness” and “safe space”", "start": 741.66, "duration": 5.1}, {"text": "in an entirely vague and not very helpful way. On the one end, you have some guy ", "start": 746.76, "duration": 4.28}, {"text": " for whom every social interaction resembles a 12-year-old who just learned the N-Word on X-Box Live.", "start": 751.04, "duration": 8.72}, {"text": "On the other end, you have people who confuse social justice for wanting to live in a bubble ", "start": 759.76, "duration": 3.82}, {"text": "where nothing bad happens and terrible things like slavery never existed.", "start": 763.58, "duration": 5.54}, {"text": "These people on both sides are few and far between, so please stop freaking out.", "start": 769.12, "duration": 4.52}, {"text": "South Park reliably takes down both sides of the political extreme,", "start": 773.64, "duration": 3.44}, {"text": "making fun of both Trump-esque onservativism and, well, everyone who got a liberal arts degree.", "start": 777.08, "duration": 11.0}, {"text": "What the show is really saying is that behind both sides, there lies a deep rooted narcissism.", "start": 788.08, "duration": 4.939}, {"text": "As we’ve already discussed, ", "start": 793.02, "duration": 1.52}, {"text": "a lot of buying into the PC brand is more about making yourself feel good than affecting real change. ", "start": 794.54, "duration": 5.2}, {"text": "The Whole Foods donation arc ends with Randy morphing a charity about feeding hungry kids,", "start": 799.74, "duration": 4.88}, {"text": "or sending hamsters to college, or whatever,", "start": 804.62, "duration": 2.34}, {"text": "into a charity where kids in the developing world are given iPads to protect the fragile egos of people like Randy.", "start": 806.96, "duration": 5.88}, {"text": "\"For just $1 a day, ", "start": 812.84, "duration": 1.4}, {"text": "\"one of these beautiful children will protect you from trolls and make your internet a safe space.\"", "start": 814.24, "duration": 4.78}, {"text": "And that’s what this Whole Foods activism is about:", "start": 819.02, "duration": 2.36}, {"text": "being a sell-out to the system while making meaningless gestures to protect your own sense of self-worth.", "start": 821.38, "duration": 5.12}, {"text": "Then there’s Cartman, who we’ve known for years is a terrible monster, yet suddenly adopts PC culture.", "start": 826.5, "duration": 5.82}, {"text": "But we also know he’s a pathological liar and raging narcissist, ", "start": 832.32, "duration": 3.22}, {"text": "so it makes sense that he’d use safe space\nlanguage to protect his ego.", "start": 835.54, "duration": 4.1}, {"text": "On the other side of things, we have Mr. Garrison and his fuck-em-all-to-death attitude.", "start": 839.64, "duration": 4.14}, {"text": "His version of American exceptionalism is more or less the nationalist version of the “special snowflake” complex.", "start": 843.78, "duration": 6.28}, {"text": " Convinced that America’s unique greatness is being ruined by Canadians,", "start": 850.06, "duration": 3.31}, {"text": "he tries to build a wall to protect America.", "start": 853.37, "duration": 2.03}, {"text": "What is his shock to the Canadian wall being put up first to keep HIM out", "start": 855.4, "duration": 3.44}, {"text": "but the realization that he’s not the center of the universe?", "start": 858.84, "duration": 4.52}, {"text": "In other words, ", "start": 863.36, "duration": 0.86}, {"text": "Cartman, Steven Seagal and Garrison supporters are fueled by a narcissistic obsession with themselves.", "start": 864.22, "duration": 7.84}, {"text": "Here’s where neoliberalism enters the picture again.", "start": 872.06, "duration": 2.26}, {"text": "Neoliberalism promotes a culture of consumerism centered on the individual.", "start": 874.32, "duration": 4.1}, {"text": "And nothing quite fuels that economy like self obsession en masse. What’s left is a cult of victimhood.", "start": 878.42, "duration": 8.02}, {"text": "For Mr. Garrison, you have the paranoid delusion that everyone’s out to ruin your way of life and steal your job.", "start": 886.44, "duration": 7.86}, {"text": "For the show’s PC crowd,  it’s the mistaken idea that not being a victim of harassment", "start": 894.3, "duration": 4.38}, {"text": "means having someone entertain your’s illusions of grandeur.", "start": 898.68, "duration": 2.66}, {"text": "For those already privileged, it means aspiring to victimhood. In the end, everyone wants to hang reality.", "start": 901.34, "duration": 8.68}, {"text": "The point is not that everyone advocating for safe spaces, ", "start": 910.02, "duration": 3.0}, {"text": "or everyone who loves their country, is one of these extreme caricatures, ", "start": 913.02, "duration": 3.74}, {"text": "but that otherwise reasonable logic has been caught up in a whirlwind of societal bullshit.", "start": 916.76, "duration": 5.9}, {"text": "The creators of South Park probably don’t hate every aspect of PC culture,", "start": 922.66, "duration": 4.04}, {"text": "but the shallow versions of it propagated in the mainstream media.", "start": 926.7, "duration": 6.74}, {"text": " After all, PC Principal has a sort of redemption: ", "start": 933.44, "duration": 2.58}, {"text": "after learning he’s been manipulated by ads, he goes on a rampage murdering all the “inauthentic” PC bros. ", "start": 936.02, "duration": 6.1}, {"text": "Creators Matt Stone and Trey Parker are also acutely aware of their own privileged position,", "start": 942.12, "duration": 4.4}, {"text": " nodding to this in the show:", "start": 946.52, "duration": 1.5}, {"text": "\"We're two privileged straight white boys who have theirs laughs about things we've never had to deal with.\"", "start": 948.02, "duration": 3.98}, {"text": "And the finale makes it explicit that PC Principal is here to stay, with Stan commenting:", "start": 952.0, "duration": 4.76}, {"text": "\"This is gonna be really hard.\"", "start": 956.76, "duration": 1.36}, {"text": "Because, well, it is.", "start": 958.12, "duration": 1.48}, {"text": "Not wanting to seem like a bigot while avoiding the trappings of phony inclusion is really hard. ", "start": 959.6, "duration": 10.46}, {"text": "With season 20 around the corner, what will happen?", "start": 970.06, "duration": 2.26}, {"text": "Will the show yield to the pressures of a changing society and reorient itself completely? ", "start": 972.32, "duration": 6.42}, {"text": "Or will they stick their middle finger firmly in the air and double down on their off-color roots?", "start": 978.74, "duration": 11.0}, {"text": "South Park has to navigate our current political climate, whether they like it or not,", "start": 989.74, "duration": 3.7}, {"text": " and as a TV show, well, they need ads. And for that matter, so do we!", "start": 993.44, "duration": 3.94}]