[{"text": "This video was sponsored by World of Warships. If you, Jimmy, have ever wanted to sail the ocean blue in", "start": 5.02, "duration": 6.199}, {"text": "1942, then find out more after the video", "start": 11.83, "duration": 2.42}, {"text": "When the Japanese bombed Pearl Harbor, as we all know, it caught America off guard", "start": 14.769, "duration": 4.31}, {"text": "The attack hurt, and the surprise of it shocked the entire country into", "start": 19.3, "duration": 4.309}, {"text": "mobilization. But mobilization takes time. The Pacific Ocean is", "start": 23.92, "duration": 4.099}, {"text": "big, so big that even after the day that will live in infamy", "start": 28.539, "duration": 3.98}, {"text": "for half a year both sides just kind of", "start": 32.8, "duration": 2.779}, {"text": "shook their hands at each other while getting ready. In that six-month time Japan was feeling pretty cocky; they thought the US would be easy", "start": 35.739, "duration": 7.58}, {"text": "pushovers. So in June", "start": 43.48, "duration": 1.98}, {"text": "1942,", "start": 45.46, "duration": 0.75}, {"text": "they decided to go knock the Americans off of their base on the island of Midway.", "start": 46.21, "duration": 4.7}, {"text": "It was to be a great victory for the Empire. Spoiler.", "start": 50.91, "duration": 3.689}, {"text": "It wasn't. It was not at all. The Battle of Midway resulted in a resounding Japanese defeat. All four", "start": 54.6, "duration": 7.02}, {"text": "Carriers they had in the battle were lost literally six months into the war. This was the turning point for when Japan", "start": 62.05, "duration": 6.799}, {"text": "started to fall. So what if in an alternate timeline, Japan wasn't incompetent and with their twice as big Navy,", "start": 69.1, "duration": 6.98}, {"text": "actually won a victory against America at the Battle of Midway?", "start": 76.42, "duration": 3.44}, {"text": "How would this change the course of the war? Well it is an alternate 1942. Let's say somehow", "start": 80.2, "duration": 5.75}, {"text": "Japan has won", "start": 86.56, "duration": 1.19}, {"text": "the battle. What specifically needs to change for this to be accomplished?", "start": 87.75, "duration": 3.329}, {"text": "Well Jimmy,", "start": 91.2, "duration": 0.45}, {"text": "there were so many things the Japanese did wrong during the battle that I'm not going to bore you with every specific", "start": 91.65, "duration": 6.0}, {"text": "mistake that resulted in their fleet going kaplooey. Japan", "start": 97.93, "duration": 3.68}, {"text": "just really overestimated their capabilities against America. So, alternate timeline.", "start": 101.61, "duration": 5.279}, {"text": "Let's just say that all of the American fleet at this battle is absolutely destroyed. The greatest threat of all occurs:", "start": 106.89, "duration": 6.479}, {"text": "The Japanese are now primed to invade the island of Midway.", "start": 113.619, "duration": 3.83}, {"text": "Phase 2 has begun. In just a few days after the American Navy is obliterated,", "start": 117.61, "duration": 4.609}, {"text": "Japanese forces stormed the beaches of Midway and", "start": 122.95, "duration": 2.72}, {"text": "they're mowed down. . .", "start": 126.52, "duration": 1.26}, {"text": "Just. Entirely. Annihilated. You see, even if Japan did somehow win the", "start": 127.78, "duration": 5.209}, {"text": "Naval Battle of Midway, there was no way they could ever", "start": 133.359, "duration": 3.139}, {"text": "actually take the island. In the Pacific War, even if Japan had more forces defending an island, the Americans would still take it.", "start": 136.959, "duration": 7.669}, {"text": "So a better equipped and bigger American defense against an unprepared poorly executed amphibious assault by Japan,", "start": 144.939, "duration": 6.68}, {"text": "Just results in failure.", "start": 151.989, "duration": 1.461}, {"text": "I was going to say at least the Battle of Midway would be a political failure for America,", "start": 153.45, "duration": 4.649}, {"text": "however, after Japan flops onto the beaches of Midway,", "start": 158.2, "duration": 2.689}, {"text": "I'd say it kind of evens out. A failure at Midway would be a kick in the shins,", "start": 160.889, "duration": 4.26}, {"text": "but the next inevitable naval victory against Japan makes everyone feel better. So what's the lesson here kiddies?", "start": 165.28, "duration": 6.079}, {"text": "What's the point? The thing I find interesting in history is sometimes", "start": 171.37, "duration": 3.5}, {"text": "they're simply a situation that is never changed. My cat is never going to shut up at 3:00 a.m.", "start": 174.87, "duration": 5.22}, {"text": "and Japan was always going to lose the Pacific War the second they decided to attack the United States.", "start": 180.09, "duration": 6.269}, {"text": "It couldn't replace the fleet it had and that was its ultimate downfall. For every ship", "start": 186.79, "duration": 6.139}, {"text": "Japan sunk, America could replace it with five. For every ship America sunk, Japan's fleet just got smaller.", "start": 192.93, "duration": 6.899}, {"text": "We often have a misconception of the War in the Pacific that the war was of equals when it wasn't. From 1942 to", "start": 200.019, "duration": 7.399}, {"text": "1945, Japan was trying to stop a boulder from crushing it. As much energy or men or planes it threw at the", "start": 207.699, "duration": 6.529}, {"text": "situation, the giant boulder was going to fall and kill Japan eventually.", "start": 214.389, "duration": 4.46}, {"text": "It was just a bad luck of cards. The best strategy to winning the game was simply never playing in the first place.", "start": 218.849, "duration": 7.08}, {"text": "This video was sponsored by World of Warships. For those that don't know, World of Warships is an online multiplayer game", "start": 229.81, "duration": 6.109}, {"text": "where you command a fleet featuring some of history's most iconic war vessels.", "start": 235.919, "duration": 3.99}, {"text": "There's a diverse range of ship classes you can choose from to win against players online.", "start": 239.909, "duration": 3.96}, {"text": "It's a great time if you like ships . . .", "start": 244.239, "duration": 1.71}, {"text": "or enjoy watching the ships of your enemies sink slowly into the abyss. Anyway,", "start": 245.949, "duration": 4.25}, {"text": "Wargaming came to me to promote a new offer for new players. By clicking the link down below,", "start": 250.539, "duration": 4.25}, {"text": "the first 300 viewers that use the code PLAYWARSHIPS2018 can get", "start": 254.889, "duration": 4.64}, {"text": "250 doubloons (don't drop them), 1 million credits, and the HMS Campbellton premium ship, along with one port slot", "start": 259.93, "duration": 6.679}, {"text": "and three days", "start": 266.82, "duration": 0.72}, {"text": "of premium game time. So if this piques your interest then click on the link down below to get started. If it doesn't then why", "start": 267.54, "duration": 5.82}, {"text": "did you just watch this whole thing? This is Cody of Alternate History Hub.", "start": 273.36, "duration": 3.899}]