[{"text": "Thanks to Surfshark VPN for sponsoring this video.", "start": 0.0, "duration": 4.0}, {"text": "Seoul, South Korea and Tokyo, Japan", "start": 4.0, "duration": 3.68}, {"text": "Not only are they two of the most important cities in Asia, they're two of the most important cities in the world.", "start": 7.68, "duration": 6.32}, {"text": "Both the biggest in their respective countries, and yeah, both dominate politically, economically, and culturally in their respective countries.", "start": 14.0, "duration": 8.8}, {"text": "It's really hard not to be overshadowed by them.", "start": 22.8, "duration": 2.16}, {"text": "About 25% of all Japanese residents live in the Tokyo metropolitan area. Oh yeah, and that metropolitan area is THE LARGEST IN THE WORLD, with 37.8 million people.", "start": 24.96, "duration": 14.96}, {"text": "Sooooo many people.", "start": 39.92, "duration": 2.0}, {"text": "But Seoul has the fifth largest metropolitan area in the world. Look at all THOSE people. Wow.", "start": 41.92, "duration": 5.92}, {"text": "It has a population of around 25.6 million people.", "start": 47.84, "duration": 4.4}, {"text": "And even though it only makes up about 12% of South Korea’s total area, it’s home to almost HALF of South Korea’s total population. Woahness.", "start": 52.24, "duration": 9.6}, {"text": "Both are the capitals of their respective countries.", "start": 61.84, "duration": 2.48}, {"text": "Both are filled with magnificent modern buildings that could easily provide a reliable backdrop for any film set in the near-future. Why?", "start": 64.32, "duration": 9.92}, {"text": "Because war devastated both cities during the 20th century.", "start": 74.24, "duration": 3.44}, {"text": "More on that later. Even though both are megacities, both are surprisingly clean and sleek.", "start": 77.68, "duration": 6.4}, {"text": "Both are all about trade, leading the world in both exports and imports.", "start": 84.08, "duration": 5.04}, {"text": "It’s easy to get around in both cities. Both have amazing public transportation, and huge rail networks.", "start": 89.12, "duration": 8.0}, {"text": "Tokyo has the busiest metro system in the world, and Seoul has the third busiest.", "start": 97.12, "duration": 5.68}, {"text": "Tokyo is famous for having so many people packed onto subways during rush hour that they literally have to be pushed onto trains to fit.", "start": 102.8, "duration": 8.4}, {"text": "Yes, \"pusher\" is a real job title.", "start": 111.2, "duration": 2.8}, {"text": "That's a real position.", "start": 114.0, "duration": 0.88}, {"text": "Public transport is cheaper in Seoul.", "start": 114.88, "duration": 2.88}, {"text": "Both are two of the most visited cities in the world. (T-8th most, S- 10th most)", "start": 117.76, "duration": 3.04}, {"text": "Both have a fairly homogeneous ethnic population. Most Seoulites are Korean, and most Edokkos are Yamato Japanese.", "start": 120.8, "duration": 9.92}, {"text": "Now, this is starting to change since the foreign born population in both cities has steadily increased in recent years.", "start": 130.72, "duration": 6.24}, {"text": "Both have easy access to the Pacific Ocean.", "start": 136.96, "duration": 2.24}, {"text": "Specifically, Seoul is near the Yellow Sea, whereas Tokyo is on Tokyo Bay.", "start": 139.2, "duration": 7.12}, {"text": "Tokyo is also on the Kanto Plain, the largest area of fairly flat land in all of Japan.", "start": 146.32, "duration": 6.32}, {"text": "Still, both cities are near mountains. At least three mountains are all within one hour driving distance from Tokyo, and Seoul is actually bordered by eight mountains.", "start": 152.64, "duration": 9.92}, {"text": "Mount Fuji, Japan’s tallest and most iconic mountain, is sometimes visible from Tokyo.", "start": 162.56, "duration": 6.32}, {"text": "Tokyo also has several outlying islands, some of which are over a thousand miles, or 1600 km away from the city center.", "start": 168.88, "duration": 9.6}, {"text": "Look at that. Tokyo controls all those islands way way out in the Pacific Ocean.", "start": 178.48, "duration": 6.16}, {"text": "While earthquakes occur in both cities, Tokyo has plenty more, with it being in the Ring of Fire and all.", "start": 184.64, "duration": 6.4}, {"text": "Speaking of the Ring of Fire, Tokyo is also near volcanoes, including the aforementioned Mount Fuji. Seoul is not.", "start": 191.04, "duration": 8.88}, {"text": "Tokyo gets more precipitation. (1,530 mm or 60.2 inches in T, 1,373 mm or 54.1 inches in S)", "start": 199.92, "duration": 1.68}, {"text": "Rainfall in both cities is affected by the monsoons, the prevailing winds that bring lots of rain in the summer but dry weather in the winter.", "start": 201.6, "duration": 7.68}, {"text": "However, Seoul has a warm continental climate whereas Tokyo has a warm oceanic climate.", "start": 209.28, "duration": 6.08}, {"text": "It gets much colder in Seoul in the winter, and it gets a lot more snow. However, Seoul has more sunny days than Tokyo.", "start": 215.36, "duration": 8.16}, {"text": "Residents of both have access to universal heathcare.", "start": 223.52, "duration": 3.68}, {"text": "Both have hosted the Olympics", "start": 227.2, "duration": 1.92}, {"text": "Well Tokyo was supposed to host in 1940, but it got cancelled.", "start": 229.12, "duration": 3.52}, {"text": "But then it hosted in 1964", "start": 232.64, "duration": 2.16}, {"text": "and it's hosting next year.", "start": 234.8, "duration": 2.32}, {"text": "Seoul has hosted just once. But Seoul has hosted the FIFA World Cup and Tokyo has not.", "start": 237.12, "duration": 6.08}, {"text": "Both have a bike sharing system.", "start": 243.2, "duration": 2.0}, {"text": "Both do not have laws against drinking alcohol in public.", "start": 245.2, "duration": 3.44}, {"text": "Both have a stock exchange.", "start": 248.64, "duration": 1.6}, {"text": "The two are about 1,152 km, or 716 miles apart. Or about a two hour flight.", "start": 250.24, "duration": 8.08}, {"text": "Seoul is much older than Tokyo. A lot older.", "start": 258.32, "duration": 3.04}, {"text": "The earliest settlers of what would become Seoul got there around 18 BC.", "start": 261.36, "duration": 5.12}, {"text": "Tokyo, which used to be called Edo, didn’t come around until almost 1500 years later. It began as a small fishing village around 1457.", "start": 266.48, "duration": 9.52}, {"text": "By that time, Seoul was the capital of the Kingdom of Great Joseon, which comprised of the entire Korean peninsula.", "start": 276.0, "duration": 6.16}, {"text": "In the 1500s, Edo steadily grew due to having a natural geographic advantage compared with other Japanese villages.", "start": 282.16, "duration": 7.76}, {"text": "Probably due to this, Tokugawa Ieyasu , the first shogun and founder of the Tokugawa shogunate government in Japan, chose Edo to be the capital and relocated there.", "start": 289.92, "duration": 10.48}, {"text": "During the Tokugawa period, from 1603 to 1868, Edo grew quite a bit, despite major setbacks like the Great Fire of Meireki of January 1657, which destroyed most of the city.", "start": 300.4, "duration": 14.64}, {"text": "Still, by 1721 Edo had become the world’s largest city, with an estimated 1.1 million people.", "start": 315.04, "duration": 7.44}, {"text": "Meanwhile, Seoul had also grown. During the Joseon Dynasty it was called Hanyang and later Hanseong.", "start": 322.48, "duration": 8.0}, {"text": "In 1868, the Imperial Army took over Edo and ended the Tokugawa government.", "start": 330.48, "duration": 6.48}, {"text": "The violence surrounding this took a big toll, and hundreds of thousands fled the city.", "start": 336.96, "duration": 5.04}, {"text": "Once in control, the Imperial Army renamed Edo Tokyo, which meant “the eastern capital,” and put 16-year old Emperor Meiji in charge.", "start": 342.0, "duration": 10.64}, {"text": "This was called the Meiji Restoration, and during what became known as the Meiji Era, Tokyo modernized, ending its isolation with the rest of the world and quickly industrializing.", "start": 352.64, "duration": 10.72}, {"text": "Not long after this, the same thing happened in Seoul. After hundreds of years in isolation under the Joseon Dynasty, Seoul opened its arms to foreigners and also began to modernize and industrialize.", "start": 363.36, "duration": 12.24}, {"text": "Seoul was the first East Asian city to have electricity.", "start": 375.6, "duration": 3.6}, {"text": "But then, in 1910, the Empire of Japan took over the Korean Empire. And just like that, Tokyo ruled over Seoul, but kept Seoul as its new colony’s capital.", "start": 379.2, "duration": 11.04}, {"text": "While under colonial rule, the Japanese called Seoul Keijo.", "start": 390.24, "duration": 3.84}, {"text": "On September 1, 1923, a devastating earthquake killed up to 3% of Tokyo’s population and left an additional 2 million Tokyo residents homeless.", "start": 394.08, "duration": 10.48}, {"text": "It destroyed around 75% of all buildings in Tokyo.", "start": 404.56, "duration": 3.6}, {"text": "Due to racism, angry survivors took revenge on Koreans who lived in the city, killing several thousand.", "start": 408.16, "duration": 5.76}, {"text": "Eventually, Tokyo rebuilt completely, building much stronger and more modern buildings, only to be firebombed by the United States Army Air Force over and over during World War II.", "start": 413.92, "duration": 11.04}, {"text": "Throughout the later stages of the war, most of eastern Tokyo was on fire.", "start": 424.96, "duration": 4.0}, {"text": "The air raids killed an estimated 100,000 Tokyo residents and destroyed about a quarter of all buildings in Tokyo at the time.", "start": 428.96, "duration": 7.2}, {"text": "After Japan surrendered, the Allies liberated Korea, and only then did Seoul get its current name.", "start": 436.16, "duration": 6.64}, {"text": "Seoul literally means capital city. Korea soon split into two, however, and Seoul became the capital of the Republic of Korea, aka South Korea, in 1948.", "start": 442.8, "duration": 11.04}, {"text": "During the Korean War, which began two years later, Seoul was controlled by both North Korea and South Korea, changing hands four times.", "start": 453.84, "duration": 8.64}, {"text": "The Korean War devastated the city, leaving most of it in ruins.", "start": 462.48, "duration": 4.08}, {"text": "Hundreds of thousands of refugees from North Korea also fled to Seoul, causing a homelessness crisis there.", "start": 466.56, "duration": 6.48}, {"text": "A big reason why the refugees went to Seoul is because Seoul was and still is just 35 miles from the DMZ, or Demilitarized Zone, the heavily fortified strip of land between North Korea and South Korea set up at the end of the war.", "start": 473.04, "duration": 16.88}, {"text": "Even today, Seoulites know that if North Korea ever were to attack again, they’d be the first target.", "start": 489.92, "duration": 6.08}, {"text": "Strangely though, most of them don’t really seem that worried about it.", "start": 496.0, "duration": 3.44}, {"text": "So in the years following World War II and the Korean War, something really cool happened to both cities. They both went through dramatic transformations.", "start": 499.44, "duration": 9.04}, {"text": "It first happened in Tokyo. After its citizens rebuilt, again, it was a major part of the Japanese economic miracle, a record period of economic growth that turned Japan into the world’s second largest economy.", "start": 508.48, "duration": 14.16}, {"text": "Meanwhile, Seoul had its Miracle on the Han River, named after the great river that runs through the city, which was also a record period of economic growth that turned South Korea into one of the richest countries in the world.", "start": 522.64, "duration": 13.36}, {"text": "While Tokyo’s economy has slowed down in recent decades, Seoul’s keeps on chugging along.", "start": 536.0, "duration": 5.76}, {"text": "Other differences between the two cities today?", "start": 541.76, "duration": 2.32}, {"text": "While both are definitely crowded, Seoul has a higher population density.", "start": 544.08, "duration": 4.96}, {"text": "Its population density is almost twice that of New York City.", "start": 549.04, "duration": 4.24}, {"text": "Seoul has much younger residents, on average. (S-39, T-44.7)", "start": 553.28, "duration": 2.72}, {"text": "While the majority of residents in both cities are not religious, the two biggest religions for those who are in Seoul are Christianity and Buddhism, and the two biggest for those who are in Tokyo are Shinto and Buddhism.", "start": 556.0, "duration": 13.6}, {"text": "Tokyo residents speak Japanese and Seoul residents speak Korean, of course.", "start": 569.6, "duration": 4.48}, {"text": "Seoul has a much lower cost of living. In fact, everything in Tokyo is around 74% more expensive than in Seoul, on average.", "start": 574.08, "duration": 10.24}, {"text": "Tokyo has less pollution. While both are two of the safest megacities in the world, Tokyo has less crime, and while both have heavy traffic, Tokyo has slightly less traffic.", "start": 584.32, "duration": 11.6}, {"text": "While Tokyo is known for electronic device manufacturing, major industries there also include financial services, publishing, transportation, and retail.", "start": 595.92, "duration": 10.8}, {"text": "Major industries in Seoul also include electronic device manufacturing and transportation, but also telecommunications and chemicals.", "start": 606.72, "duration": 8.96}, {"text": "Tokyo is home to the headquarters of more large companies than Seoul.", "start": 615.68, "duration": 5.28}, {"text": "Well, with 613 large companies based there, it has more headquarters of large companies than any other city in the world.", "start": 620.96, "duration": 7.76}, {"text": "And yeah, Tokyo has a much higher GDP per capita (T- $64,269, S- $43,655 USD).", "start": 628.72, "duration": 3.44}, {"text": "Tokyo also has a higher minimum wage (T- 1,000 yen($9.22) an hour, S- 8,350 won ($7.37) an hour).", "start": 632.16, "duration": 2.4}, {"text": "Tokyo has better food selection. Don’t get me wrong, Seoul has plenty of choices and is known for its above average street food,", "start": 634.56, "duration": 8.56}, {"text": "but Tokyo just has any type of food you could possibly ever want.", "start": 643.12, "duration": 3.68}, {"text": "Seoul is the birthplace of both K-pop, or Korean pop music, and K-dramas, or Korean dramas, which have been hugely influential around the world.", "start": 646.8, "duration": 10.96}, {"text": "Yep, Seoul is singlehandedly responsible for what’s known as the Korean Wave, or the increase in the global popularity of South Korean culture ever since the 1990s.", "start": 657.76, "duration": 12.64}, {"text": "Tokyo is the birthplace of both anime, the hugely influential style of Japanese film and TV animations, and manga, the hugely influential style of Japanese comic books and graphic novels.", "start": 670.4, "duration": 12.56}, {"text": "Tokyo famously is the place where otakus gather.", "start": 682.96, "duration": 4.32}, {"text": "Otaku is kind of a negative thing journalists call young folks who are obsessed with superficial things like computers, video games, and of course anime and manga, to a point where it hurts their social lives.", "start": 687.28, "duration": 11.6}, {"text": "Tokyo might just be the biggest consumer paradise in the world. Anything you want you can find in Tokyo.", "start": 698.88, "duration": 7.52}, {"text": "Tokyo has the tallest tower in the world, the Tokyo Skytree.", "start": 706.4, "duration": 5.04}, {"text": "It’s the second tallest structure in the world after the Burj Khalifa.", "start": 711.44, "duration": 3.6}, {"text": "Ah, but Seoul has the fifth tallest BUILDING in the world, The Lotte World Tower.", "start": 715.04, "duration": 6.0}, {"text": "Major attractions in Tokyo also include the Tokyo Tower, the Akihabara shopping district, The Ginza shopping district, The Imperial Palace, The Meiji Shrine, and Sensō-ji, Tokyo’s oldest temple.", "start": 721.04, "duration": 14.4}, {"text": "When most people think of Tokyo, one of the first things that probably comes to mind is Shibuya, the famous commercial and business district that features the famous scramble crossing, as seen in films like Lost in Translation.", "start": 735.44, "duration": 11.2}, {"text": "The Shibuya crossing is the busiest pedestrian crossing in the world.", "start": 746.64, "duration": 4.16}, {"text": "Major attractions in Seoul include Gyeongbokgung Palace, Changdeokgung Palace, Bukchon Hanok Village, Myeongdong Shopping Street, and Namsan Park, which is on Namsan Mountain and has the Namsan Seoul Tower.", "start": 750.8, "duration": 16.4}, {"text": "And don’t forget the Gangnam District, made famous by this really obscure song (Gangnam Style). 3.4 billion views? Not bad.", "start": 767.2, "duration": 7.12}, {"text": "Seoul is arguably the plastic surgery capital of the world. Indeed, many Seoul residents seem obsessed with appearance.", "start": 774.32, "duration": 8.48}, {"text": "And yep, Seoul is also K-Beauty central, globally known for its skin-care products.", "start": 782.8, "duration": 6.4}, {"text": "Tokyo is way less conformist than Seoul. More Tokyo residents do their own thing and have their own unique style.", "start": 789.2, "duration": 6.8}, {"text": "Tokyo is where Japanese street fashion thrives. It’s not only known for its wide variety of fashion, but often extreme and over the top fashion styles.", "start": 796.0, "duration": 9.76}, {"text": "Tokyo is far superior when it comes to vending machines. They are everywhere and they sell just about anything.", "start": 805.76, "duration": 9.04}, {"text": "I mean, look at those. Holy crap. They’re amazing. Although I think the robots are slowly taking over the city.", "start": 814.8, "duration": 6.24}, {"text": "While both cities have ridiculously fast internet, Tokyo has some of the fastest internet speeds in the world.", "start": 821.04, "duration": 6.16}, {"text": "Other random facts?\n \nIncheon International Airport, near Seoul, is often rated as the best airport in the world.", "start": 827.2, "duration": 5.36}, {"text": "Both Seoul and Tokyo are known for their cherry blossom festivals.", "start": 832.56, "duration": 5.6}, {"text": "Cuddle Cafes, or places you can go to pay someone to cuddle with you, are big in Tokyo.", "start": 838.16, "duration": 7.12}, {"text": "Tokyo also is known for its very tiny apartments, as well as Capsule Hotels, which feature lots of extremely small “rooms,” that aren’t even big enough to stand up in.", "start": 845.28, "duration": 12.8}, {"text": "I think I’d bump my head sitting down in one of those things.", "start": 858.08, "duration": 2.72}, {"text": "Ok, this one is an opinion. I think Seoul has more exciting architecture.", "start": 860.8, "duration": 4.56}, {"text": "Look no further than the Dongdaemun Design Plaza, which is one of the coolest structures I’ve ever seen.", "start": 865.36, "duration": 6.24}, {"text": "Seoul kind of has that reputation as a more serious, hard-working city compared with the party-like atmosphere of Tokyo, but don’t get me wrong, they still party hard on the weekends in Seoul.", "start": 871.6, "duration": 11.2}, {"text": "In conclusion, the more you get to know both cities, the more you realize just how incredibly different they are.", "start": 882.8, "duration": 6.48}, {"text": "And if you are ever lucky enough to visit either city, be sure to spend at least a week or two in each.", "start": 889.28, "duration": 6.0}, {"text": "And if you ever are lucky enough to LIVE in either city, remember how lucky you are, because according to many experts, residents of both enjoy some of the highest quality of life of all cities in the world.", "start": 895.28, "duration": 9.76}, {"text": "This video is brought to you by Surfshark VPN.", "start": 906.24, "duration": 4.16}, {"text": "I've been using Surfshark VPN for a few weeks now", "start": 910.48, "duration": 2.96}, {"text": "and I love it.", "start": 913.44, "duration": 1.36}, {"text": "I've actually had a faster internet connection using it.", "start": 914.8, "duration": 2.8}, {"text": "Surfshark VPN helps fight price discrimination.", "start": 917.6, "duration": 3.36}, {"text": "If you don't know what price discrimination is", "start": 920.96, "duration": 2.24}, {"text": "it's a widespread tactic of flight ticket sites, hotel", "start": 923.2, "duration": 4.16}, {"text": "and apartment rental portals, as well as car rental providers", "start": 927.36, "duration": 2.88}, {"text": "They rip you off based on where your IP address is.", "start": 930.24, "duration": 4.88}, {"text": "Based on what country you're in.", "start": 935.12, "duration": 1.6}, {"text": "Yeah, Surfshark will help you solve that issue.", "start": 936.72, "duration": 2.08}, {"text": "Also, you can avoid internet censorship", "start": 938.8, "duration": 2.24}, {"text": "in places like China.", "start": 941.04, "duration": 1.12}, {"text": "If you travel to countries where they censor the internet, change the countries you are connected to.", "start": 942.16, "duration": 4.56}, {"text": "And that's it. You can access anything you want and the government won't find out.", "start": 946.72, "duration": 3.6}, {"text": "Surfshark VPN also has a hack lock feature.", "start": 950.48, "duration": 2.88}, {"text": "and it secures your sensitive data.", "start": 953.36, "duration": 2.24}, {"text": "Here is the link and it's in my description.", "start": 955.6, "duration": 2.24}, {"text": "Enter promo code MRBEAT and you'll get 83% off and one extra month for free.", "start": 957.84, "duration": 5.52}, {"text": "As always, I apologize for any mispronunciations, but please comment below to tell me how badly I mispronounced stuff and call me an idiot while you’re at it.", "start": 963.36, "duration": 9.36}, {"text": "Which city do YOU like better?", "start": 972.72, "duration": 1.6}, {"text": "Seoul or Tokyo?", "start": 974.4, "duration": 1.76}, {"text": "I got a lot of suggestions for this one.", "start": 976.16, "duration": 1.84}, {"text": "I'm glad I finally got to it.", "start": 978.0, "duration": 1.52}, {"text": "If you liked this video, you might also check out", "start": 979.52, "duration": 2.4}, {"text": "my Sao Paulo/Rio de Janeiro video", "start": 981.92, "duration": 2.72}, {"text": "or my Sydney/Melbourne video.", "start": 984.64, "duration": 2.8}, {"text": "And finally a shout out", "start": 987.52, "duration": 1.44}, {"text": "to my friends Marc and Erika", "start": 988.96, "duration": 2.48}, {"text": "who looked over the script for me, as well as my", "start": 991.44, "duration": 2.32}, {"text": "students in real life who love Japanese and Korean culture.", "start": 993.76, "duration": 2.88}, {"text": "James, Andrea, and Dylan.", "start": 996.64, "duration": 1.76}, {"text": "Thank you so much for watching!", "start": 998.4, "duration": 1.431}]