[{"text": "LINUS: We asked you our faithful community why you think Mac OS is the bomb.", "start": 0.0, "duration": 5.24}, {"text": "And we compiled this list of the 10 ways that Mac OS really is just plain better.", "start": 5.54, "duration": 7.5}, {"text": "A ridge wallet is a sleek way to keep wallet bulge down thanks to its compact frame and RFID blocking inner plates.", "start": 13.84, "duration": 7.16}, {"text": "Use the offer code in the video description to save 10% on your ridge wallet and get free world-wide shipping!", "start": 21.0, "duration": 6.24}, {"text": "[INTRO]", "start": 27.24, "duration": 9.04}, {"text": "Number one is a big one: The ecosystem that apple has created.", "start": 36.3, "duration": 4.0}, {"text": "I mean, the fact that you could have your phone, laptop, desktop, and even a watch and then have your data, documents, photos", "start": 40.6, "duration": 7.3}, {"text": "I mean even copy paste or open websites", "start": 48.02, "duration": 2.22}, {"text": "just move seamlessly from one to the other via handoff and iCloud", "start": 50.24, "duration": 4.32}, {"text": "is so cool that I can almost forgive apple for calling it \"magical\".", "start": 54.6, "duration": 5.22}, {"text": "iMessage is closely realted, but came up specifically a lot in your comments.", "start": 59.82, "duration": 5.12}, {"text": "Being able to text and call from any of your devices was a standout feature for many of you", "start": 65.0, "duration": 5.84}, {"text": "and, yet another cool one that's coming up in the upcoming build of Mac OS Catalina is approve with Apple Watch.", "start": 70.88, "duration": 7.0}, {"text": "Which lets you authenticate by clicking your watch, instead of typing in your password.", "start": 77.88, "duration": 5.2}, {"text": "Another part of the ecosystem that results in \"it just works\" or \"its magic\"", "start": 83.62, "duration": 5.14}, {"text": "Is the first party peripherals. They all just work.", "start": 89.32, "duration": 3.44}, {"text": "With little to no initial setup, and have the great feel and functionality that almost make them must-haves.", "start": 92.76, "duration": 6.76}, {"text": "Finally, we can't forget about AirDrop.", "start": 99.56, "duration": 2.72}, {"text": "Apple's wireless file beaming solution that kinda sorta makes up for the inability to get certain files off an iPhone over USB.", "start": 102.34, "duration": 7.18}, {"text": "Kind of.", "start": 110.02, "duration": 0.6}, {"text": "Number two: easy navigation and organization.", "start": 111.54, "duration": 3.2}, {"text": "Mission Control, Apple's visual app manager lets you see what you have open, as well as create virtual desktops.", "start": 114.74, "duration": 6.88}, {"text": "Having multiple desktops is great when you have only a single screen looking at you Macbooks.", "start": 121.68, "duration": 5.1}, {"text": "But, you need to keep multiple applications or even multiple workspaces organized with only a single swipe needed to", "start": 126.96, "duration": 6.98}, {"text": "swich between them. Speaking of swiping apples trackpads are freaking amazing", "start": 134.06, "duration": 4.38}, {"text": "I've said it before a lot but Apple has nailed the trackpad in every way.", "start": 139.14, "duration": 6.76}, {"text": "Feel, functionality and especially the gestures the most amazing thing about Apple's gestures", "start": 145.9, "duration": 6.12}, {"text": "isn't that they exist or how much you can do with them. I mean, there's lots of gestures on Windows, too.", "start": 152.22, "duration": 5.54}, {"text": "It's just that they're intuitive enough that people will actually use them.", "start": 157.92, "duration": 4.9}, {"text": "Number Three is Spotlight, a quick Command + Space bar allows you to find just about anything on your Mac or anywhere else", "start": 163.1, "duration": 6.12}, {"text": "Need directions to the nearest restaurant? Easy. Forgot where you put your master's thesis due Monday? Bam. Spotlights' found it.", "start": 170.4, "duration": 6.41}, {"text": "That recipe is in metric and all your baking supplies are Imperial. Poof. Convert it.", "start": 177.02, "duration": 5.66}, {"text": "It's a great tool and it's ultra fast!", "start": 182.68, "duration": 2.44}, {"text": "Number four is the ready to run experience.", "start": 185.73, "duration": 2.509}, {"text": "I mean,", "start": 188.239, "duration": 0.511}, {"text": "There are very few things that an average user would need to install to be able to deal with most work or casual situations", "start": 188.75, "duration": 6.659}, {"text": "Garage Band, iMovie, and Photos are already included to help your simple creative projects get started. And, Apple", "start": 195.9, "duration": 7.13}, {"text": "includes their basic but functional productivity suite for free while Windows can't even open a PowerPoint", "start": 203.22, "duration": 7.129}, {"text": "until you install separate software.", "start": 210.81, "duration": 2.0}, {"text": "Another big inclusion is Apple's Preview.", "start": 213.2, "duration": 2.58}, {"text": "It's an PDF Viewer, it's an image file converter, it slices it dices it, even lets you preview", "start": 215.78, "duration": 5.46}, {"text": "video files in Finder, and fill out forms and sign them too.", "start": 221.46, "duration": 4.44}, {"text": "Number five is BootCamp.", "start": 225.9, "duration": 1.52}, {"text": "Got a Windows laptop and one around a Mac app?", "start": 227.42, "duration": 2.42}, {"text": "You're plumb out of luck. But on the flip side, every Mac can be a Windows or Linux machine.", "start": 230.37, "duration": 5.509}, {"text": "Now there are obvious uses for this like if you're a developer and you want to check compatibility.", "start": 235.879, "duration": 3.75}, {"text": "Or if you want to fire up the odd game.", "start": 239.79, "duration": 2.12}, {"text": "But, ultimately, the way people use it boils down to the individual user,", "start": 242.16, "duration": 3.229}, {"text": "and there's no doubt that it gives a lot of extra flexibility to Mac users. Number six is \"it just works\"", "start": 245.639, "duration": 7.58}, {"text": "but specifically for developers.", "start": 253.5, "duration": 2.239}, {"text": "We must have a lot of developers in our audience because there was a VERY vocal group that pointed out,", "start": 255.93, "duration": 5.66}, {"text": "to the point where,", "start": 262.23, "duration": 1.69}, {"text": "we just couldn't ignore it that Mac OS is based on UNIX.", "start": 263.92, "duration": 3.739}, {"text": "Specifically a highly modified version of BSD now to be fair,", "start": 268.45, "duration": 4.519}, {"text": "this is much more of a technical feature", "start": 272.97, "duration": 3.69}, {"text": "so, not everyone would agree or even understand that it's important.", "start": 276.82, "duration": 3.8}, {"text": "But, it does have implications that do benefit", "start": 280.84, "duration": 2.75}, {"text": "both expert level users, and more casual / average ones at a very high level.", "start": 283.59, "duration": 6.419}, {"text": "Developers and system administrators love UNIX because they can dig deep into the OS and have a clear understanding of what's happening.", "start": 290.29, "duration": 7.13}, {"text": "For average users, the benefit is the stability that comes from such a solid foundation.", "start": 297.58, "duration": 4.369}, {"text": "Another thing our developer fans brought up is Xcode: Apple's integrated development environment.", "start": 302.89, "duration": 5.269}, {"text": "It's used to develop for Apple's entire lineup of operating systems.", "start": 308.23, "duration": 3.679}, {"text": "So whether you're working on software for a Mac computer or the Apple watch,", "start": 311.91, "duration": 4.02}, {"text": "Xcode allows developers to harness the power of each systems hardware and create compelling apps that fall in line without those stringent guidelines.", "start": 316.42, "duration": 7.579}, {"text": "Number Seven:", "start": 324.52, "duration": 1.98}, {"text": "Exclusives aren't", "start": 326.5, "duration": 1.65}, {"text": "Exclusive to gaming consoles and Mac OS has a fair few of its own.", "start": 328.15, "duration": 4.25}, {"text": "Logic Pro has been one of the standards in the music industry for years. Alongside Pro Tools another digital audio workstation or DAW", "start": 332.74, "duration": 7.939}, {"text": "Logic Pro is preferred by many professionals because it doesn't rely on third party vendors to provide core functionality or even music samples.", "start": 341.2, "duration": 7.79}, {"text": "This makes it easier for pros who might have to move around from", "start": 349.27, "duration": 3.949}, {"text": "workstation or studio to studio to slide into the chair and get going right away.", "start": 353.86, "duration": 4.429}, {"text": "Parallels is another exclusive that lets you have much of the functionality of bootcamp by enabling you to run Windows or Linux", "start": 359.32, "duration": 6.679}, {"text": "without even shutting down your Mac OS operating system", "start": 366.31, "duration": 2.93}, {"text": "Now, that other operating system will be virtualized. So there is a performance penalty.", "start": 369.88, "duration": 4.399}, {"text": "But, if all you care about is let's say running the Windows version of Microsoft Office", "start": 374.65, "duration": 3.949}, {"text": "It'll do you just fine.", "start": 379.12, "duration": 1.68}, {"text": "The big one though, of course is Final Cut Pro.", "start": 380.8, "duration": 2.899}, {"text": "As a video editing suite it is loved by professionals and amateurs alike for its fast rendering,", "start": 384.28, "duration": 6.329}, {"text": "and it's smooth workflow, and it remains to this day, a key purchase consideration for creative types.", "start": 390.8, "duration": 6.23}, {"text": "Number Eight: Accessories. Want to personalize all the stuff you own so you can be your own unique unicorn?", "start": 397.7, "duration": 5.959}, {"text": "Well, you can do that. And, if you're more of a pragmatic type, you're covered there, too.", "start": 403.669, "duration": 4.61}, {"text": "Stands, dongles, docks, cases, you name it!", "start": 408.83, "duration": 3.26}, {"text": "You can probably find it for your Mac because Apple has a smaller, more focused product line", "start": 412.09, "duration": 6.0}, {"text": "It's easier, and in many cases, more", "start": 418.09, "duration": 2.07}, {"text": "cost-effective for third parties to support which leads to a ton of options for consumers.", "start": 420.77, "duration": 4.459}, {"text": "Number nine is that Apple products cost more, and believe it or not? I'm actually not joking with you guys", "start": 426.08, "duration": 6.649}, {"text": "Apple has made a lot of noise in recent years about how the product is the product instead of the customer being the product.", "start": 433.16, "duration": 6.47}, {"text": "But they really do walk the walk for the most part.", "start": 440.0, "duration": 2.51}, {"text": "When's the last time Apple tried to cram their crappy web browser down your throat so they can collect more of your data to sell?", "start": 442.729, "duration": 5.72}, {"text": "When have they served you an ad when you went to launch a program?", "start": 448.82, "duration": 3.319}, {"text": "They haven't. So, for many users, the idea of paying the Apple tax up front", "start": 452.539, "duration": 5.6}, {"text": "in exchange for the peace of mind of knowing that they can", "start": 458.32, "duration": 2.82}, {"text": "actually turn off all of the OS-level telemetry and data collection is a sound investment.", "start": 461.66, "duration": 5.869}, {"text": "Finally, Number 10:", "start": 468.5, "duration": 2.0}, {"text": "Reliability.", "start": 471.14, "duration": 1.32}, {"text": "Now this one is sure to spark some debate in the comments,", "start": 472.46, "duration": 3.29}, {"text": "but guys hear me out for a moment. If your Mac fails, Time machine, it's flippin' awesome!", "start": 475.75, "duration": 5.94}, {"text": "You set it up once and you can basically forget about it, until", "start": 481.97, "duration": 3.44}, {"text": "you need it and it's there to get you back up and running,", "start": 485.69, "duration": 2.63}, {"text": "lickety-split!", "start": 488.78, "duration": 0.84}, {"text": "Furthermore, Apple's versions feature, which allows access to previous versions of documents and files makes it an even greater asset to both", "start": 489.62, "duration": 7.669}, {"text": "professionals, and average users.", "start": 497.44, "duration": 2.58}, {"text": "Speaking of god-sent, updates! Back when I was daily driving an iMac,", "start": 500.3, "duration": 3.92}, {"text": "sometimes I didn't even notice that my computer got an update. I'd come in in the morning and everything my apps my desktop it was", "start": 504.44, "duration": 7.669}, {"text": "just untouched.", "start": 512.11, "duration": 1.51}, {"text": "Exactly where I left it. And in true Apple magic fashion, when an update happens", "start": 513.62, "duration": 5.39}, {"text": "Time Machine, if you haven't set up even makes a back up ahead of time, you know, just in case.", "start": 519.289, "duration": 5.599}, {"text": "Amazing!", "start": 525.949, "duration": 1.08}, {"text": "Now, we're not blossom over Apple's reliability scandals,", "start": 527.029, "duration": 3.83}, {"text": "there have been quite a few, but this video is about the ten reasons that you guys love your Macs and", "start": 531.079, "duration": 6.08}, {"text": "with the kind of response that we got from our community,", "start": 537.649, "duration": 2.48}, {"text": "Apple clearly has been doing something right for so many of you to want to purchase their products.", "start": 540.38, "duration": 5.359}, {"text": "Speaking of doing something, right? You know, what's a good thing to do? That's right", "start": 546.889, "duration": 3.71}, {"text": "if you're a small business owner get FreshBooks. FreshBooks is designed to be a simple and intuitive accounting and invoicing solution", "start": 550.6, "duration": 7.02}, {"text": "so you can spend less time on paperwork and more time working on your business.", "start": 557.62, "duration": 3.869}, {"text": "You can automate tasks like invoicing,", "start": 561.709, "duration": 2.21}, {"text": "organizing expenses, tracking time and", "start": 564.199, "duration": 2.0}, {"text": "following up and the best thing is that everything is stored in the cloud so you can switch from the PC, to your mobile device,", "start": 566.269, "duration": 5.989}, {"text": "to your Mac with ease. Start your 30-day free trial right now at FreshBooks.com/techtips", "start": 572.259, "duration": 6.48}, {"text": "Pricing starts at just $15 a month with their $25 a month package handling up to 50 billable clients.", "start": 579.05, "duration": 5.539}, {"text": "So thanks for watching guys. If you just like this video you can do that.", "start": 584.75, "duration": 3.199}, {"text": "But if you liked it hit like, get subscribed or maybe consider checking out where to buy the stuff we featured at the link in", "start": 587.949, "duration": 4.2}, {"text": "the video description.", "start": 592.149, "duration": 1.24}, {"text": "Hey, dude, go buy a Mac.", "start": 593.389, "duration": 2.0}, {"text": "Also down there's our merch store which has cool shirts like this one and our community forum", "start": 595.639, "duration": 3.74}, {"text": "which you should totally join our merch store also has underwear, but you know what? I'll spare you that today", "start": 599.38, "duration": 5.279}, {"text": "I'll prove it", "start": 605.3, "duration": 1.74}, {"text": "see Linus Tech Tips underwear, it's cool stuff.", "start": 607.04, "duration": 2.0}, {"text": "Woah, I'm giving myself a wedgie here.", "start": 609.04, "duration": 2.14}]