[{"text": "*Intro*", "start": 0.0, "duration": 3.22}, {"text": "Halloween was such an exciting holiday for me when I was a kid, but over the years", "start": 5.1, "duration": 3.56}, {"text": "It's become a pretty dead event for me (pun intended) the last time I went trick-or-treating was in high school and once I started university", "start": 8.67, "duration": 7.74}, {"text": "there was never really time to do anything", "start": 16.69, "duration": 2.0}, {"text": "Making costumes was so much fun since I was really into anime and we were basically getting free candy for cosplaying", "start": 18.85, "duration": 5.929}, {"text": "well.", "start": 25.029, "duration": 0.5}, {"text": "I guess I could have just put on a bedsheet and went out as a cheap-ass underachieving ghost but where's the fun in that?", "start": 25.529, "duration": 5.01}, {"text": "I didn't have time to make costumes", "start": 30.82, "duration": 1.38}, {"text": "Anymore because I was busy making 1 to 100 scale models of my building that the architecture professor considered to be a terrible design", "start": 32.2, "duration": 6.59}, {"text": "and advised me to start over disregarding the fact that this was a term long project and the final deadline was in like three days", "start": 38.98, "duration": 5.93}, {"text": "you son of a bitc-- often to watch whatever", "start": 45.34, "duration": 2.09}, {"text": "Self-proclaimed horror movie released that year with my friends and then called it a night", "start": 47.739, "duration": 4.19}, {"text": "I didn't go to Halloween parties", "start": 51.93, "duration": 1.57}, {"text": "because I'm an introverted weeb who doesn't go out of his way to meet strangers simply for the sake of doing so", "start": 53.5, "duration": 4.939}, {"text": "I don't even hand out candy anymore when I stopped trick-or-treating my family stop giving out candy", "start": 58.62, "duration": 4.529}, {"text": "We closed any lights in the house. That would indicate that anyone was home", "start": 63.46, "duration": 3.11}, {"text": "We didn't have any scary decorations, but you know", "start": 66.57, "duration": 2.89}, {"text": "How kids are they got to sweep the whole neighborhood to make sure no houses are left untouched by the off-chance they'll hit a candy", "start": 69.48, "duration": 5.4}, {"text": "Goldmine like that one house that hands out like full chocolate bars not even bite-sized versions of the normal chocolates", "start": 74.9, "duration": 6.25}, {"text": "But like some special oversized toblerone Costco bulk lookin-ass  chocolate bars that you can't even finish in one sitting I", "start": 81.15, "duration": 6.599}, {"text": "I should add that on my list of things to do if I ever become super rich give like giant kinder surprise eggs for Trick-or-Treaters", "start": 88.15, "duration": 6.769}, {"text": "I'll become a legend for children in my neighborhood *Doms celebrate*", "start": 95.11, "duration": 3.469}, {"text": "Rabbit Boy : Hey, let's go this way, I think there's some nice houses there.", "start": 99.189, "duration": 3.391}, {"text": "Sailor moon: Naah you stupid. We got to go to Old man", "start": 102.58, "duration": 2.899}, {"text": "Dom's house he got the good shit. Rabbit Boy : Huh, you mean the kinder man? I thought it was just a myth!", "start": 105.509, "duration": 5.46}, {"text": "Yeah, well you stupid it's right over there", "start": 111.43, "duration": 2.479}, {"text": "Americans : What's a kinder surprise egg?", "start": 115.24, "duration": 3.553}, {"text": "Doms : Oh America 1938 Federal food drug and Cosmetic act?", "start": 118.793, "duration": 3.547}, {"text": "*Doms eats the kinder surprise egg*", "start": 122.34, "duration": 4.34}, {"text": "This could be you, but you playing", "start": 126.76, "duration": 2.0}, {"text": "anyway, it came to a point where we just bought the candy for ourself", "start": 128.979, "duration": 2.641}, {"text": "because at least then we knew we were getting the good", "start": 131.62, "duration": 2.269}, {"text": "Stuff by the way post Halloween Candy Sales", "start": 133.889, "duration": 3.291}, {"text": "EhMM", "start": 137.18, "duration": 0.88}, {"text": "Good shit", "start": 138.06, "duration": 1.02}, {"text": "I've even become cynical and just thought about leaving a bowl outside the door and have a sign that says have some candy", "start": 139.08, "duration": 5.84}, {"text": "But don't take too much, but never actually put any candy in the first place", "start": 144.93, "duration": 4.65}, {"text": "Sad Guy: damn, that's kind of a dick move", "start": 150.43, "duration": 2.0}, {"text": "Domics : Yeah.", "start": 153.37, "duration": 1.23}, {"text": "Even mother nature wasn't letting me enjoy Halloween. Every year just got colder and colder", "start": 154.6, "duration": 3.919}, {"text": "I remember when I could just wear whatever costume", "start": 158.56, "duration": 2.57}, {"text": "I wanted and I'd be okay now", "start": 161.13, "duration": 1.65}, {"text": "You gotta wear a sweater or jacket over your costume, and it's like", "start": 162.78, "duration": 3.059}, {"text": "Sassy Girl : Oh, what a pretty elsa costume, but she wasn't no little bitch", "start": 165.84, "duration": 3.023}, {"text": "The cold never bothered her anyway~", "start": 168.863, "duration": 1.657}, {"text": "It was in the song come on! You get a leftover lollipop from Last Halloween", "start": 170.68, "duration": 4.4}, {"text": "Domics :I think the most I get involved with Halloween now is when the video games", "start": 175.08, "duration": 3.179}, {"text": "I play have some sort of Halloween event and everything is like halloween themed, so at least I'd get into the spirit", "start": 178.26, "duration": 5.52}, {"text": "virtually", "start": 184.45, "duration": 1.65}, {"text": "Yeah, that's pretty sad", "start": 186.1, "duration": 1.98}, {"text": "But this year I'm actually gonna try to rekindle in my childhood. I am gonna go trick-or-treating", "start": 188.08, "duration": 4.64}, {"text": "*Damn that lollipop tho *-**", "start": 192.72, "duration": 1.76}, {"text": "Not even for the candy", "start": 194.52, "duration": 1.56}, {"text": "Partially for exercise reasons because I'm literally the heaviest I've ever been in my life and walking a few kilometers", "start": 196.09, "duration": 5.51}, {"text": "Would do me some good, and I know I know I'm 26 years old. I can literally just buy whatever candy", "start": 201.67, "duration": 5.96}, {"text": "I want and not have to deal with the cold", "start": 207.63, "duration": 1.93}, {"text": "or asshole kids who think flowing firecrackers that you as a prank or F-King clowns", "start": 209.56, "duration": 4.18}, {"text": "Why are there phobia perpetuating murderous clown terrorists out there?", "start": 214.0, "duration": 3.47}, {"text": "Anyway, I think I can pull it off people. Can't tell how old I am in normal clothes,", "start": 218.53, "duration": 3.8}, {"text": "They'll probably have a tougher time figuring it out. If I'm in costume", "start": 222.33, "duration": 2.58}, {"text": "Unless I wear this", "start": 225.46, "duration": 1.32}, {"text": "ooooohhhh~", "start": 226.78, "duration": 1.62}, {"text": "Took a bit of thinking and some bullshitting, but I've decided to be", "start": 228.54, "duration": 3.84}, {"text": "Actually, I not really sure what I am, but I'm gonna look like this. [oh]", "start": 233.41, "duration": 4.16}, {"text": "Have a cloak can be able to wear however many layers underneath that's necessary to keep warm", "start": 238.14, "duration": 3.809}, {"text": "I'll have a mask to hide my age revealing moon crater stress eye bag, and I'll have a cane to defend myself from", "start": 241.95, "duration": 5.8}, {"text": "Seriously, why are there killer clowns?", "start": 248.93, "duration": 2.0}, {"text": "Why?", "start": 251.72, "duration": 1.26}, {"text": "Psa stay safe out there kids carry Pepper spray modify your costume to have a weapon for defense", "start": 252.98, "duration": 5.299}, {"text": "Whatever it takes to F-ck up those clowns", "start": 258.44, "duration": 2.0}, {"text": "Stay in large groups,", "start": 260.54, "duration": 0.66}, {"text": "so you can outnumber them because you never know how many of them can fit in a single cart.", "start": 261.2, "duration": 3.58}, {"text": "Crafty bastards.", "start": 265.42, "duration": 1.54}, {"text": "But for real,", "start": 266.96, "duration": 0.92}, {"text": "if you're going out tonight, stay safe, be sure to dress warm, and be cautious of whatever candy you consume.", "start": 267.88, "duration": 4.92}, {"text": "And If anything crazy happens to me tonight, I'll be sure to let you guys know", "start": 273.44, "duration": 3.32}, {"text": "Hey guys, and especially you ladies", "start": 279.74, "duration": 2.33}, {"text": "Are you tired of going out and paying way too much for razors especially when they charge you extra just for being female?", "start": 282.07, "duration": 5.429}, {"text": "That's stupid, right?", "start": 287.87, "duration": 1.65}, {"text": "Well with dollar shave club you can have top-of-the-line razors delivered right to you for a third of the bullshit corporate price", "start": 289.52, "duration": 5.719}, {"text": "every month", "start": 295.43, "duration": 0.84}, {"text": "no hassle if you go to", "start": 296.27, "duration": 2.0}, {"text": "Dollarshaveclub.com \"/\" comics or click the link in the description you can get the first month of your razor", "start": 298.49, "duration": 5.18}, {"text": "Subscription for free you just got to pay shipping, but after that it's only a few bucks a month", "start": 303.89, "duration": 4.039}, {"text": "I'm gonna be honest with you guys. I only started shaving with razors recently", "start": 308.18, "duration": 3.59}, {"text": "I've always just used electric shavers", "start": 311.77, "duration": 2.129}, {"text": "But dollar shave Club's clean-cut executive razor was enough to convert me instantly", "start": 313.9, "duration": 4.64}, {"text": "they have other types of blades as well", "start": 318.54, "duration": 1.36}, {"text": "You can pick whichever you want and on top of that they also have body cleansers, shampoo", "start": 319.9, "duration": 4.29}, {"text": "Conditioner, shaving butter you got to try the butter. I tried shaving cream before but once you go butter. You don't look back again", "start": 324.71, "duration": 7.219}, {"text": "That's dollarshaveclub.com \"/\" Domics link in the description first months razor is on the house", "start": 331.93, "duration": 5.52}, {"text": "Just pay shipping that one time and after that. It's only a few dollars a month. Enjoy :D", "start": 337.45, "duration": 4.09}, {"text": "*End*", "start": 341.54, "duration": 8.36}]