[{"text": "Well, you know what they say Sonic's never really been the same since his jump to 3d", "start": 12.469, "duration": 3.83}, {"text": "It's that time of year. Once again everyone for no real reason at some point in July for the last four years", "start": 16.61, "duration": 6.019}, {"text": "I've taken a look at rom hacks from the sonic franchise", "start": 22.789, "duration": 2.87}, {"text": "I saw the wacky the weird some top-tier stuff as well, and we can't forget about", "start": 26.289, "duration": 5.37}, {"text": "Though those fun times and consistently on a year-by-year basis", "start": 32.63, "duration": 4.79}, {"text": "we continue to see", "start": 37.42, "duration": 0.94}, {"text": "Developments being made in the realms of Genesis Sonic as well as Sonic mania and we'll continue to see plenty from all of those games", "start": 38.36, "duration": 6.59}, {"text": "Going forward but it's about time", "start": 44.95, "duration": 2.49}, {"text": "We take a look at what the fans have done with 3d Sonic ever since Sega started dropping sonic games on Steam", "start": 47.44, "duration": 6.509}, {"text": "That was it man. The floodgates were opened", "start": 53.95, "duration": 2.009}, {"text": "They're harder to develop form and it's a bit more complicated to get set up", "start": 56.36, "duration": 3.65}, {"text": "but I'm happy to report that I have three core Sonic games here that have plenty of", "start": 60.02, "duration": 4.459}, {"text": "Experiences to check out", "start": 66.77, "duration": 2.0}, {"text": "Today hall boy Sonic Adventure adventure 2 and generations. These are the games that we're gonna be checking out today", "start": 69.409, "duration": 6.8}, {"text": "Now those aren't the only Sonic games on PC", "start": 76.39, "duration": 2.43}, {"text": "But the other options are pretty limited when it comes to mods like you can play as classic Sonic in Sonic 4 episode 2", "start": 78.82, "duration": 7.049}, {"text": "Which is is neat", "start": 85.869, "duration": 2.0}, {"text": "Ok, the game is still garbage though Sonic Adventure", "start": 88.28, "duration": 2.75}, {"text": "Director's cut. I played this game so much growing up", "start": 91.729, "duration": 2.989}, {"text": "It's like it's like objectively really really bad, but I still love it all the same", "start": 94.719, "duration": 4.5}, {"text": "However over time I learned that the purists I guess I'll call them swear by the original", "start": 99.219, "duration": 5.4}, {"text": "Dreamcast version over the DX port well", "start": 104.929, "duration": 2.93}, {"text": "There is a Dreamcast conversion mod that changes all of the aesthetics to match that of the original version", "start": 107.859, "duration": 5.49}, {"text": "And yeah, I'm a big fan character models textures", "start": 113.35, "duration": 3.209}, {"text": "Even the lighting are attempting to make this feel as close to the original version as possible and it is great stuff", "start": 116.63, "duration": 5.689}, {"text": "After playing director's cut and this mod back to back", "start": 122.719, "duration": 2.959}, {"text": "I totally preferred these stubbier looking designs here. And in some instances here man. The colors are just a better. I'll still hold", "start": 125.679, "duration": 7.93}, {"text": "Sadx on the Gamecube close to my heart with nostalgia, but on PC", "start": 134.13, "duration": 4.099}, {"text": "Yeah, this is absolutely the way to play the game now in my opinion and hey", "start": 138.23, "duration": 3.6}, {"text": "At least the Steam version came with widescreen remember when they released this on ps3 and 360 and it didn't have widescreen", "start": 141.83, "duration": 5.94}, {"text": "bunch of dummies aside from that one", "start": 148.17, "duration": 2.6}, {"text": "most of the mods that I found are pretty minimal and come down to mainly a", "start": 150.77, "duration": 3.629}, {"text": "Simple character skin like here. We have sonic looking like his modern appearance in Sonic Force's", "start": 154.5, "duration": 5.27}, {"text": "Adventure 2 sonic is also an option, which is really really surreal to watch naturally", "start": 159.99, "duration": 5.27}, {"text": "This means that the hero models are available as well. And even they fully poured it over seaside hill that's pretty cool", "start": 165.26, "duration": 6.209}, {"text": "And then we OH", "start": 171.47, "duration": 1.8}, {"text": "Oh", "start": 173.27, "duration": 2.0}, {"text": "No, I don't like this uh-huh, yep, sweet dude, that's that's just what Sonic Adventure needed night nightmare fuel", "start": 175.44, "duration": 6.589}, {"text": "I mean at this point, I guess then why not?", "start": 182.03, "duration": 2.55}, {"text": "What if we played as the dolls from that one stage that you played as gamma instead of the real thing?", "start": 184.59, "duration": 4.94}, {"text": "Cool. Oh and it changes the cutscenes to fantastic. I hate it so much", "start": 190.14, "duration": 5.3}, {"text": "Can we get something just a little bit more wholesome here like as soon as possible, please", "start": 195.83, "duration": 3.479}, {"text": "Beautiful", "start": 204.52, "duration": 1.08}, {"text": "Alrighty then. So your guess is as good as mine as to why knuckles stole Amy's dress", "start": 205.6, "duration": 5.3}, {"text": "But let's be honest here the red on red really works for him. Looking good knucks", "start": 210.9, "duration": 4.199}, {"text": "Some really cool stuff has been made though, for instance", "start": 215.5, "duration": 2.93}, {"text": "the windy Valley stage that we got in the final product is totally", "start": 218.43, "duration": 3.689}, {"text": "Different than how it was in the beta and well we get to experience it in this recreation", "start": 222.37, "duration": 4.76}, {"text": "It is so surprisingly different than what we got in the actual game at least in terms of size", "start": 227.2, "duration": 5.06}, {"text": "The stage is massive and offer some more nonlinear progression than what we're used to in adventure", "start": 232.26, "duration": 5.309}, {"text": "It's actually super refreshing being able to play such a large sprawling level with this game's controls. They fit together perfectly", "start": 237.57, "duration": 6.989}, {"text": "This is mostly a neat novelty and pretty cool for historical purposes", "start": 244.72, "duration": 3.5}, {"text": "I love this mod, and then you know, we could also have Crysis City because despite everyone hating Sonico 6", "start": 248.35, "duration": 6.559}, {"text": "Nobody actually wants that game to die. So here we go", "start": 255.04, "duration": 3.589}, {"text": "This is a fun level for the most part and I guess if anything I can appreciate fans trying to make Sonic o-6 more playable", "start": 258.79, "duration": 7.94}, {"text": "Honestly, that would be cool. If all of the levels from that game got ported over to the better engine here", "start": 266.98, "duration": 4.279}, {"text": "I mean, oh 6 was already basically Sonic Adventure 3, right so it'd be perfect", "start": 271.26, "duration": 4.26}, {"text": "Hey real quick. Do Sonic fans still get upset when you call Sonic? Oh 6 Sonic Adventure 3 they do", "start": 276.04, "duration": 5.48}, {"text": "Okay, cool by far the best mod out", "start": 282.07, "duration": 3.049}, {"text": "There is the recently released Sonic Shadow and Metal Sonic mod gameplay overall", "start": 285.12, "duration": 5.279}, {"text": "That rolls that rolls right off the tongue", "start": 290.68, "duration": 2.0}, {"text": "Rather than trying to simply touch up the original game this mod takes the three named characters and gives them radically different play control", "start": 292.69, "duration": 8.0}, {"text": "Sonic now has his modern boosting ability shadow games knuckles hand-to-hand combat as well as the ability to use the chaos energy", "start": 300.85, "duration": 7.609}, {"text": "attacks from his own game, even the chaos blast and for Metal Sonic well,", "start": 308.56, "duration": 4.46}, {"text": "He can take advantage of different Chaos Emeralds for various powers on top of the ability to just straight-up fly", "start": 313.02, "duration": 5.879}, {"text": "You can even turn super mid stage - how cool is that?", "start": 318.91, "duration": 3.32}, {"text": "It's not exclusive to this mod", "start": 322.419, "duration": 1.881}, {"text": "One of the more common mods for Sonic Adventure is being able to turn super whenever you want", "start": 324.3, "duration": 4.23}, {"text": "But it comes built into this one. So that's pretty cool", "start": 328.53, "duration": 3.18}, {"text": "But something like this makes me think that we are still just scratching the surface of what the modding community has in store for us", "start": 331.71, "duration": 6.859}, {"text": "Sonic Adventure DX on Steam is gonna be something to keep your eye on going forward", "start": 338.88, "duration": 4.279}, {"text": "I'm promising you as for Sonic Adventure 2", "start": 343.16, "duration": 2.279}, {"text": "Well things are a little bit more sparse there", "start": 345.57, "duration": 2.389}, {"text": "I guess for whatever reason the first adventure is simply easier to work with allowing the modders to let their freedom run wild", "start": 347.96, "duration": 7.2}, {"text": "however with this sequel", "start": 355.38, "duration": 2.0}, {"text": "Alrighty then, ok, either either we've hit the bottom of the barrel here or we have struck comedy gold", "start": 361.44, "duration": 6.679}, {"text": "Yeah, ok short now. Every character has decided to dress up in rouges outfit ID", "start": 368.34, "duration": 5.33}, {"text": "I", "start": 373.67, "duration": 0.31}, {"text": "Feel incredibly dirty for even looking at this but to be fair as expected going in it certainly made the final battle a bit more", "start": 373.98, "duration": 7.489}, {"text": "Interesting since in his levels tails only shows up in his mech. This only pops up in the Chow garden", "start": 381.6, "duration": 5.6}, {"text": "However, there is one more character left to test out. Please please please please please please please please, please", "start": 387.2, "duration": 7.229}, {"text": "Okay", "start": 396.06, "duration": 2.0}, {"text": "Yosh Yosh", "start": 399.03, "duration": 2.0}, {"text": "Researching mods for Sonic Adventure 2 resulted in a lot of them that were purely aesthetic", "start": 401.76, "duration": 4.459}, {"text": "There's a winter theme for City escape Sonic Colors* inspired Chao gardens", "start": 406.22, "duration": 4.769}, {"text": "The old Halloween and Christmas costumes that the characters used to dress up in during that time of year in the Dreamcast version", "start": 410.99, "duration": 6.059}, {"text": "Dim the Dreamcast really did a lot of cool things back then and if you loved Amy Rose while I'm more than happy to report", "start": 417.39, "duration": 6.199}, {"text": "that with Amy Adventure 2", "start": 423.59, "duration": 1.72}, {"text": "the gang is all here and accounted for and what what a good sequel be without some continuity if Rouge is outfit was just a", "start": 425.31, "duration": 7.489}, {"text": "Bit too much for you knuckles can once again Don Amy's dress instead. Listen here", "start": 432.8, "duration": 5.37}, {"text": "I'm not saying that this should be in every Sonic game going forward, but I'm also not against it either", "start": 438.17, "duration": 5.669}, {"text": "These costume changes are really all that this game has going for it at the moment though", "start": 443.91, "duration": 4.309}, {"text": "Emerald Coast from Sonic Adventure 1 did get ported over which is pretty cool", "start": 448.35, "duration": 3.889}, {"text": "But it's the only super notable level mod out there at the moment at least as far as I know and I gotta tell you", "start": 452.24, "duration": 5.82}, {"text": "If essay 2 Sonic and essay one wasn't surreal enough. This will really throw you for a loop", "start": 458.06, "duration": 4.799}, {"text": "To get at Ko sonic sonic has a lot of loops. Haha. I'll be honest", "start": 463.5, "duration": 4.739}, {"text": "I'm pretty surprised that Sonic Adventure 2 doesn't really have a ton of mods going for it", "start": 468.24, "duration": 4.23}, {"text": "I would have thought otherwise, who knows what the future will bring us maybe in a few years", "start": 472.47, "duration": 3.809}, {"text": "We'll see a ton of crazy stuff. But for now, this is all I was really able to dig up. Oh wait, hold on", "start": 476.28, "duration": 5.82}, {"text": "I forgot I forgot one", "start": 482.1, "duration": 2.0}, {"text": "All mojo addition. Oh", "start": 484.9, "duration": 2.0}, {"text": "No, oh", "start": 489.19, "duration": 2.0}, {"text": "Boy just what I needed all mojo to return and destroy my life and consume my soul absolutely perfect to move on to generations now", "start": 494.95, "duration": 7.489}, {"text": "the Sonic Generations", "start": 503.23, "duration": 1.8}, {"text": "modding community", "start": 505.03, "duration": 1.23}, {"text": "Holy cow, since this game was the first in a while to gain a ton of consistent praise from players", "start": 506.26, "duration": 5.239}, {"text": "Plus it released on PC at the same time as consoles", "start": 511.57, "duration": 3.469}, {"text": "It gained an audience really really quickly and after a few years", "start": 515.039, "duration": 3.33}, {"text": "generations now provides the most", "start": 518.68, "duration": 2.119}, {"text": "Modded content out there for a single Sonic game since the gameplay style from modern Sonic is so strong fans have taken it upon themselves", "start": 520.9, "duration": 6.949}, {"text": "To port and remaster stages from previous games to fit into its style now", "start": 528.01, "duration": 5.029}, {"text": "I've already gone over the Unleashed", "start": 533.04, "duration": 1.69}, {"text": "Project a full port of every single daytime level from Sonic Unleashed and I am a huge fan of it", "start": 534.73, "duration": 5.33}, {"text": "But man, it really didn't take long to see that really no Sonic game was safe here", "start": 540.06, "duration": 4.409}, {"text": "You got multiple levels from Sonic Colors", "start": 544.47, "duration": 2.01}, {"text": "Camelot castle from Black Knight metal harbor from Sonic Adventure 2", "start": 546.94, "duration": 3.59}, {"text": "grand", "start": 550.78, "duration": 0.66}, {"text": "Metropolis from Sonic Heroes a take on Splash Hill from Sonic 4 of all games which is actually one of the more enjoyable ones out", "start": 551.44, "duration": 6.739}, {"text": "There mystic cave zone from Sonic 2 is available with classic sonic, which is pretty cool and amazingly once again Sonic", "start": 558.18, "duration": 7.38}, {"text": "oh 6 content got ported over as well and like", "start": 565.56, "duration": 2.94}, {"text": "It's it's really really good on top of being able to use the sonic model from that game", "start": 568.75, "duration": 5.479}, {"text": "which is", "start": 574.23, "duration": 0.79}, {"text": "That's that's just bizarre", "start": 575.02, "duration": 1.41}, {"text": "the speed section from wave ocean feels better now than it ever has before and the rest of that level did get ported over as", "start": 576.43, "duration": 7.039}, {"text": "well", "start": 583.47, "duration": 0.21}, {"text": "But to the classic style and it's really fun any set piece that you can think of from that original level got treated", "start": 583.68, "duration": 6.6}, {"text": "Perfectly in the transition to this side-scrolling format", "start": 590.38, "duration": 2.39}, {"text": "But to be fair the levels mentioned thus far come up to the shear quality of the stuff that sega made for the game", "start": 593.32, "duration": 6.01}, {"text": "But it does sort of show the potential of just what they could have done if they thought outside the box a little bit more", "start": 599.34, "duration": 5.45}, {"text": "With their level choices, this is most emphasized in a port of Kingdom Valley", "start": 604.79, "duration": 4.14}, {"text": "this is one of the newer mods out there and the attention to detail provided from start to finish in this stage is", "start": 608.93, "duration": 6.149}, {"text": "ridiculous this actually feels like it's an official product as if Sega went crazy and announced a remake of Sonic o 6 the mod is", "start": 615.57, "duration": 6.65}, {"text": "That good. Also Sega, please please don't do that", "start": 622.22, "duration": 2.729}, {"text": "There are a lot of parts to this stage that blur the line between a straight-up port any", "start": 625.31, "duration": 4.14}, {"text": "Level inspired by the original which is just how the core game was", "start": 629.58, "duration": 3.679}, {"text": "It's a consistently fun ride all the way through and like halfway in a mini cutscene with silver happens", "start": 633.26, "duration": 5.94}, {"text": "And I didn't even know that was possible in generations, man", "start": 639.2, "duration": 4.44}, {"text": "when creative matters really put their heart and soul into a project we get some", "start": 643.64, "duration": 3.989}, {"text": "Fantastic stuff the levels we've looked at so far have been awesome. What else do we have to look forward to?", "start": 647.91, "duration": 4.609}, {"text": "Shoulda known", "start": 656.85, "duration": 1.29}, {"text": "Super Mario Bros 1-1, huh? Okay, it was bound to happen eventually, I guess truthfully", "start": 658.14, "duration": 5.78}, {"text": "I'm not even surprised the game with a level editor or modding support that doesn't include Mario 1:1 I", "start": 663.92, "duration": 5.489}, {"text": "Don't think that exists but hey aside from classic Mario even Mario Kart got some love now", "start": 670.26, "duration": 5.54}, {"text": "This one's pretty cool, Rainbow Road", "start": 675.8, "duration": 2.0}, {"text": "Medley you basically play through multiple generations of Rainbow Road from the hellscape known as Rainbow Road super nintendo", "start": 677.91, "duration": 6.26}, {"text": "then you go to 64 double dash after that and", "start": 684.39, "duration": 3.2}, {"text": "Wrapping up with the Wii version and that's just a damn cool idea man. Sonic games are practically single-player racers", "start": 687.75, "duration": 6.44}, {"text": "Anyway, this fits in perfectly realistically most of the level mods available. Here are really solid. The only odd one that I encountered was", "start": 694.19, "duration": 7.619}, {"text": "GameCube galaxy", "start": 702.9, "duration": 1.83}, {"text": "Huh? It was enjoyable. Don't get me wrong, but it's mostly just a mishmash of level objects with GameCube symbols", "start": 704.73, "duration": 6.409}, {"text": "Just tossed everywhere. It's it's so dumb and ridiculous and", "start": 711.14, "duration": 4.2}, {"text": "Sometimes I couldn't ask for much more", "start": 715.86, "duration": 1.58}, {"text": "I", "start": 717.44, "duration": 0.79}, {"text": "Did want to give a special highlight to two specific modulo-2 more original levels based on existing games first up", "start": 718.23, "duration": 7.129}, {"text": "We have sky troops from Shadow the Hedgehog", "start": 725.36, "duration": 2.07}, {"text": "Aesthetically this feels pretty on par to what the original was all about aside from well", "start": 728.07, "duration": 4.65}, {"text": "You know the whole alien", "start": 732.72, "duration": 1.6}, {"text": "invasion and and guns thing but aside from that this is simply a really fun stage which is fitting because it was one of the", "start": 734.32, "duration": 6.349}, {"text": "Better stages from that game. So it works out and then water palace from sonic rush also got a similar treatment now", "start": 740.67, "duration": 7.17}, {"text": "Yeah, this stage was in the 3ds version", "start": 747.84, "duration": 2.099}, {"text": "Remember that there was a 3ds version but here a lot of the ideas got to be shown off on a grander scale", "start": 750.46, "duration": 5.239}, {"text": "This is a really enjoyable 3d Sonic stage where a lot of it takes place underwater", "start": 756.16, "duration": 4.849}, {"text": "I know shocking Sonic Generations on PC has become the hot spot for reimagining the", "start": 761.05, "duration": 6.86}, {"text": "Entirety of Sonic's history and I sincerely hope that this trend continues on in the future. This is awesome stuff", "start": 768.34, "duration": 5.899}, {"text": "I mean Lost Valley from forces is even playable in generations now once again, nothing off-limits", "start": 774.42, "duration": 5.79}, {"text": "And we've only just merely touched upon the levels available for this game. What else do we have to play with a", "start": 780.21, "duration": 5.7}, {"text": "Sick man my favorite sonic character Mickey the mouse", "start": 788.44, "duration": 3.44}, {"text": "Hey now, I'm plenty of where that everybody has been clamoring for the Sonic and Mickey collaboration. That's gonna set the world on fire", "start": 792.31, "duration": 7.07}, {"text": "But I'll be honest. I don't see the appeal. Oh wow", "start": 799.48, "duration": 3.44}, {"text": "What instead of a skateboard he skates on a giant Mickey head? I take it back. I'm totally sold", "start": 802.92, "duration": 5.07}, {"text": "Oh, no, it's my evil. Doppelganger. Glitchy monochrome Mickey. Oh, oh", "start": 807.99, "duration": 5.489}, {"text": "Oh, no, what what happened? All right. I don't know how I screwed up", "start": 813.79, "duration": 4.309}, {"text": "I definitely did something wrong here, but it feels so right. Here's an interesting one Super Mario", "start": 818.1, "duration": 6.75}, {"text": "generations", "start": 825.37, "duration": 1.02}, {"text": "Finally now classic Mario and modern Mario can run through levels from Sonic's past. Oh boy. So maari's back everyone", "start": 826.39, "duration": 7.729}, {"text": "I'm so excited", "start": 834.12, "duration": 1.6}, {"text": "This is absolutely bizarre man, though. It does speak for itself. It's just something that I can barely wrap my head around", "start": 835.72, "duration": 6.71}, {"text": "You're actually collecting coins now not rings. That's so weird. I think I need something just a bit more my speed", "start": 842.59, "duration": 6.889}, {"text": "Up. Yep. There we go, Mario and Sonic", "start": 850.02, "duration": 2.339}, {"text": "Outfit. Oh ho boy this is something this is very indicative of my interests in romhack and mods to be honest because I am way", "start": 852.91, "duration": 7.719}, {"text": "More likely to play this than like anything else. The reality here is when you're not looking for level mods", "start": 860.63, "duration": 5.549}, {"text": "This is what we have to play around with", "start": 866.18, "duration": 2.0}, {"text": "Characters that you never expect it to play as fully playable", "start": 868.32, "duration": 2.959}, {"text": "And I know everyone out there has been asking for total control of professor pickle. And here you go. Oh and thank goodness", "start": 871.279, "duration": 6.96}, {"text": "There's an almost as well", "start": 878.24, "duration": 2.0}, {"text": "Cool. I can already hear them taunting me in my dreams. Happy early Halloween to me", "start": 880.709, "duration": 5.48}, {"text": "This is the scariest thing the modding scene for adventure and generations is ridiculous", "start": 886.19, "duration": 4.89}, {"text": "We got plenty of good stuff and plenty of wacky stuff", "start": 891.08, "duration": 2.429}, {"text": "And with that I can sort of draw parallels to Sonic 1 & 2 when it comes to ROM hacks", "start": 893.51, "duration": 5.01}, {"text": "Which is pretty cool going forward man. I'm sure with those 2 games and Sonic Adventure 2 included", "start": 898.52, "duration": 5.069}, {"text": "We're gonna see some really really cool stuff", "start": 903.899, "duration": 2.21}, {"text": "But of course we can't end with that. Don't worry", "start": 906.66, "duration": 2.929}, {"text": "I was definitely doing research on the other two main Sonic games available on Steam as well", "start": 909.589, "duration": 4.59}, {"text": "Yes, lost world and forces have mods too. Just not much. You can play through beta windy valley in lost world", "start": 914.22, "duration": 7.58}, {"text": "That's pretty cool Green Grove from 3d blast is also there that's really sick", "start": 921.8, "duration": 4.679}, {"text": "Actually, the play style totally works for it and like clockwork at this point wave ocean. Is there - Sonic?", "start": 926.48, "duration": 5.82}, {"text": "Oh 6 will never die. And when we look at Sonic forces Emerald Coast got the poor treatment", "start": 932.3, "duration": 4.53}, {"text": "That's pretty cool as did Wes topless from shadow", "start": 936.83, "duration": 2.969}, {"text": "It's actually pretty genius using the speed of Sonic and the gunplay of the Avatar character for a Shadow the Hedgehog stage", "start": 939.8, "duration": 6.57}, {"text": "Wow, that that works out really really well. Oh, I love this one so much", "start": 946.709, "duration": 4.13}, {"text": "You can play a sonic from Sonic R", "start": 950.839, "duration": 1.771}, {"text": "And now I 100% want a new Sonic game in a polygamous tile if Mario and Crash can get away with it. Come on", "start": 952.61, "duration": 6.239}, {"text": "It's Sonic's time to do this - and last but certainly not least you can play as a pineapple", "start": 958.85, "duration": 5.91}, {"text": "Yep, a pineapple", "start": 965.579, "duration": 2.0}, {"text": "Watch out Eggman here comes a spiky acidic fruit", "start": 967.74, "duration": 3.41}, {"text": "Sadly? No, I couldn't find any yethow mods for a 3d Sonic game. I tried really hard. Who knows maybe sometime down the line", "start": 972.0, "duration": 7.339}, {"text": "We'll get one but for now doesn't exist", "start": 979.339, "duration": 2.19}, {"text": "I'm so sorry", "start": 982.47, "duration": 2.0}, {"text": "But as for pineapple forces, well this leads to an interesting discussion here. You see I'm not really a fan of sonic forces", "start": 984.81, "duration": 7.759}, {"text": "I actually really really don't like that game. However, if we retool it tabby fruit be the one going out to save the world", "start": 992.569, "duration": 6.75}, {"text": "We may have something there. I think this answers the age-old question", "start": 999.99, "duration": 3.32}, {"text": "Yes pineapple does indeed belong on pizza. I mean on Sonic I mean", "start": 1004.009, "duration": 6.14}]