[{"text": "The Nintendo 64 Expansion Pak...", "start": 0.6, "duration": 2.9}, {"text": "... is a piece of junk, almost completely useless and sold on a bed of lies!", "start": 3.76, "duration": 4.32}, {"text": "But I'm still gonna find a few awesome things with this little guy,", "start": 9.1, "duration": 2.74}, {"text": "because this is Punching Weight - a celebration of the weird, ambitious and unnecessary,", "start": 11.84, "duration": 4.58}, {"text": "and the N64 Red Top here is all three of those things!", "start": 16.42, "duration": 3.4}, {"text": "So whether you're a hardcore collector or just interested in weird Nintendo peripherals,", "start": 19.82, "duration": 4.38}, {"text": "strap in, because we are going to take a deep, deep dive into the Nintendo 64 Expansion Pak.", "start": 24.2, "duration": 5.42}, {"text": "But first, a shout-out to our Patreon supporters! This is a Patreon-supported show,", "start": 29.62, "duration": 4.7}, {"text": "stick around to the end of the video to see all of the people that made this show possible!", "start": 34.32, "duration": 4.88}, {"text": "On with the show!", "start": 39.2, "duration": 1.06}, {"text": "So just what is the Expansion Pak?", "start": 49.6, "duration": 2.7}, {"text": "It is a peripheral that replaces the stock Jumper Pak, and boosts the power of the Nintendo 64,", "start": 52.3, "duration": 5.52}, {"text": "doubling the RAM with an additional four megs of power!", "start": 57.82, "duration": 2.92}, {"text": "It's easy to think this is the product of a bygone era, like the Sega CD or the 32X.", "start": 61.02, "duration": 5.02}, {"text": "Yes, they made dual versions of that.", "start": 66.42, "duration": 2.06}, {"text": "But how different is it really from the Xbox One X, PlayStation 4 Pro or S model iPhones?", "start": 68.78, "duration": 5.06}, {"text": "Well... except this is a hell of a lot cheaper.", "start": 73.84, "duration": 2.74}, {"text": "But really, this is classic Nintendo! They love upgrading their stuff!", "start": 76.58, "duration": 3.52}, {"text": "The NES Top Loader, the Super Game Boy,", "start": 80.18, "duration": 2.26}, {"text": "the DS, the 3DS, the New 3DS, don't forget about all the Game Boys,", "start": 82.44, "duration": 3.86}, {"text": "I mean, the reason the Wii U failed was because everyone thought it was just a tablet upgrade for the Wii!", "start": 86.3, "duration": 5.54}, {"text": "Which, yeah, I guess in a way it was, but let's stay focused.", "start": 91.84, "duration": 3.8}, {"text": "The Expansion Pak was salvaged from the 64DD,", "start": 95.78, "duration": 3.28}, {"text": "meaning this thing was created for something entirely else!", "start": 99.06, "duration": 3.2}, {"text": "Perhaps this is why so few games used it,", "start": 102.26, "duration": 2.38}, {"text": "and those games that did didn't really benefit much from the extra juice.", "start": 104.64, "duration": 3.6}, {"text": "How do you use the Expansion Pak?", "start": 108.24, "duration": 1.98}, {"text": "Well, on the front of every system is a little hatch with a tiny cartridge.", "start": 110.22, "duration": 4.08}, {"text": "This is the Jumper Pak, a.k.a TERMINATOR PAK.", "start": 114.38, "duration": 3.6}, {"text": "I'm not kidding, that's what it actually says in Japanese on the front there.", "start": 118.16, "duration": 2.88}, {"text": "Pry that thang out with the official Nintendo plastic thingy,", "start": 121.04, "duration": 2.96}, {"text": "or failing that, a screwdriver or table knife,", "start": 124.0, "duration": 2.28}, {"text": "and slide in the old Red Top, and bam! Your Nintendo 64 has now been supercharged!", "start": 126.28, "duration": 4.96}, {"text": "... except it hasn't.", "start": 131.32, "duration": 1.28}, {"text": "The sole purpose of the Jumper Pak is to allow the system to boot without the Expansion Pak.", "start": 132.66, "duration": 5.14}, {"text": "I'm not kidding, this thing might as well be empty.", "start": 138.48, "duration": 1.96}, {"text": "Now, with it being designed this way, you'd think naturally most of the library supports it,", "start": 141.0, "duration": 4.46}, {"text": "so before we get into what the Red Top does, here's what it does not do:", "start": 145.46, "duration": 3.98}, {"text": "It does not improve any non-compatible game.", "start": 149.44, "duration": 2.94}, {"text": "It will not improve the framerates of GoldenEye or Smash Bros.,", "start": 152.38, "duration": 3.26}, {"text": "or improve your Mario 64 speedrun.", "start": 155.64, "duration": 1.94}, {"text": "[Mario wails helplessly]", "start": 157.58, "duration": 1.7}, {"text": "However, it functions like a normal Jumper Pak in those situations,", "start": 159.28, "duration": 2.94}, {"text": "so you don't need to worry about swapping paks, which Nintendo actually encourages you not to do.", "start": 162.22, "duration": 4.64}, {"text": "Though it's probably still worth hanging on to your original Jumper Pak, just in case.", "start": 166.98, "duration": 3.72}, {"text": "More on that later.", "start": 170.7, "duration": 1.0}, {"text": "The Nintendo 64 Expansion Pak will also not tell you where to suck it, like professional wrestler X-Pac.", "start": 171.86, "duration": 5.78}, {"text": "So that covers the non-compatible games, what about the compatible games?", "start": 178.0, "duration": 3.54}, {"text": "In North America, just over sixty games are compatible with the Red Top.", "start": 181.54, "duration": 4.08}, {"text": "Now, I know that doesn't sound very impressive, hold on, it's actually even less impressive than that.", "start": 185.62, "duration": 4.76}, {"text": "The most common enhancement was an increase in resolution and texture quality,", "start": 190.4, "duration": 3.94}, {"text": "but at the cost of framerate: Games would look better but run worse.", "start": 194.34, "duration": 3.84}, {"text": "Bad news for a library of games that already had huge issues with chug.", "start": 198.18, "duration": 3.72}, {"text": "You're usually better off leaving the high-rez options alone.", "start": 201.9, "duration": 2.88}, {"text": "This is the case for most of the Turok and Star Wars games, as well as a few sports games.", "start": 204.78, "duration": 4.62}, {"text": "There are a few edge cases, like South Park and Duke Nukem: Zero Hour", "start": 209.4, "duration": 3.44}, {"text": "having the option to improve either the resolution or framerate.", "start": 212.84, "duration": 3.44}, {"text": "Other games improve graphics in different ways:", "start": 216.28, "duration": 2.38}, {"text": "The World is Not Enough, a.k.a. 007 TWINE!! offers a high-color mode,", "start": 218.66, "duration": 5.18}, {"text": "and Quake II 64 offers more colors and a small bump to the framerate.", "start": 223.84, "duration": 3.74}, {"text": "But some of these games are still N64 exclusives,", "start": 227.58, "duration": 2.78}, {"text": "so the extra graphical options are still an interesting little novelty.", "start": 230.36, "duration": 3.7}, {"text": "They're not really worth getting into, but it's cool!", "start": 234.06, "duration": 2.46}, {"text": "However, a few compatible games were ported to other, beefier systems, like the Dreamcast, PS2 and PC", "start": 236.52, "duration": 5.52}, {"text": "which today makes the graphics bump not as meaningful.", "start": 242.04, "duration": 2.86}, {"text": "But I'm sure at the time, it kept the N64 in the conversation as newer systems arrived on the market.", "start": 244.9, "duration": 4.82}, {"text": "In fact, the more I think about the Expansion Pak, the clearer it becomes that it was just marketing BS,", "start": 249.72, "duration": 5.6}, {"text": "another example of gaming's tired but still-marketable pursuit of graphics over everything.", "start": 255.34, "duration": 5.3}, {"text": "So I'll be honest, you'd be forgiven if you wrote this thing off completely,", "start": 260.7, "duration": 3.86}, {"text": "but digging deeper, the Expansion Pak still finds itself in the middle of some mysterious and fascinating stuff!", "start": 264.56, "duration": 6.02}, {"text": "So enough fartin' around, it's time to really get into the mud!", "start": 270.68, "duration": 2.92}, {"text": "The Red Top had a more interesting and complicated relationship with a handful of games,", "start": 273.64, "duration": 4.56}, {"text": "enough to justify its existence.", "start": 278.2, "duration": 2.24}, {"text": "Still wouldn't say this is one of Nintendo's best products, but...", "start": 280.52, "duration": 3.08}, {"text": "... man, you know I love this kinda stuff! I had to make a video about it!", "start": 283.74, "duration": 3.26}, {"text": "And before we get too much further, for the record,", "start": 287.0, "duration": 2.16}, {"text": "we're capturing all gameplay footage off the original hardware, with the standard composite cables.", "start": 289.16, "duration": 5.38}, {"text": "No emulation for this video!", "start": 294.64, "duration": 1.88}, {"text": "Not that we have any issue with emulation,", "start": 296.52, "duration": 2.4}, {"text": "but for this video it was important to get the real thing, just for the sake of due diligence 'n journalism!", "start": 298.92, "duration": 6.94}, {"text": "And of course, we need to start our deep dive into the Expansion Pak with the three games that required it:", "start": 305.92, "duration": 5.36}, {"text": "DK64, Majora's Mask and Perfect Dark.", "start": 311.32, "duration": 3.28}, {"text": "First off, DK64.", "start": 314.72, "duration": 1.92}, {"text": "Here in the States it was the only N64 game bundled with the Expansion Pak -- that's how I got mine.", "start": 316.64, "duration": 5.4}, {"text": "Elsewhere in the world, it was also bundled with Perfect Dark and Majora's Mask,", "start": 322.08, "duration": 3.36}, {"text": "but here in the States, it was only bundled with DK64.", "start": 325.44, "duration": 3.44}, {"text": "By itself, the Expansion Pak  retailed for $30, maybe more depending on your region,", "start": 328.98, "duration": 4.34}, {"text": "which made the bundle a pretty good deal!", "start": 333.32, "duration": 2.16}, {"text": "It also came with a Jumper Pak Ejector Tool,", "start": 335.48, "duration": 2.18}, {"text": "and an instruction book that referred to this hunk of plastic as the Jumper Pak Ejector Tool.", "start": 337.66, "duration": 3.68}, {"text": "Yeah, that snazzy red top doesn't actually make it any easier to remove from the system.", "start": 341.5, "duration": 4.56}, {"text": "For fun, here's what DK64 looks like when you try and play it with the Jumper Pak.", "start": 346.06, "duration": 3.98}, {"text": "Yep, just this screen and nothing else.", "start": 350.48, "duration": 2.4}, {"text": "Could've at least let us listen to the DK Rap!", "start": 352.88, "duration": 2.38}, {"text": "DK64 was advertised as a game so massive, it needed the Expansion Pak just to fit it all in!", "start": 359.22, "duration": 6.04}, {"text": "ANNOUNCER: \"It's so big, we included an Expansion Pak to get it all in!\"", "start": 365.26, "duration": 3.46}, {"text": "And it was a really big game! Many would argue too big,", "start": 368.72, "duration": 2.72}, {"text": "but it also housed some fancy lighting and decent framerate.", "start": 371.44, "duration": 2.84}, {"text": "However, it's worth noting that Rare's follow-up platformers,", "start": 374.28, "duration": 3.24}, {"text": "Banjo-Tooie and Conker's Bad Fur Day, released in 2000 and 2001 respectively,", "start": 377.52, "duration": 4.36}, {"text": "were also pretty massive games with impressive graphics", "start": 381.9, "duration": 3.06}, {"text": "that not only didn't require, but didn't even USE the Expansion Pak!", "start": 384.96, "duration": 4.06}, {"text": "So what gives?", "start": 389.1, "duration": 1.1}, {"text": "DK64 was Nintendo's big holiday game for 1999.", "start": 390.3, "duration": 4.28}, {"text": "Nintendo expected it to do Ocarina of Time numbers, and was given a massive advertising budget.", "start": 394.58, "duration": 5.66}, {"text": "The advertising was effective: All this time I genuinely thought it was so big it needed the Expansion Pak to run!", "start": 400.24, "duration": 5.92}, {"text": "ANNOUNCER: \"This is the first game to require the use of the N64 Expansion Pak!\"", "start": 406.16, "duration": 3.98}, {"text": "Yeah yeah yeah... but it just turns out that was all marketing spin.", "start": 410.14, "duration": 3.56}, {"text": "In reality, there was a game-breaking bug that Rare could not fix.", "start": 413.7, "duration": 4.14}, {"text": "The real reason DK64 required the Expansion Pak", "start": 417.84, "duration": 3.38}, {"text": "was that it was an easier fix for this bug that randomly crashed the game.", "start": 421.22, "duration": 3.92}, {"text": "It was a costly solution, but Nintendo needed their holiday hit.", "start": 425.26, "duration": 3.18}, {"text": "Delaying the game was out of the question.", "start": 428.44, "duration": 1.9}, {"text": "And also, the Expansion Pak didn't even fix the bug, only severely mitigated it:", "start": 430.34, "duration": 4.6}, {"text": "If left on for upwards to ten hours, the game will still crash.", "start": 434.94, "duration": 3.76}, {"text": "This really isn't a problem for N64 owners,", "start": 438.7, "duration": 2.34}, {"text": "however, for emulation and Virtual Console players using save states", "start": 441.04, "duration": 3.46}, {"text": "instead of saving and exiting the game like you normally would, this is still a problem.", "start": 444.5, "duration": 3.98}, {"text": "The bug is apparently due to memory leakage,", "start": 448.48, "duration": 2.68}, {"text": "and may have been the result of an unseasoned development team within Rare.", "start": 451.16, "duration": 3.5}, {"text": "It's true that Rare as a company made some incredible games for the system,", "start": 454.66, "duration": 3.46}, {"text": "but for most of the DK64 development team, this was their first N64 game.", "start": 458.12, "duration": 4.8}, {"text": "According to some serious tea spilled by the members of the Conker's Bad Fur Day team,", "start": 463.14, "duration": 5.04}, {"text": "their game didn't need the Expansion Pak", "start": 468.18, "duration": 2.24}, {"text": "because they did a much better job optimizing the graphics than the DK64 team.", "start": 470.42, "duration": 4.42}, {"text": "SEAVOR: \"Donkey Kong 64... they did use it, didn't they?\"", "start": 474.84, "duration": 3.38}, {"text": "MARLOW: \"Indeed they did! They had to use it!\"", "start": 478.22, "duration": 3.46}, {"text": "SEAVOR: \"Which means that we did a much better job of optimizing the game!\"", "start": 481.68, "duration": 3.68}, {"text": "MARLOW: \"There's also a good story behind why that happened.\"", "start": 485.36, "duration": 2.1}, {"text": "Whoo! Damn, that is some serious shade!", "start": 487.46, "duration": 2.74}, {"text": "Anyway, this leaves in two places: Either the Expansion Pak just fixes the bug, or it does more than fix the bug.", "start": 490.3, "duration": 6.62}, {"text": "If the problem solely was the bug, then... technically, DK64 can run with the standard Jumper Pak.", "start": 497.32, "duration": 6.7}, {"text": "Theoretically, if some genius could hack the system with a GameShark or something like that,", "start": 504.04, "duration": 4.18}, {"text": "or get around the check for the Expansion Pak at startup, the game would run just fine!", "start": 508.22, "duration": 4.94}, {"text": "I mean, it would probably still crash all the time,", "start": 513.16, "duration": 2.3}, {"text": "but if it's true that it just fixed the bug, it shouldn't need the extra RAM to run,", "start": 515.46, "duration": 4.3}, {"text": "and the Expansion Pak... even more useless than I thought.", "start": 519.76, "duration": 3.08}, {"text": "But here's what I can't figure out: DK64 was released November 1999,", "start": 522.98, "duration": 4.56}, {"text": "but the announcement that it would require the Expansion Pak came in May, six months earlier.", "start": 527.54, "duration": 5.24}, {"text": "Six months!!", "start": 532.94, "duration": 1.6}, {"text": "And there's no telling when that decision was made internally at Nintendo.", "start": 534.54, "duration": 3.26}, {"text": "Now, I'm no programmer, but that's not exactly the eleventh hour.", "start": 537.8, "duration": 4.22}, {"text": "If the Expansion Pak just fixes the bug, that means, with at least six months of development left,", "start": 542.12, "duration": 6.36}, {"text": "nobody said: \"Well, since we have to use the Expansion Pak,\"", "start": 548.48, "duration": 3.84}, {"text": "\"might as well beef up the graphics and framerate while we're at it.\"", "start": 552.32, "duration": 2.64}, {"text": "Now, it's totally possible that no-one said that,", "start": 554.96, "duration": 2.52}, {"text": "but when the truth came out about the bug, the world seemed to declare \"Okay, case closed!\",", "start": 557.48, "duration": 4.4}, {"text": "but there are still mysteries yet to be solved with DK64.", "start": 561.88, "duration": 3.6}, {"text": "And one last thing:", "start": 565.48, "duration": 1.46}, {"text": "People are too harsh on this game!", "start": 567.36, "duration": 1.76}, {"text": "It definitely ain't no masterpiece, and probably the weakest of Rare's N64 platformers,", "start": 569.26, "duration": 5.18}, {"text": "but this deserves a remaster and a second chance!", "start": 574.44, "duration": 2.72}, {"text": "Moving on, another game that requires the Expansion Pak: The Legend of Zelda: Majora's Mask.", "start": 577.44, "duration": 5.34}, {"text": "Majora's relationship with the Red Top isn't as juicy as DK64's, but it's still really interesting,", "start": 582.86, "duration": 5.8}, {"text": "and again, for funsies, here's what it looks like when you boot it up with the Jumper Pak.", "start": 588.66, "duration": 3.98}, {"text": "It's weird how some of the text is blurry.", "start": 592.74, "duration": 1.76}, {"text": "It's just text, what's the deal?!", "start": 594.5, "duration": 1.74}, {"text": "The Legend of Zelda and the Expansion Pak go way back.", "start": 596.56, "duration": 3.14}, {"text": "Both Zelda 64s were at some point planned for the ill-fated disc addon, the 64DD,", "start": 599.72, "duration": 5.72}, {"text": "which, like I stated earlier, is what the Expansion Pak was originally made for.", "start": 605.44, "duration": 3.96}, {"text": "However, like a lot of 64DD games, Ocarina shipped without Expansion Pak support,", "start": 609.4, "duration": 5.54}, {"text": "though there are beta versions of Ocarina that require the Expansion Pak,", "start": 614.94, "duration": 3.46}, {"text": "though they may have been tech demos for the slightly improved GameCube version,", "start": 618.4, "duration": 4.04}, {"text": "as evidenced by the 2003 copyright on the title screen.", "start": 622.44, "duration": 3.18}, {"text": "For a hot minute, there was a third Zelda project separate from Majora's Mask,", "start": 625.74, "duration": 4.42}, {"text": "an expansion for Ocarina called Ura Zelda for the 64DD.", "start": 630.16, "duration": 3.94}, {"text": "(Expansions are what they used to call DLC, children!)", "start": 634.18, "duration": 2.94}, {"text": "From the ashes of Ura Zelda rose the Master Quest mode,", "start": 637.2, "duration": 3.58}, {"text": "which found its way to a port on the GameCube and the 3DS remake.", "start": 640.78, "duration": 3.52}, {"text": "Now what does any of this have to do with the follow-up, Majora's Mask?", "start": 644.3, "duration": 3.72}, {"text": "Majora runs on the Ocarina engine and reuses a ton of assets,", "start": 648.08, "duration": 4.44}, {"text": "so I've never understood why exactly this game requires the Expansion Pak.", "start": 652.52, "duration": 4.36}, {"text": "And listen, what I mean by that is it's clear what the Expansion Pak does to Majora's Mask:", "start": 656.88, "duration": 4.54}, {"text": "Its graphical improvements over Ocarina are numerous and well documented.", "start": 661.42, "duration": 3.6}, {"text": "However, why was the Expansion Pak not optional?", "start": 665.02, "duration": 2.98}, {"text": "The closest explaination I can find is that Majora had a very short development time.", "start": 668.0, "duration": 4.74}, {"text": "The story goes that because Ocarina took four years to make,", "start": 672.74, "duration": 3.18}, {"text": "Shigeru Miyamoto wanted a fast turn-around for the next Zelda game.", "start": 675.92, "duration": 3.48}, {"text": "Eiji Aonuma was given the baton, and made Majora's Mask in just one year.", "start": 679.46, "duration": 5.1}, {"text": "Even reusing the Ocarina engine and its assets,", "start": 684.68, "duration": 3.1}, {"text": "it's possible the team didn't have the time to make Majora optimized for the Jumper Pak.", "start": 687.78, "duration": 4.92}, {"text": "But I think it's deeper than even that:", "start": 692.7, "duration": 1.76}, {"text": "It needed the extra RAM for its landmark time mechanic.", "start": 694.46, "duration": 3.66}, {"text": "The world of Majora's Mask is filled with dozens of NPCs,", "start": 698.12, "duration": 3.5}, {"text": "and keeping track of their location and your progress with their side missions at all times", "start": 701.62, "duration": 4.74}, {"text": "was a massive memory hog!", "start": 706.36, "duration": 1.68}, {"text": "I imagine it's similar to how the PS3 and 360 versions of Shadow of Mordor", "start": 708.04, "duration": 4.8}, {"text": "have a greatly reduced Nemesis system because those previous-generation systems just don't have the specs!", "start": 712.84, "duration": 5.52}, {"text": "I think it's possible that Majora is the inverse of DK64:", "start": 718.36, "duration": 3.52}, {"text": "Aonuma knew that the time mechanic wouldn't be possible without the extra RAM,", "start": 721.88, "duration": 4.4}, {"text": "so they improved the visuals while they were at it!", "start": 726.28, "duration": 2.74}, {"text": "This is one of the few times the Expansion Pak was used to push the limits of gameplay, not just graphics.", "start": 729.02, "duration": 5.8}, {"text": "Eugh, or maybe I'm just stretching here.", "start": 734.82, "duration": 2.3}, {"text": "But wouldn't it be just like Nintendo to be the only ones who knew how to properly use their hardware?", "start": 737.12, "duration": 5.0}, {"text": "At any rate, despite requiring the Red Top,", "start": 742.12, "duration": 2.52}, {"text": "Majora's Mask still sold well, though not quite as well as Ocarina.", "start": 744.64, "duration": 3.48}, {"text": "And even though it was a divisive game for fans at the time,", "start": 748.12, "duration": 3.04}, {"text": "from here, Aonuma would become the shepherd of the Legend of Zelda series for Nintendo.", "start": 751.16, "duration": 4.68}, {"text": "Even though it's probably the smartest and best use of the Expansion Pak,", "start": 755.84, "duration": 3.86}, {"text": "Majora is still a little rough around the edges,", "start": 759.7, "duration": 2.56}, {"text": "the best way to play this game today is on the 3DS remake.", "start": 762.26, "duration": 2.9}, {"text": "Still, diehard Majora fans need to recognize that without this little buddy here,", "start": 765.16, "duration": 4.48}, {"text": "we would have never had this game.", "start": 769.64, "duration": 1.72}, {"text": "Next, it's Perfect Dark.", "start": 771.72, "duration": 1.58}, {"text": "Now, when I said that there are three games that require the Expansion Pak, that's not exactly true.", "start": 773.3, "duration": 5.22}, {"text": "Huge portions of this game are inaccessible without the extra memory,", "start": 778.6, "duration": 3.4}, {"text": "but you still can play Perfect Dark on a Jumper Pak.", "start": 782.0, "duration": 2.8}, {"text": "That's even advertised on the box: 65% of this game requires the Expansion Pak!", "start": 784.8, "duration": 5.24}, {"text": "This is not the only game to do this, we'll get to that in a second,", "start": 790.04, "duration": 2.94}, {"text": "but it's without a doubt the most well-known example.", "start": 792.98, "duration": 2.3}, {"text": "Now, it might look like there's next to nothing you can do without the Expansion Pak, but that's not true!", "start": 795.3, "duration": 4.84}, {"text": "Booting up with the Jumper Pak grants you access to the \"Small but Perfect\" menu,", "start": 800.14, "duration": 4.16}, {"text": "- Yeah, that's that classic Rare humor for ya -", "start": 804.3, "duration": 2.28}, {"text": "which lets you play one of the most robust multiplayer modes in the history of video games!", "start": 806.58, "duration": 5.0}, {"text": "You're only allowed two human players, but you can still fill matches with eight computer bots!", "start": 811.7, "duration": 4.66}, {"text": "There are so many guns, levels, modes of play,", "start": 816.36, "duration": 2.9}, {"text": "for my money, this is the real star of Perfect Dark.", "start": 819.26, "duration": 2.78}, {"text": "So what if you can't do four-player splitscreen?!", "start": 822.06, "duration": 2.2}, {"text": "You can still get dumb as hell with eight bots and nothing but N-Bombs, baby!", "start": 824.26, "duration": 4.8}, {"text": "Yeah, just look at this unplayable mess! It's so beautiful!", "start": 829.26, "duration": 3.3}, {"text": "So the Expansion Pak is optional, but you can still have a hell of a time without one.", "start": 832.62, "duration": 3.78}, {"text": "With the Expansion Pak though, you are allowed four-player in the Combat Simulator,", "start": 836.48, "duration": 3.56}, {"text": "as well as access to all things related to the single-player campaign,", "start": 840.04, "duration": 3.32}, {"text": "including the Co-Operative and still almost one-of-a-kind Counter-Operative mode.", "start": 843.36, "duration": 4.44}, {"text": "And of course, you also have the option to change the screen size, resolution and aspect ratio,", "start": 847.96, "duration": 4.72}, {"text": "but no setting keeps this game from some serious chug action.", "start": 852.68, "duration": 3.62}, {"text": "Like we pointed out in previous episodes, once you've played the HD version on XBLA or in Rare Replay,", "start": 856.34, "duration": 6.14}, {"text": "there's just no going back, it's such an enormous improvement.", "start": 862.48, "duration": 3.12}, {"text": "But few games push the limits of not just the N64, but ANY console, like Perfect Dark,", "start": 865.6, "duration": 5.44}, {"text": "and watching this game struggle to run on an actual N64 is still a thing of wonder!", "start": 871.04, "duration": 4.96}, {"text": "But hold on, here's something that I think holds the HD versions back:", "start": 876.14, "duration": 3.74}, {"text": "If you're playing on Xbox, you cannot play multiplayer with guests.", "start": 879.88, "duration": 3.7}, {"text": "All players have to have an Xbox Live account to play any form of multiplayer.", "start": 883.7, "duration": 4.62}, {"text": "No Combat Simulator, no Co-Op, no Counter-Op, it's stupid!", "start": 888.32, "duration": 3.42}, {"text": "What if me and my friends are drunk and just wanna play now?!", "start": 891.74, "duration": 2.68}, {"text": "What if most of us bought PS4s and don't remember our Xbox emails and passwords?!", "start": 894.42, "duration": 4.14}, {"text": "What's wrong with guests?!", "start": 898.56, "duration": 1.68}, {"text": "You know what you need to play multiplayer on an N64?", "start": 900.24, "duration": 2.56}, {"text": "Extra controllers and maybe the Expansion Pak, that's it!", "start": 902.8, "duration": 3.36}, {"text": "God, the future can be lame sometimes.", "start": 906.22, "duration": 2.48}, {"text": "And Perfect Dark isn't the only game that hides huge portions of its game behind the Expansion Pak.", "start": 908.7, "duration": 4.68}, {"text": "Starcraft 64 requires it to play the Brood War campaign,", "start": 913.38, "duration": 3.98}, {"text": "-- which is fitting, as that was the PC game's expansion -- and the multiplayer.", "start": 917.36, "duration": 4.08}, {"text": "I know that doesn't sound like a big deal,", "start": 921.6, "duration": 1.9}, {"text": "I mean, if you wanna play Starcraft and Brood War, it's VERY available on PC.", "start": 923.5, "duration": 5.16}, {"text": "But the big deal here is the split-screen multiplayer.", "start": 928.66, "duration": 2.7}, {"text": "Now, for some of you, the idea of split-screen Starcraft sounds absurd,", "start": 931.36, "duration": 4.36}, {"text": "but like I pointed out in earlier episodes, it's pretty damn unique!", "start": 935.72, "duration": 4.24}, {"text": "Starcraft when you and your opponent can see each other's screens", "start": 939.96, "duration": 3.88}, {"text": "drastically changes the multiplayer dynamic!", "start": 943.84, "duration": 2.46}, {"text": "And you can only get that with the N64 Expansion Pak!", "start": 946.3, "duration": 3.12}, {"text": "Furthermore, it is damn impressive how well this game actually plays on an N64 controller.", "start": 949.42, "duration": 5.36}, {"text": "I really can't say enough how mind-bogglingly good this game is!", "start": 954.78, "duration": 3.76}, {"text": "And this is now the third time we've mentioned Starcraft 64 in a video!", "start": 958.54, "duration": 3.82}, {"text": "[party horns]\nWe did it!", "start": 962.36, "duration": 0.82}, {"text": "[applause]\nOh, I never thought we'd get here people!", "start": 963.18, "duration": 1.6}, {"text": "[applause]\nOh, I'm so happy, I just...", "start": 964.78, "duration": 2.1}, {"text": "[applause]\nOh, so... I just wanna...", "start": 966.88, "duration": 1.9}, {"text": "[applause]\nI just wanna thank my parents...", "start": 968.78, "duration": 1.24}, {"text": "Next up, another N64 technical marvel: Resident Evil 2.", "start": 970.56, "duration": 4.2}, {"text": "As expected, the Expansion Pak adds more texture detail,", "start": 974.76, "duration": 3.2}, {"text": "but nothing that'll make you toss out your PlayStation 1 version.", "start": 977.96, "duration": 2.86}, {"text": "We've read claims of higher-resolution cutscenes, but... nyeh.", "start": 980.92, "duration": 3.94}, {"text": "Look, it's still a miracle the cutscenes were all somehow crammed into this cartridge,", "start": 985.04, "duration": 4.82}, {"text": "but I couldn't spot any differences, so nothing too exciting, I know.", "start": 989.86, "duration": 3.14}, {"text": "But I only bring this up because we discovered something odd about Resident Evil 2 64:", "start": 993.0, "duration": 4.28}, {"text": "When we mentioned this game on our Resident Evil 2 episode of Punching Weight,", "start": 997.28, "duration": 3.18}, {"text": "we came across a production problem:", "start": 1000.46, "duration": 2.08}, {"text": "With the Expansion Pak, the game shifts resolutions constantly,", "start": 1002.54, "duration": 3.48}, {"text": "sometimes when moving to a new camera angle, or sometimes when opening and closing the menu,", "start": 1006.02, "duration": 4.26}, {"text": "and every time, our capture card cut the video feed for a few seconds to re-adjust,", "start": 1010.28, "duration": 4.72}, {"text": "making it impossible to play, especially in the very beginning.", "start": 1015.0, "duration": 3.74}, {"text": "We needed a Jumper Pak to get footage, but I didn't think to take the Jumper Pak out of storage, because...", "start": 1018.74, "duration": 5.96}, {"text": "... why would I ever need my Jumper Pak ever again?!", "start": 1024.8, "duration": 2.26}, {"text": "It had actually been sitting in the same place for the last 20 years: Inside my DK64 box!", "start": 1027.06, "duration": 5.74}, {"text": "We had to buy another Jumper Pak.", "start": 1032.8, "duration": 2.1}, {"text": "Because look, every time the footage grays out or skips ahead a few seconds, the video is cutting out!", "start": 1034.9, "duration": 5.38}, {"text": "Every time you see that, I'm flying completely blind for a few seconds!", "start": 1040.28, "duration": 4.12}, {"text": "It was so frustrating, but there must be some impressive behind-the-curtain tech running this game,", "start": 1044.4, "duration": 6.02}, {"text": "because no other N64 game we tested had this many graphical shifts.", "start": 1050.42, "duration": 4.36}, {"text": "And we think that's actually pretty awesome!", "start": 1054.78, "duration": 1.88}, {"text": "Also, I found out that some Jumper Paks come with stickers, and some don't.", "start": 1056.76, "duration": 3.54}, {"text": "So thank you for almost derailing an entire episode, Resident Evil 2 64!", "start": 1060.44, "duration": 4.74}, {"text": "But you're a fascinatingly weird game, and we love you.", "start": 1065.36, "duration": 2.8}, {"text": "Oh, and on the topic of games where the Expansion Pak gave me some trouble,", "start": 1068.58, "duration": 3.3}, {"text": "here's a fun little aside: Space Station Silicon Valley!", "start": 1071.88, "duration": 2.92}, {"text": "This cult favorite platformer from the people that would one day give us GTA III", "start": 1074.8, "duration": 4.0}, {"text": "is not Expansion Pak compatible, but will still sometimes crash with the Expansion Pak.", "start": 1078.8, "duration": 5.02}, {"text": "Again, usually games that don't support the Expansion Pak play no differently with the Expansion Pak,", "start": 1083.82, "duration": 4.46}, {"text": "but Space Station Silicon Valley is the only game with this problem, as far as we could tell,", "start": 1088.28, "duration": 4.48}, {"text": "which is good news, because all this time I thought something was wrong with my cart!", "start": 1092.76, "duration": 3.36}, {"text": "Okay, we're gettin' down to the end here,", "start": 1096.26, "duration": 1.58}, {"text": "next we're gonna look at three Midway games where the Red Top does more than just improve the graphics:", "start": 1097.84, "duration": 4.96}, {"text": "Hydro Thunder, Gauntlet Legends and San Francisco Rush 2049.", "start": 1102.8, "duration": 3.76}, {"text": "The Expansion Pak is required to play Gauntlet Legends with more than two players,", "start": 1106.72, "duration": 4.08}, {"text": "and Hydro Thunder with more than three players.", "start": 1110.8, "duration": 2.02}, {"text": "I think this is kind of interesting, because both of these games were also released on the Dreamcast,", "start": 1112.82, "duration": 4.46}, {"text": "a system that also had four controller ports.", "start": 1117.28, "duration": 2.42}, {"text": "However, Hydro Thunder on the Dreamcast is only two players.", "start": 1119.7, "duration": 3.8}, {"text": "Now, years later, Hydro Thunder would appear on Midway Arcade Treasures 3", "start": 1123.64, "duration": 3.82}, {"text": "for the PlayStation 2, GameCube and Xbox,", "start": 1127.46, "duration": 2.08}, {"text": "but the version in this bundle was apparently just a port of the Dreamcast version,", "start": 1129.54, "duration": 3.72}, {"text": "which means the N64 Expansion Pak version is the only one with a four-player mode!", "start": 1133.26, "duration": 4.82}, {"text": "I never felt compelled to own the N64 port of Hydro Thunder,", "start": 1138.08, "duration": 4.08}, {"text": "-- you're looking at the Dreamcast version here, by the way --", "start": 1142.16, "duration": 2.06}, {"text": "but after learning this little factoid, I think I might have to track this version down!", "start": 1144.22, "duration": 3.88}, {"text": "As for Gauntlet Legends, while the box says it's designed for the Expansion Pak,", "start": 1148.28, "duration": 3.96}, {"text": "it doesn't explicitly say it's required for three or four players,", "start": 1152.24, "duration": 3.6}, {"text": "which must have ruined at least a few game nights back in the day!", "start": 1155.84, "duration": 3.2}, {"text": "And lastly, San Francisco Rush 2049:", "start": 1159.24, "duration": 3.1}, {"text": "An entire track and racing circuit is locked without the Expansion Pak,", "start": 1162.34, "duration": 3.88}, {"text": "plus changeable rims and music in arcade races.", "start": 1166.22, "duration": 3.28}, {"text": "In this instance, you're probably better off just getting the Dreamcast version,", "start": 1169.5, "duration": 3.48}, {"text": "or playing it on the Midway Arcade Treasures 3 compilation I just mentioned.", "start": 1172.98, "duration": 3.64}, {"text": "And there's a bunch of other trivia,", "start": 1176.68, "duration": 1.36}, {"text": "like the PAL-exclusive F-1 World Grand Prix II, a game I've never played myself,", "start": 1178.04, "duration": 5.58}, {"text": "apparently requires the Expansion Pak to view full race replays.", "start": 1183.62, "duration": 3.76}, {"text": "I read on Wikipedia that Shadowgate 64 has unlisted Expansion Pak support,", "start": 1187.38, "duration": 4.3}, {"text": "but I tested that for myself, and there are no graphical options in the game, and I didn't notice any difference.", "start": 1191.68, "duration": 5.94}, {"text": "That's Wikipedia for ya.", "start": 1197.62, "duration": 1.3}, {"text": "NBA Jam 2000 mentions \"Jaw-dropping Ultra Hi-Rez™ graphics\" on the back of the box,", "start": 1199.16, "duration": 5.02}, {"text": "but doesn't indicate that without an Expansion Pak, your jaw will remain un-dropped.", "start": 1204.18, "duration": 4.14}, {"text": "Re-Volt unlocks a medium resolution mode with the Expansion Pak, which doubles the resolution,", "start": 1208.32, "duration": 4.86}, {"text": "however, with a cheat code you can unlock an even higher quality!", "start": 1213.18, "duration": 3.3}, {"text": "But I don't have a copy myself, so I couldn't say if that makes it look or run better than the Dreamcast version.", "start": 1216.48, "duration": 5.12}, {"text": "And that just about covers it, so I wanna say thank you so much--", "start": 1221.82, "duration": 3.3}, {"text": "MATT: Now wait just a damn minute there, Derek!", "start": 1225.12, "duration": 2.38}, {"text": "DEREK: Wait a minute, that voice sounds familiar...", "start": 1227.58, "duration": 2.08}, {"text": "MATT: You weren't thinking of wrapping this thing up without...", "start": 1229.66, "duration": 2.54}, {"text": "... um, mentioning a little thing called the Turok games?!", "start": 1232.2, "duration": 3.0}, {"text": "[applause]\nDEREK: Oh, hello there Mr. McMuscles! And, well... yeah,", "start": 1235.2, "duration": 2.86}, {"text": "all the Turok games do is increase the graphics, but at the cost of the framerate.", "start": 1238.06, "duration": 4.54}, {"text": "And those games already ran kinda shitty.", "start": 1242.6, "duration": 1.7}, {"text": "MATT: [sigh] Derek, Derek, Derek, sweet child... you're not thinking Punching Weight enough!", "start": 1244.3, "duration": 5.44}, {"text": "You're forgetting that the Turok games have cheats!", "start": 1249.74, "duration": 2.78}, {"text": "Cheats that mess with the graphics!", "start": 1252.52, "duration": 2.217}, {"text": "And there's some fun to be had, and besides,", "start": 1254.737, "duration": 3.383}, {"text": "you're always fuckin' ragging on Turok games and everyone dislikes that!", "start": 1258.12, "duration": 4.4}, {"text": "Allow me to grab the wheel from you for just a minute.", "start": 1262.52, "duration": 4.68}, {"text": "DEREK: Alright, fine Matt, hit 'em with that Turok Dinosaur Hunter knowledge!", "start": 1267.2, "duration": 3.52}, {"text": "MATT: Okay, look, there are four Turok games released on the N64, and they were The Best!", "start": 1270.72, "duration": 4.74}, {"text": "And all but the first one use the Expansion Pak, not that they needed it!", "start": 1275.46, "duration": 4.58}, {"text": "And for the record, Mr. Alexander didn't mention this at the top,", "start": 1280.04, "duration": 3.48}, {"text": "but Turok 2: Seeds of Evil, released late October 1998,", "start": 1283.52, "duration": 5.06}, {"text": "was the first game to support the Expansion Pak, edging out, y'know, the pretenders,", "start": 1288.58, "duration": 4.92}, {"text": "like Quarterback Club 99, Top Gear Overdrive, FIFA, all that shit,", "start": 1293.5, "duration": 4.42}, {"text": "even Star Wars: Rogue Squadron by a few weeks!", "start": 1297.92, "duration": 3.34}, {"text": "... at least in North America, okay, fine, I'll give you that.", "start": 1301.54, "duration": 3.36}, {"text": "Turok 2, Turok 3, and the spin-off Rage Wars offered the expected high-rez mode,", "start": 1304.9, "duration": 5.26}, {"text": "which, yeah, makes the graphics sharper, but the games run slightly slower.", "start": 1310.16, "duration": 4.5}, {"text": "It doesn't have cheats that improve graphics, like Re-Volt.", "start": 1314.66, "duration": 3.42}, {"text": "You can still have some fun comparing stuff like the Pen & Ink Mode cheat, a.k.a. Polygon Mode,", "start": 1318.08, "duration": 6.32}, {"text": "and the Gouraud Mode cheat, a.k.a. Texture Map Mode,", "start": 1324.4, "duration": 4.44}, {"text": "switching between high and low rez with the Expansion Pak and comparing the differences.", "start": 1328.84, "duration": 4.52}, {"text": "Ink & Paper Mode especially is a cool peek behind the curtain,", "start": 1333.36, "duration": 4.42}, {"text": "a clearer sense of just how much the Expansion Pak is improving the visuals, it's mindblowing!", "start": 1337.78, "duration": 5.28}, {"text": "I really wish the PS4 or modern PCs could keep up with this tech!", "start": 1343.06, "duration": 5.24}, {"text": "DEREK: Oh wow, that is really cool! But, y'know, it IS about time to wrap up,", "start": 1348.3, "duration": 3.48}, {"text": "and now that you're here, I think I know just how to do it:", "start": 1351.78, "duration": 3.8}, {"text": "With the most hilarious Expansion Pak compatible game!", "start": 1355.58, "duration": 2.74}, {"text": "MATT: Daikatana?", "start": 1358.42, "duration": 1.5}, {"text": "DEREK: Ooh, close, but no!", "start": 1359.98, "duration": 1.4}, {"text": "Xena: Warrior Princess!", "start": 1361.52, "duration": 1.94}, {"text": "MATT: You actually own Xena: Warrior Princess?", "start": 1363.46, "duration": 3.16}, {"text": "DEREK: Oh, I mean, I don't... but I know someone who does.", "start": 1366.62, "duration": 3.18}, {"text": "MATT: Um... I-- I don't know what you're talking about, Derek...", "start": 1369.8, "duration": 4.8}, {"text": "DEREK: Matt, we are doing important work here! Please! The world needs to know!", "start": 1374.6, "duration": 3.74}, {"text": "Does the Expansion Pak make Xena: Warrior Princess the greatest game ever made?!", "start": 1378.48, "duration": 4.62}, {"text": "MATT: Well, you ended the Nintendo 64 Mouse video with Superman 64,", "start": 1383.34, "duration": 4.48}, {"text": "We need another showstopper for this video, another Tidus joint!", "start": 1387.82, "duration": 4.62}, {"text": "Xena: Warrior Princess!!", "start": 1392.44, "duration": 2.38}, {"text": "DEREK: Ooh, the Talisman of Fate! So fancy!", "start": 1395.0, "duration": 2.46}, {"text": "Alright Matt, what're we lookin' at here?", "start": 1397.46, "duration": 1.56}, {"text": "MATT: Xena is a fighting game. A 3D fighting game!", "start": 1399.02, "duration": 3.8}, {"text": "DEREK: Oh wow, there aren't too many of those on the N64. That's pretty cool.", "start": 1402.82, "duration": 3.46}, {"text": "MATT: Well, it's... kind of a fighting ga-- it's barely kind of a game, beca-- let's just play it.", "start": 1406.28, "duration": 5.96}, {"text": "DEREK: Oh hell yeah, main girl, Xena: Warrior QUEEN.", "start": 1412.66, "duration": 2.62}, {"text": "And ladies and gentlemen, I think a storm is brewin'.", "start": 1416.02, "duration": 2.28}, {"text": "It's a fight!", "start": 1418.86, "duration": 0.92}, {"text": "Wow! And right out of the gate, Xena is playing the mind games!", "start": 1420.42, "duration": 3.24}, {"text": "Xena got her completely confused with this technique here!", "start": 1423.66, "duration": 2.82}, {"text": "MATT: Yeah, no, Derek, I concur! This is a really sound strategy! You can't beat this!", "start": 1426.48, "duration": 4.64}, {"text": "Oh wow! Wow, we haven't seen this technique done since...", "start": 1431.54, "duration": 3.76}, {"text": "DEREK: And now she's backing away to let the clock run out!", "start": 1435.3, "duration": 2.34}, {"text": "MATT: This is a sound strategy here.\nDEREK: Absolutely, Matt! Bold!", "start": 1437.64, "duration": 3.92}, {"text": "MATT: Bold! Bold! Bold strategy here!\nDEREK: Bold strategy. Very bold. Very bold.", "start": 1441.56, "duration": 3.68}, {"text": "DEREK: Matt, would you say this is a bold strategy here?\nMATT: Ooh, that's a bold strategy here!", "start": 1445.24, "duration": 4.32}, {"text": "DEREK: And again with the mind games!!", "start": 1450.06, "duration": 1.6}, {"text": "Oh my god, she's jumping, and jumping!", "start": 1451.66, "duration": 2.08}, {"text": "In all my years of broadcasting, I've never seen such command over the ring!", "start": 1453.74, "duration": 3.3}, {"text": "MATT: Now, now, this is a really great tactic by her, she's going to do...", "start": 1457.04, "duration": 3.7}, {"text": "DEREK: Yeah?\nMATT: Uh.... nothing.", "start": 1460.74, "duration": 2.78}, {"text": "MATT: That's good! That's good too!", "start": 1463.52, "duration": 1.78}, {"text": "DEREK: Matt, does this game still suck?", "start": 1467.62, "duration": 1.54}, {"text": "MATT: Yeap.", "start": 1469.36, "duration": 1.08}, {"text": "DEREK: Right on.", "start": 1470.66, "duration": 0.7}, {"text": "Thanks for watching everybody! Check out Matt's channel,", "start": 1471.36, "duration": 2.2}, {"text": "he is currently working through an amazing eight-part retrospective on the Prince of Persia games,", "start": 1473.56, "duration": 5.94}, {"text": "and it's over on Matt's Flophouse.", "start": 1479.5, "duration": 2.02}, {"text": "You are watching Stop Skeletons From Fighting, we are a Patreon-supported show,", "start": 1481.52, "duration": 4.76}, {"text": "huge shout-out to all of the wonderful people that you see on the screen right here,", "start": 1486.28, "duration": 4.44}, {"text": "they made this video possible.", "start": 1490.72, "duration": 2.04}, {"text": "Y'know who else made this video possible, our friend Alex from S House Studios,", "start": 1492.76, "duration": 3.8}, {"text": "thank you for helping out with the edit!", "start": 1496.56, "duration": 2.16}, {"text": "Again, to support the show at Patreon.com, one dollar goes a long way,", "start": 1498.72, "duration": 4.2}, {"text": "but two dollars gets you access to our activity feed and our private Discord,", "start": 1502.92, "duration": 5.52}, {"text": "check that stuff out, thank you so much for the support,", "start": 1508.44, "duration": 2.38}, {"text": "thanks so much for watching, and stay powerful!", "start": 1510.82, "duration": 1.99}]