[{"text": "The different servers in this game all have the same basic mechanics and gameplay.", "start": 15.924, "duration": 4.46}, {"text": "All the same stats are important for every build and all of the same build types can generally be found in most servers", "start": 20.424, "duration": 5.8}, {"text": "with the exception of the deep sea.", "start": 26.804, "duration": 2.54}, {"text": "The deep-sea or abyssal server has by far the most unorthodox, unintuitive, and unforgiving meta in the entire game.", "start": 29.804, "duration": 7.34}, {"text": "Sure, some other servers may have an extremely weird day/night cycle", "start": 37.744, "duration": 3.58}, {"text": "or constant damage dealt by the overworld", "start": 41.484, "duration": 2.2}, {"text": "or a really unbalanced meta where how good your build is gets defined by how well it can play around the top build", "start": 44.044, "duration": 5.38}, {"text": "But nothing comes close to how different the abyssal server is.", "start": 50.284, "duration": 2.92}, {"text": "It's so different that I actually can't even make a traditional tier list for it. Why?", "start": 53.504, "duration": 4.84}, {"text": "Well, because nobody knows what the meta really looks like down there.", "start": 58.784, "duration": 3.36}, {"text": "While data miners have managed to collect a few twitch clips and screenshots, for the most part the abyss is still a mystery.", "start": 62.204, "duration": 6.32}, {"text": "And this is because it's the only server in the game that's region-locked.", "start": 69.164, "duration": 3.36}, {"text": "The pressure setting on this server is so high that it will easily one-shot any player trying to get into the abyss.", "start": 72.524, "duration": 5.54}, {"text": "Conversely, the only way the abyssal player base can survive there is by speccing into extremely high internal pressure to counter it.", "start": 78.804, "duration": 6.32}, {"text": "But that means if they try to leave, they explode.", "start": 85.124, "duration": 3.32}, {"text": "Although there's not really any way to make a tier list for the abyss,", "start": 89.244, "duration": 3.04}, {"text": "I can still discuss the strategies that are popular in the meta and which abilities give you the best chance of success.", "start": 92.284, "duration": 5.56}, {"text": "You can pretty much just forget that the stealth stat even exists.", "start": 98.284, "duration": 3.4}, {"text": "There's no reason to waste any points on camouflage because there's no light down there.", "start": 102.024, "duration": 4.36}, {"text": "This is why every player there is just pale.", "start": 106.744, "duration": 2.4}, {"text": "Aesthetics, palette swaps, camouflage--all total wastes of evolution points.", "start": 109.884, "duration": 4.36}, {"text": "Now when I said there's no light, that isn't entirely true.", "start": 114.704, "duration": 2.88}, {"text": "There's no ambient light, but perhaps one of the most important abilities to learn how to use is bioluminescence.", "start": 118.164, "duration": 5.78}, {"text": "Over 90% of the playerbase uses this move, so mastering it is key to carving out a niche for yourself.", "start": 124.584, "duration": 5.06}, {"text": "One of the most common mistakes new players make is assuming that the best use of bioluminescence is to see.", "start": 130.384, "duration": 5.7}, {"text": "Make no mistake, trying to use bioluminescence as a flashlight in order to spot other players is easily the worst use of this ability.", "start": 136.804, "duration": 7.54}, {"text": "Bioluminescence won't help you find other players, but it will help other players find you.", "start": 145.224, "duration": 4.52}, {"text": "And so you need to be very careful about how you use this ability,", "start": 150.364, "duration": 2.7}, {"text": "otherwise you might end up giving your position away to an enemy player.", "start": 153.364, "duration": 2.88}, {"text": "The best uses for this ability are to communicate and to bait.", "start": 157.044, "duration": 3.52}, {"text": "Communication is pretty self-explanatory. You can use bioluminescence to talk to other players,", "start": 161.284, "duration": 4.3}, {"text": "signaling danger or finding other players to party up with.", "start": 166.024, "duration": 2.8}, {"text": "But perhaps the more infamous use of bioluminescence is as bait.", "start": 169.344, "duration": 3.58}, {"text": "Both viperfish and angler fish are both prime examples of this,", "start": 173.504, "duration": 3.24}, {"text": "using their glow to attract other players looking for a free win.", "start": 177.024, "duration": 3.04}, {"text": "Both are severely lacking in mobility and rely on their trap in order to get their targets within the striking range,", "start": 181.044, "duration": 4.9}, {"text": "but make up for it with their ridiculously high-damage bite attack.", "start": 185.974, "duration": 3.079}, {"text": "This can be a double-edged sword, though, since if a more powerful player is nearby, you're still giving away your location.", "start": 189.384, "duration": 6.06}, {"text": "A few other niche uses can be to use light as a distraction,", "start": 195.984, "duration": 2.66}, {"text": "almost like throwing a flashbang or flare,", "start": 198.844, "duration": 2.0}, {"text": "somewhat similar to the octopus's smokescreen ability.", "start": 201.184, "duration": 2.66}, {"text": "The other most important thing to know about the abyss meta is how to survive in a server", "start": 204.464, "duration": 3.34}, {"text": "centered not around plants and herbivores, but around scavengers.", "start": 207.804, "duration": 3.88}, {"text": "Without light, no loot actually spawns down there, at least not in the form of plants.", "start": 212.124, "duration": 4.16}, {"text": "Luckily, there's no better area in the game to be a scavenger", "start": 216.524, "duration": 2.96}, {"text": "because every elimination from the open ocean server leaves behind loot that fall to the abyssal seafloor.", "start": 219.484, "duration": 5.24}, {"text": "When a whale player gets defeated, it can turn the ocean floor into a year-long party", "start": 225.404, "duration": 4.4}, {"text": "where players that would normally be enemies come to enjoy the event together.", "start": 229.804, "duration": 3.2}, {"text": "One major player that tends to show up at these but is rarely seen anywhere else is the sleeper shark,", "start": 233.404, "duration": 4.76}, {"text": "a build which, admittedly, I should have included in my shark video.", "start": 238.164, "duration": 2.88}, {"text": "Sleeper sharks have the lowest mobility of any shark, instead having chosen to put their points into resistances", "start": 241.424, "duration": 5.04}, {"text": "like pressure resistance, acid resistance, and temperature resistance.", "start": 246.464, "duration": 3.48}, {"text": "And unlike certain other extremophiles, these perks actually come in handy at the bottom of the ocean, especially in your vents and volcanoes.", "start": 250.284, "duration": 6.5}, {"text": "Apparently this build has a great matchup against the colossal squid,", "start": 257.104, "duration": 3.1}, {"text": "but because neither the colossal squid nor sleeper shark have ever attended a major tournament,", "start": 260.584, "duration": 3.76}, {"text": "most players, myself included, have yet to see how on earth sleeper sharks can win that matchup.", "start": 264.524, "duration": 4.92}, {"text": "The last thing I want to highlight is the unmatched success of the tube worm.", "start": 269.824, "duration": 3.24}, {"text": "It's found a way to tap into an infinite source of XP.", "start": 273.424, "duration": 2.42}, {"text": "By making great use of the heat resistance perk, they've got completely uncontested control over one of the game's resources.", "start": 275.844, "duration": 6.14}, {"text": "Even sleeper sharks can't handle that level of heat.", "start": 282.524, "duration": 2.3}, {"text": "So these players can basically just farm as much XP as they want.", "start": 285.004, "duration": 3.26}, {"text": "Now if someone were to come up with a predator build that could resist the heat of the hydrothermal vent", "start": 288.624, "duration": 4.44}, {"text": "and also be powerful enough to pierce the armor of the tube worm,", "start": 293.264, "duration": 2.68}, {"text": "they could potentially get a really high score very quickly.", "start": 296.264, "duration": 2.48}, {"text": "But so far, it's never been done. And so for now, tube worms pretty much rule the abyss.", "start": 299.124, "duration": 3.9}, {"text": "Now one last thing you might notice is that none of these builds have any hair.", "start": 305.264, "duration": 3.16}, {"text": "Is this because mammals can't really survive in the abyss? Maybe.", "start": 308.944, "duration": 3.06}, {"text": "But it's also possible if the abyssal community happens to be huge fans of Dollar Shave Club.", "start": 312.224, "duration": 4.28}, {"text": "Dollar Shave Club has everything you need to help you look and feel your best, like toothpaste, body wash, and hair styling products.", "start": 316.964, "duration": 5.84}, {"text": "My personal favorite is their shave butter.", "start": 323.364, "duration": 2.08}, {"text": "Dollar Shave Club is basically giving away their daily essentials starter set to new members for only $5.", "start": 325.444, "duration": 4.88}, {"text": "The starter set features three trial-sized versions of their most popular products that help you stay fresh and clean, along with their executive razor.", "start": 330.764, "duration": 6.72}, {"text": "And by taking advantage of this special offer, you'll actually be supporting my channel in the process.", "start": 337.484, "duration": 4.32}, {"text": "This $5 offer is available at dollarshaveclub.com/tierzoo.", "start": 341.804, "duration": 3.7}, {"text": "Special thanks to Roman from Facts in Motion for teaching me some new tricks with After Effects that I used in this video", "start": 348.724, "duration": 5.36}, {"text": "Thanks for watching, and thanks especially to my patrons on Patreon.", "start": 354.464, "duration": 3.0}]