[{"text": "The sky is not blue – it’s mostly transparent\nair which is, at best, the color of whatever", "start": 1.319, "duration": 5.441}, {"text": "light it scatters. Sure, it does scatter blue\nlight more than red light; in fact, the higher", "start": 6.76, "duration": 4.329}, {"text": "the frequency of light, the more it gets scattered\nby the atmosphere, so ultraviolet scatters", "start": 11.089, "duration": 3.96}, {"text": "more than blue, which scatters more than green,\nmore than yellow, more than red, more than", "start": 15.049, "duration": 4.121}, {"text": "infrared – but still, only a tiny bit of\nlight scatters while most of it goes straight", "start": 19.17, "duration": 4.41}, {"text": "through, which is, you know, how the sun can\nlight up the ground, why we can see the moon", "start": 23.58, "duration": 4.599}, {"text": "and stars, etc.", "start": 28.179, "duration": 1.531}, {"text": "The sun itself actually emits a wide range\nof frequencies of light, and our human eyes", "start": 29.71, "duration": 4.45}, {"text": "perceive this particular combination as \"white”\nor neutral in color. The vast majority of", "start": 34.16, "duration": 4.919}, {"text": "the sky appears blueish because sunlight that\nwas trying to go somewhere else got scattered", "start": 39.079, "duration": 4.14}, {"text": "by the air and instead ended up in your eye.\nBummer. It still has a wide range of frequencies", "start": 43.219, "duration": 5.07}, {"text": "in it, but with slightly more blue than in\nwhite light, roughly the same amount of green,", "start": 48.289, "duration": 4.0}, {"text": "and less red.", "start": 52.289, "duration": 1.141}, {"text": "You can see a simple demonstration of this\non a computer if I take a white background,", "start": 53.43, "duration": 3.75}, {"text": "add a bit of deep blue and subtract a tiny\nbit of pure red: I get a nice sky color!", "start": 57.18, "duration": 5.129}, {"text": "And the reverse effect happens when you look\nnear the sun – light that was trying to", "start": 62.309, "duration": 3.521}, {"text": "get to your eyes gets scattered away, and\nso the remaining light has a lot less blue", "start": 65.83, "duration": 3.62}, {"text": "and slightly more red compared with white\nlight, which is why the sun and the sky directly", "start": 69.45, "duration": 4.16}, {"text": "around it appear yellowish during the day!\nAt sunset, there’s even more air for the", "start": 73.61, "duration": 4.23}, {"text": "light to scatter off of before it reaches\nyou, hence the even richer oranges and reds.", "start": 77.84, "duration": 4.61}, {"text": "And of course you can do the computer demo\nagain, this time subtracting pure blue and", "start": 82.45, "duration": 4.12}, {"text": "adding a little red: voila! Noontime sun.\nSubtract more blue and add even more red?", "start": 86.57, "duration": 6.2}, {"text": "Sunset orange.", "start": 92.77, "duration": 0.94}, {"text": "So, the sky is not blue; it’s a stage upon\nwhich all colors dance. Red colors tend to", "start": 93.71, "duration": 6.4}, {"text": "dance in straighter lines, green colors more\nrandomly, and deep blue colors dance the most", "start": 100.11, "duration": 4.78}, {"text": "frenetically of all. Yet at some point, they\nultimately dance their way into your eyes,", "start": 104.89, "duration": 5.22}, {"text": "and my eyes, and to the earth and into space,\nso that everyone everywhere can appreciate", "start": 110.11, "duration": 4.75}, {"text": "the grand ballet", "start": 114.86, "duration": 7.0}, {"text": "of light.", "start": 130.21, "duration": 7.0}]