[{"text": "We've probably all done this at some point or another whether it's with a gaming computer or with a car or", "start": 0.06, "duration": 5.1}, {"text": "camera setup or whatever the case may be you make a big", "start": 5.29, "duration": 3.68}, {"text": "major upgrade in this case I went from a 100 Hertz ultrawide monitor to a 200 Hertz one and the results are fantastic,", "start": 9.49, "duration": 7.549}, {"text": "but there's like a couple of things that are still noticeably", "start": 18.1, "duration": 4.309}, {"text": "imperfect. In this case when I have the full array local dimming on playing my", "start": 23.14, "duration": 4.459}, {"text": "recent game of choice", "start": 28.119, "duration": 1.32}, {"text": "which is Anno 1800 I get halos that follow around the cursor and there's no real way to avoid that", "start": 29.439, "duration": 5.99}, {"text": "until they can make monitors with so many local dimming zones that they're the size of a cursor.", "start": 35.59, "duration": 4.549}, {"text": "The other major one here is that the motion blur on it is frankly not that amazing,", "start": 40.48, "duration": 7.009}, {"text": "there is a fair bit of ghosting on this display in spite of all the tech that ASUS and Nvidia have packed into it.", "start": 47.489, "duration": 7.17}, {"text": "So,", "start": 54.94, "duration": 1.47}, {"text": "back to the thing that's probably happened to all of us I", "start": 56.41, "duration": 3.199}, {"text": "was both frustrated and also excited", "start": 60.129, "duration": 3.65}, {"text": "when I found out that just a few weeks after I made this upgrade", "start": 64.26, "duration": 4.34}, {"text": "LG came out with something that could solve all of my complaints while also being cheaper.", "start": 69.64, "duration": 7.34}, {"text": "This is the ultra wide 38GL950G.", "start": 77.32, "duration": 4.44}, {"text": "It's g-sync, It's up to 175 Hertz, it's ultra wide and", "start": 81.76, "duration": 5.96}, {"text": "it’s not only bigger at 38 vs. 35 inches, it’s even cheaper.", "start": 87.78, "duration": 6.62}, {"text": "So let's find out which one ends up on my desk at the end of this video.", "start": 94.46, "duration": 4.7}, {"text": "And the video is brought to you by Ridge wallet with a ridge wallet", "start": 100.2, "duration": 3.16}, {"text": "You can keep wallet bulge down thanks to its compact frame and rfid-blocking inter plates and you guys can use offer code", "start": 103.38, "duration": 6.69}, {"text": "LTTAUGUST to save 10% at the link below and get free worldwide shipping.", "start": 110.46, "duration": 4.42}, {"text": "*Intro*", "start": 114.96, "duration": 9.34}, {"text": "So even though this is not my first encounter with this monitor", "start": 124.44, "duration": 4.08}, {"text": "I actually saw LG show it off back at it was either CES or Computex this year", "start": 128.52, "duration": 4.83}, {"text": "I actually can't remember, but the thing is their main claim to fame with it the one", "start": 133.35, "duration": 6.23}, {"text": "millisecond response times with an IPS panel was something that at the time I was taking with a huge", "start": 139.58, "duration": 6.98}, {"text": "mountain of salt like this much salt because we've heard those kinds of claims from manufacturers before. The thing is", "start": 148.12, "duration": 7.36}, {"text": "LG has since elaborated on the technology that they're using in this display saying that their new way of", "start": 156.46, "duration": 7.08}, {"text": "creating an IPS display", "start": 163.78, "duration": 1.62}, {"text": "can achieve response times that are comparable to TN panels and", "start": 165.4, "duration": 3.889}, {"text": "the little brother of this monitor the 27-inch version has already made its way through our lab", "start": 170.2, "duration": 7.039}, {"text": "And here's the crazy thing the claims", "start": 178.12, "duration": 2.029}, {"text": "actually hold up.", "start": 180.76, "duration": 1.199}, {"text": "So what that means is that out of the two problems that I have with the PG 35 one of which being the", "start": 181.959, "duration": 5.54}, {"text": "halos that I can actually solve just by turning off the full array local dimming and", "start": 187.959, "duration": 4.64}, {"text": "the smearing when objects are moving around", "start": 193.269, "duration": 2.36}, {"text": "this one solves the only one that I cannot fix just by changing settings on the other monitor.", "start": 195.94, "duration": 7.009}, {"text": "This is shadow, by the way, this is our new rotten cat.", "start": 205.299, "duration": 4.61}, {"text": "Now before we go any further", "start": 210.73, "duration": 1.67}, {"text": "I felt like it was important to fire up so that it's fresh in my mind", "start": 212.4, "duration": 4.529}, {"text": "a game that supports HDR like shadow of the Tomb Raider", "start": 217.12, "duration": 2.75}, {"text": "to properly appreciate what the PG 35 brings to the table that", "start": 220.329, "duration": 4.97}, {"text": "LG's competitor simply doesn't and that is that full", "start": 225.85, "duration": 4.459}, {"text": "1,000 nits peak brightness", "start": 230.92, "duration": 1.98}, {"text": "HDR experience, that was such a", "start": 232.9, "duration": 2.51}, {"text": "wow factor for me when I first saw it on this monitor back when we shot the original video. It really does look spectacular.", "start": 235.989, "duration": 7.5}, {"text": "It makes lighting look more realistic.", "start": 244.04, "duration": 2.0}, {"text": "Yeah, it's kind of awesome. So that's gonna be hard to give up but the extra size not to mention the extra resolution", "start": 246.47, "duration": 8.0}, {"text": "and of course the", "start": 255.11, "duration": 2.0}, {"text": "quoted one millisecond response times", "start": 257.72, "duration": 2.239}, {"text": "may be enough to make up for it. Oh boy, I'm using it as a USB hub.", "start": 260.48, "duration": 5.419}, {"text": "Hopefully the LG has that feature otherwise I may actually not have enough USB ports.", "start": 267.44, "duration": 4.19}, {"text": "So we do have a two port USB hub DisplayPort and HDMI in I wouldn't recommend using HDMI in on this thing", "start": 271.63, "duration": 6.989}, {"text": "you're not gonna be getting the most out of it.", "start": 278.62, "duration": 3.69}, {"text": "That's pretty much it so actually pretty similar to the other one.", "start": 284.3, "duration": 3.23}, {"text": "Man, this thing is big. You know, it's only three inches bigger", "start": 288.05, "duration": 4.28}, {"text": "38 vs. 35 inches, but turns out that is a lot of panel", "start": 293.54, "duration": 5.059}, {"text": "Whoo", "start": 299.6, "duration": 1.44}, {"text": "Well, it's got RGB lighting that's for sure!", "start": 301.04, "duration": 2.0}, {"text": "Okay, so I think we're gonna have to make some adjustments to our resolution here, huh.", "start": 304.73, "duration": 4.429}, {"text": "G-sync display connected though that worked properly right out of the box.", "start": 309.71, "duration": 3.109}, {"text": "Let's see if we can fix what's going on here.", "start": 313.58, "duration": 2.659}, {"text": "‘Ey, there, it is. All right, we're running at 60 Hertz right now though. So let's get that fixed too.", "start": 317.06, "duration": 6.44}, {"text": "So thats it 3840 by 1600", "start": 323.62, "duration": 2.86}, {"text": "144 Hertz that appears to be working perfectly and", "start": 326.76, "duration": 2.98}, {"text": "we can already get some initial impressions for our pixel response times here just by having a look", "start": 330.32, "duration": 6.16}, {"text": "at what just dragging a window around looks like.", "start": 336.8, "duration": 2.809}, {"text": "Now you can see there's still a hint of yellow on the trailing edge as I drag this window to the right, but that is", "start": 340.42, "duration": 7.2}, {"text": "noticeably better than the other panel. Also, I haven't even had a look at the settings yet.", "start": 348.02, "duration": 6.56}, {"text": "So the response time is on fast, that's actually exactly where we want it", "start": 355.94, "duration": 3.9}, {"text": "faster is how you get to that one millisecond rating", "start": 360.65, "duration": 3.709}, {"text": "but what it also does is it introduces a bunch of visual artifacts that I personally find very", "start": 364.49, "duration": 5.869}, {"text": "obnoxious it kind of makes your games look like they're over sharpened", "start": 371.45, "duration": 3.109}, {"text": "and it's gross.", "start": 375.26, "duration": 1.87}, {"text": "Mmm, yeah this I think I've got a defective nipple here.", "start": 377.13, "duration": 3.35}, {"text": "Words you never thought you'd say!", "start": 382.02, "duration": 2.0}, {"text": "So thanks to the miracle of DisplayPort 1.4", "start": 384.78, "duration": 3.77}, {"text": "this guy can actually be overclocked to a 175 Hertz", "start": 389.22, "duration": 5.62}, {"text": "Theoretically it's fine, but you never know", "start": 395.7, "duration": 2.0}, {"text": "sometimes when manufacturers advertise an overclocking setting they're saying yeah", "start": 398.43, "duration": 4.639}, {"text": "tt should work", "start": 403.08, "duration": 0.89}, {"text": "but it might not. So interestingly just like on the ASUS if you crank", "start": 403.97, "duration": 5.55}, {"text": "everything so you want 10-bit color, you want a 175 Hertz, full native resolution,", "start": 409.95, "duration": 4.88}, {"text": "you're gonna go and you're gonna apply that and", "start": 415.11, "duration": 2.059}, {"text": "you're gonna discover that you've got these these pink", "start": 417.87, "duration": 3.41}, {"text": "fringing artifacts that are called chromatic aberration and it's caused by the lower", "start": 422.07, "duration": 5.45}, {"text": "chroma, subsampling here", "start": 427.98, "duration": 1.37}, {"text": "so you can see we're at YCBCR422.", "start": 429.35, "duration": 2.82}, {"text": "What we have to do if we want to get the best possible color performance, especially", "start": 432.45, "duration": 4.549}, {"text": "for things like text is", "start": 437.76, "duration": 2.0}, {"text": "lower our refresh rate to something more reasonable.", "start": 440.31, "duration": 2.059}, {"text": "Looks like we have to go all the way down to 120 Hertz in order to apply both 10-bit color and", "start": 443.16, "duration": 6.29}, {"text": "444.", "start": 450.54, "duration": 1.41}, {"text": "So my middle ground here is probably going to end up being", "start": 451.95, "duration": 3.619}, {"text": "144 Hertz", "start": 456.45, "duration": 1.32}, {"text": "8-bit color RGB and", "start": 457.77, "duration": 2.0}, {"text": "full dynamic range which should still allow us to turn on HDR.", "start": 460.02, "duration": 3.079}, {"text": "Now I did say that this wasn't gonna have the same kind of HDR capabilities as the ASUS monitor,", "start": 463.1, "duration": 6.57}, {"text": "but that doesn't mean that it isn't capable of HDR at all. So let's go ahead and fire up our game and", "start": 469.89, "duration": 5.66}, {"text": "see how it compares.", "start": 476.55, "duration": 2.0}, {"text": "Now the argument that ASUS made and actually Acer along with them for the previous", "start": 478.89, "duration": 5.63}, {"text": "144 Hertz 4k monitor that had that same issue when you took it beyond", "start": 484.89, "duration": 4.13}, {"text": "120 Hertz all the way to 144 with the chromatic aberration is that in games it's not that noticeable", "start": 489.54, "duration": 5.389}, {"text": "it's something that's more noticeable on the desktop, especially if you're looking at text so we'll give that a shot here", "start": 494.94, "duration": 6.47}, {"text": "but for my part I had found that I would rather", "start": 501.41, "duration": 4.05}, {"text": "not encounter it because a lot of games actually do have text in them.", "start": 506.44, "duration": 4.98}, {"text": "So HDR is working in the game, but it is immediately noticeable to me that it is", "start": 512.38, "duration": 5.76}, {"text": "not as good as the other display like you can see Lara's flashlight here and", "start": 519.1, "duration": 5.209}, {"text": "that's exactly what I mean. You can see the lens of Lara's flashlight", "start": 525.55, "duration": 5.989}, {"text": "on the PG 35 you can see a bright flare in your eyes as if you were looking directly into a flashlight.", "start": 532.15, "duration": 6.409}, {"text": "It really does make for a different experience. Now in some cases", "start": 539.29, "duration": 3.979}, {"text": "I do find that HDR can be kind of overdone in games like on the PG 35 a lot of these reflections off the rocks", "start": 543.27, "duration": 6.299}, {"text": "kind of are unrealistic it makes everything look kind of shiny like it's got an early 2000s vibe to me a little bit", "start": 551.68, "duration": 7.13}, {"text": "but while this looks all right", "start": 559.48, "duration": 2.239}, {"text": "I've definitely seen a couple things already where the HDR does not", "start": 562.09, "duration": 3.799}, {"text": "hold up to the PG 35 at less than half of the peak brightness", "start": 566.35, "duration": 4.639}, {"text": "I guess that kind of makes sense.", "start": 570.99, "duration": 1.54}, {"text": "And once again here we're definitely getting the benefit of the HDR mastered version of the game like it does", "start": 572.53, "duration": 7.25}, {"text": "look", "start": 580.18, "duration": 1.29}, {"text": "more dynamic, but there's less detail preserved up here where the light sources are really bright and", "start": 581.47, "duration": 6.409}, {"text": "it just looks", "start": 589.02, "duration": 2.0}, {"text": "more lifeless and in the case of something like foliage", "start": 591.54, "duration": 2.8}, {"text": "that matters that makes a difference to the immersion level of the game.", "start": 596.98, "duration": 3.169}, {"text": "Another interesting observation", "start": 600.64, "duration": 1.47}, {"text": "is that with no obvious way of turning it off so you can see I'm running in HDR and there is a setting in here", "start": 602.11, "duration": 7.22}, {"text": "for variable back light but it specifically says SDR variable back light and it's grayed out", "start": 609.46, "duration": 6.529}, {"text": "it appears as though in order to increase the", "start": 616.33, "duration": 3.26}, {"text": "the advertised contrast ratio of the display, they're actually dimming the entire", "start": 620.14, "duration": 6.349}, {"text": "backlight or brightening it depending on the kind of scene you're looking at. Now when you want good HDR you want high", "start": 627.42, "duration": 6.0}, {"text": "contrast, but an advertised", "start": 633.6, "duration": 2.5}, {"text": "contrast ratio that relies on", "start": 636.2, "duration": 2.0}, {"text": "dimming or brightening the entire backlight of the panel is not going to give you that high contrast within one scene,", "start": 638.33, "duration": 7.699}, {"text": "it's going to rely on actually brightening the display", "start": 646.279, "duration": 3.41}, {"text": "when moving from one place to another I don't know if you guys can see it that well on camera", "start": 650.33, "duration": 4.309}, {"text": "but it is very noticeable to the eye as I transition from looking into the cave here to looking at the waterfall.", "start": 654.64, "duration": 6.269}, {"text": "So I got to say I was sort of expecting", "start": 661.31, "duration": 2.0}, {"text": "the outcome to be", "start": 663.86, "duration": 1.8}, {"text": "LG clear winner plop it goes on the desk but up till this point in the video", "start": 665.66, "duration": 4.58}, {"text": "I am kind of leaning towards putting the ASUS", "start": 670.24, "duration": 2.339}, {"text": "back on here. With that said what we've looked at so far an HDR game is", "start": 673.49, "duration": 5.779}, {"text": "obviously an advantage for the PG 35", "start": 680.029, "duration": 2.69}, {"text": "now that I'm playing something that's a little bit more down to", "start": 683.3, "duration": 3.679}, {"text": "perfect image quality as I'm whipping around on the screen the LG comes into its own a little bit, like you can really notice it", "start": 687.5, "duration": 6.66}, {"text": "in the readability of this text as I'm panning around.", "start": 694.16, "duration": 4.04}, {"text": "See that everything is really crisp and really clean just like we observed on the 27-inch version of this monitor", "start": 698.92, "duration": 6.72}, {"text": "really impressive for an IPS display!", "start": 706.24, "duration": 2.0}, {"text": "All right, now we're up to a 175 Hertz. Oh boy, there's a lot of.. Okay I'm bailing.", "start": 708.96, "duration": 5.76}, {"text": "I gotta say I love the size of this thing", "start": 715.42, "duration": 2.6}, {"text": "Like there's not many monitors that just take up your entire field of view", "start": 718.73, "duration": 4.79}, {"text": "like I can only see a sliver this big a", "start": 723.52, "duration": 2.279}, {"text": "Little bit like that and like maybe this much on either side of it at a comfortable distance here.", "start": 725.87, "duration": 4.669}, {"text": "Oops!", "start": 734.99, "duration": 2.0}, {"text": "Yeah, I won, haha take that terrorists!", "start": 739.68, "duration": 2.44}, {"text": "Now, of course, I don't spend the majority of my gaming time playing Shadow the Tomb Raider or CS:GO at this point", "start": 743.64, "duration": 5.42}, {"text": "so unless this one offer is a tangibly better Anno", "start": 749.06, "duration": 4.54}, {"text": "1800 experience it probably doesn't make a ton of sense to change out to it.", "start": 753.74, "duration": 6.86}, {"text": "So as a game with no support for HDR", "start": 761.08, "duration": 2.359}, {"text": "It doesn't take advantage of the most advanced capabilities of either of these displays,", "start": 763.439, "duration": 4.98}, {"text": "but one thing that it has over the ASUS is its larger size", "start": 768.91, "duration": 5.029}, {"text": "like I said before 3 inches doesn't sound like much but you can see", "start": 773.939, "duration": 3.96}, {"text": "It's actually an enormous", "start": 778.75, "duration": 2.419}, {"text": "amount of display once it's in front of you and you've got a city that you're managing with it.", "start": 781.93, "duration": 5.479}, {"text": "So it's time to make a decision and the only honest conclusion", "start": 787.87, "duration": 3.919}, {"text": "is that whether it's at the low end or the high end there's always", "start": 791.79, "duration": 4.44}, {"text": "going to be trade-offs", "start": 796.75, "duration": 2.0}, {"text": "nothing can be the best of all worlds. This one right here has up to", "start": 799.0, "duration": 5.479}, {"text": "240 hertz refresh rate if you're willing to put up with some fringing, it's got g-sync ultimate for a", "start": 805.02, "duration": 5.3}, {"text": "noticeably like markedly better", "start": 811.32, "duration": 2.0}, {"text": "HDR experience, but it's gonna cost an extra", "start": 813.72, "duration": 4.1}, {"text": "$500 compared to this one, which is already pricey at about 2,000 US dollars", "start": 818.1, "duration": 6.1}, {"text": "and it gives up some other things. So the pixel response time is clearly, obviously,", "start": 825.0, "duration": 6.42}, {"text": "noticeably not as good and if you do things other than gaming like if you want to get some", "start": 831.76, "duration": 5.94}, {"text": "you know work done on the side, for example", "start": 838.29, "duration": 2.25}, {"text": "the extra screen real estate of a 38-inch vs. a 35 inch display can be a big difference maker.", "start": 840.85, "duration": 7.789}, {"text": "So,", "start": 850.269, "duration": 1.56}, {"text": "I have to make a decision now, one of these has to go back to the office.", "start": 851.829, "duration": 3.53}, {"text": "I can't be hoarding all the amazing monitors and", "start": 856.089, "duration": 2.719}, {"text": "that is it's a really tough call.", "start": 859.449, "duration": 2.72}, {"text": "Brandon what would you do?", "start": 865.84, "duration": 1.02}, {"text": "(Brandon) If Anno is the game you're playing the most...", "start": 866.86, "duration": 2.66}, {"text": "(Brandon) ...I feel like I'd go with the LG", "start": 869.52, "duration": 0.62}, {"text": "Go with the LG for Anno. But like\n(Brandon) Yeah.", "start": 871.18, "duration": 2.98}, {"text": "I would feel like I want to bring this one home to play Tomb Raider or Battlefield 5 anything with HDR support.", "start": 874.84, "duration": 6.22}, {"text": "You know what?", "start": 881.9, "duration": 2.0}, {"text": "Because they both cost the same to me...", "start": 884.18, "duration": 2.51}, {"text": "... I think I'm gonna keep the ROG swift on the desk, but at a $500 delta", "start": 887.84, "duration": 5.419}, {"text": "especially depending on what I was gonna do with it LG has made an absolutely incredible", "start": 893.96, "duration": 5.659}, {"text": "contender for top gaming monitor on the market. I mean either of these two if you were to buy them", "start": 900.38, "duration": 6.14}, {"text": "you'd be crazy not to be completely stoked on them.", "start": 907.49, "duration": 3.77}, {"text": "That's a such a cop-out conclusion, but I'm sorry guys they really are", "start": 911.86, "duration": 4.28}, {"text": "very", "start": 917.42, "duration": 0.5}, {"text": "evenly matched even though they're not equal.", "start": 918.82, "duration": 3.44}, {"text": "Speaking of", "start": 924.23, "duration": 1.95}, {"text": "things you'll be satisfied with our sponsor iFixit the iFixit essential electronics toolkit is compact so it can go", "start": 926.18, "duration": 7.64}, {"text": "anywhere that you can and you can use it to fix almost anything", "start": 934.07, "duration": 2.929}, {"text": "it includes their most popular", "start": 937.1, "duration": 1.92}, {"text": "precision bits and they're all held in place with high density foam so you don't have to worry about the bits falling out if you're", "start": 939.02, "duration": 6.2}, {"text": "you're throwing it around. It's got a lifetime warranty and you can get it at the link in the video description for just $24.99.", "start": 945.22, "duration": 5.789}, {"text": "So guys thanks for watching this video. If you disliked it, you can press that button,", "start": 951.35, "duration": 3.86}, {"text": "but if you liked it hit like get subscribed or maybe consider checking out where to buy the stuff we featured at the link below.", "start": 955.21, "duration": 4.889}, {"text": "Both of them are fantastic,", "start": 960.83, "duration": 1.8}, {"text": "both great choices just with pros and cons. Also link down", "start": 962.63, "duration": 3.739}, {"text": "there is our merch store which has cool shirts like this one and our community forum, which you should totally join.", "start": 966.37, "duration": 4.979}, {"text": "Oh yeah, you know what else our merch store has underwear! Yeah, that's right! That's right the underwear’s comin’ out!", "start": 971.349, "duration": 6.631}, {"text": "Oh yeah, Linus Tech Tips underwear seamless.", "start": 978.6, "duration": 3.72}, {"text": "See that? Seamless butt!", "start": 982.32, "duration": 0.92}]