[{"text": "Hi, Melvin asked me on Twitter if it is possible to make a bracelet that removes the static electricity from body and avoids shock", "start": 0.0, "duration": 7.17}, {"text": "Of course, there are these straps that ground the body and remove static electricity", "start": 7.66, "duration": 5.029}, {"text": "But is it possible to make a cordless one?", "start": 13.08, "duration": 2.8}, {"text": "And surely after I did a quick search, I found that there are these anti-static cordless bracelets like these", "start": 16.62, "duration": 5.28}, {"text": "and my reaction was well, these are scam", "start": 21.9, "duration": 3.22}, {"text": "I mean, how can you remove static electricity from your body without sending... put it in your pocket?", "start": 25.14, "duration": 5.34}, {"text": "You have...how these things sell on the web?", "start": 30.48, "duration": 2.61}, {"text": "under those people", "start": 33.64, "duration": 2.0}, {"text": "How does it work?! It is...", "start": 35.64, "duration": 1.93}, {"text": "See every time your body picks up static electricity say by walking with socks on the carpet", "start": 37.57, "duration": 5.19}, {"text": "the only way to get rid of them is to take", "start": 42.76, "duration": 2.14}, {"text": "Them and put them somewhere else like in the ground", "start": 45.04, "duration": 2.68}, {"text": "and that's what this wire does", "start": 47.72, "duration": 1.6}, {"text": "You can't just put those charges in a container and keep them in your pocket", "start": 49.32, "duration": 3.5}, {"text": "Dave Jones from the channel \"EEVblog\" which is a great electronic", "start": 53.32, "duration": 3.979}, {"text": "Teardown review and debunk channel has a great video about this and shows that these cordless bracelets are garbage", "start": 57.64, "duration": 6.259}, {"text": "Basically, they've showed the fake bracelet. He got online contained only a single 1 mega. Ohm resistor in it.", "start": 64.33, "duration": 6.619}, {"text": "And that's it", "start": 70.949, "duration": 1.99}, {"text": "Wow, what's the use of that is holding a resistor in my hands supposed to magically discharge my body", "start": 72.939, "duration": 6.11}, {"text": "It is very important to at least understand the tools you want to use for your work and educate yourself and not get scammed", "start": 79.049, "duration": 6.48}, {"text": "That's why this video is sponsored by", "start": 85.53, "duration": 2.339}, {"text": "Skillshare a great website where you can find online courses and learn whatever you like from a list of over", "start": 88.24, "duration": 5.8}, {"text": "23,000 classes to choose from for as low as $10 a month, but wait", "start": 94.7, "duration": 4.38}, {"text": "You're actually waiting the first 500 people to use my promo code here get two month of free Skillshare premium", "start": 99.64, "duration": 6.709}, {"text": "Check it out. Anyway, holding a 1 mega. Ohm resister does nothing. Why even 1 Meg when you can hold this your own screwdriver?", "start": 106.35, "duration": 6.959}, {"text": "Hmm that gives me an idea", "start": 114.43, "duration": 1.46}, {"text": "I was wondering if it is possible at all to have a standalone", "start": 115.89, "duration": 3.569}, {"text": "Bracelet that would dissipate charges and one thing came to mind", "start": 119.619, "duration": 3.23}, {"text": "Which is one of those punk rock bracelets with a bunch of spikes on them", "start": 122.85, "duration": 3.959}, {"text": "You might already know that electric charges accumulate on the sharp points in a conductor and so much charge in a time", "start": 126.81, "duration": 6.539}, {"text": "Point results in them repelling each other hard and dissipate into the air and environment", "start": 133.5, "duration": 4.589}, {"text": "You can easily see this when I run my Tesla coil", "start": 138.09, "duration": 2.52}, {"text": "So I thought with those Punk bracelets having so many metal spikes", "start": 149.86, "duration": 3.68}, {"text": "They potentially dissipate charges into the air quicker and drop my body voltage and reduce the risk of discharge and shock", "start": 153.54, "duration": 6.419}, {"text": "So here's the plan. I'm gonna buy one of those bracelets and to test it", "start": 159.96, "duration": 3.779}, {"text": "I'm going to charge myself using my vandegraaff and see if those spikes have any effect at all", "start": 163.74, "duration": 4.919}, {"text": "Granville Street in downtown Vancouver is one of those streets you can find some questionable stores in.Hopefully I can find what I need there", "start": 169.959, "duration": 7.67}, {"text": "Fantasy Factory eh? Let's check that jeez. That was the wrong shop. Let's check the rock shop", "start": 179.32, "duration": 6.139}, {"text": "Hopefully this one has it. This looks like the right store. Oh", "start": 185.47, "duration": 3.32}, {"text": "Oh,there we are", "start": 189.67, "duration": 1.92}, {"text": "Those are the kind of spikes I'm looking for.What in a rest band. That's what is that it holder or something", "start": 191.59, "duration": 6.589}, {"text": "I bought these two for a total of $70. That's a strange expense on my business card", "start": 198.18, "duration": 5.16}, {"text": "Well, I got this not very impressive one row of spikes bracelet", "start": 204.13, "duration": 3.859}, {"text": "But it's the pointiest one they had and then I found this one which is much point here. It's called a choker and", "start": 207.989, "duration": 6.24}, {"text": "They both have metal exposed on the back to touch my skin. Okay, let's do it without the spikes first. I", "start": 214.989, "duration": 5.45}, {"text": "Put my legs up", "start": 221.32, "duration": 2.0}, {"text": "Cars my buddy a little bit and then discharged. Oh", "start": 225.99, "duration": 4.229}, {"text": "That was painful, okay, let's do it the despites now, okay this time with the bracelets", "start": 232.0, "duration": 5.54}, {"text": "One two three, four five and discharge", "start": 241.52, "duration": 3.21}, {"text": "Absolutely, useless. Well, maybe the dome is charging my body too quickly. So let's do it more realistically I'm gonna touch that dose...ouch!", "start": 248.52, "duration": 6.949}, {"text": "charge my body first and then let go and then touch the ground...ah s***", "start": 256.29, "duration": 4.009}, {"text": "Hate surprises. Okay without the bracelet charging my body", "start": 261.02, "duration": 3.76}, {"text": "One...two...three...four...five and discharged", "start": 266.26, "duration": 3.04}, {"text": "One...two..three...four...five.And now with the bracelet", "start": 270.02, "duration": 4.28}, {"text": "One...two...three...four...five x2", "start": 275.68, "duration": 6.52}, {"text": "Useless", "start": 283.81, "duration": 1.169}, {"text": "Maybe it's not making a good contact to my body due to my massive fare", "start": 284.979, "duration": 4.07}, {"text": "So I'm gonna use aluminum foil to make sure that sparks are in good contact with each other and my body. Here we go", "start": 289.21, "duration": 6.949}, {"text": "One,two,three,four,five and one, two, three, four, five...S***!...Useless!", "start": 300.46, "duration": 5.8}, {"text": "F*** it,let's use the choker it's not gonna look good around your neck in the lab", "start": 308.54, "duration": 4.04}, {"text": "So I'm gonna put it around my wrist with the foil around it for good contact", "start": 312.58, "duration": 3.66}, {"text": "If this doesn't do it,nothing will here you go the SuperDuper anti-static bracelet", "start": 316.24, "duration": 5.279}, {"text": "Ok 1 2 3 4 5 and 1 2 3 4 5...S***", "start": 325.4, "duration": 7.34}, {"text": "What the hell?", "start": 333.66, "duration": 2.0}, {"text": "1 2 3 4 5 ... 1 2 3 4 5 ... S***!", "start": 336.4, "duration": 6.74}, {"text": "Completely useless I really thought this would do it", "start": 344.08, "duration": 3.2}, {"text": "I really thought having spikes on your body should help but maybe their effect is insignificant", "start": 347.49, "duration": 4.349}, {"text": "Compared to how your body already dissipates charges on its own now. Let's put on the", "start": 352.18, "duration": 4.52}, {"text": "Grounding strap and see how well that works", "start": 357.28, "duration": 2.48}, {"text": "One two three four five one two three...nothing", "start": 363.82, "duration": 6.479}, {"text": "Even having my hand completely on the dole. I don't feel any discharge", "start": 375.18, "duration": 3.69}, {"text": "Now instead of this strap I put my bare feet on the tiled ground", "start": 379.66, "duration": 3.919}, {"text": "They given the non-conductive piles the charge better than those stupid fights, well, you know what,", "start": 390.52, "duration": 5.959}, {"text": "It means if these spikes can't discharge you faster than your body's normal discharge rate", "start": 396.48, "duration": 5.279}, {"text": "Then there is nothing out there that can discharge you cordless Li all those cordless anti-static straps are just a pile of junk", "start": 401.76, "duration": 6.48}, {"text": "One note is that even in the corded straps? There is a one mega", "start": 408.82, "duration": 3.649}, {"text": "ohm resistance in series with the grounding wire", "start": 412.47, "duration": 2.25}, {"text": "You never want to directly connect your body to ground because in case you accidentally touch high-voltage you can easily get electrocuted", "start": 414.94, "duration": 7.43}, {"text": "The 1 mega ohm limits the current and saves you while it's good enough to get rid of static charges", "start": 422.53, "duration": 5.149}, {"text": "So make sure you have a properly grounded anti-static", "start": 427.68, "duration": 2.97}, {"text": "wristband or risk killing your naked electronics and", "start": 430.87, "duration": 2.929}, {"text": "start learning new things at skill share and make sure to use the promo code only the first", "start": 433.93, "duration": 4.879}, {"text": "500 people to sign up get the two-month free access to all the courses so you don't have any excuse not to learn I", "start": 439.0, "duration": 6.23}, {"text": "Personally like to check up my video editing skills a notch because it's taking forever as is", "start": 445.69, "duration": 4.64}, {"text": "There is this course on Adobe Premiere and it seems the entire course is less than three hours. I", "start": 450.73, "duration": 6.47}, {"text": "Can't take a lot of free courses in two months. I mean, I love to use that promo code", "start": 457.75, "duration": 4.64}, {"text": "I'll just ask one of my cousin's to sign up for me Oh", "start": 462.85, "duration": 2.6}, {"text": "Skillshare get it before my cousins take all the spots", "start": 466.66, "duration": 2.779}]