[{"text": "This episode is sponsored by Brilliant", "start": 0.0, "duration": 2.0}, {"text": "\"Omae wa mou shindeiru\"", "start": 14.36, "duration": 2.2}, {"text": "\"Nani?\"", "start": 16.56, "duration": 0.94}, {"text": "In every competitive game, it's inevitable that players will eventually discover ways to use the physics engine to their advantage", "start": 22.32, "duration": 6.66}, {"text": "From rocket jumping to wave dashing, dead angles to rocket rides.", "start": 29.58, "duration": 4.6}, {"text": "Emergent gameplay can be the key to taking your effectiveness as a player to the next level", "start": 34.32, "duration": 4.7}, {"text": "and Outside is no different. There are abilities in the game that the devs designed to be used one way", "start": 39.72, "duration": 5.0}, {"text": "But can also be extremely useful in entirely separate situations that the devs did not anticipate", "start": 44.78, "duration": 5.7}, {"text": "In this video, we'll look at four examples of builds tailored to take advantage of the physics and mechanics of the game", "start": 50.48, "duration": 4.68}, {"text": "first we have the trap-jaw ant", "start": 56.61, "duration": 2.0}, {"text": "This build is min/max to maximize damage and as a result, its jaws are extremely powerful for its size.", "start": 59.129, "duration": 6.68}, {"text": "As you might expect, putting so many evolution points into damage left very little to be used for mobility.", "start": 66.62, "duration": 5.34}, {"text": "In fact, ants in general aren't exactly known for their speed or agility.", "start": 72.72, "duration": 3.46}, {"text": "In the arthropod guild, burst mobility options, like the grasshoppers jump, require a pretty large investment", "start": 76.64, "duration": 6.68}, {"text": "However, the trap-jaw ant can get the best of both worlds", "start": 84.42, "duration": 2.76}, {"text": "By using the move bite on the ground, it can manipulate the physics of the game to launch itself into the air", "start": 87.78, "duration": 5.38}, {"text": "granting a burst of mobility in crucial moments", "start": 93.84, "duration": 2.76}, {"text": "By doing this, it can maintain its high attack strength without leaving itself open to being trapped.", "start": 97.2, "duration": 5.16}, {"text": "Similar thing can be done by using the move headbutt while playing a beetle class.", "start": 103.94, "duration": 3.96}, {"text": "Beetles can use their heads to launch other players off screen and into the blast zone", "start": 108.6, "duration": 3.54}, {"text": "But the click beetle build uses it for another purpose:", "start": 112.58, "duration": 3.34}, {"text": "by using the move headbutt without a target, the force of their attack can launch their characters trade up into the air", "start": 115.92, "duration": 5.14}, {"text": "This can be great for escaping grab combos or recovering from a stun", "start": 121.28, "duration": 3.449}, {"text": "I hope you see what I'm getting at: using moves for things other than their intent purpose can sometimes be extremely effective", "start": 124.729, "duration": 6.611}, {"text": "Another example of this is the cuttlefish", "start": 131.92, "duration": 2.0}, {"text": "In addition to having solid mobility and high intelligence, the cuttlefish has the highest stealth level of any built in the game", "start": 134.64, "duration": 6.0}, {"text": "Its high stealth allows it to use the move color change and the move shape-shift", "start": 141.28, "duration": 4.009}, {"text": "both of these can be used in combination to achieve an unparalleled level of undetectability.", "start": 145.8, "duration": 5.14}, {"text": "But there are other uses for the color change ability", "start": 151.36, "duration": 2.92}, {"text": "and no chameleon mains, I'm not talking about using it for emote.", "start": 154.28, "duration": 3.62}, {"text": "I'm talking about hypnosis", "start": 158.26, "duration": 1.94}, {"text": "if you use color change and rapidly cycle through colors over and over,", "start": 160.2, "duration": 4.08}, {"text": "you can actually seriously mess with the graphics engine and cause other players games to crash", "start": 164.28, "duration": 4.56}, {"text": "This leads to a free win and a lot of salt from crustacean mains", "start": 169.78, "duration": 3.26}, {"text": "but this doesn't mean crustaceans don't have their own secret advanced techniques too.", "start": 173.98, "duration": 3.58}, {"text": "The crustacean builds main strengths include high defense and an excellent grab.", "start": 177.94, "duration": 4.16}, {"text": "However, there are abysmal intelligence level means ranged attacks should be off-limits to them", "start": 183.129, "duration": 4.279}, {"text": "But by putting as many points as possible into their grab move,", "start": 188.56, "duration": 3.409}, {"text": "they can increase the speed of the move to such a high level that it actually starts to mess with the physics of the game.", "start": 192.12, "duration": 5.42}, {"text": "By targeting the water in front of them with their grab attack,", "start": 198.58, "duration": 2.86}, {"text": "they can actually create a shock wave that can deal massive sonic damage to nearby players", "start": 201.44, "duration": 4.18}, {"text": "that might normally be too mobile to get craft by a crustacean", "start": 205.62, "duration": 3.48}, {"text": "This means that players using the pistol shrimp build don't need to waste evolution points leveling of mobility stealth or intelligence", "start": 209.26, "duration": 7.2}, {"text": "in order to have a viable method of scoring eliminations", "start": 216.46, "duration": 2.32}, {"text": "Maxing out their claws grab move is the only thing they really need", "start": 219.64, "duration": 3.02}, {"text": "The physics of the game does the rest of the work for them.", "start": 223.26, "duration": 2.78}, {"text": "And I said that only before but I thought of another one while making this video", "start": 226.68, "duration": 3.26}, {"text": "So here's a bonus example:", "start": 229.94, "duration": 1.98}, {"text": "orcas are king of making physics do the work for them", "start": 231.92, "duration": 2.86}, {"text": "They're easily one of the best builds the game has ever seen:", "start": 235.26, "duration": 3.32}, {"text": "they've got extremely high power, HP and most importantly intelligence.", "start": 238.58, "duration": 4.78}, {"text": "They're so effective in the pinniped matchup that their only real option is just to hide out on land", "start": 243.84, "duration": 5.6}, {"text": "But this doesn't always work out for them", "start": 249.44, "duration": 2.24}, {"text": "Orcas high intelligence allows them to use one of the nastiest team combos ever:", "start": 251.94, "duration": 4.02}, {"text": "By banding together and quickly swimming in a single direction in unison,", "start": 256.269, "duration": 3.559}, {"text": "their combined power mobility creates a wave that can hit targets above the water knocking them in.", "start": 260.1, "duration": 5.44}, {"text": "Now they aren't the only build that specializes in knocking prey into the water", "start": 266.36, "duration": 4.28}, {"text": "And in fact, I'm actually pretty hesitant when players from water biomes try to target outsiders since that's a double-edged sword", "start": 270.64, "duration": 6.5}, {"text": "Birds are a huge risk for players that use that strategy", "start": 277.14, "duration": 2.68}, {"text": "But let's be honest, orcas are far too tanky to need to be concerned about that", "start": 280.56, "duration": 3.77}, {"text": "Humans are the only non Marine build that can even give them any trouble", "start": 285.48, "duration": 3.019}, {"text": "So they're free to manipulate the game physics to do their bidding", "start": 288.56, "duration": 3.14}, {"text": "But understanding physics is tough, especially if you don't know where to start", "start": 292.48, "duration": 3.94}, {"text": "But if you break physics down into individual solvable problems, it becomes a much less daunting task", "start": 297.72, "duration": 5.48}, {"text": "This is the philosophy behind brilliant.org, an enrichment learning website that teaches you to solve fascinating challenging problems by treating them like puzzles", "start": 303.66, "duration": 7.86}, {"text": "To support tierzoo and learn more about brilliant, go to brilliant.org/tierzoo and sign up for free", "start": 312.2, "duration": 5.3}, {"text": "and also the first 200 people that go to that link will get 20% off their annual premium subscription.", "start": 317.5, "duration": 5.36}, {"text": "Thank you for watching and see you next time.", "start": 322.86, "duration": 2.0}]