[{"text": "It’s the middle of august of the year 778.", "start": 0.72, "duration": 3.56}, {"text": "The Frankish army is returning home after a half-year long campaign on the Iberian Peninsula.", "start": 4.44, "duration": 5.86}, {"text": "A long line of riders, footmen, baggage carts and camp followers stretch out through the valley somewhere in the Pyrenees.", "start": 10.58, "duration": 7.4}, {"text": "King Charles rides in the van, among his most important vassals,", "start": 18.08, "duration": 4.32}, {"text": "talking about the new Saxon threat that has emerged on the other side of the realm.", "start": 22.4, "duration": 5.08}, {"text": "Then, the sound of unexpected upheaval somewhere from behind grabs the attention of the riders.", "start": 27.64, "duration": 6.2}, {"text": "An unforeseen battle that would make its mark on medieval culture has just begun.", "start": 34.12, "duration": 5.68}, {"text": "This video is sponsored by Raid: Shadow Legends!", "start": 40.84, "duration": 2.88}, {"text": "If you ever wished to know the thrill of commanding champions into battle, then we strongly recommend you check out the mobile game, Raid: Shadow Legends.", "start": 44.14, "duration": 7.96}, {"text": "Free to play, Raid: Shadow Legends places you in Teleria, a land beset by darkness.", "start": 52.52, "duration": 4.74}, {"text": "With 16 factions and over 300 champions to choose from, it falls on you to strategize and battle your way through a vast, ever-changing world.", "start": 57.5, "duration": 7.92}, {"text": "Build, customize and command champions against monster, bosses and even other players.", "start": 65.56, "duration": 5.28}, {"text": "In fact, Raid Shadow Legends is holding a massive tournament! Join right now and compete with millions of other players for your share of amazing in-game and physical prizes.", "start": 71.06, "duration": 10.56}, {"text": "Want an extra edge? Click on the link in the description below and you will begin with 50000 silver and an epic champion. The perfect start to win glory!", "start": 82.04, "duration": 9.62}, {"text": "It’s late September of the year 768.", "start": 103.56, "duration": 3.4}, {"text": "Frankish nobility have gathered in the Basilica of Saint Denis to witness the funeral ceremony of the recently deceased King Pepin the Short,", "start": 107.32, "duration": 8.38}, {"text": "who successfully ruled over the Frankish realm for nearly three decades.", "start": 115.7, "duration": 4.36}, {"text": "Among those that attended the funeral were two of the heirs to the late King Pepin – ambitious brothers Charles and Carloman,", "start": 120.28, "duration": 7.76}, {"text": "who, according to Frankish custom, were both to inherit their father’s throne and jointly rule the kingdom.", "start": 128.14, "duration": 6.56}, {"text": "The modern consensus is that Pepin’s sons barely tolerated each other,", "start": 135.38, "duration": 4.52}, {"text": "and soon this lack of brotherly affection proved to be a threat to the unity of the Frankish kingdom.", "start": 140.0, "duration": 6.0}, {"text": "Shortly after the change to the Frankish throne a revolt broke out in Aquitaine,", "start": 146.32, "duration": 4.18}, {"text": "which was under the joint rule of both brothers.", "start": 150.8, "duration": 2.78}, {"text": "Both were expected to react to this issue, yet Carloman retreated back north in the wake of his quarrels with Charles.", "start": 153.84, "duration": 6.94}, {"text": "From that point on, their relationship deteriorated even further, requiring their mother to mediate between them.", "start": 161.12, "duration": 6.9}, {"text": "Unsurprisingly, this lack of unity between rulers was to the detriment of the Frankish state, and internal crisis loomed on the horizon.", "start": 168.34, "duration": 5.56}, {"text": "But in 771, the younger brother, Carloman suddenly died, apparently from natural causes, which was certainly suspicious, as he was only 20 at the time.", "start": 174.06, "duration": 13.76}, {"text": "Shady or not, the death of Carloman was all too convenient for Charles,", "start": 188.12, "duration": 4.32}, {"text": "who became the sole King of the Franks and immediately began to consolidate his power along with making plans to expand his kingdom.", "start": 192.58, "duration": 7.84}, {"text": "It’s fair to say, that Charles was a right man in the right place.", "start": 201.08, "duration": 4.56}, {"text": "A man of impressive physical presence, quick-witted and energetic, strong willed, but also jovial at the banquet table.", "start": 205.84, "duration": 7.46}, {"text": "These traits secured the loyalty of many Frankish nobles across his broad kingdom.", "start": 213.54, "duration": 5.38}, {"text": "Fortunate to inherit a relatively stable domain,", "start": 219.4, "duration": 2.96}, {"text": "Charles undertook a number of military campaigns to extend his political reach and satiate personal ambitions.", "start": 222.44, "duration": 7.06}, {"text": "He answered the appeals of the newly elected Pope Adrian, a convenient excuse to invade and subdue the neighbouring Kingdom of the Lombards.", "start": 229.7, "duration": 8.46}, {"text": "Although it took him several years to fully incorporate the northern Italian region into the Frankish realm,", "start": 238.4, "duration": 6.14}, {"text": "Charles simultaneously campaigned on the eastern frontier, pitting himself against pagan Saxons, long-time opponents of the Franks.", "start": 244.68, "duration": 8.82}, {"text": "The Saxon’s unbending attitude and heavily wooded lands between the Rhine and Elbe rivers didn’t make the task any easier,", "start": 253.92, "duration": 7.74}, {"text": "and the war to the East preoccupied a good part of Charles’ military potential for many years to come.", "start": 261.68, "duration": 6.44}, {"text": "In late 777 a Frankish Diet met in Paderborn to discuss the issues concerning the subdued Saxons and other tribes.", "start": 268.32, "duration": 8.64}, {"text": "Apart from regular law-making duties, King Charles had received envoys of discontented Muslim provincial governors of Al-Andalus", "start": 277.46, "duration": 8.6}, {"text": "seeking military assistance against the rising power of the Emirate of Cordoba, the biggest and strongest state on the other side of the Pyrenees.", "start": 286.22, "duration": 9.36}, {"text": "Charles saw this as a promising opportunity to expand his rule into northern Iberia and agreed to help.", "start": 295.9, "duration": 7.28}, {"text": "Early the next year, a two-prong Frankish invasion crossed the Pyrenees.", "start": 303.76, "duration": 4.46}, {"text": "While the eastern contingent marched to capture the city of Barcelona,", "start": 308.52, "duration": 4.14}, {"text": "Charles personally led the second army, aiming to take Pamplona, a traditional Basque stronghold, currently occupied by an Umayyad garrison.", "start": 312.9, "duration": 9.04}, {"text": "The attack was hardly a challenge, as the city’s defences were in poor condition, and in no time Charles’ men overwhelmed the garrison.", "start": 322.3, "duration": 8.32}, {"text": "The campaign went smoothly and both Frankish armies were to rendezvous near Zaragoza, a much more formidable fortress.", "start": 330.7, "duration": 8.26}, {"text": "Upon reaching the outskirts of the city, Charles realised that the local governor was not going to submit to the Franks, and thus a siege was laid.", "start": 339.28, "duration": 8.82}, {"text": "Despite having enough men to fully encircle the stronghold,", "start": 348.18, "duration": 3.22}, {"text": "Charles had little siege equipment at his disposal to soften the Muslim governor and take the city in a timely manner,", "start": 351.5, "duration": 6.8}, {"text": "so the siege and entire campaign in Northern Iberia stalled.", "start": 358.46, "duration": 3.86}, {"text": "Yet after a month of maintaining a fruitless blockade, Charles was offered a considerable amount of gold and hostages in exchange for the Franks leaving the city.", "start": 362.72, "duration": 9.6}, {"text": "At first, he hesitated to accept this offer,", "start": 372.72, "duration": 3.3}, {"text": "but upon hearing reports that the Saxons were on the verge of another rebellion on the other end of his kingdom,", "start": 376.2, "duration": 5.82}, {"text": "he hesitated no longer, lifted the siege and departed on his journey back home.", "start": 382.26, "duration": 5.98}, {"text": "On the way back, Charles’ path once again led through Pamplona, where he took fairly harsh measures to subdue the disobedient Basque population,", "start": 388.98, "duration": 9.24}, {"text": "as he had heard rumours of collusion between locals and the Umayyad officials.", "start": 398.22, "duration": 5.14}, {"text": "The already damaged city walls were razed to the ground to prevent Pamplona from being used as a centre of possible future unrest.", "start": 403.66, "duration": 8.08}, {"text": "In addition, upon leaving the region, some nearby Basque towns and villages were set ablaze, undoubtedly enraging and antagonising the local population.", "start": 411.94, "duration": 10.16}, {"text": "The consequences of these actions were to hit the Frankish king far sooner than he might have imagined.", "start": 422.28, "duration": 5.84}, {"text": "In the middle of August, the Frankish army was travelling the narrow passes of the Pyrenees, looking forward to finally setting foot in Gaul.", "start": 428.76, "duration": 8.06}, {"text": "Due to their large numbers, the column stretched over several kilometres throughout the mountains.", "start": 437.08, "duration": 5.2}, {"text": "The heavily loaded baggage train lagged slightly behind the main body,", "start": 442.62, "duration": 3.84}, {"text": "also slowing down the rear-guard which consisted mainly of well trained and heavily armoured cavalrymen", "start": 446.54, "duration": 6.66}, {"text": "meant to defend the loot stored on the carts.", "start": 453.2, "duration": 2.88}, {"text": "Eventually, in an inopportune moment of rest,", "start": 456.44, "duration": 3.5}, {"text": "hundreds of javelins, arrows and other missiles rained down upon the exposed Frankish rear-guard,", "start": 460.22, "duration": 6.42}, {"text": "caught completely by surprise.", "start": 466.8, "duration": 2.32}, {"text": "Countless Basque tribesmen stormed down the hills and struck the stretched line of the unprepared Frankish cavalrymen,", "start": 469.38, "duration": 7.22}, {"text": "immediately causing chaos among their ranks.", "start": 476.84, "duration": 2.96}, {"text": "Basque mountain warriors, wearing virtually no armour and wielding little more than short spears", "start": 480.22, "duration": 5.24}, {"text": "would ordinarily pose no threat to Frankish mounted units on an open field in a traditional battle,", "start": 485.58, "duration": 6.2}, {"text": "but thanks to the extensive knowledge of the local terrain and using the element of surprise,", "start": 492.02, "duration": 4.8}, {"text": "they quickly gained an upper hand over the nominally superior Franks.", "start": 496.94, "duration": 4.44}, {"text": "In a matter of minutes, the battle turned into a slaughter.", "start": 501.7, "duration": 3.48}, {"text": "Gradually, Frankish warriors tried to force their way out of the onslaught and save their very lives.", "start": 505.4, "duration": 6.16}, {"text": "Yet out of roughly 2,000 men in the rear-guard, only mere dozens survived.", "start": 511.9, "duration": 5.82}, {"text": "King Charles was immediately informed about the ambush, but he could do nothing to save his rear-guard, which was virtually wiped out.", "start": 518.06, "duration": 7.62}, {"text": "Many Frankish nobles and some high officials perished in the narrow mountain passage.", "start": 525.82, "duration": 5.16}, {"text": "Moreover, the majority of war supplies and all of the gold he had acquired from Zaragoza was lost.", "start": 531.36, "duration": 6.94}, {"text": "In the span of a few hours, Charles’ moderately successful campaign in Iberia turned into deep humiliation.", "start": 538.56, "duration": 8.32}, {"text": "The Battle of Roncevaux Pass was a rare example of a setback in the otherwise brilliant military career of Charles the Great.", "start": 547.9, "duration": 8.26}, {"text": "In fact, it remained the only major defeat he suffered throughout his reign, and probably because of that,", "start": 556.48, "duration": 6.28}, {"text": "he avoided leading any campaigns on the other side of the Pyrenees in the years to come.", "start": 562.94, "duration": 5.04}, {"text": "He relied more on his generals instead, whose military efforts eventually led to the creation of the Spanish March,", "start": 568.24, "duration": 6.92}, {"text": "a buffer zone between the Frankish Kingdom and the Emirate of Cordoba.", "start": 575.24, "duration": 5.12}]