[{"text": "It’s July of the year 371 BC.", "start": 0.3, "duration": 3.34}, {"text": "The Spartan army is camping on a hill near the town of Leuctra in Boeotia.", "start": 4.08, "duration": 4.62}, {"text": "The sun has yet to rise from behind the mountains and shed its light across the plain.", "start": 8.84, "duration": 4.32}, {"text": "Spartan King Cleombrotus emerges from his tent to find the Theban army pitching camp a few kilometres to the north-east,", "start": 13.4, "duration": 7.8}, {"text": "undoubtedly readying for battle.", "start": 21.4, "duration": 2.44}, {"text": "A faint smile could be seen on his face.", "start": 24.14, "duration": 2.52}, {"text": "A decisive battle, that will shake the very balance of power in Ancient Greece is about to begin.", "start": 26.88, "duration": 6.32}, {"text": "This video is sponsored by the Great Courses Plus!", "start": 34.38, "duration": 3.32}, {"text": "Want to take a deeper delve into the world of history? Then check out the GreatCoursesPlus.com.", "start": 37.82, "duration": 5.08}, {"text": "A collection of subscribed lectures and courses curated by some of the finest academics from the world’s leading learning institutes.", "start": 43.08, "duration": 7.28}, {"text": "With over 11,000 video lectures, there is a wealth of knowledge to plumb.", "start": 50.5, "duration": 4.18}, {"text": "Wish to know more about the people of ancient Greece? Then have a look at their series on Famous Greeks.", "start": 54.86, "duration": 4.86}, {"text": "Or, since you’re here for Battle, then perhaps The Decisive Battles of World History would be to your taste.", "start": 59.72, "duration": 6.2}, {"text": "Regardless, help support our channel by clicking the link in description below, visit The Great Courses Plus,", "start": 66.04, "duration": 6.14}, {"text": "and take advantage of an amazing free trial that is currently on offer.", "start": 72.18, "duration": 4.16}, {"text": "Available on all major digital platforms, weather you are at home or on the move, never in history… has it been easier to learn.", "start": 76.52, "duration": 9.24}, {"text": "It is summer of the year 375 BC.", "start": 97.96, "duration": 3.64}, {"text": "A mere couple of months have passed since the Spartan war party suffered a humiliating defeat", "start": 101.86, "duration": 5.56}, {"text": "at the hands of Theban general Pelopidas near the town of Tegyra.", "start": 107.52, "duration": 4.72}, {"text": "This battle resulted in a serious blow to the Spartan reputation of invincibility.", "start": 112.48, "duration": 5.22}, {"text": "The Thebans didn’t expected such a surprising, yet still relatively minor victory", "start": 117.98, "duration": 4.26}, {"text": "would shift the balance of power in the region,", "start": 122.24, "duration": 2.14}, {"text": "and Spartan hegemony remained a deadly threat for their path to independence.", "start": 124.46, "duration": 4.96}, {"text": "Still, the Boeotian League, revived by the Theban leaders several years earlier was growing stronger year by year,", "start": 129.54, "duration": 6.88}, {"text": "and beleaguered Spartan military expeditions could do little to stop it,", "start": 136.42, "duration": 3.58}, {"text": "slowly tipping the power in the Boeotian city-states in favour of Thebes.", "start": 140.0, "duration": 4.5}, {"text": "The latter’s successes also sparked growing concern in nearby Athens,", "start": 144.88, "duration": 4.3}, {"text": "which supported the Theban cause against Sparta since the Corinthian War fifteen years earlier.", "start": 149.4, "duration": 5.32}, {"text": "The city of Thebes was on a good course to restore its political and military position.", "start": 154.96, "duration": 4.66}, {"text": "In 373 BC the Theban leaders tore down the walls of the pro-Spartan town of Thespiae", "start": 159.7, "duration": 6.06}, {"text": "and captured the city of Plataea, expelling its inhabitants.", "start": 165.88, "duration": 3.44}, {"text": "This proved too much for the Athenian aristocracy, as Plataea was their long standing ally,", "start": 169.64, "duration": 4.94}, {"text": "and from that point on, any cooperation between Thebes and Athens was a thing of the past.", "start": 174.68, "duration": 4.9}, {"text": "What’s more, Athenians made a temporary truce with Sparta, but this didn’t last for too long and soon hostilities broke out once again.", "start": 179.9, "duration": 7.8}, {"text": "As the war dragged on for a full eight years, early in 371 BC a peace conference was held at Sparta", "start": 188.02, "duration": 7.08}, {"text": "to reconsider their ways by appeasing the war-weary belligerents and ending the conflict.", "start": 195.1, "duration": 5.82}, {"text": "The gathering was not only attended by Athens, Sparta and Thebes but also representatives of other Greek states, including Macedonia", "start": 201.22, "duration": 7.72}, {"text": "and even Persian King Artaxerxes, who was still able to interfere in Greek internal affairs.", "start": 208.94, "duration": 6.64}, {"text": "Though primary sources vary as for the course of the conference,", "start": 215.98, "duration": 3.36}, {"text": "the peace treaty was agreed on between all parties and the Greek world was seemingly at peace once again.", "start": 219.48, "duration": 6.28}, {"text": "But, the very next day Epaminondas, leader of the Theban delegation insisted to sign the treaty not for the Thebans alone,", "start": 225.88, "duration": 8.06}, {"text": "but on behalf of the entire Boeotian League.", "start": 233.94, "duration": 2.98}, {"text": "The Spartan King Agesilaus obviously turned down this request,", "start": 237.16, "duration": 3.36}, {"text": "as this would proclaim that Thebes had the power to represent all of the city-states in Boeotia.", "start": 240.52, "duration": 5.88}, {"text": "In turn, Epaminondas pointed out that if this were to be the case, the cities of the Spartan-led Peloponnesian League", "start": 246.72, "duration": 7.2}, {"text": "should be allowed the same and also sign independently.", "start": 253.92, "duration": 3.7}, {"text": "As a result of this dispute, King Agesilaus struck Thebes from the treaty and both sides began preparing for war.", "start": 257.76, "duration": 7.16}, {"text": "Epaminondas and his retinue rushed back to Boeotia to gather their defences,", "start": 265.1, "duration": 4.66}, {"text": "as they knew that Spartan King Cleombrotus of the Agiad dynasty was campaigning with his army to the north-west", "start": 269.76, "duration": 7.86}, {"text": "and was soon to be informed about the failed peace talks in Sparta.", "start": 277.72, "duration": 3.96}, {"text": "Indeed, when Epaminondas reached Thebes, the Spartan army in Phocis was already reported to be moving east.", "start": 281.98, "duration": 7.54}, {"text": "Thebans had most of the routes into Boeotia fortified, but Cleombrotus chose a largely undefended path to the south", "start": 289.64, "duration": 7.3}, {"text": "and took the port of Creusis, capturing some of the Theban warships.", "start": 296.94, "duration": 3.74}, {"text": "From there, the Spartan army proceeded inland, setting a camp west of the town of Leuctra,", "start": 300.84, "duration": 5.64}, {"text": "a mere ten miles from the city of Thebes, where local statesmen discussed whether to meet them in battle,", "start": 306.58, "duration": 5.92}, {"text": "or rather to hole up behind city walls and hope for the best.", "start": 312.6, "duration": 3.96}, {"text": "The choice wasn’t easy, as the Thebans were able to field just around 6,000 hoplites and no more than 1,000 riders.", "start": 316.84, "duration": 7.36}, {"text": "In comparison, Cleombrotus had 10,000 hoplites at his disposal, supplemented by a cavalry unit.", "start": 324.46, "duration": 6.54}, {"text": "Moreover, the fierce Spartan warriors had an intimidating reputation,", "start": 331.2, "duration": 4.74}, {"text": "as they had never been defeated in a major hoplite battle,", "start": 336.08, "duration": 3.34}, {"text": "and their notoriety of being invincible on the battlefield was also wide-spread among other Greek city-states.", "start": 339.42, "duration": 7.5}, {"text": "Tensions were running high in the Theban camp, as chief officers, the boeotarchs discussed possible solutions.", "start": 347.42, "duration": 7.14}, {"text": "Initially, they leaned towards the idea of defending inside the city, but eventually Epaminondas and his friend Pelopidas,", "start": 354.96, "duration": 7.68}, {"text": "who had defeated the Spartans near Tegyra managed to convince the rest to take the risk,", "start": 362.64, "duration": 5.04}, {"text": "march to Leuctra and meet the threat on the field.", "start": 367.68, "duration": 4.2}, {"text": "Early on the 6th of July 371 BC the Theban army reached the plain near Leuctra and both sides began deployment.", "start": 372.12, "duration": 8.04}, {"text": "Spartan King Cleombrotus formed the usual, fairly even line with a strong right wing comprising of elite Spartiates,", "start": 380.46, "duration": 7.64}, {"text": "and regular allied troops making up the rest of the line.", "start": 388.26, "duration": 3.32}, {"text": "The fairly inexperienced cavalrymen were unusually put in the front of the line.", "start": 391.7, "duration": 5.62}, {"text": "Epaminondas, who took charge of the entire Theban army was expected to roughly mirror the Spartan array,", "start": 397.52, "duration": 6.56}, {"text": "placing his best men on the right wing and hoping the bout would result in a favourable outcome,", "start": 404.08, "duration": 5.94}, {"text": "but knowing his subpar numbers, and renown of his opponent,", "start": 410.14, "duration": 3.64}, {"text": "he employed a different, unorthodox tactic.", "start": 413.78, "duration": 3.54}, {"text": "While Boeotian cavalry was also put in the front,", "start": 417.5, "duration": 2.64}, {"text": "the Theban’s most experienced units along with the Sacred Band under the command of Pelopidas, were placed on the left,", "start": 420.14, "duration": 7.36}, {"text": "directly against the Spartan’s top men and generals.", "start": 427.5, "duration": 3.74}, {"text": "Moreover, the Theban left flank was extraordinarily deep,", "start": 431.46, "duration": 3.9}, {"text": "likely to add pushing power to the front ranks and hopefully break the enemy’s cohesion.", "start": 435.36, "duration": 5.78}, {"text": "This didn’t came without risk though, as the rest of the Theban battle line, comprising of Boeotian allies was just a few ranks deep,", "start": 441.26, "duration": 7.72}, {"text": "standing little chance against their Spartan counterparts.", "start": 449.32, "duration": 3.78}, {"text": "The battle started with a cavalry skirmish in front of both armies.", "start": 453.22, "duration": 3.94}, {"text": "Theban horsemen were not only more experienced but also of slightly greater number", "start": 457.46, "duration": 4.68}, {"text": "and after a brief engagement they managed to rout the Spartan cavalry,", "start": 462.48, "duration": 3.84}, {"text": "which ran through their own infantry line, temporarily causing some disarray.", "start": 466.56, "duration": 4.72}, {"text": "In the meantime, Theban infantry moved forward in an echelon formation,", "start": 471.54, "duration": 4.56}, {"text": "with their left moving fast and the rest of the line lagging behind to avoid the clash as long as possible.", "start": 476.3, "duration": 6.7}, {"text": "Cleombrotus eventually realized the different alignment of the enemy line and yelled orders to reform his own line,", "start": 483.18, "duration": 6.86}, {"text": "but soon the Theban left flank slammed into the Spartans and the fierce scrum of battle ensued.", "start": 490.18, "duration": 6.72}, {"text": "The shouting of orders was barely audible among the horrific clamour of bent armour and human agony,", "start": 497.06, "duration": 5.6}, {"text": "as men perished one by one on both sides.", "start": 502.72, "duration": 3.22}, {"text": "But local superiority of the Theban force and military prowess of the Sacred Band soon yielded the results Epaminondas had hoped for.", "start": 506.18, "duration": 8.86}, {"text": "The Spartan right flank crumbled, being pushed back, and soon many leading officers were slain.", "start": 515.22, "duration": 6.02}, {"text": "At a critical point, Pelopidas saw an opening and led his men forward to attack the Spartan king.", "start": 521.46, "duration": 6.72}, {"text": "In a matter of minutes, Cleombrotus was mortally wounded, and although his body was retrieved by his companions,", "start": 528.34, "duration": 6.26}, {"text": "it was a crushing blow for the Spartans, as their right flank collapsed and soldiers ran from the battlefield.", "start": 534.72, "duration": 7.0}, {"text": "Following this, the Theban centre and right eventually moved forward,", "start": 541.9, "duration": 4.26}, {"text": "while Epaminondas and Pelopidas were about to flank their enemy.", "start": 546.26, "duration": 4.26}, {"text": "But tactical disadvantage and loss of leading generals soon caused the rest of the Spartan army to retreat to the camp as well.", "start": 550.62, "duration": 7.04}, {"text": "More than one thousand men were killed on the Spartan side.", "start": 557.76, "duration": 3.24}, {"text": "Among the dead, around four hundred Spartiates, the Agiad King of Sparta and many high ranked officers.", "start": 561.08, "duration": 6.82}, {"text": "Theban losses were much lower, as roughly ten dozen perished.", "start": 568.18, "duration": 4.1}, {"text": "The Battle of Leuctra was not only a great victory for the Thebans,", "start": 572.52, "duration": 4.18}, {"text": "but also a significant shock for the Greek world,", "start": 576.74, "duration": 2.92}, {"text": "as the myth of Spartan invincibility was ruthlessly obliterated by the Theban generals Epaminondas and Pelopidas.", "start": 579.88, "duration": 7.74}, {"text": "The great loss of prestige and military influence of Sparta in subsequent years enabled Thebes to expand even further,", "start": 587.72, "duration": 7.22}, {"text": "soon becoming the most powerful city-state in Ancient Greece.", "start": 594.94, "duration": 4.96}]