[{"text": "Greetings my beautiful lovelies!", "start": 5.049, "duration": 1.495}, {"text": "It's Emmy. Welcome back!", "start": 6.544, "duration": 1.075}, {"text": "Today's video is sponsored by hellofresh the food delivery service that brings fresh seasonal ingredients", "start": 7.62, "duration": 5.13}, {"text": "right to your doorstep. Get started with eight free meals.", "start": 13.24, "duration": 3.469}, {"text": "That's $80 off your first month by heading over to hellofresh.com and using the code Emmy80.", "start": 16.93, "duration": 6.259}, {"text": "Thanks to hello fresh for sponsoring this video. And today we're going to be making", "start": 23.189, "duration": 3.99}, {"text": "HOMEMADE", "start": 27.73, "duration": 1.049}, {"text": "BOBA", "start": 28.779, "duration": 1.32}, {"text": "Boba! Now a few of you have requested this and I first thought this is insanity", "start": 30.099, "duration": 4.19}, {"text": "Why would anyone ever make a homemade boba?", "start": 34.559, "duration": 3.45}, {"text": "but then I began to do my research and I", "start": 38.01, "duration": 2.79}, {"text": "believe I see the light. So I did my first boba recipe how to make milk tea boba recipe years ago", "start": 41.14, "duration": 6.77}, {"text": "It's probably about four years ago now I'll put a link to the baby..i mean video above and down below", "start": 48.64, "duration": 5.45}, {"text": "But in that video I use pre-made boba. They come in a package. They're vacuum sealed and you just boil your boba", "start": 54.699, "duration": 6.32}, {"text": "Very very simple. Today, I'm gonna show you how to actually make those tapioca balls", "start": 61.02, "duration": 4.139}, {"text": "If you're not familiar with boba tea, boba tea is a type of tea", "start": 65.159, "duration": 3.69}, {"text": "That was I believe invented in Taiwan and it has big tapioca pearls", "start": 68.85, "duration": 4.739}, {"text": "usually they're kind of darker in color and", "start": 73.59, "duration": 2.0}, {"text": "they're very chewy and bouncy and they're in the bottom of a glass and usually topped with a milk tea. A black tea that is", "start": 75.729, "duration": 6.74}, {"text": "Sweetened and enriched with milk and you drink the tea along with the boba pearls at the bottom. So you have this kind of simultaneous", "start": 82.47, "duration": 7.169}, {"text": "Eating and drinking experience. It's actually much more delightful than I am describing and delicious", "start": 90.28, "duration": 6.169}, {"text": "So I thought the boba craze is over, but it is not it is not. I just read an article in eater", "start": 96.7, "duration": 5.629}, {"text": "I'll put the link down the description about a branch of tiger sugar opening up in New York", "start": 102.329, "duration": 5.28}, {"text": "So I went down the rabbit hole", "start": 107.61, "duration": 1.86}, {"text": "That is the internet to learn more about Tiger sugar", "start": 109.47, "duration": 3.509}, {"text": "Which is a chain that originated in Taiwan that makes this particular type of boba drink", "start": 112.979, "duration": 5.7}, {"text": "So it has the boba pearls, nice big ones at the bottom which they make in-house fresh", "start": 118.68, "duration": 5.549}, {"text": "Which I'm going to be attempting today, and they're cooked at the bottom in this beautiful dark", "start": 124.42, "duration": 5.089}, {"text": "sugary syrup", "start": 130.119, "duration": 1.411}, {"text": "That syrup is coated on the inside of the plastic cup and then milk is added and then it's topped with a slightly thickened cream", "start": 131.53, "duration": 6.589}, {"text": "on top", "start": 138.159, "duration": 0.78}, {"text": "So basically you have a Brown sugary icy milk drink with boba chewy tapioca pearls at the bottom.", "start": 138.939, "duration": 6.86}, {"text": "Sounds fantastic and visually, it's very very striking. It's made for Instagram", "start": 146.14, "duration": 4.729}, {"text": "that's the reason why they call it Tiger sugar is because", "start": 150.939, "duration": 2.72}, {"text": "the sugar that lines the inside of the cup as it dissolves into the milk creates this kind of stripy", "start": 153.819, "duration": 5.6}, {"text": "tiger pattern. So at this point, in East and Southeast Asia, there are many different brands of this type of brown sugar", "start": 159.73, "duration": 6.919}, {"text": "boba, including one called Xing Fu Tang.", "start": 167.319, "duration": 2.36}, {"text": "So I'm imagining there must be some reasoning to making boba fresh like they do at Xing Fu Tang.", "start": 169.81, "duration": 5.239}, {"text": "So I'm very curious to see how the homemade version compares to the store-bought.", "start": 175.049, "duration": 4.589}, {"text": "I'm also curious to see what the brown sugar milk tastes. Like I was about to say tea but it won't contain tea.", "start": 179.639, "duration": 6.57}, {"text": "I'm also curious to see how the brown sugar milk compares to milk tea", "start": 186.209, "duration": 4.559}, {"text": "which I love -- so to compare that in my mind will be interesting and I'm also just up for the challenge of doing this.", "start": 190.769, "duration": 7.17}, {"text": "So before we get started on the recipe, let me tell you a little bit more about hellofresh.", "start": 198.099, "duration": 3.77}, {"text": "Hellofresh is a food delivery service that brings", "start": 202.18, "duration": 2.66}, {"text": "seasonal fresh ingredients and simple step-by-step recipes right to your doorstep. They make making homemade meals", "start": 205.269, "duration": 7.1}, {"text": "super easy and delicious. Hellofresh is flexible. If you're looking for vegetarian recipes, family recipes, fun recipes,", "start": 212.799, "duration": 7.61}, {"text": "hellofresh has options for you!", "start": 220.409, "duration": 2.28}, {"text": "Hellofresh is also a great way to get out of recipe ruts because", "start": 222.69, "duration": 3.029}, {"text": "every week there are over 20 different", "start": 225.94, "duration": 1.65}, {"text": "recipes that are chef-curated and", "start": 227.59, "duration": 1.92}, {"text": "seasonal to choose from -- so lots of options, lots of variety, and it's really flexible: if you want to change your delivery dates, if you", "start": 229.51, "duration": 7.25}, {"text": "want to change your food preferences, if you want to skip a week, hellofresh makes it really simple and easy.", "start": 236.76, "duration": 5.339}, {"text": "So this week my family really loved the roasted veggie caprese bowl.", "start": 242.229, "duration": 3.08}, {"text": "This was a new recipe for me and I absolutely loved it. Simple to put together and just beautiful on the plate --", "start": 245.309, "duration": 5.631}, {"text": "really delicious meal. So hellofresh is now from $5.66 a serving and it's a really great way to make home-cooked meals a reality", "start": 251.2, "duration": 7.5}, {"text": "So get started with eight free meals, that's $80 off your first month by heading over to hellofresh.com and using the code", "start": 259.04, "duration": 5.66}, {"text": "Emmy80. Big thanks to hellofresh for sponsoring this video, now let's go make some boba!", "start": 265.05, "duration": 4.369}, {"text": "So boba consists of only three ingredients: tapioca starch, brown sugar, and water. We are going to combine", "start": 269.639, "duration": 7.43}, {"text": "60g of water;", "start": 277.86, "duration": 2.0}, {"text": "now I'm adding 45g of Muscovado sugar --", "start": 280.72, "duration": 2.82}, {"text": "and this contains lots of molasses,", "start": 284.82, "duration": 2.059}, {"text": "that's why it has this dark, brown color --and we're just gonna heat this up until the sugar is dissolved.", "start": 286.88, "duration": 4.199}, {"text": "Now we're turning off the heat and now we're going to add just a spoonful of our tapioca starch.", "start": 293.13, "duration": 4.669}, {"text": "And then once it's combined we're gonna turn the heat back on we're trying to avoid lumps here", "start": 300.06, "duration": 4.459}, {"text": "So we're gonna heat this back up until it starts to thicken and then remove it from the heat", "start": 304.52, "duration": 4.89}, {"text": "Okay, okay. Okay, off the heat.", "start": 310.5, "duration": 2.449}, {"text": "Look how its thickened. Isn't that amazing? The remaining tapioca starch", "start": 314.82, "duration": 5.089}, {"text": "Now it looks like a lot of starch but eventually this will all combine", "start": 321.449, "duration": 3.86}, {"text": "into the dough", "start": 326.729, "duration": 1.651}, {"text": "Now we're ready to knead now. We're gonna use a little extra tapioca flour sprinkle our counter.", "start": 328.38, "duration": 6.319}, {"text": "At Xing Fu Tang, they use a stand mixer to actually mix this together. But since this is such a small amount, I'm just gonna knead it.", "start": 334.699, "duration": 5.88}, {"text": "It's also what cooking tree does in their videos. Now, we're gonna need this until everything is nicely incorporated", "start": 342.24, "duration": 5.179}, {"text": "And a little bit more tapioca if we need it", "start": 351.74, "duration": 3.109}, {"text": "This is so great, it's so supple. Listen to that sound, isn't that great?", "start": 356.66, "duration": 4.429}, {"text": "Now we have this beautiful dough", "start": 364.16, "duration": 2.0}, {"text": "Look isn't that gorgeous? Look at that beautiful color. I'm gonna work with about half of it at a time", "start": 370.04, "duration": 4.699}, {"text": "Yeah, but you want to keep the other half wrapped up while we're working with this half", "start": 374.93, "duration": 4.1}, {"text": "So we're just gonna make snakes here and then we're gonna cut the snakes into little pieces", "start": 382.7, "duration": 3.829}, {"text": "Now the boba will expand a little bit while we're boiling them, so make your snakes kind of skinny", "start": 388.22, "duration": 4.73}, {"text": "This is my first time making boba by the way, so I'm certainly no expert. This is just based on", "start": 393.86, "duration": 5.359}, {"text": "what I've witnessed in videos.", "start": 399.89, "duration": 2.089}, {"text": "So we've got our", "start": 402.89, "duration": 2.0}, {"text": "snakes and now we're going to cut our pieces", "start": 405.32, "duration": 2.179}, {"text": "as so.", "start": 408.35, "duration": 2.0}, {"text": "See how those pieces are all out", "start": 413.66, "duration": 2.0}, {"text": "Cooking tree shows a technique where you take three of them and put them in your hand and then roll all at the same time", "start": 417.68, "duration": 4.76}, {"text": "And you get three?", "start": 423.14, "duration": 2.0}, {"text": "Bobba, so I'll be back when I've rolled all my boba into balls", "start": 425.54, "duration": 3.049}, {"text": "Now that I've rolled out and shaped my boba, I'm going to add them to a pot of boiling water", "start": 432.02, "duration": 5.629}, {"text": "Gonna stir this around", "start": 440.99, "duration": 2.0}, {"text": "Because we don't want them to stick to each other or to the bottom of the pot", "start": 447.82, "duration": 4.309}, {"text": "So now they're floating on their surface now, we're gonna start the timer for 20 minutes", "start": 453.94, "duration": 3.41}, {"text": "So after 20 minutes of cooking", "start": 457.42, "duration": 1.64}, {"text": "We're gonna turn off the heat keep them covered and let them rest for additional 20 minutes, then we can assemble our drink", "start": 459.06, "duration": 7.29}, {"text": "Alright, see ya in a bit. Now, we've got our boba on the side here that we've strained", "start": 466.36, "duration": 4.85}, {"text": "Now we're ready to make our little brown sugar syrup. So we're gonna heat up a pan and we're gonna add", "start": 471.21, "duration": 5.849}, {"text": "35 grams of Muscovado sugar", "start": 477.67, "duration": 2.0}, {"text": "Now we don't want the heat on too high, we're not melting this we're just warming it up", "start": 481.6, "duration": 4.399}, {"text": "So this is the method that I saw in the Xing Fu Tang video that I watched", "start": 486.19, "duration": 3.32}, {"text": "It just warm up the brown sugar and then they add the hot freshly cooked boba", "start": 489.88, "duration": 5.63}, {"text": "Smells incredible smells like molasses, brown sugar", "start": 503.08, "duration": 4.729}, {"text": "This is sugar and sugar burns really easily so we don't want this to burn", "start": 512.53, "duration": 4.82}, {"text": "We just want everything to be nice and melty and glorious. Oh, that's so good", "start": 517.35, "duration": 4.949}, {"text": "Okay, so we are finally now ready to assemble our drink. Got myself a glass", "start": 522.46, "duration": 5.479}, {"text": "I'm gonna get my hot boba into my glass", "start": 528.43, "duration": 3.049}, {"text": "And roll the boba around like this", "start": 536.22, "duration": 2.18}, {"text": "and that's what's gonna give us our Tiger Stripes. Next, we're gonna add some ice. Next, our milk.", "start": 539.76, "duration": 6.06}, {"text": "Now I'm just gonna top it with a little bit of slightly whipped cream on top just a little, *purses lips* you know", "start": 549.54, "duration": 7.0}, {"text": "Ahhh, look at it!", "start": 556.54, "duration": 1.82}, {"text": "The tiger stripes disappear pretty quickly, but I did manage to get them. I'm so so pleased", "start": 558.36, "duration": 5.0}, {"text": "So stinking", "start": 565.41, "duration": 1.98}, {"text": "Beautiful. Yes. Okay. So now we mix this up and doesn't that sound great?", "start": 567.39, "duration": 3.979}, {"text": "Alrighty, let's give this a taste. Itadakimasu!", "start": 571.95, "duration": 2.989}, {"text": "Oh my good- *inaudible sounds*", "start": 577.56, "duration": 2.74}, {"text": "They're so good!", "start": 584.66, "duration": 2.0}, {"text": "It's so stinkin delicious, it's basically like ice cream", "start": 592.22, "duration": 4.02}, {"text": "You've got the heavy cream on top that mixes with the cold whole milk, I use whole milk", "start": 596.45, "duration": 4.44}, {"text": "So it's rich and creamy it tastes like melted ice cream", "start": 601.65, "duration": 4.069}, {"text": "That little bit of cream floating on top", "start": 612.15, "duration": 2.0}, {"text": "mixed with the whole milk mixed with that little bit of brown sugar that we use to cook the boba and", "start": 614.7, "duration": 4.429}, {"text": "Perfect balance of sweetness. It's actually less", "start": 620.16, "duration": 2.69}, {"text": "Sugary sweet than ice cream about the richness and sweet in the combination reminds me of ice cream. It's absolutely wonderful and the homemade boba", "start": 623.4, "duration": 8.0}, {"text": "Absolutely marvelous. So much better actually than the typical manufactured kind. They're more supple", "start": 632.16, "duration": 6.5}, {"text": "and more tender but still really great and chewy, but they're not hard in the middle", "start": 638.66, "duration": 4.5}, {"text": "So it's fun!", "start": 646.98, "duration": 2.0}, {"text": "I love it. Mmm!", "start": 651.63, "duration": 2.0}, {"text": "Absolutely love it. Delicious. I don't miss the tea at all. Although I might miss the caffeine later", "start": 655.02, "duration": 6.559}, {"text": "So scrumptious, I love this. So if you're curious and you've got the time, I would definitely encourage you to attempt this recipe", "start": 662.94, "duration": 5.989}, {"text": "Be sure to check out the original videos. I will put their links down the description box", "start": 668.93, "duration": 3.959}, {"text": "Thank you guys so much for watching and big thanks to hellofresh for sponsoring this video! Get eight free meals", "start": 673.05, "duration": 4.579}, {"text": "That's $80 off your first month. But heading over to hellofresh.com and use the code Emmy80.", "start": 677.63, "duration": 5.55}, {"text": "Thank you guys again for watching. I hope you guys enjoyed that one. I hope you guys learned something", "start": 683.82, "duration": 4.16}, {"text": "Please share this video with your friends", "start": 687.98, "duration": 1.9}, {"text": "Follow me on social media. Like this video. Subscribe and I shall see in the next one. Todaloo, take care", "start": 689.88, "duration": 5.869}, {"text": "B Y E ~", "start": 695.749, "duration": 2.0}, {"text": "So good", "start": 699.74, "duration": 2.0}, {"text": "*more inaudible sounds*", "start": 716.72, "duration": 2.0}]