[{"text": "Hey, what's up guys, welcome back to Binging with Babish where this week, seeing as how our saccharine sweet", "start": 10.5, "duration": 5.18}, {"text": "hails from both film and literature, it's only fitting that this episode is brought to you by Audible.", "start": 15.68, "duration": 4.889}, {"text": "You can get a free audiobook with a 30-day trial at audible.com/babish, that's audible.com/babish", "start": 20.57, "duration": 7.83}, {"text": "Transform your commute and ride with their unbeatable selection of audio-books and incredible performances.", "start": 28.4, "duration": 6.0}, {"text": "Audible makes it easy to get more books in your life. My personal recommendation: \"The Subtle Art of Not Giving a F***\",", "start": 34.4, "duration": 6.1}, {"text": "by Mark Manson. I think that's a book that we can all learn an important lesson from.", "start": 40.59, "duration": 4.11}, {"text": "And the book that we can learn a candy-making lesson from is", "start": 44.7, "duration": 3.1}, {"text": "\"The Chronicles of Narnia\". More specifically, the White Witch's Turkish Delight.", "start": 47.8, "duration": 3.2}, {"text": "We're going to combine 4 cups of granulated sugar with 1 and 1/2 cups of plain tap water.", "start": 51.02, "duration": 4.58}, {"text": "Stir over a medium-high heat until the sugar is completely dissolved.", "start": 55.649, "duration": 3.051}, {"text": "Once it's all dissolved, stop stirring and let it simmer for about 10-15 minutes until it reaches 240 degrees Fahrenheit,", "start": 58.7, "duration": 7.8}, {"text": "better known as the softball stage.", "start": 66.5, "duration": 2.5}, {"text": "Set the sugar mixture aside and in a large sauce pot, pour and make a mess out of a cup of corn starch.", "start": 69.06, "duration": 6.54}, {"text": "Add to it 2 teaspoons of cream of tartar, and slowly whisk in 3 cups of tap water.", "start": 75.6, "duration": 5.4}, {"text": "We want to make sure that there's absolutely no lumps, so whisk constantly.", "start": 81.049, "duration": 3.151}, {"text": "And we're gonna heat that over medium-high heat again until it turns into, sort of like a glue", "start": 84.2, "duration": 4.8}, {"text": "a very thick, sticky paste, to which we're going to slowly start adding our sugar syrup,", "start": 89.0, "duration": 5.2}, {"text": "again whisking constantly to make sure that everything is fully incorporated.", "start": 94.4, "duration": 3.599}, {"text": "Go ahead and grab a wooden spoon and scrape down the corners and sides of the pan to make sure that you get all of that", "start": 98.0, "duration": 5.4}, {"text": "cornstarch mixture out of any hiding places.", "start": 103.4, "duration": 2.43}, {"text": "Bring the mixture to a gentle bubble, reduce the heat and cook it for one hour, stirring occasionally until it turns", "start": 106.08, "duration": 6.72}, {"text": "a light golden brown, at which point we're gonna add our desired flavoring. If we're talking traditional Turkish Delight,", "start": 112.8, "duration": 5.388}, {"text": "we're talking two tablespoons of rosewater and some red food coloring.", "start": 118.189, "duration": 3.811}, {"text": "Whisk again until completely combined, and pour into some square or rectangular casseroles that you've lined with plastic wrap", "start": 122.0, "duration": 7.1}, {"text": "and rub down with vegetable oil.", "start": 129.1, "duration": 1.569}, {"text": "And we're gonna let that sit at room temperature for at least 4 hours or until completely firm.", "start": 130.67, "duration": 4.529}, {"text": "And now it's time to apply a decorative and finger protecting coating,", "start": 135.2, "duration": 3.5}, {"text": "this is an half powdered sugar half cornstarch.", "start": 138.7, "duration": 3.1}, {"text": "Start by generously coating your work surface, unwrap your now firm, um, Delight,", "start": 141.8, "duration": 3.7}, {"text": "and coat it in the powdered sugar mixture before cutting it into 1-inch cubes.", "start": 145.5, "duration": 5.5}, {"text": "Or 2-inch cubes, I and nor anyone else cares at all.", "start": 151.0, "duration": 3.549}, {"text": "We're then going to dust these pieces with some additional powdered sugar mixture,", "start": 154.55, "duration": 4.15}, {"text": "roll them around to make sure that they're evenly coated.", "start": 158.7, "duration": 2.0}, {"text": "If you have an enchanted, magically-appearing bowl use that otherwise just use a regular bowl,", "start": 160.7, "duration": 4.5}, {"text": "and it's time for the all-important cross-section. And, even more important than that, the taste tests.", "start": 165.2, "duration": 5.0}, {"text": "Now, I dislike this greatly. It doesn't taste good at all, it tastes like potpourri.", "start": 170.2, "duration": 5.1}, {"text": "Granted, I know that rosewater is an acquired taste,", "start": 175.3, "duration": 2.02}, {"text": "but if you don't have a taste for your mom's perfume,", "start": 177.32, "duration": 2.48}, {"text": "some other flavors would be very welcome, like orange blossom water, cinnamon extract, coconut extract or ginger extract.", "start": 179.8, "duration": 6.55}, {"text": "Just pretty much anything but rosewater.", "start": 186.35, "duration": 2.0}, {"text": "(Music)", "start": 188.35, "duration": 20.27}]