[{"text": "I was alive", "start": 0.03, "duration": 2.0}, {"text": " ", "start": 2.03, "duration": 2.0}, {"text": "You might say Walter White gets the Breaking Bad version of a happily ever after as Walt nears the end of his life", "start": 7.779, "duration": 6.68}, {"text": "He enjoys complete control over how he goes. He takes out his enemies", "start": 14.46, "duration": 4.109}, {"text": " ", "start": 18.569, "duration": 1.581}, {"text": "He evades the police long enough to run out the clock I don't want that bastard running off the clock", "start": 20.65, "duration": 5.539}, {"text": "he decides at the last minute to save Jesse Pinkman and", "start": 26.189, "duration": 3.63}, {"text": "He accomplishes what he set out to do in the very first episode provide for his family I've done a terrible thing", "start": 33.01, "duration": 7.1}, {"text": "but I did it for a good reason I", "start": 41.53, "duration": 2.0}, {"text": "Did it for us", "start": 46.0, "duration": 1.71}, {"text": "after taking out Jack's gang and letting Jesse go Walt wanders into the meth lab and he passes his final moments in the place that", "start": 47.71, "duration": 7.009}, {"text": "Ultimately meant the most to him the place where he discovered his alter ego", "start": 55.0, "duration": 3.799}, {"text": "Heisenberg proved his genius and realized his full potential as we hear the Badfinger lyrics", "start": 59.32, "duration": 5.75}, {"text": "He departs this life happily dreaming of his muse the blue meth that proved to the world how grossly they", "start": 68.329, "duration": 6.23}, {"text": "Underestimated him the camera pulls out and the look of contentment on Walt's face says that in the end", "start": 74.78, "duration": 5.239}, {"text": "He got what he wanted, but the finale also makes us acutely aware of what this cost him", "start": 80.06, "duration": 5.449}, {"text": "You can either look at it like he won or you can look at it like you lost", "start": 85.7, "duration": 3.5}, {"text": "I mean this guy destroys his entire family as creator Vince Gilligan", "start": 89.649, "duration": 3.54}, {"text": "Put it Walt for years now has been looking through the wrong end of the telescope", "start": 93.289, "duration": 4.19}, {"text": "And we're left asking what it means to get everything you want if you've been chasing after the wrong things all along I won", "start": 103.67, "duration": 7.639}, {"text": "Before we go on we want to tell you a little bit about this video sponsor", "start": 116.869, "duration": 3.68}, {"text": "Movie is a curated film streaming service with a twist you get thirty films per month a new film every day", "start": 120.799, "duration": 6.379}, {"text": "It's a hand-picked selection of movie gems from around the world. We're huge fans of Mubi at screen prism", "start": 127.22, "duration": 6.139}, {"text": "So click the link in our description below to get a full month of movie for free in the show's final episode", "start": 133.359, "duration": 5.88}, {"text": "Felina walt is a dead man walking", "start": 139.7, "duration": 2.72}, {"text": "But this extreme control freak is determined to put his affairs in order the way he wants them", "start": 146.42, "duration": 6.289}, {"text": "This means three things one getting his money to his family", "start": 152.81, "duration": 3.739}, {"text": "Two taking out his enemies", "start": 159.62, "duration": 2.059}, {"text": "And", "start": 163.63, "duration": 0.97}, {"text": "three though", "start": 164.6, "duration": 0.8}, {"text": "He's not conscious of it making good with his partner, Jesse Pinkman", "start": 165.4, "duration": 3.36}, {"text": "Jesse Pinkman you promised they would kill him and you didn't come on", "start": 169.01, "duration": 3.349}, {"text": "So let's take a look at how he gets each of these three things", "start": 172.36, "duration": 3.0}, {"text": "Ever since the first episode Walt has been making sense of his criminal activities with one justification", "start": 186.989, "duration": 5.72}, {"text": "What I do I do for my family, but I will provide for my family", "start": 192.709, "duration": 4.8}, {"text": "I was and am", "start": 198.019, "duration": 2.0}, {"text": "providing for our family Oh", "start": 200.31, "duration": 2.0}, {"text": "sacrifices that I", "start": 202.98, "duration": 1.8}, {"text": "Made for this family, but despite all the millions. He's made getting that money to his family has proven harder than expected", "start": 204.78, "duration": 7.61}, {"text": "They won't take it my wife and son hate me", "start": 212.39, "duration": 2.459}, {"text": "They won't take my money the government won't let them anyway", "start": 215.609, "duration": 3.17}, {"text": "Mike was no dummy", "start": 218.989, "duration": 1.03}, {"text": "But every time he tried to get his nest egg to his granddaughter it ended up in Uncle Sam's pockets and Jack's steals", "start": 220.019, "duration": 6.29}, {"text": "Most of it leaving Walt with only one barrel or about 10 million", "start": 226.349, "duration": 3.919}, {"text": "I'm leaving you a barrel in this episode won't finds a workaround", "start": 230.28, "duration": 4.369}, {"text": "He intimidates his former partners Gretchen and Elliott into creating a trust for Walter jr", "start": 234.84, "duration": 4.97}, {"text": "On my son's 18th birthday, which is 10 months and 2 days from today", "start": 239.81, "duration": 5.16}, {"text": "You will give him his money in the form of an irrevocable trust", "start": 246.09, "duration": 4.519}, {"text": "He pays Skyler one last visit and gives her the bargaining chip", "start": 250.819, "duration": 3.27}, {"text": "She needs to get free of Walt's legal messes the coordinates for where Hanks, and Gomez's bodies are buried now. You trade that", "start": 254.09, "duration": 7.199}, {"text": "for a deal with the prosecutor", "start": 262.26, "duration": 2.0}, {"text": "Get yourself out of this and with his goal of ensuring his family's welfare at last achieved", "start": 265.05, "duration": 5.299}, {"text": "Walt takes one last look at each kid these shots of Walt regarding his wife and children for the last time before leaving to die", "start": 270.57, "duration": 7.489}, {"text": "Capture the tragedy of what Walt has chosen to do with the final chapter of his life for five seasons", "start": 278.25, "duration": 5.389}, {"text": "He focused so intensely on the pretext of providing for his family that he lost that family. I've lost my family", "start": 283.65, "duration": 7.97}, {"text": "Everything that I care about as Gilligan has said for years now", "start": 292.38, "duration": 4.13}, {"text": "He thought if he makes his family", "start": 296.51, "duration": 1.659}, {"text": "Financially sound that's really all he has to do as a man as a provider and as a father but on the other hand", "start": 298.169, "duration": 5.929}, {"text": "The family emotionally is scarred forever. Hank is dead Walter jr", "start": 304.26, "duration": 4.609}, {"text": "And Marie detest Walt Skyler is psychologically damaged from living as a ha in her own home and his baby daughter", "start": 308.87, "duration": 6.92}, {"text": "Holly will grow up in the shadow of her father's notoriety without any real memories of him", "start": 315.79, "duration": 4.949}, {"text": "Incidentally Walt once reveals he lost his father at an early age. My father died when I was six", "start": 321.199, "duration": 5.75}, {"text": "So this is a sad instance of history repeating as much as Walt's words say he's motivated by family love", "start": 327.02, "duration": 6.38}, {"text": "everything that I do everything I", "start": 334.07, "duration": 2.629}, {"text": "Do it to protect this family through his actions. He's actively distancing himself from his family. So buying that car", "start": 337.52, "duration": 7.55}, {"text": "That was protecting your family. He pushes Skyler and Walter jr", "start": 346.22, "duration": 3.649}, {"text": "Away, whenever they reach out to help him gambling addiction is a sickness you listen", "start": 349.87, "duration": 4.919}, {"text": "What is going on with me? Isn't that about some disease? It's about choices", "start": 355.55, "duration": 3.619}, {"text": "choices that I have made", "start": 359.96, "duration": 2.0}, {"text": "Choices, I stand by he defensively protests if they dare to speak about him as the victim of a disease or afraid for his life", "start": 362.3, "duration": 7.19}, {"text": "I am NOT in danger Skyler", "start": 369.59, "duration": 2.059}, {"text": "I am the danger Walter needs to be seen as a big powerful man", "start": 371.81, "duration": 4.91}, {"text": "A guy opens historian gets shot and you think of that of me? No, I", "start": 376.72, "duration": 4.019}, {"text": "Am the one who knocks, but Walt's family doesn't care about seeing him that way", "start": 381.38, "duration": 5.149}, {"text": "They love the old Walt who was a good man a good husband and father", "start": 386.74, "duration": 3.75}, {"text": "Remembering you that way", "start": 391.31, "duration": 2.0}, {"text": "Wouldn't be so bad", "start": 395.84, "duration": 2.0}, {"text": "The bad way to remember you would be the way", "start": 398.36, "duration": 2.9}, {"text": "The way you've been this whole last year", "start": 402.71, "duration": 2.329}, {"text": "Walt doesn't really want to be there with his family you're not moving back in now are you this hasn't ever been", "start": 405.55, "duration": 6.75}, {"text": "About his family these wild accusations", "start": 412.55, "duration": 2.45}, {"text": "They could destroy our family damn wash shit about family", "start": 415.13, "duration": 3.709}, {"text": "One of the most crucial episodes that gives us a window into Walt's inner", "start": 419.12, "duration": 4.19}, {"text": "Psychology is fly in which Walter obsesses over a fly that he says is causing contamination. There's", "start": 423.56, "duration": 5.959}, {"text": "Been a contamination", "start": 430.43, "duration": 2.0}, {"text": "What in this episode we see Walt's two selves wrestling with each other as the repressed old Walter makes a last attempt to surface", "start": 433.699, "duration": 7.64}, {"text": "Very sorry Walt muses that he wishes he'd found that perfect moment to die after he'd made enough money for his family", "start": 443.52, "duration": 7.009}, {"text": "But before they found out about his new life", "start": 450.539, "duration": 2.869}, {"text": "We can see here that on the deepest level Walt knows that spiritually he's lost his family", "start": 459.87, "duration": 5.839}, {"text": "He's no longer the same person. They love I've lived too long", "start": 465.93, "duration": 4.16}, {"text": "You want them to actually miss you", "start": 474.75, "duration": 2.0}, {"text": "Well that goes on to say that the night everything went wrong is the night Jane died", "start": 478.83, "duration": 4.489}, {"text": "So we can see he has a deep guilt about that", "start": 489.06, "duration": 2.869}, {"text": "You might say it's the moment his soul was really lost", "start": 498.96, "duration": 3.019}, {"text": "Just lived right up to that moment", "start": 503.43, "duration": 2.959}, {"text": "And one second the thing he was supposedly doing all this for is out of reach and can't be regained", "start": 508.139, "duration": 6.139}, {"text": "so in the end he says", "start": 514.32, "duration": 2.0}, {"text": "to cook", "start": 516.419, "duration": 2.0}, {"text": "about the contamination", "start": 518.49, "duration": 2.0}, {"text": "And of course here Walt is talking about his own life", "start": 523.32, "duration": 4.19}, {"text": "Throughout the series", "start": 532.55, "duration": 0.979}, {"text": "What's most frustrating about Walt is that he is constantly lying elaborate ornate utterly unnecessary lies", "start": 533.529, "duration": 7.08}, {"text": "In the finale Walt achieves the slightest glimmer of a partial Redemption by doing one very simple thing", "start": 542.24, "duration": 7.099}, {"text": "Telling the truth during his final conversation with Skyler", "start": 549.86, "duration": 3.589}, {"text": "He seems about to start his frequent refrain all the things that I did", "start": 553.449, "duration": 4.71}, {"text": "You need to understand I have to hear", "start": 560.42, "duration": 2.479}, {"text": "one more time", "start": 564.379, "duration": 2.0}, {"text": "That you did this", "start": 566.66, "duration": 1.859}, {"text": "For the family, but then he says I did it for me. I", "start": 568.519, "duration": 4.01}, {"text": "Liked it I", "start": 575.449, "duration": 2.0}, {"text": "Was good at it", "start": 580.429, "duration": 1.89}, {"text": "Skyler's relief is palpable at the end of the pilot. She asked him to be truthful with her", "start": 582.319, "duration": 4.64}, {"text": "Worst thing you can do is shut me out and ever since he's done nothing. But lie dad. Yeah", "start": 587.749, "duration": 6.47}, {"text": "Please can you just tell the truth?", "start": 595.73, "duration": 2.809}, {"text": "This hasn't really been a marriage since the start of the show. Not your wife", "start": 599.29, "duration": 4.469}, {"text": "Your hostage, but for this brief instant", "start": 604.429, "duration": 3.02}, {"text": "We glimpse a small piece of the marriage they once had in Ozymandias, we flashback to Walt and Skyler discussing their new baby's name", "start": 607.449, "duration": 7.38}, {"text": "Behind Walt in this shot is Jesse and the RV his future", "start": 616.579, "duration": 3.77}, {"text": "What's about to pull him away from his family? This flashback happens in the episode where Hank dies", "start": 620.35, "duration": 5.88}, {"text": "So the illusion that he's done this for his family is finally shot dead for good", "start": 626.269, "duration": 5.45}, {"text": "Through the tragic irony of Walt successfully providing for his family and losing their love in the process", "start": 634.65, "duration": 5.719}, {"text": "the show is getting out what it feels like to be a man in the society that tells you you're not one unless you make", "start": 640.56, "duration": 5.9}, {"text": "Bank", "start": 646.46, "duration": 1.39}, {"text": "provides", "start": 647.85, "duration": 2.0}, {"text": "While Walt's new alpha power comes with its share of thrills", "start": 653.61, "duration": 3.529}, {"text": "Becoming that macho provider cost Walt everything his decency himself and most certainly the family", "start": 661.23, "duration": 7.279}, {"text": "He's providing for his cost", "start": 668.51, "duration": 2.0}, {"text": "So we have to ask was it worth it", "start": 671.91, "duration": 3.5}, {"text": "Mr. White", "start": 680.64, "duration": 1.68}, {"text": "He's the devil", "start": 682.32, "duration": 1.53}, {"text": "Waltz plan to finish off. Jack's gang is the wish fulfillment part of the episode Walt gets everything to go his way", "start": 683.85, "duration": 6.559}, {"text": "You know he is he's smarter than you. He's luckier than you whatever you whatever you think supposed to happen", "start": 690.84, "duration": 7.099}, {"text": "I'm telling you the exact reverse", "start": 698.31, "duration": 2.0}, {"text": "Opposite of that he's gonna happen indeed after being more or less possessed by his inner Heisenberg Walt has come to enjoy an almost supernatural", "start": 700.65, "duration": 7.669}, {"text": "level of both cunning and fortune in Felina", "start": 708.48, "duration": 2.959}, {"text": "We see in full effect the Heisenberg that fans love who always has something hidden up his sleeve at the end of the penultimate episode", "start": 711.44, "duration": 7.41}, {"text": "He was all but defeated. I'd like to speak to the agent", "start": 719.13, "duration": 3.679}, {"text": "in charge of the Walter White investigation", "start": 724.26, "duration": 2.72}, {"text": "Then he saw Gretchen and Elliott on TV minimizing his involvement in gray matter", "start": 732.9, "duration": 4.7}, {"text": "This moment snaps him back into action because what fuels Heisenberg's drive and his genius more than anything else is", "start": 746.52, "duration": 7.19}, {"text": "Spite in the pilot. We see Walt looking at the plaque for research from his gray matter days while he exercises later", "start": 753.87, "duration": 6.77}, {"text": "We learn he's been monitoring the company's stock price", "start": 760.64, "duration": 2.309}, {"text": "every week I look it up every week and", "start": 763.53, "duration": 3.019}, {"text": "I sold my share", "start": 767.34, "duration": 2.0}, {"text": "my potential", "start": 770.25, "duration": 2.0}, {"text": "for", "start": 772.29, "duration": 1.14}, {"text": "$5,000. So it's the ultimate satisfaction when his plan to get the money to his family has the added bonus of putting these superior", "start": 773.43, "duration": 7.4}, {"text": "Billionaires in their place. This is where you get to make it right Walt embraces the terror. He now inspires in civilized society", "start": 781.2, "duration": 7.76}, {"text": "All he meets are a couple of laser pointers wielded by badger and skinny Pete to make Gretchen and Elliott believe they're being monitored by", "start": 791.58, "duration": 7.369}, {"text": "expert hitmen", "start": 798.96, "duration": 2.0}, {"text": "Whatever happens to me tomorrow", "start": 802.57, "duration": 2.0}, {"text": "They'll still be out there", "start": 807.61, "duration": 1.92}, {"text": "meanwhile Walt scores a meeting at Jack's by crashing Todd's and Lydia's meeting making up a fake story that he wants to sell them a", "start": 809.53, "duration": 6.619}, {"text": "new recipe", "start": 816.15, "duration": 1.51}, {"text": "a", "start": 817.66, "duration": 1.14}, {"text": "new method that", "start": 818.8, "duration": 1.77}, {"text": "Requires no methylamine. We don't know yet", "start": 820.57, "duration": 2.9}, {"text": "What Walt's real plan is when he walks into Jack's place, but the camera shows him paying special attention to his car keys", "start": 823.47, "duration": 6.299}, {"text": "Well, you don't before shaving", "start": 830.08, "duration": 2.0}, {"text": "Yes, and sure enough, he's rigged his trunk with an m60 to take out Jack's entire gang through the wall", "start": 833.5, "duration": 6.35}, {"text": "After the bloodbath Walt answers Todd's phone", "start": 840.94, "duration": 3.05}, {"text": "Has he gone and we find out that the cherry on top of the plan was poisoning Lydia", "start": 846.16, "duration": 5.029}, {"text": "Kind of under the weather", "start": 853.6, "duration": 2.0}, {"text": "Like you've got the flu", "start": 856.03, "duration": 2.0}, {"text": "That would be the ricin I gave you so Walt gets the final", "start": 858.91, "duration": 3.559}, {"text": "Satisfaction of wrapping up all his loose ends and even being the one to tell Lydia how he played her", "start": 862.93, "duration": 5.149}, {"text": "This is a classic Heisenberg Ian plan, he tricked Lydia into thinking he was a liability and an easy target I", "start": 872.23, "duration": 7.489}, {"text": "Need the money even hamming up his COFF", "start": 880.36, "duration": 2.629}, {"text": "Jesus did you look at him?", "start": 888.46, "duration": 2.0}, {"text": "You'd be doing him a favor when in fact he was using his knowledge of her character against her her predictability", "start": 893.08, "duration": 6.44}, {"text": "10:00 a.m. Every", "start": 900.07, "duration": 2.0}, {"text": "Tuesday morning you and I met here", "start": 902.23, "duration": 2.029}, {"text": "your other", "start": 905.08, "duration": 1.86}, {"text": "Schedule oriented her extreme caution, which surpasses even her greed right now not worse", "start": 906.94, "duration": 6.53}, {"text": "we're not doing business with him her willingness to have people killed as in Mike's words a", "start": 913.99, "duration": 5.06}, {"text": "Prophylactic measure but here in the real world", "start": 919.24, "duration": 2.33}, {"text": "We don't kill 11 people with some kind of prophylactic measure and of course her addiction to her favorite sweetener", "start": 921.57, "duration": 7.11}, {"text": "And I'm assuming you don't have stevia", "start": 928.68, "duration": 2.069}, {"text": "Never mind", "start": 931.72, "duration": 2.0}, {"text": "And I'll make more stevia", "start": 933.92, "duration": 2.0}, {"text": "Gilligan has compared the", "start": 937.01, "duration": 1.29}, {"text": "Ricin to check offs gun the playwright's famous idea that if you show us a gun at some point it has to go off", "start": 938.3, "duration": 7.13}, {"text": "We've heard a lot about this. Ricin cigarette won't want a Jesse to use it to poison Gus", "start": 946.82, "duration": 5.39}, {"text": "Jesse thought it was used by Walt or by Gus to poison Brock but no one has", "start": 952.4, "duration": 5.119}, {"text": "Actually been poisoned by the ricin. So the writer is managed to get their Chekhov's gun to fire just before the end", "start": 957.83, "duration": 6.5}, {"text": "The first line of baby blue tells us", "start": 966.74, "duration": 2.45}, {"text": "And", "start": 973.04, "duration": 1.08}, {"text": "Walt probably has got what he deserved for better and for worse", "start": 974.12, "duration": 3.89}, {"text": "But when we met Walt he was very much not getting what he deserved. He's been dealt a pretty rotten hand in life", "start": 978.01, "duration": 6.899}, {"text": "This is a guy who gets lung cancer without ever having smoked mister. Why are you a smoker?", "start": 984.91, "duration": 5.79}, {"text": "Breaking Bad gets us on Walt's side in the pilot by introducing us to a bad broken world one. That is first and foremost", "start": 993.32, "duration": 6.71}, {"text": "Unjust so it's easy to want beaten down Walt to fight back even play a little dirty against this bunch of people who are mean", "start": 1000.91, "duration": 6.98}, {"text": "nasty", "start": 1007.99, "duration": 1.17}, {"text": "unlikable and undeserving", "start": 1009.16, "duration": 2.0}, {"text": "There's a theme going throughout the show of the grave error of under estimating people another person Walt", "start": 1011.17, "duration": 6.2}, {"text": "But you wouldn't know criminal if he was close enough to check you for a hernia", "start": 1017.37, "duration": 2.7}, {"text": "Wanted you guys", "start": 1023.14, "duration": 1.71}, {"text": "And the Walter White we meet has been underestimated all his life", "start": 1024.85, "duration": 4.7}, {"text": "But how wrong they all were to write him off", "start": 1029.56, "duration": 3.409}, {"text": "You're goddamn right", "start": 1037.15, "duration": 2.0}, {"text": "so the biggest", "start": 1039.37, "duration": 1.38}, {"text": "satisfaction of the finale is that everyone else gets what they deserve -", "start": 1040.75, "duration": 3.949}, {"text": "Trust me", "start": 1045.069, "duration": 0.711}, {"text": "This woman deserves to die as much as any man I've ever met Jack's gang Todd and Lydia very much", "start": 1045.78, "duration": 6.869}, {"text": "Had it coming billionaires Gretchen and Elliott get taken down a peg while the innocents catch a break", "start": 1052.65, "duration": 5.039}, {"text": "Felina creates that feeling that in the end Walt achieved some version of justice. We want to live in a moral universe", "start": 1057.99, "duration": 7.14}, {"text": "I want to believe that there is some sort of", "start": 1065.26, "duration": 2.0}, {"text": "Justice, and it's one of the greatest things humankind is created for itself Walt's final chapter benefits from if not total moral", "start": 1067.75, "duration": 7.969}, {"text": "justice", "start": 1075.79, "duration": 0.5}, {"text": "then a kind of poetic one if the universe is indeed chaotic if this is", "start": 1076.29, "duration": 4.979}, {"text": "The one small way I can exert some control over it in the fiction that I write. Maybe that's why I", "start": 1081.58, "duration": 5.06}, {"text": "Am drawn to writing in the first place. There is a there is a shape to it. That is", "start": 1087.4, "duration": 4.579}, {"text": "Perhaps neither happy nor sad but at least pleasing as Gilligan has said Walt is never going to redeem himself", "start": 1092.95, "duration": 6.2}, {"text": "He's just too far down the road to damnation. But at least he takes a fuse ups along that path", "start": 1099.16, "duration": 5.13}, {"text": "Walt can never come back from the unspeakable damage he's done and the lives he's taken but he does do a couple of things in", "start": 1104.42, "duration": 6.77}, {"text": "The finale that partially redeem him one is telling the truth to Skyler and the other is freeing Jesse", "start": 1111.19, "duration": 6.839}, {"text": "so in the second part of this video", "start": 1119.27, "duration": 1.94}, {"text": "We'll look at why Walt decides to save Jesse and what the end of their mysterious partnership reveals about the show's underlying ethos", "start": 1121.21, "duration": 7.86}, {"text": "I'm not doing what you want anymore", "start": 1129.71, "duration": 2.0}, {"text": "Hi guys, this is Alana and today", "start": 1138.5, "duration": 2.3}, {"text": "I want to talk to you about one of our favorite places to watch movies", "start": 1140.8, "duration": 3.329}, {"text": "mu B mu B is a treasure trove of films from around the globe every", "start": 1144.2, "duration": 4.28}, {"text": "Day a new film is added and the oldest is taken away", "start": 1148.67, "duration": 2.9}, {"text": "So in this world where it's very easy to spend hours debating what you should watch", "start": 1151.61, "duration": 4.339}, {"text": "Movie is like having a really cool friend with amazing taste in movies making it so much easier for you", "start": 1156.17, "duration": 4.849}, {"text": "They feature hard to come by masterpieces indie festival darlings", "start": 1161.2, "duration": 3.48}, {"text": "influential art house and forum films", "start": 1165.11, "duration": 1.92}, {"text": "Lesser-known films by your favorite famous directors and more plus you can even download the films to watch offline and there are no ads ever", "start": 1167.03, "duration": 7.189}, {"text": "One movie you can watch right now on movie is e tu mama tambien", "start": 1174.71, "duration": 4.04}, {"text": "it's directed by Alfonso Cuaron whose newest movie Romo has been earning rave reviews and Oscar buzz e tu mama tambien is a", "start": 1178.75, "duration": 7.56}, {"text": "Hilarious moving story following two teenage boys who set off on a cross-country trip with an older married woman", "start": 1186.68, "duration": 6.679}, {"text": "Point is we can't recommend mu B highly enough. You can try it out for free for a whole month", "start": 1193.58, "duration": 4.7}, {"text": "Just click the link in the description below", "start": 1198.28, "duration": 2.0}]