[{"text": "In Los Angeles parking is notoriously awful signs are beyond confusing", "start": 0.0, "duration": 4.98}, {"text": "Tickets are expensive and meter maids are prompt as all hell, so, of course one day I'm running late to an audition", "start": 5.44, "duration": 4.97}, {"text": "So I just park on a street without solving the riddle of the sign and I just run inside", "start": 10.41, "duration": 4.41}, {"text": "When I got back to my car", "start": 14.95, "duration": 1.28}, {"text": "There was this like old man and the process of writing me a ticket and just out of pure habit when he handed it to", "start": 16.23, "duration": 5.309}, {"text": "Me I said thank you and he immediately", "start": 21.539, "duration": 2.64}, {"text": "broke down crying", "start": 24.76, "duration": 1.32}, {"text": "Man: *Sobs* Noone's ever thanked me before", "start": 26.28, "duration": 3.46}, {"text": "Anna: Oh", "start": 30.16, "duration": 0.68}, {"text": "Man: People are always so angry to see me you know?", "start": 30.84, "duration": 2.58}, {"text": "I've been cursed at, had stuff thrown at me", "start": 33.86, "duration": 3.08}, {"text": "One guy tried to punch me. I'm just doing my job, you know,?", "start": 37.14, "duration": 3.3}, {"text": "Anna: Oh I'm sorry, but it's ok. I mean honestly, it's  my fault for not reading the signs.", "start": 40.44, "duration": 4.64}, {"text": "Man: EXACTLY! It's not like I wanna give everyone tickets. It's so hard having a job where everyone hates you", "start": 45.26, "duration": 6.4}, {"text": "*Man continues to cry while the valiant Anna consoles him*", "start": 51.66, "duration": 3.56}, {"text": "But it did get me thinking because", "start": 55.3, "duration": 1.52}, {"text": "yeah everyone in Los Angeles and I'm sure other big cities hate returning their car and seeing a meter maid and", "start": 56.829, "duration": 5.029}, {"text": "Knowing that a ticket is upwards of like 50 bucks here", "start": 61.96, "duration": 2.87}, {"text": "I'm sure people start freaking out because they're financially strapped or upset at themselves", "start": 64.83, "duration": 4.169}, {"text": "And I started to wonder about all the other people who work jobs that we have a negative association with like people at the DMV", "start": 69.1, "duration": 6.559}, {"text": "Or tax auditors. How does that make you feel?", "start": 75.76, "duration": 3.46}, {"text": "Flash from Zootopia: Sad", "start": 80.44, "duration": 2.0}, {"text": "It's not my fault that the DMV is so slow", "start": 84.12, "duration": 4.46}, {"text": "Forreal tho I love that sloth scene from Zootopia. So I had to work it in", "start": 88.74, "duration": 2.87}, {"text": "but anyway", "start": 91.61, "duration": 0.51}, {"text": "I found that I have more compassion for people doing tough work and that I should really start taking more responsibility", "start": 92.12, "duration": 5.28}, {"text": "For myself and my choices like it's not a meter maids fault", "start": 97.46, "duration": 3.34}, {"text": "If I don't read the signs or fill out my parking meter on time", "start": 100.82, "duration": 2.58}, {"text": "And it's not a tax auditors fault if anyone chooses to lie on their taxes or be really lazy and filling them out", "start": 103.4, "duration": 5.4}, {"text": "So I encourage you when you encounter someone who can't get your order right or who pulls you over or who's just an animated sloths?", "start": 108.8, "duration": 6.02}, {"text": "Have empathy practice", "start": 114.82, "duration": 2.0}, {"text": "accountability if it is your fault and know that we're all just doing the best that we can. Now whenever I feel", "start": 116.9, "duration": 5.42}, {"text": "frustrated with bad service", "start": 122.4, "duration": 1.219}, {"text": "I try to imagine that like older gentleman crying and think", "start": 123.619, "duration": 3.24}, {"text": "You know what?", "start": 127.02, "duration": 0.62}, {"text": "Maybe this waiter just had a fight with his father and maybe that", "start": 127.64, "duration": 2.669}, {"text": "Salesperson was just left by their wife and now is trying to figure out how to support their kids on one salary", "start": 130.47, "duration": 4.369}, {"text": "I remember when I worked at Gamestop in my teens", "start": 134.84, "duration": 3.059}, {"text": "one time I went to the back room to cry because my sister had died only a few months earlier and", "start": 138.48, "duration": 4.37}, {"text": "I returned to work 'cuz I really wanted the distraction. But I mean it was tough and", "start": 142.94, "duration": 4.56}, {"text": "my coworker came into the back room to kind of comfort me and this lady just barged in and", "start": 147.86, "duration": 5.02}, {"text": "Screamed at us for being horrible customer service reps and that she'd been waiting to check out for like five minutes", "start": 152.92, "duration": 5.76}, {"text": "And I was like, hey ma'am, I'm so sorry", "start": 158.85, "duration": 1.82}, {"text": "I recently lost a family member and instead she was just like you're a liar and you're probably having sex with your co-worker in the backroom", "start": 160.67, "duration": 6.19}, {"text": "And I'll never forget how I felt in that moment", "start": 166.98, "duration": 2.03}, {"text": "I was so dumb struck that anyone could be that callous over waiting five freaking minutes to buy a video game like", "start": 169.01, "duration": 6.719}, {"text": "Come on lady. We're all gonna die", "start": 176.04, "duration": 1.37}, {"text": "I mean, do you really need to have that kind of attitude before we do so yeah", "start": 177.41, "duration": 3.509}, {"text": "I guess another lesson of this video would be that everyone needs to work food service or", "start": 180.92, "duration": 4.229}, {"text": "Retail to figure out how to be a better human being I'm Anna Akana", "start": 185.4, "duration": 3.559}, {"text": "Stay right here for an animated sponsored message from the wonderful Bethany Radloff (Animator)", "start": 189.269, "duration": 4.13}, {"text": "Thank you to Squarespace for sponsoring today's video", "start": 196.1, "duration": 3.88}, {"text": "Squarespace has beautiful award-winning templates", "start": 200.64, "duration": 3.62}, {"text": "and in all-in-one", "start": 205.8, "duration": 2.0}, {"text": "Platforms there's no need to install patches or upgrades ever", "start": 207.9, "duration": 5.6}, {"text": "They have 24-hour customer service and a simple and unique domain setup experience", "start": 214.68, "duration": 6.84}, {"text": "With Squarespace you can create any kind of website", "start": 223.22, "duration": 4.54}, {"text": "Whether you're a meter maid", "start": 228.0, "duration": 2.0}, {"text": "A car sales person or you just want to make a page", "start": 230.22, "duration": 4.22}, {"text": "that tracks how many parking tickets you've accumulated in L.A.", "start": 234.46, "duration": 4.76}, {"text": "Go to squarespace.com/anna to start your free trial today", "start": 242.36, "duration": 6.62}, {"text": "And use the offer code \"Anna\" for 10% off at checkout", "start": 249.8, "duration": 5.08}, {"text": "*zzz*", "start": 254.88, "duration": 2.0}]