[{"text": "In this video", "start": 0.559, "duration": 1.171}, {"text": "I will be showing you how to create this modern square-shaped ceiling lamp", "start": 1.73, "duration": 4.819}, {"text": "that utilizes nine gu10 LED spots for traditional", "start": 6.979, "duration": 4.22}, {"text": "illumination purposes but additionally features an RGB AWA LED strip", "start": 11.81, "duration": 5.87}, {"text": "Which is used for indirect mood lighting?", "start": 17.93, "duration": 2.51}, {"text": "the color of its can of course get adjusted by regular RF remotes", "start": 21.41, "duration": 4.819}, {"text": "But also through a Wi-Fi control app, which is certainly handy to have", "start": 26.57, "duration": 5.18}, {"text": "so sit back and enjoy the rather Lanfear an exhausting process of", "start": 32.599, "duration": 4.76}, {"text": "Creating this ceiling lamp by me and my assistant in around five days of work", "start": 37.76, "duration": 5.36}, {"text": "Let's get started", "start": 44.03, "duration": 2.0}, {"text": "This video is sponsored by jl CPC be where you can get ten PCBs for the price of only two dollars", "start": 57.59, "duration": 7.219}, {"text": "So feel free to upload yokubou fights today to test out their PCB service", "start": 65.63, "duration": 5.09}, {"text": "Now before I can show you all the super-fun", "start": 72.64, "duration": 2.48}, {"text": "Mechanical and electrical work we had to go through. I need to firstly present you the blueprint of the ceiling lamp we had in minds", "start": 75.43, "duration": 7.849}, {"text": "basically puts we wanted to create a big cuboid which features nine le d-- spots at the bottom and", "start": 84.34, "duration": 6.68}, {"text": "houses along LED strip on the top", "start": 91.45, "duration": 2.54}, {"text": "Sounds easier but the details are where it got complicated", "start": 94.78, "duration": 3.44}, {"text": "To create the depth of the cuboids. We used stacked up wood laps with dimensions of 24 by 48 millimeters", "start": 99.46, "duration": 7.879}, {"text": "For the bottom part we used Bevo boards Rapids, which is a so-called light bulb platter", "start": 108.52, "duration": 5.929}, {"text": "Meaning it is lights, but can handle quite a bit of force", "start": 115.15, "duration": 3.109}, {"text": "Sadly though. It only came with dimensions of", "start": 119.44, "duration": 3.019}, {"text": "1200 by 800 millimeters so we had to get creative to achieve our designated dimension of", "start": 123.13, "duration": 6.889}, {"text": "1.2 by 1.2 meters but more about that later", "start": 130.45, "duration": 3.5}, {"text": "For the upper parts. We used a 19 millimeter fake piece of MDF", "start": 135.04, "duration": 4.009}, {"text": "Which was quite heavier", "start": 139.63, "duration": 1.52}, {"text": "But necessary because we wanted to house the RGB W LEDs inside this MDF piece", "start": 141.15, "duration": 6.96}, {"text": "flats whippet surface", "start": 148.48, "duration": 2.0}, {"text": "now what I could bore you even more with what lengths all of our screws guards or", "start": 150.91, "duration": 4.669}, {"text": "More detailed information on how we achieve proper load balancing or what kind of components are necessary for the electrical wiring", "start": 155.89, "duration": 7.55}, {"text": "But for now, you should get the basic idea of the lamp. So let's get started building", "start": 164.019, "duration": 5.63}, {"text": "We started off by opening up our wood laughs pack", "start": 170.65, "duration": 3.23}, {"text": "Onto which we then created precisely measured markings to build - wood squares", "start": 174.25, "duration": 4.97}, {"text": "for that we firstly used the jigsaw to create the eight required wood left pieces and", "start": 180.19, "duration": 5.809}, {"text": "Then formed a square with the first four of them", "start": 186.19, "duration": 3.109}, {"text": "By using those brackets and a 2.5 millimeter drill", "start": 190.12, "duration": 3.589}, {"text": "we firstly pre-drilled holes and then used wood screws to join all the wood laughs together as", "start": 193.989, "duration": 6.05}, {"text": "Soon as the first square was done. It was time to repeat the brackets mounting process in order to form the second square", "start": 200.8, "duration": 7.66}, {"text": "Before joining them though. I added a bigger wood screw for stability through all edge connections", "start": 209.46, "duration": 5.99}, {"text": "Afterwards, we stacked up the two squares and combined them by using 16 longer screws", "start": 216.78, "duration": 6.05}, {"text": "At this point we broaden the first there Hobart Rapids", "start": 223.71, "duration": 3.919}, {"text": "Which as you can imagine we secured to the wood square with tons of screws", "start": 227.88, "duration": 4.82}, {"text": "After marking evenly spaced locations for them", "start": 233.04, "duration": 2.989}, {"text": "Then we positioned the second parts marked where we need to cut it and used a jigsaw for that which worked surprisingly well", "start": 236.97, "duration": 7.79}, {"text": "After a demoting adhesive, we push the boards together and secure the second one with screws as well", "start": 246.12, "duration": 6.199}, {"text": "to properly spaced the LED spots", "start": 253.08, "duration": 2.57}, {"text": "we created a 4x4 checker boards onto the now acquired complete bottom boards and", "start": 255.87, "duration": 5.72}, {"text": "Used a sixty eight millimeter else Kaiser for which I could not find a proper English translation (Hole saw)", "start": 261.9, "duration": 6.23}, {"text": "In order to create the holes for the metal housing of the gu10 LED spots after", "start": 268.41, "duration": 5.63}, {"text": "All nine holes were created", "start": 274.92, "duration": 2.0}, {"text": "we measured outs and cuts tumor would lapse which we positioned inside the square and", "start": 277.02, "duration": 5.899}, {"text": "Secure them to its to improve its stability", "start": 283.26, "duration": 2.479}, {"text": "Once the bevel board Rapids was mounted to those wood pieces as well", "start": 287.1, "duration": 4.519}, {"text": "It was time for the electrical wiring work which requires quite a bit of material", "start": 291.66, "duration": 5.54}, {"text": "The process was simple though. I firstly pushed the GU 10 socket wires into a small distribution box", "start": 298.32, "duration": 6.859}, {"text": "Edit vago terminals to them pushed NIMH wire into the same box", "start": 305.85, "duration": 4.61}, {"text": "Edit the life and neutral wire to one voter minal each and closed the box up", "start": 311.1, "duration": 5.63}, {"text": "Why this work looks simple?", "start": 317.73, "duration": 1.91}, {"text": "It is important to note though that it should be done by professional electrician. You have been warned", "start": 319.64, "duration": 6.63}, {"text": "But anyway once all nine boxes were wired up", "start": 327.03, "duration": 3.68}, {"text": "I added 11 holes to a bigger terminal box, which I then mounted to one in a wood. Laughs", "start": 331.01, "duration": 6.119}, {"text": "After then pushing nine smaller terminal box virus into the bigger one", "start": 337.65, "duration": 4.94}, {"text": "I used Vargo terminals once again and to connect poor neutral and life virus in parallel", "start": 342.59, "duration": 6.209}, {"text": "at the end of this wiring process", "start": 349.59, "duration": 2.179}, {"text": "I removed these sockets of the LED power supply cable", "start": 351.8, "duration": 3.779}, {"text": "Removed the insulation of its virus and added those to the Vaako terminals along with an additional", "start": 356.04, "duration": 6.98}, {"text": "hookup wire which I prepared before hands", "start": 363.6, "duration": 2.959}, {"text": "As soon as all the wiring was completes", "start": 367.02, "duration": 3.11}, {"text": "I closed up the terminal box and finally moved on to the big MDF boards", "start": 370.13, "duration": 5.609}, {"text": "For which I firstly needed another box though", "start": 375.99, "duration": 2.779}, {"text": "Which contained aluminum profiles with a milky white acrylic top for the LED strips?", "start": 379.23, "duration": 5.809}, {"text": "Those featured a height of 8 millimeters and width of 40 millimeters", "start": 386.04, "duration": 4.61}, {"text": "Which were important dimensions for the groove cutter I chose", "start": 391.02, "duration": 3.589}, {"text": "By adding it to a hand router. I was able to create a very precise indentation", "start": 395.46, "duration": 5.089}, {"text": "Which can take in the aluminum profile and thus create a first surface very neat", "start": 401.19, "duration": 5.66}, {"text": "so I marked a half complete square onto the MDF piece edges to build a hole for the starting point of the router and", "start": 407.85, "duration": 7.579}, {"text": "Then used it to create the four indentation lines which together form the square", "start": 415.68, "duration": 5.389}, {"text": "Next I marked a suitable length for the profiles and cut them with a simple handsaw", "start": 422.34, "duration": 5.539}, {"text": "Afterwards, we utilized mounting adhesive to secure them inside the indentations", "start": 429.09, "duration": 4.82}, {"text": "At this point I unpacked the RGB W LED kits with all of its components", "start": 434.79, "duration": 5.99}, {"text": "Which I got for cheap from eBay", "start": 440.94, "duration": 2.24}, {"text": "After hooking it all up. I tested whether the remote works which he did and", "start": 444.33, "duration": 5.119}, {"text": "Afterwards tested the Wi-Fi control app which worked beautifully as well", "start": 450.12, "duration": 4.79}, {"text": "so I created a hole next to the start LED strip through which I will later feed the wires and", "start": 455.76, "duration": 6.59}, {"text": "Continued by removing the acrylic glass top", "start": 462.99, "duration": 2.989}, {"text": "Measuring out the LED strips cutting them and securing them inside the profiles with Tisa pecks", "start": 466.62, "duration": 7.039}, {"text": "At the end I had to connect all four individual strips through", "start": 474.539, "duration": 4.339}, {"text": "0.75 millimeter wire", "start": 479.519, "duration": 2.0}, {"text": "Otherwise the following LED light-up tests would not have been successful", "start": 481.709, "duration": 4.4}, {"text": "But since one test was not enough", "start": 487.229, "duration": 2.329}, {"text": "I also tested the complete electrical system, which as you can see you work without a problem", "start": 489.559, "duration": 6.179}, {"text": "Before joining the MDF boards to the lamp though", "start": 496.619, "duration": 2.899}, {"text": "We created former wood left pieces, which we once again used to increase the stability of the structure", "start": 499.889, "duration": 6.769}, {"text": "Once that was done", "start": 507.629, "duration": 1.34}, {"text": "I drilled a big hole in the middle of the MDF ports hooked up the LED power supply to the LEDs and", "start": 508.969, "duration": 7.229}, {"text": "Finally positioned the MDF ports on to the lamp", "start": 516.659, "duration": 3.02}, {"text": "Needless to say we pre drilled a ton of holes and used big wood screws to properly secure the MDF ports", "start": 520.769, "duration": 7.4}, {"text": "Before we move the whole lamp over to a higher position", "start": 528.689, "duration": 3.23}, {"text": "Here we created a simple yet complicated mounting mechanic for the lamp which required a lot of measuring", "start": 533.1, "duration": 7.669}, {"text": "Cutting drilling mounting and a lot of other interesting woodworking terms", "start": 541.079, "duration": 5.21}, {"text": "But let me break it down for you on paper. So you understand how it works", "start": 546.449, "duration": 4.82}, {"text": "We basically secured a piece of woods onto the ceiling which features four pieces of woods", "start": 552.18, "duration": 6.019}, {"text": "Which have a big hole in the center?", "start": 558.269, "duration": 2.059}, {"text": "Through this hole we can push this massive m14 threaded rods", "start": 561.149, "duration": 4.729}, {"text": "Now the lamp cut a fitting wood construction with four pieces of wood as well", "start": 566.85, "duration": 4.789}, {"text": "Which we can use to interlock the lamp with the ceiling structure through the m14 rods easy", "start": 571.92, "duration": 6.559}, {"text": "So as soon as these systems work together, successfully we mounted the ceiling part of its but not the lamp yet", "start": 579.6, "duration": 7.609}, {"text": "Because beforehand we added Barrow board Rapids all around the wood square-headed a bit of putty around the edges", "start": 587.879, "duration": 7.49}, {"text": "Sanded it down and glued in grain wallpaper on the lamp to make it look good", "start": 596.009, "duration": 5.39}, {"text": "Once that was done. We lifted the lamp up that the mains voltage wiring and secured it to the ceiling", "start": 602.399, "duration": 7.109}, {"text": "After then inserting all the GU 10 LEDs the lamp was finally complete", "start": 610.509, "duration": 5.24}, {"text": "Now I'm very happy with the results and I hope it inspires you to build something similar on your own", "start": 616.36, "duration": 6.44}, {"text": "If you like this video then don't forget to Like share and subscribe", "start": 623.529, "duration": 3.83}, {"text": "Stay creative and I will see you next time", "start": 628.66, "duration": 3.409}]