[{"text": "The history of the Mediterranean is both very long and very crowded.", "start": 0.03, "duration": 3.659}, {"text": "So it's hard to get a big picture when we're busy investigating individual civilizations like Egypt, Rome, or the Ottomans.", "start": 3.689, "duration": 5.49}, {"text": "However, a great way to see the whole of Mediterranean history is actually to zoom right in on the middle, to the island of Malta.", "start": 9.3, "duration": 6.26}, {"text": "It's quite an unlikely story,", "start": 15.56, "duration": 1.54}, {"text": "but this easily overlooked rock off the coast of Sicily has experience with all the big", "start": 17.1, "duration": 3.88}, {"text": "Mediterranean players and the resulting cocktail of Maltese history is uniquely fascinating.", "start": 21.0, "duration": 4.32}, {"text": "To see how Malta Forrest Gump-ed its way through the greatest hits of the Mediterranean, let's do some history.", "start": 25.32, "duration": 4.54}, {"text": "This video is brought to you by NordVPN. More on that later.", "start": 29.94, "duration": 3.36}, {"text": "From the start, Malta's legacy manifests in two main ways: Language and Architecture.", "start": 33.3, "duration": 5.0}, {"text": "A thousand years before even the Pyramids of Giza, Stone Age builders on Malta had constructed the first ever", "start": 38.3, "duration": 5.06}, {"text": "freestanding man-made structure: The Great Temple of-", "start": 43.36, "duration": 3.24}, {"text": "Oh ... Boy...", "start": 47.44, "duration": 1.96}, {"text": "What? It's just Gigantea, then why is it spelled like that? We'll double back to the linguistics later.", "start": 49.94, "duration": 6.72}, {"text": "But in the meantime, Malta was colonized by the seafaring Phoenicians and named as Maleth and soon enough", "start": 56.66, "duration": 4.84}, {"text": "they're a part of the growing Carthaginian Empire.", "start": 61.5, "duration": 2.02}, {"text": "But after Carthage got into a tussle with Rome over the island of Sicily, aka the First Punic tussle.", "start": 63.52, "duration": 5.08}, {"text": "Rome annexed Maleth.", "start": 68.6, "duration": 0.96}, {"text": "Renamed it Melite and took it on a ride through the up and down of the Roman Empire.", "start": 69.7, "duration": 3.8}, {"text": "In the 1st century AD, the island had one very famous visitor in the form of Saint Paul himself.", "start": 73.6, "duration": 4.72}, {"text": "Supposedly shipwrecked on Melite while on his way to Rome for trial and we'll see later that the Maltese love them some good St. Paul.", "start": 78.42, "duration": 5.88}, {"text": "Melite became part of the Byzantine Empire after the fall of Western Rome and remained Greek until 870.", "start": 84.42, "duration": 4.92}, {"text": "When the island was conquered by Muslims, sacked and left nearly barren for two centuries.", "start": 89.34, "duration": 3.92}, {"text": "This is why the ancient settlements are basically gone now and why we have no Maltese primary sources at all.", "start": 93.26, "duration": 5.5}, {"text": "In 1048, Malta was repopulated by Arabic colonists", "start": 98.76, "duration": 2.44}, {"text": "who resettled on the site of the ancient city Melite, the highest part of the island and renamed it Medina", "start": 101.3, "duration": 5.4}, {"text": "and the modern city name of Medina is nearly identical. (Mdina)", "start": 106.7, "duration": 2.76}, {"text": "In fact, this second wave of Arab settlement really dug their linguistic claws into Malta,", "start": 109.46, "duration": 4.02}, {"text": "as place names and a vast majority of the modern Maltese language derive from Arabic. But, like the carousel of", "start": 113.48, "duration": 4.9}, {"text": "empires we've seen up until this point, the Muslim dominion over Malta came to an end as the island was seized as a vassal state", "start": 118.38, "duration": 5.519}, {"text": "in 1091. by who else but the Normans. I tell ya, nobody loves history more than those Normans.", "start": 123.9, "duration": 5.78}, {"text": "They're everywhere in the 11th century and they're always making friends.", "start": 129.68, "duration": 3.16}, {"text": "Extroverts. Things carried on as they were for a few more decades.", "start": 133.49, "duration": 2.93}, {"text": "But after an anti-Norman revolt from the Muslim population in 1127, King Raja", "start": 136.42, "duration": 3.899}, {"text": "the Second properly conquered the island and assumes direct rule. And since the Normans also own southern Italy and Sicily,", "start": 140.32, "duration": 5.74}, {"text": "Norman Malta got real close with their Italian buddies.", "start": 146.06, "duration": 2.68}, {"text": "So the local Arabic went through big shifts to accommodate all of this new Italiano and Maltese began to evolve into what is now the", "start": 148.75, "duration": 6.06}, {"text": "world's only Semitic language written in a Roman script.", "start": 154.81, "duration": 2.639}, {"text": "This language is bonkers front to back and I loved it. In the 11th and 12th hundreds,", "start": 157.45, "duration": 4.139}, {"text": "Norman Malta became a hot spot on the pilgrimage circuit from Rome to the Holy Land and it shared in a good deal of the", "start": 161.59, "duration": 4.889}, {"text": "wealth from they're extremely powerful next-door neighbors Sicily.", "start": 166.48, "duration": 2.12}, {"text": "Malta changed hands a few times in the 13th century and the majority", "start": 168.7, "duration": 3.58}, {"text": "population of Maltese Muslims slowly dwindled under the very indirect rule of the Holy Roman Empire and then dwindled rapidly when the island passed to", "start": 172.3, "duration": 6.66}, {"text": "the dominionship in England in 1266. It eventually stayed put under the rule of Aragon in 1282", "start": 178.96, "duration": 5.009}, {"text": "which became the Spanish Empire one Reconquista later. As Malta is just chillin for the next 200 years.", "start": 183.97, "duration": 4.8}, {"text": "Our story actually takes us to the eastern edge of the Mediterranean and back two centuries to the Crusades.", "start": 188.77, "duration": 5.35}, {"text": "After the Christian armies retook the Holy Land in 1099, pilgrims from all over Europe were looking to visit Jerusalem.", "start": 194.2, "duration": 5.62}, {"text": "But travel that far is really complicated because the boats are slow,", "start": 199.84, "duration": 2.88}, {"text": "there are pirates everywhere, diseases rampant, and there's not even on ship Wi-Fi. The barbarity. So what do you do?", "start": 202.72, "duration": 6.18}, {"text": "Well you get a whole bunch of knights and you put them right through medical school.", "start": 208.9, "duration": 3.24}, {"text": "Just establish a sovereign military order of warrior monks dedicated to the protection and care of pilgrims and problemo solved.", "start": 212.3, "duration": 5.72}, {"text": "What's the fuss?", "start": 218.42, "duration": 0.88}, {"text": "For two whole centuries the Knights of St. John,", "start": 219.3, "duration": 2.139}, {"text": "also known as the Hospitallers cared for the sick and operated hospitals across the Holy Land.", "start": 221.44, "duration": 4.2}, {"text": "If the Templars are like Mario, these guys are like the Dr. Mario's of monastic knighthoods.", "start": 225.97, "duration": 4.47}, {"text": "They operated all across the Crusader Kingdom of Jerusalem and after the city fell at the start of the Third Crusade,", "start": 230.44, "duration": 5.01}, {"text": "they refortified Acre until 1291 when the Knights got kicked out of the Holy Land for good.", "start": 235.48, "duration": 4.88}, {"text": "From there they did what any good Crusader would do in the 1200s and beat the crap out of poor defenseless Constantinople.", "start": 240.36, "duration": 5.04}, {"text": "I mean if everybody's doing it, you don't want to be left out, you know.", "start": 245.44, "duration": 3.3}, {"text": "So they conquered the island of Rhodes in 1310 and built up a gorgeous fortress on the island.", "start": 248.92, "duration": 4.589}, {"text": "They withstood the growing Ottoman menace", "start": 253.51, "duration": 1.62}, {"text": "and in fact were a gigantic thorn in their side for two centuries.", "start": 255.13, "duration": 2.85}, {"text": "Disrupting trade and constantly shouting insults across the bay like they were the gatekeeper in Monty Python.", "start": 258.08, "duration": 4.96}, {"text": "When Suleiman the Magnificent became Sultan in 1520, his first order of business was booting the Knights from Rhodes.", "start": 263.04, "duration": 4.94}, {"text": "But the Knights weren't out in the wind for long because the king of Spain offered them the island of Malta as a base in 1530.", "start": 268.0, "duration": 5.42}, {"text": "Man, I wish kings invited me to govern strategic islands in the middle of the Mediterranean.", "start": 273.42, "duration": 4.48}, {"text": "That's the best gig ever.", "start": 277.9, "duration": 1.34}, {"text": "So our stories collide as the Knights Hospitaller make landfall on Malta and set about doing their Knightly thing.", "start": 279.24, "duration": 5.0}, {"text": "Well Mdina had been the capital for centuries, the Knights were firmly naval power.", "start": 284.34, "duration": 3.52}, {"text": "So they instead set up shop at Birgu and around the main bay and left the old nobles to elegantly sulk inland.", "start": 287.86, "duration": 5.88}, {"text": "For the next 35 years, the Knights made it their mission to endlessly harassed Ottoman ships in the western Mediterranean.", "start": 293.74, "duration": 4.98}, {"text": "So, effectively piracy. But it's in service to a king, so it's technically privateering.", "start": 299.0, "duration": 5.76}, {"text": "Suleiman presumably furious that these Knights were still giving him hell resolved to wipe Malta off the face of the earth.", "start": 304.92, "duration": 5.6}, {"text": "So he assembled the largest army seen in a millennium and threw it at Malta.", "start": 310.52, "duration": 3.88}, {"text": "In 1565, nearly 50,000 Ottomans laid siege to an island defended by only 5,000 soldiers and a few thousand civilians.", "start": 314.4, "duration": 7.54}, {"text": "This was horrifying to Europe because the Ottomans had been effortlessly conquering the Mediterranean and reached nearly from the Danube to Gibraltar.", "start": 321.94, "duration": 7.0}, {"text": "So the worry was that an Ottoman base in Malta meant that Sicily was next and the domino after would be Rome.", "start": 328.94, "duration": 4.98}, {"text": "So Malta asked Spain for reinforcements and buckled down for the worst.", "start": 334.08, "duration": 3.3}, {"text": "They withstood the full force of the Ottoman army for four months.", "start": 337.389, "duration": 3.611}, {"text": "Losing forts and showering in cannonballs before Spain arrived and forced the Ottomans to retreat.", "start": 341.06, "duration": 4.58}, {"text": "Malta lost a third of its population in the fight, but the Ottomans lost nearly half their army.", "start": 345.98, "duration": 4.76}, {"text": "This miraculous victory against the guys who took Constantinople", "start": 350.88, "duration": 3.339}, {"text": "no less seems to have single-handedly saved all of Christendom.", "start": 354.22, "duration": 3.42}, {"text": "So grateful Europeans lavished Malta in tributes and gifts as thanks.", "start": 357.64, "duration": 3.96}, {"text": "A few years later, the Ottomans were beaten again at the Battle of Lepanto by a much larger European army.", "start": 361.6, "duration": 4.52}, {"text": "But little itty-bitty Malta was the first to save the day in what's now called the Great Siege.", "start": 366.12, "duration": 5.2}, {"text": "With their island safe the Knights began", "start": 371.32, "duration": 1.72}, {"text": "construction on a grand new city in honor of their Grandmaster, Jean Parisot de Valette and Valletta became the capital of Malta.", "start": 373.04, "duration": 6.12}, {"text": "And man, oh man, Valletta is stunning. For one the entire city is built from the local Maltese limestone from the ramparts to the houses to the cathedrals.", "start": 379.16, "duration": 8.719}, {"text": "And since the city was built basically from scratch with ship loads of money in the 1570s.", "start": 387.88, "duration": 4.24}, {"text": "It's got all the trappings of a great Renaissance city and all the good urban planning of a purpose-built one.", "start": 392.12, "duration": 4.96}, {"text": "A century later, a bad earthquake rocked Sicily and destroyed much of the old city of Mdina.", "start": 397.08, "duration": 4.28}, {"text": "So it was rebuilt in spectacular baroque with a church dedicated to St. Paul and one of the coolest city gates ever.", "start": 401.36, "duration": 5.4}, {"text": "With the Great Siege still in everybody's memory, the Knights of Malta fortified the heck out of Valletta.", "start": 406.86, "duration": 4.66}, {"text": "But the Ottomans were terrified of this tiny island like an elephant with a mouse, so they never attacked again.", "start": 411.52, "duration": 4.74}, {"text": "With functionally, no outside threats Malta flourished for two centuries and that's most visible in the ludicrously ornate churches around the island.", "start": 416.26, "duration": 7.16}, {"text": "You know, it's good when they built an even shinier recreation of the Roman pantheon just for funsies.", "start": 423.42, "duration": 5.339}, {"text": "Okay, guys, come on. You can't purpose craft a 3,000 year national history specifically to cater to my interests.", "start": 428.97, "duration": 6.869}, {"text": "That's just irresponsible and speaking of irresponsible the turn of the 19th century brought the Venice crasher himself, our boy Napoleon.", "start": 435.84, "duration": 7.78}, {"text": "In 1798, he conquered Malta largely without a fight because lots of the Knights were ethnically French and thus pretty chill with Napoleon's whole deal.", "start": 443.62, "duration": 7.74}, {"text": "During his short stay, Napoleon laid down reforms on everything from education and government to the abolition of slavery.", "start": 451.36, "duration": 5.3}, {"text": "These were all really good things because the Knights had a notoriously repressive attitude towards other religions.", "start": 456.66, "duration": 5.24}, {"text": "But when France made the mistake of seizing Maltese treasures and looting their churches.", "start": 461.9, "duration": 3.86}, {"text": "The island went up in arms and asked Napoleon's archrival, Britain for relief.", "start": 465.76, "duration": 3.64}, {"text": "After a two-year uprising and a little bit of a blockade, Malta became a protectorate of the British Empire through", "start": 469.4, "duration": 4.56}, {"text": "the 1800s and 1900s. During the first World War, Malta earned the nickname the Nurse of the Mediterranean", "start": 473.96, "duration": 5.02}, {"text": "because they cared for so many wounded British soldiers and I think the OG Hospitallers would have been really proud.", "start": 478.98, "duration": 5.1}, {"text": "But the last major event in Maltese history came at the receiving end of the Roman Empire's idiot grandchildren: fascist Italy and Nazi Germany.", "start": 484.08, "duration": 7.42}, {"text": "The very day after Italy declared war on Britain, the bombs started falling on Malta and the island remain blockaded by sea and under a", "start": 491.5, "duration": 6.4}, {"text": "blitz for two and a half years.", "start": 497.91, "duration": 1.77}, {"text": "It took the monumental effort of Operation Pedestal to resupply the island and force the Axis to give up the siege.", "start": 499.68, "duration": 5.82}, {"text": "Just like they did 400 years earlier,", "start": 505.5, "duration": 1.92}, {"text": "Malta endured and in an ironic reversal of fate from the Ottomans siege. Malta later served as a springboard for the Allied invasion of Sicily", "start": 507.42, "duration": 6.98}, {"text": "and the final capture of Rome. Britain awarded the entirety of Malta with a King George Cross in recognition of their legendary", "start": 514.4, "duration": 5.96}, {"text": "resilience and that honor endures as a crest on the corner of the Maltese national flag", "start": 520.36, "duration": 3.88}, {"text": "which they adopted in 1964 upon gaining independence from Britain. One decade later Malta became a republic and in 2004", "start": 524.25, "duration": 6.15}, {"text": "they joined the EU and if you ask me that is one wild ride of a national history. To me Malta is doubly", "start": 530.4, "duration": 6.52}, {"text": "exceptional. For one, the history is just so vivid and", "start": 536.92, "duration": 2.62}, {"text": "tangible from the cities themselves to the rich artistic tradition and the unique Maltese language. And two, Malta is a perfect", "start": 539.56, "duration": 6.38}, {"text": "microcosm of Mediterranean history. It's got a little bit of everything and everyone from Carthage to Crusaders and a whole lot in between.", "start": 545.94, "duration": 7.14}, {"text": "Okay. I lied. Three things. The Maltese Cross is rad as hell.", "start": 553.56, "duration": 3.4}, {"text": "Four things. The dogs are perfect. It's a very good boy. [They are.]", "start": 557.62, "duration": 3.12}, {"text": "The Maltese knew how to defend a fortress from a siege and if you want to protect your online data with that same vigor.", "start": 561.6, "duration": 5.36}, {"text": "Then you might be interested in today's sponsor, NordVPN. A virtual private network or VPN", "start": 566.96, "duration": 4.74}, {"text": "puts your data into stealth mode and with NordVPN's military-grade encryption and servers in over 60 countries.", "start": 571.7, "duration": 4.96}, {"text": "A few easy clicks can yeet your digital self anywhere in the world.", "start": 576.66, "duration": 3.34}, {"text": "Want to visit Europe. Boom. Enjoy Scottish Twitter in its natural habitat or catch some Italian Netflix.", "start": 580.0, "duration": 4.9}, {"text": "Want to hop over the Great China Firewall go for it. Hell, I had a friend in China", "start": 584.9, "duration": 3.78}, {"text": "earlier this year that I was only able to talk to because they had a VPN and NordVPN is offering you a", "start": 588.68, "duration": 4.58}, {"text": "75% off a three-year plan and a free bonus month if you go to", "start": 593.4, "duration": 3.32}, {"text": "NordVPN.com/overlysarcastic and use code OVERLYSARCASTIC.", "start": 596.72, "duration": 3.8}, {"text": "It's really important to be selective with your VPN because the free ones make their money by selling your data", "start": 600.54, "duration": 4.76}, {"text": "and you really do not want that sketchiness.", "start": 605.3, "duration": 1.5}, {"text": "So trust your laptop and your smartphone to the highest rated VPN around. Again head over to NordVPN.com/overlysarcastic", "start": 606.8, "duration": 6.48}, {"text": "and use code OVERLYSARCASTIC to get 75% off three years of secure internet and one bonus month free.", "start": 613.28, "duration": 5.26}, {"text": "Thanks so much for watching. This history was really surprising to me for multiple reasons.", "start": 618.96, "duration": 4.34}, {"text": "First among them being that I kind of barely even heard of Malta until just a couple years ago.", "start": 623.9, "duration": 4.26}, {"text": "So there was all kinds of new stuff for me in this and I really enjoyed digging into it.", "start": 628.16, "duration": 4.1}, {"text": "I hope you did too.", "start": 632.28, "duration": 1.04}, {"text": "Now I just gotta wait for Rick Steves to do a dedicated episode on Malta, then I think I'm set for life.", "start": 633.32, "duration": 4.66}, {"text": "I'll see you next time.", "start": 637.98, "duration": 1.74}]