[{"text": "This is a rocket-powered Golf Club.", "start": 1.15, "duration": 2.42}, {"text": "Professional golfers have an average swing speed of 110 miles per hour.", "start": 5.89, "duration": 3.65}, {"text": "But using two F sized motors she swings at a hundred and fifty miles per hour, every time. Usually for builds on my channel", "start": 9.54, "duration": 7.769}, {"text": "I just show you guys the final thing and don't really talk about the process of how we got there.", "start": 17.31, "duration": 4.5}, {"text": "But rest assured, today, we will get to see huge drives,", "start": 21.99, "duration": 3.119}, {"text": "WOAH!", "start": 26.58, "duration": 0.7}, {"text": "golf balls shattering glass in super slow-mo,", "start": 27.88, "duration": 2.12}, {"text": "pulverized watermelons,", "start": 30.84, "duration": 2.04}, {"text": "and even a handheld version.", "start": 32.88, "duration": 1.4}, {"text": "But this build, I think, is a great chance to pull back the curtain and demonstrate how the engineering design process actually works.", "start": 35.8, "duration": 6.04}, {"text": "I want to highlight six-", "start": 42.66, "duration": 1.58}, {"text": "\"Learning opportunities\" that led us to this final design and to do that,", "start": 44.24, "duration": 3.58}, {"text": "We need to go back in time four months to when I first had the idea.", "start": 47.82, "duration": 3.66}, {"text": "And as always we started with a simple", "start": 51.48, "duration": 1.48}, {"text": "Prototype to see if the concept even had a remote chance of working.", "start": 52.96, "duration": 3.34}, {"text": "Before we fire it up, you'll notice we have counterweights on the opposite side here.", "start": 56.92, "duration": 3.619}, {"text": "That's so that the center of mass of the spinning part is on top of the axis of rotation. In other words,", "start": 60.699, "duration": 5.54}, {"text": "It balances perfectly at the point at which it spins around.", "start": 66.24, "duration": 3.48}, {"text": "If you don't do that for something that spins it creates a bunch of extra force for your system to deal with. It starts as a small vibration,", "start": 69.72, "duration": 6.68}, {"text": "But then it gets worse and worse as you pick up speed.", "start": 76.4, "duration": 2.64}, {"text": "Since we needed to hit this tiny ball with the head of this club at really high speeds, if we're not perfectly balanced, the club and", "start": 79.2, "duration": 6.9}, {"text": "the whole platform itself will just be shaking all over the place and we'd never hit it. OK, back to the test", "start": 86.3, "duration": 5.46}, {"text": "Those stands are shaking more than they should so we knew we would need to balance the spinning part better for the real test", "start": 93.58, "duration": 5.359}, {"text": "But at least we knew it could go kind of fast and nothing blows up", "start": 98.939, "duration": 3.33}, {"text": "And so then it was time for CAD", "start": 102.27, "duration": 1.349}, {"text": "Which is always the next step and then together with my friends, Ken and Kayla. We started cutting metal and making stuff", "start": 103.619, "duration": 5.79}, {"text": "Things came together well", "start": 123.32, "duration": 1.4}, {"text": "so we epoxied a 3d printed motor mount to the top of the driver and prepped our first real test by taking one of", "start": 124.72, "duration": 5.339}, {"text": "Those easy ups and draping some nets on the side for safety just in case something went catastrophically wrong", "start": 130.06, "duration": 5.279}, {"text": "This was our second learning experience, we didn't have enough contact area for epoxying the head to the driver", "start": 149.25, "duration": 5.149}, {"text": "So it wasn't a strong enough bond", "start": 154.4, "duration": 1.44}, {"text": "this was tricky because it meant we had to 3d scan the club head which allowed us to CAD up and then 3d print a", "start": 155.84, "duration": 6.21}, {"text": "more contoured mount with more contact area for the epoxy", "start": 162.05, "duration": 3.029}, {"text": "We also took this chance to double the rocket holsters because what could possibly go wrong?", "start": 165.08, "duration": 4.019}, {"text": "So we went to test our new dual rocket set up with two e motors and everything went perfectly", "start": 169.11, "duration": 4.97}, {"text": "Except for the part where the head snapped off the driver", "start": 176.19, "duration": 2.299}, {"text": "And when we reviewed the slow-mo footage what we realized was the shaft of the driver is so flexible that it would start to bend", "start": 181.23, "duration": 6.319}, {"text": "And then create really weird thrust vectors for the Rockets which then just bent the shaft even more", "start": 187.549, "duration": 4.5}, {"text": "This is not what you want to see. Eventually it succeeded the stress limit of the shaft and the head just came off", "start": 192.049, "duration": 4.98}, {"text": "So our third learning opportunity was to stiffen up the club shaft", "start": 199.62, "duration": 2.899}, {"text": "So we got some aluminum c-channel and just dumped a butt ton of epoxy in there and this worked remarkably", "start": 202.519, "duration": 4.529}, {"text": "Well, you can see the difference here. And so with that we headed out to a very remote shooting location in beautiful, Northern, California", "start": 207.049, "duration": 6.809}, {"text": "So we finally arrived and started to set up but first I have something I wanted to get off my chest", "start": 217.92, "duration": 4.309}, {"text": "so one of the things I like most about me is that I will I", "start": 222.739, "duration": 4.589}, {"text": "Like to reach out to lesser known channels and sort of give them a hand out at some exposure on my channel", "start": 227.97, "duration": 6.529}, {"text": "Which is why today I'm here with Destin", "start": 234.5, "duration": 2.91}, {"text": "And Smarter Every Day and if by some miracle you don't know Destin is on the Mount Rushmore", "start": 237.569, "duration": 4.49}, {"text": "Of science youtubers we've been friends for almost exactly six years", "start": 242.19, "duration": 3.739}, {"text": "and I know this because I took a screenshot of the huge moment for me when he subscribed to my channel when I only had", "start": 245.93, "duration": 4.5}, {"text": "10,000 subs he's made videos about the physics of cats landing on their feet, tattoos in super slow-mo or the first video", "start": 250.59, "duration": 6.47}, {"text": "I saw of him about how chickens have an internal open feedback loop which allows them to head track if you've never seen his stuff", "start": 257.06, "duration": 6.089}, {"text": "I'm actually jealous because you have so many hours of high-quality viewing in your near future", "start": 263.15, "duration": 4.98}, {"text": "So I like golf. I like Rockets", "start": 268.35, "duration": 2.899}, {"text": "Should we do this? Yeah, let's just... That that was the intro right? That was it. Whatever", "start": 272.76, "duration": 3.559}, {"text": "so we all continued to set up and something that was important to me was for this to look as natural as possible at a", "start": 276.95, "duration": 5.399}, {"text": "driving range so we added some turf to cover the base plate and then", "start": 282.35, "duration": 3.48}, {"text": "Dissected a golf bag to cover the sturdy steel column and then if you add some clubs it looks pretty awesome", "start": 285.96, "duration": 4.849}, {"text": "It's incredibly rigid and yet it can still swing freely", "start": 290.91, "duration": 3.02}, {"text": "Our fourth learning experience came from reviewing our final test footage if you listen, the club goes faster and faster with each rotation", "start": 293.93, "duration": 6.899}, {"text": "Naturally we want the club to contact the ball when it's going the fastest which in our case is ten rotations in one second that", "start": 304.77, "duration": 7.429}, {"text": "Means we somehow need to sneak the ball into the path of the driver in less than a tenth of a second or a quarter", "start": 312.2, "duration": 5.1}, {"text": "Of an eyeblink to accomplish this we have a pneumatic cylinder here that hinges up the tee", "start": 317.3, "duration": 4.079}, {"text": "It knows when to fire because on the back of the shaft", "start": 321.38, "duration": 2.339}, {"text": "There's a light sensor and this disc has a slit which allows the light to pass through once per rotation", "start": 323.72, "duration": 5.399}, {"text": "So we send that info to an Arduino over here that counts for us and then after 15", "start": 329.37, "duration": 4.19}, {"text": "rotations", "start": 333.75, "duration": 0.5}, {"text": "it tells the cylinder the precise moment to fire using a solenoid and", "start": 334.25, "duration": 4.29}, {"text": "then we superglue the ball to the tee because it provides the", "start": 338.79, "duration": 2.54}, {"text": "Goldilocks amount of force to first secure and then release the ball plus the superglue looks super dope in slow-mo", "start": 341.43, "duration": 5.989}, {"text": "So now with everything in place we started with two e motors which is a", "start": 351.3, "duration": 3.139}, {"text": "Reminder is the same setup that ripped the club head off three two, one roll", "start": 354.51, "duration": 5.299}, {"text": "Where'd it go? What happened?", "start": 375.82, "duration": 0.5}, {"text": "YEAH, BABY!!", "start": 376.32, "duration": 0.76}, {"text": "No way", "start": 383.75, "duration": 4.17}, {"text": "that's a cool shot right there. it is", "start": 387.92, "duration": 0.889}, {"text": "Dude this is uh, this is respectable", "start": 405.569, "duration": 2.63}, {"text": "This is legit after reviewing more of the high-speed footage. We noticed something interesting", "start": 409.5, "duration": 5.48}, {"text": "The sound effect there is like \"doy yoy yoy\"", "start": 416.86, "duration": 3.24}, {"text": "This was an interesting technical observation from Destin and that tee flexibility was causing us to hit some bad shots like this", "start": 421.46, "duration": 6.3}, {"text": "The obvious fix is just to make the tee more rigid so that it doesn't over rotate when it pops up", "start": 428.759, "duration": 5.33}, {"text": "But there's a problem with this", "start": 434.129, "duration": 1.79}, {"text": "There's a saying that force follows stiffness and for us a really stiff tee would transfer a bunch of force and destroy our nice 3d", "start": 435.919, "duration": 6.869}, {"text": "printed pop-up mechanism", "start": 442.789, "duration": 1.141}, {"text": "Now imagine this crumpled up piece of paper is the tee which is obviously way less stiff", "start": 443.93, "duration": 4.47}, {"text": "Our flexible rubber tee was great because it acted like this piece of paper no matter how hard you hit it", "start": 448.4, "duration": 4.679}, {"text": "The force doesn't get translated down and damage our hardware", "start": 453.08, "duration": 2.82}, {"text": "So Ken had the brilliant idea of just tying a string to the tee and staking it into the ground", "start": 455.9, "duration": 5.009}, {"text": "This stopped the over-rotation but everything was still just as flexible when the string pulls tight", "start": 460.909, "duration": 5.58}, {"text": "does it make the ball fly off because it's it doesn't doink enough? Uh, the only way to test is the doink test", "start": 466.49, "duration": 4.979}, {"text": "Ah, beautiful there was some doinkage", "start": 474.15, "duration": 1.609}, {"text": "I just thought this was a really simple clever idea that solved both problems at once and as you can see it worked perfectly", "start": 475.759, "duration": 6.69}, {"text": "Now we are ready to try a dual F motor", "start": 491.46, "duration": 2.69}, {"text": "So these deliver about twice as much force to the club as the e motors that made the head snap off and this", "start": 494.42, "duration": 5.73}, {"text": "Provided our final and certainly most poignant learning opportunity. 3 2 1 go", "start": 500.31, "duration": 4.729}, {"text": "Where's the club", "start": 510.69, "duration": 2.0}, {"text": "It's, it's, is the tree on fire?  Wow, like I'm laughing, but that could have been bad", "start": 549.13, "duration": 6.889}, {"text": "There we go, this thing was like sub-orbital dude. So we have three u-bolts and we only used two", "start": 564.13, "duration": 5.809}, {"text": "Yeah", "start": 570.04, "duration": 0.5}, {"text": "So I think we'll just max out those and just crank them way down now that we know this is a failure point", "start": 570.54, "duration": 4.77}, {"text": "Now that we know this is a failure point", "start": 575.769, "duration": 2.0}, {"text": "There's several failure points and I hear you say, oh we have a solution for that", "start": 578.29, "duration": 4.039}, {"text": "This is the engineering design process!!", "start": 582.329, "duration": 2.0}, {"text": "Rather fun. Like I mentioned the club that failed was cut too short and was only attached using two u-bolts", "start": 585.91, "duration": 4.82}, {"text": "Which we thought would have been enough to support the 800 pound load from centrifugal force", "start": 590.73, "duration": 3.839}, {"text": "We did notice the rubber handle was worn due to so many test fires which probably initiated the stress concentration leading to the failure", "start": 594.569, "duration": 6.81}, {"text": "So our fix was to cut the next Club longer so we could use three", "start": 601.38, "duration": 3.599}, {"text": "u-bolts and really crank them down on a fresh rubber handle and so with all six of our learnings now in place we tried the", "start": 605.11, "duration": 7.01}, {"text": "Insane double F motors one more time", "start": 612.12, "duration": 2.46}, {"text": "WOAH!!", "start": 626.88, "duration": 1.06}, {"text": "YEAH, BABY!! GO!!", "start": 628.68, "duration": 3.44}, {"text": "THAT's how you play golf!", "start": 634.5, "duration": 1.46}, {"text": "That's our best one yet!", "start": 636.66, "duration": 1.3}, {"text": "Dude.", "start": 638.84, "duration": 0.5}, {"text": "Like the rush you get from like an engineering achievement actually working in like.", "start": 639.34, "duration": 5.02}, {"text": "Seriously dude.", "start": 644.76, "duration": 0.68}, {"text": "Oh look at the flame. OH yeah!", "start": 647.8, "duration": 3.58}, {"text": "So we never found these long balls to measure the exact distance", "start": 665.68, "duration": 3.44}, {"text": "But I can drive a ball 280 yards and these were well beyond that. I mean just look at this trajectory", "start": 669.12, "duration": 5.64}, {"text": "straight to outer space", "start": 675.43, "duration": 1.74}, {"text": "Now that we've got all the shots we needed it was time to have some real fun", "start": 677.17, "duration": 3.29}, {"text": "We started with a handheld version that was powered by a single C motor because anything more than that would just be way too unsafe", "start": 680.52, "duration": 6.029}, {"text": "For me to hold", "start": 686.549, "duration": 1.951}, {"text": "Ni-ice! [unintelligible] over 300 yards man!", "start": 706.12, "duration": 3.92}, {"text": "It really did", "start": 710.64, "duration": 0.64}, {"text": "Like make it so much easier to swing I'm not even kidding. Yeah. Yeah", "start": 711.28, "duration": 4.4}, {"text": "yeah, like it really meant different 3 2 and then some glass just because", "start": 715.68, "duration": 5.88}, {"text": "YEAHH!", "start": 731.92, "duration": 1.36}, {"text": "And then keeping with the tradition of my channel some watermelon", "start": 751.62, "duration": 3.06}, {"text": "Thanks for cutting open a watermelon with a rocket-powered golf club Mark. You're welcome", "start": 792.38, "duration": 3.349}, {"text": "Yeah, that's all of this the past three months of work in engineering was just for this", "start": 795.91, "duration": 4.679}, {"text": "Boils down to this moment just to enjoy this watermelon. Yeah, Mark's like trying to make stuff look good", "start": 800.589, "duration": 4.77}, {"text": "We're not wasting food though", "start": 805.73, "duration": 1.25}, {"text": "we waste no part of the engineering effort like the great Indians with the Buffalo so Destin made a video on his channel about why some", "start": 806.98, "duration": 6.66}, {"text": "balls bounce high and others", "start": 813.64, "duration": 2.0}, {"text": "Don't and my first thought was well that's easy just has to do with how compressible or rubbery it is", "start": 816.38, "duration": 4.849}, {"text": "Yet this billiard ball is pretty much completely", "start": 821.23, "duration": 2.28}, {"text": "Solid and this bouncy ball is pretty rubbery and yet they bounce to pretty much the same height", "start": 823.61, "duration": 5.27}, {"text": "So it's something else. As you can imagine this is a pretty important piece of information for golf ball makers", "start": 828.88, "duration": 5.159}, {"text": "so there's lots of amazing slow-mo footage of golf balls being", "start": 834.04, "duration": 2.85}, {"text": "Squished in ways that hurt your brain plus way more footage from today's shoot", "start": 837.019, "duration": 4.4}, {"text": "So I will leave a link in the video description", "start": 841.42, "duration": 1.57}, {"text": "And while you're there make sure to check out some of his other videos and subscribe to his channel because he's just a classy individual", "start": 842.99, "duration": 5.45}, {"text": "And a true professional in every sense of the word. Are you rolling? Yeah", "start": 848.44, "duration": 3.929}, {"text": "Hi, it's me mark", "start": 854.57, "duration": 2.0}, {"text": "[awesome montage]", "start": 858.273, "duration": 11.06}]