[{"text": "Light bulbs used to be simple: just run a bunch of electrical current through a thin wire", "start": 1.069, "duration": 3.931}, {"text": "until it heats up enough to start glowing.", "start": 5.0, "duration": 2.28}, {"text": "Bare filament electric lamps were first demonstrated around 1800 by Humphry Davy,", "start": 7.28, "duration": 4.34}, {"text": "and the glass bulb was added later to keep oxygen away from the wire", "start": 11.62, "duration": 2.82}, {"text": "so it could glow for a long time without actually burning up.", "start": 14.45, "duration": 3.54}, {"text": "So the incandescent light bulb is 19th-century technology,", "start": 17.99, "duration": 3.43}, {"text": "and by now there's now a blinding array of electric lamps:", "start": 21.42, "duration": 2.6}, {"text": "halogen light bulbs, fluorescents, mercury and sodium vapor lamps, LEDs, lasers and so on.", "start": 24.02, "duration": 4.42}, {"text": "Each one makes its own clever use of physics to achieve the life goal of a light bulb:", "start": 28.44, "duration": 3.98}, {"text": "converting electrical current into visible light.", "start": 32.42, "duration": 2.64}, {"text": "Here's how they work.", "start": 35.06, "duration": 1.18}, {"text": "Halogen bulbs have the same tungsten metal filament as typical incandescent light bulbs,", "start": 37.28, "duration": 4.58}, {"text": "but they contain a little bit of a halogen-based gas in the bulb as well.", "start": 41.86, "duration": 3.66}, {"text": "The chemistry of the halogen gas allows it to capture stray tungsten atoms that evaporate off the filament", "start": 45.52, "duration": 5.1}, {"text": "and shepherd them back to where they belong,", "start": 50.629, "duration": 2.151}, {"text": "which both prolongs the life of the filament as well as keeps the inside of the bulb clean and clear.", "start": 52.78, "duration": 5.04}, {"text": "Fluorescent bulbs are basically gas-filled tubes with electrodes at both ends.", "start": 59.08, "duration": 4.16}, {"text": "Electrical current flows from one electrode to the other,", "start": 63.24, "duration": 2.42}, {"text": "and when the electrons that make up the current bump into mercury atoms in the gas,", "start": 65.66, "duration": 3.78}, {"text": "the energy of the collision makes the atoms get \"excited\"—that's the technical term", "start": 69.44, "duration": 3.86}, {"text": "—and the atoms then emit visible and ultraviolet light.", "start": 73.3, "duration": 2.78}, {"text": "The white coating on the inside of the glass absorbs the ultraviolet light and re-emits it as more visible light", "start": 76.08, "duration": 5.22}, {"text": "—this process is called \"fluorescence\" and is the namesake of the bulbs.", "start": 81.3, "duration": 3.78}, {"text": "Because the coating stops the UV light, it also keeps the bulbs from giving you cancer...", "start": 85.08, "duration": 4.32}, {"text": "unless that's what you want, in which case you can use a tanning bulb with a different kind of coating.", "start": 89.4, "duration": 4.32}, {"text": "Sodium, mercury, and metal-halide vapor lamps, which are commonly used for lighting streets,", "start": 94.86, "duration": 4.2}, {"text": "warehouses, gymnasiums, and other large areas, are also tubes that run electrical current through a gas.", "start": 99.06, "duration": 5.28}, {"text": "The gas itself emits mainly visible light so these bulbs don't need a fluorescent coating.", "start": 104.34, "duration": 5.18}, {"text": "Finally, LEDs are also like fluorescent light bulbs,", "start": 110.9, "duration": 3.1}, {"text": "except replace the gas with a tiny crystal of semiconducting gallium, and throw away the bulb", "start": 114.0, "duration": 4.3}, {"text": "—so not like fluorescent bulbs.", "start": 118.64, "duration": 2.18}, {"text": "But seriously, the semiconductor has two layers, one of which provides excited electrons with lots of energy,", "start": 120.82, "duration": 4.86}, {"text": "while the other provides a place for the electrons to go and relax", "start": 125.68, "duration": 3.2}, {"text": "—and that *is* the technical term.", "start": 128.88, "duration": 1.68}, {"text": "All you need is an electrical current to transport electrons from the party side to the spa side", "start": 130.56, "duration": 4.4}, {"text": "where they release the energy of their excitement as light.", "start": 134.96, "duration": 2.4}, {"text": "Voilá - a light-emitting diode, perfect for human parties!", "start": 137.58, "duration": 5.4}]