[{"text": "A week ago, also, the maths internet lost its mind over this", "start": 8.29, "duration": 4.729}, {"text": "log troll, I guess.", "start": 13.929, "duration": 2.391}, {"text": "And the reason people got so excited about it is because even though this is technically correct,", "start": 16.32, "duration": 5.54}, {"text": "the log of 6 does equal the log of 1 plus the log of 2 plus the log of 3,", "start": 21.86, "duration": 5.84}, {"text": "this doesn't work in general. It looks like you can generalize it,", "start": 27.7, "duration": 2.8}, {"text": "but if these were A B and C, instead of 1 2 3, it simply would not hold.", "start": 30.5, "duration": 5.78}, {"text": "Although, it's very close to a real log law!", "start": 36.28, "duration": 3.58}, {"text": "Instead of adding at the top there, that should be...", "start": 39.86, "duration": 2.68}, {"text": "multiplying!", "start": 42.96, "duration": 1.599}, {"text": "This works in general; The previous one does not.", "start": 44.559, "duration": 4.181}, {"text": "So how did somebody go from this *legitimate* log equation to the fake one?", "start": 48.74, "duration": 5.709}, {"text": "Well, it's just using the fact that 1 times 2 times 3 happens to equal 1 plus 2 plus 3.", "start": 54.449, "duration": 6.871}, {"text": "Because of that particular fact, you're able to make the fake log law. And that's why people got so emotional.", "start": 61.32, "duration": 6.94}, {"text": "What I found extra interesting is wherever this meme was discussed, someone mentioned perfect numbers!", "start": 68.26, "duration": 5.92}, {"text": "Perfect numbers kept coming up, even though they don't explain why it works.", "start": 74.18, "duration": 5.44}, {"text": "Although, they're close. So 6 is a perfect number, which means if you take all of its proper factors—", "start": 79.62, "duration": 6.48}, {"text": "numbers that divide into it which are not the number itself—", "start": 86.1, "duration": 2.8}, {"text": "if you add 1 + 2 + 3 it equals 6, if you multiply 1 times 2 times 3 it equals 6.", "start": 88.9, "duration": 5.62}, {"text": "But for any other perfect number, let's say 28.", "start": 94.52, "duration": 3.08}, {"text": "Yeah, sure, if you add all the proper factors of 28 they give you 28,", "start": 97.6, "duration": 4.98}, {"text": "But if you multiply all the factors you don't get 28. You'd have to multiply just 2 times 14, or maybe 4 times 7.", "start": 102.58, "duration": 8.36}, {"text": "All of them, though, doesn't work. So 6 only works in the log troll because if you multiply all of its factors you get itself.", "start": 110.94, "duration": 9.14}, {"text": "So being a perfect number doesn't mean that the number will work in the log troll,", "start": 120.08, "duration": 5.24}, {"text": "and some numbers will work in the log troll that aren't perfect numbers.", "start": 125.32, "duration": 4.14}, {"text": "So this is a total distraction.", "start": 129.46, "duration": 2.14}, {"text": "What we're actually looking for are sets of numbers such that if you add all of the numbers together—", "start": 131.6, "duration": 5.42}, {"text": "So Sigma for summing across X 1 X 2 up to some X, and that's just some set of numbers I'm calling X's—", "start": 137.02, "duration": 7.84}, {"text": "then you get the same answer as when you multiply them all together. That's a capital Pi,", "start": 144.86, "duration": 4.82}, {"text": "so same as a capital Sigma means to sum all the numbers, capital PI means that you find the product. You multiply all the numbers.", "start": 149.68, "duration": 6.7}, {"text": "So, if the sum of a set of numbers equals the product of that set of numbers, then you can get a log troll.", "start": 156.38, "duration": 7.52}, {"text": "And solutions to this are easy to find, if you don't care about having whole numbers.", "start": 163.9, "duration": 6.3}, {"text": "So my favorite that I found after a quick search was 101 and 1.01", "start": 170.2, "duration": 6.58}, {"text": "So, because 101 times 1.01 gives you the same answer as 101 plus 1.01, this holds! What a... Yeah.", "start": 176.78, "duration": 9.88}, {"text": "LOL", "start": 186.66, "duration": 1.38}, {"text": "Whole number solutions are much harder to find, though.", "start": 188.04, "duration": 3.46}, {"text": "In fact, I would argue there is only one valid whole number solution to the log troll problem and it's 4,", "start": 191.5, "duration": 8.82}, {"text": "because 2 plus 2 equals 4 and 2 times 2 equals 4. And so this—", "start": 200.32, "duration": 6.62}, {"text": "Even though this shouldn't work by all known log laws—", "start": 206.94, "duration": 4.72}, {"text": "It does work because you can replace the two plus two or 2 times 2 and then the whole thing would work, in terms of logs.", "start": 211.66, "duration": 6.6}, {"text": "I reckon I can pseudo prove via a bit of hand waving that this is the only non-trivial solution to the log troll problem", "start": 218.26, "duration": 8.499}, {"text": "So, to start with, I have plotted, for all the numbers—", "start": 226.76, "duration": 3.28}, {"text": "starting down at 1 over the end of the origin up to a thousand over here—", "start": 230.04, "duration": 3.66}, {"text": "the maximum value you can get when you multiply together a... factor decomposition of the number.", "start": 233.7, "duration": 7.76}, {"text": "So you find out which set of factors, which multiply to give the original number, happen to sum to the maximum possible value,", "start": 241.46, "duration": 6.86}, {"text": "and the numbers, they're not very big. They're nowhere near the original numbers.", "start": 248.32, "duration": 4.2}, {"text": "So if you've got something like, I don't know, like, I think it was like, 400, like over there?", "start": 252.53, "duration": 3.54}, {"text": "There's 400, and you can see- Well, for an even number, the biggest factor it can have is half of it, and then the other factor is 2, so 400 goes up to 202.", "start": 256.07, "duration": 12.97}, {"text": "In fact that top line you can see going down, that's the line of half the number plus 2.", "start": 269.04, "duration": 5.38}, {"text": "For the numbers which aren't even, but do have a factor of 3, the next line down. That's a third of the number, plus 3", "start": 274.42, "duration": 7.9}, {"text": "And then you've got, you know, a fifth of the number plus 5, and each of these lines is a different prime factor.", "start": 282.32, "duration": 6.34}, {"text": "And for a number it falls on its biggest prime factors line. So this only works for composite numbers,", "start": 288.66, "duration": 8.6}, {"text": "If it's a prime number, you're gonna end up one bigger than the original number.", "start": 297.26, "duration": 4.82}, {"text": "But for all other composite numbers you will end up with something... smaller.", "start": 302.08, "duration": 4.36}, {"text": "And it doesn't matter if you try and have more factors because then you're just splitting the two you start with into smaller ones,", "start": 306.44, "duration": 6.06}, {"text": "and, if every time you split it into two factors you get a smaller result, you're just gonna get smaller and smaller and smaller.", "start": 312.5, "duration": 5.14}, {"text": "So two factors is your best case, and these are the maximum values you're gonna get.", "start": 317.64, "duration": 3.9}, {"text": "None of them are near the original number except for t̶w̶o̶  [FOUR!], which is on the top line,", "start": 321.54, "duration": 5.52}, {"text": "and half of t̶w̶o̶  [FOUR!] is two! and so Down near the origin somewhere— you can't see it on this scale— t̶w̶o̶  [FOUR!] is on that line.", "start": 327.06, "duration": 7.48}, {"text": "The rest of them will never give you a whole numbered solution to the log troll problem.", "start": 334.54, "duration": 5.1}, {"text": "Thank you for following along. I think I got there, hand waving!", "start": 339.64, "duration": 3.38}, {"text": "\"Wait a minute,\" you say! If I'm arguing that this is the only non-trivial solution to the log troll problem,", "start": 343.02, "duration": 6.96}, {"text": "then what's up with the *original* solution to the log troll problem?", "start": 349.98, "duration": 4.94}, {"text": "This one I found particularly amazing when it came out and people were discussing it online. People were talking about perfect numbers,", "start": 354.92, "duration": 6.82}, {"text": "a semi obscure part of recreational mathematics, and not something particularly relevant to the conversation!", "start": 361.74, "duration": 6.88}, {"text": "And no one was saying, \"Hang on! Why have you got the log of one? That equals zero!\"", "start": 368.62, "duration": 9.88}, {"text": "You're just- You're adding zero to that half. That's ju-!", "start": 378.5, "duration": 3.92}, {"text": "I mean, adding zero changes nothing, when you're doing addition,", "start": 382.42, "duration": 4.54}, {"text": "just like multiplying by one changes nothing, when you're doing multiplication", "start": 386.96, "duration": 5.54}, {"text": "And, well, actually that kind of makes sense because in a crude, hand-wavy sense logs take multiplying and turn it into addition.", "start": 392.5, "duration": 8.1}, {"text": "So it takes the identity from multiplying, one, which changes nothing, to the identity for addition, o̶n̶e̶  [ZERO!], which changes nothing when you're adding.", "start": 400.6, "duration": 8.48}, {"text": "And so, actually, if you want to, you can add as many log ones as you want, and it won't change it whatsoever.", "start": 409.08, "duration": 8.72}, {"text": "They're- they're pointless. They're trivial! They're just- They aren't doing anything.", "start": 417.8, "duration": 5.36}, {"text": "And we can use this to create a log troll for any composite number. For example, 10.", "start": 423.16, "duration": 8.04}, {"text": "The first step is to take your composite number of choosing and turn it into some factors.", "start": 431.2, "duration": 4.45}, {"text": "I've picked 2 and 5. We can now make a perfectly valid log statement about these factors.", "start": 435.65, "duration": 6.05}, {"text": "The log of the factors equals the sum of the individual logs of the factors and that's true, that's valid...", "start": 441.7, "duration": 7.22}, {"text": "But it's not gonna troll anyone, now, is it?", "start": 448.92, "duration": 2.48}, {"text": "Our issue is that 2 and 5, while they multiply to give ten, they don't *add* to give ten.", "start": 451.4, "duration": 6.2}, {"text": "So what we do, make a bit more space over there, and because multiplying by 1 doesn't change anything,", "start": 457.6, "duration": 4.56}, {"text": "we can chuck as many ones as we need in there. Three more ones!", "start": 462.16, "duration": 3.48}, {"text": "And then down on the bottom, I'm gonna add three more zeroes, or \"log ones,\" as they're called.", "start": 465.64, "duration": 5.72}, {"text": "So, both sides here still equal each other; they're both still equal to the same thing.", "start": 471.36, "duration": 5.62}, {"text": "But because the set of numbers in the top log-", "start": 476.98, "duration": 3.82}, {"text": "Because if you multiply them all together you get the same answers if you add them all together,", "start": 480.8, "duration": 4.84}, {"text": "we can take those cheeky multiplication signs, give them a little twist, and now we're adding them!", "start": 485.64, "duration": 6.02}, {"text": "This is a log troll!", "start": 491.66, "duration": 1.32}, {"text": "WHa - WWHAaaat (accompanied by air horn noises)", "start": 492.98, "duration": 2.06}, {"text": "We've had some fun today. We've learned about logs, we've learned about maths memes.", "start": 495.04, "duration": 4.56}, {"text": "But can we be serious, for a moment, and take what we've learned, and use it to spice up the original log troll?", "start": 499.6, "duration": 6.9}, {"text": "I think we can! So this one uses sequential numbers starting at 1, 1 2 3. That's good. Catches the eye.", "start": 506.5, "duration": 6.16}, {"text": "But it's not- It's not top-shelf memeing. We can do better. A good maths meme should use the golden ratio.", "start": 512.66, "duration": 6.54}, {"text": "So I'm now going to take the logs of all of the digits of one point six one eight—", "start": 519.2, "duration": 5.54}, {"text": "the golden ratio, as far as most people are concerned—", "start": 524.74, "duration": 3.14}, {"text": "and then show that is equal to the log of", "start": 527.88, "duration": 2.52}, {"text": "a triangle of three golden ratios put together!", "start": 530.4, "duration": 3.87}, {"text": "Try and prove me wrong! You know what? we better slap \"The Power of the Golden Ratio\" there.", "start": 534.27, "duration": 4.91}, {"text": "Use some rainbow text. I reckon we need a Golden Spiral.", "start": 539.9, "duration": 3.46}, {"text": "Maybe a sunflower! Now! Now we're memeing!", "start": 543.36, "duration": 3.26}, {"text": "You know what? I reckon if we crank up the JPEG-ing artifacts, maybe slap on a few \"Emotional Indicators.\"", "start": 546.62, "duration": 8.64}, {"text": "And we're done! That - is a log troll.", "start": 555.26, "duration": 3.14}, {"text": "[Airhorn]", "start": 558.4, "duration": 1.76}, {"text": "Finally, I wanted to mention that this \"super serious\" educational maths video is brought to you by the fine people at Jane Street.", "start": 560.16, "duration": 9.2}, {"text": "Jane Street are actually the new principal sponsor of my entire channel,", "start": 569.36, "duration": 4.06}, {"text": "And they are perfect, because they don't want you to do anything. They don't want you to buy anything, sign up to anything,", "start": 573.42, "duration": 6.62}, {"text": "They just like maths! And they use maths to solve complex problems in the financial world. And so they wanted to support the channel.", "start": 580.04, "duration": 7.68}, {"text": "So there you are. Jane Street! They are great, and you can totally ignore them.", "start": 587.72, "duration": 6.02}, {"text": "Unless, I guess, you're a mathematician looking for a job.", "start": 593.74, "duration": 4.0}]