[{"text": "I'm on vacation out here in Niagara On The Lake, Ontario", "start": 0.06, "duration": 2.31}, {"text": "And I find it difficult to just walk around without being stopped by", "start": 3.25, "duration": 3.799}, {"text": "shapes everywhere just begging to be analyzed! And I feel this great urge to stop and", "start": 7.899, "duration": 5.6}, {"text": "deconstruct all those shapes and make them into studies and paintings and ...", "start": 13.66, "duration": 3.35}, {"text": "It's a problem. So! Shapes in a painting are kind of like the pieces of a jigsaw puzzle.", "start": 57.21, "duration": 4.969}, {"text": "But to make that a better analogy we need to tweak a few things.", "start": 62.399, "duration": 2.869}, {"text": "So we'll represent a painting here on the right. First, each piece or shape in a painting contains just a single value.", "start": 65.64, "duration": 7.129}, {"text": "Second, the pieces should be non-uniform.", "start": 73.11, "duration": 2.0}, {"text": "Third, there should be lots of variety from big shapes to small. And lastly, the shapes can fit together a lot more organically or", "start": 76.02, "duration": 7.37}, {"text": "unpredictably than the uniform nature of a jigsaw puzzle.", "start": 84.06, "duration": 2.75}, {"text": "Those are the simple principles I think about when I'm studying shapes and I want to show you the process of one of these studies", "start": 87.32, "duration": 5.79}, {"text": "as I paint the beautiful Riverbend Inn, where my wife and I stayed. I'll do the study in watercolor.", "start": 93.11, "duration": 5.22}, {"text": "And here's a quick glance at how I set up my travel paint box. It's lightweight compact and tripod-free. Now,", "start": 98.33, "duration": 6.839}, {"text": "I'm gonna do this study without a preliminary line drawing. That will force me to really think about shape. And I'll apply the", "start": 105.17, "duration": 6.72}, {"text": "Jigsaw puzzle analogy to this painting ... but first: a quick word from my sponsor!", "start": 111.99, "duration": 4.01}, {"text": "This video is sponsored by Wix. with Wix you can build your own professional website.", "start": 117.509, "duration": 4.85}, {"text": "You know, just like a painting, I think your website should be simple", "start": 122.94, "duration": 3.529}, {"text": "Understandable and most importantly, appealing to your viewers. And if, like me,", "start": 126.989, "duration": 4.43}, {"text": "you're not a professional web designer,", "start": 131.42, "duration": 1.81}, {"text": "Wix's editor is there to help. You can choose from literally hundreds of pre-built sites and modify them with very", "start": 133.23, "duration": 6.199}, {"text": "Intuitive easy-to-use tools and make a website", "start": 139.53, "duration": 2.479}, {"text": "that's uniquely yours. Wix does all the heavy lifting: like reliable domains,", "start": 142.01, "duration": 4.169}, {"text": "custom mailboxes, free hosting options, or professional plans. You can even use wix's video editor to create", "start": 146.55, "duration": 6.559}, {"text": "social media video marketing campaigns. This is all customizable using Wix is signature editing tools", "start": 153.209, "duration": 6.02}, {"text": "I've been with Wix for about five years now and it's easily been one of the best business and creative decisions I've ever made", "start": 159.45, "duration": 6.41}, {"text": "So check it out. You can get started for free at wix.com/go/marcobucci", "start": 165.959, "duration": 3.05}, {"text": "and let Wix help you with your website, so you have time to stay focused on your art.", "start": 169.62, "duration": 6.589}, {"text": "All right, so here's another look at our picturesque subject.", "start": 179.15, "duration": 3.169}, {"text": "And the first thing I want to tell you is my overall strategy when it comes to paintings like this. In the early going", "start": 182.32, "duration": 6.239}, {"text": "I'm mostly concerned with setting the stage with big shapes. And one feature about big shapes is, well,", "start": 188.59, "duration": 6.3}, {"text": "they're big - so you can only fit a few of them on the page.", "start": 194.89, "duration": 2.94}, {"text": "That makes them useful for blocking out an overall composition. In this case", "start": 198.23, "duration": 4.279}, {"text": "it's like, how much of the Riverbend Inn do I want to include here?", "start": 202.51, "duration": 3.029}, {"text": "Now, quick tangent: see those different colors that are coming in?", "start": 205.79, "duration": 3.079}, {"text": "I'm making sure that they still gel with the overall rooftop shape. In watercolor", "start": 208.87, "duration": 4.92}, {"text": "it helps to do that kind of thing while the wash is still wet.", "start": 213.79, "duration": 2.699}, {"text": "So even though I use a lot of color it's still a shape consideration first!", "start": 216.49, "duration": 4.229}, {"text": "Now, my painting is not very readable yet, but that's by design.", "start": 221.09, "duration": 3.47}, {"text": "I'm playing a bit of a long game here.", "start": 224.56, "duration": 2.0}, {"text": "What I want to do with these shapes is not only use them to represent their physical counterparts in the actual scene,", "start": 226.79, "duration": 5.869}, {"text": "I need them to serve a ... let's call it a more 'artistic purpose' as well.", "start": 232.66, "duration": 3.779}, {"text": "And that is: the shape should also contribute to an abstract design of the picture.", "start": 236.44, "duration": 4.919}, {"text": "I'll break down further what I mean by that in just a moment, but for now, hang on to that thought!", "start": 241.36, "duration": 5.039}, {"text": "Here, I'm being careful to measure the negative shapes between each column. Of course with watercolor you cannot paint white;", "start": 251.27, "duration": 6.289}, {"text": "you have to have the foresight to leave those areas untouched. That makes watercolor", "start": 257.72, "duration": 4.459}, {"text": "unforgiving, and sometimes frustrating. But it also makes it a good medium for improving your skills with shape.", "start": 262.46, "duration": 5.75}, {"text": "All right, let's get back to that thought about shapes contributing to an abstract design. We'll pause this painting and go on a little side trip.", "start": 268.91, "duration": 7.16}, {"text": "All right, so we have a shape,", "start": 277.13, "duration": 1.46}, {"text": "let's say these columns, that we want to reveal in our painting. There are many ways to do this.", "start": 278.59, "duration": 5.04}, {"text": "We could simply draw a line around them and then fill in the right value.", "start": 283.79, "duration": 3.919}, {"text": "Alternatively", "start": 288.14, "duration": 0.5}, {"text": "we could put a single high-contrast shape behind the columns. And while both of those methods are totally functional,", "start": 288.64, "duration": 6.0}, {"text": "I usually search for something a little different.", "start": 294.64, "duration": 2.429}, {"text": "I like to think back to the jigsaw puzzle thing and make a meal of this stuff by playing with varieties of big medium small", "start": 297.07, "duration": 6.149}, {"text": "shapes, various contrasts and uneven treatments of lost and found. I'll apply this to something as simple as a line.", "start": 303.32, "duration": 7.309}, {"text": "In a painterly painting, lines can sometimes not jive all that well because too many lines are basically", "start": 311.11, "duration": 6.39}, {"text": "shapes that don't have much variety.", "start": 317.72, "duration": 2.0}, {"text": "So whenever I need something like a line,", "start": 319.909, "duration": 2.33}, {"text": "I'll usually opt for something that has the effect of a line, but also has that intrinsic distribution of variety.", "start": 322.24, "duration": 6.51}, {"text": "So let's replay this part of the painting and you can see what I'm thinking here. These shapes", "start": 328.75, "duration": 4.889}, {"text": "are me trying to break up the uniformity of the bigger shapes, while still serving the subject.", "start": 333.639, "duration": 5.07}, {"text": "That's a pretty tall order though! And I don't think I've ever made a sketch where I like all my decisions!", "start": 338.93, "duration": 5.179}, {"text": "But it's not really about that. I don't sketch to put things in a frame. I sketch to hone my instincts.", "start": 344.659, "duration": 6.08}, {"text": "These little shapes that are part of the gables and chimneys again are they're not just to show those things ...", "start": 351.59, "duration": 4.97}, {"text": "but also to lend some clarity and broken contour to the rooftop shape.", "start": 356.96, "duration": 4.19}, {"text": "Deepening my value here by adding another wash.", "start": 362.15, "duration": 2.389}, {"text": "Sometimes with watercolor you can get the value right the first time,", "start": 365.27, "duration": 2.75}, {"text": "while other times you want to start light let that area dry to make room for future washes,", "start": 368.33, "duration": 5.209}, {"text": "which will make it darker. Here though,", "start": 373.539, "duration": 2.19}, {"text": "I'm using wet into wet to let the medium mix all these colors into a single shape and value.", "start": 375.729, "duration": 5.7}, {"text": "Windows can be a great opportunity to bring some much-needed smaller shapes into an area and", "start": 384.74, "duration": 5.359}, {"text": "while that value is on my brush, I'll continue this lost-and-found game that I'm playing with the rooftop by putting a tree behind it.", "start": 390.83, "duration": 6.44}, {"text": "Basically", "start": 397.43, "duration": 0.5}, {"text": "what I'm doing here is", "start": 397.93, "duration": 1.0}, {"text": "defining part of the rooftops contour. And just to show you where I'm at with this: these parts of the roof top shape are found ...", "start": 398.93, "duration": 6.199}, {"text": "while these parts are lost. As to whether or not that's the correct balance -", "start": 405.229, "duration": 4.13}, {"text": "I have no idea! One thing's for sure though", "start": 409.36, "duration": 3.33}, {"text": "you don't need to show the viewer the entire shape in order for them to identify the shape. Our brain wants to fill in information.", "start": 412.69, "duration": 7.229}, {"text": "We do it every second of every day in real life.", "start": 420.56, "duration": 2.989}, {"text": "That's what makes playing with shapes and varieties and lost-and-found so appealing to me. I feel like it's true to how we experience reality", "start": 424.129, "duration": 7.459}, {"text": "Anyway, I'm at the point in this painting that I find to be the most difficult part of the process.", "start": 432.529, "duration": 4.73}, {"text": "That is when I have a lot of shapes down ... yet I still feel the need to add some more.", "start": 437.449, "duration": 4.49}, {"text": "When you're sketching from life, everything is happening in the moment. I find it near impossible to have an objective", "start": 442.55, "duration": 5.81}, {"text": "look at what you're creating as you're creating it.", "start": 448.49, "duration": 2.63}, {"text": "It's not uncommon for me to look at one of my sketches and wish I'd stopped ten minutes sooner. The shapes", "start": 451.13, "duration": 6.05}, {"text": "I'm putting down now, though, I think are necessary. They're adding some nice break up.", "start": 457.18, "duration": 3.72}, {"text": "They're also helping to define the perspective of the scene. And", "start": 460.9, "duration": 2.819}, {"text": "Keep your eye on the screen because my favorite brushstroke and the whole piece is coming up!", "start": 463.85, "duration": 4.04}, {"text": "Right ... there! I think that one stroke gave meaning to that entire left third of the page. And", "start": 468.56, "duration": 6.08}, {"text": "looking back at this sketch, I think I probably could have stopped right here ...", "start": 475.22, "duration": 3.29}, {"text": "Okay, maybe after that drip. I", "start": 479.18, "duration": 2.0}, {"text": "Didn't stop though. I'm plowing ahead.", "start": 483.8, "duration": 1.73}, {"text": "I'm gonna put a tree behind this house which, on one hand, forces me to reveal the entirety of that last column ...", "start": 485.53, "duration": 6.869}, {"text": "not sure I'm a fan of that ...", "start": 492.86, "duration": 1.8}, {"text": "But I am a fan of the depth that creates. Now the house feels like it's coming forward, due to it", "start": 494.66, "duration": 5.93}, {"text": "overlapping something behind it.", "start": 500.63, "duration": 1.8}, {"text": "Now, that tree of course has thousands of details in it,", "start": 502.43, "duration": 3.319}, {"text": "but I'm gonna limit myself to just a few shapes.", "start": 505.79, "duration": 2.72}, {"text": "That will suggest its form but still allow most of the shaped play to exist in the subject in front of it.", "start": 508.64, "duration": 6.32}, {"text": "Remember the jigsaw puzzle analogy? I don't want equal shape play throughout.", "start": 515.18, "duration": 4.22}, {"text": "Including more of the vegetation on the other side for some counterbalance. Oh", "start": 523.64, "duration": 3.979}, {"text": "and here's a look at how I clean my brush off.", "start": 528.62, "duration": 2.15}, {"text": "I don't clean my brush between each mixture or anything.", "start": 530.77, "duration": 3.209}, {"text": "If you've seen my other videos", "start": 534.08, "duration": 1.61}, {"text": "you know all about the power of grays and how they relate to color harmony! And", "start": 535.69, "duration": 4.08}, {"text": "maybe, the next watercolor video I make, instead of shapes, I'll focus instead on color and edges.", "start": 540.05, "duration": 5.09}, {"text": "Those are other fundamental properties of a painting, after all. But for now, we're gonna call this sketch finished!", "start": 545.14, "duration": 5.609}, {"text": "That was a lot of fun. Thanks everyone for watching. I'd like to quickly thank my wife, who didn't divorce me!", "start": 551.27, "duration": 5.51}, {"text": "In fact, she filmed this painting while eight months pregnant, on an extremely hot day.", "start": 556.88, "duration": 5.179}, {"text": "But yeah, our first child should be arriving any day now ...", "start": 562.64, "duration": 2.88}, {"text": "so if you don't see me on YouTube the next month or so,", "start": 565.52, "duration": 2.159}, {"text": "you'll know why! But until then, check out my other videos. I have longer lessons on my online store,", "start": 567.84, "duration": 5.599}, {"text": "and I'm looking forward to bringing you guys more content here on YouTube. See you next time!", "start": 573.44, "duration": 4.619}]