[{"text": "Minecraft means you love them. I love them. Let's watch them", "start": 0.219, "duration": 3.95}, {"text": "Yeah, watch till the end of the video for a surprise now that I'm a Minecraft channel. I can finally understand", "start": 4.17, "duration": 7.41}, {"text": "Minecraft memes so I asked you guys on Twitter", "start": 12.219, "duration": 2.24}, {"text": "Send me your best minecraft memes. Let's see if we can make a scout that today. Welcome to", "start": 14.98, "duration": 4.37}, {"text": "Minecraft edition", "start": 21.52, "duration": 2.0}, {"text": "Ok, he's found diamonds. What is the twist a creeper don't dig down", "start": 29.59, "duration": 4.579}, {"text": "Hey look nothing, uh", "start": 38.71, "duration": 2.0}, {"text": "Stop stop", "start": 44.53, "duration": 2.0}, {"text": "He's gonna jump in isn't he? Okay", "start": 53.449, "duration": 2.78}, {"text": "That was a rollercoaster", "start": 58.25, "duration": 2.0}, {"text": "They had us in the first half not gonna like I think they had me in every half", "start": 60.53, "duration": 3.47}, {"text": "I never felt so literally trolled smash like if you got epically troll", "start": 64.0, "duration": 4.169}, {"text": "That funny but at the same time it was the first time we saw creeper (aww man)", "start": 77.06, "duration": 4.13}, {"text": "I mean a zombie in a minecart. It was funny. Damn Mike. I've looked different back. Then we call the Sun is everyone in there?", "start": 81.19, "duration": 5.879}, {"text": "Get the fraps, this has to be documented no one's ever done this no", "start": 89.569, "duration": 5.99}, {"text": "He's gonna die at it", "start": 97.52, "duration": 2.0}, {"text": "These are always so good", "start": 102.83, "duration": 1.28}, {"text": "This is my video game minecraft veteran, you know that you can jump off a high point in place of water", "start": 104.11, "duration": 6.509}, {"text": "Right before you're only pros can do it. Take any fall damage. Ash such", "start": 111.14, "duration": 5.629}, {"text": "Welcomed through the life of an idiot. I can laugh at my own jokes, cuz I don't remember them. The mental lag is brutal", "start": 123.439, "duration": 7.01}, {"text": "That's the sad thing. I was actually trying", "start": 131.72, "duration": 2.029}, {"text": "Can't wait for minecraft in 4k damn, Notch. Come on", "start": 134.66, "duration": 3.919}, {"text": "You just make it happen since I play Minecraft now. I get this joke because it's not actually Minecraft. It's Spyro", "start": 138.579, "duration": 6.06}, {"text": "Don't miss another minecraft set Lionel bring it to me", "start": 148.29, "duration": 4.19}, {"text": "He had no loot are you kidding me? I don't believe that see I understand these joke now", "start": 158.129, "duration": 5.029}, {"text": "It's the eye of Ensor. I get it. I get it. I'm part of you guys", "start": 163.159, "duration": 3.51}, {"text": "I understand the joke so that funny but I get it see now", "start": 166.67, "duration": 4.439}, {"text": "I can truly appreciate this cursed image now that I play Minecraft. Please kill it. Why do you think?", "start": 171.109, "duration": 5.7}, {"text": "I don't like what are sheep. Let's get real here. Please stop it. I don't want to see your cursed imagery. Stop it", "start": 176.81, "duration": 6.149}, {"text": "No, don't do that peepeepoopoo", "start": 183.12, "duration": 2.449}, {"text": "Creeper", "start": 187.709, "duration": 2.0}, {"text": "Awww man how did that even happen?", "start": 191.099, "duration": 2.0}, {"text": "damn creepers of Notch(?) damn proud of himself for making tons of gamers suffer SM edge", "start": 193.579, "duration": 7.47}, {"text": "I appreciate that minecraft air pods as well. I think this is more of a meme that I'm I can truly appreciate it", "start": 207.0, "duration": 6.109}, {"text": "It's like wine. I don't go. Wow. This one tastes good. It's more like that's good.", "start": 213.109, "duration": 4.619}, {"text": "I like that, I like this meme", "start": 218.43, "duration": 2.0}, {"text": "Since Petey pyres now become a Minecraft youtuber I felt it was finally time to become a Minecraft editor", "start": 235.269, "duration": 4.669}, {"text": "This is now a Minecraft page from now on smash like on that one. Thank you. Very cool", "start": 239.939, "duration": 4.47}, {"text": "Just don't mind straight down no. Oh", "start": 249.609, "duration": 3.32}, {"text": "My god, I guess trolls epically oh", "start": 257.199, "duration": 2.45}, {"text": "Okay, that was good fine that was good brother lock is just great dude got my freshly enchanted diamond tools and", "start": 262.33, "duration": 6.08}, {"text": "Um, my eyes are going black on the surface. Hey every time", "start": 269.229, "duration": 3.08}, {"text": "Ba-ba-ba-ba-ba-ba-ba-ba-ba. Only true gamers can understand this moment. Only true gamers can understand", "start": 274.419, "duration": 5.48}, {"text": "I understand like now that I play Minecraft. I understand the pain that this man is about to get inflicted upon himself", "start": 279.9, "duration": 5.519}, {"text": "No", "start": 286.9, "duration": 2.0}, {"text": "Don't you just go this way? Yeah, even the trees in the background", "start": 306.29, "duration": 3.889}, {"text": "Oh", "start": 313.8, "duration": 1.03}, {"text": "Force mad, it's not hey", "start": 314.83, "duration": 2.0}, {"text": "That's alike. I like that one. That was good. What can I say? Sometimes you guys have good memes. All right, next one", "start": 317.349, "duration": 5.57}, {"text": "7777", "start": 325.36, "duration": 1.799}, {"text": "peace out sucker", "start": 327.159, "duration": 2.0}, {"text": "God I'm 77. He's not sucker", "start": 331.419, "duration": 3.619}, {"text": "That's good, like half of the Minecraft memes is just falling or a creepers", "start": 337.569, "duration": 4.1}, {"text": "Only true minecraft gamers can understand me hits Pigman by accident all Pigman in nether buenas Dias", "start": 341.8, "duration": 7.91}, {"text": "This is like the only thing I haven't messed up yet in Minecraft. I'm pretty sure I just jinx myself. Yeah, I drinks myself", "start": 350.47, "duration": 5.539}, {"text": "It's gonna happen", "start": 356.349, "duration": 1.56}, {"text": "Normally, I'm like Oh Pigman, I should attack them minecraft big brain", "start": 357.909, "duration": 3.68}, {"text": "I'm not gonna", "start": 362.44, "duration": 1.89}, {"text": "Cool Felix good you want to tell us any more pointless information next game? Oh god, not Sven memes", "start": 364.33, "duration": 7.1}, {"text": "I can't handle it", "start": 371.43, "duration": 2.0}, {"text": "Okay", "start": 378.069, "duration": 2.0}, {"text": "That's all", "start": 383.11, "duration": 1.589}, {"text": "That guy I got this is sad little late. I feel that you laugh. You sad Hey Dolan got one", "start": 384.699, "duration": 6.98}, {"text": "It's all items. You just have to take a risk", "start": 391.69, "duration": 2.69}, {"text": "It's a good mean I have seen it already I'm sorry. Darlin come in the side dock son", "start": 403.86, "duration": 4.909}, {"text": "But like before I got it but now I truly understand like I bet she thought she jumped into lava or something like crazy", "start": 410.459, "duration": 6.23}, {"text": "Water Shh", "start": 422.55, "duration": 2.0}, {"text": "The quality is so bad. I can't see what is that she closes it order very nice house", "start": 425.789, "duration": 6.019}, {"text": "Water she I knew it. He's invading other people's world in dark souls", "start": 434.999, "duration": 4.19}, {"text": "That's funny oh I see this skills around the corner", "start": 442.289, "duration": 5.63}, {"text": "Don't go down", "start": 459.569, "duration": 2.0}, {"text": "That's amazing 10 out of 10 smash like and subscribe I know we're in like it's clearly people reposing other people's content whatever", "start": 468.629, "duration": 7.489}, {"text": "It's never stopped me before the Wi-Fi password is on the back of the router the back of the router", "start": 476.119, "duration": 4.529}, {"text": "Yeah, why do they always make it so freakin encrypted? So that's the language of the enchantments. Okay. See I get it now", "start": 481.169, "duration": 6.859}, {"text": "This is a minecraft mean I get it", "start": 488.089, "duration": 1.83}, {"text": "I don't buy you guys", "start": 489.919, "duration": 0.96}, {"text": "But I get it smash like of you and subscribe and buy the merch if you get it, I am wearing them out", "start": 490.879, "duration": 5.009}, {"text": "It's just a little chilly today. Okay, just myth just to make sure", "start": 495.889, "duration": 2.67}, {"text": "Just to make sure", "start": 499.169, "duration": 1.381}, {"text": "kpop fans be like, oh my god, which was", "start": 500.55, "duration": 2.0}, {"text": "Why does villagers exist and why did they give me nightmares?", "start": 505.439, "duration": 2.959}, {"text": "I developed an AR app from your microwaves and put it on the Brighton Beach what the actual free curry? Oh", "start": 508.519, "duration": 6.33}, {"text": "my god is the pier that", "start": 515.43, "duration": 2.0}, {"text": "Was literally there yesterday. I didn't see it. What? Oh my god. They're entering", "start": 518.729, "duration": 6.17}, {"text": "What can you guys imagine why is the Swedish flag not working that is weird", "start": 527.13, "duration": 4.94}, {"text": "What their sheep gets the revenge of Kitty plank", "start": 533.99, "duration": 2.539}, {"text": "Yeah, that's creepy, no, not the balance I got ya I", "start": 548.45, "duration": 6.559}, {"text": "Can't believe everyone has my freaking world. No my Diamont what song is that? Oh", "start": 557.54, "duration": 6.35}, {"text": "My god, it was this literally foreshadowing for after Jack Black. Does this mean Jack Black is water sheep. Stop it. So then do something", "start": 565.04, "duration": 7.76}, {"text": "Worst guard dog. Oh listen, PC etiquette", "start": 574.64, "duration": 2.75}, {"text": "Stop don't don't you dare touch IKEA tower. No", "start": 582.11, "duration": 4.76}, {"text": "Delete this right now grande", "start": 588.829, "duration": 2.0}, {"text": "What is this what flag is that?", "start": 594.29, "duration": 2.0}, {"text": "No too far too far", "start": 600.589, "duration": 4.79}, {"text": "Water ship is Norwegian. It all makes sense now. No, don't touch that", "start": 607.459, "duration": 6.14}, {"text": "Brah brah", "start": 622.93, "duration": 2.0}, {"text": "I'm shaking", "start": 628.269, "duration": 2.0}, {"text": "Not y'all yet. He's already suffered it up", "start": 633.61, "duration": 2.57}, {"text": "It even has my freaking contraption dude how", "start": 638.74, "duration": 3.679}, {"text": "Not cool man not cool guys I fix Australia ding their boat I get it that huh", "start": 647.529, "duration": 7.159}, {"text": "Thanks guys, I finally understand the me thank you very much. Thank you so much it took a while", "start": 658.209, "duration": 4.79}, {"text": "But I finally got there only gamers know the real struggle and sacrifice", "start": 663.519, "duration": 4.46}, {"text": "When you're suffering from success", "start": 668.649, "duration": 2.0}, {"text": "That's a decent mean I gave a chuckle I'm still I still got my health bar though, I we're still doing that", "start": 680.98, "duration": 6.169}, {"text": "No, it's minecraft. Ok, how do I how do I tame apparent? Hey look, it's me again", "start": 687.149, "duration": 4.409}, {"text": "Right in front of me - come on how did he live through that? Oh my god", "start": 697.329, "duration": 5.809}, {"text": "Oh my god", "start": 705.96, "duration": 2.399}, {"text": "Ten out of ten editing. What's your name, beautiful?", "start": 717.029, "duration": 5.46}, {"text": "He ate the cover so Marty McFly Williams F's in the chat for Marty McFly Williams boys, good night girl", "start": 730.16, "duration": 7.19}, {"text": "I see you tomorrow", "start": 737.35, "duration": 2.0}, {"text": "Good night girl, I see you tomorrow. I", "start": 741.2, "duration": 2.33}, {"text": "Get it because you're not supposed to just go in the end reporter", "start": 745.88, "duration": 3.02}, {"text": "I get it 90% bug free 10% of bugs good mean I get it if I didn't play my crime", "start": 748.9, "duration": 5.789}, {"text": "Probably would not understand", "start": 755.72, "duration": 2.0}, {"text": "Why is this a thing I'm very confused but it also makes me laugh and I don't know why", "start": 769.13, "duration": 4.94}, {"text": "Hey, look, it's the immersive Asian maybe edition question mark in the future", "start": 774.56, "duration": 5.599}, {"text": "Of course Grande this video is not for the faint-hearted. Well, the last one was painful enough. Okay, let's watch it", "start": 780.16, "duration": 6.54}, {"text": "Stop stop Oh", "start": 787.82, "duration": 2.0}, {"text": "God", "start": 790.82, "duration": 2.0}, {"text": "Hey at least ha ha ha", "start": 794.3, "duration": 2.299}, {"text": "Ok sure", "start": 798.95, "duration": 2.0}, {"text": "What else could he possibly do to annoy me", "start": 802.28, "duration": 2.059}, {"text": "Is that obsidian yeah. Okay great. I", "start": 809.26, "duration": 2.659}, {"text": "Feel like the team starts screaming meme saw that Tilly hates", "start": 813.67, "duration": 3.169}, {"text": "Now I truly know what keeps our we're screaming about but playing my track oh", "start": 818.529, "duration": 4.82}, {"text": "My gosh, you can't melt obsidian crinch what", "start": 826.18, "duration": 4.669}, {"text": "Now get biscuit nugget in a biscuit Hey, look what I didn't know that worked", "start": 838.269, "duration": 6.29}, {"text": "What can you possibly do with redstone of course", "start": 851.41, "duration": 6.049}, {"text": "How's that even possible that made no sense guys", "start": 863.44, "duration": 2.869}, {"text": "See, I played Minecraft and I can I can honestly tell you guys this makes no sense", "start": 866.529, "duration": 4.79}, {"text": "You can't just summon the withered he's from call of duty black ops. Everyone knows that stop using my world. How did this happen?", "start": 871.8, "duration": 6.39}, {"text": "Get out", "start": 880.089, "duration": 2.0}, {"text": "Gosh damn it. Don't touch the vein. Don't touch don't you dare? Okay. Good good", "start": 884.199, "duration": 7.73}, {"text": "Damn it. My mom my dad see there it is. There's a screaming team sir", "start": 901.029, "duration": 4.46}, {"text": "He lives in all of us", "start": 912.76, "duration": 2.0}, {"text": "See everyone loves minecraft it brings people together. It makes you have a good time and not worry about all that petty BS", "start": 921.12, "duration": 7.459}, {"text": "Look at that if they can get a long before cap", "start": 929.1, "duration": 2.839}, {"text": "Minecraft then we all can thank you so much for watching this episode smash like subscribe by the merch which I am wearing", "start": 932.76, "duration": 7.19}, {"text": "And I see you guys next time", "start": 940.74, "duration": 2.0}, {"text": "What you never played super simulator", "start": 944.4, "duration": 3.049}, {"text": "You know, it's fun right I'm not supposed to give my opinion", "start": 948.96, "duration": 4.16}, {"text": "But give it a try and then you can tell me if it's good or not not convinced yet. Okay. I'll cut you a deal", "start": 954.09, "duration": 7.64}, {"text": "The game is available for free and that's a great price", "start": 962.3, "duration": 3.869}]