[{"text": "Hey it's me Destin. Welcome back to Smarter Every Day. So you've noticed that moths", "start": 0.01, "duration": 4.0}, {"text": "and other bugs sometimes get trapped around a light. Have you ever thought about why?", "start": 4.03, "duration": 4.01}, {"text": "[music]", "start": 8.06, "duration": 4.03}, {"text": " ", "start": 12.11, "duration": 4.06}, {"text": "We are in the middle of the Amazon rainforest and we have", "start": 16.19, "duration": 4.18}, {"text": "a huge mercury vapor light that Gerson setup for us.", "start": 20.39, "duration": 4.02}, {"text": "And we are looking at all the different", "start": 24.43, "duration": 4.02}, {"text": "species that have shown up. This is Phil Torres,", "start": 28.47, "duration": 4.04}, {"text": "he is a, what do you call it?\n- Entomologist.", "start": 32.53, "duration": 3.99}, {"text": "- Entomologist? Is that with a d or a t?\n- With a t.\n- Entomologist. So tonight", "start": 36.54, "duration": 3.99}, {"text": "we are studying why these insects get caught around the light. The term for this", "start": 40.55, "duration": 3.99}, {"text": "is called Phototaxis. So an organism is", "start": 44.56, "duration": 4.01}, {"text": "phototactic if it responds to light with motion.", "start": 48.59, "duration": 4.03}, {"text": "A positively phototactic animal will move toward a light and a negatively", "start": 52.64, "duration": 4.03}, {"text": "phototactic animal, it doesn't necessarily have to be an animal. I guess.. think about it leaves", "start": 56.69, "duration": 3.99}, {"text": "are phototactic. So here's what we're doing.", "start": 60.7, "duration": 3.99}, {"text": "They are going through, are you taking photos of all the different species?\n- Mmm hmm.", "start": 64.71, "duration": 4.02}, {"text": "A good amount of them yeah.\n(Destin) You've got one on your ear, hold on. Got him.", "start": 68.75, "duration": 4.02}, {"text": "Man I have been moving around and I haven't seen the same species twice.", "start": 72.79, "duration": 4.03}, {"text": "Oh that's a pretty one.", "start": 76.84, "duration": 4.03}, {"text": "That is a crazy look.. Is that a moth?", "start": 80.89, "duration": 4.02}, {"text": "- Yeah.\n(Destin) Is this how entomologists find new species?", "start": 84.93, "duration": 4.06}, {"text": "- Yeah, this is a really good way because they just come right to you.", "start": 89.01, "duration": 4.02}, {"text": "(Destin) You just sit around?\n- Just kind of sit around and different things come at different times of night,", "start": 93.05, "duration": 4.04}, {"text": "so what we see now may be completely different in like 3 hours.\n- That's awesome.", "start": 97.11, "duration": 3.99}, {"text": "What do you call these big ones Phil?\n- A sphinx moth.", "start": 101.12, "duration": 4.0}, {"text": "- That's a sphinx moth? And then what about this guy with the little..", "start": 105.14, "duration": 4.0}, {"text": "Princess Leia ears?\n- Ahh. I think that's a kind of silk moth.\n- OK We've demonstrated", "start": 109.16, "duration": 4.82}, {"text": "that the mercury vapor lamp is effective in bringing the species out of the forest and onto the bedsheet,", "start": 114.0, "duration": 2.78}, {"text": "but what we haven't answered is our question.", "start": 116.8, "duration": 2.78}, {"text": "Why are they attracted to the light in the first place? Well I was surprised to find out that most", "start": 119.6, "duration": 4.05}, {"text": "of the literature on the subject was written in the 50s, 60s and 70s. It's really old.", "start": 123.67, "duration": 4.03}, {"text": "So here's what we're gonna do. I pulled out two theories from the literature and we're gonna demonstrate them both.", "start": 127.72, "duration": 4.03}, {"text": "This is an old Sphinx moth that I got two years ago. Check it out.", "start": 131.77, "duration": 4.07}, {"text": "If we take this, and we use it and combine it with some lunar footage that I got", "start": 135.86, "duration": 4.02}, {"text": "from my buddy Jack, we can demonstrate theory number one.", "start": 139.9, "duration": 4.0}, {"text": "Moths use heavenly bodies like the sun and the moon to orient themselves in free flight.", "start": 143.92, "duration": 4.01}, {"text": "The idea is that they see the moon up in the sky and they try to keep themselves aligned", "start": 147.95, "duration": 4.02}, {"text": "at a certain angle with the moon. Now because the moon is so far away that angle pretty much", "start": 151.99, "duration": 4.03}, {"text": "stays the same as they fly along. Now imagine we brought the moon down to the earth.", "start": 156.04, "duration": 4.02}, {"text": "As he goes underneath his viewing angle would change more rapidly and he has to", "start": 160.08, "duration": 4.03}, {"text": "pitch up in order to compensate for it. This ends up pointing him just beyond the far edge", "start": 164.13, "duration": 4.02}, {"text": "of the light source. This would induce a logarithmic spiral which is pretty easy", "start": 168.17, "duration": 3.99}, {"text": "to define with math. We should be able to look at the footage of the moth flying around that", "start": 172.18, "duration": 4.01}, {"text": "mercury vapor lamp and figure out if there's a logarithmic spiral right?", "start": 176.21, "duration": 4.05}, {"text": "I used the Phantom to record some high speed footage of those moths flying around the lamp in hopes of", "start": 180.28, "duration": 3.99}, {"text": "plotting that logarithmic curve, but because the generator was running on AC,", "start": 184.29, "duration": 4.1}, {"text": "that light was blinking and so I decided not to even analyze the footage.", "start": 188.41, "duration": 4.12}, {"text": "Instead, I found some photos that a potter named Steven took and submitted to Nat Geo.", "start": 192.55, "duration": 4.02}, {"text": "His open shutter method proved to be more effective. Look at those curves. Do you see any logarithmic spirals?", "start": 196.59, "duration": 4.04}, {"text": "Kinda maybe, but the problem is there's several moths", "start": 200.65, "duration": 4.02}, {"text": "that you can see flying directly in towards the light. That kind of debunks our theory doesn't it.", "start": 204.69, "duration": 4.08}, {"text": "This leads us to theory number two. If you're a moth in the woods and you see a", "start": 208.79, "duration": 4.1}, {"text": "little bright spot over to your side, you can assume that's a wide open area.", "start": 212.91, "duration": 3.99}, {"text": "Therefore you can free fly without getting hit by trees and sticks and stuff like that.", "start": 216.92, "duration": 4.0}, {"text": "So the theory goes that these species of moths will align themselves with", "start": 220.94, "duration": 4.1}, {"text": "a light and fly directly towards it. So after looking at all these theories,", "start": 225.06, "duration": 4.03}, {"text": "and making my own observations, I took high speed video of cicadas flying around lanterns.", "start": 229.11, "duration": 4.01}, {"text": "Something became painfully clear to me.", "start": 233.14, "duration": 4.02}, {"text": "Science does not know why insects that are phototactic are attracted to light.", "start": 237.18, "duration": 4.03}, {"text": "We think we know, but we don't. I mean at a base level", "start": 241.23, "duration": 4.02}, {"text": "we don't know what's happening. This is such a simple thing for humans not to know.", "start": 245.27, "duration": 4.04}, {"text": "We've been observing this for hundreds of years. So as long as humans have had fire,", "start": 249.33, "duration": 4.05}, {"text": "we've known that bugs are attracted to artificial light. So it was only a matter of time before we ", "start": 253.4, "duration": 4.06}, {"text": "invented things like the bug zappers. Hold on.", "start": 257.48, "duration": 4.09}, {"text": "[Hitting bug zapper]\nYou buy a bug zapper you expect it to work. Go. There you go. Sorry.", "start": 261.59, "duration": 4.05}, {"text": "Obviously these things don't work as advertised. Let me explain why. So if I read the literature correctly,", "start": 265.66, "duration": 4.09}, {"text": "more bugs will go to the UV light because more bugs can see that wavelength.", "start": 269.77, "duration": 4.0}, {"text": "Now this is interesting but the problem is, mosquitos aren't the only type of bugs", "start": 273.79, "duration": 4.01}, {"text": "that's dying on these things. You might be doing more harm to the moth population than you are actually", "start": 277.82, "duration": 4.02}, {"text": "doing to the mosquito population. Mosquitos are actually attracted to carbon dioxide, which is why", "start": 281.86, "duration": 4.02}, {"text": "they have these little inserts of octanol or something like that that they put in the bottom of these things.", "start": 285.9, "duration": 4.09}, {"text": "One last thing. You see these black baffles on the side of the bug zapper?", "start": 290.01, "duration": 4.01}, {"text": "Now that's there for a very specific reason. Remember how we talked about how a moth or another bug will try to go towards", "start": 294.04, "duration": 3.99}, {"text": "the side of a light source instead of directly at it? Now what these baffles do is they", "start": 298.05, "duration": 4.02}, {"text": "create the illusion of multiple small light sources. So when a bug comes in", "start": 302.09, "duration": 4.02}, {"text": "and he sees those small light sources he tries to go for the side of one, and unfortunately he goes directly", "start": 306.13, "duration": 4.02}, {"text": "in towards the electrified grid, [snaps fingers] getting zapped. Anyway,", "start": 310.17, "duration": 4.02}, {"text": "that's pretty interesting. So, moths and other bugs do not fly solely on", "start": 314.21, "duration": 4.0}, {"text": "light sources alone. They also use other cues light pheremones. How do I know", "start": 318.23, "duration": 4.04}, {"text": "that moths fly with pheremoes, especially while mating? I read it in a book,", "start": 322.29, "duration": 4.05}, {"text": "while I was flying.\n[aircraft noise]", "start": 326.36, "duration": 4.04}, {"text": " ", "start": 330.42, "duration": 6.56}, {"text": "You might be aware that Audible actually sponsors Smarter Every Day, so I recommend an audio book,", "start": 337.0, "duration": 5.6}, {"text": "you can download it for free and it helps Smarter Every Day. Right now I'm actually reading a book.", "start": 342.62, "duration": 4.03}, {"text": "It's by a guy named E.O.Wilson, Edward Wilson.", "start": 346.67, "duration": 4.03}, {"text": "He went to the University of Alabama just like I did. Pulitzer Prize winner,", "start": 350.72, "duration": 4.02}, {"text": "he's a really good guy. Anyway what's interesting is, he is a bug expert.", "start": 354.76, "duration": 4.03}, {"text": "From my state. Pretty cool. The book I'm reading right now is called Letters to a Young Scientist,", "start": 358.81, "duration": 4.01}, {"text": "right now I'm reading about moth pheremones. Pretty neat. It's actually pretty good", "start": 362.84, "duration": 4.03}, {"text": "I'll let you look out the window real quick, just so you know where we're at.", "start": 366.89, "duration": 4.04}, {"text": "Anyway, the Letters to a Young Scientist is about Edward Wilson's long career and what he learned", "start": 370.95, "duration": 4.05}, {"text": "and didn't learn while he was studying insects. You can go check it out.", "start": 375.02, "duration": 4.05}, {"text": "The cool thing is you can learn from his mistakes and the things that he did that worked", "start": 379.09, "duration": 4.07}, {"text": "Go check it out. Audible.com/smarter. You can download a free audio book.", "start": 383.18, "duration": 4.05}, {"text": "Top link in the video description, that'd help me out. Thanks, have a good one.", "start": 387.25, "duration": 4.01}, {"text": "[aircraft noise]", "start": 391.28, "duration": 4.01}, {"text": "So the theory is that as you're flying, the", "start": 395.31, "duration": 4.04}, {"text": "closing angle between.. thank you.. the bug,", "start": 399.37, "duration": 4.03}, {"text": "and the moon, the artificial moon will change, and he tries to keep it over head.", "start": 403.42, "duration": 4.02}, {"text": "And as he's flying... [loud insect sound] ", "start": 407.46, "duration": 4.09}, {"text": "[laugh] [insect sound fades] Thank you. As he's flying, he always keeps the", "start": 411.57, "duration": 4.12}, {"text": "\"moon\" on top of him, and he just ends up in this rotational pattern.", "start": 415.71, "duration": 4.04}, {"text": "[ Captions by Andrew Jackson ]\ncaptionsbyandrew.wordpress.com", "start": 419.77, "duration": 2.06}, {"text": "Captioning in different languages welcome.\nPlease contact Destin if you can help.", "start": 421.85, "duration": 2.427}]