[{"text": "So, I play fiddle in a bluegrass band.", "start": 3.88, "duration": 2.06}, {"text": "Even though it's an acoustic instrument", "start": 10.3, "duration": 1.65}, {"text": "Typically, we're amplified at our shows. Fiddle is one of the most difficult instruments to amplify.", "start": 11.95, "duration": 4.759}, {"text": "Typically you either use a microphone", "start": 16.81, "duration": 1.46}, {"text": "Which is what I have here--a little clip-on microphone--and you can hear me talking through it or you use a pickup", "start": 18.27, "duration": 4.439}, {"text": "which is embedded here in the bridge. A microphone typically sounds kind of more like what the instrument actually sounds like in person.", "start": 22.709, "duration": 4.831}, {"text": "While a pickup sounds kind of more, I don't know, \"tin canny.\"", "start": 32.26, "duration": 4.06}, {"text": "But problem is that sometimes I don't want the sound to be coming out of them", "start": 40.68, "duration": 2.54}, {"text": "Sometimes I want to be able to tune my instrument, or talk to my bandmates without the entire audience hearing it.", "start": 43.23, "duration": 4.619}, {"text": "It's really easy to find mute pedals for pickups.", "start": 47.85, "duration": 1.869}, {"text": "It's a little bit harder to find mute pedals for microphones, but they do exist.", "start": 49.719, "duration": 2.99}, {"text": "But as far as I can tell, there's really nothing out that you can buy that mutes both a microphone and a pickup together.", "start": 53.039, "duration": 5.52}, {"text": "There are some really really expensive preamps that are like a thousand bucks that will do that also.", "start": 58.559, "duration": 3.18}, {"text": "But I didn't want to spend a thousand bucks just for a mute.", "start": 61.75, "duration": 2.299}, {"text": "And, of course, probably somebody watching this will tell me right away that they know exactly how to find this", "start": 64.049, "duration": 3.48}, {"text": "but I couldn't find it after extensive searching so I decided to make one myself.", "start": 67.54, "duration": 4.069}, {"text": "Alright, the parts are here. Let's do this.", "start": 72.64, "duration": 2.059}, {"text": "So, what do you need to make a dual-channel mute pedal for a mic and a pickup?", "start": 77.98, "duration": 3.92}, {"text": "Two guitar cable jacks, an input and output mic jack, a three channel switch, one channel for the mic, one for the pickup and one for an LED.", "start": 81.9, "duration": 6.44}, {"text": "an LED and resistor,", "start": 88.34, "duration": 1.94}, {"text": "9-volt battery and battery connector, some small bolts, a box to put it all in, and the makerspace at your local library", "start": 90.28, "duration": 5.93}, {"text": "which has plenty of wire, soldering irons, drill bits, and so on. All in all it's only about twenty or thirty bucks if you already", "start": 96.21, "duration": 5.69}, {"text": "own the tools or can borrow them from friends or go to a makerspace", "start": 101.909, "duration": 2.79}, {"text": "I started off by finding the wiring diagrams for mute switches.", "start": 104.7, "duration": 3.51}, {"text": "I don't know much about circuits beyond what you learn in high school physics, so these circuits are very very simple.", "start": 108.21, "duration": 5.11}, {"text": "The pickup is the easiest one since it has only two wires", "start": 113.4, "duration": 3.08}, {"text": "One in black carrying a fixed reference voltage", "start": 116.48, "duration": 3.52}, {"text": "and the other in red carrying the signal from the pickup", "start": 120.0, "duration": 2.0}, {"text": "by connecting these two wires together you stop the signal from reaching the", "start": 122.0, "duration": 3.32}, {"text": "amplifier or PA system or whatever.", "start": 125.48, "duration": 2.18}, {"text": "I tested this all out with alligator clip cables to make sure things worked and the pickup was successfully muted.", "start": 127.679, "duration": 5.22}, {"text": "So, onto the microphone", "start": 132.9, "duration": 1.6}, {"text": "The mic has three wires", "start": 134.5, "duration": 1.829}, {"text": "One with a fixed reference voltage and the other two carrying copies of the signal from the mic.", "start": 136.329, "duration": 4.55}, {"text": "The copies are inverted relative to each other and are later combined in a clever way to help minimize interference from other nearby", "start": 140.88, "duration": 5.759}, {"text": "electronics. Anyway, because the copies of the signal are inverted if we connect the two signal wires together the signals interfere and don't reach the", "start": 146.89, "duration": 6.86}, {"text": "PA system, muting the microphone. I tested this out too just to make sure it was working test 1 test 2 test", "start": 153.75, "duration": 6.0}, {"text": "1 test 2 test 1 test :and it worked. As a theoretical physicist,", "start": 161.019, "duration": 5.42}, {"text": "I'm constantly amazed when something actually works in real life the way you predict it should. Oh, yeah", "start": 166.44, "duration": 4.319}, {"text": "And of course there has to be a nice red LED that lights up to show when the mute is on.", "start": 170.76, "duration": 3.779}, {"text": "The LED has a very simple circuit: just a 9-volt battery supplying power and a resistor so you don't blow out the LED. and", "start": 174.67, "duration": 6.619}, {"text": "I tested this too, just to make sure, because I don't know what I'm doing.", "start": 181.45, "duration": 3.319}, {"text": "The combination of that click together with the light going on is so satisfying. So now to put this all into the box,", "start": 184.92, "duration": 6.659}, {"text": "which came with no holes in it.", "start": 191.65, "duration": 1.55}, {"text": "So I spent entirely way too long measuring and re measuring to figure out exactly where each of the holes should be.", "start": 193.2, "duration": 4.74}, {"text": "I only had one box and I did not want to mess it up.", "start": 197.94, "duration": 2.399}, {"text": "I learned that step drill bits like this one are good for drilling big holes and thin materials as long as you have enough space", "start": 200.519, "duration": 5.309}, {"text": "On the other side for the bit to go through without hitting stuff.", "start": 205.829, "duration": 2.339}, {"text": "Oh, and this shiny plastic box is ugly and", "start": 208.169, "duration": 2.91}, {"text": "scratches and smudges way too easily. A quick visit to the kitchen scouring pad gave it a sleek brushed look, though", "start": 211.18, "duration": 5.99}, {"text": "it still scratches kind of easily. Then it was time to get rid of those alligator clips and properly solder the connections together.", "start": 217.17, "duration": 5.19}, {"text": "This was my first real time soldering and I'm sure I broke all sorts of soldering rules.", "start": 222.37, "duration": 4.22}, {"text": "But I tried to look things up online and stay organized with different colors of wire and make sure I put the necessary wires through", "start": 226.66, "duration": 5.569}, {"text": "the necessary holes before soldering them. And the heat shrink tubing maybe isn't necessary, but it is incredibly satisfying to put on.", "start": 232.23, "duration": 6.6}, {"text": "Here's the LED circuit, soldered and still working and a little while later, here's the pickup being muted", "start": 238.989, "duration": 5.72}, {"text": "and finally", "start": 244.739, "duration": 0.72}, {"text": "I soldered the microphone connections and could actually put the switch into the box and put the LED in and test that everything was still", "start": 245.459, "duration": 5.76}, {"text": "working. And I'm delighted to say it works. All in all this took me around eight or nine hours to build", "start": 251.22, "duration": 4.319}, {"text": "including filming myself while building it and if I did anything differently it would be to get a metal box.", "start": 255.669, "duration": 4.58}, {"text": "The plastic one is just a tad flimsy and still too easily scratched. So here's the finished product.", "start": 260.25, "duration": 5.13}, {"text": "It has two inputs, either for my mic or my pickup or both and", "start": 265.38, "duration": 3.449}, {"text": "one button that I can push to mute both of them together. That's all I wanted.", "start": 269.08, "duration": 4.01}, {"text": "I don't know why this doesn't exist, but I had to make it myself.", "start": 273.09, "duration": 2.55}, {"text": "I am so pleased with this. I'm really excited.", "start": 279.22, "duration": 2.239}, {"text": "It's such a simple stupid little project.", "start": 281.46, "duration": 1.709}, {"text": "But I'm super excited that I made something that didn't exist or I couldn't find and it's exactly what I want,", "start": 283.169, "duration": 5.64}, {"text": "and that's what's so satisfying about it. I highly recommend that you try projects like this.", "start": 288.81, "duration": 3.029}, {"text": "It's really satisfying--you learn stuff and you end up with a product that you're proud of and", "start": 291.84, "duration": 5.22}, {"text": "that you're gonna use actually in your, you know, your hobby of playing fiddle in a bluegrass band.", "start": 297.729, "duration": 5.66}, {"text": "If you're the sort of person who likes to tinker with electronics or making stuff and likes to understand how stuff like this works,", "start": 311.99, "duration": 4.94}, {"text": "I highly recommend today's sponsor Brilliant.org. Brilliant is a website with all sorts of puzzles and problems about science and math.", "start": 316.93, "duration": 5.519}, {"text": "You can learn things through their guided courses and quizzes, or you can just do their daily puzzles.", "start": 322.45, "duration": 4.38}, {"text": "They have a ton of stuff on there--courses about circuits and electricity and magnetism how", "start": 326.83, "duration": 3.54}, {"text": "electronics work and the first 200 people to go to Brilliant.org/minutephysics will get 20% off of a premium subscription", "start": 330.68, "duration": 5.809}, {"text": "to Brilliant, which gives you full access to all of their courses and puzzles and the daily problems.", "start": 336.49, "duration": 4.44}, {"text": "Again, that's brilliant.org/minutephysics for 20% off a premium subscription to Brilliant and to let Brilliant know that you came from here.", "start": 341.15, "duration": 5.959}, {"text": "Thanks.", "start": 347.63, "duration": 2.0}]