[{"text": "Nearly every bit of data we use in our modern devices", "start": 6.06, "duration": 2.76}, {"text": "has a price tag associated with it,", "start": 8.82, "duration": 1.76}, {"text": "but there is one vital piece of technology that many of our devices depend on, that is free.", "start": 11.14, "duration": 4.18}, {"text": "It allows our phones to give us turn-by-turn directions, no matter where we are in the world,", "start": 15.56, "duration": 3.68}, {"text": "and it may one day even facilitate driverless cars.", "start": 19.54, "duration": 2.6}, {"text": "This, of course, is the Global Positioning System,", "start": 22.48, "duration": 2.32}, {"text": "or GPS, for short.", "start": 24.84, "duration": 1.06}, {"text": "This satellite constellation costs upwards of 12 billion dollars to build and launch,", "start": 26.46, "duration": 4.5}, {"text": "yet its service is available for free, worldwide.", "start": 31.0, "duration": 2.4}, {"text": "Well... not really for free.", "start": 33.64, "duration": 1.68}, {"text": "The US taxpayers paid for it,", "start": 35.56, "duration": 1.58}, {"text": "and continue to pay approximately 2 million dollars a day,", "start": 37.16, "duration": 2.18}, {"text": "to maintain and operate the system.", "start": 39.44, "duration": 1.68}, {"text": "But it wasn't always available for use.", "start": 41.86, "duration": 1.86}, {"text": "These satellites were launched for use by the military", "start": 44.18, "duration": 2.06}, {"text": "to provide all divisions of the military with pinpoint accurate location information on their aircraft, ships,", "start": 46.66, "duration": 5.26}, {"text": "and even their individual soldiers, anywhere on the planet.", "start": 52.02, "duration": 2.7}, {"text": "The first Global Positioning satellite, the Navstar 1,", "start": 55.26, "duration": 2.68}, {"text": "was launched in February 22nd, 1978,", "start": 58.02, "duration": 2.34}, {"text": "aboard an Atlas rocket.", "start": 60.72, "duration": 1.26}, {"text": "Over the next 7 years, another ten GPS satellites", "start": 62.42, "duration": 2.56}, {"text": "were successfully launched into orbit.", "start": 65.04, "duration": 1.68}, {"text": "Only one of the twelve planned, Navstar 7, failed to launch.", "start": 66.98, "duration": 3.24}, {"text": "These Block I satellites validated the system's capabilities", "start": 70.46, "duration": 3.18}, {"text": "and the lessons learned from the project were carried forward to the Block II satellites,", "start": 73.64, "duration": 3.92}, {"text": "which would complete the 24-satellite constellation,", "start": 77.56, "duration": 2.56}, {"text": "providing worldwide GPS coverage for the US military.", "start": 80.12, "duration": 3.34}, {"text": "A 24-satellite constellation ensures that at least 4 satellites have a direct line of sight", "start": 83.46, "duration": 4.9}, {"text": "with any point on the planet's surface at all times.", "start": 88.36, "duration": 2.82}, {"text": "This ensures the GPS constellation can pinpoint your location anywhere on Earth", "start": 91.18, "duration": 4.16}, {"text": "through trilateration.", "start": 95.34, "duration": 1.64}, {"text": "We know exactly where the satellites will be at any time as a result of predictable orbits,", "start": 96.98, "duration": 4.94}, {"text": "and a ground station regularly checking in to make sure they are where we expect them to be.", "start": 101.92, "duration": 4.36}, {"text": "GPS satellites constantly broadcast a radio signal", "start": 106.52, "duration": 3.22}, {"text": "which the GPS receiver in your phone is constantly listening for.", "start": 109.74, "duration": 3.28}, {"text": "This signal tells your phone the satellite's position, and what time it was sent at,", "start": 113.26, "duration": 3.74}, {"text": "thus allowing the receiver to calculate how far away it is from the satellite,", "start": 117.0, "duration": 3.58}, {"text": "as the radio signal travels at a known speed - the speed of light.", "start": 120.58, "duration": 3.24}, {"text": "Each satellite tells us we are within X kilometres,", "start": 124.24, "duration": 2.62}, {"text": "and thus we know we are somewhere on the circumference of a sphere", "start": 126.86, "duration": 3.04}, {"text": "with a radius equal to that distance.", "start": 129.9, "duration": 2.2}, {"text": "Getting this information from 4 satellites allows us to pinpoint exactly where we are on Earth", "start": 132.3, "duration": 5.02}, {"text": "by combining each sphere, and seeing where they intersect.", "start": 137.32, "duration": 2.96}, {"text": "Knowing the exact time is essential to making this system accurate.", "start": 140.84, "duration": 3.08}, {"text": "A divergence of 20 to 30 nanoseconds", "start": 144.12, "duration": 2.32}, {"text": "would make the distance measurements unacceptably inaccurate,", "start": 146.44, "duration": 3.02}, {"text": "so each satellite contains an atomic clock,", "start": 149.76, "duration": 2.12}, {"text": "the most accurate timekeeping device available,", "start": 152.14, "duration": 2.32}, {"text": "but, due to their size and cost, these cannot be used in phones", "start": 154.68, "duration": 3.52}, {"text": "so the GPS satellites also constantly update the phone's time", "start": 158.2, "duration": 3.76}, {"text": "to ensure it is able to calculate the distance between itself and the satellite accurately.", "start": 161.96, "duration": 4.48}, {"text": "To keep this time measurement accurate, we even have to consider the effects of special relativity,", "start": 166.96, "duration": 4.24}, {"text": "because the receiver on the ground is moving slower than the satellite in orbit,", "start": 171.2, "duration": 3.42}, {"text": "which is travelling at 14,000 kilometres per hour.", "start": 174.62, "duration": 2.62}, {"text": "Special relativity predicts that the onboard atomic clock will experience time slower", "start": 177.44, "duration": 4.3}, {"text": "and thus fall behind the clocks on the ground by 7 microseconds a day.", "start": 181.74, "duration": 3.68}, {"text": "Furthermore, the satellites are orbiting at 20,000 kilometres above the surface of the planet,", "start": 185.94, "duration": 4.56}, {"text": "where the gravity of Earth has less effect on the curvature of spacetime.", "start": 190.5, "duration": 3.88}, {"text": "General relativity tells us that the clocks closer to the mass of Earth will fall behind the ones in orbit,", "start": 194.52, "duration": 5.34}, {"text": "so, if we calculate the time dilation due to gravity on the Earth's surface,", "start": 199.86, "duration": 3.58}, {"text": "and then calculate the dilation at 20,000 kilometres from the planet's surface,", "start": 203.44, "duration": 4.16}, {"text": "we can see that the clocks will diverge by 45 microseconds every day.", "start": 207.6, "duration": 3.92}, {"text": "Combining these effects, we have to make the clocks onboard each satellite", "start": 211.52, "duration": 3.72}, {"text": "to tick 38 microseconds faster than those on Earth.", "start": 215.24, "duration": 3.32}, {"text": "If this effect wasn't taken into account,", "start": 218.88, "duration": 2.18}, {"text": "GPS calculations would lose 10 kilometres of accuracy each day", "start": 221.06, "duration": 3.56}, {"text": "making it completely useless,", "start": 224.62, "duration": 1.74}, {"text": "but, thanks to the efforts of those ingenious engineers and Einstein's incredible discovery,", "start": 226.36, "duration": 4.16}, {"text": "we have a Global Positioning System on our smartphones", "start": 230.52, "duration": 3.36}, {"text": "with an accuracy within about 5 metres.", "start": 233.88, "duration": 2.3}, {"text": "But, as I said earlier, this system wasn't always available to the average citizen;", "start": 236.44, "duration": 4.32}, {"text": "it was for military use only.", "start": 240.86, "duration": 1.92}, {"text": "To open this system up to the public", "start": 242.78, "duration": 1.98}, {"text": "would open a tool that could potentially be used against the US.", "start": 244.76, "duration": 3.2}, {"text": "After all, missiles used this system for navigation, too.", "start": 248.0, "duration": 3.22}, {"text": "The incentive to open its use for civilian use came in 1983", "start": 251.52, "duration": 3.5}, {"text": "when a Soviet Su-15 shot down a Korean passenger jet", "start": 255.04, "duration": 3.44}, {"text": "that strayed from its intended route, into Soviet prohibited airspace.", "start": 258.48, "duration": 3.4}, {"text": "An error that could've been avoided had the new form of navigation been available.", "start": 262.08, "duration": 3.78}, {"text": "And so, on September 16th, 1983,", "start": 266.2, "duration": 2.9}, {"text": "president Ronald Reagan announced the Global Positioning System would be made available for civilian use,", "start": 269.1, "duration": 5.1}, {"text": "free of charge.", "start": 274.34, "duration": 1.04}, {"text": "But, there was a catch:", "start": 275.56, "duration": 1.26}, {"text": "the signal would be scrambled to decrease its accuracy to around 100 metres,", "start": 276.82, "duration": 3.68}, {"text": "making it useful, but not by today's standards.", "start": 280.5, "duration": 3.0}, {"text": "This was intended to keep the US military's tactical advantage,", "start": 283.72, "duration": 3.16}, {"text": "and prevent the system from being used for nefarious purposes.", "start": 286.88, "duration": 2.78}, {"text": "It wasn't until 2000 that president Bill Clinton signed a bill", "start": 289.88, "duration": 3.14}, {"text": "to stop the scrambling and open accurate GPS to all civilians,", "start": 293.02, "duration": 3.36}, {"text": "including those outside of America.", "start": 296.38, "duration": 2.04}, {"text": "This was done in recognition of the huge economic benefits", "start": 298.78, "duration": 3.3}, {"text": "GPS could provide to companies in America.", "start": 302.08, "duration": 2.52}, {"text": "American armies have disrupted the signal in the past in areas like Iraq", "start": 304.86, "duration": 3.8}, {"text": "by blasting out radio waves that disrupt the radio waves incoming from the satellites,", "start": 308.82, "duration": 4.0}, {"text": "and this isn't a difficult thing to do.", "start": 312.82, "duration": 2.56}, {"text": "In 2013, a truck driver in New Jersey", "start": 315.38, "duration": 2.98}, {"text": "wanted to mask his GPS location from his boss and used a small jammer,", "start": 318.36, "duration": 4.16}, {"text": "but inadvertently interrupted GPS navigation systems", "start": 322.52, "duration": 3.28}, {"text": "in Newark Airport every time he drove by.", "start": 325.8, "duration": 2.46}, {"text": "Beyond this simple jamming technique, which is easy to track,", "start": 328.7, "duration": 3.0}, {"text": "the US could simply choose to take away this privilege at any point,", "start": 331.7, "duration": 3.68}, {"text": "and cripple businesses across the world.", "start": 335.38, "duration": 2.24}, {"text": "So, countries around the world have been building their own GPS systems.", "start": 337.88, "duration": 3.52}, {"text": "Russia has its own 24-satellite constellation,", "start": 341.64, "duration": 2.5}, {"text": "and so does not depend on the US at all.", "start": 344.14, "duration": 2.22}, {"text": "A similar system will be available for China and Europe in 2020,", "start": 346.58, "duration": 3.48}, {"text": "while Japan has 2 satellites in orbit", "start": 350.42, "duration": 1.96}, {"text": "to increase GPS availability in its urban counties.", "start": 352.38, "duration": 2.68}, {"text": "These satellites' orbits have been tailored to ensure that one is directly overhead at all times.", "start": 355.44, "duration": 4.56}, {"text": "Finally, India has 7 of its own satellites to cover India's land area alone.", "start": 360.32, "duration": 4.18}, {"text": "This tool is probably one of the most underrated results of the space program.", "start": 364.5, "duration": 3.9}, {"text": "A simple radio signal that allows our farmers to operate driverless tractors to manage their land.", "start": 368.4, "duration": 4.9}, {"text": "Commercial fishing vessels use it to navigate, and find fishing locations.", "start": 373.3, "duration": 3.74}, {"text": "The aviation industry uses it for navigation, and collision avoidance.", "start": 377.04, "duration": 3.74}, {"text": "Even drones would not be possible without it,", "start": 381.06, "duration": 2.18}, {"text": "as anyone who has flown a DJI drone", "start": 383.24, "duration": 2.16}, {"text": "knows that you have to have a connection to at least 6 satellites to fly.", "start": 385.4, "duration": 3.2}, {"text": "Another technology that these drones have depended on to become so prevalent today,", "start": 388.6, "duration": 4.1}, {"text": "is computational simulations,", "start": 392.7, "duration": 1.74}, {"text": "and my friends at SimScale, who have kindly sponsored this video,", "start": 394.44, "duration": 3.18}, {"text": "are working to make engineering simulations available to everyone.", "start": 397.62, "duration": 3.34}, {"text": "The software I used for my thesis cost thousands of dollars to licence.", "start": 401.1, "duration": 3.62}, {"text": "Even the engineering firm I was working for previously was unwilling to pay to use it,", "start": 405.08, "duration": 4.08}, {"text": "but SimScale is available for free, if you don't mind your results being available to the public to view,", "start": 409.16, "duration": 4.88}, {"text": "which brings me to the next fantastic part of SimScale.", "start": 414.04, "duration": 3.22}, {"text": "You can view thousands of simulations from the community, and learn alongside them.", "start": 417.4, "duration": 4.18}, {"text": "You can even take an existing community simulation, and adapt it for your use.", "start": 421.58, "duration": 4.06}, {"text": "They run workshops regularly to teach you how to design with their tools.", "start": 425.96, "duration": 3.64}, {"text": "One of my favourites was a recently-run workshop on drone design.", "start": 429.84, "duration": 3.72}, {"text": "I honestly can't say how much I love this platform.", "start": 433.68, "duration": 2.58}, {"text": "If you are a hobbyist, an engineer, or a future engineer,", "start": 436.26, "duration": 3.04}, {"text": "I really recommend you sign up, and try your hand at engineering simulation.", "start": 439.3, "duration": 3.64}, {"text": "As always, thank you to my Patreon supporters for supporting this channel.", "start": 443.22, "duration": 3.32}, {"text": "Your pledges continue to allow me to improve the production quality of my videos,", "start": 446.72, "duration": 3.78}, {"text": "by making it possible for me to employ help", "start": 450.5, "duration": 2.26}, {"text": "with animation from Mike from MOBOX Graphics.", "start": 452.76, "duration": 2.3}, {"text": "If you wanna see more from Real Engineering or me,", "start": 455.38, "duration": 2.28}, {"text": "the links to my Twitter, Instagram, Facebook, and Patreon accounts are below.", "start": 457.66, "duration": 3.96}]