[{"text": "this is really interesting, but also not really\nsir.", "start": 0.11, "duration": 3.809}, {"text": "Amazing because when we watch presidential\ndebates, including the recent Democratic primary", "start": 3.919, "duration": 5.79}, {"text": "debates on NBC and CNN respectively, the obvious\nrealization that anyone who watches should", "start": 9.709, "duration": 7.321}, {"text": "come to, if they're paying attention, is that\nthere are narratives that the networks are", "start": 17.03, "duration": 5.22}, {"text": "deliberately pushing. There are storylines\nthat the networks and their moderators will", "start": 22.25, "duration": 6.24}, {"text": "just crow bar into the debates and the networks\nare not playing sort of a bystander role of", "start": 28.49, "duration": 7.12}, {"text": "just facilitating the debate as moderators,\nas the term moderator would suggest, they're", "start": 35.61, "duration": 6.33}, {"text": "active, they're writing the storyline. And\nbefore the CNN debate, I believe it was, there", "start": 41.94, "duration": 4.9}, {"text": "were all sorts of teasers and promos on social\nmedia and on, on CNS website about will Beto", "start": 46.84, "duration": 7.26}, {"text": "confront p Buddha judge or vice versa about\nsomething. And it was just such a completely", "start": 54.1, "duration": 5.08}, {"text": "fabricated and bogus narrative suggesting\nthat the big thing everyone's looking forward", "start": 59.18, "duration": 5.17}, {"text": "to is what's going to happen when Beto and\nbooted judge square off.", "start": 64.35, "duration": 5.43}, {"text": "That was a totally fabricated narrative. Like\nno one cared about that. But it was a storyline", "start": 69.78, "duration": 5.36}, {"text": "created by corporate media. And the network\nclearly goes in with a plan. This is not just", "start": 75.14, "duration": 6.04}, {"text": "CNN, uh, to create confrontations. They set\nup candidates to respond directly to often", "start": 81.18, "duration": 6.82}, {"text": "inaccurately framed quotes from other candidates.\nThey try to force disagreement, they try to", "start": 88.0, "duration": 4.0}, {"text": "get someone to attack somebody else. And it's\nso obvious and it's so brazen that it's actually", "start": 92.0, "duration": 4.82}, {"text": "pathetic if you understand what's going on.\nThey reinforce the polling by giving the people", "start": 96.82, "duration": 6.43}, {"text": "who are leading more time to talk and in a\nsense I understand that, but it becomes very", "start": 103.25, "duration": 6.049}, {"text": "transparently a a sensational when you realize\nthat they basically reinforce the polling", "start": 109.299, "duration": 6.68}, {"text": "in terms of speaking time, except if there\nis a storyline that they want to push that", "start": 115.979, "duration": 6.261}, {"text": "benefits from giving a lower polling candidate\nmore air time. For example, if a lower polling", "start": 122.24, "duration": 5.339}, {"text": "candidate goes in and is just aggressively\nattacking others, that's going to get them", "start": 127.579, "duration": 5.16}, {"text": "more speaking time than their polling might\nsuggest because it's all sensationalized.", "start": 132.739, "duration": 4.991}, {"text": "Okay? That's the setup. So Andrew Yang was\non the age three podcast the other day and", "start": 137.73, "duration": 5.99}, {"text": "straight up said it's even more rigged than\nwe thought. And honestly, there's no reason", "start": 143.72, "duration": 4.71}, {"text": "to question this whatsoever because it makes\nperfect sense. It confirms what seems pretty", "start": 148.43, "duration": 4.12}, {"text": "obvious when you watch the debates. Take a\nlook at this.", "start": 152.55, "duration": 2.64}, {"text": "You know, one thing I'll share with you all\nis that some of the campaigns are in touch", "start": 155.19, "duration": 2.93}, {"text": "with the TV network ahead of time to talk\nabout what sort of attack they want to love", "start": 158.12, "duration": 4.22}, {"text": "on the stage. They're like an attack on a\n[inaudible]. Yes. This question would be,", "start": 162.34, "duration": 6.18}, {"text": "would play really well or yes, the campaign\nsays, Hey, um, we're going to make this attack", "start": 168.52, "duration": 5.26}, {"text": "against Biden and then the network goes, okay,\nlike we get it and then they helped create", "start": 173.78, "duration": 5.56}, {"text": "that opportunity. What a nightmare. I mean,\nwhat a farce. Yeah. It's, it's quite a disaster.", "start": 179.34, "duration": 6.35}, {"text": "And I want to share with you the perspective.\nIt's like I'm, I think like a lay person who", "start": 185.69, "duration": 4.28}, {"text": "happens to find themself on the presidential\ndebate stage being like, what the hell? Like", "start": 189.97, "duration": 4.21}, {"text": "why have you know what's happening? I've gotten\non this conference call.", "start": 194.18, "duration": 4.139}, {"text": "Yeah. So this is just not surprising. I mean,\nthe, how many problems are there with the", "start": 198.319, "duration": 4.75}, {"text": "debates that we've talked about? Problem number\none, the format just doesn't let us learn", "start": 203.069, "duration": 3.571}, {"text": "anything about what the candidates really\nwould do. Important policy questions are expected", "start": 206.64, "duration": 5.569}, {"text": "to be answered in 30 seconds. Uh, sometimes\nrebutted in 15 seconds. It's laughable and", "start": 212.209, "duration": 6.161}, {"text": "the problem is lot of people can sound okay\nin 30 seconds, but really no nothing in depth.", "start": 218.37, "duration": 6.69}, {"text": "So it's actually a disservice to figuring\nout who knows what they're talking about.", "start": 225.06, "duration": 3.09}, {"text": "Second problem, there are too many candidates\nthat will get solved soon. That's not really", "start": 228.15, "duration": 5.19}, {"text": "CNN or NBC fault that that's just a problem\nthat's going to be solved soon. Problem number", "start": 233.34, "duration": 4.81}, {"text": "three, the debates are, as Andrew Yang Assange\nrigged to set up candidates for attacks or", "start": 238.15, "duration": 6.4}, {"text": "kill shots at the expense of substantive debate.\nNumber four, as you know, I've talked about", "start": 244.55, "duration": 7.859}, {"text": "debates need to be public domain.", "start": 252.409, "duration": 1.401}, {"text": "Okay, we're picking the president or who is\ngoing to run for president. These cannot be", "start": 253.81, "duration": 6.379}, {"text": "for profit events to be monopolized by one\nnetwork. This hurts us as you know, we wanted", "start": 260.189, "duration": 4.971}, {"text": "to do commentary on the CNN debate. They shut\nus down on Youtube. They gave us a copyright", "start": 265.16, "duration": 4.289}, {"text": "strike, their VP of who knows what was attacking\nme on Twitter. So that's bad, but it also", "start": 269.449, "duration": 5.58}, {"text": "allows the networks to turn it into a boxing\nmatch effectively rather than an impo important", "start": 275.029, "duration": 7.84}, {"text": "public service. And this is not just the networks,\nobviously the networks are going to do it,", "start": 282.869, "duration": 4.281}, {"text": "but the DNC, the RNC, the commission on presidential\ndebates, they could all say we are not going", "start": 287.15, "duration": 6.2}, {"text": "to be complicit. We will insist on a format\nthat is actually better for figuring out who", "start": 293.35, "duration": 4.65}, {"text": "knows what and their positions on issues.\nWe are going to insist as a prerequisite that", "start": 298.0, "duration": 5.699}, {"text": "these be effectively public domain events\nlike the state of the Union address.", "start": 303.699, "duration": 4.9}, {"text": "So yeah, the networks will do what's best\nfor them and for ratings and for clips and", "start": 308.599, "duration": 3.961}, {"text": "we know that. But the DNC, RNC and commission\non presidential debates are also complicit", "start": 312.56, "duration": 4.879}, {"text": "in it and that needs to change. So love that\nAndrew Yang is just saying it the way it is,", "start": 317.439, "duration": 5.5}, {"text": "not surprising, it seemed pretty obvious just\nfrom watching the debates that this is what", "start": 322.939, "duration": 3.471}, {"text": "was going on. Uh, but be that as it is, um,\nthis is what we're dealing with and these", "start": 326.41, "duration": 5.589}, {"text": "are not events that really let us figure out\nwho would be best at solving issues for the", "start": 331.999, "duration": 5.6}, {"text": "country, who is most knowledgeable in any\nsort of depth beyond one or two talking points", "start": 337.599, "duration": 5.05}, {"text": "on any of these issues. And uh, it's been\na complete disservice to the democratic process", "start": 342.649, "duration": 5.6}, {"text": "as I've been telling you.", "start": 348.249, "duration": 74.07}]