[{"text": "This video has been a long time coming. I've hesitated to make this video because I feared that some of you would find it", "start": 0.03, "duration": 6.059}, {"text": "so flipping obvious that they wondered why I thought this would be of any interest to anyone. Does anyone really not know this stuff?", "start": 6.089, "duration": 5.28}, {"text": "Or others would find it so tremendously obscure that again they would be quite critical of the choice of subject matter.", "start": 11.369, "duration": 5.131}, {"text": "But in this video, which is sponsored by my friends at the Great Courses Plus (more of that later),", "start": 16.5, "duration": 4.889}, {"text": "I'm going to talk to you about muzzle brakes. [Particularly those on tanks.]", "start": 21.88, "duration": 2.78}, {"text": "Now I started making little plastic models of armoured fighting vehicles from World War Two when I was pretty tiny.", "start": 24.66, "duration": 5.74}, {"text": "I couldn't say for certain when I made my first kit, I'm pretty sure it was an Airfix kit.", "start": 30.4, "duration": 4.8}, {"text": "But I do remember making this kit when I was 8 years old.", "start": 35.219, "duration": 4.68}, {"text": "So this kit is of a Puma armored car. Now can you see that on the end of the barrel there, there is a thing.", "start": 39.899, "duration": 7.501}, {"text": "It's got holes in the side of it, so that you can see ... all the way through it.", "start": 47.44, "duration": 4.7}, {"text": "And it's a big bold thing on the end of the barrel and I didn't know what it was.", "start": 52.14, "duration": 4.139}, {"text": "I had no idea what it was and my eight-year-old self had that level of curiosity that", "start": 56.28, "duration": 4.799}, {"text": "made me think: I wonder what it is? How come some barrels have that on the end?", "start": 61.24, "duration": 4.54}, {"text": "But on the other hand I just sort of accepted it. ... That's the shape of the end of a barrel.", "start": 65.78, "duration": 5.14}, {"text": "But as the years went by and I made more and more kits,", "start": 70.92, "duration": 2.699}, {"text": "I saw that some had these funny things on the end of the barrels for which I had at the time no name, and others didn't.", "start": 73.619, "duration": 5.881}, {"text": "And I tried to spot a pattern, tried to understand what it was.", "start": 79.5, "duration": 3.54}, {"text": "So, is it that the small guns don't have them and big guns do? Well, here is a very small gun.", "start": 83.04, "duration": 4.84}, {"text": "This is a 37 mm anti-tank gun, which is going to come into focus eventually, there we go.", "start": 87.9, "duration": 4.379}, {"text": "And you can see that it's got no barrel [muzzle] brake. It's just got a tube with a hole in the end of it.", "start": 92.85, "duration": 4.919}, {"text": "And take this Jagdtiger for instance, or if you don't, well take this one.", "start": 98.5, "duration": 5.75}, {"text": "I think I made these when I was about 10 or 11.", "start": 104.25, "duration": 3.95}, {"text": "Anyway, this is an enormous German tank destroyer, with an enormous gun at the front,", "start": 108.5, "duration": 5.368}, {"text": "and as you can see there's no barrel [muzzle] brake.", "start": 113.868, "duration": 3.671}, {"text": "It's just, again if it comes into focus which it might if I put it in front of my face", "start": 117.54, "duration": 4.52}, {"text": "(this camera I think senses my face and ... focuses on faces if it can),", "start": 122.06, "duration": 4.98}, {"text": "so yeah, OK. See it's just got no barrel [muzzle] brake. It's just a big long tube.", "start": 127.04, "duration": 5.5}, {"text": "So how come some things like, for example, this Panther tank do have a barrel [muzzle] brake on the front and others don't?", "start": 132.54, "duration": 9.6}, {"text": "It's a mystery. Well, it was a mystery to me.", "start": 142.14, "duration": 2.64}, {"text": "And then, quite recently, I was talking to a tank commander on the Newcastle town moor where they were doing a military demonstration,", "start": 144.78, "duration": 9.5}, {"text": "and he was a Challenger tank commander, and I was talking to him and his ... crew (smashing bunch of lads)", "start": 154.28, "duration": 5.12}, {"text": "and I brought up the topic of muzzle brakes and he said something very interesting.", "start": 159.4, "duration": 5.42}, {"text": "He said, 'What's a muzzle brake?', and I thought right, OK, I'm making this video", "start": 164.82, "duration": 4.98}, {"text": "because if a tank commander doesn't know what a muzzle brake is", "start": 169.8, "duration": 4.5}, {"text": "then presumably there are quite a few people out there who don't know what the muzzle brake is or what they're for.", "start": 174.3, "duration": 3.0}, {"text": "And and then, you know, they might find this video interesting. Because I did eventually", "start": 177.36, "duration": 4.289}, {"text": "find out what a muzzle brake was. And how did I do this? Well something wonderful came along, and it was called the internet.", "start": 182.26, "duration": 6.74}, {"text": "I remember I was at university, it was the first time I had access to the internet", "start": 189.16, "duration": 3.649}, {"text": "and I thought, right I can ask this anything.", "start": 192.81, "duration": 2.61}, {"text": "And so I thought, what what's the sort of question I can ask the internet which I wouldn't be able to find out some other way?", "start": 195.61, "duration": 6.59}, {"text": "Got it. Is that guy smoking loads of cigarettes in the film Brazil, is that Terry Gilliam? And I found out yes, it is.", "start": 202.54, "duration": 7.46}, {"text": "So there you go. That was ... the biggest thing had been bothering me for years, and I'd finally ... put that one to rest.", "start": 210.1, "duration": 6.5}, {"text": "Yes, the guy in the film Brazil (which is excellent by the way you really should see it)", "start": 216.9, "duration": 3.029}, {"text": "smoking all the cigarettes on the stairs, that's Terry Gilliam the film's director. But then, shortly after that ... this was before Google", "start": 220.69, "duration": 7.309}, {"text": "oh yes, oh yes, I can remember a time before Google, I'm that old ...", "start": 228.0, "duration": 4.5}, {"text": "when I was able to eventually (using the power of the internet) to find out what these things are called and what they're for.", "start": 232.75, "duration": 5.95}, {"text": "It was difficult to search for something that you don't know the name of, but eventually I managed it.", "start": 238.7, "duration": 3.819}, {"text": "And I sort of solved the mystery. And just ... to point out some more of the depths of this mystery,", "start": 242.62, "duration": 7.49}, {"text": "think of ... the Sherman tank here for instance.", "start": 250.42, "duration": 3.48}, {"text": "This is a Sherman, it's an American tank.", "start": 253.9, "duration": 2.0}, {"text": "And it has a 75 mm multipurpose gun with no barrel [muzzle] brake. You see, no barrel [muzzle] brake, just a smooth tube.", "start": 256.02, "duration": 7.42}, {"text": "And that fired both high explosive and armour-piercing and they had a very good", "start": 263.74, "duration": 3.98}, {"text": "high explosive shell, so they thought well let's put a similar gun in the Churchill. So they did, and here is the British equivalent.", "start": 267.96, "duration": 6.32}, {"text": "It is a Churchill it's got a very similar gun that fired the same ammunition, and it does have a barrel [muzzle] brake with the holes in the side.", "start": 274.29, "duration": 6.089}, {"text": "So sometimes even the same gun firing the same ammunition can ... have one. But wait a minute, this", "start": 281.56, "duration": 5.72}, {"text": "doesn't go by tank either because this is another Churchill. This one is a Churchill with a six pounder gun in the turret. [No muzzle brake!]", "start": 287.68, "duration": 6.47}, {"text": "They carried on, the British carried on, putting six pounders in about one in five", "start": 294.31, "duration": 3.86}, {"text": "Churchills right the way to the end of the war because the six pounder had an enormously superior", "start": 298.27, "duration": 4.399}, {"text": "armour-piercing capability over the American 75. So it was worth having some", "start": 302.86, "duration": 4.56}, {"text": "Churchills about the place with that gun. But wait a minute, this is a Churchill [mark] eight and", "start": 308.06, "duration": 5.36}, {"text": "this has a short stubby 90 mm [95?] howitzer in the turret.This is for firing smoke and high-explosive principally,", "start": 314.08, "duration": 7.19}, {"text": "and that's not a barrel [muzzle] brake. No, it may look a bit like a barrel [muzzle] brake,", "start": 321.91, "duration": 4.64}, {"text": "there's a bulge on the end of the barrel, but that's actually just a counterweight to counterweight the", "start": 326.55, "duration": 4.47}, {"text": "weight of the breech to balance the gun out a bit. It doesn't have holes in the side, that's not a barrel [muzzle] brake.", "start": 331.2, "duration": 4.94}, {"text": "So there you can see, I was mystified. Some guns do, some guns don't, what's it all about?", "start": 336.2, "duration": 4.479}, {"text": "Right.", "start": 341.44, "duration": 1.2}, {"text": "So. What are the functions of a barrel [muzzle] brake?", "start": 342.64, "duration": 2.809}, {"text": "Muzzle brake, a muzzle brake is a better, more accurate term for them.", "start": 346.09, "duration": 3.049}, {"text": "So the muzzle is ... the front bit of the gun.", "start": 349.14, "duration": 3.16}, {"text": "So, a barrel [muzzle] brake has two main functions.", "start": 352.54, "duration": 6.04}, {"text": "One of them is to do with smoke management. You see when you fire a gun all that smoke,", "start": 358.66, "duration": 6.23}, {"text": "all the impurities of the propellant that actually shoves the shell out the front of the barrel,", "start": 365.29, "duration": 5.51}, {"text": "all that then follows the shell and goes out in front of you if you just fire down a straight tube.", "start": 370.93, "duration": 5.9}, {"text": "So, you see your target, you're ah, there he is, brilliant,", "start": 377.32, "duration": 3.14}, {"text": "OK put the crosshairs on it and bang, and it disappears, because ... you've just put loads of smoke in front of yourself.", "start": 380.46, "duration": 5.519}, {"text": "You can't see so well, so you're looking through the sight and checking with the binoculars.", "start": 385.98, "duration": 4.29}, {"text": "And where's it gone? Where's it gone? And, yeah,", "start": 390.27, "duration": 2.33}, {"text": "most of the time the smoke wasn't so bad and in tanks you normally could get off a useful second shot.", "start": 392.64, "duration": 5.76}, {"text": "But sometime it was a problem, and shooting out loads of smoke in front of a gun obscures the target.", "start": 398.4, "duration": 5.999}, {"text": "Whereas, the barrel [muzzle] brake channels the smoke sideways, giving you a much clearer view ahead of you.", "start": 404.399, "duration": 6.51}, {"text": "So that's one major advantage of the barrel [muzzle] brake (muzzle brake, keep saying barrel brake)", "start": 410.91, "duration": 6.029}, {"text": "And if you've got artillery that point their guns straight into the sky, then you might want to manage your smoke", "start": 417.52, "duration": 7.429}, {"text": "so it goes sideways so you don't give away your position to the enemy spotters,", "start": 424.949, "duration": 3.75}, {"text": "who may be a very, very long way away,", "start": 428.699, "duration": 1.811}, {"text": "who just see where little puffs of smoke way over there", "start": 430.51, "duration": 3.349}, {"text": "against that dark forest or something and they can pick it out. ... So perhaps you might give your position away", "start": 434.05, "duration": 4.61}, {"text": "if you've not got a barrel [muzzle] brake. So smoke management is one of the reasons.", "start": 438.66, "duration": 4.84}, {"text": "The other reason is recoil.", "start": 443.6, "duration": 2.3}, {"text": "You see, if you've got a tube then everything that goes that way up the tube (the shell and all the blast of the gas)", "start": 445.96, "duration": 7.88}, {"text": "creates an equal and opposite reaction (Newtonian physics) and you get recoil.", "start": 454.54, "duration": 4.4}, {"text": "So as you fire the gun it goes \"kaboom\" back into the turret of ... whatever the vehicle is that you're in.", "start": 459.58, "duration": 7.02}, {"text": "So if you've got quite a small turret, and you've got quite a powerful gun", "start": 466.6, "duration": 4.609}, {"text": "that's got a heck of a kick in it,", "start": 471.21, "duration": 1.54}, {"text": "then what will happen is that the breech (if you don't have a ... muzzle brake)", "start": 472.75, "duration": 4.15}, {"text": "it'll shoot backwards and smack into the back of the turret.", "start": 477.3, "duration": 4.3}, {"text": "Obviously ... before they built the turret they worked out how long the recoil was and then built the turret accordingly.", "start": 481.66, "duration": 5.419}, {"text": "But imagine you've got a tank of a certain ... size turret, and you can't make the turret any bigger,", "start": 487.08, "duration": 4.649}, {"text": "if the recoil is too great you won't be able to fit that gun in the turret.", "start": 492.37, "duration": 4.07}, {"text": "But, if you put a muzzle brake on the end, then that'll lower the recoil,", "start": 496.44, "duration": 4.3}, {"text": "the breech won't shoot backwards quite so far, and maybe you can fit that gun into the turret of that vehicle.", "start": 500.74, "duration": 6.16}, {"text": "So, that's another reason. You lower recoil and lowering recoil is good for other reasons.", "start": 507.3, "duration": 5.549}, {"text": "It's good for the crew comfort for instance. The whole vehicle doesn't rock back onto its ...", "start": 513.4, "duration": 4.7}, {"text": "suspension quite so violently.", "start": 520.2, "duration": 2.4}, {"text": "And perhaps your second shot is a little bit more accurate", "start": 522.849, "duration": 2.179}, {"text": "because you haven't shaken up the whole vehicle and thrown out the alignment of the sights quite so much, so you don't have to", "start": 525.16, "duration": 5.84}, {"text": "compensate and re-lay the gun. So it's good for accuracy and possibly, very slightly, good for for rate of fire.", "start": 531.58, "duration": 6.599}, {"text": "It's good for vision of the target.", "start": 538.18, "duration": 1.89}, {"text": "So it makes the gun better.", "start": 540.07, "duration": 2.13}, {"text": "And here's how it works. The furious riot of expanding gas and smoke that causes the shell to hurtle up the barrel is", "start": 542.3, "duration": 6.649}, {"text": "set free just as the back of the shell leaves the end of the barrel,", "start": 549.08, "duration": 4.64}, {"text": "but is still within the muzzle brake. Then the gas which is set free", "start": 553.72, "duration": 4.649}, {"text": "which is shooting forward at tremendous speed hits the sides of the muzzle brake and", "start": 558.37, "duration": 6.21}, {"text": "pushes against them and is channelled outwards and", "start": 565.07, "duration": 3.65}, {"text": "transfers huge amount of forwards force on the end of the barrel, counteracting the recoil of the gun.", "start": 569.48, "duration": 6.649}, {"text": "So, whereas if you have no muzzle brake everything just flies out the front,", "start": 577.2, "duration": 5.109}, {"text": "with this everything is channelled sideways. The smoke goes sideways and a lot of the force", "start": 582.59, "duration": 6.049}, {"text": "pushes forwards on the end of the barrel causing lower recoil.", "start": 588.89, "duration": 4.91}, {"text": "Well, the amount of recoil is the same, but it's counteracting that recoil.", "start": 593.96, "duration": 3.44}, {"text": "So that means that the gun doesn't fly backwards so violently and you can fit a bigger gun into a smaller turret.", "start": 597.41, "duration": 6.979}, {"text": "And you don't get the violent crash that all the crew has to feel and so that's better then.", "start": 604.39, "duration": 7.41}, {"text": "Or is it? Right well, I'll talk about whether it's better or not in a moment.", "start": 612.44, "duration": 5.09}, {"text": "But first I should say something about my kind sponsors.", "start": 617.53, "duration": 2.429}, {"text": "Yes, the Great Courses Plus. The Great Courses Plus is a huge website. You can visit it and", "start": 620.0, "duration": 5.239}, {"text": "there you can see on it loads and loads of lecture courses.", "start": 625.67, "duration": 3.589}, {"text": "I found a very interesting one for instance that's on palaeontology.", "start": 629.48, "duration": 3.349}, {"text": "Now I have a degree in archaeology and a lot of people go: 'Oh wow, archaeology.", "start": 632.83, "duration": 4.289}, {"text": "I find that really interesting, so tell me about the stegosaurus then.' Ah, no, that's palaeontology.", "start": 637.12, "duration": 5.309}, {"text": "I did archaeology which is digging up the remains of the human past. But anyway, I suppose it's related and", "start": 642.43, "duration": 6.9}, {"text": "we all like dinosaurs, don't we? Only this course is a bit more serious.", "start": 649.33, "duration": 3.239}, {"text": "It's not all about you know the famous stuff like the brontosaurus and (... did the brontosaurus even exist?)", "start": 652.57, "duration": 5.46}, {"text": "and the stegosaurus and the triceratops and the tyrannosaurus rex and all those ones.", "start": 658.22, "duration": 4.849}, {"text": "Instead, it's a bit more academic (a bit more interesting I think for it)", "start": 663.07, "duration": 2.73}, {"text": "in that it looks about how fossils are formed, how they are discovered", "start": 665.86, "duration": 3.26}, {"text": "and how they are interpreted and all that sort of thing. It goes through all the important ages, geological ages,", "start": 669.12, "duration": 6.38}, {"text": "many of which precede the tyrannosaurus rex by quite a lot of millions of years.", "start": 675.68, "duration": 5.04}, {"text": "Anyway, I'm going to be looking at that one.", "start": 680.72, "duration": 2.18}, {"text": "But you, of course, can pick from loads and loads of courses. And for one month you can do so absolutely for free if", "start": 682.94, "duration": 7.42}, {"text": "you type in this address, which is appearing on your screen now.", "start": 690.52, "duration": 3.86}, {"text": "www.TheGreatCoursesPlus.com/Lindybeige then that will take you to an offer.", "start": 695.52, "duration": 5.27}, {"text": "It's actually much easier by the way to click on the link which I'll put in the description so short click ...", "start": 700.92, "duration": 4.01}, {"text": "Short link and you just click on it and voom you're there. Much easier.", "start": 705.27, "duration": 2.599}, {"text": "And you will find that you can get one free month looking at any of the courses you care to have a look at.", "start": 708.06, "duration": 7.22}, {"text": "Typically there are about 24 lectures in a course, and each one is about half an hour long, so it's 12 hours per course of facts.", "start": 715.92, "duration": 7.78}, {"text": "And, if you don't like it, at the end of the month you can decide it's not for you,", "start": 724.5, "duration": 4.099}, {"text": "all you have to do is is cancel and then you won't owe a bean.", "start": 728.6, "duration": 4.08}, {"text": "So there you go. Why not go to the Great Courses Plus, give them a look and ... I hope you like it.", "start": 733.11, "duration": 6.09}, {"text": "Anyway back to muzzle brakes. Now, you may think: 'Oh well, muzzle brakes are great. They manage the smoke better, and they lower the recoil.", "start": 739.2, "duration": 7.34}, {"text": "That's just good, good so all guns clearly will have muzzle brakes.'", "start": 746.54, "duration": 5.039}, {"text": "Well, no, there are several reasons not to have a muzzle brake. If you look at modern Main Battle Tanks, as", "start": 751.58, "duration": 4.89}, {"text": "they're sometimes called, the Challengers, the Leopards and the Abrams and so forth, none of them has a muzzle brake.", "start": 756.47, "duration": 6.029}, {"text": "The reason for this is that they use kinds of ammunition that muzzle brakes interfere with.", "start": 762.9, "duration": 6.18}, {"text": "Now, this is actually is a problem that the British had during World War Two with the Firefly. Now, the Firefly was stupendously powerful", "start": 769.34, "duration": 6.86}, {"text": "(I've mentioned this before), it had an excellent 17 pounder gun.", "start": 776.76, "duration": 2.9}, {"text": "But the British developed something called discarding sabot ammunition which was", "start": 780.87, "duration": 6.03}, {"text": "amazingly powerful, and will put a hole right the way through a Tiger.", "start": 787.83, "duration": 3.38}, {"text": "But the way it worked is it had an outer jacket and an inner core of some ... very, very hard material like tungsten.", "start": 792.03, "duration": 6.939}, {"text": "And because the outer jacket made the whole shell bigger to fit into the barrel,", "start": 799.1, "duration": 6.58}, {"text": "then you got loads of gas pushing against that large", "start": 805.68, "duration": 3.54}, {"text": "cross-sectional area on the back of the shell giving a huge push down the barrel.", "start": 809.26, "duration": 4.08}, {"text": "And then when it was set free at the end, the jacket on the outside would break away,", "start": 813.34, "duration": 4.78}, {"text": "lowering the air resistance, and the", "start": 818.32, "duration": 2.52}, {"text": "the tiny thin shell that was in there would be flying at stupendous speed off", "start": 821.419, "duration": 4.88}, {"text": "into and perhaps through its target. Great, except that the muzzle brake", "start": 826.999, "duration": 5.299}, {"text": "could sometimes interfere, so as the discarding sabot started to break up immediately it left the end of the barrel,", "start": 833.2, "duration": 5.2}, {"text": "it would sometimes collide with bits of the muzzle brake, which might just knock the the inner", "start": 838.74, "duration": 4.24}, {"text": "core slightly interfering with its accuracy. At short ranges it wasn't a problem, but at very long ranges sometimes with the discarding sabot", "start": 843.009, "duration": 7.349}, {"text": "they had only a 50% chance of hitting, which isn't terribly good by the standards of the day. ...", "start": 850.489, "duration": 5.21}, {"text": "(They would normally expect something like a 98% shot hit chance, so, yeah, 50% is really bad.)", "start": 856.819, "duration": 6.681}, {"text": "But modern tanks use loads of discarding sabot rounds, they also use folding fin.", "start": 863.5, "duration": 5.36}, {"text": "So you imagine it, you've got the fins which fold into the shell as it's travelling up the barrel,", "start": 868.86, "duration": 7.12}, {"text": "and then when it's set free at the end, the the fins ... fly out and just like a", "start": 875.98, "duration": 3.66}, {"text": "playing dart when you're playing darts in the pub, guide the shell onto its target.", "start": 879.8, "duration": 6.46}, {"text": "And again ... those fins and the modern discarding sabot the ... muzzle brake gets in the way.", "start": 886.26, "duration": 7.86}, {"text": "So that's one reason you don't want it.", "start": 894.12, "duration": 2.46}, {"text": "Another one is it makes the gun longer and heavier and more expensive, and they're all bad.", "start": 896.58, "duration": 5.1}, {"text": "Now why would you want a barrel to be even longer? You see, length of barrel is a problem. Let's go back to the Panther.", "start": 902.2, "duration": 6.538}, {"text": "The Panthers barrel as you can see sticks out in front of the tank quite a way.", "start": 909.28, "duration": 3.36}, {"text": "And if you turn it sideways it sticks out an awfully long way.", "start": 912.64, "duration": 3.72}, {"text": "So if you want to camouflage your ... Panther by sticking it in a wood well, that's great.", "start": 916.36, "duration": 5.459}, {"text": "But then when you try to turn your turret in the wood, you're almost certain to hit a tree and so you can't actually point", "start": 921.819, "duration": 5.309}, {"text": "the gun the way you want to point it. This was a big problem if you're a Panther.", "start": 927.129, "duration": 2.571}, {"text": "But if you're a Churchill, not a problem because the Churchill barrel", "start": 929.84, "duration": 3.86}, {"text": "didn't actually stick out over the front of the tank. So you could just come ... into the wood,", "start": 933.7, "duration": 3.84}, {"text": "push over a tree and turn your turret wherever you flipping well want it ... and shoot that way.", "start": 937.64, "duration": 4.88}, {"text": "Great tanks Churchills, I think I might make a video about just how great they were.", "start": 943.06, "duration": 3.58}, {"text": "Possibly the best tank of the war, and that's not just because they're my favourite.", "start": 946.67, "duration": 2.969}, {"text": "Now another reason you might ... not want a barrel to be long is that if you're in something like this,", "start": 950.879, "duration": 6.77}, {"text": "which can't even turn its turret at all because it has no turret,", "start": 957.649, "duration": 3.051}, {"text": "you need to get to the battlefield. And the battlefield was in 1944, let's say, in rural France and", "start": 961.22, "duration": 6.58}, {"text": "you need to get across a river which meant that you have to go over the bridge, and the only", "start": 968.339, "duration": 3.26}, {"text": "load-bearing bridge in the area would be not in the middle of the country, it would be in a town or in a village.", "start": 971.699, "duration": 5.48}, {"text": "So if you go into a rural ... village in 1944 France, a village that was laid out", "start": 977.399, "duration": 7.101}, {"text": "with roads that were wide enough for a cart (because that's what they were using when they laid the village out),", "start": 985.41, "duration": 5.27}, {"text": "well when you get to a corner and you try to turn that corner ...", "start": 990.81, "duration": 3.29}, {"text": "you'll probably find that there's a telegraph pole, a lamppost or indeed a building", "start": 994.199, "duration": 4.55}, {"text": "that prevents you from turning the corner because this is a very long", "start": 998.819, "duration": 3.2}, {"text": "vehicle with a very long barrel sticking out the front of it.", "start": 1002.3, "duration": 2.359}, {"text": "So you then have to halt and maybe demolish a building before you can get round the corner, delays,", "start": 1004.66, "duration": 4.799}, {"text": "and that's very inconvenient.", "start": 1009.74, "duration": 1.849}, {"text": "So anything that makes your barrel even longer is not good.", "start": 1011.589, "duration": 3.211}, {"text": "Now you'll notice that this has a very long ... very high velocity", "start": 1014.8, "duration": 3.96}, {"text": "anti-tank gun on the front of it [Panzerjager IV L/70],", "start": 1019.339, "duration": 2.33}, {"text": "and yet it has no barrel [muzzle] brake.", "start": 1022.339, "duration": 2.0}, {"text": "The main reason they didn't have a barrel [muzzle] brake (in fact the early versions of this did have a ...", "start": 1025.1, "duration": 4.28}, {"text": "muzzle brake, but they then removed it) because this is a very low", "start": 1030.199, "duration": 5.239}, {"text": "vehicle and when it's gun is pointing straight forwards, which it is not at the moment because I've modelled it", "start": 1036.199, "duration": 5.119}, {"text": "with it in transit mode, you can see the little thing ... holding the barrel there.", "start": 1041.48, "duration": 5.929}, {"text": "It was a part in the kit, and I wanted to use it. I was young.", "start": 1047.409, "duration": 2.34}, {"text": "But anyway, the barrel is only about three feet off the ground which means that when you fire it,", "start": 1050.299, "duration": 5.239}, {"text": "it was so close to the ground that it tended to throw up a huge amount of dust which blinded the crew actually worse than", "start": 1056.33, "duration": 7.43}, {"text": "having no barrel [muzzle] brake. So they got rid of the barrel [muzzle] brake on that because the gun was so low.", "start": 1064.13, "duration": 4.599}, {"text": "Now this side blast. This side blast could be really quite substantial.", "start": 1069.73, "duration": 4.22}, {"text": "And to give an example, I'm going to read you a bit from a book.", "start": 1075.0, "duration": 4.26}, {"text": "Now, just before I do that, you have to understand something. This is an ordinary Sherman.", "start": 1079.26, "duration": 4.76}, {"text": "Now the narrator of the book that I'm about to read from, Ken Tout, it's called Tank!,", "start": 1084.02, "duration": 4.54}, {"text": "he was in one of these and his tank was called Stoney Stratford. This is an ordinary Sherman, no barrel [muzzle] brake, 75 mm gun.", "start": 1088.56, "duration": 6.34}, {"text": "But he called for Charlie tank. Charlie tank was their code name for the Firefly. The Firefly, enormously powerful gun with a", "start": 1095.26, "duration": 7.699}, {"text": "barrel [muzzle] brake. So, with that in mind, let's see how things went.", "start": 1103.12, "duration": 4.339}, {"text": "\"The invisible 88s are probably SPs firing hull down from behind the Robertmesnil [Robert Mesnil] ridge.", "start": 1109.18, "duration": 5.929}, {"text": "Only inches of their flat steel turrets need to protrude above the ridge a thousand yards or more away, and", "start": 1115.72, "duration": 5.81}, {"text": "behind the hedges their shapes merge", "start": 1121.69, "duration": 1.79}, {"text": "so that only the flashes of their guns will betray them. I fire again and again at remembered flash points. Other guns alongside and", "start": 1123.48, "duration": 6.719}, {"text": "behind me are sending tracer arrows into that same area of confused hedgerows.", "start": 1130.2, "duration": 4.0}, {"text": "Keith [on intercom]: 'Gunner, cease fire.'", "start": 1134.7, "duration": 1.5}, {"text": "He switches to the A set.", "start": 1136.29, "duration": 1.36}, {"text": "'Hello Roger three Baker, can our Charlie move over and lend some weight, scare the nasties if they're still there. Three baker over.'", "start": 1137.65, "duration": 5.599}, {"text": "'Hello, three Baker. Good idea - over to you.'", "start": 1143.53, "duration": 2.75}, {"text": "'Hello Roger three Charlie, you heard, take your line from Baker, three Charlie over'", "start": 1146.28, "duration": 4.52}, {"text": "'Charlie, understood, on my way, off'", "start": 1151.1, "duration": 1.5}, {"text": "Keith: 'Gunner use coax and brass up those hedges to give Charlie his target.'", "start": 1152.62, "duration": 4.48}, {"text": "I fire short bursts into the skyline. A shock blast sends Stoney Stratford keeling over to the left. A breath of torrid air,", "start": 1157.2, "duration": 7.62}, {"text": "a deafening detonation, icy fingers of death claw at my veins.", "start": 1164.98, "duration": 3.38}, {"text": "I start my escape leap.", "start": 1168.36, "duration": 2.0}, {"text": "Then I realized that we've not been hit, except for the killer blast from our own Charlie's 17-pounder muzzle.", "start": 1170.47, "duration": 7.43}, {"text": "He's fetched up too near to us and is almost as much of a danger to us as are the Germans.", "start": 1178.26, "duration": 4.29}, {"text": "With the sensations of his first shot still rocking and terrorizing us, his AP shot smashes into the hedgerow,", "start": 1182.68, "duration": 6.109}, {"text": "or something behind it, and opens up a great ragged hole of fire.", "start": 1189.07, "duration": 3.169}, {"text": "He goes on firing as quickly as his loader can load. Half a dozen shots spaced along the offending skyline.", "start": 1192.24, "duration": 5.31}, {"text": "Nothing fires back.", "start": 1198.13, "duration": 2.0}, {"text": "'Roger three Charlie, cease fire. Resume your normal position, three Charlie, over.'", "start": 1200.14, "duration": 4.98}, {"text": "'Three Charlie, over, okay, off.'\"", "start": 1205.12, "duration": 3.22}, {"text": "So, the side blast from a big gun can be horrendous. Now if ... the muzzle of a gun were here,", "start": 1208.36, "duration": 9.319}, {"text": "pointing that way and had a muzzle brake on it and the gun fired,", "start": 1218.2, "duration": 2.75}, {"text": "it would it would just take my head clean off. It would blow my head clean off my shoulders.", "start": 1221.23, "duration": 4.91}, {"text": "I was talking [e-mailing] to a Canadian tanker in the modern army", "start": 1226.14, "duration": 3.76}, {"text": "and he said that he was on an exercise when a largish tank gun that did have a barrel [muzzle] brake fired.", "start": 1229.919, "duration": 6.03}, {"text": "He wasn't standing right next to the tank.", "start": 1235.99, "duration": 1.79}, {"text": "He was standing behind the tank and quite some distance away from it, but he said that even there,", "start": 1237.78, "duration": 4.829}, {"text": "he felt as though a giant had taken a massive pillow and hit him", "start": 1243.37, "duration": 4.099}, {"text": "really, really hard backwards. The blast from big guns is very substantial,", "start": 1248.169, "duration": 5.731}, {"text": "and if you've got a muzzle brake then that blast, rather than being directed at your enemies,", "start": 1254.1, "duration": 4.379}, {"text": "is directed sideways where a lot of your friends might be. And if you're in the enclosed turret of a tank you can't be completely certain", "start": 1258.82, "duration": 6.38}, {"text": "where all your friends are. I remember reading an account on the Russian front of", "start": 1265.21, "duration": 4.55}, {"text": "a German SP that was just about to be overrun by Russians,", "start": 1270.37, "duration": 3.949}, {"text": "they were running at it from the front, and for some reason they couldn't get a", "start": 1274.32, "duration": 3.03}, {"text": "machine gun to bear on them and so they did the only thing which was left open to them,", "start": 1277.78, "duration": 4.25}, {"text": "they just fired the main armament. They knew they wouldn't hit anyone.", "start": 1282.03, "duration": 2.729}, {"text": "The shell swooshed past all the Russians, hitting none of them.", "start": 1284.9, "duration": 2.559}, {"text": "But the blast did the job. They were able to get away because, in the words of the military report written at the time,", "start": 1287.46, "duration": 6.15}, {"text": "'the enemy were in no condition to proceed'. The blast just knocked them all out.", "start": 1294.04, "duration": 5.599}, {"text": "So the side blast from a ... substantial thing like this is not something to take lightly.", "start": 1300.07, "duration": 10.43}, {"text": "And that's one reason that you don't necessarily put a barrel [muzzle] brake on a gun if you can get away with not doing so.", "start": 1310.57, "duration": 5.96}, {"text": "So, of course the smoke going sideways can of course blind all the guys next to you as well. [The noise as heard by the firer is a lot louder too with a muzzle brake.]", "start": 1317.83, "duration": 4.729}, {"text": "So it's a bit of a mixed bag, a bit of a mixed blessing perhaps the smoke going sideways.", "start": 1322.559, "duration": 6.48}, {"text": "So, ... muzzle brakes are not necessarily...", "start": 1329.14, "duration": 3.3}, {"text": "(muzzle brakes, it sounds like a Jewish congratulation: \"Ah! Muzzle brakes!\"), anyway, ...", "start": 1332.62, "duration": 6.56}, {"text": "they're not necessarily good. And it seems that if people could get away without putting one on, they did.", "start": 1339.97, "duration": 5.809}, {"text": "Bye.", "start": 1346.51, "duration": 2.0}]