[{"text": "This video was sponsored by Blue Apron,  a meal delivery service. Sign up using the link in the description", "start": 0.03, "duration": 4.74}, {"text": "and I'll tell you more about it at the end of the video.", "start": 4.77, "duration": 2.0}, {"text": "Professor Plum: \"There's been a murder!\";'+", "start": 16.02, "duration": 1.32}, {"text": "*Music sting, gasps*", "start": 17.34, "duration": 1.2}, {"text": "Mrs. Peacock: \"Oh, he's dead, he is.\"", "start": 18.74, "duration": 1.52}, {"text": "Professor Plum: \"It's a classic game of Clue.\"", "start": 20.26, "duration": 1.54}, {"text": "Professor Plum: \"Who done it,\"", "start": 21.8, "duration": 0.7}, {"text": "Professor Plum: \"Where they done it,\"", "start": 22.5, "duration": 0.74}, {"text": "Professor Plum: \"And with which weapon they, uh... done it with.\"", "start": 23.24, "duration": 1.96}, {"text": "Colonel Mustard: \"I say it was in the kitchen with the wrench by...\"", "start": 25.2, "duration": 2.72}, {"text": "Colonel Mustard: \"Miss Scarlet!\"", "start": 27.92, "duration": 1.14}, {"text": "Miss Scarlet: \"*Gasp!* He did it in the library...\"", "start": 29.1, "duration": 2.36}, {"text": "*Gasp!*\nMiss Scarlet: \"With a bloody lead pipe!\"", "start": 31.46, "duration": 1.52}, {"text": "Mr Boddy: \"Knife. Knife.\"\nMiss Scarlet: \"Oh. Right\"\n*Clock chimes*", "start": 32.98, "duration": 1.78}, {"text": "Miss Scarlet: \"The killer is Mr. Green!\"\n*Lightning, dramatic music, super spooky*", "start": 34.76, "duration": 2.64}, {"text": "Colonel Mustard: \"Well, it could've been someone else.\"", "start": 37.4, "duration": 1.78}, {"text": "Announcer: \"The game of Clue!\"", "start": 39.18, "duration": 1.3}, {"text": "Ian: Oh, man. What a classic.", "start": 40.5, "duration": 2.28}, {"text": "Ian: Clue, known as Cluedo outside of the States,", "start": 42.84, "duration": 2.5}, {"text": "Ian: Is a mystery murder board game originally published in 1949.", "start": 45.34, "duration": 3.84}, {"text": "Ian: Nowadays, the game is owned and published by Hasbro", "start": 49.24, "duration": 2.96}, {"text": "Ian: Who publishes other board game classics like", "start": 52.2, "duration": 2.36}, {"text": "Ian: Battleshipdo and Monopolydo.", "start": 54.66, "duration": 2.92}, {"text": "Ian: Clue has been around for ages and has tons of iterations and spinoffs, including but not limited to,", "start": 57.58, "duration": 5.72}, {"text": "Ian: A book series, a VHS game that I'm definitely checking out later,", "start": 63.3, "duration": 4.36}, {"text": "Ian: And of course the cult classic film that's actually a pretty good movie.", "start": 67.66, "duration": 3.62}, {"text": "Ian: Today, though, we're gathered to take a look at 1998's Clue: Murder at Boddy Mansion.\n*Thunder roars*", "start": 71.28, "duration": 5.62}, {"text": "*Spooky scary music*", "start": 76.9, "duration": 16.7}, {"text": "*More spooky scary music*", "start": 94.64, "duration": 7.96}, {"text": "Ian: That was so cool! I'm into it!", "start": 102.62, "duration": 2.6}, {"text": "Ian: If you've never played the Clue board game before, let me go over the basics.", "start": 105.22, "duration": 3.5}, {"text": "Ian: You assume the role of one of six characters:", "start": 108.72, "duration": 2.46}, {"text": "Ian: Miss Scarlet, Colonel Mustard, Mrs. White, Mr. (Rev.) Green, Mrs. Peacock or Professor Plumbuh.", "start": 111.18, "duration": 6.02}, {"text": "Ian: They've all shown up at the house of Mr. Boddy, who is then murdered!\n*Dramatic music*", "start": 117.2, "duration": 5.5}, {"text": "Ian: Each of the six is a suspect in the murder and our goal is to find out...", "start": 122.7, "duration": 3.68}, {"text": "Ian: Who committed the crime, with what weapon the crime was committed and in which room.", "start": 126.38, "duration": 4.54}, {"text": "Ian: Now, a skilled detective would do things like examine the body of Mr. Boddy or maybe look for possible motives.", "start": 130.92, "duration": 6.96}, {"text": "Ian: But since none of us are skilled detectives, we immediately proceed to drag each other into various rooms of the house...", "start": 137.88, "duration": 6.16}, {"text": "Ian: And scream random accusations at each other.", "start": 144.04, "duration": 2.78}, {"text": "Ian: You see, each character, room and weapon has a card.", "start": 146.82, "duration": 3.0}, {"text": "Ian: One of each is randomly placed inside a sealed envelope.", "start": 149.9, "duration": 3.26}, {"text": "Ian: This represents the murderer, the weapon, and the location.", "start": 153.16, "duration": 3.1}, {"text": "Ian: The rest of the cards are dealt among the players. If you're holding, for instance, the lead pipe card,", "start": 156.26, "duration": 4.78}, {"text": "Ian: You know that it's not the murder weapon.", "start": 161.04, "duration": 1.52}, {"text": "Ian: So you venture to a room that you don't have a card for,", "start": 162.98, "duration": 2.48}, {"text": "Ian: accuse a person you don't have a card for of murder,", "start": 165.66, "duration": 3.26}, {"text": "Ian: by way of a weapon that you don't have a card for.", "start": 168.92, "duration": 2.0}, {"text": "Ian: If someone has one of those cards, you'll get to see it privately", "start": 171.42, "duration": 2.72}, {"text": "Ian: and then you know not to guess that card again.", "start": 174.28, "duration": 1.92}, {"text": "Ian: The first person to find the correct combination of the three cards is the winner.", "start": 176.46, "duration": 3.6}, {"text": "Ian: It's not really about finding clues at all,", "start": 180.48, "duration": 2.26}, {"text": "Ian: but I guess \"Process of Eliminationdo \" just isn't that great of a board game title.", "start": 182.82, "duration": 4.54}, {"text": "Announcer: \"Professor Plum - it is your turn.\"", "start": 187.66, "duration": 3.32}, {"text": "Announcer: \"Please roll the die.\"\n*dice rolling sound*", "start": 191.16, "duration": 2.32}, {"text": "Ian: Murder at Body Mansion is probably the best version of Clue that I've ever played.", "start": 194.2, "duration": 4.54}, {"text": "Ian: Well, I think I've only ever played the board game before,", "start": 198.74, "duration": 2.48}, {"text": "Ian: so maybe that's not /too/ impressive of a claim,", "start": 201.22, "duration": 2.72}, {"text": "Ian: but this game is really, really good, assuming you enjoy the general mechanics of the game Clue.", "start": 203.94, "duration": 4.8}, {"text": "*thunder crashing, dramatic music*", "start": 209.0, "duration": 5.12}, {"text": "Ian: Each time someone makes an accusation, you  get to watch a creepy cutscene of...", "start": 214.84, "duration": 4.32}, {"text": "Ian: MURDER!\n*thunder and dramatic music*", "start": 219.4, "duration": 3.82}, {"text": "Ian: I think out of everyone, the cutscenes featuring Mrs. White are the creepiest.", "start": 223.22, "duration": 4.22}, {"text": "Ian: These would have really scared me when I was younger, I think. They're very unsettling at times.", "start": 227.44, "duration": 4.5}, {"text": "Ian: Now I don't know much about the murder victim in this game, Mr. Body.", "start": 231.94, "duration": 3.42}, {"text": "Ian: I can't say whether he was a good or bad person;", "start": 235.36, "duration": 2.86}, {"text": "Ian: If he had a Mac or a PC;", "start": 238.32, "duration": 1.9}, {"text": "Ian: If he pronounced it \"GIF\" or \"JIF\" -", "start": 240.22, "duration": 2.18}, {"text": "Ian: But what I do know is that his house is freakin' stupid.", "start": 242.4, "duration": 3.32}, {"text": "Ian: Look at this place; there are hallways everywhere, no two rooms are connected except for two secret passageways!", "start": 245.72, "duration": 5.94}, {"text": "Ian: Which I recognize are cool, he gets some style points there.", "start": 251.66, "duration": 2.7}, {"text": "Ian: But it's like he took a cool-looking house and said, \"You know, this place sure could use a ton of random hallways leading to windows!\"", "start": 254.36, "duration": 6.38}, {"text": "Ian: \"Wouldn't that be nice?\"", "start": 260.74, "duration": 1.52}, {"text": "Ian: He does have excellent taste in music, though.", "start": 262.44, "duration": 2.56}, {"text": "Ian: The soundtrack is amazing, and the clicking sound effects are extremely satisfying.", "start": 265.0, "duration": 4.72}, {"text": "*extremely satisfying clicking*", "start": 269.96, "duration": 3.84}, {"text": "Ian: The sound and visuals are what really sell this game for me.", "start": 273.8, "duration": 3.12}, {"text": "Ian: You can even interact with the environment a bit and wander around the rooms when it's your turn.", "start": 276.92, "duration": 4.16}, {"text": "Ian: Uh-oh, it looks like Ms. Scarlet might have wandered a bit /too/ far and ended up outside of the house,", "start": 281.72, "duration": 5.66}, {"text": "Ian: What're you doing out there? You're not - you're not supposed to be there...", "start": 287.38, "duration": 2.46}, {"text": "Ian: If you're picking up this game, be sure to also pick up the patch to this game.", "start": 289.84, "duration": 3.68}, {"text": "Ian: Version 2.2 fixes a lot of game-breaking issues.", "start": 293.52, "duration": 3.4}, {"text": "Ian: When you accuse another player of murder, it's a rule that the accused gets moved into the same room as you.", "start": 296.92, "duration": 5.78}, {"text": "Ian: Without the patch, players can be teleported outside of the house instead,", "start": 302.7, "duration": 3.88}, {"text": "Ian: and if it happens to you, you're unable to move", "start": 306.58, "duration": 2.46}, {"text": "Ian:  which can result in not being able to progress in the game.", "start": 309.04, "duration": 3.16}, {"text": "Ian: You can also just get stuck in random rooms. I kept getting stuck in the ballroom; no amount of clicking could free me.", "start": 312.2, "duration": 6.56}, {"text": "Ian: How do you get out of a room? ...Just let me out!", "start": 319.02, "duration": 4.5}, {"text": "Ian: After installing the patch and starting a new game, though, I haven't run into any of these problems.", "start": 323.78, "duration": 4.48}, {"text": "Ian: If you're anything like me, you probably fear trying new things and love rolling dice -", "start": 328.44, "duration": 5.14}, {"text": "Ian: so you'll have a natural aversion to the \"No Die Roll\" mode -", "start": 333.58, "duration": 3.48}, {"text": "Ian: But, I encourage you to live on the wild side a little and give it a shot!", "start": 337.06, "duration": 3.36}, {"text": "Ian: The die comes pre-rolled on your turn, and features some higher numbers, which lets you move around the house a bit faster.", "start": 340.42, "duration": 5.86}, {"text": "Ian: There's also some various other, minor rule changes.", "start": 346.28, "duration": 2.76}, {"text": "Ian: Most of the time, I'll probably stick with the Classic Mode, but it was still a good time.", "start": 349.04, "duration": 4.06}, {"text": "Ian: I also encourage giving the AutoNotes setting a shot, if you're finding taking notes a bit challenging.", "start": 353.1, "duration": 5.04}, {"text": "Ian: It /does/ feel a little like cheating to have the computer jot down your notes for you -", "start": 358.14, "duration": 4.3}, {"text": "Ian: but the thing is, that when you're shown a card, there's no visual indicator as to who is doing the showing.", "start": 362.44, "duration": 5.84}, {"text": "Announcer: *quietly* \"Mr Green can disprove the suggestion.\"", "start": 368.28, "duration": 3.52}, {"text": "Ian: If you miss the voiceover telling you who it is, which I did /a lot/, there's no way to know.", "start": 371.8, "duration": 4.68}, {"text": "Ian: AutoNotes takes care of that minor struggle.", "start": 376.48, "duration": 2.74}, {"text": "*jazzy music*", "start": 379.44, "duration": 7.86}, {"text": "Ian: Now there's not much more I can say about this game; it's just a really solid interpretation of Clue.", "start": 387.3, "duration": 5.06}, {"text": "Ian: They really got the atmosphere right, which in my opinion is one of the more important parts of Clue.", "start": 392.36, "duration": 5.5}, {"text": "Ian: I /will/ say that I seem to be the murderer a lot? Like more often than not?", "start": 397.86, "duration": 4.92}, {"text": "Ian: And I'm not sure if I was just getting unlucky, or if the game was trying to say something about me as a person,", "start": 402.78, "duration": 5.5}, {"text": "Ian: but, it was a little frustrating.", "start": 408.28, "duration": 1.74}, {"text": "Ian: In fact, the one time that I actually won the game, it ended up that I was the murderer.", "start": 410.02, "duration": 4.74}, {"text": "Ian: which means I solved the crime, only to end up in prison.", "start": 414.76, "duration": 3.66}, {"text": "Ian: It's a little hard to feel victorious when you see your character getting locked up, even if justice is being served.", "start": 418.42, "duration": 6.36}, {"text": "Ian: But I sure hope I /served/ up a review that did this game justice!", "start": 424.78, "duration": 4.02}, {"text": "Ian: I know it's a smaller game than I usually feature on my channel, but I want to start covering more of these", "start": 428.8, "duration": 4.8}, {"text": "Ian: smaller games, because they can be really cool, and some are really nostalgic for me.", "start": 433.6, "duration": 4.3}, {"text": "Ian: In fact, sometimes the simplicity of the game is a much-needed change of pace,", "start": 437.9, "duration": 4.0}, {"text": "Ian: and it's part of the reason I like it.", "start": 441.9, "duration": 1.78}, {"text": "Ian: I just hope you guys found this video interesting, and that it was a treat for some Clue fans out there...", "start": 443.68, "duration": 4.9}, {"text": "Ian: Because there's no doubt in my mind that this game was definitely a treat for me.", "start": 448.58, "duration": 4.38}, {"text": "Ian: And hey, speaking of treats, the first 100 viewers to use the Blue Apron link in the description of this video", "start": 454.16, "duration": 6.2}, {"text": "Ian: will get three meals off their Blue Apron order free!", "start": 460.36, "duration": 2.08}, {"text": "Ian: Blue Apron is a meal-delivery service that allows you to create delicious, chef-designed recipes at home.", "start": 462.44, "duration": 5.26}, {"text": "Ian: Even if your kitchen is as claustrophobic as mine!", "start": 467.7, "duration": 3.12}, {"text": "Ian: Simply open the refrigerated box and follow the directions on the included recipe cards.", "start": 470.82, "duration": 4.92}, {"text": "Ian: No need to go to the grocery store; all the necessary ingredients are included.", "start": 475.74, "duration": 5.24}, {"text": "Ian: Which is great for me, because I'm really lazy!", "start": 480.98, "duration": 2.08}, {"text": "Ian: There's also no commitment, which means you can skip weeks or cancel at any time.", "start": 483.06, "duration": 4.38}, {"text": "Ian: If you're looking to shake up dinner time and brush up on your cooking skills,", "start": 487.44, "duration": 3.22}, {"text": "Ian: all without leaving the comfort of your own home,", "start": 490.66, "duration": 2.54}, {"text": "Ian: well, you might just have a hankerin' for a box of Blue Ap-er-in", "start": 493.2, "duration": 3.86}, {"text": "Ian: And if anyone from Blue Apron is listening, I know how cool that slogan I just made up sounds, so if you want to use it, go right ahead.", "start": 497.06, "duration": 7.0}, {"text": "Ian: I find that people really like it when you use words like \"HANKERIN'.\"", "start": 504.06, "duration": 4.96}]