[{"text": "Hey Wisecrack, Jared here.", "start": 0.099, "duration": 11.651}, {"text": "Today, we’re talking about the internet’s\nfavorite bee-based film, Bee Movie.", "start": 11.75, "duration": 4.79}, {"text": "While it’s mostly remembered as source material for YouTube remixes, Jerry Seinfeld’s animated", "start": 16.54, "duration": 4.75}, {"text": "debut has a lot to teach us about economic theory.", "start": 21.29, "duration": 3.579}, {"text": "Bee Movie is a bizarre analysis of both the shortcomings and the successes of capitalism,", "start": 24.869, "duration": 5.571}, {"text": "and strongly mirrors one of the foundational texts of modern economics which, bee-lieve", "start": 30.44, "duration": 4.43}, {"text": "it or not, is also about bees.", "start": 34.87, "duration": 3.599}, {"text": "Welcome to this Wisecrack Edition on the Economics of Bee Movie.", "start": 38.469, "duration": 2.881}, {"text": "As always, spoilers ahead for a 2007 computer-animated comedy about bees.", "start": 41.35, "duration": 4.65}, {"text": "First, a quick recap.", "start": 46.0, "duration": 1.85}, {"text": "Protagonist Barry B. Benson is disillusioned by the prospect of a life of menial labor", "start": 47.85, "duration": 5.15}, {"text": "in the hive.", "start": 53.0, "duration": 1.0}, {"text": "“You’ll be happy to know that bees, as\na species, haven’t had a day off in twenty-seven", "start": 54.0, "duration": 4.85}, {"text": "million years.”", "start": 58.85, "duration": 1.859}, {"text": "\"So you'll just work us to death?\"", "start": 60.709, "duration": 2.85}, {"text": "\"We'll sure try!\"", "start": 63.559, "duration": 1.291}, {"text": "While exploring the outside world, Barry falls in love with a florist named Vanessa and discovers", "start": 64.85, "duration": 4.43}, {"text": "that humans are exploiting millions of bees for their honey.", "start": 69.28, "duration": 3.42}, {"text": "Barry successfully sues the human race for exclusive rights to said honey.", "start": 72.7, "duration": 4.82}, {"text": "But soon after that, the world’s plant population begins to die off.", "start": 77.52, "duration": 4.04}, {"text": "With the life of the planet at stake, it’s up to Barry and Vanessa to save the day.", "start": 81.56, "duration": 4.62}, {"text": "What drives Bee Movie’s plot forward is, essentially, Barry’s aversion to manual labor.", "start": 86.18, "duration": 5.64}, {"text": "It’s what drives him out of the hive in the first place.", "start": 91.88, "duration": 2.84}, {"text": "\"I'm going out.”", "start": 94.729, "duration": 1.0}, {"text": "“Out?", "start": 95.729, "duration": 1.0}, {"text": "Out where?”", "start": 96.729, "duration": 1.0}, {"text": "“Out there!”", "start": 97.729, "duration": 1.0}, {"text": "“Oh, no!”", "start": 98.729, "duration": 1.0}, {"text": "“I have to.", "start": 99.729, "duration": 1.0}, {"text": "Before I go to work for the rest of my life.\"", "start": 100.729, "duration": 1.031}, {"text": "And when the court eventually decides in favor of the bees, he reveals his underlying motivation", "start": 101.76, "duration": 4.7}, {"text": "for filing the lawsuit: \"Vanessa, do you know what this means?", "start": 106.46, "duration": 2.96}, {"text": "All the honey is finally going to belong to the bees!", "start": 109.42, "duration": 1.94}, {"text": "Now, we won't have to work so hard all the time!\"", "start": 111.36, "duration": 2.96}, {"text": "Yet, this is hardly the way that Barry frames his argument for the jury.", "start": 114.32, "duration": 3.7}, {"text": "Instead, he offers a Marxist critique of industrial honey production.", "start": 118.02, "duration": 3.82}, {"text": "Specifically, Barry argues that because their honey is taken and sold to profit the honey", "start": 121.84, "duration": 4.979}, {"text": "farm owners, bees as a species are being alienated from the product of their labor, divorced", "start": 126.819, "duration": 5.131}, {"text": "from what Marx referred to as their “species being.”", "start": 131.95, "duration": 3.3}, {"text": "In a nutshell, Marx bee-lieved that one of the fundamental drives of human nature is", "start": 135.25, "duration": 5.55}, {"text": "to labor and to appreciate the objects of that labor.", "start": 140.8, "duration": 3.74}, {"text": "One of the major sins of capitalism is that it distances people from the results of their", "start": 144.54, "duration": 4.44}, {"text": "hard work, leaving them without a sense of purpose and accomplishment.", "start": 148.98, "duration": 4.21}, {"text": "Barry extends this idea from humans to bees, arguing that, in stealing their honey, the", "start": 153.19, "duration": 5.11}, {"text": "farmers are taking more from the bees than just material goods: “And what I'm hoping", "start": 158.3, "duration": 4.33}, {"text": "is that, after this is all over, you'll see how, by taking our honey, you’re not only", "start": 162.63, "duration": 4.58}, {"text": "taking away everything we have, but everything we are!”", "start": 167.21, "duration": 3.31}, {"text": "Barry’s argument likens the bee-human relationship to that between the exploited proletariat", "start": 170.52, "duration": 5.29}, {"text": "and the owners of capital.", "start": 175.81, "duration": 1.47}, {"text": "\"They make the honey, and we make the money.\"", "start": 177.28, "duration": 2.46}, {"text": "Because the capitalist mode of production\nalienates the domesticated bees from honey,", "start": 179.74, "duration": 4.74}, {"text": "the object of their labor, the bees are alienated from their essential “bee-ness,” that", "start": 184.48, "duration": 4.78}, {"text": "sense of themselves as a species that makes their lives meaningful.", "start": 189.26, "duration": 3.78}, {"text": "\"Is this what nature intended for us?", "start": 193.04, "duration": 2.53}, {"text": "To be forcibly addicted to these smoke machines in man-made wooden slat work camps?", "start": 195.57, "duration": 5.43}, {"text": "Living out our lives as honey slaves to the white man?”", "start": 201.0, "duration": 7.29}, {"text": "And for good measure, the film throws in a subtle reference to Ayn Rand’s “Atlas", "start": 208.29, "duration": 4.07}, {"text": "Shrugged” to really drive home the capitalist nature of the hive.", "start": 212.36, "duration": 3.79}, {"text": "Barry successfully argues that the bees’ natural right to their labor has been violated,", "start": 216.15, "duration": 4.71}, {"text": "putting him in direct opposition to Layton T. Montgomery, the lawyer for the defense", "start": 220.86, "duration": 3.9}, {"text": "whose rotundity is not unlike the depiction of the bourgeoisie in Soviet propaganda.", "start": 224.76, "duration": 4.8}, {"text": "\"This is an unholy perversion of the balance of nature, Benson.", "start": 229.56, "duration": 4.96}, {"text": "You'll regret this.\"", "start": 234.52, "duration": 1.18}, {"text": "And, in a surprising move for an animated family film, it turns out that the ostensible", "start": 235.7, "duration": 5.2}, {"text": "villain might actually have a point.", "start": 240.9, "duration": 2.45}, {"text": "With the court case in the bag, Barry sets about reforming the system in the bees’ favor.", "start": 243.35, "duration": 4.51}, {"text": "But things don’t work out the way he’d hoped.", "start": 248.02, "duration": 3.02}, {"text": "With the bees’ demand for honey satisfied by an influx of more product than they could", "start": 251.04, "duration": 4.28}, {"text": "possibly use, the bees have no incentive to work.", "start": 255.32, "duration": 3.55}, {"text": "The effect is twofold.", "start": 258.87, "duration": 1.5}, {"text": "For one thing, the bees - and Barry’s best friend Adam, in particular - lose their sense", "start": 260.37, "duration": 4.5}, {"text": "of purpose, despite Barry’s claim that it was the alienation of their labor that deprived", "start": 264.87, "duration": 4.56}, {"text": "them of purpose in the first place.", "start": 269.43, "duration": 1.73}, {"text": "“I don’t understand why they’re not happy.", "start": 271.16, "duration": 2.17}, {"text": "We have so much now, I thought their lives would be better.", "start": 273.33, "duration": 2.79}, {"text": "They’re doing nothing!”", "start": 276.12, "duration": 1.59}, {"text": "By providing the bees with a practically infinite honey supply, Barry has inadvertently replaced", "start": 277.71, "duration": 4.94}, {"text": "one crisis with another.", "start": 282.65, "duration": 2.03}, {"text": "Under these new conditions, with no need to labor, the bees are distanced in an entirely", "start": 284.68, "duration": 5.06}, {"text": "new way from their “species being.”", "start": 289.74, "duration": 2.23}, {"text": "Under the previous system, the bees were alienated from the object of their labor, but at least", "start": 291.97, "duration": 4.44}, {"text": "they had the labor itself, a set of tasks that gives their lives meaning and structure.", "start": 296.41, "duration": 5.09}, {"text": "The sudden surplus of honey eliminates the need for labor entirely, leaving them feeling", "start": 301.5, "duration": 5.18}, {"text": "bored and depressed.", "start": 306.68, "duration": 1.19}, {"text": "\"I was excited to be a part of making it.", "start": 307.87, "duration": 2.96}, {"text": "This was my new desk.", "start": 310.83, "duration": 1.19}, {"text": "This was my new job.", "start": 312.02, "duration": 1.19}, {"text": "I wanted to do it really well.", "start": 313.21, "duration": 2.22}, {"text": "And now...", "start": 315.43, "duration": 1.04}, {"text": "Now I can't.”", "start": 316.47, "duration": 1.57}, {"text": "What’s worse, due to the lack of pollination, the world’s plant population begins to die", "start": 318.04, "duration": 5.47}, {"text": "out, putting the entire planet and, in particular, Vanessa’s flower shop at risk.", "start": 323.51, "duration": 4.7}, {"text": "So, how is Barry going to save himself and the rest of the world from this mess?", "start": 328.21, "duration": 4.55}, {"text": "Oddly enough, he gets out the same way he got in - by being a bee-gotistal jerk.", "start": 332.76, "duration": 7.07}, {"text": "Barry decides to take action, not because his fellow bees are down in the dumps, or", "start": 339.83, "duration": 4.731}, {"text": "because the ecosystem is collapsing , but because Vanessa gets mad at him.", "start": 344.561, "duration": 4.449}, {"text": "“I ruined the planet, and I wanted to help you with your flower shop.", "start": 349.01, "duration": 3.14}, {"text": "Instead, I made it worse.”", "start": 352.15, "duration": 1.79}, {"text": "\"Actually, it's completely closed down!\"", "start": 353.94, "duration": 2.45}, {"text": "The threat of losing Vanessa is what finally gives Barry the kick in the no-pants he needs", "start": 356.39, "duration": 4.92}, {"text": "to do something about the problems he’s\ncreated.", "start": 361.31, "duration": 2.91}, {"text": "His scheme to re-pollinate the plants of Central Park is borne not out of a sense of altruism,", "start": 364.22, "duration": 5.49}, {"text": "but out of a Barry’s selfish desire to engage in cross-species pollination.", "start": 369.71, "duration": 4.3}, {"text": "In Bee Movie, self-centered actions can and do promote the greater good of society.", "start": 374.01, "duration": 5.56}, {"text": "Barry’s initial desire to escape work saves the bees from exploitative labor practices.", "start": 379.57, "duration": 5.01}, {"text": "When his initial solution to that problem turns out to be an overcorrection, Barry saves", "start": 384.58, "duration": 4.14}, {"text": "the day not by making personal sacrifices, but by trying even harder to fulfill his own wishes.", "start": 388.72, "duration": 6.22}, {"text": "While it’s probably a coincidence, it’s\nworth noting that the idea that individual", "start": 395.04, "duration": 4.14}, {"text": "acts of selfishness could lead to collective benefits was proposed more than three hundred", "start": 399.18, "duration": 4.95}, {"text": "years ago in another bee thing: “The Fable of the Bees: or, Private Vices, Public Benefits”", "start": 404.13, "duration": 5.35}, {"text": "written by economist Bernard Mandeville.", "start": 409.48, "duration": 2.3}, {"text": "In the similar but distinct story, a prosperous beehive lives in comfort and ease until someone", "start": 411.78, "duration": 6.37}, {"text": "decides to rid it of vice.", "start": 418.15, "duration": 2.13}, {"text": "At this point, believing even comfort to be a sin, thousands of bees die as the prosperity", "start": 420.28, "duration": 5.24}, {"text": "of the hive collapses.", "start": 425.52, "duration": 2.119}, {"text": "Mandeville thus argued that societal progress is not the result of people putting aside", "start": 427.639, "duration": 4.631}, {"text": "their wants and needs for the good of all.", "start": 432.27, "duration": 2.179}, {"text": "Instead, collectively useful things like laws, government institutions, and cultural practices", "start": 434.449, "duration": 4.921}, {"text": "come about when individuals selfishly pursue their own wants, needs, and even straight-up vices.", "start": 439.37, "duration": 6.05}, {"text": "According to Mandeville, the idea of a purely virtuous society is “a vain utopia,” because,", "start": 445.42, "duration": 4.84}, {"text": "to him, all public efforts at societal improvement are rooted in the selfish desire to be liked", "start": 450.26, "duration": 6.32}, {"text": "and supported by one’s fellow citizens.", "start": 456.58, "duration": 2.369}, {"text": "Now, while some scholars believe that Mandeville wrote the Fable as a satire or criticism of", "start": 458.949, "duration": 5.211}, {"text": "contemporary mercantilists who believed in the inherent morality of making money, this", "start": 464.16, "duration": 4.4}, {"text": "model influenced many economic thinkers, notably Scottish economist and ‘invisible hand’", "start": 468.56, "duration": 5.12}, {"text": "dude Adam Smith.", "start": 473.68, "duration": 1.5}, {"text": "Barry B. Benson is a textbook case of what Mandeville refers to as the “skillful politician,”", "start": 475.18, "duration": 5.88}, {"text": "an individual who channels the private vices of individuals into large-scale social change.", "start": 481.06, "duration": 5.94}, {"text": "Barry wants to get Central Park re-pollinated in no small part because it will make his", "start": 487.0, "duration": 4.19}, {"text": "ladyfriend happy.", "start": 491.19, "duration": 1.38}, {"text": "He gets the bees to undertake this massive task, not by appealing to their better nature", "start": 492.57, "duration": 4.56}, {"text": "and asking them to save the planet, but by asking them to advance their own interests.", "start": 497.13, "duration": 3.85}, {"text": "\"If we’re going to survive as a species this is our moment!", "start": 500.98, "duration": 3.87}, {"text": "So what do you all say?", "start": 504.85, "duration": 1.36}, {"text": "Are we going to be bees?", "start": 506.21, "duration": 2.16}, {"text": "Or just Museum of Natural History keychains?”", "start": 508.37, "duration": 3.0}, {"text": "He promises the chance to ensure their own survival and reclaim the the sense of purpose", "start": 511.37, "duration": 4.199}, {"text": "they lost in the wake of the lawsuit.", "start": 515.569, "duration": 2.22}, {"text": "Humanity doesn’t even get a passing mention.", "start": 517.789, "duration": 2.37}, {"text": "Yet, in spite of the bees’ selfish motivations, the whole planet benefits from their actions.", "start": 520.159, "duration": 5.55}, {"text": "Private vice has created a public benefit.", "start": 525.709, "duration": 2.61}, {"text": "And let’s not miss the fact that Barry re-pollinates Vanessa’s flowers first.", "start": 528.319, "duration": 4.88}, {"text": "Bee Movie paints private vice as a kind of accelerating force, the kick-start needed", "start": 533.199, "duration": 4.94}, {"text": "to push society out of practices that are\nunjust or unworkable and toward a more sustainable model.", "start": 538.14, "duration": 6.24}, {"text": "While there may be bumps along the way, the selfish pursuit of one’s own desires will", "start": 544.38, "duration": 4.8}, {"text": "ultimately lead to changes which benefit the system as a whole.", "start": 549.189, "duration": 4.02}, {"text": "Which is why a movie that started off with a Marxist critique of capitalism ultimately", "start": 553.209, "duration": 4.25}, {"text": "doubles back on that argument to reaffirm the usefulness of the capitalist system - with", "start": 557.459, "duration": 4.211}, {"text": "a few caveats.", "start": 561.67, "duration": 1.31}, {"text": "Barry, having successfully avoided menial labor by becoming a lawyer, shares an office", "start": 562.98, "duration": 4.529}, {"text": "space with Vanessa, from which they sell “bee-approved honey.”", "start": 567.509, "duration": 3.11}, {"text": "\"Would you like some honey with that?", "start": 570.619, "duration": 2.03}, {"text": "It is bee-approved!\"", "start": 572.649, "duration": 1.0}, {"text": "This might seem like a throwaway line, but it actually indicates a significant change", "start": 573.649, "duration": 3.97}, {"text": "to the prevailing capitalist system.", "start": 577.619, "duration": 1.871}, {"text": "Whereas the bees working on industrial honey farms were once completely exploited, they", "start": 579.49, "duration": 3.99}, {"text": "have now been more fully integrated into the capitalist machine, such that they have a", "start": 583.48, "duration": 4.209}, {"text": "degree of regulatory power over the sale and distribution of honey.", "start": 587.689, "duration": 3.81}, {"text": "This is the film’s way of rejecting the laissez-faire capitalism of the honey farmers", "start": 591.499, "duration": 4.08}, {"text": "in favor of a more benign market economy.", "start": 595.579, "duration": 2.411}, {"text": "The movie doesn’t specify how honey becomes ‘bee-approved’ . But it seems safe to", "start": 597.99, "duration": 4.5}, {"text": "say that bees now have a seat at the table, an ability to influence honey production,", "start": 602.49, "duration": 4.74}, {"text": "if not to control it directly.", "start": 607.23, "duration": 1.589}, {"text": "In any event, both humans and bees still pursue the fulfillment of their own private vices,", "start": 608.819, "duration": 5.08}, {"text": "but minor checks and balances prevent massive exploitation of the “little guys.”", "start": 613.899, "duration": 4.5}, {"text": "So, is Barry a failed Leon Trotskbee, or a successful Jordan Beelfort?", "start": 618.4, "duration": 5.06}, {"text": "Is the economic system shown in Bee Movie as robust as the way they portray the science of bees?", "start": 623.46, "duration": 5.52}, {"text": "\"Well since I'm more of a philosophy nerd, I couldn't really tell you.\"", "start": 628.98, "duration": 3.24}]