[{"text": "Well well well, we say this every time but the end of the year has creeped up on us so ever quickly.", "start": 0.099, "duration": 4.46}, {"text": "So who wouldn't want to reminisce and look back on what we faced in 2015?", "start": 4.56, "duration": 4.02}, {"text": "Throughout the year, the entire world was poised for World War 3 as tensions increased in the Middle East.", "start": 8.58, "duration": 4.6}, {"text": "America challenged Japan to a giant robot fight in what looks to be the most epic episode of Robot Wars ever.", "start": 13.18, "duration": 5.16}, {"text": "And most importantly, everyone freaked the dick out over the color of a fucking dress", "start": 18.34, "duration": 4.22}, {"text": "In shocking events that saw the collective IQ of the internet plummet for a week.", "start": 22.56, "duration": 3.86}, {"text": "Was it white and gold or blue and black? The question was so puzzling that scientists worldwide had to band together", "start": 26.42, "duration": 5.76}, {"text": "Working uniformly to calculate the exact amount of fucks that people couldn't give.", "start": 32.18, "duration": 4.2}, {"text": "British Prime Minister David Cameron was accused of having stuck his genitals in a pig's mouth during his university years.", "start": 36.38, "duration": 5.6}, {"text": "In an official statement, it was said that \"It was the most degrading thing I have ever done, and it was a life mistake I'd rather forget about.\"", "start": 41.98, "duration": 6.72}, {"text": "stated The Pig.", "start": 48.7, "duration": 0.78}, {"text": "And of course, those dastardly terrorists at ISIS continue to bring terror around the world in their most horrifying terrorist plot to date", "start": 49.48, "duration": 6.82}, {"text": "by claiming responsibility for Donald Trump's hair.", "start": 56.3, "duration": 3.06}, {"text": "Who, in surprising news, was seen as one of the most  promising presidential candidates of all time...", "start": 59.36, "duration": 4.38}, {"text": "...just behind George W. Bush, this bald eagle, and a piece of turd.", "start": 63.74, "duration": 4.24}, {"text": "But of course, we're here to celebrate the best, the worst, and the weirdest moments in Anime that defined the year!", "start": 67.98, "duration": 5.58}, {"text": "So today on the Anime Zone, lets once again rewind back to the beginning of the year", "start": 73.56, "duration": 3.92}, {"text": "As we start off with some funky, upbeat goodness", "start": 77.48, "duration": 3.2}, {"text": "About people dying.", "start": 81.02, "duration": 1.36}, {"text": "♪ \"Flyers\" by BRADIO starts playing ♪", "start": 83.02, "duration": 6.88}, {"text": "This year started off with an unequivocal bang with Madhouse's release of \"Death Parade\"", "start": 89.9, "duration": 4.12}, {"text": "The show that managed to trick the entire anime community into falling into an existential crisis, while they were busy putting their hands up to funk.", "start": 94.02, "duration": 6.54}, {"text": "The anime asks the question of how a person acts when pushed their mental limits", "start": 100.56, "duration": 3.6}, {"text": "and does this by forcing two characters to play a game against each other with their lives on the line.", "start": 104.16, "duration": 4.28}, {"text": "What the characters don't know is that they are actually in the afterlife, and their actions during this game will decide whether they are sent to either Heaven or Hell.", "start": 108.44, "duration": 6.84}, {"text": "It was an interesting premise that managed to explore all different directions of your moral compass without ever being too preachy", "start": 115.28, "duration": 5.26}, {"text": "and it's one of the few shows that allows you to reflect on your own life.", "start": 120.54, "duration": 2.76}, {"text": "Are you satisfied with it? Or is there an undercurrent of dismay just slowly realizing the insignificance of your own existence", "start": 123.3, "duration": 6.86}, {"text": "Traveling towards an unavoidable death as you're trapped living the 9 to 5 grind with no escape...", "start": 130.16, "duration": 5.6}, {"text": "But who cares about that?!", "start": 135.76, "duration": 1.02}, {"text": "♪ Everybody! Put your hands up! ♪", "start": 136.78, "duration": 3.64}, {"text": "Combining this concept with an execution to match, solid writing, great visuals and one of the most beautiful scenes to come out in the past few years", "start": 140.42, "duration": 6.3}, {"text": "and you have one of the best animes to come out in the year, along with one of the best openings.", "start": 146.72, "duration": 3.86}, {"text": "Speaking of this opening, can we talk about BRADIO? Let's talk about BRADIO!", "start": 150.58, "duration": 2.66}, {"text": "I fucking love BRADIO! Can we listen to BRADIO? Let's listen to BRADIO!", "start": 153.24, "duration": 2.88}, {"text": "BRADIO BRADIO BRADIO!", "start": 156.12, "duration": 1.52}, {"text": "I just wanna fucking touch his hair...", "start": 157.64, "duration": 3.06}, {"text": "As far as the rest of the funky winter season, Studio Wit attempted their best Studio Trigger impression with \"The Rolling☆Girls\"", "start": 160.7, "duration": 6.46}, {"text": "A show which is what would happen if you crossed \"Kill la Kill\" with the cast of \"Love Live!\" set in a world colored entirely by Skittles.", "start": 167.16, "duration": 6.28}, {"text": "\"Kantai Collection\" had a unique way of showing respect to old wartime battleships", "start": 173.44, "duration": 4.0}, {"text": "By representing them as scantily dressed, cute lesbian girls in a plotline that saw a fleet of these old wartime machines", "start": 177.44, "duration": 5.8}, {"text": "combating alien creatures invading from the sea. \nWhich can mean only one thing...", "start": 183.24, "duration": 4.82}, {"text": "It sounds like a weird concept but how could you not look at these marvels of naval engineering and not...", "start": 192.72, "duration": 5.06}, {"text": "Not...", "start": 197.78, "duration": 0.64}, {"text": "Not wanna... put your dick in it.", "start": 198.42, "duration": 1.6}, {"text": "It's so obvious, in fact, that the opening already knew what viewers would be doing after seeing the show!", "start": 200.02, "duration": 4.5}, {"text": "♪ \"AKINO\" from bless4 starts playing ♪", "start": 204.52, "duration": 2.28}, {"text": "\"Durarara!\" returned with a sequel after a five-year gap of bringing hope to the anime community", "start": 214.22, "duration": 4.06}, {"text": "As they can now speculate which mythical things actually have a chance of existing.", "start": 218.28, "duration": 4.08}, {"text": "Such as Half-Life 3, Evangelion 4.0, and the female orgasm.", "start": 222.36, "duration": 4.74}, {"text": "\"Tokyo Ghoul\" managed to wrap things up, giving us one of the most beautiful and moving soundtracks this year", "start": 227.1, "duration": 4.24}, {"text": "to accompany a plot that slowly sailed down as a piece of crap street", "start": 231.34, "duration": 3.56}, {"text": "That built up to an action-packed climax that saw one man taking a 10 hour stroll.", "start": 234.9, "duration": 4.5}, {"text": "With the season diverting from the manga, it gave us such a shockingly bad adaptation that fucked viewers so hard", "start": 239.4, "duration": 5.32}, {"text": "You can now watch the entire series on Pornhub!", "start": 244.72, "duration": 3.0}, {"text": "This isn't a joke... it's- it's really there...", "start": 247.72, "duration": 2.24}, {"text": "Speaking of Pornhub, \"Koufuku Graffiti\" showed us a world that would exist if you could Netflix and Chill with your food.", "start": 249.96, "duration": 5.88}, {"text": "In a show that Brazzers would make if they ever decided to make a cooking show. The anime brought new meaning to the word 'food porn'", "start": 255.84, "duration": 5.92}, {"text": "As ignoring the fact that these girls are apparently taught how to eat in blowjob school", "start": 261.76, "duration": 3.76}, {"text": "The food was sometimes cooked so suggestively, I often got the distinct impression that it was trying to seduce me.", "start": 265.52, "duration": 5.1}, {"text": "Hahhh, stop teasing me you dirty whore", "start": 270.62, "duration": 3.56}, {"text": "\"Saekano\" gave a very interesting meta-take on the harem-comedy genre", "start": 274.18, "duration": 3.58}, {"text": "by taking a character written like an actual real person, and insert him in a limited cast full of character tropes.", "start": 277.76, "duration": 4.96}, {"text": "And of course, there was \"Aldnoah.Zero\" season 2, the train wreck I cannot talk about without spoiling the first season", "start": 282.72, "duration": 5.94}, {"text": "So for those of you who haven't seen it click this button right here.", "start": 288.66, "duration": 3.26}, {"text": "[Or go to 5:42 if your annotations are off]", "start": 291.92, "duration": 2.14}, {"text": "Now, for those who don't remember the first season cliffhanger that ended with two people shot in the head and one person shot full of bullet holes", "start": 294.06, "duration": 6.92}, {"text": "Who could have known that the second season would have started off with such a twist", "start": 300.98, "duration": 3.96}, {"text": "♪ Stayin' Alive by the Bee Gees ♪", "start": 304.94, "duration": 5.12}, {"text": "Yes, the dramatic season ending was immediately rendered obsolete by a season start that proved that people don't only die when they are killed,", "start": 310.06, "duration": 6.52}, {"text": "But apparently people don't die if they're shot in the fucking head.", "start": 316.6, "duration": 3.6}, {"text": "Which set the standard for the series to just go downhill from there.", "start": 320.2, "duration": 3.1}, {"text": "Inaho became an unstoppable terminator, owning everyone with his immeasurable swag,", "start": 323.3, "duration": 4.5}, {"text": "and Bad Luck Slaine devolved from his innocent shell into full-blown cunt.", "start": 327.8, "duration": 3.82}, {"text": "With this, the show managed to jump the shark so high it could clear into interstellar orbit", "start": 331.62, "duration": 3.96}, {"text": "Oh, wait, higher than that. No keep- keep going. wait. How- How long is this gonna go?", "start": 335.58, "duration": 4.06}, {"text": "Oh- oh, okay, that makes sense.", "start": 339.64, "duration": 2.28}, {"text": "As the spring season started to bloom, everyone had to finally put their hands down, and wait for the hot new shows to come out of the block", "start": 341.92, "duration": 7.0}, {"text": "But who in the world knew that the hot new thing would come all packaged and wrapped up.", "start": 348.92, "duration": 4.34}, {"text": "In neat blue ribbon?", "start": 353.26, "duration": 1.36}, {"text": "♪ \"crossing field\" by Lisa ♪", "start": 354.62, "duration": 4.18}, {"text": "If there is one thing 2015 will be remembered for in the anime world, it's shitty gimmicks becoming a viral hit", "start": 365.5, "duration": 5.76}, {"text": "and nowhere was this proved more true than with \"Danmachi\" or its official English title \"Is It Wrong to Pick Up Girls in a Dungeon?\"", "start": 371.26, "duration": 7.1}, {"text": "The show that was named so stupidly that for months it had everyone sarcastically asking \n\"Is it wrong to pick up girls in a dungeon?\"", "start": 378.36, "duration": 7.62}, {"text": "\"Is it wrong to pick up girls in a dungeon?\"", "start": 385.98, "duration": 1.8}, {"text": "\"*Is* it wrong to pick up girls in a dungeon?\"", "start": 387.78, "duration": 2.08}, {"text": "\"IS IT WRONG TO PICK UP GIRLS IN A DUNGEON?!\"\n\"Who the fuck-\"", "start": 389.86, "duration": 1.6}, {"text": "Despite the ridiculously named title, \"Danmachi\" was the show that everyone was talking about because", "start": 391.46, "duration": 4.9}, {"text": "\"oh mah god, there's a girl with big boobs, and it's held up with", "start": 396.36, "duration": 3.36}, {"text": "ffffffffffffffff", "start": 399.72, "duration": 1.6}, {"text": "fucking string!\"", "start": 401.32, "duration": 1.36}, {"text": "Sparking a phenomenon that saw Hestia sweep the entire anime community", "start": 402.68, "duration": 3.3}, {"text": "showing that a show doesn't even need to be good as long as there's something for people to latch on to.", "start": 405.98, "duration": 4.32}, {"text": "Strip all that away and you basically have \"Sword Art Online\" again; with a fantasy story containing RPG elements", "start": 410.3, "duration": 5.18}, {"text": "Starring a main character growing at a ridiculously rapid rate due to his OP abilities", "start": 415.48, "duration": 4.2}, {"text": "Amassing an amalgamation of love interests like he's collecting fucking Yu-Gi-Oh cards.", "start": 419.68, "duration": 4.22}, {"text": "The only real surprising thing to come out of this show was the fact that it was a harem anime where nobody was having a war over who is best girl.", "start": 423.9, "duration": 6.44}, {"text": "Because we can all agree who is worst.", "start": 430.34, "duration": 2.2}, {"text": "In the rest of the Spring season, Studio Satelight reunited the cast of Haruhi Suzumiya with \"The Disappearance of...\"", "start": 432.54, "duration": 5.56}, {"text": "Not best girl.", "start": 438.1, "duration": 1.12}, {"text": "*OOOHHHHHHH*", "start": 439.22, "duration": 1.14}, {"text": "As a light-hearted spin-off to the original series, all it really achieved was to remind us that Kyoto Animation will never give us a season three of Haruhi.", "start": 440.36, "duration": 6.9}, {"text": "Unless, maybe we keep reminding them. Once. Twice. Or perhaps eight times.", "start": 447.26, "duration": 5.7}, {"text": "Endlessly?", "start": 453.22, "duration": 1.02}, {"text": "*Klaxon warning*", "start": 454.3, "duration": 1.18}, {"text": "*Little Japanese girl speaking Japanese I can't understand*\n*The \"Saw\" theme is also playing*", "start": 455.48, "duration": 6.0}, {"text": "*Low pitched Japanese girl I can't understand*", "start": 461.48, "duration": 4.74}, {"text": "\"Kekkai Sensen\" give a very interesting take on modern day New York that has socially integrated with aliens and super humans", "start": 466.22, "duration": 5.78}, {"text": "In a setting that felt one part \"Baccano!\" and one part \"Darker than Black\".", "start": 472.0, "duration": 3.28}, {"text": "The world itself felt so alive and vibrant, it even garnered the attention of Donald Trump, who in response has suggested that", "start": 475.28, "duration": 5.48}, {"text": "\"We should move to ban all aliens from entering America in fears that they could one day pose a terrorist threat or take all our jobs.\"", "start": 480.76, "duration": 5.82}, {"text": "The world went through another apocalyptic transformation in \"Owari no Seraph\"", "start": 486.58, "duration": 3.94}, {"text": "A story of war as humans uprise against their new oppressors that somehow resulted in \"Attack on Blue Exorcist With Gay Vampires\"", "start": 490.52, "duration": 6.6}, {"text": "Complete with an annoying main character who thinks he's the shit, but doesn't actually realize he's just shit.", "start": 497.12, "duration": 5.24}, {"text": "It was an important show as it proved that in a post-apocalyptic setting where 90% of the world population has been wiped out and vampires rule everything,", "start": 502.36, "duration": 7.34}, {"text": "the only thing that will ever survive untouched in anime is a fucking", "start": 509.7, "duration": 2.9}, {"text": "HIGH", "start": 512.6, "duration": 0.5}, {"text": "HIGH SCHOOL!", "start": 513.1, "duration": 0.5}, {"text": "Kyoto Animation return with yet another band of cute, innocent girls in \"Hibike! Euphonium\"", "start": 513.6, "duration": 4.86}, {"text": "Telling a story of a group of girls joining a music group and then going off and then...", "start": 518.46, "duration": 4.46}, {"text": "playing music.", "start": 523.66, "duration": 1.24}, {"text": "*DUN DUN DUN*", "start": 524.9, "duration": 1.76}, {"text": "*DUN DUN DUN DUN*", "start": 526.7, "duration": 1.76}, {"text": "The show features a heartwarming plot with some of the most beautiful pieces of cute girl animation that you can only just-", "start": 528.46, "duration": 4.94}, {"text": "*HNNNNNNNNNNNNNNNG*", "start": 533.4, "duration": 1.38}, {"text": "at and also stars an Asuka who is not a crabby menstruating bitch who gets up on you for the smallest things.", "start": 534.78, "duration": 4.98}, {"text": "\"shhh\"", "start": 539.76, "duration": 0.96}, {"text": "\"I was only joking\"", "start": 540.72, "duration": 1.66}, {"text": "The Waifu Wars continued as \"Nisekoi\" followed on to it's second season", "start": 542.38, "duration": 3.32}, {"text": "Continuing the search for the winning romantic partner by not actually developing any existing characters and just adding more girls!", "start": 545.7, "duration": 5.88}, {"text": "It sounds retarded, but you have to remember that only people holding keys have an actual chance of ending up with the main character", "start": 551.58, "duration": 5.64}, {"text": "So that only narrows it down to the entire cast, Eren from \"Attack on Titan\", Sora from \"Kingdom Hearts\"", "start": 557.22, "duration": 4.98}, {"text": "8% of the World population, and possibly this dog.", "start": 562.2, "duration": 3.14}, {"text": "But it's okay, you see! Because if you're not that patient you can always read ahead in the manga to see who he finally ends up with!", "start": 565.34, "duration": 6.3}, {"text": "HA HA HA HA HA. Ha. Ha... ha... *Laughter turns into sobs*", "start": 571.64, "duration": 7.3}, {"text": "WHY?!", "start": 578.94, "duration": 0.88}, {"text": "\"Plastic Memories\" toyed with our hearts as it dealt with the morals of coping of terminally ill patients", "start": 579.82, "duration": 4.46}, {"text": "giving us a hand for the sorrowful moments that would always target your heartstrings", "start": 584.28, "duration": 3.56}, {"text": "that would be expected from a plot that had more cancer metaphors than a Bronze 5 Game in League of Legends.", "start": 587.84, "duration": 4.94}, {"text": "This season from the makers of \"People die when they are killed\"", "start": 592.78, "duration": 3.16}, {"text": "Came the hit new remake: \"The archer class is really made up of archers!\"", "start": 595.94, "duration": 3.68}, {"text": "and its sequel: \"Just because you're correct doesn't mean you're right.\"", "start": 599.62, "duration": 3.82}, {"text": "Yes, \"Fate/stay night: Unlimited Boner Wanks\" continued towards its conclusion of poorly translated sayings", "start": 603.44, "duration": 5.0}, {"text": "In an adaptation that would inevitably leave visual novel fans something to complain about.", "start": 608.44, "duration": 4.64}, {"text": "The food porn train continued as \"Shokugeki no Souma\" perpetuated more scenes of girls discovering they could have sexual intercourse with their food.", "start": 613.08, "duration": 7.38}, {"text": "Unlike \"Koufuku Graffiti\", though, it managed to blend in food porn with exciting tournaments and imaginative recipes", "start": 620.46, "duration": 5.58}, {"text": "resulting in a unique blend of weird fanservice that featured the longest physically impossible boob bounce in recent memory and an entertaining competitive cooking show.", "start": 626.04, "duration": 7.26}, {"text": "that was only missing Gordon Ramsay shouting at people every five minutes to spice things up.", "start": 633.3, "duration": 3.86}, {"text": "\"I would've fired the fucking six of you years ago!", "start": 637.16, "duration": 2.6}, {"text": "\"You, you, you, you, you, you, and fucking you!\"", "start": 639.76, "duration": 3.12}, {"text": "\"Uhhh\"", "start": 642.88, "duration": 1.38}, {"text": "\"Ore Monogatari!!\" gave a heartfelt story about how to date a girl who is permanently a perfect dick-sucking height for you.", "start": 644.26, "duration": 5.4}, {"text": "If your dick will even fit in her mouth.", "start": 649.66, "duration": 1.82}, {"text": "It was a genuinely funny and touching romance between two characters so innocently naive that entire story arts can be dedicated to characters feeling guilty about having dirty, impure thoughts", "start": 651.5, "duration": 10.84}, {"text": "Like holding hands", "start": 662.34, "duration": 1.54}, {"text": "and cuddling.", "start": 663.88, "duration": 1.46}, {"text": "Yeah, I bet you want to call him by his first name too you thirsty, dirty bitch.", "start": 665.9, "duration": 4.62}, {"text": "And finally, Studio Trigger managed to troll the entire anime world by teasing a new original epic following its success with \"Kill la Kill\" with \"Ninja Slayer From Animation\"", "start": 670.52, "duration": 8.66}, {"text": "Presumably \"From Animation\" was put in huge sarcastic quotation marks", "start": 679.18, "duration": 3.84}, {"text": "as the entire show looked like it was animated using a combination of MS Paint, cardboard cutouts and the tears of Studio Trigger fans.", "start": 683.02, "duration": 6.52}, {"text": "In response to all the accusations that the actual budget was wasted on hookers and blackjack", "start": 689.54, "duration": 4.28}, {"text": "a representative from Studio Trigger had this to say:", "start": 693.82, "duration": 2.82}, {"text": "And that basically sums up half a year of everyone putting their hands up and a lifetime supply of string boobs.", "start": 706.48, "duration": 5.74}, {"text": "Join me next time when we discuss the summer of girls and the man who can give you the most epic epic first bump ever.", "start": 712.22, "duration": 7.14}, {"text": "Hey guys, if any of you are interested in the show's I talked about then you can look at the description below", "start": 720.5, "duration": 3.88}, {"text": "or most of them are also available on Crunchyroll, so you can go to crunchyroll.com/TheAnimeZone for a free month of premium membership", "start": 724.38, "duration": 6.64}, {"text": "But anyway, that's it for me now", "start": 731.02, "duration": 1.44}, {"text": "I hope to be back with part 2 sooner that I got it out last year. I'll see you guys then.", "start": 732.46, "duration": 4.24}]