[{"text": "Sometimes the world feels...hmm, boring.", "start": 1.06, "duration": 3.259}, {"text": "We've visited all the remote islands, conquered the Arctic, and penetrated the deepest jungles.", "start": 5.02, "duration": 6.56}, {"text": "But there is still one place to explore.", "start": 12.42, "duration": 2.78}, {"text": "It's a wet and deadly desert inhabited by mysterious creatures living in total darkness.", "start": 15.84, "duration": 7.12}, {"text": "The deep sea.", "start": 23.42, "duration": 1.56}, {"text": "Let's dive down.", "start": 25.24, "duration": 1.32}, {"text": "[♫ Catchy Intro Jingle ♫]", "start": 26.72, "duration": 8.7}, {"text": "When we look at the sheer scale of the Earth's oceans,", "start": 37.0, "duration": 2.98}, {"text": "it's hard to believe that less than 2% of all biomass on Earth lives here.", "start": 39.98, "duration": 4.72}, {"text": "And of that small percentage, around 90% is located close to the surface in the first 200 meters.", "start": 45.4, "duration": 7.02}, {"text": "This is where we begin our journey.", "start": 53.48, "duration": 2.2}, {"text": "Here, light can still penetrate the water which allows photosynthesis to occur.", "start": 56.46, "duration": 4.66}, {"text": "Phytoplankton,", "start": 61.6, "duration": 1.4}, {"text": "trillions and trillions of single-celled algae and bacteria make up the foundation", "start": 63.0, "duration": 4.5}, {"text": "of the ocean's ecosystem, and they're consumed by bigger plankton, who are consumed by other species.", "start": 67.56, "duration": 6.52}, {"text": "The seafloor at this depth is akin to the Amazon rainforest, and is often covered with coral reefs, algae,", "start": 75.36, "duration": 6.14}, {"text": "and other sea plants that are home to a plethora of sea animals.", "start": 81.5, "duration": 3.94}, {"text": "So far, we've focused most of our attention on this comparatively pleasant environment,", "start": 86.28, "duration": 4.54}, {"text": "where we fish, swim, pollute, and do science.", "start": 90.82, "duration": 4.1}, {"text": "So, let's dive deeper.", "start": 95.68, "duration": 2.24}, {"text": "Moving from familiar coastal waters into deeper, more remote waters, we eventually reach the edge", "start": 98.52, "duration": 5.34}, {"text": "of the continental shelf, where we're confronted with the continental slope,", "start": 103.86, "duration": 4.1}, {"text": "the long descent down to the deep sea.", "start": 107.96, "duration": 2.52}, {"text": "With every additional metre of water, light fades drastically, which means there are basically", "start": 111.28, "duration": 5.7}, {"text": "no more plants, and the seemingly steep continental slope begins to remind us of the surface of the Moon.", "start": 116.98, "duration": 6.12}, {"text": "Looking out we're faced by what seems to be endless open water.", "start": 123.76, "duration": 3.98}, {"text": "Let's leave the slope behind us, and enter what's known as the twilight zone, the portal to the deep sea.", "start": 128.36, "duration": 5.84}, {"text": "As we sink down further, the water pressure rises to deadly levels.", "start": 134.46, "duration": 4.4}, {"text": "The deepest scuba dive ever came in at 332 meters.", "start": 139.78, "duration": 4.32}, {"text": "At that depth, the pressure is like having 200 cars stacked on top of you.", "start": 144.1, "duration": 4.68}, {"text": "Yet we've only completed 3% of our journey.", "start": 149.66, "duration": 3.68}, {"text": "While this region seems pretty grim, many fish and other animals", "start": 153.74, "duration": 3.92}, {"text": "actually spend at least half their lives down here.", "start": 157.66, "duration": 2.64}, {"text": "During the day, it's a good place to rest and recover,", "start": 160.9, "duration": 3.1}, {"text": "hidden from predators in the vast dark waters.", "start": 164.0, "duration": 3.7}, {"text": "At night, they can travel more safely into shallower zones to feed in the food-rich surface waters.", "start": 167.7, "duration": 5.66}, {"text": "In this transition zone between twilight and darkness, light becomes a powerful tool.", "start": 174.36, "duration": 5.3}, {"text": "Over 90% of the species indigenous to this deep environment", "start": 181.1, "duration": 4.0}, {"text": "use bioluminescence chemicals to create light.", "start": 185.1, "duration": 2.74}, {"text": "They do so as camouflage against the very faint sunlight,", "start": 188.78, "duration": 3.42}, {"text": "to send signals to potential mates,", "start": 192.2, "duration": 2.2}, {"text": "or to confuse and scare attackers.", "start": 194.48, "duration": 2.28}, {"text": "Or, they use lights to hunt.", "start": 197.2, "duration": 2.3}, {"text": "Another tool for survival in the dark is teamwork.", "start": 200.58, "duration": 3.1}, {"text": "At around 700 metres, we encounter a colony of siphonophores.", "start": 204.26, "duration": 4.14}, {"text": "They can be up to 50 metres in length, but are only as wide as a broomstick.", "start": 208.92, "duration": 4.5}, {"text": "To attract prey, a colony creates a tragically beautiful bright blue or red light,", "start": 214.3, "duration": 5.7}, {"text": "and deploys a curtain of tentacles filled with toxic needles that kill anything that comes too close.", "start": 220.0, "duration": 6.96}, {"text": "But most species living down here have to rely on an unlikely resource: marine snow.", "start": 227.94, "duration": 5.96}, {"text": "White flaky stuff that constantly sinks from the surface to the bottom of the ocean.", "start": 234.36, "duration": 4.58}, {"text": "It consists of dead plant or animal parts,", "start": 239.7, "duration": 2.78}, {"text": "fecal matter,", "start": 242.48, "duration": 1.16}, {"text": "shells, sand, or dust.", "start": 243.64, "duration": 1.8}, {"text": "Even though this doesn't sound very tasty, without this crucial resource, life in the deep sea would starve.", "start": 246.48, "duration": 6.4}, {"text": "It's in this area that the most fascinating battles between two unlikely enemies could happen.", "start": 253.9, "duration": 4.84}, {"text": "Sperm whales hunt and attack giant squid the size of a house.", "start": 259.6, "duration": 4.02}, {"text": "While the squid fight back ferociously, they probably don't stand a chance,", "start": 264.66, "duration": 4.04}, {"text": "but they do leave permanent marks on their killer's skin.", "start": 268.7, "duration": 3.24}, {"text": "As we reach 1,000 meters, deeper than the tallest structure built by humans, we need to be careful.", "start": 272.86, "duration": 5.86}, {"text": "This is the midnight zone, a place of utter darkness.", "start": 279.26, "duration": 4.56}, {"text": "A barely explored wet wasteland consisting of nothing but endless black open water.", "start": 284.72, "duration": 5.42}, {"text": "At these depths, it's harder for a human to take a swim than to take a walk in space.", "start": 290.9, "duration": 4.92}, {"text": "Finding food down here is really hard, so life had to adapt, and become extremely energy efficient.", "start": 297.08, "duration": 6.16}, {"text": "Like the 30-centimetre-long vampire squid that floats through the water without motion,", "start": 303.82, "duration": 4.78}, {"text": "with long and slender catching arms extended.", "start": 308.6, "duration": 2.8}, {"text": "They're covered in tiny stiff hairs, which brush food from the water.", "start": 312.22, "duration": 4.08}, {"text": "This saves a lot of energy compared to actively catching food.", "start": 316.88, "duration": 3.82}, {"text": "For carnivorous fish, it's much harder to find food since living prey is quite rare down here.", "start": 321.9, "duration": 5.82}, {"text": "So the hunters have to get a perfect grip on their victim on first strike, otherwise it will escape into the dark.", "start": 329.1, "duration": 5.96}, {"text": "Many deep-sea predators have several sets of long and deadly teeth.", "start": 335.9, "duration": 3.86}, {"text": "Like the viperfish, which uses its long fangs to trap even large prey and swallow it whole.", "start": 340.62, "duration": 5.64}, {"text": "Or the frilled shark, with its impressive set of 300 teeth,", "start": 347.04, "duration": 4.02}, {"text": "which are curved backwards to hook their victims in their mouths.", "start": 351.06, "duration": 3.38}, {"text": "We sink further,", "start": 355.38, "duration": 1.26}, {"text": "below the 3,800 mark, as deep as the grave of the Titanic.", "start": 356.88, "duration": 4.72}, {"text": "We are now at abyssal depths.", "start": 362.0, "duration": 2.9}, {"text": "Here, life happens in slow motion.", "start": 365.5, "duration": 2.84}, {"text": "Preserving every last bit of energy is crucial for survival.", "start": 369.1, "duration": 4.22}, {"text": "Everything down here hovers motionless, or swims in a slow, elegant fashion.", "start": 374.1, "duration": 5.74}, {"text": "The only time the animals living in this zone move fast is when they have to escape danger.", "start": 380.9, "duration": 5.72}, {"text": "Like the Dumbo octopod paddling with its ear-like fins, or the grenadiers fish with its slow, eel-like tail beats.", "start": 387.5, "duration": 7.28}, {"text": "At 4,000 meters, we finally reach ground again:", "start": 395.82, "duration": 3.38}, {"text": "the abyssal plain.", "start": 399.2, "duration": 1.82}, {"text": "It's covered in grey mud and rocks dusted with the remains of marine snow,", "start": 401.02, "duration": 4.38}, {"text": "which is consumed by animals like sea cucumbers, shrimp, sea urchins, and sea worms.", "start": 405.4, "duration": 5.66}, {"text": "In some regions of the seafloor, small, dark mineral deposits can be seen.", "start": 411.82, "duration": 4.24}, {"text": "These are manganese nodules.", "start": 416.96, "duration": 2.2}, {"text": "Deep-sea corals and sponges use them to anchor themselves on the bottom of the sea.", "start": 420.0, "duration": 4.36}, {"text": "Though life is sparse on the deep sea floor, even down here there are oases.", "start": 425.48, "duration": 4.94}, {"text": "In the rift valleys, where tectonic plates are splitting apart, magma heats up seawater and creates dark jets", "start": 430.82, "duration": 6.74}, {"text": "of water and minerals as hot as 400℃ that form elaborate chimneys and towers.", "start": 437.56, "duration": 5.8}, {"text": "Extremophile bacteria use the minerals to create organic substances that are the bases for unique ecosystems.", "start": 444.46, "duration": 6.6}, {"text": "As we descend further, we reach the deepest point of the abyssal plain at 6,000 meters.", "start": 452.02, "duration": 5.48}, {"text": "For most of the seafloor, this is as deep as it gets, but if we want to get to the deepest point of the oceans,", "start": 458.54, "duration": 6.18}, {"text": "we're actually only halfway there.", "start": 464.72, "duration": 1.92}, {"text": "Let's enter the hadal zone, the underworld of the sea.", "start": 467.7, "duration": 3.7}, {"text": "It consists of long narrow trenches that only make up around 0.25% of the oceans, and are among", "start": 472.34, "duration": 7.08}, {"text": "the most extreme environments on Earth.", "start": 479.42, "duration": 2.0}, {"text": "Only extremophiles exist down here, like the ethereal snailfish, that holds the record for the deepest living fish", "start": 482.18, "duration": 7.18}, {"text": "ever seen, at around 8,000 meters.", "start": 489.36, "duration": 2.44}, {"text": "We see spiky and sharp black rocks rush by as we sink down to more than 10,000.", "start": 492.88, "duration": 4.84}, {"text": "Until we reach the final slope, a trench inside the larger Mariana Trench with gently-sloping sides", "start": 498.78, "duration": 7.26}, {"text": "that enframe a valley about 1.6 kilometers wide.", "start": 506.04, "duration": 3.4}, {"text": "This is it.", "start": 510.46, "duration": 0.94}, {"text": "The deepest point, the Challenger Deep.", "start": 511.4, "duration": 2.8}, {"text": "11,000 meters below the surface.", "start": 514.96, "duration": 2.34}, {"text": "The water pressure here is 1,086 bar.", "start": 518.68, "duration": 3.62}, {"text": "Taking a swim here is like having to balance 1,800 elephants on top of you.", "start": 523.9, "duration": 4.22}, {"text": "But even here, life has found a way to thrive.", "start": 529.02, "duration": 2.9}, {"text": "Next to sea cucumbers, white and light pink amphipods wiggle their way through the water.", "start": 533.0, "duration": 4.88}, {"text": "Their size is astounding.", "start": 538.68, "duration": 1.74}, {"text": "While their shallow-water cousins are merely a few centimetres long, the deep-sea version", "start": 541.2, "duration": 4.4}, {"text": "can reach up to 30 centimeters.", "start": 545.6, "duration": 2.02}, {"text": "And there are other things floating elegantly through the water.", "start": 548.98, "duration": 3.64}, {"text": "Plastic bags that were found by scientists in 2018.", "start": 553.5, "duration": 3.34}, {"text": "Even the remotest place on Earth is not safe from human influence.", "start": 557.72, "duration": 4.22}, {"text": "There's nothing left to do now and our oxygen is running out, so we begin our ascent.", "start": 563.5, "duration": 5.72}, {"text": "[♪ Deep Sea Ambience ♪]", "start": 569.22, "duration": 9.92}, {"text": "After hours of traveling through dark nothingness, we finally see a glimpse of light.", "start": 579.14, "duration": 5.556}, {"text": "We arrive back at a calm surface.", "start": 584.9, "duration": 1.92}, {"text": "The oceans are so deep. There is so much of them.", "start": 588.08, "duration": 4.8}, {"text": "We owe it to ourselves and to our descendants to preserve them as well as we can.", "start": 593.66, "duration": 4.92}, {"text": "There are still so many wondrous things left to be discovered.", "start": 599.64, "duration": 4.08}, {"text": "So, you're all tingly now and want to go exploring.", "start": 607.96, "duration": 3.32}, {"text": "Why not start off with some juicy science? You can use our friends from Brilliant", "start": 611.98, "duration": 4.52}, {"text": "as your springboard for a knowledge deep dive.", "start": 616.5, "duration": 2.54}, {"text": "Brilliant is a website that helps you approach science in a practical way through interactive courses", "start": 619.94, "duration": 4.9}, {"text": "and daily problems in maths, science, and computer science.", "start": 624.84, "duration": 3.9}, {"text": "Instead of simply flooding you with information,", "start": 629.06, "duration": 2.96}, {"text": "you get the tools you need to untangle complex topics by yourself.", "start": 632.02, "duration": 2.84}, {"text": "It's hands-on learning, instead of chalk and talk.", "start": 635.56, "duration": 2.88}, {"text": "Plunge in and get to the bottom of courses about things like geometry, waves and light, gravitational physics", "start": 638.82, "duration": 6.08}, {"text": "and many more.", "start": 644.9, "duration": 1.04}, {"text": "Click the link in the description, or visit brilliant.org/nutshell to sign up for free", "start": 646.3, "duration": 4.5}, {"text": "and learn more things than there are fish in the sea.", "start": 650.8, "duration": 2.84}, {"text": "And there's an extra perk for Kurzgesagt viewers.", "start": 654.08, "duration": 2.72}, {"text": "The first 688 people to use the link", "start": 656.8, "duration": 3.0}, {"text": "get 20% off their annual membership, which lets you view all the daily problems in the archives", "start": 659.82, "duration": 4.72}, {"text": "and unlock every course.", "start": 664.54, "duration": 1.66}, {"text": "Brilliant helps you end your day a little smarter. Go ahead and take the plunge.", "start": 666.9, "duration": 5.0}, {"text": "Do you need more Vitamin Sea? We've also made an epic poster featuring some of the most fascinating creatures", "start": 672.48, "duration": 5.46}, {"text": "we encountered on our dive.", "start": 677.94, "duration": 1.52}, {"text": "It's much less work than an aquarium, but just as soothing and pretty.", "start": 680.18, "duration": 4.28}, {"text": "[♫ Outro Tune ♫]", "start": 685.22, "duration": 8.88}]