[{"text": "Shortly after we posted our Model M Keyboard video,", "start": 0.069, "duration": 3.35}, {"text": "we received a TON of requests to review what some have called the", "start": 3.419, "duration": 5.34}, {"text": "Model M of India,  the TVS Gold. It's a durable, value mechanical keyboard with Cherry switches", "start": 9.25, "duration": 7.789}, {"text": "(sort of) that's been around for many years and can be found all over India in banks, offices, or uncle's den.", "start": 17.35, "duration": 7.129}, {"text": "Unfortunately, it is not that easy to get your hands on in Canada,", "start": 25.449, "duration": 3.44}, {"text": "so we embarked on a months-long journey, including the help of the extended family members of one of our viewers to actually get one.", "start": 28.96, "duration": 8.88}, {"text": "But, with changes in quality and price,", "start": 38.22, "duration": 3.7}, {"text": "and competition from China, is the TVS Gold as good a deal as it used to be?", "start": 42.22, "duration": 5.06}, {"text": "Let's find out.", "start": 48.1, "duration": 2.0}, {"text": "Speaking of gold, Private Internet Access. It's gold, but not like expensive like gold, it's just really good like gold.", "start": 50.23, "duration": 7.279}, {"text": "Go get it. It protects you when you're online.", "start": 58.68, "duration": 2.06}, {"text": "So here I've got an original Model M from", "start": 69.04, "duration": 2.0}, {"text": "1986 and a TVS Gold from June 2018, now it's pretty obvious", "start": 71.04, "duration": 5.78}, {"text": "that the TVS Gold took some design cues from the Model M, like the lock lights for example, they are", "start": 76.86, "duration": 7.22}, {"text": "identical, but there are some notable differences though, like this ridge for example that you can use to hold a pencil", "start": 84.08, "duration": 8.04}, {"text": "or even two pencils.", "start": 92.46, "duration": 2.0}, {"text": "Also, the plastics themselves are pretty different", "start": 95.22, "duration": 2.779}, {"text": "Now Model Ms were made with durable high quality plastics", "start": 98.0, "duration": 3.72}, {"text": "including PBT keycaps, by contrast both the key caps and the chassis of the TVS Gold are made of the more common", "start": 101.72, "duration": 7.68}, {"text": "ABS plastic, which can get that kind of that polished shiny look over time from the oils in your hands.", "start": 109.5, "duration": 5.96}, {"text": "So we were able to confirm this with a quick acetone test. Going further,", "start": 115.47, "duration": 4.61}, {"text": "we can also see that the white lettering is coming off even though the letter outline remains.", "start": 120.08, "duration": 4.949}, {"text": "That's because the legend on the TVS Gold is laser etched,", "start": 125.25, "duration": 3.559}, {"text": "which essentially means that it's got a groove burned in the top of the key cap, then in this case", "start": 128.81, "duration": 5.82}, {"text": "it's filled in with a colorant.", "start": 134.63, "duration": 2.0}, {"text": "So this kind of lettering isn't the most durable, but it's much better than pad printing which is what most budget keyboards use.", "start": 136.65, "duration": 7.7}, {"text": "So it should last you reasonably well even in a professional environment.", "start": 144.35, "duration": 3.359}, {"text": "The next thing that a lot of TVS Gold users talk about is the layout.", "start": 148.41, "duration": 4.039}, {"text": "Now, at first glance", "start": 153.03, "duration": 2.029}, {"text": "it looks like it has the same North American key layout that was pioneered by the Model M,", "start": 155.19, "duration": 5.269}, {"text": "but it actually has a bigger enter key and a smaller backspace key.", "start": 160.89, "duration": 6.5}, {"text": "Which that second one in particular can be really frustrating if you're not used to it.", "start": 167.39, "duration": 4.65}, {"text": "I actually experienced this for myself on Steel Series' 7G.", "start": 172.04, "duration": 4.28}, {"text": "Though with that said, you shouldn't confuse this layout with the European", "start": 176.84, "duration": 4.6}, {"text": "ISO layout which also has a tall enter key. No,", "start": 181.59, "duration": 3.44}, {"text": "no.", "start": 185.03, "duration": 0.15}, {"text": "This one is actually a special layout called Index Script or INSCRPIT,", "start": 185.18, "duration": 4.58}, {"text": "which was ratified by the government of India in the early 1990s,", "start": 189.76, "duration": 3.7}, {"text": "and it's designed to work with 12 different Indian scripts. This keyboard,", "start": 193.6, "duration": 4.78}, {"text": "by the way, was also the first one ever to have the Indian Rupee sign printed on the legend, though", "start": 198.38, "duration": 5.579}, {"text": "you may find yourself needing to go through some extra steps in order to actually get it working.", "start": 204.38, "duration": 4.94}, {"text": "Now let's talk about the typing experience.", "start": 209.32, "duration": 2.62}, {"text": "Now traditionally, TVS Gold keyboards shipped with Cherry MX Blue key switches.", "start": 212.24, "duration": 4.88}, {"text": "So these are high-quality,", "start": 218.489, "duration": 2.0}, {"text": "German-engineered switches with a clicky, tactile feel", "start": 220.5, "duration": 3.42}, {"text": "and a distinctive sound that makes them beloved by typists the world over.", "start": 223.92, "duration": 4.56}, {"text": "And the fact that a keyboard that you could usually find for between seventeen hundred and twenty three hundred Rupees came with real cherry switches", "start": 228.84, "duration": 6.92}, {"text": "was almost a miracle.", "start": 236.099, "duration": 2.0}, {"text": "Except for one small problem,", "start": 238.92, "duration": 2.0}, {"text": "sometime near the end of 2017,", "start": 241.34, "duration": 2.3}, {"text": "(I'm trying to pop one of these off. You're not supposed to do it like this.)", "start": 243.9, "duration": 3.12}, {"text": "[Struggling sounds]", "start": 249.04, "duration": 1.44}, {"text": "Get off you bastard.", "start": 250.62, "duration": 2.0}, {"text": "Yes, here we go wait, Long Hua?", "start": 255.03, "duration": 4.04}, {"text": "Do they? Good. TVS stopped shipping Golds with Cherry switches with all of the newborns getting equipped with", "start": 260.699, "duration": 7.52}, {"text": "Chinese clones made by Kailh.", "start": 268.95, "duration": 2.689}, {"text": "Now to be clear the Kailh blue switches are still mechanical and they actually use the same design as the Cherry's,", "start": 272.24, "duration": 6.98}, {"text": "you might say they ripped them off, so they still have that clicky feel", "start": 279.22, "duration": 4.16}, {"text": "and if this is your first mechanical keyboard", "start": 283.46, "duration": 2.04}, {"text": "you'll probably love them,", "start": 285.51, "duration": 2.0}, {"text": "but it kind of raises the question, in a world where budget mechanical keyboards are becoming more and more available is", "start": 287.58, "duration": 7.61}, {"text": "The TVS Gold still even a good deal? Especially", "start": 295.38, "duration": 2.869}, {"text": "considering that the price has moved up, rather than down,", "start": 298.92, "duration": 3.1}, {"text": "into the twenty seven hundred to thirty five hundred Rupee range.", "start": 302.42, "duration": 3.86}, {"text": "I mean at that price, why not get a keyboard from Cosmic Byte or Redgear, that has more switch options, an updated look,", "start": 306.72, "duration": 7.26}, {"text": "gaming features like anti-ghosting and windows key lock, not to mention freaking RGB. So then,", "start": 314.3, "duration": 6.28}, {"text": "given the recent decrease in switch quality and increase in price", "start": 321.09, "duration": 4.16}, {"text": "the TVS Gold is no longer the outstanding value that it once was,", "start": 325.32, "duration": 4.54}, {"text": "especially considering the competition, but that doesn't mean that it's a bad keyboard.", "start": 330.06, "duration": 4.95}, {"text": "So if you like the vintage look and you won't be bothered too much by the shortened backspace key,", "start": 335.01, "duration": 4.199}, {"text": "then the TVS Gold is still a classic in its own right, just", "start": 339.24, "duration": 3.78}, {"text": "be sure to order from Amazon,", "start": 343.36, "duration": 1.68}, {"text": "even if it's cheaper at your local computer shop. That way you'll get a one-year warranty to protect you from their easily crushed boxes.", "start": 345.04, "duration": 6.619}, {"text": "Speaking of easily crushed, I'll be crushed", "start": 353.56, "duration": 2.779}, {"text": "if you don't listen to this message from Pulseway.", "start": 356.34, "duration": 2.58}, {"text": "Pulseway is a real-time remote monitoring and management software that allows you to manage and monitor", "start": 359.23, "duration": 5.437}, {"text": "(go figure right) in real-time from one app,", "start": 364.667, "duration": 2.322}, {"text": "compatible machines that run Windows, Mac OS or Linux.", "start": 367.42, "duration": 5.02}, {"text": "You can get access to real-time status reports, system resources,", "start": 372.44, "duration": 2.349}, {"text": "logged in users, network performance, Windows updates and more,", "start": 375.1, "duration": 4.94}, {"text": "and you can fix problems on the go by sending commands from any mobile device.", "start": 380.04, "duration": 2.699}, {"text": "You can even create and deploy custom scripts, so that you can automate your IT tasks. So try it for free at", "start": 383.14, "duration": 6.859}, {"text": "Pulseway.com at the link in the video description. So thanks for watching guys", "start": 390.0, "duration": 4.77}, {"text": "If you liked this video then you know what to do hit that like button,", "start": 395.17, "duration": 3.199}, {"text": "but if it wasn - wait,", "start": 398.41, "duration": 1.31}, {"text": "if it wasn't awesome, wait, if it sucked I usually say that. So thanks for watching guys", "start": 399.72, "duration": 3.51}, {"text": "If this video sucked you can hit that button,", "start": 403.23, "duration": 2.429}, {"text": "but if you liked it hit like, get subscribed or consider checking out where to buy the stuff", "start": 405.66, "duration": 3.48}, {"text": "we featured at the link in the video description.", "start": 409.14, "duration": 2.0}, {"text": "Also down there is our merch store which has cool shirts like the one I'm wearing", "start": 411.3, "duration": 3.04}, {"text": "and our community forum, which you should definitely join.", "start": 414.34, "duration": 2.38}, {"text": "[Linus farts]", "start": 418.5, "duration": 0.96}, {"text": "(Jesus.)", "start": 419.46, "duration": 1.8}, {"text": "Well no one's over here, who cares?", "start": 421.26, "duration": 1.98}, {"text": " ", "start": 423.24, "duration": 1.64}, {"text": " ", "start": 424.88, "duration": 2.0}]