[{"text": "Two years ago, I wrote a video called “The Cultural Significance of Snapcaster Mage”, which felt very much like a eureka moment for me in realizing I could combine my academic interests with my favorite game.", "start": 0.1, "duration": 10.02}, {"text": "It was my first “video essay”, a label I don’t really like but will use because it’s become the popular descriptor for this kind of medium.", "start": 10.7, "duration": 6.72}, {"text": "It’s also far and beyond my least favorite piece of work to date: the editing was sloppy, the voice-over was muddled and echoey, and most importantly, the tone was unnecessarily dramatic and whiny.", "start": 18.08, "duration": 10.86}, {"text": "I find it unwatchable now.", "start": 29.12, "duration": 1.66}, {"text": "So today, I want to pay better service to the point I was pushing in that video with a little more perspective and experience in mind.", "start": 31.38, "duration": 6.9}, {"text": "Okay. Here we go.", "start": 38.66, "duration": 1.12}, {"text": "The story goes like this: In 1996, in an effort to promote The Duelist magazine, Mark Rosewater pitched the idea of a Magic All-Star game that would pit the season’s top 16 players against one another in a round robin tournament full of wacky formats.", "start": 43.3, "duration": 14.7}, {"text": "Due to budget constraints, this tournament would have a zero dollar prize purse.", "start": 58.54, "duration": 3.9}, {"text": "Instead of cash, the winner would walk away with the unique opportunity to design their own Magic card.", "start": 62.8, "duration": 5.14}, {"text": "Olle Rade won the very first Invitational in Hong Kong on the back of Snake Basket and designed two cards that never saw print.", "start": 68.16, "duration": 6.84}, {"text": "The first was a World Enchantment in Red with no oracle text: its design would simply act as a way to destroy other World Enchantments in play.", "start": 75.62, "duration": 7.54}, {"text": "This effect was nerfed with the Visions rules change, rendering Olle’s design completely useless.", "start": 83.82, "duration": 5.32}, {"text": "His follow-up card was a 1UU counter spell that put itself back on top of its owner’s library when it resolved.", "start": 89.4, "duration": 6.42}, {"text": "This was rejected for being entirely too strong.", "start": 96.34, "duration": 2.82}, {"text": "Olle’s third card design would come years later following a hiatus from Magic to join the armed forces.", "start": 99.86, "duration": 5.2}, {"text": "As such, the first Invitational card to actually see print was designed by the second year’s winner, Darwin Kastle.", "start": 105.48, "duration": 6.76}, {"text": "His original submission was very close to the final iteration of Avalanche Riders, but it lacked the Echo cost and was upgraded to have Haste by R&D.", "start": 112.52, "duration": 8.44}, {"text": "Now here’s the kicker: Invitational cards sport the likeness of the professional players who designed them.", "start": 121.58, "duration": 5.18}, {"text": "This aspect started here, with Kastle’s face on Avalanche Riders, after Mark Rosewater sent in a photo of the winner to Edward P Beard Jr alongside the art description.", "start": 127.14, "duration": 9.36}, {"text": "This unintentionally sparked the tradition that is now most associated with and debated about these cards.", "start": 136.96, "duration": 5.56}, {"text": "In the nine years that followed came a string of powerful designs by some of the game’s most renown players.", "start": 142.88, "duration": 5.04}, {"text": "In 2000, Chris Pikula designed Meddling Mage, which originally was a mono blue three drop but was reworked to include white to match Planeshift’s multicolor theme.", "start": 148.38, "duration": 9.54}, {"text": "Later that same year, John Finkel won the Invitational in Sydney and lobbied for a four mana wrath that untapped four lands upon its resolution.", "start": 158.26, "duration": 8.42}, {"text": "This was heavily downgraded to Shadowmage Infiltrator, which is admittedly not a bad card, but was overshadowed by another three drop of the era that held the same mana cost.", "start": 167.02, "duration": 9.62}, {"text": "In 2001, Kai Budde won Cape Town. Voidmage Prodigy was the reworking of his enchantment design, but was nerfed by R&D’s Future Future League after eliminating the supporting cast of Wizards that would synergize with its ability.", "start": 177.0, "duration": 13.5}, {"text": "To boot, the original card’s likeness depicted an unflattering Kai, which was reimagined two years later on a promo card with new artwork by Christopher Moeller.", "start": 190.92, "duration": 8.76}, {"text": "And here is where I will pause.", "start": 199.8, "duration": 1.64}, {"text": "Because now, looking back at the Invitational, the likeness of the game’s greatest players is where fans of the cards are divided.", "start": 201.86, "duration": 6.5}, {"text": "Since 2007, the final year of the tournament, only four of the eleven Invitational cards have not been reprinted.", "start": 208.78, "duration": 6.96}, {"text": "The other seven posses new depictions of these players’ creations but are void of their faces.", "start": 216.1, "duration": 5.02}, {"text": "Two years ago, I used Snapcaster Mage as an example to criticize this practice as erasing history.", "start": 221.7, "duration": 5.66}, {"text": "Now, though, I’ve come to fully embrace this change.", "start": 227.96, "duration": 2.54}, {"text": "So let’s look at Snapcaster Mage again.", "start": 231.14, "duration": 1.88}, {"text": "The card is the perfect storm of flavor and function and has become one of the game’s most powerful and iconic creatures.", "start": 233.4, "duration": 5.98}, {"text": "Since its printing in Innistrad, it has made waves in every constructed format.", "start": 239.96, "duration": 3.98}, {"text": "As is rare in the hyped-up environment that is spoiler season, browsing old forums has shown me that just about everyone evaluated Snapcaster Mage correctly upon its debut, calling the card a tempo powerhouse capable of eternal play forever.", "start": 244.5, "duration": 13.98}, {"text": "It flexed its muscles in the Bant Flicker deck of Return to Ravnica Standard, then became a staple in a myriad of Modern and Legacy blue decks running counterspells and cheap cantrips.", "start": 258.86, "duration": 9.7}, {"text": "(Announcer): Snapcaster Mage. Here it comes.", "start": 268.56, "duration": 2.42}, {"text": "(Dickman): Targeting Lightning Bolt. Yep.", "start": 270.98, "duration": 1.96}, {"text": "As most players know, though, this card was not supposed to see print.", "start": 272.94, "duration": 3.86}, {"text": "In 2007, when Tiago Chan won the Invitational in Germany, he submitted a card called ‘Denying Channel’, which I just noticed recently is probably a play on words of his last name.", "start": 277.2, "duration": 10.54}, {"text": "Anyway, the card was a land that tapped for colorless mana and had an activated ability of 2UU, discard Denying Channel, counter target spell.", "start": 288.28, "duration": 8.44}, {"text": "Now, many folks think that this was far and beyond worse than Snapcaster Mage, but judging by the reach and utility of a card like Ramunap Ruins, there may be room to reconsider.", "start": 297.2, "duration": 9.78}, {"text": "Regardless, Snapcaster Mage is what was accepted.", "start": 307.48, "duration": 3.04}, {"text": "(Aaron Forsythe): In the lineage of insanely powerful invitational cards, this guy fits right in.", "start": 310.52, "duration": 4.6}, {"text": "2007 also marked the end of the invitational: that was ten years ago, and since then, Snapcaster Mage has been reprinted twice.", "start": 315.3, "duration": 7.64}, {"text": "Twice it has rebounded and maintained its market value, and twice it has been celebrated for successful pieces of new art.", "start": 323.5, "duration": 7.0}, {"text": "What I failed to remember on my first pass of this subject is that Magic is better the more it is customizable.", "start": 331.0, "duration": 6.22}, {"text": "I also overlooked the fact that these cards have functionally never changed.", "start": 337.72, "duration": 4.18}, {"text": "Dark Confidant is still triggering accidental suicides.", "start": 342.62, "duration": 2.8}, {"text": "Ranger of Eos is still tutoring up two cards.", "start": 346.14, "duration": 2.96}, {"text": "But the game is now richer with Ryan Pancoast’s illustration on its reprint.", "start": 349.6, "duration": 4.3}, {"text": "Seriously, this GumRoad episode of the time-lapse from start to finish is a delight, and the foil copies are even more enchanting.", "start": 354.36, "duration": 7.44}, {"text": "And of course, the older versions are still available for anyone wishing to pay tribute to the designers.", "start": 362.14, "duration": 5.0}, {"text": "Mike Linnemann has offered up a few ways of paying them homage with new art that bares no likeness to the Invitational winners.", "start": 367.54, "duration": 6.32}, {"text": "One way is through italicized credit in the text box in much the same style of M15’s guest cards.", "start": 374.28, "duration": 6.1}, {"text": "Another is by cleverly paying tribute to the original art, but this takes more coordination between artists and directors.", "start": 380.68, "duration": 7.0}, {"text": "Magic could pull this off, and I’d love to see it, too.", "start": 388.02, "duration": 3.0}, {"text": "More importantly, though, I see the Invitational cards now as an opportunity for Wizards to move horizontally: the creative teams can explore old worlds and create new characters, which gives players more room to pick and choose their favorites.", "start": 391.54, "duration": 12.6}, {"text": "This is, after all, the linchpin to Magic’s success. It also gives them room to return to and rework their own ideas, just like I am with this video.", "start": 404.48, "duration": 8.92}, {"text": "When mistakes are forever preserved by the nature of printed cards, it’s nice to have some freedom and flexibility to revisit an old space.", "start": 413.9, "duration": 7.18}, {"text": "And hey, likeness isn’t fully phased out of Magic.", "start": 421.38, "duration": 2.68}, {"text": "Star City Games has continued the tradition with their own version of the Invitational, which rewards winners with custom tokens that resemble the players who finish on top.", "start": 424.54, "duration": 8.32}, {"text": "(Announcer): Dylan Donegan has just won the season 4 Invitational here in Seattle!", "start": 433.12, "duration": 7.58}, {"text": "Sometimes, too, we get conspicuous lookalikes that slip through the cracks and recall familiar faces in the pro scene.", "start": 441.2, "duration": 6.44}, {"text": "Harnessed Lightning resembling Travis Woo and Murderous Compulsion looking eerily like Brian Kibler are some of the recent gems.", "start": 448.14, "duration": 7.06}, {"text": "And artists themselves are perhaps the most guilty of incorporating their own likeness into the game.", "start": 455.88, "duration": 4.64}, {"text": "Volkan Baga, the artist of the original Snapcaster Mage, has done this quite a few times.", "start": 460.98, "duration": 5.36}, {"text": "Karl Kopinski has done it, too. While illustrators often must use themselves as reference for their painting, I think this is a clever and fun way to immortalize themselves into Magic’s visual history.", "start": 466.98, "duration": 12.2}, {"text": "So to wrap up here, I want to encourage players to embrace the letting go of old traditions.", "start": 479.96, "duration": 4.98}, {"text": "By doing so, we are rewarded with more utility and availability of our favorite card designs.", "start": 485.52, "duration": 4.94}, {"text": "We also get spoiled with new art and much-needed reprints that lets us play with these cards in supplemental sets to come.", "start": 490.96, "duration": 6.76}, {"text": "And if ever you’re in need of a great story, the Invitational cards will always be there.", "start": 498.3, "duration": 4.28}, {"text": "This episode was made possible through a proud partnership with Card Kingdom. Use affiliate link \"Studies\" to help support the show and pick up Magic products in a Snap!", "start": 504.74, "duration": 10.7}, {"text": "You know of all the iterations of Snapcaster Mage we've seen through the years—Torrential Gearhulk, Goblin Darkdwellers, and the like—this seems to be like the most busted one. I got to play with Kess this weekend in my Commander playgroup... the card is so good! It's so freakin' good!", "start": 516.1, "duration": 15.3}, {"text": "I'd love to see it make some waves in Vintage or Legacy—that would be sweet!", "start": 531.8, "duration": 4.96}, {"text": "Alright, if you enjoyed the video, of course thanks for watching. I appreciate it. Go and check out more of my Card Studies here or on my website: Rhysticstudies.com.", "start": 537.22, "duration": 6.58}, {"text": "I'd like to push Cardkingdom, they are my proud partner in all of this and of course, if you would like to help me keep going, then there's always the Patreon page which has a bunch of perks: signed cards—if you watched the Rancor video, we are sending out singed Rancors this month. I like to treat my Patrons well. They keep me going.", "start": 544.0, "duration": 19.58}, {"text": "That's about it! Let me know what your favorite Invitational card is in the comments and what you think about Snapcaster Mage; it's one of my favorite creatures. I think it's LSV's 'Best Creature of All Time'.", "start": 564.0, "duration": 11.86}, {"text": "I enjoyed going down the rabbit hole and taking a look at an old piece of work of mine and also an old debate that I think needs to be put to rest by now.", "start": 577.26, "duration": 9.14}, {"text": "So, this was a fun video, I hope you enjoyed! Thanks again for watching, guys!", "start": 587.6, "duration": 3.1}, {"text": "Cheers!", "start": 591.02, "duration": 0.56}]