[{"text": "This video is sponsored by Squarespace.", "start": 0.74, "duration": 3.0}, {"text": "It was an early morning some eighty miles south of the Danube.", "start": 5.54, "duration": 3.32}, {"text": "The sun was still hiding behind the horizon, as the dawn mist slowly began to vanish from the plain.", "start": 8.86, "duration": 5.62}, {"text": "As visibility increased, Emperor John Komnenos sighed, watching,", "start": 14.48, "duration": 4.64}, {"text": "as not a mere mile away, workers were digging ditches to reinforce the already well-defended enemy camp.", "start": 19.12, "duration": 6.98}, {"text": "One of the most important battles of his reign is about to begin.", "start": 26.26, "duration": 4.62}, {"text": "It’s late spring of the year 1118.", "start": 43.1, "duration": 3.2}, {"text": "More than thirty five years have passed since Alexios Komnenos entered the mighty city of Constantinople", "start": 46.48, "duration": 6.38}, {"text": "to depose the previous emperor and take over the imperial throne.", "start": 52.86, "duration": 4.34}, {"text": "Thanks to this bold move, the Eastern Roman Empire finally turned itself from the path of steady decline leading to inevitable doom,", "start": 57.2, "duration": 8.48}, {"text": "and entered into a period of uneasy reconstruction for the decaying state.", "start": 65.68, "duration": 4.98}, {"text": "Emperor Alexios, though not always successful, put an enormous amount of work towards reviving the Byzantine economy,", "start": 71.0, "duration": 7.66}, {"text": "clamping down on separatist factions within the realm and securing a relatively strong position in the region.", "start": 78.96, "duration": 6.34}, {"text": "But in early 1118, while the trees in the gardens of Constantinople were blooming in abundance,", "start": 85.8, "duration": 5.96}, {"text": "the health of Emperor Alexios was steadily deteriorating.", "start": 92.04, "duration": 3.52}, {"text": "Even though he took care of the matter regarding his succession,", "start": 95.88, "duration": 3.38}, {"text": "naming his oldest son John as heir and co-emperor many years ago,", "start": 99.5, "duration": 4.5}, {"text": "Alexios’ declining vigor prompted his wife Irene and his oldest daughter Anna to scheme against John,", "start": 104.22, "duration": 7.12}, {"text": "planning to enthrone Anna’s husband Nikephoros instead.", "start": 111.34, "duration": 4.2}, {"text": "It would seem that the empire’s recently restored unity, was under threat.", "start": 115.88, "duration": 5.48}, {"text": "Half a year later, in the middle of August, Alexios fell ill once again, this time the ailment proving stronger than ageing man.", "start": 121.82, "duration": 8.86}, {"text": "Upon the death of his father, John acted swiftly to claim the imperial throne, anticipating the schemes of his immediate family.", "start": 130.74, "duration": 8.16}, {"text": "It’s worth adding, that his early success was partially made possible by his brother-in-law, Nikephoros,", "start": 139.18, "duration": 6.7}, {"text": "who refused to enter into the conspiracy, as he apparently disregarded the idea of revolt against the rightful heir,", "start": 146.02, "duration": 7.4}, {"text": "and remained John’s loyal retainer.", "start": 153.42, "duration": 2.74}, {"text": "The new emperor quickly emerged as a just and level-headed leader.", "start": 156.34, "duration": 4.02}, {"text": "Remembering his father’s struggle against various claimants throughout his reign,", "start": 160.46, "duration": 4.1}, {"text": "John solidified his position by banishing his scheming sister to a monastery", "start": 164.68, "duration": 4.82}, {"text": "and picking his advisors and generals from outside the Byzantine court.", "start": 169.7, "duration": 4.4}, {"text": "With his backing secured, and since his inherited empire was in quite good shape, mainly thanks to late Alexios’ tireless efforts,", "start": 174.3, "duration": 8.22}, {"text": "John was able to continue where his father had left off.", "start": 182.52, "duration": 4.14}, {"text": "His main goal, obviously, was to regain control of the lands of Anatolia,", "start": 187.08, "duration": 4.9}, {"text": "painfully torn away from the empire fifty years earlier in the wake of the disastrous Battle of Manzikert against the Seljuk Turks.", "start": 192.04, "duration": 8.56}, {"text": "Early in 1119 John assembled an army and began a robust campaign to reclaim the lost territory.", "start": 200.9, "duration": 8.32}, {"text": "In the span of the next three years, he wisely exploited the lack of unity among the Seljuk Turks and drove them back,", "start": 209.74, "duration": 7.72}, {"text": "capturing the cities of Laodicea and Sozopolis,", "start": 217.46, "duration": 3.28}, {"text": "thus connecting the isolated port of Attaleia.", "start": 220.74, "duration": 3.78}, {"text": "Subsequently, he reclaimed some territories along the southern coast, up to Armenian Cilicia,", "start": 224.7, "duration": 6.46}, {"text": "essentially restoring land communication with the Crusader States in Levant.", "start": 231.16, "duration": 5.12}, {"text": "Quite a remarkable feat,", "start": 236.62, "duration": 1.68}, {"text": "but John’s efforts to restore Byzantine rule on his new acquisitions was soon disrupted by an envoy arriving from the capital.", "start": 238.3, "duration": 8.4}, {"text": "The news was disconcerting: a Pecheneg horde had forced its way through the insufficient defences along the Danube", "start": 247.26, "duration": 6.96}, {"text": "and had entered the province of Paristrion.", "start": 254.22, "duration": 2.74}, {"text": "As the threat of losing such a rich province in the Balkans was too daunting,", "start": 256.96, "duration": 5.08}, {"text": "John had no other choice; he immediately ceased his campaign in Asia Minor and marched back to Europe,", "start": 262.04, "duration": 6.78}, {"text": "upon stationing a token force to secure his new holdings in Anatolia.", "start": 268.82, "duration": 5.04}, {"text": "Pecheneg invaders were not a new threat to the Eastern Romans, as throughout the 11th century, they frequently forayed into Byzantine lands.", "start": 274.1, "duration": 8.72}, {"text": "They were badly defeated roughly thirty years earlier by Emperor Alexios in Southern Thrace,", "start": 283.1, "duration": 5.8}, {"text": "but this time, another horde had crossed the Danube,", "start": 288.9, "duration": 3.28}, {"text": "most likely an expelled group from the steppes of Kievan Rus.", "start": 292.18, "duration": 4.52}, {"text": "Nevertheless, in the spring of the year 1122,", "start": 297.2, "duration": 3.84}, {"text": "eager to quickly dispel the unexpected threat, Emperor John marched his troops to meet the enemy,", "start": 301.2, "duration": 5.8}, {"text": "reported to be camping near the city of Beroia.", "start": 307.0, "duration": 3.62}, {"text": "Upon arriving to the location, John saw a large, well-fortified camp.", "start": 310.86, "duration": 4.56}, {"text": "The defensive wagon fort consisting of reinforced baggage carts linked together and a deep ditch dug up in front of them.", "start": 315.7, "duration": 7.74}, {"text": "Even the least experienced of the Eastern Roman soldiers could see,", "start": 323.62, "duration": 3.54}, {"text": "that forcing the Pecheneg camp to yield would be harder than one might have imagined.", "start": 327.36, "duration": 4.96}, {"text": "John was aware of this too and in order to increase his chances of a swift victory, he decided to deceive the enemy.", "start": 332.7, "duration": 7.64}, {"text": "Byzantine envoys were sent to offer the Pecheneg chieftains gifts and promises,", "start": 340.66, "duration": 4.78}, {"text": "but in fact it was just a half-hearted attempt to lower their guard.", "start": 345.58, "duration": 4.6}, {"text": "Yet this ploy actually worked and upon seeing some relaxation among the Pecheneg ranks,", "start": 350.56, "duration": 5.5}, {"text": "John commanded a significant part of his infantry to frontally attack the wagon fort.", "start": 356.18, "duration": 5.52}, {"text": "The rhythmic trudge of moving units filled the plain, as the Byzantines moved forward", "start": 362.08, "duration": 5.3}, {"text": "and, enduring the first salvoes from archers, eventually struck the wall of carts", "start": 367.38, "duration": 5.54}, {"text": "But by this time, the Pechenegs fortifications were again fully manned and ready to push back the enemy.", "start": 373.04, "duration": 6.6}, {"text": "The battle ensued, as imperial troops struggled to overcome the dogged defence of the Turkic nomads and force their way through.", "start": 380.04, "duration": 8.28}, {"text": "But just as the sun rose on the horizon, so too rose the casualties on John’s side.", "start": 388.78, "duration": 5.44}, {"text": "His men were additionally harassed by Pecheneg horse archers ,", "start": 394.44, "duration": 3.44}, {"text": "who managed to ride behind the first line of the attackers and wreak havoc on their rear,", "start": 398.0, "duration": 5.2}, {"text": "only adding to the death toll.", "start": 403.2, "duration": 2.74}, {"text": "Soon, the Emperor was lightly wounded in the leg by an arrow,", "start": 406.32, "duration": 3.68}, {"text": "and upon realising that the attack was going nowhere, ordered a retreat.", "start": 410.18, "duration": 4.7}, {"text": "Though the gains were marginal, John didn’t give up and upon treating his wound", "start": 415.42, "duration": 5.28}, {"text": "came up with another bold plan.", "start": 420.8, "duration": 3.0}, {"text": "Yet another frontal attack was to be performed, but this time utilising the Varangian Guard as a spearhead of the second assault.", "start": 424.04, "duration": 8.42}, {"text": "The Varangian Guard was a foreign elite heavy infantry unit of the Eastern Roman Army,", "start": 432.92, "duration": 4.92}, {"text": "whose members served as personal bodyguards for the Emperor.", "start": 438.12, "duration": 3.66}, {"text": "With their flanks secured by other heavy troops, almost five hundred of the Emperor’s finest soldiers,", "start": 441.98, "duration": 6.26}, {"text": "mostly of Norse and Anglo-Saxon origin, advanced in the centre, leading the army to meet the enemy.", "start": 448.24, "duration": 7.16}, {"text": "The sight of hundreds of stalwart warriors, clad in superior armour glittering in the sun", "start": 455.62, "duration": 5.88}, {"text": "and armed with shields and long Danish axes", "start": 461.5, "duration": 2.92}, {"text": "moving steadily towards Pecheneg fortifications must have been daunting.", "start": 464.46, "duration": 5.14}, {"text": "Finally, the Varangian Guard, with incredible force, hit the defenders and another bloody struggle ensued.", "start": 469.78, "duration": 7.54}, {"text": "But this time, the attack yielded better results for the emperor.", "start": 477.48, "duration": 4.64}, {"text": "With morale boosted by the Emperor’s personal contribution,", "start": 482.38, "duration": 3.5}, {"text": "fighting side by side with his rank-and-file men,", "start": 486.14, "duration": 2.96}, {"text": "the Varangians swiftly hacked their way through the wagon fort and Pecheneg defenders behind it.", "start": 489.3, "duration": 6.06}, {"text": "This was a serious hit to the nomads’ spirit.", "start": 495.78, "duration": 3.02}, {"text": "Soon Byzantine soldiers managed to slowly breach the defensive line and in no time,", "start": 499.02, "duration": 5.64}, {"text": "many Pechenegs lost faith and ran from the battlefield.", "start": 504.9, "duration": 3.6}, {"text": "Many were killed and even more were taken into captivity in the general rout that followed.", "start": 508.92, "duration": 5.8}, {"text": "Despite some losses, it was a great victory for John Komnenos, whose bold tactics and usage of elite troops", "start": 515.6, "duration": 7.78}, {"text": "as a key element of his plan brought lasting fame for the Eastern Roman army and Varangians serving the Emperor.", "start": 523.38, "duration": 8.62}, {"text": "The Battle of Beroia soon proved to be the demise of the Pecheneg people as an independent force,", "start": 532.5, "duration": 6.3}, {"text": "which in turn significantly increased the safety of the European part of John’s empire,", "start": 538.86, "duration": 4.94}, {"text": "bringing him the gratitude of his people and adding to his ever growing fame as one of the most successful Eastern Roman Emperors.", "start": 544.02, "duration": 8.88}, {"text": "This video is sponsored by SquareSpace.", "start": 555.82, "duration": 2.32}, {"text": "If you’re looking for a platform to build a web-space that integrates functionality and versatility in a modular approach,", "start": 558.36, "duration": 6.38}, {"text": "then SquareSpace is the ally you’ve been looking for.", "start": 564.92, "duration": 3.02}, {"text": "With great features such as: Email Campaigning to promote your content and get your message heard.", "start": 568.08, "duration": 4.96}, {"text": "Social Sharing that lets you ingest and send out to all major social media platforms.", "start": 573.16, "duration": 4.98}, {"text": "And our personal favorite, Integrated Analytics providing key intel on what is drawing the most attention in your web-sphere.", "start": 578.22, "duration": 6.98}, {"text": "If you’re looking to put yourself out there, create content, provide services or just want to tell your own stories,", "start": 585.32, "duration": 5.62}, {"text": "then click the link in the discretion below, visit squarespace.com/bazbattles and not only will you be supporting our channel", "start": 590.94, "duration": 7.36}, {"text": "but you will save 10% on your first purchase, helping you put yourself out there.", "start": 598.3, "duration": 5.86}]