[{"text": "[indistinct shouting]", "start": 1.26, "duration": 2.02}, {"text": "- No steal. There's no steal there. I predict not a steal, watch this:", "start": 4.52, "duration": 4.2}, {"text": "...and he stayed.", "start": 11.62, "duration": 2.0}, {"text": "[excited]\nHe's gonna steal! This is a steal!", "start": 17.34, "duration": 2.3}, {"text": "If this app works, this kid's about to steal!", "start": 19.64, "duration": 1.8}, {"text": "[excited squealing]\nThere he goes!", "start": 21.44, "duration": 1.44}, {"text": "There he goes!", "start": 25.12, "duration": 1.2}, {"text": "Freakin' works!\nIt works.", "start": 26.8, "duration": 2.28}, {"text": "Two years ago I came up with an idea for an app where you could decode baseball signs", "start": 29.28, "duration": 4.4}, {"text": "So you would know when the other team was going to steal, even after just the first inning.", "start": 33.69, "duration": 4.13}, {"text": "Then in a covert effort to get people more interested in coding the machine learning,", "start": 37.82, "duration": 3.52}, {"text": "I would make the app free and available to everyone. \nI'm happy to report...", "start": 41.34, "duration": 3.239}, {"text": "It's no longer just an idea.", "start": 44.8, "duration": 1.94}, {"text": "Today I'm going to show you exactly how the app works, and we'll use it in the wild,", "start": 47.24, "duration": 3.6}, {"text": "and then we're going to talk about machine learning in very simple terms with my buddy Jabril.", "start": 50.84, "duration": 4.04}, {"text": "But first, to set the stage we need to understand the fascinating world of secret baseball signs.", "start": 54.88, "duration": 5.36}, {"text": "It's the game within the game.", "start": 60.24, "duration": 1.9}, {"text": "Most people know the catcher will give signs to the pitcher when your team is on defense.", "start": 62.28, "duration": 3.48}, {"text": "But when you're on offense, the third-base coach gives signs to both the batter and the base runner.", "start": 65.76, "duration": 5.06}, {"text": "For example, he could secretly tell the batter to bunt, or to not swing at the next pitch,", "start": 70.82, "duration": 4.66}, {"text": "or he can tell the base runner to steal.", "start": 75.48, "duration": 2.12}, {"text": "And just to be clear, stealing a base is when you start running as soon as the pitches thrown,", "start": 77.7, "duration": 4.08}, {"text": "instead of waiting for the batter to try and hit it.", "start": 81.78, "duration": 1.94}, {"text": "It's risky because if the batter doesn't hit the ball and the catcher is good,", "start": 83.72, "duration": 3.67}, {"text": "he can throw you out at second base.", "start": 87.39, "duration": 2.13}, {"text": "Because it's a big advantage, coaches will actually tell their players to watch", "start": 89.52, "duration": 3.8}, {"text": "and see if they could figure out the other team's signs. \nThat's considered a fair play and it's part of the game.", "start": 93.32, "duration": 4.76}, {"text": "The problem is, our brains aren't great at figuring out the complex pattern.", "start": 98.1, "duration": 4.22}, {"text": "So we set out to create an app that would use machine learning to do exactly that. And by we, I mean", "start": 102.38, "duration": 4.56}, {"text": "Jabril actually sat down and wrote the code and I just made sure he had unlimited Cheez-Its and Lacroix.", "start": 107.04, "duration": 5.04}, {"text": "Here's how it works: \nIf I saw coach touched his nose, ears, arm, chin, and so on, I would assign those to letters in the app.", "start": 112.28, "duration": 6.2}, {"text": "Then I'll just watch him sign and record the order. After that I would just let the app know the outcome;", "start": 118.6, "duration": 4.86}, {"text": "so was it a steal or not. \nAfter you do this for enough sequences, the app will start to make predictions.", "start": 123.78, "duration": 5.36}, {"text": "In this case, it's predicting the combination of \"A, D\", or \"nose then chin\" is their steal sign.", "start": 129.14, "duration": 4.84}, {"text": "This worked well enough on my workbench,", "start": 134.24, "duration": 1.62}, {"text": "so now it's time for the first real-world test \nin a kids-versus-adults Wiffle Ball game.", "start": 135.86, "duration": 4.76}, {"text": "And my friend Sara takes the game of Wiffle Ball pretty seriously,", "start": 140.78, "duration": 2.62}, {"text": "so she was the captain of the kids team, and was signaling for them to steal at just the right moments.", "start": 143.4, "duration": 5.52}, {"text": "[Cheering]", "start": 150.34, "duration": 2.76}, {"text": "- And I wasn't sure about the ethics of using our app against a bunch of little kids,", "start": 154.94, "duration": 2.98}, {"text": "but they were scoring runs and stealing bases with impunity, and then they got so confident, they started talking trash.", "start": 158.02, "duration": 6.5}, {"text": "[kids screaming]\nWE WANT A PITCHER,\nNOT A BELLY ITCHER!", "start": 164.68, "duration": 3.12}, {"text": "And no one says that about my pitcher,", "start": 167.8, "duration": 2.01}, {"text": "so at that point the gloves came off.", "start": 169.81, "duration": 1.99}, {"text": "We found it easiest to film her signs with our phone, and then scrub through and capture the order in the app afterwards,", "start": 171.94, "duration": 6.56}, {"text": "as opposed to trying to do it real-time.", "start": 178.5, "duration": 1.96}, {"text": "And I'm very happy to report we cracked their code after only three sequences.", "start": 180.46, "duration": 4.64}, {"text": "And what's cool is once you know the code, you no longer need the app because you can just watch for the steal signal", "start": 187.9, "duration": 5.26}, {"text": "and when we saw it, we alerted our pitcher with the secret sign of our own", "start": 193.16, "duration": 4.28}, {"text": "[music]", "start": 198.74, "duration": 3.28}, {"text": "[screaming]\nAyyyyy! You're outta there buddy!", "start": 202.32, "duration": 3.42}, {"text": "And after that the tides of the game shifted and we were able to officially prove adults rule, and kids drool.", "start": 206.54, "duration": 5.66}, {"text": "So our app cracked the code after just three sequences and I'm going to show you them", "start": 212.42, "duration": 4.1}, {"text": "to see if you can figure out the steal sign using just your brain.", "start": 216.52, "duration": 3.14}, {"text": "Here's the first one:", "start": 220.2, "duration": 1.12}, {"text": "And this was a STEAL.", "start": 221.72, "duration": 0.66}, {"text": "Here's the second:", "start": 223.2, "duration": 1.36}, {"text": "And this was NO STEAL.", "start": 226.72, "duration": 0.72}, {"text": "And this is the third:", "start": 228.64, "duration": 1.0}, {"text": "And it was a STEAL.", "start": 231.2, "duration": 0.86}, {"text": "Pause and go back if you want to try and figure it out, because I'm about to tell you the answer.", "start": 233.18, "duration": 3.56}, {"text": "According to the app, which Sara later confirmed,", "start": 236.9, "duration": 2.4}, {"text": "their steal sign was only if she touched her hat and then left ear back to back.", "start": 239.3, "duration": 4.36}, {"text": "Everything else was just a decoy.", "start": 243.72, "duration": 1.97}, {"text": "Now before we tell you exactly how the app can figure this out so quickly,", "start": 245.69, "duration": 3.69}, {"text": "we need a little background information.", "start": 249.38, "duration": 1.36}, {"text": "So I've cornered my buddy Jabril here and I'm gonna make him give us a super simple explanation of machine learning.", "start": 251.06, "duration": 5.62}, {"text": "Now here's what you should know about Jabril: He's basically a genius who taught himself how to code when he was 14.", "start": 256.7, "duration": 4.98}, {"text": "He has an amazing YouTube channel you should check out with videos like this one", "start": 261.86, "duration": 3.46}, {"text": "where he made a video game where the character teaches himself how to navigate any maze", "start": 265.32, "duration": 3.29}, {"text": "using machine learning and neural networks.", "start": 268.68, "duration": 1.65}, {"text": "[Jabril]\n - All right. Let's say we have Timmy here. And Timmy likes certain type of toys, but not others.", "start": 270.33, "duration": 5.31}, {"text": "So in a fake example here, he decides his based on how big the toy is and how complicated it is.", "start": 275.78, "duration": 5.46}, {"text": "So, from small to big, and then over here", "start": 281.4, "duration": 2.7}, {"text": "how many parts it has; from just one piece, to a really complex toy with gears and moving parts and things like that.", "start": 284.2, "duration": 6.08}, {"text": "And so, if we asked Timmy about 20 different toys and start to plot those on the graph,", "start": 290.28, "duration": 4.38}, {"text": "we'll start to see a pattern.", "start": 294.68, "duration": 1.94}, {"text": "So generally, he likes toys that are big and complicated, but does not like toys that are small and simple.", "start": 296.62, "duration": 7.5}, {"text": "And so, by looking at his past preferences,", "start": 304.36, "duration": 2.74}, {"text": "we can make really good predictions for the future.", "start": 307.1, "duration": 2.79}, {"text": "If you show little Timmy here a toy that is this complicated", "start": 309.89, "duration": 3.61}, {"text": "and this big, we're confident that he'll like it before we show it to him because it is inside the \"like\" boundaries.", "start": 313.5, "duration": 6.84}, {"text": "That's the big deal with machine learning:", "start": 320.52, "duration": 2.12}, {"text": "We don't have to take the time and show a little Timmy here every toy that's ever been created", "start": 322.76, "duration": 3.58}, {"text": "and record his answers. After we record some", "start": 326.34, "duration": 2.66}, {"text": "likes and dislikes we're able to draw some boundaries.", "start": 329.0, "duration": 3.74}, {"text": "And precisely where we draw these boundaries is the secret sauce.", "start": 332.78, "duration": 4.36}, {"text": "In this case, with just two inputs,", "start": 337.26, "duration": 1.78}, {"text": "You can just eyeball it and see where to put the boundaries.", "start": 339.04, "duration": 2.88}, {"text": "Butt", "start": 341.92, "duration": 0.6}, {"text": "...when you have thousands of inputs that interact with each other, it's", "start": 342.66, "duration": 2.96}, {"text": "impossible for our brains to comprehend where those boundaries should go.", "start": 345.62, "duration": 3.74}, {"text": "However, it's pretty trivial for a computer using machine learning.", "start": 349.36, "duration": 3.86}, {"text": "[Mark]\n - In doing research for this video, I talked to probably over 50 baseball players and coaches.", "start": 353.88, "duration": 4.16}, {"text": "And when we asked about signs, it was surprising to me how they all basically use the same strategy.", "start": 358.04, "duration": 4.48}, {"text": "See if you can pick up on it.", "start": 362.78, "duration": 1.12}, {"text": "[Coach]\n - Every coach has an indicator.", "start": 363.9, "duration": 1.44}, {"text": "- I have an indicator so I could do all this, you know", "start": 365.35, "duration": 2.1}, {"text": "random stuff like this, touch anywhere until I touch this, none of that matters.", "start": 367.64, "duration": 3.76}, {"text": "- So it'll be an indicator and the next sign, that's the 'hot' sign.", "start": 371.42, "duration": 2.88}, {"text": "So it's indicator, arm is 'steal', if I just do arm, that's nothing.", "start": 374.3, "duration": 4.64}, {"text": "- Oftentimes, I'll give this", "start": 378.94, "duration": 1.62}, {"text": "'Simon didn't say'.", "start": 381.64, "duration": 1.32}, {"text": "If I go indicator, and then immediately to anywhere on my arm:", "start": 383.42, "duration": 3.14}, {"text": "Steal.", "start": 387.2, "duration": 0.66}, {"text": "Bunt is to the belt; indicator to the belt.", "start": 388.12, "duration": 2.02}, {"text": "[Mark]\n - So basically nothing matters and it's all a decoy until they touch the indicator, and then", "start": 390.14, "duration": 4.24}, {"text": "the very next sign is the instruction.", "start": 394.39, "duration": 1.92}, {"text": "So after the indicator you might be told to bunt,", "start": 396.31, "duration": 2.49}, {"text": "or to take a pitch,", "start": 398.8, "duration": 1.2}, {"text": "or to steal.", "start": 400.06, "duration": 1.2}, {"text": "And so since the steal sign comes immediately after the indicator, We just look at a sequence where steal was recorded here", "start": 401.26, "duration": 5.82}, {"text": "That's showing us one and we look through that sequence two letters of the time and store those combos and we do the same thing", "start": 407.08, "duration": 5.579}, {"text": "for all the", "start": 412.66, "duration": 0.7}, {"text": "Sequences where steal was recorded and whatever two letter combo shows up in all of them is their indicator and steal sign in this case", "start": 413.36, "duration": 7.31}, {"text": "It's a D. So if we decode that that means noses their indicator and chin is their steal sign now", "start": 420.67, "duration": 5.819}, {"text": "I have a confession what I just showed you doesn't use machine learning at all. It's just a simple algorithm", "start": 426.49, "duration": 5.16}, {"text": "We realized at work", "start": 431.65, "duration": 0.9}, {"text": "once we discovered that pretty much all teams will use an indicator directly before", "start": 432.55, "duration": 4.44}, {"text": "Giving the real sign but based off all the people we talked to you if you're trying to decode signs this simple version should work", "start": 437.21, "duration": 5.99}, {"text": "Like ninety percent of the time but what about the other 10% where they do anything other than indicator followed by sign?", "start": 443.2, "duration": 6.299}, {"text": "That's where you need machine learning because I've done properly machine learning can crack any code as long as you give it enough training data", "start": 449.54, "duration": 6.41}, {"text": "So to really see how good Jabril x' machine learning app was I generated some training data based off an insanely?", "start": 455.95, "duration": 5.609}, {"text": "Complicated steals line I came up with to see if he could figure it out", "start": 461.78, "duration": 3.589}, {"text": "so my secret sign was a mustache rub is the indicator followed by any random sign and then a tooth tap as", "start": 465.37, "duration": 6.299}, {"text": "The steal sign then I can have up to fifty different", "start": 471.89, "duration": 2.299}, {"text": "Signals in each sequence and then to throw them off even more if I ever touch my right, eyebrow", "start": 474.26, "duration": 4.399}, {"text": "It's not a steal", "start": 478.66, "duration": 1.08}, {"text": "So you ignore everything in the sequence?", "start": 479.74, "duration": 1.89}, {"text": "Even if i've already given this deal now just to set the stage if we weren't going to use machine learning", "start": 481.63, "duration": 4.129}, {"text": "This would take a normal computer", "start": 485.77, "duration": 1.709}, {"text": "Thousands of years to solve because it's the same as if you're asking Timmy about every toy ever made instead of just drawing the boundaries", "start": 487.479, "duration": 6.29}, {"text": "Before we see if gibreel can successfully crack my code and how long it will take him", "start": 493.77, "duration": 4.47}, {"text": "Let's just go one layer deeper than the Timmy toy example and see how machine learning", "start": 498.28, "duration": 4.579}, {"text": "Mimics the human brain in creating neural networks that can draw those boundaries in the more complicated case of more than two inputs", "start": 502.96, "duration": 7.399}, {"text": "There are three main parts to a neural network and hang with me here because I'm going to keep this simple", "start": 510.789, "duration": 4.789}, {"text": "You have the input layer which in our case are the signs being given and then way over here", "start": 515.579, "duration": 4.92}, {"text": "You have the output layer in our case steel or no steel and then in the middle", "start": 520.5, "duration": 4.44}, {"text": "We have the hidden layers and right now that's just a black box", "start": 524.94, "duration": 2.669}, {"text": "So if the sign was hat hat nose hand", "start": 527.68, "duration": 2.869}, {"text": "We would tweet these input knobs like this depending on how each of these knobs is turned", "start": 530.62, "duration": 4.909}, {"text": "Each one is interconnected with the knobs to its left", "start": 535.529, "duration": 2.88}, {"text": "So it causes some simple math to occur at each node", "start": 538.41, "duration": 2.91}, {"text": "And when you sum up all of those numbers", "start": 541.32, "duration": 2.0}, {"text": "You're left with a number between 0", "start": 543.459, "duration": 1.771}, {"text": "And 1 and if that number is really close to 0 that's no steal", "start": 545.23, "duration": 3.38}, {"text": "And if the number is really close to 1 that's a steal so you give it a bunch of training data", "start": 548.61, "duration": 3.809}, {"text": "We're given an input", "start": 552.42, "duration": 1.02}, {"text": "You know what the output should be you start with these hidden layer knobs turned in totally random directions", "start": 553.44, "duration": 5.309}, {"text": "And when you add them all up you get something like point five five. Well, that doesn't make sense", "start": 558.82, "duration": 4.309}, {"text": "You can't have half a steel and more importantly with the training data", "start": 563.13, "duration": 3.359}, {"text": "you know the answers and you know that this", "start": 566.49, "duration": 2.279}, {"text": "Combination should have been a steel", "start": 568.99, "duration": 1.52}, {"text": "So you just start tweaking these hidden layer knobs until you start to get", "start": 570.51, "duration": 3.869}, {"text": "Outputs that are more correct over time and after going through a bunch of examples where you know what the answer should be", "start": 574.48, "duration": 4.789}, {"text": "Eventually, you get to a point where any more tweaking of the knobs just makes it less accurate", "start": 579.519, "duration": 5.0}, {"text": "so you stop so now you", "start": 584.519, "duration": 1.57}, {"text": "Superglue these three hidden layer knobs into place because you've trained your model", "start": 586.089, "duration": 4.16}, {"text": "And so now with the brand-new input where you don't know the answer it gives you the correct output in this case us steel", "start": 590.25, "duration": 5.849}, {"text": "Of course, this is a simple model", "start": 596.31, "duration": 1.5}, {"text": "But this scales up so you could have thousands of inputs and thousands of outputs and you're able to discover really?", "start": 597.81, "duration": 6.089}, {"text": "complicated relationships", "start": 604.269, "duration": 1.291}, {"text": "What's so cool about this is this is basically how neural networks in our own", "start": 605.56, "duration": 3.859}, {"text": "Rains are set up to learn once", "start": 609.779, "duration": 1.68}, {"text": "I've been given enough training data to understand the interaction between my hand and arm and keeping something balanced like this then my model is", "start": 611.459, "duration": 6.66}, {"text": "Trained and I superglue those middle knobs in my brain, then I can introduce a totally new input", "start": 618.12, "duration": 5.25}, {"text": "I've never tried before and I still know what to do", "start": 623.37, "duration": 2.669}, {"text": "I don't need to be trained on every possible", "start": 626.04, "duration": 2.25}, {"text": "different type of object because my brain", "start": 628.389, "duration": 2.0}, {"text": "Has drawn the boundaries think about that for a long time before machine learning in neural networks computers were just following", "start": 630.399, "duration": 5.869}, {"text": "hard-coded instructions given by humans now", "start": 636.61, "duration": 2.539}, {"text": "they can learn like humans only they can do it much faster and more comprehensively than we can look at Ori and", "start": 639.339, "duration": 7.01}, {"text": "That's why when I give Jabril the challenge that would take a normal computer using brute force methods thousands of years to solve", "start": 647.079, "duration": 5.479}, {"text": "Yo, man", "start": 655.449, "duration": 2.0}, {"text": "Please tell me that your indicator is a moustache rub and then you know, whatever and", "start": 657.879, "duration": 6.74}, {"text": "Then it do that", "start": 665.439, "duration": 2.0}, {"text": "Is that it", "start": 668.019, "duration": 2.0}, {"text": "Jibril's machine learning algorithm just created the right boundaries and solved it in less than three minutes", "start": 671.17, "duration": 4.789}, {"text": "The machine learning model requires more data than our simple version which can solve it after like three sequences", "start": 676.149, "duration": 5.359}, {"text": "But the upside is that it will eventually decode any set of signs. As long as you're capturing the inputs, right?", "start": 681.509, "duration": 6.27}, {"text": "And so now it was time for a real-life test. So I asked my buddy Destin to do some secretive recon work", "start": 687.779, "duration": 6.059}, {"text": "Okay, dude, this is the field. I used to play it growing up today. My son is playing on the Rascals", "start": 693.839, "duration": 4.5}, {"text": "I'm gonna go film on third base coaches doing their thing and we'll plug all that data into the machine learning algorithm", "start": 698.43, "duration": 5.369}, {"text": "These kids are yelling at me", "start": 703.8, "duration": 1.389}, {"text": "Want me to know what my channel is and the fact they didn't recognize him just proved to me that whatever was happening in this", "start": 705.189, "duration": 5.09}, {"text": "Region was a totally effective disguise and thanks to Dustin's great interviews in raw footage", "start": 710.29, "duration": 3.979}, {"text": "We were able to get even more data to show that methods totally worked", "start": 714.37, "duration": 3.199}, {"text": "And while Destin just brazenly set up a tripod and filmed all these third-base coaches", "start": 717.779, "duration": 4.559}, {"text": "Yeah, cuz signs are pretty secret, right yeah, yes, sir get it", "start": 724.569, "duration": 4.22}, {"text": "I get in trouble for stealing sons", "start": 730.089, "duration": 2.359}, {"text": "I was a little more nervous and discreet if you put a GoPro in a cup", "start": 732.449, "duration": 4.049}, {"text": "you can actually just watch the footage and frame the shot real time and it just looks like your check and dank means with the", "start": 736.499, "duration": 5.7}, {"text": "Drink in your hand. I've actually used this trick a few times especially on my Carnival scam science video", "start": 742.199, "duration": 4.919}, {"text": "So just like with Destin's footage", "start": 747.119, "duration": 1.59}, {"text": "It worked perfectly the games I went to and it was just a cool feeling once you'd crack their code", "start": 748.709, "duration": 5.25}, {"text": "To be able to predict exactly what was coming next", "start": 756.22, "duration": 2.75}, {"text": "I", "start": 764.11, "duration": 1.62}, {"text": "Hope you enjoyed this excuse to learn more about machine learning as much as I did", "start": 765.73, "duration": 3.889}, {"text": "I will put links to both versions of the app in the video", "start": 769.619, "duration": 2.67}, {"text": "description for you to check out and of course if there are specific rules against using", "start": 772.42, "duration": 3.859}, {"text": "Technology to steal science in your league. I am not telling you to break them. Otherwise from personal experience", "start": 776.529, "duration": 5.51}, {"text": "You might risk getting some very important people mad at you", "start": 782.04, "duration": 3.149}, {"text": "I", "start": 785.769, "duration": 2.0}]