[{"text": "This video was made possible by Audible. Get\na free audiobook from audible exclusively", "start": 0.45, "duration": 5.15}, {"text": "by going to audible.com/HAI.\nIf you’re a normal person this is a super-interesting", "start": 5.6, "duration": 6.23}, {"text": "episode about a secret airline that brings\nsecret people to secret places within the", "start": 11.83, "duration": 4.43}, {"text": "US. If you’re a US government official or\nanyone else that could be peeved by me spreading", "start": 16.26, "duration": 4.24}, {"text": "semi-secret facts, this episode is about bricks.\nA brick is a building material used to construct", "start": 20.5, "duration": 5.98}, {"text": "walls, floors, or other building elements\nin a fast and cost-effective way. Interestingly,", "start": 26.48, "duration": 5.7}, {"text": "bricks come in different sizes depending on\nwhere you are. In the United States they’re", "start": 32.18, "duration": 4.49}, {"text": "7⅝ × 3⅝ × 2¼ inches while in Australia\nthey’re 9 × 4⅓ × 3 inches, and that", "start": 36.67, "duration": 7.45}, {"text": "is why bricks are so interesting. This video\nwas made possible by… ok that’s normally", "start": 44.12, "duration": 5.23}, {"text": "enough to get them to leave.\nNow, if you’re still watching, buckle your", "start": 49.35, "duration": 3.46}, {"text": "bootstraps because we’re going for a ride,\njust not on these planes because they’re", "start": 52.81, "duration": 4.5}, {"text": "part of JANET which is based here at the Gold\nCoast Terminal in Las Vegas, weirdly about", "start": 57.31, "duration": 5.59}, {"text": "3,000 feet from where the Hacienda hotel from\nepisode 3 was. JANET probably stands for “Joint", "start": 62.9, "duration": 6.259}, {"text": "Air Network for Employee Transportation”\nbut we’re not really sure because its secret.", "start": 69.159, "duration": 5.011}, {"text": "Some people also call it “Just Another Non-Existent\nTerminal.”", "start": 74.17, "duration": 2.989}, {"text": "But here’s what we do know. Every morning\nthis parking lot fills up with hundreds of", "start": 77.159, "duration": 4.361}, {"text": "cars, the planes take off, and then in the\nevening the planes come back and the cars", "start": 81.52, "duration": 3.889}, {"text": "leave. We know they have six Boeing 737’s\nand five prop planes. We also know who owns", "start": 85.409, "duration": 5.91}, {"text": "the planes. You can go right onto the FAA\nwebsite, pop in the registration number of", "start": 91.319, "duration": 4.521}, {"text": "one of the planes, and it’ll tell you its\nowned by the US Air Force. But the US Air", "start": 95.84, "duration": 4.319}, {"text": "Force doesn’t operate these flights, and\nwe’re not 100% sure who does, at least nowadays.", "start": 100.159, "duration": 6.431}, {"text": "There used to be a defense contractor called\nEG&G which played a central role in the development", "start": 106.59, "duration": 5.059}, {"text": "of nuclear weapons They were the original\noperators of the gold coast terminal and JANET", "start": 111.649, "duration": 4.552}, {"text": "Airlines and how do we know that? Because\nthey posted a job listing. EG&G was acquired", "start": 116.201, "duration": 3.848}, {"text": "by the Carlyle Group in 1999 which was acquired\nby the URS corporation in 2002 which was acquired", "start": 120.049, "duration": 6.13}, {"text": "by AECOM in 2014, so as far as we know, AECOM\ncurrently operates the flights, but the real", "start": 126.179, "duration": 6.14}, {"text": "question is where do they go.\nMost of the time, the planes take off from", "start": 132.319, "duration": 3.89}, {"text": "Las Vegas airport and head north until they\nturn off their transponder and disappear from", "start": 136.209, "duration": 4.021}, {"text": "trackers after about 15 minutes in the air.\nBut what’s telling is where they drop off,", "start": 140.23, "duration": 5.0}, {"text": "because right here is Area 51—the place\nthat, according to the US government doesn’t", "start": 145.23, "duration": 5.45}, {"text": "exist. Every sign would point to these JANET\nflights being the Area 51 employee shuttles", "start": 150.68, "duration": 4.96}, {"text": "for personnel living in Las Vegas. The airspace\naround Area 51, known as Restricted Area 4808", "start": 155.64, "duration": 6.37}, {"text": "North, is some of the most protected airspace\nin the world. Any unauthorized plane that", "start": 162.01, "duration": 5.179}, {"text": "enters will be quickly met by fighter jets\nand likely shot down, but these planes regularly", "start": 167.189, "duration": 4.951}, {"text": "go in and out with no problem.\nWhile we can only speculate that the planes", "start": 172.14, "duration": 3.89}, {"text": "go to Area 51 based off where they drop of\ntracking, we know for certain that they also", "start": 176.03, "duration": 4.381}, {"text": "go to the Tonopah Test Range. This site is\nwhere the US military develops and tests many", "start": 180.411, "duration": 5.149}, {"text": "of its weapons and, while its still highly\nclassified, the JANET planes that go here", "start": 185.56, "duration": 4.64}, {"text": "don’t turn off their transponder meaning\nthat we know for certain that planes land", "start": 190.2, "duration": 3.86}, {"text": "here.\nJANET planes have also been seen regularly", "start": 194.06, "duration": 2.64}, {"text": "going to China Lake, a Navy research and development\nsite, Plant 42, the site where the US Air", "start": 196.7, "duration": 5.54}, {"text": "Force builds its planes, and Edwards Air Force\nBase, another site home to classified research", "start": 202.24, "duration": 5.059}, {"text": "and development projects. What’s really\nimpressive about JANET is how little we know", "start": 207.299, "duration": 4.481}, {"text": "about it despite it flying hundreds or even\nthousands of people per day. You can see these", "start": 211.78, "duration": 5.67}, {"text": "airplanes in full sight when you land at Las\nVegas Airport and yet we still can’t say", "start": 217.45, "duration": 5.319}, {"text": "with 100% certainty who or where these planes\nfly.", "start": 222.769, "duration": 4.28}, {"text": "But what we can say with certainty is how\nto get a free audiobook—you head to audible.com/HAI.", "start": 227.049, "duration": 5.461}, {"text": "As you probably know, Audible is a leading\nprovider of audiobooks and other spoken word", "start": 232.51, "duration": 4.83}, {"text": "entertainment. They have thousands of great\ntitles and there are some audiobooks that", "start": 237.34, "duration": 3.81}, {"text": "you can only find on Audible like Artemis\nby Andy Weir—the author of the Martian—which", "start": 241.15, "duration": 4.419}, {"text": "I highly recommend. What’s amazing about\nAudible is they stand behind their product—", "start": 245.569, "duration": 4.691}, {"text": "if you don’t like what you’ve listened\nto you can swap it out for another one with", "start": 250.26, "duration": 3.02}, {"text": "their Great Listen Guarantee. Once you try\nout your free book, membership includes one", "start": 253.28, "duration": 4.28}, {"text": "free title a month and 30% off everything\nelse. I love audiobooks because you can essentially", "start": 257.56, "duration": 4.92}, {"text": "read no matter what you’re doing and I’m\nsure you will too so it’s worth going and", "start": 262.48, "duration": 3.96}, {"text": "trying out a book for free with their 30-day\nfree trial at audible.com/HAI.", "start": 266.44, "duration": 4.26}]