[{"text": "Hay, TechLead here and welcome back to coffee time with your host TechLead,", "start": 0.0, "duration": 3.12}, {"text": "the Ex-Google and Ex-Facebook tech lead.", "start": 3.44, "duration": 2.8}, {"text": "Today I thought I would be talking about how much money I would make on a million view video.", "start": 6.3, "duration": 4.96}, {"text": "And this is maybe surprising or unsurprising answer for you.", "start": 11.46, "duration": 4.0}, {"text": "And first of all, you may be thinking that I am only doing this just to brag, to flex, to show off somebody", "start": 15.46, "duration": 5.6}, {"text": "And, yeah that is kind of true. My ex, I hope you are watching this one.", "start": 21.44, "duration": 4.48}, {"text": "But really what I'm trying to do here is I'm just monetizing my monetization.", "start": 26.66, "duration": 5.12}, {"text": "Don't hate the game. Please don't do that.", "start": 31.78, "duration": 2.26}, {"text": "Just hate me if you're gonna do that.", "start": 34.34, "duration": 2.5}, {"text": "Now, the funny thing about YouTube is that", "start": 36.84, "duration": 1.58}, {"text": "there are so many different revenues dream that you can build up for yourself here.", "start": 38.42, "duration": 3.34}, {"text": "It's funny that I'm generating more on YouTube", "start": 41.94, "duration": 2.52}, {"text": "then I made as a tech lead at Google.", "start": 44.64, "duration": 2.32}, {"text": "Or as a staff software engineer at Facebook.", "start": 46.96, "duration": 1.98}, {"text": "Being at the top of these tech fields, you know, it's like,", "start": 49.44, "duration": 3.1}, {"text": "I'm probably doing well over half a million dollars on Youtube alone.", "start": 52.54, "duration": 3.6}, {"text": "Speaking of monetization, this video is brought to you by Squarespace", "start": 56.82, "duration": 3.56}, {"text": "Ready to start your next business?", "start": 60.38, "duration": 1.86}, {"text": "From websites and online stores, to marketing tools and analytics,", "start": 62.4, "duration": 3.56}, {"text": "Squarespace is the all in one platform to build a beautiful website, and run your business.", "start": 66.04, "duration": 4.16}, {"text": "Get 10% off your order at Squarespace.com/Techlead", "start": 70.2, "duration": 4.02}, {"text": "In this video in particular, I wanted to focus on the advertising revenue stream.", "start": 74.22, "duration": 4.4}, {"text": "And, I'm going to be completely transparent with you guys,", "start": 78.62, "duration": 3.32}, {"text": "trying to educate you a little, so, in exchange for that, I ask that you give the video a like and subscribe", "start": 81.94, "duration": 5.98}, {"text": "it really helps me out, that's all I want from you.", "start": 87.92, "duration": 2.16}, {"text": "And I'll show you some of these numbers, in case you also want to do Youtube, or if you're just curious", "start": 90.08, "duration": 4.54}, {"text": "and I'll also provide you a few tips in case you're trying to get started,", "start": 94.62, "duration": 3.04}, {"text": "but, make no mistake: I don't think Youtube is very easy.", "start": 97.66, "duration": 3.38}, {"text": "Now recently, one of my videos: \"My Wife Left Me\" had gone viral and hit over a million views", "start": 101.04, "duration": 5.46}, {"text": "and, we can take a look at my analytics, and see how much money that had made", "start": 106.5, "duration": 4.2}, {"text": "and we can see here, if I refresh this page, it's $4750,", "start": 110.9, "duration": 4.72}, {"text": "based on a million view video.", "start": 115.86, "duration": 1.7}, {"text": "Which, I don't know, was it surprising to you? It doesn't sound all that high to me, right?", "start": 117.56, "duration": 4.44}, {"text": "Like, it's okay, it's decent, and, basically, after that,", "start": 122.12, "duration": 3.38}, {"text": "I followed up with another video, called: \"Managing and protecting money in a relationship\"", "start": 125.5, "duration": 5.0}, {"text": "that one also, kinda went viral, did 250 thousand views", "start": 130.5, "duration": 3.88}, {"text": "and, it did about a quarter of the revenue, at $1200, roughly.", "start": 134.38, "duration": 4.72}, {"text": "So, all told, with those two videos combines, we're looking at about $6000 in revenue,", "start": 139.1, "duration": 4.64}, {"text": "on how I was able to monetize my depression.", "start": 143.74, "duration": 4.52}, {"text": "So that is based on pure ad-revenue alone.", "start": 148.26, "duration": 2.64}, {"text": "And then if I refresh my stats, I can see that I'm doing about $18,000, per month.", "start": 150.9, "duration": 4.98}, {"text": "Which is alright! It's decent, is like the salary of an entry level software engineer.", "start": 155.88, "duration": 5.02}, {"text": "And if I check out another of my videos, ''Top signs of an   inexperienced programmer\". This one went viral too.", "start": 160.9, "duration": 5.6}, {"text": "went to a million views, I can see lifetime revenue here by 5,000 dollars", "start": 166.5, "duration": 5.04}, {"text": "so yup, that's seems about the go-in rate in tech, maybe 5 dollars CPM (Cost Per Thousand), based on actual views", "start": 171.7, "duration": 7.38}, {"text": "Now if you actually check you analytics, you may see it'll say 10-15 dollars CPM", "start": 179.08, "duration": 6.42}, {"text": "but you know those are really based on monetize playback, something like that", "start": 185.5, "duration": 4.24}, {"text": "so i think that generally it's like for every million view you get 5000 bucks or so, more or less", "start": 189.76, "duration": 5.72}, {"text": "maybe that surprised you, maybe does not sound as  high as you may have thought, right?", "start": 195.54, "duration": 4.5}, {"text": "like", "start": 200.04, "duration": 0.8}, {"text": "you know you may go through all these trouble to trying create a viral hit video, million views, and ..", "start": 200.84, "duration": 5.74}, {"text": "5000 bucks ? It's okay, it's alright, it's not bad, but it is also not like life-changing money, or anything like that.", "start": 206.58, "duration": 6.62}, {"text": "you have to keep in mind that the rates differs based on the topic of the video, like", "start": 213.22, "duration": 4.24}, {"text": "it feels like a music video, a kids video, or .. just a gossip video,  then it may not monetize as well, right?", "start": 217.48, "duration": 7.08}, {"text": "it may..you may see half the rate", "start": 224.58, "duration": 2.24}, {"text": "in tech, usually the rate is little higher and then it feels like a personal finance video you may even see a double that rate", "start": 227.1, "duration": 6.66}, {"text": "so it really depends on the target audience that you are going after here", "start": 233.76, "duration": 3.3}, {"text": "so that's your advertising revenue.", "start": 237.12, "duration": 1.94}]