[{"text": "Sea level seems like a pretty easy concept,\nright? You just measure the average level", "start": 1.329, "duration": 4.09}, {"text": "of the oceans and that's that. But what about\nparts of the earth where there aren't oceans?", "start": 5.419, "duration": 4.361}, {"text": "For example, when we say that Mt. Everest\nis 8850m above sea level, how do we know what", "start": 9.78, "duration": 5.309}, {"text": "sea level would be beneath Mt. Everest, since\nthere's no sea for hundreds of kilometers?", "start": 15.089, "duration": 4.11}, {"text": "If the earth were flat then things would be\neasy - we'd just draw a straight line through", "start": 19.199, "duration": 4.311}, {"text": "the average height of the oceans and be done\nwith it. But the earth isn't flat.", "start": 23.51, "duration": 3.55}, {"text": "If the earth were spherical, it would be easy,\ntoo, because we could just measure the average", "start": 27.06, "duration": 3.67}, {"text": "distance from the center of the earth to the\nsurface of the ocean. But the earth isn't", "start": 30.73, "duration": 3.71}, {"text": "spherical - it's spinning, so bits closer\nto the equator are \"thrown out\" by centrifugal", "start": 34.44, "duration": 4.759}, {"text": "effects, and the poles get squashed in a bit.\nIn fact, the earth is so non-spherical that", "start": 39.199, "duration": 4.201}, {"text": "it's 42km farther across at the equator than\nfrom pole to pole. That means if you thought", "start": 43.4, "duration": 5.46}, {"text": "earth were a sphere and defined sea level\nby standing on the sea ice at the north pole,", "start": 48.86, "duration": 3.71}, {"text": "then the surface of the ocean at the equator\nwould be 21km above sea level.", "start": 52.57, "duration": 4.9}, {"text": "This bulging is also why the Chimborazo volcano\nin Ecuador, and not Mount Everest, is the", "start": 57.47, "duration": 4.399}, {"text": "peak that's actually farthest from the center\nof the earth.", "start": 61.869, "duration": 2.881}, {"text": "So how do we know what sea level is? Well,\nwater is held on Earth by gravity, so we could", "start": 64.75, "duration": 4.83}, {"text": "model the earth as a flattened & stretched\nspinning sphere and then calculate what height", "start": 69.58, "duration": 3.53}, {"text": "the oceans would settle to when pulled by\ngravity onto the surface of that ellipsoid.", "start": 73.11, "duration": 4.14}, {"text": "Except the interior of the earth doesn't have\nthe same density everywhere, which means gravity", "start": 77.25, "duration": 4.33}, {"text": "is slightly stronger or weaker at different\npoints around the globe, and the oceans tend", "start": 81.58, "duration": 4.13}, {"text": "\"puddle\" more nearer to the dense spots. These\naren't small changes, either - the level of", "start": 85.71, "duration": 4.02}, {"text": "the sea can vary by up to 100m from a uniform\nellipsoid depending on the density of the", "start": 89.73, "duration": 4.41}, {"text": "Earth beneath it. And on top of that, literally,\nthere are those pesky things called continents", "start": 94.14, "duration": 4.35}, {"text": "moving around on the Earth's surface. These\ndense lumps of rock bump out from the ellipsoid", "start": 98.49, "duration": 4.24}, {"text": "and their mass gravitationally attracts oceans,\nwhile valleys in the ocean floor have less", "start": 102.73, "duration": 4.34}, {"text": "mass and the oceans flow away, shallower.", "start": 107.07, "duration": 2.68}, {"text": "And this is the real conundrum, because the\nvery presence of a mountain (& continent on", "start": 109.75, "duration": 4.18}, {"text": "which it sits) changes the level of the sea:\nthe gravitational attraction of land pulls", "start": 113.93, "duration": 4.28}, {"text": "more water nearby, raising the sea around\nit. So, to determine the height of a mountain", "start": 118.21, "duration": 4.01}, {"text": "above sea level, should we use the height\nthe sea would be if the mountain weren't there", "start": 122.22, "duration": 3.5}, {"text": "at all? Or the height the sea would be if\nthe mountain weren't there but its gravity", "start": 125.72, "duration": 3.84}, {"text": "were?", "start": 129.56, "duration": 0.669}, {"text": "The people who worry about such things, called\ngeodetic scientists or geodesists, decided", "start": 130.229, "duration": 4.531}, {"text": "that we should indeed define sea level using\nthe strength of gravity, so they went about", "start": 134.76, "duration": 3.64}, {"text": "creating an incredibly detailed model of the\nearth's gravitational field, called, creatively,", "start": 138.4, "duration": 4.419}, {"text": "the Earth Gravitational Model. It's incorporated\ninto modern GPS receivers so they won't tell", "start": 142.819, "duration": 4.631}, {"text": "you you're 100m below sea level when you're\nin fact sitting on the beach in Sri Lanka", "start": 147.45, "duration": 3.83}, {"text": "which has weak gravity, and has allowed geodesists\nthemselves to correctly predict the average", "start": 151.28, "duration": 4.5}, {"text": "level of the ocean to within a meter everywhere\non Earth. Which is why we also use it to define", "start": 155.78, "duration": 4.7}, {"text": "what sea level would be underneath mountains...\nif they weren't there... but their gravity", "start": 160.48, "duration": 3.97}, {"text": "were.", "start": 164.45, "duration": 7.0}]