[{"text": "The Nintendo 64 Transfer Pak.", "start": 0.36, "duration": 1.94}, {"text": "Best known as that thing that came with Pokémon Stadium,", "start": 2.3, "duration": 2.72}, {"text": "its usefulness outside of that was pretty thin, but this is classic Nintendo, really!", "start": 5.02, "duration": 4.2}, {"text": "I think the thing we forget when we talk about Nintendo and their various wacky peripherals", "start": 9.22, "duration": 4.44}, {"text": "is that Nintendo was first and foremost a toy company.", "start": 13.66, "duration": 2.88}, {"text": "Then they became a toy company that makes video games,", "start": 16.54, "duration": 3.14}, {"text": "and just like a toymaker doesn't expect something like... L.O.L. Surprise to be hot for longer than a season or so,", "start": 19.68, "duration": 6.82}, {"text": "Nintendo has a habit of not committing to its peripherals for very long,", "start": 26.56, "duration": 3.64}, {"text": "and the N64 Transfer Pak is a classic example!", "start": 30.2, "duration": 3.56}, {"text": "It's a good idea, implemented too late to be useful to anyone except Pokémon superfans.", "start": 33.86, "duration": 5.4}, {"text": "On top of that, there's the risk that you might delete your Game Boy data,", "start": 39.26, "duration": 3.5}, {"text": "and it would soon be replaced by the next big thing.", "start": 42.76, "duration": 2.7}, {"text": "But it was one of the only ways you could connect Game Boy games to the Nintendo 64,", "start": 45.52, "duration": 4.46}, {"text": "we just needed to uncover all its secrets!", "start": 49.98, "duration": 2.4}, {"text": "So welcome back to Punching Weight, the show where we take a look at the weird, ambitious and unnecessary,", "start": 52.38, "duration": 5.24}, {"text": "and we're gonna put an emphasis on \"unnecessary\" by taking a look at the Nintendo 64 Transfer Pak.", "start": 57.62, "duration": 5.56}, {"text": "But first!", "start": 63.56, "duration": 0.94}, {"text": "This video is sponsored by Squarespace.", "start": 64.82, "duration": 2.24}, {"text": "You could start your free Squarespace trial today by going to squarespace.com/stopskeletons", "start": 67.06, "duration": 5.5}, {"text": "and using the code 'STOPSKELETONS' to get 10% off your first purchase!", "start": 72.56, "duration": 4.14}, {"text": "That's squarespace.com/stopskeletons and the offer code 'STOPSKELETONS'.", "start": 76.72, "duration": 4.8}, {"text": "Stick around to the end of the episode to hear more!", "start": 81.52, "duration": 3.14}, {"text": "First, let's lay down some context:", "start": 93.7, "duration": 1.96}, {"text": "The Nintendo 64 came out in 1996.", "start": 95.66, "duration": 2.92}, {"text": "The system's 3D capabilities, as showcased by Mario 64, were a revelation,", "start": 98.58, "duration": 4.64}, {"text": "a benchmark for what the third dimension could be for an industry still working out the kinks.", "start": 103.22, "duration": 5.24}, {"text": "But at the same time, Nintendo had a problem:", "start": 108.5, "duration": 2.66}, {"text": "Its portable Game Boy system, originally released in 1989,", "start": 111.2, "duration": 4.14}, {"text": "hadn't had a meaningful hardware update in over half a decade.", "start": 115.34, "duration": 3.52}, {"text": "Interest in the system was waning, and it didn't really fit in with Nintendo's focus on the future of gaming.", "start": 118.86, "duration": 5.54}, {"text": "There was no reason to care about 8-bit, monochromatic, two-dimensional games,", "start": 124.44, "duration": 4.02}, {"text": "so a Game Boy player for the N64 was never in the cards,", "start": 128.46, "duration": 3.48}, {"text": "at least it wasn't, before a little game called Pocket Monster, a.k.a. Pokémon,", "start": 131.94, "duration": 4.24}, {"text": "ruined everything by becoming the most successful thing on the planet.", "start": 136.18, "duration": 3.58}, {"text": "[ evil laughter ]", "start": 139.76, "duration": 0.96}, {"text": "That's not to say the N64 didn't have its own problems:", "start": 140.72, "duration": 3.18}, {"text": "While the system itself was successful, Nintendo's future focus wasn't completely successful.", "start": 143.9, "duration": 4.74}, {"text": "We're talking of course about the Japanese-only disk-based add-on, the 64DD.", "start": 148.64, "duration": 4.2}, {"text": "While this was a truly innovative piece of hardware that we're still seeing the effects of today,", "start": 152.84, "duration": 4.8}, {"text": "the N64DD flopped so hard in Japan that Nintendo literally scrapped it for spare parts!", "start": 157.64, "duration": 5.44}, {"text": "We've made a couple videos about the 64DD's orphans,", "start": 163.12, "duration": 2.92}, {"text": "and the Transfer Pak falls into that camp... kinda.", "start": 166.04, "duration": 3.34}, {"text": "The Transfer Pak was showcased at Nintendo's Space World 1999, and here's a picture of it!", "start": 169.38, "duration": 4.52}, {"text": "Yeah, THAT was called the Transfer Pak,", "start": 174.08, "duration": 2.14}, {"text": "but that's clearly different from what the Transfer Pak actually was,", "start": 176.22, "duration": 2.86}, {"text": "and looks a whole lot more like another peripheral we've made a video about,  the GameCube GBA Link Cable.", "start": 179.08, "duration": 5.2}, {"text": "Basically, Nintendo was going one way with the next-gen technologies of the N64,", "start": 184.52, "duration": 4.62}, {"text": "but the public was pulling them another way, with the aging tech of Pokémon.", "start": 189.14, "duration": 3.68}, {"text": "That's why we have the N64 Transfer Pak, it's a panicked stopgap between these two technologies.", "start": 192.94, "duration": 5.28}, {"text": "Now that we got all that out of the way, let's actually talk about the uses of the Transfer Pak,", "start": 198.3, "duration": 4.34}, {"text": "which... let's be honest, were mostly about Pokémon.", "start": 202.64, "duration": 3.18}, {"text": "Though it wasn't the first game to use it, we'll talk more about that in a second,", "start": 205.82, "duration": 3.7}, {"text": "the Stadium series is why most people are interested in the Transfer Pak,", "start": 209.64, "duration": 3.8}, {"text": "and probably the reason they have one in the first place.", "start": 213.58, "duration": 2.22}, {"text": "The Transfer Pak was originally bundled with Pokémon Stadium 1, though you could later buy it separately.", "start": 215.88, "duration": 4.8}, {"text": "To use it with Pokémon Stadium, you need to plug your Pokémon cartridge into the Transfer Pak,", "start": 220.7, "duration": 4.3}, {"text": "then plug your Transfer Pak into the controller, and then turn on the game.", "start": 225.0, "duration": 3.84}, {"text": "You actually have to be this careful, or you run the risk of losing your Game Boy data.", "start": 228.84, "duration": 3.7}, {"text": "Pokémon Stadium will then give you the option of using your data,", "start": 232.54, "duration": 2.66}, {"text": "a.k.a. the Pokémon you've caught and their current stats, in the game itself!", "start": 235.2, "duration": 3.34}, {"text": "Here's the kicker though: The Transfer Pak is not essential to playing Pokémon Stadium.", "start": 238.6, "duration": 4.14}, {"text": "The game has a rental system that makes importing your own Pokémon totally optional!", "start": 242.74, "duration": 4.5}, {"text": "But you could also use this to fight your friends in 3D, assuming they also had a Transfer Pak,", "start": 247.44, "duration": 4.58}, {"text": "trade Pokémon, and even take pictures of your Pokémon and print them out on the Game Boy Printer,", "start": 252.02, "duration": 4.52}, {"text": "which is a pretty big upgrade from printing out my Pokémon Snap cards at a damn Blockbuster kiosk!", "start": 256.54, "duration": 4.68}, {"text": "You could also use it to get Pokémon with rare movesets into your Game Boy roster, for example,", "start": 261.26, "duration": 4.6}, {"text": "if you beat Pokémon Stadium with a copy of Pokémon Yellow, you can use it to teach Pikachu Surf,", "start": 265.86, "duration": 4.88}, {"text": "which you can then transfer back into Yellow to unlock a whole new minigame!", "start": 270.74, "duration": 3.64}, {"text": "How cool is that?!", "start": 274.38, "duration": 0.98}, {"text": "Pokémon Stadium 2, which came out worldwide in 2001,", "start": 278.88, "duration": 2.94}, {"text": "added compatibility with the second generation of Pokémon games and updated some other features.", "start": 281.82, "duration": 4.28}, {"text": "You could now trade items between Pokémon carts, use Pokémon Stadium for Mystery Gifts", "start": 286.1, "duration": 4.32}, {"text": "look at and redecorate your room in 3D, and a couple other miscellaneous things.", "start": 290.42, "duration": 4.14}, {"text": "But the coolest Transfer Pak feature in the Stadium series has got to be the Game Boy Tower!", "start": 294.74, "duration": 5.6}, {"text": "This allowed you to actually play your Pokémon games on your Nintendo 64.", "start": 300.38, "duration": 4.46}, {"text": "It's got Super Game Boy borders, and if you've unlocked it, there's even two speed-up modes", "start": 304.84, "duration": 4.54}, {"text": "that let you play your game at twice or thrice-ish times the speed!", "start": 309.38, "duration": 4.1}, {"text": "Isn't it mind-boggling that there's an official Nintendo emulator", "start": 313.48, "duration": 2.92}, {"text": "that let you play one of its most treasured franchises", "start": 316.4, "duration": 3.16}, {"text": "in a way that it wasn't designed to be played?", "start": 319.56, "duration": 2.54}, {"text": "So this brings up the question:", "start": 322.14, "duration": 1.9}, {"text": "There was the Super Game Boy for the Super Nintendo,", "start": 324.12, "duration": 2.58}, {"text": "and the Game Boy Advance Player for the GameCube...", "start": 326.78, "duration": 2.36}, {"text": "... was this the same thing for the Nintendo 64?", "start": 329.5, "duration": 2.82}, {"text": "And the answer is officially no...", "start": 332.58, "duration": 2.2}, {"text": "... but technically? Kinda!", "start": 335.5, "duration": 1.84}, {"text": "The Transfer Pak is functionally just a handshake device", "start": 337.52, "duration": 3.12}, {"text": "that allows you to connect a Game Boy game to the N64 controller.", "start": 340.64, "duration": 3.28}, {"text": "It doesn't have Game Boy hardware in it per se.", "start": 343.92, "duration": 2.6}, {"text": "Really, I think the star of the show here is the N64 controller,", "start": 346.52, "duration": 2.54}, {"text": "which actually does the work of transmitting Game Boy game data to the N64's RAM,", "start": 349.06, "duration": 4.66}, {"text": "where it can actually do things with it.", "start": 353.72, "duration": 1.7}, {"text": "The Stadium games are the only games with a Player feature,", "start": 355.46, "duration": 2.64}, {"text": "and it's designed to only work with Pokémon games.", "start": 358.1, "duration": 2.46}, {"text": "However, that doesn't mean it can't NOT work with Pokémon games with a little bit of elbow grease!", "start": 360.56, "duration": 4.06}, {"text": "In 2014, game hacking enthusiast Mezmorize was able to hack ROMs of Wario Land II and Super Mario Land", "start": 364.64, "duration": 6.26}, {"text": "so that Pokémon Stadium would think it was playing Pokémon Blue,", "start": 370.9, "duration": 3.26}, {"text": "meaning that you CAN disguise Game Boy games and smuggle them past Stadium's security checks,", "start": 374.22, "duration": 5.04}, {"text": "which... how cool is that?!", "start": 379.28, "duration": 1.66}, {"text": "But it was just a proof-of-concept.", "start": 381.04, "duration": 1.7}, {"text": "This method doesn't make it a fully working emulator on the N64,", "start": 382.76, "duration": 3.48}, {"text": "because there were some issues with saving the game,", "start": 386.24, "duration": 2.56}, {"text": "and also, it's not really efficient to have to hack every Game Boy ROM to get it working.", "start": 388.8, "duration": 4.38}, {"text": "It would be a lot better if we could go to the source", "start": 393.2, "duration": 2.14}, {"text": "and just edit out the code that prevents other Game Boy games from working with Pokémon Stadium.", "start": 395.34, "duration": 4.66}, {"text": "Also, side note: There seems to be a lot of debate within the hacker community", "start": 400.26, "duration": 4.34}, {"text": "around if Pokémon Stadium even has a fully working emulator inside of it.", "start": 404.6, "duration": 4.3}, {"text": "Okay, maybe not a lot... the hacker community is probably focused on more important things,", "start": 408.9, "duration": 4.02}, {"text": "but there are rumors that it has Pokémon Game Boy data on the cart as a way to speed up load times.", "start": 412.92, "duration": 5.82}, {"text": "But we reached out to Mezmorize and they double-checked it for us,", "start": 418.74, "duration": 2.64}, {"text": "and found no evidence of Pokémon Game Boy code in Pokémon Stadium.", "start": 421.38, "duration": 4.5}, {"text": "There are other reasons to think it's a full emulator,", "start": 425.88, "duration": 2.72}, {"text": "like it was able to read Super Game Boy border data for Wario Land II,", "start": 428.6, "duration": 4.58}, {"text": "and secondly, and this is getting pretty technical,", "start": 433.18, "duration": 2.78}, {"text": "when the Game Boy Tower is checking to see if it's playing a Pokémon game,", "start": 435.96, "duration": 3.96}, {"text": "it's just checking the header, and that's it!", "start": 440.0, "duration": 2.56}, {"text": "It's not looking for other specific Pokémon code.", "start": 442.62, "duration": 2.88}, {"text": "And after all this, the most shocking fact to me is that this game is almost 20 years old,", "start": 445.5, "duration": 5.16}, {"text": "and there's still tons of ground to be broken here!", "start": 450.72, "duration": 2.06}, {"text": "We don't even have time to dive into things like Pokémon ACE hacks!", "start": 452.78, "duration": 3.38}, {"text": "But it's safe to say that the Pokémon Stadium games have yet to be fully cracked.", "start": 456.16, "duration": 4.78}, {"text": "So, the Pokémon Stadium games were the most famous uses of this wayward Nintendo peripheral,", "start": 462.86, "duration": 5.16}, {"text": "but there were actually four other pairs of games that used the Transfer Pak outside of Japan.", "start": 468.02, "duration": 4.34}, {"text": "Tch. Yeah, that's it: Four.", "start": 472.38, "duration": 2.28}, {"text": "But as you can probably tell from how much time is left on this video,", "start": 474.94, "duration": 3.32}, {"text": "there's still a lot to talk about, so let's move on, shall we,", "start": 478.26, "duration": 2.4}, {"text": "to the first Transfer Pak compatible pair of games: Mario Golf!", "start": 480.66, "duration": 3.66}, {"text": "Released in 1999, ahead of Pokémon Stadium and the actual Transfer Pak,", "start": 484.5, "duration": 4.18}, {"text": "their compatibility wasn't very well publicized, it's not even in either manual.", "start": 488.68, "duration": 4.54}, {"text": "But even though Pokémon Stadium wasn't out yet,", "start": 493.22, "duration": 2.28}, {"text": "Mario Golf superfans still had the option to import the Transfer Pak from Japan in the meantime,", "start": 495.5, "duration": 5.28}, {"text": "since the device itself isn't region-locked.", "start": 500.78, "duration": 2.8}, {"text": "The N64 and Game Boy Color Mario Golfs are really different from each other.", "start": 503.58, "duration": 4.2}, {"text": "They're both still golf games, but the N64 version is more a party game", "start": 507.84, "duration": 3.34}, {"text": "with a large roster of Nintendo characters and minigames to play with your friends,", "start": 511.18, "duration": 3.58}, {"text": "and the Game Boy Color version is more of a light RPG meant more for solo play.", "start": 514.76, "duration": 4.2}, {"text": "For the record, Mario isn't even unlocked at the start.", "start": 518.96, "duration": 2.66}, {"text": "It's called Mario Golf!! False advertising!!", "start": 521.62, "duration": 3.06}, {"text": "And an RPG campaign for the Game Boy Color game might sound a little weird,", "start": 524.92, "duration": 3.84}, {"text": "but don't forget, this was made by Camelot, whose resume included Shining Force,", "start": 528.76, "duration": 3.66}, {"text": "and would later go on to make Golden Sun.", "start": 532.42, "duration": 1.7}, {"text": "Here's how it worked:", "start": 534.3, "duration": 0.96}, {"text": "You can transfer your Game Boy Color campaign character to one of the four transfer slots on the N64", "start": 535.26, "duration": 5.1}, {"text": "to play in N64 tournaments and minigames.", "start": 540.36, "duration": 2.4}, {"text": "Doing so builds up their experience for when you bring them back to the Game Boy Color.", "start": 542.8, "duration": 3.88}, {"text": "Beyond the characters, there's literally a menu for showing off your N64 scores on your Game Boy Color,", "start": 546.68, "duration": 4.96}, {"text": "so you can share your records on the go.", "start": 551.64, "duration": 1.86}, {"text": "And that's about it!", "start": 553.6, "duration": 1.54}, {"text": "But we need to clear something up:", "start": 555.4, "duration": 1.9}, {"text": "While researching this game, we heard all about how you can use the Transfer Pak", "start": 557.3, "duration": 3.56}, {"text": "to unlock four exclusive characters on the N64 version,", "start": 560.86, "duration": 3.24}, {"text": "but that's... not really true.", "start": 564.1, "duration": 2.18}, {"text": "There are four character variants that you can choose at the start of the Game Boy Color campaign,", "start": 566.28, "duration": 4.02}, {"text": "basically kid/adult man, kid/adult woman.", "start": 570.3, "duration": 3.06}, {"text": "These four character models are in the N64 game,", "start": 573.36, "duration": 3.08}, {"text": "but as soon as you take out the Transfer Pak or turn it off,", "start": 576.44, "duration": 3.24}, {"text": "POOF! They're gone from the N64!", "start": 579.68, "duration": 2.16}, {"text": "This feature is only there so you can level up your character while you're away from your Game Boy Color.", "start": 581.84, "duration": 5.22}, {"text": "On top of that, you can't bring over all four characters at once when you connect your Transfer Pak,", "start": 587.12, "duration": 5.06}, {"text": "since there are only three save slots on the Game Boy Color, meaning you'll always be one slot short.", "start": 592.2, "duration": 5.1}, {"text": "So really, this is for a group of friends all playing Mario Golf separately,", "start": 597.48, "duration": 4.5}, {"text": "and then coming together to throw down!", "start": 601.98, "duration": 2.18}, {"text": "Needless to say, these Game Boy Color characters are not available", "start": 604.5, "duration": 3.54}, {"text": "on the Virtual Console release of Mario Golf 64.", "start": 608.04, "duration": 3.06}, {"text": "But that's okay, because it's not really what they were designed for.", "start": 611.24, "duration": 2.96}, {"text": "Their base stats aren't great because they're intended to be levelled up more powerful than the other characters.", "start": 614.2, "duration": 5.62}, {"text": "It's a cool feature to be able to build a character across two games,", "start": 619.86, "duration": 3.54}, {"text": "but that that's just about all that you can do is pretty underwhelming.", "start": 623.58, "duration": 3.98}, {"text": "Our next game is the Mario Tennis pair which, let's be real folks,", "start": 627.76, "duration": 3.48}, {"text": "is most notable for introducing the world to our lord and savior, Waluigi,", "start": 631.24, "duration": 4.2}, {"text": "who, sidenote for those uninitiated, was only created because Wario needed a doubles pair,", "start": 635.44, "duration": 4.98}, {"text": "but Nintendo though an evil princess was too unseemly,", "start": 640.42, "duration": 2.66}, {"text": "a wrong that wouldn't be righted by the fans until 2018.", "start": 643.22, "duration": 3.28}, {"text": "The Mario Tennis games were also made by Camelot, and are a similar party game / RPG split.", "start": 646.62, "duration": 5.22}, {"text": "The difference though is that its Transfer Pak features are WAY more robust!", "start": 651.84, "duration": 4.18}, {"text": "You can even bring over all four campaign characters from one cart at once, and they stay on the N64 cart!", "start": 656.02, "duration": 6.14}, {"text": "But there's bigger fish to fry here!", "start": 662.28, "duration": 1.66}, {"text": "Both of these games unlock content on the other game, and it's a significant amount of content!", "start": 663.98, "duration": 5.06}, {"text": "If you transfer data from the N64 to the Game Boy Color,", "start": 669.04, "duration": 2.74}, {"text": "you will unlock a slew of characters and their minigames,", "start": 671.78, "duration": 2.8}, {"text": "which is cool in and of itself, but if you complete these minigames,", "start": 674.58, "duration": 3.38}, {"text": "you can then transfer THAT data back to the N64 and unlock new courts!", "start": 677.96, "duration": 4.84}, {"text": "This makes this pairing one of the most significant Transfer Pak games,", "start": 682.8, "duration": 3.48}, {"text": "and it also renders their Virtual Console re-releases merely a shadow in comparison,", "start": 686.28, "duration": 4.6}, {"text": "but especially the Game Boy Color version:", "start": 690.88, "duration": 1.88}, {"text": "Without the Transfer Pak, Game Boy Color Mario Tennis only has four Mario characters;", "start": 692.78, "duration": 4.58}, {"text": "Baby Mario, Luigi, Peach and Mario,", "start": 697.36, "duration": 2.6}, {"text": "a.k.a. the most basic Mario characters!", "start": 700.0, "duration": 2.5}, {"text": "No Waluigi, no deal! One star!", "start": 702.5, "duration": 2.62}, {"text": "It also means five fewer minigames on the Game Boy Color, and five fewer courts on the N64.", "start": 705.2, "duration": 5.66}, {"text": "It's an extra bummer because the Transfer Pak just acts as a switch,", "start": 710.86, "duration": 3.6}, {"text": "there's no real reason why these couldn't have been unlocked for their Virtual Console releases.", "start": 714.46, "duration": 4.08}, {"text": "Really, it just underscores how our wonderfully named SMA4:SMB3e from our e-Reader video", "start": 718.58, "duration": 5.36}, {"text": "was an absolute UNIT of a Virtual Console release!", "start": 723.94, "duration": 3.22}, {"text": "Our next two games are from then-Nintendo second party developer Rare:", "start": 727.26, "duration": 4.22}, {"text": "First, I wanna talk about Mickey's Speedway USA because it's a joke!", "start": 731.72, "duration": 4.22}, {"text": "If you boot up the N64 game with the Game Boy Color cart attached,", "start": 735.94, "duration": 3.42}, {"text": "you unlock Huey as a racer, a.k.a. the red one.", "start": 739.36, "duration": 3.42}, {"text": "And that's it.", "start": 743.04, "duration": 1.56}, {"text": "You get a short little cinematic and then PING! He's in the game!", "start": 744.68, "duration": 3.48}, {"text": "He's not even that great of a character stat-wise,", "start": 748.28, "duration": 2.22}, {"text": "but if you bought your copy second-hand, check your game! You might be lucky!", "start": 750.5, "duration": 4.22}, {"text": "This is the only way to unlock Huey in the North American and PAL versions,", "start": 754.82, "duration": 3.8}, {"text": "but since the Game Boy Color game never came out in Japan,", "start": 758.64, "duration": 2.74}, {"text": "you can unlock him in that version the first time you get a ghost token.", "start": 761.38, "duration": 3.34}, {"text": "... if you're curious about that, now you know.", "start": 765.12, "duration": 2.8}, {"text": "The more interesting game from Rare was Perfect Dark,", "start": 768.44, "duration": 3.08}, {"text": "though it's more interesting for what it didn't have, rather than for what it did.", "start": 771.52, "duration": 3.38}, {"text": "And yes, a Game Boy Color version of Perfect Dark was actually released, and it even had a Rumble Pak,", "start": 774.9, "duration": 5.2}, {"text": "which is pretty cool to see outside of a racing or pinball game!", "start": 780.1, "duration": 3.02}, {"text": "Anyway, when you plug it into the Transfer Pak, you unlock a few cheats:", "start": 783.24, "duration": 3.84}, {"text": "Cloaking Device, Hurricane Fists, R-Tracker and All Guns in Solo.", "start": 787.16, "duration": 4.0}, {"text": "Now those first three aren't a big deal, they're actually quite easy to unlock,", "start": 791.18, "duration": 3.46}, {"text": "but the All Guns cheat is one of Perfect Dark's hardest cheats to get!", "start": 794.64, "duration": 3.64}, {"text": "First off, it normally requires beating the final level on the hardest difficulty, Perfect Agent,", "start": 798.28, "duration": 4.76}, {"text": "in under five minutes and 31 seconds, which is no small feat,", "start": 803.04, "duration": 3.0}, {"text": "but to even be able to attempt this challenge, you must beat all other levels on Perfect Agent first!", "start": 806.04, "duration": 5.2}, {"text": "As a kid, I was never able to do this,", "start": 811.24, "duration": 2.14}, {"text": "but with the power of the Transfer Pak, my childhood can finally be completed!", "start": 813.38, "duration": 4.12}, {"text": "But it's really anticlimactic, like, literally.", "start": 818.0, "duration": 3.06}, {"text": "Plug in the Transfer Pak at any time, and the cheats just suddenly appear.", "start": 821.18, "duration": 4.26}, {"text": "I mean, at least Mickey's Speedway had a quick little movie.", "start": 825.48, "duration": 2.92}, {"text": "But that wasn't originally all the Transfer Pak was planned to do in Perfect Dark.", "start": 828.5, "duration": 3.9}, {"text": "In 1999, Rare announced they were going to allow players", "start": 832.4, "duration": 2.66}, {"text": "to map actual pictures of people's faces onto avatars within the game", "start": 835.06, "duration": 3.94}, {"text": "using the Game Boy Camera, in a mode called Perfect Head,", "start": 839.0, "duration": 3.04}, {"text": "but by early the next year, Rare suddenly announced it was pulling support for it.", "start": 842.04, "duration": 3.82}, {"text": "Nintendo's Ken Lobb claimed that Rare had trouble getting it to run without crashing the game,", "start": 845.86, "duration": 4.3}, {"text": "but the feature itself was also an unfortunate bit of bad timing:", "start": 850.16, "duration": 3.42}, {"text": "The ability to put not just your face, but anyone's face, into a first person shooter,", "start": 853.58, "duration": 4.26}, {"text": "was a hard sell hot off the heels of the Columbine shooting.", "start": 857.84, "duration": 2.96}, {"text": "It's not a feature that's particularly missed, since there's still plenty of crazy things in Perfect Dark,", "start": 860.8, "duration": 5.04}, {"text": "however, there WAS a game that used the Game Boy Camera in this way:", "start": 865.84, "duration": 4.16}, {"text": "And that game was Mario Artist for the 64DD!", "start": 870.16, "duration": 3.5}, {"text": "... man, we gotta get ourselves one of those.", "start": 873.86, "duration": 1.68}, {"text": "With the Game Boy Camera, players could actually take pictures of themselves", "start": 875.74, "duration": 3.16}, {"text": "and map it onto an avatar, and use it in animations or minigames!", "start": 878.9, "duration": 3.7}, {"text": "We sadly don't have our own DD, so Pug Hoof Gaming let us use some of his footage!", "start": 882.6, "duration": 4.58}, {"text": "If you'd like to see more, link is in the description below.", "start": 887.18, "duration": 2.54}, {"text": "This feature is kinda like Miis ten years before the Wii, and it's a pretty cool feature on its own,", "start": 889.76, "duration": 5.16}, {"text": "but what really caught my eye was that the avatars that you make in Mario Artist", "start": 894.92, "duration": 3.98}, {"text": "could also be transferred into the Japanese-only SimCity 64!", "start": 898.9, "duration": 4.0}, {"text": "Which means you could actually put your friends in a game instead of making your friends,", "start": 902.9, "duration": 3.76}, {"text": "well I mean, like, you can... still make your friends,", "start": 906.66, "duration": 2.02}, {"text": "but like, you make... more accurate friends... you know what I mean.", "start": 908.68, "duration": 3.04}, {"text": "... It's really cool!", "start": 911.8, "duration": 1.06}, {"text": "There were a handful of other Japanese games that had Transfer Pak capability,", "start": 913.32, "duration": 3.44}, {"text": "but it's not really worth getting into here, since we don't have any way to really test them.", "start": 916.76, "duration": 3.76}, {"text": "But our favorite is PD Ultraman Collection 64, because apparently for that game,", "start": 920.52, "duration": 4.38}, {"text": "you could attach ANY game into the Transfer Pak and unlock stuff, sorta like Monster Rancher.", "start": 924.9, "duration": 4.32}, {"text": "Like we mentioned at the top,", "start": 929.3, "duration": 1.28}, {"text": "the Transfer Pak was a pretty late addition to the Nintendo 64, and unsurprisingly,", "start": 930.58, "duration": 4.48}, {"text": "there are a handful of games whose planned Transfer Pak compatibility didn't make it out the door.", "start": 935.06, "duration": 4.22}, {"text": "A lot of this was pointed out to us by Mezmorize,", "start": 939.4, "duration": 1.88}, {"text": "but Hydro Thunder has Transfer Pak language buried in its code, and The New Tetris does as well", "start": 941.28, "duration": 5.04}, {"text": "which, by the way, we really recommend checking out the Cutting Room Floor's page on The New Tetris.", "start": 946.32, "duration": 4.86}, {"text": "There's some other good stuff buried in there too.", "start": 951.18, "duration": 2.58}, {"text": "It's worth noting that these games didn't have Game Boy versions,", "start": 953.9, "duration": 3.32}, {"text": "but Rugrats in Paris: The Movie, which had both N64 and Game Boy Color versions,", "start": 957.22, "duration": 5.02}, {"text": "has the phrase \"Transfer Pak\" in its code, but is not compatible with the device.", "start": 962.24, "duration": 4.74}, {"text": "Probably the biggest game with planned Transfer Pak compatibility was WWF No Mercy.", "start": 967.02, "duration": 5.14}, {"text": "The Transfer Pak would've allowed you to transfer over points that you earned in the Game Boy Color game", "start": 972.26, "duration": 4.42}, {"text": "to the Nintendo 64, to spend at the Smackdown Mall,", "start": 976.68, "duration": 3.28}, {"text": "but the Game Boy Color version was cancelled before the N64 game launched.", "start": 980.1, "duration": 3.64}, {"text": "However, Transfer Pak language can still be found in No Mercy's code.", "start": 983.78, "duration": 3.84}, {"text": "No Mercy has a passionate mod scene,", "start": 987.76, "duration": 2.2}, {"text": "maybe someone can find a way to mod WWF Betrayal to work with the game.", "start": 989.96, "duration": 5.06}, {"text": "The Transfer Pak had a couple of neat uses, but overall was basically best for Pokémon.", "start": 995.26, "duration": 4.8}, {"text": "I went my whole life without owning one, though.", "start": 1000.08, "duration": 2.16}, {"text": "I bought this thing specifically for this video, but I'm still glad I did!", "start": 1002.3, "duration": 3.78}, {"text": "Knowing that I'll have complete versions of Mario Tennis,", "start": 1006.08, "duration": 2.72}, {"text": "and that maybe one day, this thing'll be hacked into becoming a fully functional Game Boy player, is exciting!", "start": 1008.8, "duration": 6.3}, {"text": "And we wanna make sure we give a huge thanks", "start": 1015.16, "duration": 2.06}, {"text": "to Mezmorize and Pug Hoof Gaming, for helping out with this video.", "start": 1017.22, "duration": 3.48}, {"text": "This video is sponsored by Squarespace!", "start": 1021.34, "duration": 2.76}, {"text": "They have an all-in-one platform: No plugins, no updates, no patches ever,", "start": 1024.26, "duration": 6.22}, {"text": "which makes it super easy for the Hot Dog Gamer to add pictures of his favorite video game dogs", "start": 1030.48, "duration": 5.48}, {"text": "to his website: Nochumpzone.com!", "start": 1035.96, "duration": 2.96}, {"text": "We really made this website.", "start": 1039.1, "duration": 1.6}, {"text": "They also got 24/7 365-day support,", "start": 1041.0, "duration": 2.84}, {"text": "just in case you're having trouble making your hot dog game reviews hot diggity doggin' good!", "start": 1043.96, "duration": 6.06}, {"text": "You can start your free trial today at Squarespace.com/stopskeletons", "start": 1050.2, "duration": 4.96}, {"text": "and using the offer code 'STOPSKELETONS' to get 10% off your first purchase!", "start": 1055.16, "duration": 4.14}, {"text": "That's Squarespace.com/stopskeletons.", "start": 1059.48, "duration": 3.04}, {"text": "This video is also brought to you by every one of these beautiful people in our Patreon.", "start": 1062.66, "duration": 5.1}, {"text": "For just $1, you can see your name here in the credits of every video", "start": 1067.76, "duration": 3.64}, {"text": "and get early access to new Stop Skeletons From Fighting videos before they come to YouTube!", "start": 1071.4, "duration": 4.4}, {"text": "So if you like what you saw, hit the Subscribe button, ring that bell,", "start": 1075.98, "duration": 3.7}, {"text": "give us a like, give us a comment,", "start": 1079.86, "duration": 1.82}, {"text": "and we'll see you again next year!", "start": 1082.02, "duration": 1.96}]