[{"text": "Hello Internet. It's Q&A time.", "start": 0.0, "duration": 1.94}, {"text": "First question: \"Are memes the future of society?\"", "start": 1.94, "duration": 2.1}, {"text": "I think you meant this as a joke, but the answer is yes.", "start": 4.04, "duration": 2.88}, {"text": "The internet, for memes, is the perfect petri dish, gladiatorial theater, and mutation chamber...", "start": 6.92, "duration": 4.44}, {"text": "growing, selecting, and randomizing the memest memes to meme in our minds.", "start": 11.36, "duration": 3.72}, {"text": "Society has always been a war of memes, but before it was fought with sticks and stones.", "start": 15.08, "duration": 4.28}, {"text": "The internet, however, has arms-raced that fight to trench warfare of meme-driven brains in many areas.", "start": 19.36, "duration": 6.34}, {"text": "They've not yet captured all fields of thought, but I fear the meme trenches will only expand.", "start": 25.7, "duration": 4.86}, {"text": "In a previous Q&A, I was asked what topic I've changed my mind on...", "start": 30.56, "duration": 3.18}, {"text": "...and the unmitigated benefits of the Internet sure is one of those things.", "start": 33.74, "duration": 4.18}, {"text": "\"Rate from top to bottom: pancakes, waffles, french toast.\"", "start": 37.92, "duration": 2.74}, {"text": "If you know you're at a great restaurant, then the ordering hierarchy is:...", "start": 40.66, "duration": 2.5}, {"text": "...french toast before waffles before pancakes.", "start": 43.16, "duration": 2.48}, {"text": "If you're at a restaurant of unknown quality, the hierarchy reverses.", "start": 45.64, "duration": 3.48}, {"text": "Pancakes are more reliably consistent and thus can't reach the repulsive troughs or sublime peaks of French Toast.", "start": 49.12, "duration": 5.98}, {"text": "“What makes you unique compared to the 7 billion people on Earth?”", "start": 55.1, "duration": 2.48}, {"text": "In a world of billions, no one is unique.", "start": 57.58, "duration": 2.26}, {"text": "“If you could have a companion animal like \"The Golden Compass\" what would you have?”", "start": 59.84, "duration": 2.98}, {"text": "A chimpanzee daemon: maximize utility while minimizing inconvenience.", "start": 62.82, "duration": 4.12}, {"text": "“What common life advice do you disagree with?”", "start": 66.94, "duration": 1.78}, {"text": "\"Do what you love\" and her sister meme: \"Follow your passion\".", "start": 68.72, "duration": 3.28}, {"text": "The word 'passion' here is a disgusting perversion of language if, you know, words mean things.", "start": 72.0, "duration": 5.58}, {"text": "And yes, there are people who are 'passionate' (gross) about their work, but guess what?", "start": 77.58, "duration": 4.06}, {"text": "Those kinds of people don't need advice.", "start": 81.64, "duration": 2.24}, {"text": "They're going to do whatever they're uh 'passionate' about anyway.", "start": 83.88, "duration": 3.94}, {"text": "So this advice is useless to who are its exemplars,…", "start": 87.82, "duration": 2.54}, {"text": "…while being anti-useful to everyone else,...", "start": 90.36, "duration": 2.9}, {"text": "...making most people feel bad about their lives and their work by setting an impossibly high bar.", "start": 93.26, "duration": 5.78}, {"text": "In life, rather than expecting to find a burning passion inside yourself that you somehow don't know about already (because it doesn't exist)...", "start": 99.04, "duration": 6.48}, {"text": "...it's better and more useful to think of life like fishing -- some spots are beautiful (to you) ...", "start": 105.52, "duration": 4.06}, {"text": "...and in some spots your skills will catch fish, others not.", "start": 109.58, "duration": 3.52}, {"text": "But you can't know where you'd like to spend time until you go there ...", "start": 113.1, "duration": 3.14}, {"text": "and you can't know how many fish you can catch there until you try.", "start": 116.24, "duration": 3.38}, {"text": "The younger you are, the more time you can spend sailing to different spots…", "start": 119.62, "duration": 3.3}, {"text": "and then the older you are the more time you get to spend in places you know you like,...", "start": 122.92, "duration": 3.98}, {"text": "…refining your abilities to catch fish there.", "start": 126.9, "duration": 2.4}, {"text": "\"Did you have a point in life that turned you around productivity wise?", "start": 129.3, "duration": 3.04}, {"text": "If so what changed, and what contributed to that change?\"", "start": 132.34, "duration": 2.36}, {"text": "Yes, there was a time and an event.", "start": 134.7, "duration": 1.74}, {"text": "I drifted through school without learning how to be organized because, …", "start": 136.44, "duration": 2.7}, {"text": "…despite what schools tell you about preparing you for the real world, …", "start": 139.14, "duration": 2.7}, {"text": "…they're mostly a babysitting service obsessed with an endless game of Trivial Pursuit.", "start": 141.84, "duration": 5.42}, {"text": "When school dumped me into the real world I had no idea how to adult, …", "start": 147.26, "duration": 3.96}, {"text": "…and needed to figure it out fast.", "start": 151.22, "duration": 1.66}, {"text": "The single thing that changed me the most was keeping a paper notebook in my pocket…", "start": 152.88, "duration": 3.46}, {"text": "… and writing down my thoughts and simply looking back at that notebook on a regular basis.", "start": 156.34, "duration": 4.46}, {"text": "That loop booted me into a real human.", "start": 160.8, "duration": 2.26}, {"text": "It's so simple, but it comes down to increasing communication between …", "start": 163.06, "duration": 3.6}, {"text": "…the past, present, and future you.", "start": 166.66, "duration": 2.32}, {"text": "That's how you direct change in yourself over time.", "start": 168.98, "duration": 3.0}, {"text": "\"What motivates you to do anything productive when everything is meaningless anyway?\"", "start": 171.98, "duration": 4.06}, {"text": "This 'if we all die what's the point' meme is a bad one for brains.", "start": 176.04, "duration": 4.12}, {"text": "Like, it's true that in the long run we are all naught but dust, forgotten. Forever.", "start": 180.18, "duration": 5.9}, {"text": "But your present experiences are real and they're all you'll ever have.", "start": 186.08, "duration": 4.1}, {"text": "A sunset doesn't need meaning to be enjoyed, the enjoyment is the meaning.", "start": 190.18, "duration": 4.38}, {"text": "Using productivity to build a life you want to live is intrinsically meaningful, …", "start": 194.56, "duration": 4.44}, {"text": "…despite Abyss swallowing us all in the end.", "start": 199.0, "duration": 3.22}, {"text": "If you're not in a good place, there's lots of small stuff you can do to start turning that around…", "start": 202.22, "duration": 4.86}, {"text": "Watch this, do the opposite.", "start": 207.2, "duration": 1.92}, {"text": "“What would you do if you became immortal?”", "start": 209.12, "duration": 1.48}, {"text": "I'd live a really long time.", "start": 210.6, "duration": 1.24}, {"text": "“On a D&D alignment chart, where would you place yourself?”", "start": 211.84, "duration": 2.84}, {"text": "Oh, D&D alignment charts, so fun because of the endless disagreements over…", "start": 214.68, "duration": 4.4}, {"text": "… what the words ‘lawful, chaotic, good, evil, and neutral’ mean.", "start": 219.08, "duration": 3.44}, {"text": "You think it's obvious, but so does the guy you're arguing with.", "start": 222.52, "duration": 3.14}, {"text": "People might think I’m over here, but I might view myself as over here,…", "start": 225.66, "duration": 3.68}, {"text": "or depending on how much you want to want to D&D rules lawyer the word 'chaos', …", "start": 229.34, "duration": 3.78}, {"text": "…maybe even over here.", "start": 233.12, "duration": 1.36}, {"text": "But the question ultimately presupposes the lie that people are consistent selves.", "start": 234.48, "duration": 4.56}, {"text": "And in reality our selves are situational and everyone is everything for a time or under the right circumstances.", "start": 239.04, "duration": 6.98}, {"text": "But that's no fun: it's easier and memesier to put people on a 2D grid!", "start": 246.02, "duration": 4.16}, {"text": "And I've yet to see a D&D alignment chart for YouTube.", "start": 250.18, "duration": 2.86}, {"text": "Who among Tubers is our lawful good, and who is our chaotic evil?", "start": 253.16, "duration": 4.48}, {"text": "On the reddit, I look forward to seeing your 2D D&D interpretations of the multi-faceted people on this site.", "start": 257.64, "duration": 5.4}, {"text": "“You are allowed to change the name of the 7th planet on our solar system what would you call it?”", "start": 263.04, "duration": 3.58}, {"text": "King George, of course! I’m still serious about this meme. #7thPlanetKingGeorge", "start": 266.62, "duration": 4.24}, {"text": "“If you could remove a single trait/characteristic from human beings as a species what would it be and why?”", "start": 270.86, "duration": 5.3}, {"text": "Human tribalism... is a double-edged sword.", "start": 276.16, "duration": 2.6}, {"text": "There were 14,000 questions submitted to this Q&A on my the reddit, …", "start": 278.84, "duration": 5.28}, {"text": "…and it's astounding to see how many are really asking: \"Are you part of my tribe or not?\".", "start": 284.12, "duration": 5.64}, {"text": "And it's disappointing to see how badly people react when the answer is 'no' --", "start": 289.76, "duration": 4.86}, {"text": "even on the most trivial of things.", "start": 294.62, "duration": 2.14}, {"text": "However tribalism is how we develop teamwork and teamwork is how we build civilizations.", "start": 296.76, "duration": 5.26}, {"text": "But tribes are so often motivated by the totem they construct of the other tribe to yell at.", "start": 302.02, "duration": 5.7}, {"text": "So if tribalism and the teamwork it creates could still exist …", "start": 307.72, "duration": 3.46}, {"text": "…when removing the tendency to build totems to burn in effigy, I'd do that.", "start": 311.18, "duration": 3.84}, {"text": "“Can you wear a hat for the rest of the video?”", "start": 315.02, "duration": 1.66}, {"text": "Uh-OK", "start": 316.74, "duration": 0.9}, {"text": "\"What's your opinion on whether Balrogs have wings?\"", "start": 317.64, "duration": 1.98}, {"text": "Ahh, the great Balrog debate of 2000 lives on.", "start": 319.7, "duration": 3.4}, {"text": "There's a good reason my Balrog is drawn the way it is.", "start": 323.1, "duration": 2.88}, {"text": "The line from Fellowship reads: \n[Gandalf's] enemy halted again, facing him, and the shadow about [The Balrog] reached out like two vast wings.", "start": 326.56, "duration": 7.0}, {"text": "Unambiguous: a shadow that’s ‘like wings’ isn’t wings. They're metaphorical wings.", "start": 333.56, "duration": 5.36}, {"text": "Yet not two paragraphs later Tolkien writes:", "start": 339.16, "duration": 3.04}, {"text": "\" [The Balrog] drew itself up to a great height, and its wings were spread from wall to wall. \"", "start": 342.2, "duration": 4.84}, {"text": "Unambiguous: wings.", "start": 347.06, "duration": 1.62}, {"text": "Or maybe not?", "start": 348.7, "duration": 1.54}, {"text": "Are these wings the metaphorical wings from but 12 sentences earlier?", "start": 350.24, "duration": 3.82}, {"text": "Well now this has become an argument about how big the room is that these real or metaphorical wings much stretch across.", "start": 354.06, "duration": 7.98}, {"text": "Asking \"Did the Balrog have wings?\" The books have the same answer as: \"Hey, where did the Orcs come from?\"", "start": 362.04, "duration": 6.16}, {"text": "\"dd/mm/yy or mm/dd/yy?\"", "start": 368.2, "duration": 1.6}, {"text": "yyyy-mm-dd", "start": 369.88, "duration": 0.8}, {"text": "\"What are your thoughts on your thoughts?\"", "start": 370.68, "duration": 1.42}, {"text": "Who knows where thoughts come from, they just appear.", "start": 372.1, "duration": 2.1}, {"text": "\"Is the glass half full or half empty?\"", "start": 374.2, "duration": 1.86}, {"text": "Why must judgment be passed? The glass is this full.", "start": 376.06, "duration": 2.52}, {"text": "\"How would you rule the world?\"", "start": 378.58, "duration": 1.22}, {"text": "With compassion. And an IRON FIST.", "start": 379.88, "duration": 2.54}, {"text": "\"AM I FIRST ?????? \"", "start": 382.42, "duration": 0.82}, {"text": "No: you were exactly 10,044th.", "start": 383.32, "duration": 2.56}, {"text": "\"What have you read recently? Any recommendations?\"", "start": 385.88, "duration": 1.9}, {"text": "I'm glad you asked, Never Not Act, for today's sponsor is Audible,...", "start": 387.78, "duration": 3.64}, {"text": "…, who likes it when I recommend books and will give you a free audiobook with a 30-day trial at audible.com/grey", "start": 391.42, "duration": 7.64}, {"text": "Related to that earlier question, I did recently read \"Tribe\" by Sebastian Junger...", "start": 399.06, "duration": 4.64}, {"text": "…and it really changed my perception on the experiences soldiers have in war,…", "start": 403.7, "duration": 4.12}, {"text": "… and how people act during disaster and just in general…", "start": 407.82, "duration": 3.18}, {"text": "… how groups survive when there’s outside stresses acting on them.", "start": 411.0, "duration": 4.1}, {"text": "It's a thoughtful book and it’s also nice and short, which is a big advantage.", "start": 415.1, "duration": 4.78}, {"text": "So I liked Tribe.  I recommend it.  And if you want to give it a try, you can do so with Audible.", "start": 419.88, "duration": 5.6}, {"text": "They have an unmatched library of audiobooks and original audio shows you can listen to.", "start": 425.48, "duration": 4.42}, {"text": "Audiobooks have added a lot to my life and Audible is where I get my audiobooks from.", "start": 429.9, "duration": 5.06}, {"text": "So you should give them a try and go get your free audiobook …", "start": 434.96, "duration": 3.7}, {"text": "…maybe it’s Tribe, maybe it’s something else you want to listen to…", "start": 438.66, "duration": 2.34}, {"text": "...with a 30-day trial at audible.com/grey", "start": 441.0, "duration": 3.98}, {"text": "Thanks to Audible for sponsoring this episode and thank you to everyone who submitted questions.", "start": 444.98, "duration": 4.6}, {"text": "I'll see you next time!", "start": 449.58, "duration": 1.32}]