[{"text": "2018 was an extraordinary year for film. Some of the best science fiction", "start": 0.37, "duration": 4.88}, {"text": "films,", "start": 5.5, "duration": 0.69}, {"text": "animated films, action films and superhero movies ever made came out this year. And I'm still crying over A Star is Born.", "start": 6.19, "duration": 7.31}, {"text": "But if I had to point to the one film that still got me thinking it'd be Boots Riley's", "start": 13.5, "duration": 4.889}, {"text": "incredibly weird and provocative debut film, Sorry To Bother You.", "start": 18.76, "duration": 3.619}, {"text": "The film is an absurdist critique of capitalism and tells the story of Cassius Green, a", "start": 32.629, "duration": 6.2}, {"text": "telemarketer who sacrifices his identity, his relationships and his morality in his quest to ascend up the corporate ladder.", "start": 39.199, "duration": 6.98}, {"text": "But it would be unfair to reduce this film simply to the label of anti-capitalist. It does more than point", "start": 46.19, "duration": 6.77}, {"text": "its finger and say capitalism bad and that's what I want to talk about here. In my view, the film", "start": 52.96, "duration": 5.34}, {"text": "deemphasizes simple economic arguments as a critique against modern capitalism.", "start": 58.67, "duration": 5.119}, {"text": "It's not just saying Group A isn't getting paid what they deserve while Group B is getting paid more than they deserve, therefore", "start": 63.789, "duration": 6.12}, {"text": "there's an injustice. Rather", "start": 69.91, "duration": 1.23}, {"text": "the thrust of the film is to portray the real psychological effects of these injustices and how the flaws in human nature", "start": 71.14, "duration": 7.319}, {"text": "fuel the system. Wherever you land on the political spectrum,", "start": 78.71, "duration": 3.23}, {"text": "I think you'll find something interesting, unique and nuanced in this film.", "start": 81.979, "duration": 4.88}, {"text": "So let's dive in and figure out what Sorry To Bother You is all about.", "start": 86.86, "duration": 3.72}, {"text": "Hey, Mr. D. Emmits, Cassius Grey here. Sorry to bother you", "start": 90.94, "duration": 5.08}, {"text": "\"Hey, young blood...\"", "start": 103.86, "duration": 2.0}, {"text": "\"What up?\"", "start": 107.6, "duration": 0.7}, {"text": "\"Let me give you a tip. Use your white voice.\"", "start": 108.46, "duration": 3.14}, {"text": "\"My white voice?\" \n\"You want to make some money here?", "start": 111.7, "duration": 2.38}, {"text": "Then read the script with a white voice.\"\n Sorry To Bother You is a movie about", "start": 114.86, "duration": 3.98}, {"text": "deception and self-deception and also about how one leads into the other. Cassius is", "start": 119.39, "duration": 5.57}, {"text": "introduced to us as someone willing to lie to get ahead.", "start": 125.3, "duration": 3.35}, {"text": "He's falsified his resume to get a job as a telemarketer at a company called Regal View.", "start": 128.86, "duration": 5.039}, {"text": "His employer knows he lied, but doesn't care. Later,", "start": 133.9, "duration": 4.17}, {"text": "Cassius is promoted to power caller, where his job is to sell the labor of people who have signed up for the lifelong labor", "start": 138.2, "duration": 7.55}, {"text": "contracts with a company called Worryfree.", "start": 146.0, "duration": 2.36}, {"text": "\"Protesters say Worryfree's method of lifetime labor contracts is a new form of slavery.", "start": 149.03, "duration": 4.97}, {"text": "Worryfree CEO Steve Lyft was interviewed on Oprah today.\" \"No,", "start": 154.67, "duration": 4.52}, {"text": "conclusively, no, her workers do not sign contracts over threats of physical violence. So therefore the comparison to slavery is just ludicrous.", "start": 160.1, "duration": 6.529}, {"text": "But where lying was tolerated before, now it's mandatory. \"White voice at all times here.\" \"Yes, I", "start": 167.3, "duration": 7.22}, {"text": "almost forgot.\"", "start": 175.28, "duration": 1.14}, {"text": "Soon after this mask he wears for work begins to seep deeper into his actual identity.", "start": 176.42, "duration": 5.87}, {"text": "Instead of the white voice just being something he can put on and take off, it begins to change his essential nature and worldview. One", "start": 182.6, "duration": 6.709}, {"text": "morning, he forgets that he is using his white voice while in bed with his girlfriend. \"Good morning.\"\n\"No, please no!", "start": 189.31, "duration": 6.3}, {"text": "Stop that stupid voice Cassius!\"", "start": 196.3, "duration": 2.0}, {"text": "\"I didn't even realize I was doing it.\"", "start": 199.92, "duration": 2.0}, {"text": "The persona and his authentic identity have fused into one.", "start": 202.06, "duration": 4.04}, {"text": "I used that word persona here deliberately because it's what psychologist Carl Jung called this phenomenon. Personas are the masks that we wear", "start": 206.11, "duration": 7.47}, {"text": "depending on the situation. He writes that \"Persona is the individual's system of adaptation to or the manner", "start": 214.04, "duration": 6.589}, {"text": "he assumes in dealing with, the world.", "start": 220.63, "duration": 2.16}, {"text": "Every calling of profession, for example, has its own characteristic persona.", "start": 222.83, "duration": 4.4}, {"text": "A certain kind of behavior is forced on them by the world and professional people endeavor to come up to these expectations.", "start": 227.23, "duration": 5.669}, {"text": "Now personas can be a healthy part of a person's psychology.", "start": 233.39, "duration": 3.86}, {"text": "They are necessary to interact with the world. The problem occurs when", "start": 237.25, "duration": 3.179}, {"text": "society forces us to switch personas against our will or adopt personas we're uncomfortable with. In interviews Boots", "start": 240.89, "duration": 6.5}, {"text": "Riley has called the use of the white voice", "start": 247.39, "duration": 2.13}, {"text": "code-switching and in her TED talk on the subject", "start": 250.069, "duration": 2.389}, {"text": "Chandra Arthur explains it as such. \"Code-switching as a concept is really interesting. By definition", "start": 252.88, "duration": 5.07}, {"text": "it's what happens when people who speak multiple languages", "start": 257.95, "duration": 2.429}, {"text": "alternate between two or more, often times within the same phrase or sentence. In a more colloquial sense, code- switching is what happens when people", "start": 260.87, "duration": 7.429}, {"text": "reflexively or subtly change the way they express themselves.\"", "start": 268.7, "duration": 2.959}, {"text": "It makes some sense that people should wear a professional persona in professional settings.", "start": 271.91, "duration": 5.359}, {"text": "But since businesses have historically been dominated by white people, professional personas have also been coded white.", "start": 277.34, "duration": 6.92}, {"text": "\"Okay, so like", "start": 284.72, "duration": 1.74}, {"text": "Hello, Mr. Everett, Cassius Grey here. Sorry to bother you...\"", "start": 286.46, "duration": 3.98}, {"text": "\"Okay, now you've got it wrong.", "start": 290.44, "duration": 1.09}, {"text": "I'm not talking about", "start": 291.53, "duration": 2.0}, {"text": "sounding all nasal. It's like sounding like you don't have a care. Got your bills paid", "start": 293.9, "duration": 5.809}, {"text": "You're happy about your future, you're about ready to jump in your Ferrari out there after you get off this call.\"", "start": 300.56, "duration": 5.39}, {"text": "And it's important to note here that the movie also says that even for white people this voice is a facade to an extent.", "start": 306.02, "duration": 6.2}, {"text": "\"It's not really a white voice. It's what they wish they sounded like.", "start": 312.26, "duration": 4.969}, {"text": "So it's like what they think they're supposed to sound like.\" But the conflation of whiteness with wealth means that people of other", "start": 317.96, "duration": 7.49}, {"text": "backgrounds feel the need to put on this act or risk missing out on opportunities. And for Cassius, he must also code-switch to an", "start": 325.7, "duration": 7.669}, {"text": "exaggerated black identity for the entertainment of his bosses when called upon to do so. \"I don't know. I think he's lying", "start": 333.919, "duration": 5.69}, {"text": "I think you can rap. I think you should rap.\" \"Rap rap rap rap rap rap", "start": 339.609, "duration": 12.891}, {"text": "So there is a social cost to refusing to code-switch and there is a", "start": 353.0, "duration": 4.36}, {"text": "psychological cost to agreeing to code-switch. As Jung wrote, assuming a different persona for too long is dangerous.", "start": 357.59, "duration": 6.29}, {"text": "\"The danger is that they become identical with their personas — the professor with his textbook, the tenor with his voice. Then the damage is done;", "start": 363.979, "duration": 7.4}, {"text": "henceforth he lives exclusively against the background of his own biography.\" In other words,", "start": 371.659, "duration": 4.73}, {"text": "he is nothing more than society expects him to be based on his profession. In the film,", "start": 376.389, "duration": 3.959}, {"text": "there is one character that represents this danger for Cassius,", "start": 380.349, "duration": 3.269}, {"text": "it's this character. The character actually doesn't have a name because it's been bleeped out. \"Don't call me Mr. Bleep, Cassius.", "start": 383.619, "duration": 6.72}, {"text": "Call me Bleep.\" And the bleeping out of his name is significant.", "start": 391.129, "duration": 3.95}, {"text": "The character has so completely offered himself up to the corporation that he has lost his individual identity.", "start": 395.08, "duration": 6.179}, {"text": "He is only a title, so I'm going to just call him Mr.", "start": 401.259, "duration": 3.72}, {"text": "I find the costuming decisions with this character really interesting.", "start": 404.979, "duration": 3.329}, {"text": "He wears an eyepatch over his left eye which symbolizes how he must turn a blind eye on the Left Eye", "start": 408.309, "duration": 5.309}, {"text": "activist movement and the struggles of the lower classes in general.", "start": 413.869, "duration": 3.17}, {"text": "He shows no solidarity with the working classes because he literally refuses to see them. \n\"Look here Youngblood. We don't cry about the", "start": 417.039, "duration": 7.44}, {"text": "shit that should be. We just thrive on what is and what is...", "start": 425.419, "duration": 2.989}, {"text": "opportunity.\"", "start": 429.83, "duration": 1.259}, {"text": "For most of the film, Cassius has been acting exactly like Mr.", "start": 431.089, "duration": 4.49}, {"text": "He's been steadily", "start": 435.589, "duration": 1.591}, {"text": "associating himself entirely with his professional persona at the risk of losing a more balanced personality.", "start": 437.18, "duration": 6.019}, {"text": "So why does Cassius subject himself to this?", "start": 443.32, "duration": 2.48}, {"text": "\"I'm taking the covers!\"\n\"You can't be greedy!\"", "start": 449.88, "duration": 2.78}, {"text": "\"Don't play with me, Cassius!\"", "start": 452.82, "duration": 2.0}, {"text": "\"You don't need all of those covers! It's not necessary!\"", "start": 455.04, "duration": 6.34}, {"text": "\"The whole reason I went to work for Regal View was to make myself more interesting to you.\"", "start": 466.82, "duration": 4.7}, {"text": "Just as Cassius is lying to his employer and himself, he is also lying to us.", "start": 471.6, "duration": 4.7}, {"text": "We cannot take him at his word about his own motivation in this film", "start": 476.3, "duration": 3.569}, {"text": "and, in fact, the story of the film acts as a gauntlet that strips away all the deceptions and", "start": 479.87, "duration": 4.679}, {"text": "posturing surrounding why someone would want to pursue wealth. His desire at the beginning of the film is instantly apparent. He's dirt poor,", "start": 484.77, "duration": 7.069}, {"text": "he's living in a garage, he can only put 41 cents worth of gas in his car at a time,", "start": 491.84, "duration": 4.589}, {"text": "he has manual windshield wipers. Obviously, he wants money to cover his basic necessities. That's his first motivation.", "start": 496.46, "duration": 6.45}, {"text": "It's also the motivation of Squeeze, one of Cassius' co-workers", "start": 502.95, "duration": 3.38}, {"text": "who is the most vocal proponent for forming a union. \"Because we make the profits and they don't share.", "start": 506.33, "duration": 5.489}, {"text": "If we're gonna give them our day,", "start": 512.22, "duration": 2.0}, {"text": "we need to have enough to cover our basic necessities.\" Were Squeeze the main character of the film,", "start": 514.86, "duration": 5.0}, {"text": "that's probably as far as this critique would go. The brilliance of Sorry To Bother You is that its critique of capitalism", "start": 519.86, "duration": 6.119}, {"text": "runs deeper than these simple economic arguments. Because whenever Cassius attempts to make an economic argument, the film", "start": 526.05, "duration": 5.69}, {"text": "undercuts it. \"God made this land for all of us and", "start": 532.17, "duration": 2.66}, {"text": "greedy people like you want to hog it to yourself and your family and charge all the rest of us for the right to live.\"", "start": 535.32, "duration": 5.21}, {"text": "\"Me and my family?\" \n\"Yeah.\"", "start": 540.54, "duration": 2.0}, {"text": "\"Cassius, I'm your fucking uncle!\"", "start": 543.03, "duration": 1.83}, {"text": "And that's because Cassius isn't only interested in basic necessities. From the beginning of the film,", "start": 544.86, "duration": 5.33}, {"text": "he wants a bit of luxury as well. After all, he already owns a car but... \"I gave you that car you drive!\"", "start": 550.19, "duration": 6.09}, {"text": "\"That's a damn bucket!\"", "start": 556.74, "duration": 1.41}, {"text": "So motivation number two is some comfort and luxury and the moment he gets some money.", "start": 558.15, "duration": 4.969}, {"text": "he upgrades everything he owns. Cassius also has another primal instinct in his need to provide for his family.", "start": 563.13, "duration": 6.289}, {"text": "His uncle is late on his mortgage and might lose his house to the bank and sign up for the Worryfree life-long labor", "start": 569.81, "duration": 5.489}, {"text": "contract. So motivation number three is provide for the family and stop all that from happening. As for motivation number four? \"The whole reason I", "start": 575.4, "duration": 7.639}, {"text": "went to work for Regal View was to make myself more interesting to you.\"", "start": 583.259, "duration": 3.049}, {"text": "\"Cassius the old you was way more interesting.\"", "start": 589.319, "duration": 2.299}, {"text": "And here's what I mean about Cassius lying to us and himself because clearly this isn't the only motivation but it is a", "start": 591.929, "duration": 6.289}, {"text": "powerful one that touches on another theme in the movie. An idea that is firmly embedded in our culture that wealth", "start": 598.379, "duration": 6.14}, {"text": "equals sex appeal. \n\"What I fight for?", "start": 604.619, "duration": 2.27}, {"text": "This country you gotta make the money first. Then", "start": 607.439, "duration": 2.839}, {"text": "when you get the money you get power. Now, when you get the power, you get the woman.\"", "start": 611.669, "duration": 4.01}, {"text": "We see this with how the character DeBauchery treats Cassius. The moment Cassius gets promoted, DeBauchery becomes instantly and", "start": 617.91, "duration": 7.099}, {"text": "unsubtly attracted to him. \"35% of men who wear pink are more likely to start a franchise.\"", "start": 625.26, "duration": 5.63}, {"text": "In the elevator up to the upper floor, power collars", "start": 635.07, "duration": 3.38}, {"text": "like Cassius get to listen to motivational clips read in a tantalizing female voice. \n\"Mr. Green", "start": 638.45, "duration": 6.21}, {"text": "I am the computer, but I wish I had hands to caress your muscular brain.\"", "start": 644.99, "duration": 4.679}, {"text": "And the richest man in the movie has women swooning all over him. Scarface's ideology is rampant here", "start": 649.67, "duration": 6.6}, {"text": "but it's also clearly represented as a corrosive idea that the film", "start": 656.27, "duration": 4.349}, {"text": "rebukes. Cassius wants money to keep his girlfriend, Detroit,", "start": 660.9, "duration": 3.38}, {"text": "but she doesn't care about money or about him putting on some grand display of wealth.", "start": 664.28, "duration": 4.589}, {"text": "She's attracted to Cassius and later to Squeeze", "start": 668.87, "duration": 2.52}, {"text": "because of their moral character.", "start": 671.82, "duration": 1.92}, {"text": "Detroit", "start": 673.74, "duration": 0.6}, {"text": "embodies the kind of inner self-assurance that Cassius so desperately desires. Not just in his need to be a more dominant male but also", "start": 674.34, "duration": 7.039}, {"text": "in his need to forge a legacy, his fifth motivation. In this early scene", "start": 681.38, "duration": 4.739}, {"text": "we find Cassius in a sort of existential crisis.", "start": 686.12, "duration": 3.059}, {"text": "He wants his actions to have a meaningful impact on the world while Detroit advises him that he should be living authentically. \n\"At some point", "start": 689.18, "duration": 7.89}, {"text": "this Sun will explode and everyone will have died and", "start": 697.53, "duration": 3.169}, {"text": "no one will know what I'm doing. And what I'm doing right now won't even matter.", "start": 701.04, "duration": 3.079}, {"text": "\"Oh baby, baby it will always matter.", "start": 704.119, "duration": 2.0}, {"text": "Okay, because it matters now. This moment, these moments...", "start": 706.86, "duration": 3.29}, {"text": "When I kiss you,", "start": 710.91, "duration": 1.2}, {"text": "it's not for posterity's sake.\" \nShe has this kind of inner peace that is immune from the", "start": 712.11, "duration": 4.79}, {"text": "circumstances of her existence that Cassius clearly lacks.", "start": 717.12, "duration": 3.02}, {"text": "So he wants basic necessities so he can provide for his family and he wants luxuries so he can impress his girlfriend.", "start": 720.15, "duration": 5.719}, {"text": "And he also wants to leave a legacy. That's what the film tells us he thinks is motivating him", "start": 726.06, "duration": 5.03}, {"text": "but is that his true motivation? At the midpoint of the movie Cassius has a decision to make.", "start": 731.09, "duration": 4.799}, {"text": "Detroit tells him that she will leave him if he betrays the protesters by going into work that day.", "start": 736.22, "duration": 5.129}, {"text": "This decision comes after he has already successfully attended to the first four of the desires", "start": 741.35, "duration": 5.28}, {"text": "we've gone through: he's provided for his family; he's covered his basic needs; he's obtained some luxuries;", "start": 746.63, "duration": 5.479}, {"text": "If he doesn't cross the picket line,", "start": 752.14, "duration": 1.5}, {"text": "he'd keep his girlfriend and he also has the option to join the protestors and", "start": 753.64, "duration": 4.2}, {"text": "campaign for a higher wage to get the money to sustain those other needs. But in this decision his true character and", "start": 758.06, "duration": 6.08}, {"text": "motivation are revealed. This is a character undergoing what philosopher Jean-Paul Sartre called bad", "start": 764.51, "duration": 5.959}, {"text": "faith. Bad faith is when we trick ourselves into believing something that is untrue.", "start": 770.47, "duration": 5.28}, {"text": "We're not even aware that we're doing this. Cassius is initially uncomfortable with the prospect of selling slavery", "start": 775.75, "duration": 5.969}, {"text": "but he is able to convince himself that the practice is no more immoral than anything else. \n\"You sell fucking slave labor!\"", "start": 781.72, "duration": 7.2}, {"text": "What the fuck isn't slave labor?", "start": 788.92, "duration": 2.0}, {"text": "\"You side step more than the fucking Temptations!\"", "start": 792.41, "duration": 2.0}, {"text": "Up until this point, his use of white voice, of code-switching and personas affected his external personality.", "start": 799.43, "duration": 6.979}, {"text": "But in bad faith there is a", "start": 806.41, "duration": 1.96}, {"text": "fundamental shift to his internal identity. To protect his conception of himself as good", "start": 808.37, "duration": 5.239}, {"text": "he must rationalize the immoral into the moral and he's biased into doing so because the", "start": 813.61, "duration": 6.33}, {"text": "profession offers him something he's never felt before:", "start": 820.04, "duration": 2.809}, {"text": "exceptional. \"I'm telling everybody how you been kicking all types of ass at work.\" \n\"Yeah. I mean,", "start": 823.49, "duration": 4.04}, {"text": "I' finally feel like I'm feeling myself. I'm a fucking monster at this!", "start": 828.38, "duration": 8.56}, {"text": "Through his job he's found", "start": 837.38, "duration": 2.0}, {"text": "self-actualization, but he simply cannot give up the rush a feeling like he is doing something, anything better than other people, better than other men.", "start": 839.76, "duration": 7.28}, {"text": "The exhilaration is so great that it motivates the character to abandon everything else", "start": 847.17, "duration": 4.639}, {"text": "he cares about. Or as Walter White put it, \"I liked it.\"", "start": 851.81, "duration": 3.78}, {"text": "And so the critique of Sorry to Bother You cuts both ways. It critiques capitalism,", "start": 855.59, "duration": 5.219}, {"text": "yes", "start": 860.81, "duration": 0.21}, {"text": "but it also critiques human nature, and especially these extremely masculine", "start": 861.02, "duration": 4.2}, {"text": "impulses to perform and be rewarded. It shows how these impulses are used to fuel the excesses of capitalism.", "start": 865.53, "duration": 6.38}, {"text": "It also shows how the managers who run these companies are keenly aware of their employees' need for self-actualization", "start": 872.28, "duration": 6.2}, {"text": "and they have already adapted to it as well. \"You are not employees to me, you are team members.", "start": 878.76, "duration": 4.94}, {"text": "We're a family now. You know what that means? It means I lean on you, you lean on me. There's a synergy. You", "start": 883.71, "duration": 5.059}, {"text": "can feel that energy, I know that you can. People are starting to get emotional and I love that.\"", "start": 889.77, "duration": 4.01}, {"text": "Early in the film, there is a staff meeting at Regal View which contrasts two different management styles.", "start": 893.88, "duration": 5.42}, {"text": "The first is given by this character.", "start": 899.39, "duration": 1.71}, {"text": "His language is loaded up with violent militaristic", "start": 901.1, "duration": 3.269}, {"text": "metaphors and his tone implies a clear distinction between the employee and the employers. \"You've gotta know when to bag 'em and when to tag 'em.", "start": 904.71, "duration": 7.88}, {"text": "Bagging is when you drop the call like a dead body into a bag yet", "start": 913.29, "duration": 4.219}, {"text": "drop that shit...\" On the face of it,", "start": 917.51, "duration": 2.309}, {"text": "this may feel like an oppressive management style", "start": 919.82, "duration": 2.49}, {"text": "but the film suggests it's actually less insidious than what follows, because what follows is less truthful.", "start": 922.31, "duration": 5.939}, {"text": "DeBauchery uses softer language and speaks in friendly kind terms.", "start": 928.5, "duration": 4.76}, {"text": "She attempts to erase the perception that there is a divide between the employees and the employers. \"You are not employees to me,", "start": 933.26, "duration": 6.15}, {"text": "you are team members. We're a family now.\" Of course,", "start": 939.81, "duration": 2.599}, {"text": "this is a total illusion that they're crafting and Cassius points it out immediately. \"Does that mean we get paid more?\"", "start": 942.41, "duration": 5.76}, {"text": "\"No.", "start": 950.85, "duration": 1.02}, {"text": "Okay, but what is capital right?\" \nThe hierarchy still exists", "start": 951.87, "duration": 3.74}, {"text": "but pretending that they don't is a method of pacification.", "start": 955.61, "duration": 3.638}, {"text": "\"The new capitalism is there's no capitalism here.", "start": 959.248, "duration": 3.021}, {"text": "What are you talking about? You know, it's like this is this is not a workplace,", "start": 962.27, "duration": 4.599}, {"text": "this is a beanbag room you and I'm not your boss, I'm your friend who tells you what to do.\"", "start": 966.87, "duration": 5.579}, {"text": "\"We have everything you can imagine.\" \"Google really takes care of us.\" \"And it all goes down at Google's main headquarters", "start": 973.269, "duration": 6.14}, {"text": "aka the Googleplex,", "start": 979.959, "duration": 2.0}, {"text": "one giant fun house!\"", "start": 982.54, "duration": 1.71}, {"text": "The idea here is that in order to retain a workforce, management needs to be able to convince its employees that their needs are being", "start": 984.25, "duration": 6.469}, {"text": "provided for. In the past, management has been able to compensate its employees but workers are increasingly motivated by the need for", "start": 990.73, "duration": 6.619}, {"text": "self-actualization, they need to feel like they are truly part of something greater than themselves or doing something positive.", "start": 997.75, "duration": 5.69}, {"text": "Whatever! And so this song and dance is playing in which we all pretend reality is otherwise. In theory,", "start": 1003.839, "duration": 5.929}, {"text": "the employer is providing a secondary value to the employee and the employee", "start": 1009.769, "duration": 3.48}, {"text": "should be grateful for this, thus reducing the likelihood that the workers will agitate for a union.", "start": 1013.29, "duration": 5.21}, {"text": "But the moment workers do agitate for a union, the facade drops immediately and management's real opinions of their workers are", "start": 1018.5, "duration": 7.34}, {"text": "exposed.", "start": 1026.1, "duration": 2.0}, {"text": "\"Fuck you! Fuck you!\"", "start": 1028.1, "duration": 2.0}, {"text": "This version of friendly hip capitalism is embodied by the CEO of worry-free Steve", "start": 1030.24, "duration": 5.989}, {"text": "Lyft. In most Hollywood movies, you can tell that the CEO character is evil just by looking at them.", "start": 1036.23, "duration": 5.16}, {"text": "They're smarmy, egotistical and emotionless. In contrast, Steve Lyft is this young, strapping, frat boy type guy.", "start": 1041.39, "duration": 6.27}, {"text": "He's cool, casual and disarming.", "start": 1047.66, "duration": 2.009}, {"text": "Don't worry about the horse people! Who'd want to rebel against this lovable chap? \"When I first met the founders", "start": 1049.669, "duration": 4.83}, {"text": "I walked into their office and found Larry Page on rollerblades and Sergey Brin", "start": 1054.5, "duration": 5.64}, {"text": "bouncing around on a physio ball.\"", "start": 1060.6, "duration": 1.88}, {"text": "But just as the workers are forced to wear certain personas, Steve Lyft's outward charm is just that, a useful", "start": 1062.48, "duration": 6.0}, {"text": "persona, a tool to excuse his immoral practices and so it should be something that we are suspicious of.", "start": 1068.7, "duration": 6.44}, {"text": "People have complicated reasons for wanting to get rich beyond", "start": 1082.94, "duration": 3.14}, {"text": "satiating their basic needs. Men especially want to increase their attractiveness to women and many are seeking the self-actualization", "start": 1086.299, "duration": 5.96}, {"text": "that comes with being proficient at something. But to satisfy those needs, we are forced by society to enter into bad faith, forced to adopt", "start": 1092.57, "duration": 7.459}, {"text": "multiple personas. For the black community", "start": 1100.279, "duration": 2.06}, {"text": "especially this means code-switching between white identities,", "start": 1102.679, "duration": 3.26}, {"text": "stereotypically black identities and their authentic selves. This creates an identity", "start": 1106.34, "duration": 4.4}, {"text": "crisis in which the professional persona takes over the authentic personality. Workers also feel guilt over", "start": 1110.96, "duration": 6.05}, {"text": "participating in a system that is immoral. To counteract these psychological problems,", "start": 1117.44, "duration": 4.67}, {"text": "the management styles at big corporations have fundamentally shifted.", "start": 1122.2, "duration": 3.359}, {"text": "They're now aimed to alleviate guilt, make workers feel included and self-actualized so that they don't rebel", "start": 1125.559, "duration": 5.52}, {"text": "against the system and can be more easily", "start": 1131.36, "duration": 2.0}, {"text": "exploited monetarily. In the film's conclusion, the billionaire character reveals his plan to turn his", "start": 1133.73, "duration": 5.359}, {"text": "lower-level workers into these freaky half horse/half human creatures, equi sapiens, literal beasts of burden.", "start": 1139.22, "duration": 5.929}, {"text": "Here, the critique of capitalism is at its most obvious.", "start": 1145.549, "duration": 2.869}, {"text": "If you're at the bottom of the hierarchy, you must surrender your body and your dignity to the system.", "start": 1148.419, "duration": 4.739}, {"text": "But the more interesting critique, the one that we've been talking about is if you attempt to ascend through the ranks of capitalism,", "start": 1153.159, "duration": 6.479}, {"text": "you must sacrifice your inner identity, your individuality and your morality. In doing so, the film", "start": 1159.639, "duration": 5.07}, {"text": "transcends the simple economic argument against our current system and instead depicts the psychological wound that participating in this system", "start": 1164.99, "duration": 7.13}, {"text": "inevitably creates .But thankfully, more than that,", "start": 1172.549, "duration": 2.69}, {"text": "it depicts a way out, as well. In its conclusion,", "start": 1175.279, "duration": 2.57}, {"text": "Cassius begins to live a morally righteous life, to live authentically.", "start": 1178.34, "duration": 3.679}, {"text": "And the film posits that we must do this on an individual level. We must commit ourselves to opposing injustice", "start": 1182.269, "duration": 6.65}, {"text": "even if this means financial sacrifice because once we do, we can become effective", "start": 1188.919, "duration": 4.469}, {"text": "leaders of collective movements that have a real chance to change the system.", "start": 1193.7, "duration": 5.329}, {"text": "Hey everyone", "start": 1201.35, "duration": 1.039}, {"text": "So, if you enjoy my video essays and you're interested in writing your own essays, whether in print or on video,", "start": 1202.389, "duration": 6.51}, {"text": "then I recommend checking out Roxane Gay's new class on Skillshare. And I want to thank Skillshare for sponsoring", "start": 1209.029, "duration": 6.5}, {"text": "this video. Roxanne is a writer whose work I've been following for a while now", "start": 1215.8, "duration": 3.75}, {"text": "so it was really exciting for me to see her make a course on", "start": 1219.55, "duration": 2.88}, {"text": "crafting personal essays on Skillshare, since it's a topic that is so useful to me specifically.", "start": 1222.53, "duration": 5.45}, {"text": "So, if you're interested in writing or in graphic design or", "start": 1227.98, "duration": 2.819}, {"text": "animation or the hundreds of other fields that Skillshare covers, then give Skillshare a shot!", "start": 1231.23, "duration": 4.909}, {"text": "They've got over 20,000 classes to choose from. Just click on the link in the description of this video to check it out.", "start": 1236.14, "duration": 5.82}, {"text": "The first 500 people to click that link will get two months of Skillshare for free!", "start": 1242.17, "duration": 4.199}, {"text": "Thanks for watching everyone and I want to give a big thank you to my patrons for supporting this channel! Keep writing everyone!", "start": 1246.37, "duration": 5.49}]