[{"text": "Greetings my beautiful lovelies. Hello, it's Emmy. Welcome back!", "start": 6.009, "duration": 3.379}, {"text": "Today I'm going to be starting a new series called Hard Times where I'm going to explore in recipes and foods that were created during", "start": 9.389, "duration": 5.55}, {"text": "times of difficulty like the Great Depression or like this recipe which was created in the 1990s in Cuba where there are food shortages", "start": 15.1, "duration": 7.68}, {"text": "and people created steaks out of", "start": 23.06, "duration": 2.26}, {"text": "grapefruit skins.", "start": 25.94, "duration": 1.66}, {"text": "Yes. Today, I'm going to be making Bistec de Toronja. Toronja is grapefruit.", "start": 27.84, "duration": 5.2}, {"text": "So this is going to be a faux steak that is made with the white pithy part right underneath this skin.", "start": 33.18, "duration": 6.34}, {"text": "It's gonna be a little bit like a German schnitzel or a Japanese tonkatsu.", "start": 39.52, "duration": 3.04}, {"text": "It's going to be breaded and deep-fried,", "start": 42.94, "duration": 2.48}, {"text": "but I'm really curious to see if this is gonna taste at all bitter; if it's gonna have any sour grape fruity notes at all.", "start": 45.44, "duration": 5.7}, {"text": "What does the pith taste like when it's cooked? It's something that I always discarded. I love grapefruit", "start": 51.44, "duration": 4.4}, {"text": "So, this is a great example of nothing being wasted.", "start": 56.0, "duration": 2.5}, {"text": "We're gonna just shave this top layer off save the pit and then you still have the juicy fruit inside", "start": 58.74, "duration": 4.979}, {"text": "So when I was researching Bistec de Toronja", "start": 63.719, "duration": 2.189}, {"text": "I found a video which this recipe is inspired by and I'll put the link down below", "start": 65.909, "duration": 3.51}, {"text": "so this recipe was invented in the", "start": 69.549, "duration": 1.831}, {"text": "1990s in Cuba during a period of time where food was very scarce and there was a lot of food rationing so people really had", "start": 71.38, "duration": 6.83}, {"text": "to make do so my goal for the series not only to satisfy my curiosity about what these recipes taste like but also to learn", "start": 78.21, "duration": 6.0}, {"text": "and to empathize with what people struggled with during these times and perhaps that'll explain why for example", "start": 84.21, "duration": 5.549}, {"text": "Auntie or grandma is so frugal because she lived through those times right? She knows what it was to be hungry", "start": 90.009, "duration": 5.81}, {"text": "So I've mentioned this before but I loved learning about culture and history through the lens of food", "start": 95.82, "duration": 4.769}, {"text": "So the next thing I'm gonna be tackling in this series, I believe will be the Great Depression", "start": 100.59, "duration": 4.08}, {"text": "I just ordered a book that will be coming soon that includes recipes and stories about how people made things mean how they got by", "start": 104.71, "duration": 7.489}, {"text": "During times of difficulty. Alright, let's go ahead and start making our beef steak", "start": 112.45, "duration": 4.79}, {"text": "I got myself the biggest", "start": 117.24, "duration": 1.36}, {"text": "grapefruit that I could find the grocery store and I'm going to remove the very top layer of the grapefruit as soonly as", "start": 118.6, "duration": 5.9}, {"text": "Possible in the video they use a paring knife, but I'm thinking that I can even get their lair with a vegetable peeler", "start": 124.6, "duration": 4.62}, {"text": "So I'm gonna try doing that", "start": 129.47, "duration": 2.0}, {"text": "Yes, I'm gonna use a vegetable peeler and just take off just the top layer of the grapefruit. Oh, it smells so good", "start": 131.51, "duration": 7.729}, {"text": "I love grapefruit fresh grapefruit. Juice is the best. Oh", "start": 139.3, "duration": 4.889}, {"text": "It smells so good", "start": 145.97, "duration": 1.34}, {"text": "My grandmother used to actually save these peels and use them in the bathroom", "start": 147.31, "duration": 3.33}, {"text": "If you squeeze it, you can see a little bit of the juice come out", "start": 150.95, "duration": 3.619}, {"text": "Oh, it smells so good and in Japan you actually see yuzu", "start": 154.57, "duration": 4.559}, {"text": "which is another type of citrus kind of lemony and they put it in their bathwater to", "start": 159.13, "duration": 4.77}, {"text": "Perfume the bath we're gonna take this and cut it in half", "start": 165.11, "duration": 3.979}, {"text": "There's my grapefruit and", "start": 177.65, "duration": 2.0}, {"text": "This looks like it has a pretty good pith layer. So over a large bowl, we're gonna just", "start": 179.69, "duration": 5.33}, {"text": "carefully remove the fruit", "start": 185.63, "duration": 2.0}, {"text": "Using our thumbs to kind of leverage it out", "start": 188.0, "duration": 2.899}, {"text": "And want to keep this in one piece of at all possible because we want this to look like a steak", "start": 191.93, "duration": 5.33}, {"text": "Cut this so we don't make a hole, Ta-daa!  there it is", "start": 199.04, "duration": 3.589}, {"text": "The pith Wow look at that and there's our fruit and then we'll do the same with this side", "start": 204.02, "duration": 4.4}, {"text": "Let's just love things sorted in the face. No, I don't actually", "start": 214.4, "duration": 3.44}, {"text": "Rhetorical question. I yeah I talk too much", "start": 219.05, "duration": 3.559}, {"text": "So when I was a kid I was a pretty good student", "start": 224.42, "duration": 1.83}, {"text": "But on every report card my mom knew to expect that my teacher would say I talked too much like oh she talks too much", "start": 226.25, "duration": 6.26}, {"text": "she's a very bright young lady, but she talks too much and", "start": 232.51, "duration": 2.549}, {"text": "My mom actually saw me talking to myself on the swing set in the backyard and she's like, you know, we should have another kid", "start": 235.7, "duration": 6.199}, {"text": "But I still talk about", "start": 242.46, "duration": 2.0}, {"text": "It's just my nature", "start": 245.55, "duration": 1.92}, {"text": "Okay", "start": 247.47, "duration": 1.5}, {"text": "There we have it. The fruit is separated from the pith. That's actually quite lovely. Look at that -barap barap- like coconut shells", "start": 248.97, "duration": 7.13}, {"text": "But not okay, they actually don't smell like much", "start": 257.79, "duration": 3.319}, {"text": "So all the grapefruit sense actually in the zest of it the color portion of the grapefruit. This actually doesn't smell like much", "start": 261.359, "duration": 6.26}, {"text": "My hands on the other hand smell lovely and the fruit that's more than much either. Awesome. Okay. Now we're gonna prepare the cutlets", "start": 268.35, "duration": 7.25}, {"text": "You remove the little stem stock right there", "start": 278.46, "duration": 3.02}, {"text": "Do you know if you have like a pork chop and you want it to fry flat that if you give it little", "start": 284.929, "duration": 4.61}, {"text": "cuts around the perimeter that it will", "start": 289.669, "duration": 3.019}, {"text": "Cook flat. It's true. Now. We're going to season them with a bit of salt", "start": 293.329, "duration": 5.059}, {"text": "Both sides, and pepper", "start": 301.969, "duration": 3.769}, {"text": "Amazing what a little seasoning can do", "start": 310.159, "duration": 2.0}, {"text": "Crack an egg", "start": 314.899, "duration": 2.0}, {"text": "To my egg mixture I'm gonna add one clove of minced garlic", "start": 319.489, "duration": 2.33}, {"text": "Okay, so now we're ready to bread and put some breadcrumbs now we're going to bread our grapefruit so", "start": 325.459, "duration": 7.55}, {"text": "Coat that up. It's kind of amazing how it does look a little bit meat like oh, okay so bad in there", "start": 334.639, "duration": 6.62}, {"text": "There it is, alrighty so now we're ready to fry that grapefruit cutlets, I've got some oil heating here it's on medium-high it smells good", "start": 345.77, "duration": 7.819}, {"text": "Looking great", "start": 362.57, "duration": 2.0}, {"text": "Browning  up nicely", "start": 366.59, "duration": 2.0}, {"text": "And it smells delicious, smells garlicky and fried, that looks done, drain an on some  paper towels.", "start": 369.599, "duration": 7.94}, {"text": "Merch Merch Merch Merch Merch Merch Merch", "start": 388.16, "duration": 2.72}, {"text": "Do you want a piece of Winston check out the link down below to see how you can get yourself an official Winston t-shirt only", "start": 391.22, "duration": 5.389}, {"text": "offering them for a limited time only so act", "start": 396.61, "duration": 2.279}, {"text": "Look at this, isn't it incredible?", "start": 400.73, "duration": 1.76}, {"text": "I don't think if you showed this to anybody in a million years will  they ever guess that this is grapefruit pith", "start": 402.49, "duration": 5.1}, {"text": "Ever, ever, it looks just like me, looks like a chicken pork cutlet", "start": 408.44, "duration": 3.799}, {"text": "So I've garnished it with a little bit of cilantro and have a lemon wedge", "start": 412.27, "duration": 2.309}, {"text": "I love a little bit of acid with fried things, but I'm gonna try it plain first", "start": 414.58, "duration": 3.929}, {"text": "Nice crispy crust, look at that, it even looks like meat that's amazing!", "start": 422.54, "duration": 5.42}, {"text": "It has a little bit of resistance and it looks like meat, look at that! itadakimasu", "start": 431.27, "duration": 5.779}, {"text": "Mmm", "start": 441.26, "duration": 2.0}, {"text": "There is a distinctive bitterness to it, it definitely tastes bitter,", "start": 446.51, "duration": 4.01}, {"text": "but the texture is surprisingly meat-like and", "start": 451.31, "duration": 3.139}, {"text": "The flavor is pretty good. The pith itself is pretty meat-like, it kind of got a slightly spongy,", "start": 455.18, "duration": 6.17}, {"text": "resistant texture, kind of like meat, the exterior is wonderful, nice and crisp and crunchy", "start": 462.2, "duration": 5.36}, {"text": "Which is a nice kind of compliment to the pith itself. the flavor, though.", "start": 467.56, "duration": 3.689}, {"text": "Hmm", "start": 474.83, "duration": 2.0}, {"text": "The outside is very familiar, it's that same signature flavor that you have with mozzarella sticks that bread crummy,", "start": 479.27, "duration": 5.989}, {"text": "garlicky, crisp salt and peppery exterior exactly the same thin and crackly. The interior is completely different.", "start": 486.32, "duration": 6.38}, {"text": "This is actually significantly bitter. This is where the bitterness of the grapefruit is. It's in the pith. So it has kind of an astringent,", "start": 492.71, "duration": 7.97}, {"text": "bitter quality to it particularly at the very end.", "start": 501.47, "duration": 2.299}, {"text": "It's kind of like when you have tonic water straight up like tonic water without the gin", "start": 503.77, "duration": 3.39}, {"text": "it has that really pronounced bitterness and that's what this has. Definitely is an assault on your senses and your", "start": 507.68, "duration": 6.589}, {"text": "expectations because you're like, \"oh this looks delicious. This looks like my little chicken cutlet\"", "start": 514.55, "duration": 4.069}, {"text": "And then, when you eat it. Oh", "start": 519.18, "duration": 2.0}, {"text": "Wow, it's very bitter", "start": 522.31, "duration": 2.0}, {"text": "Hmm maybe this is a time where condiments are in order. Let's see ketchup and barbecue sauce", "start": 525.88, "duration": 6.739}, {"text": "Whenever you make a meal that's a little bit questionable", "start": 535.63, "duration": 1.97}, {"text": "I always like to have insurance and that means condiments. So I have some ketchup barbecue sauce and good old sriracha", "start": 537.6, "duration": 5.82}, {"text": "All right. Let's try it with the sriracha", "start": 543.42, "duration": 2.0}, {"text": "Mmm", "start": 548.38, "duration": 2.0}, {"text": "Love sriracha garlicky echoes the garlic notes better in the breading and", "start": 551.2, "duration": 4.19}, {"text": "You don't notice the bitterness quite as much the heat, tough, is welcome as well", "start": 555.82, "duration": 3.649}, {"text": "Okay now barbecue sauce", "start": 560.1, "duration": 2.0}, {"text": "Whoa!", "start": 563.84, "duration": 0.56}, {"text": "Actually, that doesn't work. Unh-uh.", "start": 566.42, "duration": 2.34}, {"text": "Barbecue sauce is too strong; too smoky; too sweet.", "start": 570.36, "duration": 2.86}, {"text": "Although it does eliminate some of the bitterness, it's not a compliment to that combination. Unh-uh.", "start": 574.0, "duration": 5.02}, {"text": "All right, lastly ketchup.", "start": 580.0, "duration": 1.44}, {"text": "Mm. Mmm...", "start": 584.8, "duration": 2.0}, {"text": "Ketchup is good. That, again, goes back to the combination of mozzarella sticks/ketchup/kind of bar food...", "start": 588.88, "duration": 5.66}, {"text": "Yes.", "start": 594.84, "duration": 0.5}, {"text": "Ketchup actually works, in my opinion, really well with that; as does the Sriracha.", "start": 595.44, "duration": 3.88}, {"text": "Maybe an application of salt prior to and letting it kind of", "start": 599.6, "duration": 3.18}, {"text": "leach out a little bit, kind of similar to what you do to eggplant slices --", "start": 602.86, "duration": 3.08}, {"text": "if you're making eggplant parmesan -- maybe that would get some of the bitterness out.", "start": 605.94, "duration": 3.84}, {"text": "But all in all, very, very impressed with how this looked; how it cooked up; taste, not so much, but in times of difficulty", "start": 610.04, "duration": 6.46}, {"text": "you often don't really have a choice, do you? All righty, so there you have it, Bistec de Toronja, the steak made out of grapefruit peel.", "start": 616.5, "duration": 6.479}, {"text": "I hope you guys enjoyed that one. I hope you guys learned something. Share this video with your friends;", "start": 622.98, "duration": 3.989}, {"text": "follow me on social media;", "start": 626.97, "duration": 1.239}, {"text": "let me know if there are recipes you want me to taste and try out; and I shall see you in my next video.", "start": 628.209, "duration": 4.911}, {"text": "Toodle-oo! Take care! Byee!", "start": 633.38, "duration": 2.56}, {"text": "....follow me on social, and I shall *burp, burp, burp, burp* next one. Toodle-oo! Take care! Byee!!", "start": 650.62, "duration": 5.04}]