[{"text": "Hi everybody, and a very welcome to Mentour and yet another video podcast. As always I hope you're doing absolutely fantastic.", "start": 1.05, "duration": 5.03}, {"text": "Today on the video guys", "start": 6.08, "duration": 0.78}, {"text": "Is there a safest seat in an aircraft?", "start": 7.1, "duration": 2.729}, {"text": "What should you be thinking about in order for you", "start": 10.44, "duration": 2.75}, {"text": "to maximize your safety when you're flying and", "start": 13.769, "duration": 2.33}, {"text": "do you need to do anything extra if you're sitting by an emergency exit?", "start": 17.0, "duration": 3.38}, {"text": "Stay Tuned!", "start": 21.02, "duration": 0.7}, {"text": "This video is brought to you by brilliant.org", "start": 36.3, "duration": 3.17}, {"text": "Now, if you're like me and you've been spending last month or so in the hammock, not really using your brain", "start": 39.47, "duration": 4.349}, {"text": "but school is coming up or work is coming up", "start": 43.82, "duration": 2.58}, {"text": "well, then you need to start to activate", "start": 46.4, "duration": 1.56}, {"text": "your brain and brilliant is a perfect tool to do just that. They have daily challenges that will give you, you know", "start": 47.96, "duration": 6.27}, {"text": "five minutes a day to really start working on things and", "start": 54.23, "duration": 3.119}, {"text": "Tte five hundred of the first of you who uses this link here below will get a whopping 20% off the annual fee of Brilliant", "start": 57.51, "duration": 5.75}, {"text": "But it's completely free to go and check it out, so", "start": 63.5, "duration": 2.279}, {"text": "do that!", "start": 66.479, "duration": 2.0}, {"text": "Right guys, so safest seat in an aircraft. You probably heard about this before or read articles about it, so", "start": 92.73, "duration": 7.039}, {"text": "Does such a thing exist?", "start": 100.29, "duration": 2.0}, {"text": "Well, the reason that I wanted to start talking about this was because", "start": 102.72, "duration": 3.229}, {"text": "There was an airline just last week that got into trouble because one of their employees decided to enter into their Twitter feed", "start": 106.47, "duration": 6.769}, {"text": "Which seat the passengers should be using in order to have the highest survivability rate", "start": 113.49, "duration": 5.36}, {"text": "Now for obvious reasons, that's probably not a smart thing to do if you are a representative in an airline.", "start": 119.52, "duration": 6.41}, {"text": "And why is that not a smart thing? Well, um", "start": 126.69, "duration": 2.809}, {"text": "there has been various articles about this going back for the last 10-15 years probably as long as there's been aircraft really and", "start": 130.11, "duration": 7.61}, {"text": "They have come up with different things", "start": 138.63, "duration": 2.239}, {"text": "Basically the most famous one which is the one you'll probably find whenever you google on this", "start": 142.92, "duration": 4.61}, {"text": "is an article that Time magazine did back in 2015 and", "start": 148.05, "duration": 3.979}, {"text": "They did a study based on", "start": 152.64, "duration": 2.75}, {"text": "17 different", "start": 156.12, "duration": 1.95}, {"text": "events", "start": 158.07, "duration": 1.31}, {"text": "Ranging from 1985 up to I think 2002", "start": 159.38, "duration": 3.9}, {"text": "And the used incidents where there had been", "start": 164.08, "duration": 2.88}, {"text": "aircraft crashing and there had been a mix of people surviving and not surviving.", "start": 166.96, "duration": 6.18}, {"text": "And based on that they started looking into", "start": 173.38, "duration": 2.86}, {"text": "The statistics of how safe each and every seat in an aircraft was.", "start": 176.52, "duration": 4.14}, {"text": "What they found", "start": 181.98, "duration": 1.68}, {"text": "Was that the seats in the back of the aircraft?", "start": 183.66, "duration": 3.259}, {"text": "specifically the middle seat in the back of the aircraft was slightly safer than the ones in the middle and in the front of the", "start": 187.56, "duration": 5.239}, {"text": "aircraft so the cheaper seats the most that tends to go last back", "start": 192.8, "duration": 4.48}, {"text": "They were statistically safer", "start": 198.84, "duration": 2.0}, {"text": "So", "start": 202.2, "duration": 1.08}, {"text": "So what's the issue with this then? Should you always be", "start": 203.28, "duration": 2.839}, {"text": "booking those seats if you're a nervous flyer if you, if you feel that you want to optimize your safety", "start": 206.64, "duration": 5.389}, {"text": "Well", "start": 213.09, "duration": 1.32}, {"text": "the problem with statistics guys is that statistics is only as good as", "start": 214.41, "duration": 4.939}, {"text": "the statistical material that's being used", "start": 219.959, "duration": 2.93}, {"text": "Right. So basically", "start": 223.47, "duration": 2.3}, {"text": "The more statistical material you have the more accurate the statistics will become, the more accurate", "start": 226.92, "duration": 6.38}, {"text": "the study will be. So if you have a hundred thousand events", "start": 233.3, "duration": 4.679}, {"text": "It's going to be better than ten thousand. And if you have ten thousand", "start": 238.53, "duration": 4.369}, {"text": "It's gonna be better than a thousand events. And the reason is that the less material you have", "start": 242.9, "duration": 5.07}, {"text": "The more likely is that what you see inside of your study might be", "start": 248.55, "duration": 4.91}, {"text": "affected by", "start": 254.13, "duration": 2.0}, {"text": "individual events, like for example", "start": 256.26, "duration": 2.0}, {"text": "What happened during the crash was it a", "start": 259.049, "duration": 2.809}, {"text": "an aircraft that slid off a runway, did they fly into a", "start": 262.65, "duration": 3.8}, {"text": "mountainside and was it a fire event?", "start": 267.36, "duration": 3.08}, {"text": "These kind of things okay, which is going to have a high impact on, for example survivability in case it happens.", "start": 271.05, "duration": 7.16}, {"text": "Right. So this study that Time magazine did", "start": 278.46, "duration": 3.649}, {"text": "Only had 17 events and it spanned over 15 years", "start": 283.02, "duration": 4.61}, {"text": "What you should be asking yourself is why was the statistical material so poor?", "start": 289.35, "duration": 6.709}, {"text": "The answer that it was so poor because there was so few events", "start": 296.58, "duration": 4.039}, {"text": "There was so few deadly crashes that kind of correspond to the type of events that they wanted to use", "start": 300.62, "duration": 5.79}, {"text": "And what does that indicate?", "start": 306.9, "duration": 2.0}, {"text": "That indicates that what they're studying is an extremely safe mode of transport, alright.", "start": 310.74, "duration": 6.58}, {"text": "And,", "start": 318.0, "duration": 0.5}, {"text": "even though that statistic that we're using is correct from a statistical standpoint, it still doesn't really indicate anything.", "start": 318.9, "duration": 7.07}, {"text": "The only thing it says is that", "start": 325.97, "duration": 1.69}, {"text": "listen", "start": 327.66, "duration": 0.509}, {"text": "What I should have been saying is we can't answer this question because we don't have enough statistical", "start": 328.169, "duration": 4.551}, {"text": "material to give you any meaningful view. Obviously that wouldn't have, you know,", "start": 332.78, "duration": 3.96}, {"text": "pulled so much people to read the article", "start": 337.52, "duration": 2.96}, {"text": "so this is what they did instead.", "start": 340.59, "duration": 2.24}, {"text": "And this is what you'll find if you go through and try to find any other studies on the subject.", "start": 343.2, "duration": 3.739}, {"text": "There is too bad or too poor", "start": 347.34, "duration": 2.929}, {"text": "statistical material. And the reason for that is because if you look at the lifetime risk of", "start": 351.21, "duration": 6.279}, {"text": "dying in a car accident for example that", "start": 357.71, "duration": 3.5}, {"text": "global statistics indicate that is about 1 in 112", "start": 362.0, "duration": 2.779}, {"text": "So almost 1 percent risk of that. If you look at the same statistics for dying in an aircraft accident, it's about 1 in", "start": 364.9, "duration": 7.92}, {"text": "8,000", "start": 373.12, "duration": 1.84}, {"text": "So,", "start": 375.23, "duration": 1.99}, {"text": "why are we not asking what is the safest seat in", "start": 377.27, "duration": 3.86}, {"text": "a car or a bus, a train or in a boat? Well, the reason for this is that we are always", "start": 383.0, "duration": 6.709}, {"text": "fascinated in the aviation industry and whenever there's something happening, especially", "start": 390.5, "duration": 5.029}, {"text": "an accident of some sort, it's being blown up into the media and huge, it can dominate the media cycle for weeks", "start": 396.11, "duration": 7.4}, {"text": "While if, let's say that", "start": 404.78, "duration": 2.0}, {"text": "300 people would perish in a horrible aircraft accident, obviously", "start": 407.75, "duration": 4.19}, {"text": "that deserves a lot of attention", "start": 413.09, "duration": 2.0}, {"text": "But the same attention is not given to the same amount of people dying in a war zone conflict or by", "start": 415.49, "duration": 7.94}, {"text": "drought for example, so", "start": 423.89, "duration": 2.419}, {"text": "It's slightly skewed and what this has meant", "start": 426.82, "duration": 2.44}, {"text": "Is that about one-third of humanity about one in three people", "start": 429.28, "duration": 4.5}, {"text": "are, now nervous flyers to some extent. Some people are extremely nervous flyers, other people are", "start": 434.26, "duration": 6.3}, {"text": "a little bit nervous and feel a little bit of discomfort and of course all of these, including this video to some extent,", "start": 441.32, "duration": 6.38}, {"text": "will make you potentially more nervous because, if you think, if you start thinking what is the safest seat,", "start": 447.95, "duration": 7.669}, {"text": "the next thought is gonna be", "start": 456.68, "duration": 2.0}, {"text": "So the other seats are unsafe or is it unsafe to fly? And that's not what you should be thinking, alright?", "start": 459.169, "duration": 7.16}, {"text": "There are ways that you can improve on your own safety because, of course,", "start": 467.06, "duration": 4.76}, {"text": "the aviation industry is not perfect. We do have incidents happening. It's very very rare, but they do happen. So", "start": 472.46, "duration": 7.309}, {"text": "What can you do then? Should you be looking at what seats to sit in?", "start": 480.29, "duration": 4.339}, {"text": "My answer to that is \"No\", right. The seats in", "start": 485.69, "duration": 3.47}, {"text": "an airliner flown", "start": 489.77, "duration": 1.5}, {"text": "by a reputable company and that is being checked by good aviation authorities is", "start": 491.27, "duration": 6.44}, {"text": "equally safe no matter where you sit in the aircraft.", "start": 498.77, "duration": 2.929}, {"text": "But what you should be doing is you should be paying close attention to for example, the safety briefing.", "start": 501.7, "duration": 6.62}, {"text": "So all of you now who's flying", "start": 510.98, "duration": 2.0}, {"text": "regularly would be kind of", "start": 513.649, "duration": 2.0}, {"text": "pff, looking the other way and thinking of yeah, the safety briefing they don't say anything new. Do they ?", "start": 515.959, "duration": 3.92}, {"text": "But the thing is if you would look into the cockpit and you would listen to me briefing my first officer", "start": 521.539, "duration": 6.71}, {"text": "You will notice that even though I fly the same departure out of my home base every day", "start": 528.47, "duration": 5.359}, {"text": "I still do a full briefing of how to do that", "start": 533.829, "duration": 3.809}, {"text": "I brief what would happen in case you have an engine failure. How would we fly? Where would we go?", "start": 537.64, "duration": 6.74}, {"text": "What would we think about? What's the threat today? Maybe there's VFR traffic around", "start": 544.38, "duration": 4.18}, {"text": "Visual smaller traffic. Maybe there are", "start": 549.14, "duration": 2.36}, {"text": "thunderstorms in the area. Maybe there is", "start": 552.44, "duration": 2.119}, {"text": "birds around the airport", "start": 555.079, "duration": 2.0}, {"text": "We briefed this even though we know these things by heart", "start": 557.149, "duration": 2.99}, {"text": "Even though we've flown the same departure every single day for years", "start": 560.14, "duration": 3.839}, {"text": "We briefed it anyway, and we do that because we need to activate our brains", "start": 564.23, "duration": 4.19}, {"text": "We need to think about the scenario ahead. We need to think okay", "start": 568.42, "duration": 3.029}, {"text": "So what if this happens because if we have done that it is more likely that we're going to react in a quick and effective", "start": 571.449, "duration": 5.88}, {"text": "way if it does happen", "start": 577.37, "duration": 2.0}, {"text": "Now", "start": 579.4, "duration": 1.44}, {"text": "999,000 out of one, nothing will happen", "start": 580.94, "duration": 4.42}, {"text": "Okay", "start": 585.8, "duration": 0.5}, {"text": "And we will just fly this departure like we've always done", "start": 586.3, "duration": 2.0}, {"text": "but on the last one that briefing will help and you", "start": 588.519, "duration": 3.15}, {"text": "should be thinking exactly the same about the emergency briefing that the cabin crew gives you", "start": 591.829, "duration": 4.55}, {"text": "When they briefed about where the life vests are", "start": 596.93, "duration": 2.33}, {"text": "have you ever actually reached down and felt underneath your seats of see if the seatbelt or the", "start": 599.54, "duration": 4.82}, {"text": "safety vest is there. You know, how does it feel?", "start": 605.089, "duration": 2.51}, {"text": "How would you actually take it out in case you need to, don't do it by the way.", "start": 607.6, "duration": 3.27}, {"text": "But you will feel where the opening is. Have you, when they say where's your closest exit,", "start": 610.87, "duration": 5.849}, {"text": "have you actually looked up and looked forward or back to see you know, where would you go in case you would need to evacuate?", "start": 617.06, "duration": 5.929}, {"text": "Next time you fly, I would encourage you even if you are not a nervous flyer", "start": 624.49, "duration": 3.63}, {"text": "even if you're just a casual flyer that, you know, likes it, do that. Take those extra two minutes out of your iPad time", "start": 628.12, "duration": 6.659}, {"text": "to look through it and just prepare yourself.", "start": 635.209, "duration": 3.2}, {"text": "So in case that happens, if we'd have a rejected take off, then this is what I will do", "start": 638.41, "duration": 4.29}, {"text": "You know the one time that you'll need it you will wish that you had", "start": 642.8, "duration": 3.32}, {"text": "Okay", "start": 647.57, "duration": 1.17}, {"text": "Good", "start": 648.74, "duration": 1.05}, {"text": "So, conclusion :", "start": 650.899, "duration": 1.081}, {"text": "Safety seats in the aircraft is whatever seat that you find comfortable providing that you listen to your cabin crew when they do it.", "start": 651.98, "duration": 6.799}, {"text": "Another question that actually has come up", "start": 659.3, "duration": 2.0}, {"text": "from specialist specifically nervous flyers is", "start": 661.76, "duration": 2.779}, {"text": "Do you have to do anything extra if you sit by the emergency exits?", "start": 665.12, "duration": 2.299}, {"text": "The answer to that is \"Yes\". You do", "start": 667.76, "duration": 2.7}, {"text": "If you sit by the emergency exit you are most likely going to get a", "start": 670.66, "duration": 4.84}, {"text": "specific briefing by a cabin crew member", "start": 675.7, "duration": 1.46}, {"text": "they are going to ask you if you're willing to help in case of an emergency", "start": 677.17, "duration": 4.08}, {"text": "They are going to tell you to read carefully the instructions on how to open the emergency exits", "start": 681.649, "duration": 5.09}, {"text": "And if you do, please do that, and once again, picture yourself, you know, okay", "start": 686.74, "duration": 5.849}, {"text": "I have to reach in and I have to pull that down or I have to take this thing the the whole emergency exit and", "start": 692.589, "duration": 5.34}, {"text": "Throw it out. Do you think through it because you don't want to be paralyzed", "start": 697.93, "duration": 3.659}, {"text": "and trying to figure out what to do if that would actually happen five minutes later when you're about to take off", "start": 702.2, "duration": 5.62}, {"text": "So if you're sitting by the emergency exit, yes, you're in a better leg room, but you also have a responsibility", "start": 707.82, "duration": 5.76}, {"text": "Towards your fellow passengers to know", "start": 713.6, "duration": 2.64}, {"text": "More or less what to do and if you're not comfortable with that then don't book an emergency exit. Okay", "start": 716.57, "duration": 6.049}, {"text": "Great. Now if you are a nervous flyer watching this and you think or have so many questions to ask this guy then go in", "start": 723.5, "duration": 7.82}, {"text": "Get the Mentour aviation app. There are download links down here", "start": 731.45, "duration": 3.32}, {"text": "Okay, there is a specific forum inside of Mentour Aviation app now called nervous Flyers and in there", "start": 735.32, "duration": 5.959}, {"text": "There are people like me who will happily explain things to you", "start": 741.279, "duration": 3.27}, {"text": "There is even trained psychologists that are there from time to time that will answer your questions for you", "start": 744.589, "duration": 6.92}, {"text": "But it's also a lot of people who are nervous flyers. They'll be able to support you", "start": 751.64, "duration": 4.099}, {"text": "So get the app go in, be active inside of the forum, and I'm sure that it will help you.", "start": 755.74, "duration": 5.079}, {"text": "So, I would like to thank", "start": 761.97, "duration": 2.239}, {"text": "Brilliant.org who is the sponsor of this episode.", "start": 764.879, "duration": 2.54}, {"text": "There's a reason that I keep pushing brilliant.org and that's because when I was younger, I was struggling", "start": 767.42, "duration": 6.57}, {"text": "with mathematics and physics myself, but I knew that in order for me to become a airline pilot, which was my goal", "start": 774.059, "duration": 5.27}, {"text": "I needed to master those subjects", "start": 779.629, "duration": 2.549}, {"text": "I would have loved to have something like brilliant.org", "start": 782.179, "duration": 3.6}, {"text": "That could have helped me in a fun and interactive way to get my brain working", "start": 785.779, "duration": 5.82}, {"text": "in those subjects", "start": 792.119, "duration": 1.77}, {"text": "For those of you who feel like you are interested in these subjects, so you do need to improve in these subjects", "start": 793.889, "duration": 5.69}, {"text": "You might not want to become a pilot", "start": 799.579, "duration": 1.17}, {"text": "But you might want to become something else that requires good physics knowledge mathematical knowledge or you might just be curious", "start": 800.749, "duration": 6.48}, {"text": "Well, then the five hundred first of you who uses this link here below will be 20% off the annual fee of brilliant", "start": 807.689, "duration": 6.08}, {"text": "But once again, it is completely free to go and check out the different courses and see if it's something for you. So do that", "start": 813.769, "duration": 6.119}, {"text": "now", "start": 821.04, "duration": 1.169}, {"text": "Before I go make sure that you have subscribed to the channel and that you have highlighted the little notification bell", "start": 822.209, "duration": 6.38}, {"text": "It's important that you highlight the Bell because if you don't then whenever I do live streams for example where I answer your questions live", "start": 828.589, "duration": 7.109}, {"text": "Or if I put out an extra video that might not come on a Friday might come on Tuesday", "start": 835.98, "duration": 4.94}, {"text": "For example, if there's something urgent that's happened. Well, then you won't know about it", "start": 840.92, "duration": 4.349}, {"text": "So make sure that you highlights the little bell", "start": 845.269, "duration": 1.771}, {"text": "Okay", "start": 847.04, "duration": 0.69}, {"text": "Leave a like if you liked the video", "start": 847.73, "duration": 1.75}, {"text": "leave a comment below if there's something you want to ask me about and if you really want to ask me something you want an", "start": 849.48, "duration": 6.38}, {"text": "answer well", "start": 855.86, "duration": 0.899}, {"text": "then go into the Mentour aviation app and become a", "start": 856.759, "duration": 2.76}, {"text": "Premium Member now premium member you will be able to ask me directly inside of the app", "start": 859.98, "duration": 6.049}, {"text": "Live streams that I do regularly on YouTube. I do live streams", "start": 866.339, "duration": 3.409}, {"text": "Maybe one every other week or so", "start": 869.749, "duration": 1.87}, {"text": "But in the app I go in from time to time and do live streams and the premium members will be able to ask questions", "start": 871.619, "duration": 5.6}, {"text": "In there, everyone will be able to watch the live stream, but only the premium members will be able to", "start": 877.29, "duration": 5.57}, {"text": "To ask questions. You will also have access to you know", "start": 884.069, "duration": 3.229}, {"text": "Extra videos that are the videos that maybe are a little bit sensitive that I won't put out", "start": 887.459, "duration": 3.799}, {"text": "YouTube channel or just like the new video that I've just released today", "start": 891.47, "duration": 3.75}, {"text": "You know go in and have a look", "start": 895.52, "duration": 1.8}, {"text": "I'm not going to say what it is", "start": 897.32, "duration": 1.14}, {"text": "But it's available for premium members. Have an absolutely fantastic day wherever you are, and I'll see you next time. Bye. Bye", "start": 898.46, "duration": 6.26}]