[{"text": "It’s late summer of the year 937.", "start": 0.32, "duration": 2.8}, {"text": "Three northern kingdoms forge an alliance in the hope to destroy the rising power of the united English realm,", "start": 3.38, "duration": 5.84}, {"text": "threatening their independence.", "start": 9.24, "duration": 1.92}, {"text": "King Aethelstan gathers an army and marches north to face the invaders.", "start": 11.3, "duration": 4.56}, {"text": "One of the most monumental battles of Anglo-Saxon England is about to happen.", "start": 15.94, "duration": 5.16}, {"text": "This video is sponsored by Vikings: War of Clans!", "start": 21.82, "duration": 3.24}, {"text": "Glory awaits in the game that promotes cunning, strategy and leadership.", "start": 25.26, "duration": 3.72}, {"text": "How you rule the clans is entirely up to you. Build vast cities, raise mighty armies and broker enduring alliances.", "start": 29.06, "duration": 6.26}, {"text": "In a game played by millions, a wise chieftain knows to use every advantage to become number one.", "start": 35.54, "duration": 5.68}, {"text": "Sign up today by clicking the link in the description below and not only will you be supporting our channel,", "start": 41.34, "duration": 4.94}, {"text": "but you’ll start you path to triumph with an additional 200 gold and a protection shield to help you write your own history.", "start": 46.28, "duration": 7.94}, {"text": "It’s the first half of the tenth century.", "start": 60.5, "duration": 2.12}, {"text": "Edward the Elder, king of the Anglo-Saxons dies while residing in northern Mercia.", "start": 63.06, "duration": 5.22}, {"text": "His reign, though largely forgotten and eclipsed by the exploits of Alfred the Great,", "start": 68.6, "duration": 5.0}, {"text": "his famous father, was a prosperous time for the Wessex monarchy.", "start": 73.6, "duration": 4.36}, {"text": "Edward cleverly built on the foundations laid down by Alfred and by the time of his own death,", "start": 78.12, "duration": 5.44}, {"text": "he essentially united all the English lands south of the Humber", "start": 83.7, "duration": 3.84}, {"text": "at the expense of the Danish Viking invaders from the continent.", "start": 87.54, "duration": 3.84}, {"text": "Despite his thriving rule, Edward seemingly didn’t declare his plans for succession clearly enough,", "start": 91.76, "duration": 5.62}, {"text": "which potentially could have been a source of internal friction between his five sons.", "start": 97.62, "duration": 4.86}, {"text": "In fact, three of them were still infants in the year 924,", "start": 102.74, "duration": 4.28}, {"text": "so the succession struggle was predominantly between his two oldest sons: Aethelstan and Aelfweard,", "start": 107.12, "duration": 6.08}, {"text": "both separately being hailed as the new king by Mercians and West Saxons respectively.", "start": 113.32, "duration": 5.8}, {"text": "All of their father’s work to keep the Anglo-Saxons unified under a single ruler was now at risk,", "start": 119.4, "duration": 6.32}, {"text": "with civil war looming on the horizon.", "start": 125.86, "duration": 2.9}, {"text": "Clouds gathered over the future of the kingdom, but then,", "start": 128.9, "duration": 3.16}, {"text": "just a few weeks after the death of the old king, his son Aelfweard perished,", "start": 132.06, "duration": 4.52}, {"text": "leaving Aethelstan the only adult heir to Edward the Elder.", "start": 136.58, "duration": 4.2}, {"text": "It was indeed a stroke of luck for Aethelstan, but even after the death of his younger half-brother,", "start": 141.0, "duration": 5.46}, {"text": "the opposition in Wessex, particularly Winchester, continued for several years,", "start": 146.46, "duration": 5.02}, {"text": "but Aethelstan did much to maintain unity within the kingdom.", "start": 151.48, "duration": 3.54}, {"text": "Even his coronation in 925 took place at a symbolic location on the border between Mercia and Wessex.", "start": 155.16, "duration": 7.48}, {"text": "From the beginning of his reign Aethelstan appeared to have the necessary traits of a good leader.", "start": 162.94, "duration": 5.58}, {"text": "He not only extended his grandfather’s legal reforms,", "start": 168.74, "duration": 2.88}, {"text": "being aware of the threat that lawlessness and robberies posed to the social order,", "start": 171.62, "duration": 4.54}, {"text": "but also founded churches, thus supporting the spread of the Christian religion throughout his kingdom.", "start": 176.3, "duration": 5.56}, {"text": "On top of that, he seemed to show far more interest in European politics than his predecessors,", "start": 182.1, "duration": 5.96}, {"text": "marrying his sisters to prominent continental rulers.", "start": 188.14, "duration": 3.76}, {"text": "In 926, in order to secure his northern border, Aethelstan arranged the marriage of one of his sisters to a Viking leader Sitric, king of Northumbria,", "start": 192.1, "duration": 9.68}, {"text": "the last remaining part of the Danelaw in England still under Danish control.", "start": 201.94, "duration": 5.04}, {"text": "Luckily, Sitric died the following year and Aethelstan was quick to seize an unexpected opportunity.", "start": 207.24, "duration": 6.12}, {"text": "In a matter of weeks, he was in York with his troops.", "start": 213.66, "duration": 2.92}, {"text": "The acquisition of Northumbria wasn’t as smooth as one would imagine,", "start": 216.68, "duration": 3.9}, {"text": "as Sitric’s kinsman, Guthfrith of Dublin also claimed the vacant throne,", "start": 220.68, "duration": 4.72}, {"text": "but in the end, Aethelstan emerged victorious, capturing York and receiving the submission of the Danish people,", "start": 225.72, "duration": 6.56}, {"text": "though the sources don’t reveal whether he actually had to fight Guthfrith.", "start": 232.52, "duration": 4.72}, {"text": "Aethelstan’s position seemed to be firm enough,", "start": 237.54, "duration": 2.72}, {"text": "as the same year he accepted the submission of two northern monarchs: Constantine of Alba and Owain of Strathclyde.", "start": 240.58, "duration": 7.4}, {"text": "Thus, if we add to this his authority over the Welsh kings which he inherited from his father and aunt,", "start": 248.14, "duration": 6.66}, {"text": "it becomes clear that Aethelstan not only exercised direct rule over all of England,", "start": 254.98, "duration": 5.2}, {"text": "but his formal overlordship spread throughout the vast majority of the island of Great Britain.", "start": 260.36, "duration": 5.76}, {"text": "Thanks to these efforts, he became the very first Rex Anglorum,", "start": 266.58, "duration": 5.02}, {"text": "the King of the English and also emphasized his control over the entire island.", "start": 271.6, "duration": 5.9}, {"text": "Such state of affairs prevailed for the next seven years,", "start": 277.9, "duration": 3.36}, {"text": "during which Aethelstan tightened his grip on Wales by imposing heavy annual tribute", "start": 281.42, "duration": 5.8}, {"text": "and also squashed the Cornish revolt in Cornwall before they were able to gather a more serious force to oppose the Saxon king.", "start": 287.34, "duration": 7.9}, {"text": "During this time, the Welsh and Scottish rulers attended assemblies of the English king and witnessed his charter .", "start": 295.68, "duration": 6.28}, {"text": "Aethelstan created an effective centralized government and thanks to his regional deputies he ensured obedience of his laws.", "start": 302.24, "duration": 8.16}, {"text": "It should come as no surprise, that his direct style of ruling soon became a thorn in the side of his northern vassals,", "start": 310.76, "duration": 7.54}, {"text": "who gradually over-time  neglected to attend Anglo-Saxon assemblies.", "start": 318.44, "duration": 5.2}, {"text": "Possibly as a reaction to this loosening grip, in 934 Aethelstan prepared an invasion of Constantine’s domain.", "start": 323.92, "duration": 7.68}, {"text": "To keep facts straight – sources don’t indicate any specific reasoning behind Aethelstan’s campaign to the north", "start": 331.98, "duration": 6.62}, {"text": "but it is plausible to assume that his goal was to bring Constantine back to English heel.", "start": 338.62, "duration": 6.04}, {"text": "Details of this operation unfortunately also remain unclear, yet at the end,", "start": 344.66, "duration": 5.1}, {"text": "Constantine was forced to acknowledge Aethelstan’s supremacy.", "start": 349.76, "duration": 4.18}, {"text": "Surely, the King of Alba wasn’t appeased by such treatment", "start": 354.12, "duration": 3.68}, {"text": "and soon began plotting to shake off the English yoke.", "start": 357.9, "duration": 3.22}, {"text": "In the course of next two years he forged an alliance with Olaf, son of Guthfrith, the new Norse King of Dublin,", "start": 361.32, "duration": 7.22}, {"text": "who also was at odds with Aethelstan, as he claimed his right to the Kingdom of Northumbria, lost by his kin ten years earlier.", "start": 368.54, "duration": 8.42}, {"text": "The duo was soon joined by King Owain of Strathclyde,", "start": 377.14, "duration": 3.34}, {"text": "whose lands possibly suffered during Aethelstan’s campaign against the Scots.", "start": 380.48, "duration": 4.48}, {"text": "Individually, each northern ruler was not strong enough to face the Anglo-Saxons,", "start": 385.02, "duration": 4.78}, {"text": "but with their forces combined they posed a serious threat able to curb the rising power of the English King.", "start": 389.86, "duration": 7.88}, {"text": "Eventually, in August of 937 the allied force of Alba and Strathclyde entered English territory and began plundering.", "start": 398.28, "duration": 8.78}, {"text": "A few days later King Olaf landed on the English shore with the hiberno-norse contingent", "start": 407.36, "duration": 5.36}, {"text": "and marched to rendezvous with the main army.", "start": 412.88, "duration": 3.2}, {"text": "But Aethelstan wasn’t really prepared for this sudden challenge,", "start": 416.62, "duration": 3.4}, {"text": "as late summer wasn’t the most common time to start a military campaign.", "start": 420.02, "duration": 3.88}, {"text": "Anyway, the English king marshalled his household guard", "start": 424.38, "duration": 3.0}, {"text": "and levied all available fyrds across East Anglia, Mercia and Wessex to supplement the king’s army.", "start": 427.38, "duration": 6.9}, {"text": "Pressured by time, Aethelstan commanded the march out even before all of his troops were able to assemble,", "start": 434.58, "duration": 6.34}, {"text": "hoping to contain the enemy ravaging the countryside as soon as possible.", "start": 440.92, "duration": 5.3}, {"text": "The camp was set in the vicinity of Mersey estuary, among the moors, and battle preparations began.", "start": 446.4, "duration": 6.8}, {"text": "Aethelstan sent multiple envoys to his enemies,", "start": 453.66, "duration": 2.98}, {"text": "attempting to delay the battle as long as possible in order to buy some time for the rest of his troops to arrive.", "start": 456.64, "duration": 6.4}, {"text": "Hoping to discourage the allies from an early attack,", "start": 463.5, "duration": 3.02}, {"text": "he commanded to pitch more tents to inflate his camp, and thus hide the fact that many of his units were still on the way to the battlefield.", "start": 466.52, "duration": 8.6}, {"text": "Aethelstan managed to buy himself three days of truce, allowing the rest of his troops to join the king’s army.", "start": 475.56, "duration": 6.02}, {"text": "Eventually, early in the morning the opposing forces began deployment on the broad heath.", "start": 481.9, "duration": 5.58}, {"text": "While exact numbers remain unknown, a good, though still rough estimate is, that King Aethelstan,", "start": 487.76, "duration": 6.48}, {"text": "ruling over the entirety of England was able to muster north of 10,000 men,", "start": 494.24, "duration": 5.52}, {"text": "and the combined forces of Olaf, Constantine and Owain was about the same size.", "start": 499.76, "duration": 6.12}, {"text": "With the sun already high over the horizon, both sides charged forward yelling at the enemy.", "start": 506.34, "duration": 5.76}, {"text": "The battle was joined, as two arrays of shieldwalls clashed,", "start": 512.56, "duration": 3.7}, {"text": "and tight melee combat ensued across the field.", "start": 516.26, "duration": 3.58}, {"text": "Many of Aethelstan’s retinue were experienced warriors who fought the Danes in Eastern Mercia years earlier under the command of his aunt and father,", "start": 520.1, "duration": 9.04}, {"text": "and he also made use of an unspecified number of fierce Norse mercenaries filling up his ranks.", "start": 529.14, "duration": 6.52}, {"text": "But his Briton, Scottish and Hiberno-Norse enemies were no inferior warriors and as casualties rose,", "start": 535.94, "duration": 7.0}, {"text": "neither side was able to gain an upper hand.", "start": 542.94, "duration": 3.2}, {"text": "Long gone was the time when Viking invaders prevailed in clashes with inhabitants of the British Isles.", "start": 546.14, "duration": 6.16}, {"text": "During the time of Aethelstan the Norsemen fought on all sides,", "start": 552.3, "duration": 4.04}, {"text": "but by no means could a Saxon, Welsh, Scottish or Irish warrior be deemed inferior to his Scandinavian counterpart.", "start": 556.34, "duration": 8.4}, {"text": "It was already past noon, but the battle still raged with no sign of final resolution.", "start": 565.04, "duration": 5.34}, {"text": "The death toll rose disastrously high, when somewhere in the centre,", "start": 570.46, "duration": 4.7}, {"text": "Aethelstan’s men managed to cut through the Briton shieldwall and split the allied battleline.", "start": 575.16, "duration": 6.04}, {"text": "This was a turning point, as many men from the north realised that the tide of the battle was turning to the English,", "start": 581.36, "duration": 6.34}, {"text": "lost heart and began to retreat.", "start": 587.7, "duration": 2.58}, {"text": "In a matter of minutes, the allied force thinned out and all those who were able to flee withdrew from the site of the battle.", "start": 590.52, "duration": 7.86}, {"text": "Soon, the bloody clash was over and Aethelstan’s exhausted forces were left victorious on the battlefield.", "start": 598.56, "duration": 7.0}, {"text": "It was a costly victory for the King, as casualties on both sides were considerable,", "start": 606.26, "duration": 4.62}, {"text": "probably reaching several thousands dead on each side.", "start": 610.88, "duration": 3.46}, {"text": "It is said, that five kings and seven earls, along with many lesser nobles across the opposing forces lost their lives in the carnage.", "start": 614.48, "duration": 8.36}, {"text": "His primary enemies, albeit considerably weakened, managed to find safety from the battle.", "start": 623.02, "duration": 6.0}, {"text": "Although the English King lost much of his military potential in the course of the battle,", "start": 629.46, "duration": 4.58}, {"text": "this victory secured his holdings in Northumbria,", "start": 634.04, "duration": 3.38}, {"text": "for had Aethelstan’s opponents won, his hegemony over England would have most likely disintegrated.", "start": 637.42, "duration": 6.64}, {"text": "The Battle of Brunanburh, dubbed by future generations simply as the „great battle”", "start": 644.26, "duration": 5.34}, {"text": "became an important element unifying the English kingdoms from a string of disparate states into one nation", "start": 649.6, "duration": 7.8}, {"text": "even though, as was much of Anglo-Saxon history,", "start": 657.6, "duration": 3.54}, {"text": "the deeds of King Aethelstan would eventually be overshadowed by the bastard from Normandy.", "start": 661.14, "duration": 6.22}]