[{"text": "It's handy tech under a hundred time again, and this time no sticky stuff.", "start": 0.03, "duration": 4.74}, {"text": "I've got a better way to charge a better way to communicate a better way to cool and a better way to dongle.", "start": 4.77, "duration": 6.39}, {"text": "Let's do it.", "start": 11.38, "duration": 2.0}, {"text": "Be quiet silent wings three used a smooth-running 6-pole motor to remain silent and better cool your PC check them out of the link below.", "start": 21.689, "duration": 7.28}, {"text": "Number one is the Antlion mod mic 5 a boom style microphone that can attach to any pair of headphones.", "start": 29.91, "duration": 6.529}, {"text": "Turning them into a very capable and modular headset for 70 bucks.", "start": 36.9, "duration": 4.549}, {"text": "This way you get to keep your audiophile grade headphones that you'd prefer to listen to instead of resorting to", "start": 41.94, "duration": 5.389}, {"text": "Clipping a mic to your clothes, putting a desktop microphone in front of you, or switching to a gaming headset all of which", "start": 47.67, "duration": 6.95}, {"text": "might not be ideal solutions for a variety of", "start": 54.75, "duration": 3.709}, {"text": "unsurprising reasons. There are good gaming headset options like the ATH-AG1 from audio-technica.", "start": 58.5, "duration": 7.219}, {"text": "But spending that kind of money doesn't make a lot of sense if you already have awesome headphones that you", "start": 65.97, "duration": 6.379}, {"text": "personally like and you don't want to lose their sound signature which can be annoying. Of course if it sucked", "start": 72.57, "duration": 5.51}, {"text": "We wouldn't bother talking about it, but now in its fifth generation the mod mic does sound great though", "start": 78.17, "duration": 6.029}, {"text": "I don't expect you to take my word for it", "start": 84.2, "duration": 1.47}, {"text": "I'm going to read the rest of this paragraph on a handful of competing solutions once the base is attached to your headphones", "start": 85.67, "duration": 5.459}, {"text": "You can clip it on or remove it easily with its built-in magnet it has a dual mic capsule with an omnidirectional", "start": 91.35, "duration": 6.65}, {"text": "Mic and a separate Uni directional mic a modular mute switch a cable rack to protect your wires and simplify your setup", "start": 98.13, "duration": 7.25}, {"text": "modular cable lengths the right adapters get you going no matter what device you have other than I guess an", "start": 105.689, "duration": 5.99}, {"text": "iPhone 7 although if you have one of those bluetooth audio", "start": 111.93, "duration": 3.019}, {"text": "dongle things you could get it to work with the y adapter, and there's also Kevlar reinforced wiring because", "start": 115.14, "duration": 5.779}, {"text": "Why not?", "start": 121.439, "duration": 1.261}, {"text": "Number 2, the Silverstone 1 to 8 PWM fan Hub.", "start": 122.7, "duration": 4.339}, {"text": "Which is way cooler than the name makes it sound yes, yes.", "start": 127.049, "duration": 4.249}, {"text": "It's just a fan hub, but it is a 4 pin PWM. So it will support whatever fans", "start": 131.299, "duration": 5.04}, {"text": "You'd like it looks very sleek and will go in pretty much any case", "start": 136.34, "duration": 3.419}, {"text": "Even with all the tempered glass that's been going around lately. The cables are in an appropriate length", "start": 139.98, "duration": 5.539}, {"text": "So you won't have a ton of excess, but there also will be enough to actually plug them in which is important", "start": 145.519, "duration": 6.66}, {"text": "And it comes with awesome 3M Dualock adhesive strips so you can put it anywhere in your case that you'd like.", "start": 152.18, "duration": 6.6}, {"text": "No more awkward fan cables running all around your motherboard searching for just one more fan header.", "start": 158.91, "duration": 6.319}, {"text": "Just one single cable to control the speed and it's only 12 bucks less than you'd pay for many premium fans anyways.", "start": 166.68, "duration": 6.62}, {"text": "Number three, the fin six dart it's barely under a hundred bucks, but it's really cool. It's a laptop charger", "start": 173.88, "duration": 6.709}, {"text": "That's so small that when I first saw it", "start": 180.59, "duration": 2.25}, {"text": "I genuinely asked if it's actually just for charging phones and while I can do that with the integrated", "start": 182.84, "duration": 6.449}, {"text": "2.1 Amp USB port it also charges", "start": 189.48, "duration": 2.479}, {"text": "laptops in the box you'll get your dart charger a nice carrying pouch for everything nine tips for charging a variety of", "start": 192.18, "duration": 7.309}, {"text": "Laptops and a thank you note for their kickstarter.", "start": 199.56, "duration": 3.24}, {"text": "wwwwhhhaaattt?", "start": 203.5, "duration": 1.3}, {"text": "a decent product that I like from Kickstarter", "start": 205.9, "duration": 2.08}, {"text": "ok that was weird, and it gets even more unbelievable if none of the included adapters actually work for you", "start": 208.59, "duration": 6.47}, {"text": "Just email them and they'll send you one that does for free. That's cool. Now unsurprisingly", "start": 215.06, "duration": 5.85}, {"text": "It's not that strong at only 65 watts of output you'll be stuck with the thinner", "start": 220.91, "duration": 4.949}, {"text": "Sleeker selection of laptops out there if you want full charging performance", "start": 226.17, "duration": 3.919}, {"text": "But that being said it", "start": 230.22, "duration": 1.739}, {"text": "Does work with laptops that want more juice like my old Asus Bamboo whose included charger is rated for about", "start": 231.959, "duration": 6.89}, {"text": "90 Watts", "start": 239.19, "duration": 1.079}, {"text": "It will charge just a little bit more slowly which may be a fair trade-off while traveling if you're going to be able to", "start": 240.269, "duration": 6.89}, {"text": "Charge overnight, and bag space is at a premium", "start": 247.47, "duration": 2.329}, {"text": "Thanks United. Last, but potentially not least we have number 4 the Accell", "start": 250.98, "duration": 7.849}, {"text": "Whatever, it's a displayport 1.2 to HDMI 2.0. Adapter", "start": 259.59, "duration": 4.699}, {"text": "Most graphics cards these days only have one HDMI port sometimes you need more", "start": 264.289, "duration": 4.68}, {"text": "Sure your monitors probably take displayport, but Vr headsets capture cards TVS and video splitters are almost always", "start": 269.76, "duration": 7.609}, {"text": "HDMI, only big deal Luke. There's like a million of these on newegg right ok", "start": 278.16, "duration": 5.239}, {"text": "but if you dig a little", "start": 283.4, "duration": 1.3}, {"text": "Deeper into the specs most of them are HDMI 1.4 which means they're limited to 4k at 30 Hertz", "start": 284.7, "duration": 7.009}, {"text": "instead of 60 Hertz which means your high-resolution display will feel laggy and", "start": 292.17, "duration": 5.179}, {"text": "stutter in everything from games to even basic desktop use", "start": 297.66, "duration": 4.04}, {"text": "Which brings us finally to the full disclosure part of these handy tech episodes since they're structured more as a recommendation to buy", "start": 301.98, "duration": 7.339}, {"text": "With links below to Amazon versus a review. We like to disclose. Why we chose these and how we acquired them", "start": 309.72, "duration": 6.98}, {"text": "Item 1: the mod Mike 5 was actually sent to us by antlion for an ad spot", "start": 316.7, "duration": 4.919}, {"text": "We did for them a little while ago, but Linus's always loved these things and I have two and this one is just well", "start": 321.62, "duration": 6.54}, {"text": "more to love", "start": 328.68, "duration": 1.32}, {"text": "Item 2 the Silverstone 1 to 8 Pwm fan Hub was sent by Silverstone for Linus's Desk PC", "start": 330.0, "duration": 6.23}, {"text": "project though unfortunately", "start": 336.24, "duration": 1.67}, {"text": "It didn't arrive in time. The Fin six dart Linus back to this a thousand freaking years ago", "start": 337.91, "duration": 6.269}, {"text": "And it just arrived a couple weeks ago", "start": 344.18, "duration": 2.76}, {"text": "item 4 the Accell displayport to HDMI", "start": 348.54, "duration": 2.689}, {"text": "adapter was purchased by Linus personally to solve his", "start": 351.87, "duration": 3.589}, {"text": "decidedly first world problem of how to connect his 4k TV and his", "start": 355.77, "duration": 4.97}, {"text": "HTC vive to the 980ti in his media Center PC at the same time", "start": 360.96, "duration": 5.6}, {"text": "Alright guys if you liked this video like if you disliked it dislike. You can subscribe to see all the awesome stuff", "start": 367.26, "duration": 4.459}, {"text": "We have to offer [jump] on Amazon at the link down the description below to buy any of these things", "start": 371.72, "duration": 4.559}, {"text": "I believe they're all available there you can also check the link around there to see shirts that we have available and same location", "start": 376.28, "duration": 6.839}, {"text": "Forum link where you can discuss a bunch of stuff or even suggest more items that might be good for another future handy tech under", "start": 383.88, "duration": 6.769}, {"text": "A hundred video or useless tech under a hundred video. I'd like to do one of those as well", "start": 390.65, "duration": 5.07}, {"text": "I'll see you guys next time check out this video. Which is the handy tech sticky stuff that I did last", "start": 395.789, "duration": 4.76}]