[{"text": "When it comes to my professional life, I consider myself a little like Danny Ocean.", "start": 0.0, "duration": 5.42}, {"text": "And not just because of the, you know, world travel, fashion sense and flashy cars.", "start": 5.62, "duration": 6.7}, {"text": "But because often, in order to do what I do, I need to be able to get in and out of a secure area with...", "start": 12.46, "duration": 7.12}, {"text": "\"no one the wiser\".", "start": 19.6, "duration": 2.0}, {"text": "Only, instead of casinos and banks, my theater of operations is consumer electronics.", "start": 21.66, "duration": 5.76}, {"text": "And, instead of circumventing High-tech laser security systems and armed guards, I ...", "start": 27.84, "duration": 5.56}, {"text": "carefully remove those warranty void stickers without damaging them, so that they can be reapplied.", "start": 33.88, "duration": 6.08}, {"text": "It's a wild ride living your life on the razor's edge.", "start": 40.52, "duration": 3.44}, {"text": "And you know what?", "start": 44.04, "duration": 1.28}, {"text": "I'm going to be showing you guys how to do it today.", "start": 45.66, "duration": 3.44}, {"text": "[intro]", "start": 49.1, "duration": 6.56}, {"text": "iBUYPOWER and MSI's new lineup of gaming laptops feature Intel's 7th generation Core i7 processors.", "start": 56.06, "duration": 7.26}, {"text": "Check them out at the link below.", "start": 63.32, "duration": 2.4}, {"text": "Warranty stickers?", "start": 66.04, "duration": 1.84}, {"text": "Here's a question. Are those even legally binding?", "start": 67.96, "duration": 3.92}, {"text": "Let's check in with the Linus Tech Tips legal team for a brief primer.", "start": 72.18, "duration": 4.48}, {"text": "Oh, hi!", "start": 76.78, "duration": 1.32}, {"text": "Now, as you may or may not know", "start": 78.1, "duration": 1.88}, {"text": "A warranty included in the box with an electronic device, like a game console or smartphone,", "start": 79.98, "duration": 5.86}, {"text": "is actually just a kind of contract.", "start": 85.9, "duration": 2.34}, {"text": "Now, if one side breaks, or \"breaches\" a contract, the other side doesn't have to perform.", "start": 88.24, "duration": 5.54}, {"text": "In this case, that would mean that the manufacturer could void your warranty.", "start": 93.78, "duration": 4.24}, {"text": "But, there is an exception to this.", "start": 98.02, "duration": 2.3}, {"text": "There's a US Federal Law called the \"Magnuson Moss Warranty Act\" of 1975.", "start": 100.32, "duration": 6.28}, {"text": "Now, this is a law that says \"A manufacturer can't make a tie-in sale a condition of a warranty\".", "start": 106.6, "duration": 6.78}, {"text": "Well, what's that? Well, a tie-in sale is", "start": 113.4, "duration": 2.76}, {"text": "when the warranty says that you can only get your device repaired at an authorized dealer", "start": 116.16, "duration": 6.12}, {"text": "or use authorized replacement parts.", "start": 122.28, "duration": 2.54}, {"text": "So this means, if you decide to repair your device on your own", "start": 124.82, "duration": 3.26}, {"text": "or use an aftermarket part, they can't void your warranty just based on that.", "start": 128.08, "duration": 5.46}, {"text": "And that includes breaking those little \"warranty void if remove\" stickers.", "start": 133.54, "duration": 3.94}, {"text": "So if the law covers these stickers, why do manufacturers keep putting them on their products?", "start": 137.48, "duration": 4.8}, {"text": "Well, the manufacturers know that the only way that they can be forced to provide warranty service", "start": 142.28, "duration": 5.44}, {"text": "is if somebody takes them to court and sue's them over the sticker.", "start": 147.72, "duration": 3.2}, {"text": "Unfortunately, the companies also know that the cost of hiring a lawyer and actually going through with this", "start": 150.94, "duration": 6.4}, {"text": "is usually going to be a lot higher than just getting the product repaired in the first place.", "start": 157.36, "duration": 4.4}, {"text": "Meaning these companies are more or less getting away with this and it will probably take something like a class-action lawsuit", "start": 161.76, "duration": 6.36}, {"text": "which is essentially a bunch of people suing one or more companies to end this behavior.", "start": 168.12, "duration": 5.28}, {"text": "The only time that either opening your device or performing a self repair", "start": 173.4, "duration": 3.92}, {"text": "or taking it to a third-party repair shop can actually void your warranty", "start": 177.32, "duration": 3.68}, {"text": "is if they do an improper repair or an improper upgrade that actually causes the device to malfunction or break.", "start": 181.0, "duration": 6.54}, {"text": "This simply means: don't break your own stuff, and you'll still be covered under a warranty.", "start": 187.56, "duration": 5.08}, {"text": "It's against the law for these Manufacturers to tell you that you don't have a right to try to repair your product on your own terms.", "start": 192.66, "duration": 7.3}, {"text": "[scream]", "start": 202.32, "duration": 0.6}, {"text": "Thanks, John. Now let's get to what you all came to see.", "start": 203.08, "duration": 3.9}, {"text": "Legality aside,", "start": 207.16, "duration": 1.34}, {"text": "what is the best way to remove and replace a warranty sticker", "start": 208.5, "duration": 5.72}, {"text": "so that an apathetic minimum-wage employee can't tell you did it?", "start": 214.22, "duration": 4.88}, {"text": "There are tons of tips online about this, but we felt the need to test them for ourselves, because...", "start": 219.1, "duration": 6.98}, {"text": "As you guys know very well, just because someone posts something online", "start": 226.2, "duration": 5.46}, {"text": "doesn't mean it's a good idea. And you wouldn't believe the number of unqualified people", "start": 231.66, "duration": 5.94}, {"text": "posting up disreputable tech advice these days.", "start": 237.6, "duration": 3.54}, {"text": "The electrostatic bag and heat gun combo method wasn't a runaway success", "start": 243.3, "duration": 6.26}, {"text": "It actually did work modestly well on stickers that were already fairly loose", "start": 249.56, "duration": 5.0}, {"text": "or poorly applied in the first place. But in tougher situations, we often ended up tearing the sticker.", "start": 254.56, "duration": 6.82}, {"text": "While the materials you need are very likely to be lying around, and the nonstick properties of the bag are helpful.", "start": 261.58, "duration": 7.2}, {"text": "It's also extremely unwieldly and hard to control.", "start": 268.78, "duration": 4.08}, {"text": "So, this one's a bit like using a medical glove as a condom. Sure it might work in certain situations,", "start": 272.92, "duration": 7.82}, {"text": "but it should never be your go-to solution.", "start": 280.74, "duration": 3.3}, {"text": "Steam. It works for letters, so it should work for stickers. Right?", "start": 285.44, "duration": 4.9}, {"text": "WRONG.", "start": 290.34, "duration": 1.06}, {"text": "Your reservations about exposing your electronics to a jet of gaseous water aside", "start": 291.4, "duration": 5.34}, {"text": "the steam just ended up being far harder on the sticker itself than it was on the glue holding it.", "start": 296.74, "duration": 6.42}, {"text": "While it did weaken the bond somewhat, it also caused the sticker to fall apart like a twice used tissue. So...", "start": 303.4, "duration": 7.76}, {"text": "\"10 out of 10. Highly recommended\" - IGN", "start": 311.38, "duration": 4.06}, {"text": "A straight utility or hobby knife, probably seems like a bit of a dicey proposition.", "start": 316.96, "duration": 6.54}, {"text": "And it is. Yes.", "start": 323.5, "duration": 2.18}, {"text": "With sufficient care, patience and luck,", "start": 325.68, "duration": 4.18}, {"text": "it is possible to remove a sticker with minimal to no damage by this method.", "start": 329.86, "duration": 6.3}, {"text": "But a simple slip of the hand,", "start": 336.2, "duration": 3.14}, {"text": "or a little too much pressure at the wrong moment,", "start": 339.34, "duration": 3.24}, {"text": "can easily lead to a cut or a tear that will give the game away", "start": 342.58, "duration": 4.68}, {"text": "or worse, put an unsightly scratch or scuff on your precious device.", "start": 347.28, "duration": 6.34}, {"text": "Next, we found a guide online in which a fellow canuck, actually, went through this process", "start": 353.98, "duration": 7.0}, {"text": "for building a teflon knife for exactly this purpose.", "start": 360.98, "duration": 5.48}, {"text": "But unfortunately, sourcing the materials and manufacturing this kind of tool", "start": 366.46, "duration": 7.08}, {"text": "is both costly and potentially dangerous without sufficient tools and training.", "start": 373.54, "duration": 6.72}, {"text": "So, our journey for a low-cost easy solution continued.", "start": 380.26, "duration": 4.68}, {"text": "We eventually found ourselves deep in the darkest dankest and most dangerous parts of the Internet.", "start": 385.22, "duration": 8.68}, {"text": "A community of competitive Rubik's Cube enthusiasts. And it was actually there that we found our holy grail:", "start": 394.06, "duration": 8.34}, {"text": "A plastic razor, specifically designed for peeling the stickers off toy puzzle cubes.", "start": 402.66, "duration": 6.76}, {"text": "It removes warranty stickers just as easily as a metal razor", "start": 409.68, "duration": 4.62}, {"text": "but is a lot more forgiving in terms of avoiding damage to the product.", "start": 414.3, "duration": 4.8}, {"text": "It was not only able to lift the warranty protection off a PS4,", "start": 419.1, "duration": 4.5}, {"text": "but it also managed to peel back the entire warranty label on a hard drive, intact.", "start": 423.6, "duration": 6.3}, {"text": "Now, both metal and plastic razors work much better with a little solvent to help them.", "start": 430.12, "duration": 5.58}, {"text": "But you need to be careful about what you use.", "start": 435.7, "duration": 2.68}, {"text": "You can find an almost inexhaustible list of household products", "start": 438.52, "duration": 4.6}, {"text": "that people claim will work to help remove adhesives.", "start": 443.12, "duration": 4.08}, {"text": "But it's not always necessary or even advisable to encase your sticker in peanut butter,", "start": 447.3, "duration": 6.28}, {"text": "freeze it overnight, sprinkle it with ginger or rub it with the dew of North Facing leaves.", "start": 453.68, "duration": 6.26}, {"text": "So we tried out the three most reasonable and easily accessible solvents that you're likely to have kicking around:", "start": 460.0, "duration": 6.78}, {"text": "nail polish remover, rubbing alcohol and vinegar.", "start": 466.78, "duration": 3.74}, {"text": "Nail polish remover was very effective at immediately removing the glue", "start": 470.86, "duration": 5.22}, {"text": "and dissolving most of the sticker as well.", "start": 476.08, "duration": 3.3}, {"text": "Vinegar fell on the opposite end of the spectrum", "start": 479.94, "duration": 2.48}, {"text": "Even after leaving it to soak it barely made a dent in the adhesive", "start": 482.44, "duration": 4.12}, {"text": "and when we attempted to pry the sticker off, there was significant tearing.", "start": 486.56, "duration": 4.0}, {"text": "Isopropyl alcohol hits the perfect sweet spot.", "start": 490.98, "duration": 3.8}, {"text": "In terms of loosening the sticker enough that we could get a prying tool in, without damaging it in the process.", "start": 494.78, "duration": 7.1}, {"text": "Now, it is important to note that some stickers are designed to peel back and leave residue on the surface", "start": 502.3, "duration": 7.76}, {"text": "changing the appearance of the sticker to read \"VOID\" and prevent replacement.", "start": 510.12, "duration": 4.84}, {"text": "If you come across this, use a marker or a rollerball pen to color the reverse of the sticker as you lift it.", "start": 514.96, "duration": 7.78}, {"text": "That should allow you to press the sticker back down and maintain the appearance that it hasn't been moved.", "start": 522.74, "duration": 6.4}, {"text": "Though, it should be noted that this won't help in cases where the manufacturer", "start": 529.18, "duration": 4.6}, {"text": "would have to remove that sticker in order to perform whatever warranty repair is required.", "start": 533.78, "duration": 5.42}, {"text": "Now, in a perfect world, none of this would matter.", "start": 539.2, "duration": 3.04}, {"text": "Bacause... Consumer protection laws.", "start": 542.24, "duration": 3.02}, {"text": "But on Planet Earth, where I live", "start": 545.28, "duration": 2.1}, {"text": "Any time you open your device, there's a very strong chance that if your manufacturer realizes it,", "start": 547.38, "duration": 6.72}, {"text": "they will refuse to honor your warranty without a costly and potentially very time-consuming legal battle.", "start": 554.1, "duration": 6.6}, {"text": "So, whether you want to make an upgrade to a pre-built computer,", "start": 560.86, "duration": 3.98}, {"text": "change out a cooler on a graphics card, or just", "start": 564.84, "duration": 2.86}, {"text": "poke around inside your gadgets, because they belong to you, out of principle.", "start": 567.7, "duration": 5.32}, {"text": "Do it carefully and we hope you guys found this guide helpful.", "start": 573.02, "duration": 4.04}, {"text": "FreshBooks is the cloud-based accounting solution for small business owners and freelancers.", "start": 577.54, "duration": 5.72}, {"text": "In a nutshell it takes everything that you \"love\" about accounting... Which is nothing, and makes it easier", "start": 583.26, "duration": 8.96}, {"text": "and faster. It also takes the stuff you don't love about it and makes that easier and faster too.", "start": 592.22, "duration": 4.46}, {"text": "It works on your computer, it works on your phone, and it allows you to do all that boring stuff", "start": 596.68, "duration": 5.5}, {"text": "throughout the day and on the go instead of being stuck at the end of a long workday staring at your accounting software.", "start": 602.18, "duration": 6.74}, {"text": "So whether it's snapping a picture of an expense report or whether it's firing off a professional looking invoice", "start": 608.92, "duration": 6.08}, {"text": "in less than thirty seconds to a client, you can get it done quickly with FreshBooks.", "start": 615.0, "duration": 5.98}, {"text": "They've also got the ability to take payments through the platform and even see when your client has seen your...", "start": 620.98, "duration": 6.92}, {"text": "And even see when your client has seen your invoice so you can put an end to the guessing games.", "start": 628.98, "duration": 5.78}, {"text": "For a thirty day free trial head to freshbooks.com/techtips and enter \"linus tech tips\"", "start": 634.76, "duration": 4.86}, {"text": "in the 'how did you hear about us' section.", "start": 639.62, "duration": 2.24}, {"text": "So, thanks for watching. If this video sucked, you know what to do. But if it was great, hit the like button, get subscribed.", "start": 642.32, "duration": 5.2}, {"text": "Maybe consider checking out where to buy the stuff we featured at the link in the video description.", "start": 647.52, "duration": 4.32}, {"text": "Also down there is our merch store where you can buy cool shirts like...", "start": 651.84, "duration": 2.98}, {"text": "this one, and our community forum which you should totally join.", "start": 655.4, "duration": 3.88}]