[{"text": "Start building a website today with Squarespace!", "start": 0.0, "duration": 2.48}, {"text": "And use squarespace.com/cow to get 10% off.", "start": 2.48, "duration": 3.12}, {"text": "Well guys, it is upon us once again. Yes, that's right, it is officially the political season on Facebook!", "start": 5.6, "duration": 7.28}, {"text": "(CRICKETS CHIRPING)", "start": 12.88, "duration": 2.18}, {"text": "Yay.", "start": 15.12, "duration": 0.54}, {"text": "Political news articles, political posts, political memes, political debates,", "start": 15.66, "duration": 3.36}, {"text": "polls that tell you which political candidate you most agree with!", "start": 19.02, "duration": 3.12}, {"text": "It's that time you start hating people you really once thought you liked.", "start": 22.14, "duration": 4.2}, {"text": "Everyone picks a favorite candidate and they just won't stop talking about them.", "start": 26.34, "duration": 4.76}, {"text": "I like Donald Trump because he tells it like it is!", "start": 31.26, "duration": 3.22}, {"text": "Bernie Sanders is my personal savior.", "start": 34.48, "duration": 2.7}, {"text": "I'm voting for Hillary because girl power!", "start": 37.18, "duration": 3.08}, {"text": "And, I mean, it can be mildly amusing for a few days, but after several months it's just like ... shut up!", "start": 40.26, "duration": 7.5}, {"text": "Everyone is just repeating stuff that they've read on the internet, heard on the news, or heard other people say.", "start": 47.76, "duration": 5.08}, {"text": "It's just the same opinions over and over and louder and louder!", "start": 52.84, "duration": 2.76}, {"text": "Look, constant exposure to Facebook political conversation has been proven to be bad for your health.", "start": 55.6, "duration": 5.74}, {"text": "And by \"proven,\" I mean ...", "start": 61.34, "duration": 1.56}, {"text": "I currently have a headache.", "start": 63.34, "duration": 1.26}, {"text": "So let's talk about how to avoid talking about, hearing about, and being exposed to politics on Facebook.", "start": 64.6, "duration": 5.74}, {"text": "Because here's the thing: at this point in human history, 90% of American politics takes place on Facebook.", "start": 70.34, "duration": 6.52}, {"text": "God help us!", "start": 77.58, "duration": 0.8}, {"text": "Huh?", "start": 78.86, "duration": 0.5}, {"text": "No, I don't have anything to do with this. You guys have already made your choice.", "start": 80.1, "duration": 3.02}, {"text": "Here is a very common Facebook scenario that I'm pretty sure that we've all seen at least a few times.", "start": 83.12, "duration": 5.04}, {"text": "Someone posts a well-meaning but misguided pitch for their political candidate.", "start": 88.16, "duration": 4.62}, {"text": "My political candidate is the only hope to save this country and get it back on the right track!", "start": 92.78, "duration": 5.52}, {"text": "And then there's always that one commenter that says,", "start": 98.3, "duration": 2.34}, {"text": "(SCOFFS) Uh, yeah, I don't normally get involved in these political posts, but I can't remain silent any longer.", "start": 100.64, "duration": 5.92}, {"text": "I am not voting for the evil dictator that you support!", "start": 106.56, "duration": 3.7}, {"text": "And eventually, two hours later, it ends something like this:", "start": 110.26, "duration": 3.04}, {"text": "Oh my gosh, I am so done arguing with you, okay?", "start": 113.4, "duration": 3.82}, {"text": "This is the last thing I'll say about it and then I swear I'm blocking you!", "start": 117.22, "duration": 4.96}, {"text": "When you see this in your feed, when you see this post that says it has 45 comments,", "start": 122.32, "duration": 6.12}, {"text": "you are going to be tempted to read every single one of those comments.", "start": 128.44, "duration": 3.76}, {"text": "And you might actually feel justified because you're not really participating, you're just—you're just watching!", "start": 132.2, "duration": 5.56}, {"text": "It's kind of like slowly driving past a car wreck.", "start": 137.76, "duration": 2.62}, {"text": "Oh my, 45 casualties? That looks bad! Hmm.", "start": 140.38, "duration": 3.24}, {"text": "My advice? Avoid morbid curiosity.", "start": 143.62, "duration": 2.76}, {"text": "Don't be a debate-reader! You've got better things to do!", "start": 146.38, "duration": 2.86}, {"text": "You've got a family over here who loves you and wants to spend time with you,", "start": 149.24, "duration": 2.82}, {"text": "but instead you're over here on Facebook arguing about Bernie Sanders and Hillary Clinton.", "start": 152.06, "duration": 4.44}, {"text": "All right, okay, so let me throw another scenario at you.", "start": 156.5, "duration": 2.14}, {"text": "Because sometimes political debates are more difficult to avoid when you have that one Facebook friend", "start": 158.64, "duration": 5.44}, {"text": "who is just so in the can for that specific candidate that it—it's really almost creepy.", "start": 164.08, "duration": 5.16}, {"text": "You Google the word \"cult\" and realize that this person could very well be in one. (CHUCKLES)", "start": 169.24, "duration": 4.58}, {"text": "I am an otherwise sane human being who has deluded myself into believing that my personal favorite candidate", "start": 174.0, "duration": 5.98}, {"text": "doesn't desire power but actually only cares about my wellbeing! (LAUGHS)", "start": 179.98, "duration": 4.16}, {"text": "(GROANS) They're just—they're just so ignorant!", "start": 184.14, "duration": 2.26}, {"text": "Maybe if someone would just explain to them why they're wrong!", "start": 186.4, "duration": 4.58}, {"text": "No! Stop! Do not do that!", "start": 190.98, "duration": 2.02}, {"text": "It is so tempting to engage with this kind of person online, but before you do, keep these 3 things in mind.", "start": 193.0, "duration": 6.28}, {"text": "Number one: you won't change their mind.", "start": 199.28, "duration": 2.08}, {"text": "I mean, think about it. Is anything that anybody is gonna say going to change your mind?", "start": 201.36, "duration": 3.84}, {"text": "No! So it's not gonna work for them either!", "start": 205.82, "duration": 1.98}, {"text": "I believe my candidate will be the first human in history to resist the temptation that power brings.", "start": 207.8, "duration": 5.74}, {"text": "That's literally impossible and you're in a cult.", "start": 214.3, "duration": 2.78}, {"text": "Whoa, I've never heard an opposing viewpoint. Thank you! You've changed my life!", "start": 218.16, "duration": 4.46}, {"text": "No, that—that's never happened.", "start": 222.62, "duration": 2.0}, {"text": "All right, thing to remember number two, and this is some tough love, okay?", "start": 224.62, "duration": 4.14}, {"text": "You probably only want to engage with this person online to make yourself feel better, okay?", "start": 228.76, "duration": 5.14}, {"text": "You're hearing an opinion you disagree with, so you feel threatened, so you want to respond.", "start": 233.9, "duration": 4.1}, {"text": "This is a perfectly human response, but there is a better option, and it's number three.", "start": 238.0, "duration": 4.96}, {"text": "Nothing is more satisfying than unfollowing someone on Facebook.", "start": 242.96, "duration": 4.06}, {"text": "It's the simplest solution to all your problems!", "start": 247.02, "duration": 2.32}, {"text": "Look, I know that it can be hard because in real life, you really do like this person.", "start": 249.34, "duration": 4.26}, {"text": "But I really believe that during the political season,", "start": 253.6, "duration": 2.88}, {"text": "you have to learn to divorce the person from their insane internet persona.", "start": 256.48, "duration": 4.02}, {"text": "Hey, did you see the presidential debate last night?", "start": 260.5, "duration": 2.18}, {"text": "Yeah, I saw it.", "start": 262.68, "duration": 0.98}, {"text": "Man, I really liked Bill False. I think he had a lot of great answers!", "start": 263.66, "duration": 3.32}, {"text": "Oh yeah, he did just fine ...", "start": 267.46, "duration": 2.18}, {"text": "Okay. Well, I guess I'll talk to you later.", "start": 270.7, "duration": 1.88}, {"text": "Okay, bye.", "start": 273.06, "duration": 1.26}, {"text": "I don't care if it's not a popular opinion! I will not stand by and watch my country go down the toilet any longer!", "start": 274.82, "duration": 7.6}, {"text": "Anyone who believes the lies of Bill False is, well, AN IDIOT!", "start": 282.42, "duration": 5.08}, {"text": "If I see someone posting annoying political stuff on Facebook, bye-bye!", "start": 287.5, "duration": 4.36}, {"text": "Unfollow! You're done!", "start": 291.86, "duration": 1.14}, {"text": "You had a comfortable spot on my newsfeed and then you blew it!", "start": 293.0, "duration": 2.4}, {"text": "You've ruined it with your constant political spam!", "start": 295.4, "duration": 2.82}, {"text": "Maybe I'll follow you again after the election.", "start": 298.22, "duration": 2.66}, {"text": "But don't count on it.", "start": 300.88, "duration": 0.9}, {"text": "Hey, did you see that funny video I posted of myself on Facebook?", "start": 301.78, "duration": 3.42}, {"text": "Uh, well ... what video?", "start": 305.24, "duration": 1.6}, {"text": "It was the hilarious one where I got my wisdom teeth taken out and I was driving home.", "start": 306.84, "duration": 4.08}, {"text": "Uh, it didn't really show up in my feed.", "start": 311.92, "duration": 1.32}, {"text": "How could you have missed it? It's right there.", "start": 313.36, "duration": 3.54}, {"text": "Wait a minute. Come to think of it, you haven't liked one of my posts in over a year!", "start": 316.9, "duration": 4.62}, {"text": "Have you unfollowed me?", "start": 321.86, "duration": 1.12}, {"text": "It's the Facebook algorithms, man.", "start": 324.08, "duration": 1.54}, {"text": "Oh, no. No, do not blame this on Facebook algorithms!", "start": 325.62, "duration": 5.46}, {"text": "You little jerk.", "start": 331.08, "duration": 1.84}, {"text": "Guys, take it from me. Trying to build a website from scratch is incredibly difficult.", "start": 335.4, "duration": 4.96}, {"text": "That's why I suggest checking out Squarespace.", "start": 340.36, "duration": 2.2}, {"text": "Squarespace has tons of beautiful templates to choose from and they'll get you up and running", "start": 342.56, "duration": 4.4}, {"text": "with an amazing-looking website in literally minutes.", "start": 346.96, "duration": 2.28}, {"text": "You don't need to know how to code. The whole experience is super easy and intuitive.", "start": 349.24, "duration": 3.76}, {"text": "And the best part is that you can very easily make changes to your website whenever you need to.", "start": 353.0, "duration": 4.06}, {"text": "If you sign up with Squarespace for a year, you get a custom domain of your choice.", "start": 357.06, "duration": 3.78}, {"text": "Plus, if you use our link squarespace.com/cow, you're gonna get 10% off your first purchase.", "start": 360.84, "duration": 5.16}, {"text": "So if you've ever wanted to start a website or blog, do yourself a favor by going to squarespace.com/cow.", "start": 366.0, "duration": 6.12}, {"text": "See you guys.", "start": 372.56, "duration": 0.5}]