[{"text": "This is Creativity, Inc. by Ed Catmull, he's the co-founder of Pixar Animation Studios.", "start": 0.04, "duration": 5.16}, {"text": "They're the folks who brought you Coco, Inside-Out, Toy Story, Wall-E. Yeah, you've heard of them.", "start": 5.28, "duration": 4.3}, {"text": "It's a great book that takes you into the very heart of one of the most successful animation studios ever,", "start": 9.6, "duration": 5.02}, {"text": "and if you are strapped for inspiration, this is sure to give you a creative jumpstart.", "start": 14.62, "duration": 4.54}, {"text": "One of my favorite stories in the book takes place in the winter of 1998,", "start": 19.16, "duration": 4.2}, {"text": "when the folks at Pixar were hard at work putting together their very first sequel Toy Story 2,", "start": 23.36, "duration": 5.56}, {"text": "which was due out the next year.", "start": 28.92, "duration": 1.76}, {"text": "The thing about animated movies is that they take a long time to make,", "start": 30.68, "duration": 3.74}, {"text": "and especially back then required a huge team of writers, voice actors,", "start": 34.52, "duration": 4.62}, {"text": "storyboard artists, character designers, modelers, animators,", "start": 39.14, "duration": 3.18}, {"text": "editors, sound designers, a bunch of moving parts and, unlike a live-action film,", "start": 42.32, "duration": 4.34}, {"text": "which essentially involves just cutting together whatever images the camera captured on set,", "start": 46.66, "duration": 5.18}, {"text": "3D computer-generated animation is created on a digital network, where various artists and animators hop in and out of", "start": 51.84, "duration": 7.96}, {"text": "interconnected digital files to mold and shape each and every frame of the movie to perfection.", "start": 59.8, "duration": 5.68}, {"text": "Every object you see in the movie exists as a digital 3D model.", "start": 65.48, "duration": 5.1}, {"text": "All of these models and files are dependent upon each other.", "start": 70.82, "duration": 3.06}, {"text": "So when an animator opens a scene in his or her animation program, every object in that scene,", "start": 73.88, "duration": 6.04}, {"text": "from the characters to their costumes to the surrounding environment is loaded up for the animator to work with.", "start": 79.92, "duration": 5.52}, {"text": "This means that while in production, all of the movies assets", "start": 85.44, "duration": 3.22}, {"text": "are kept on a big computer drive which the animators work out of.", "start": 88.66, "duration": 4.1}, {"text": "Nowadays these drives exist in the cloud, but back then technical limitations meant", "start": 92.76, "duration": 4.24}, {"text": "Pixar had to employ large Linux and UNIX machines to house the files in studio.", "start": 97.0, "duration": 5.22}, {"text": "Well, one fine day, for reasons Ed chooses not to dwell on in this book,", "start": 102.22, "duration": 3.92}, {"text": "somebody attempting to do a bit of routine storage clean up typed a delete command into this master machine.", "start": 106.14, "duration": 6.38}, {"text": "Linux and UNIX were command-line operating systems. So instead of just... you know,", "start": 112.52, "duration": 4.1}, {"text": "highlighting what files you want to delete on a graphical user interface,", "start": 116.68, "duration": 3.4}, {"text": "you need to manually type in a delete command and then manually type in which specific folder you want to target.", "start": 120.08, "duration": 7.14}, {"text": "Forget to do this or don't do it properly and the system will just start erasing every single file on the machine.", "start": 127.32, "duration": 6.34}, {"text": "So just as soon as this unnamed Pixar employee could type in /bin/ rm - r - f asterisk... or whatever,", "start": 133.66, "duration": 7.9}, {"text": "all the files present on the Toy Story 2 master machine began disappearing.", "start": 141.56, "duration": 4.44}, {"text": "Imagine being an animator on the eagerly anticipated follow-up to Pixar's classic", "start": 146.06, "duration": 4.78}, {"text": "and as you're entering into your fifth hour of the day working on a scene from the movie,", "start": 150.84, "duration": 4.84}, {"text": "suddenly Woody's hat vanishes from the scene.", "start": 155.68, "duration": 2.7}, {"text": "Then his badge...", "start": 158.38, "duration": 1.24}, {"text": "then him...", "start": 159.62, "duration": 0.96}, {"text": "then Buzz!", "start": 160.58, "duration": 1.16}, {"text": "Then all kinds of error messages start appearing and you look up from your computer and you say:", "start": 161.74, "duration": 4.22}, {"text": "Oren Jacob, a technical director on the film was one such worker", "start": 167.52, "duration": 3.06}, {"text": "and realizing the master drive was being erased quickly dashed to a nearby phone", "start": 170.58, "duration": 4.58}, {"text": "to call the systems department where it was being housed.", "start": 175.16, "duration": 2.92}, {"text": "*phone ringing*", "start": 178.08, "duration": 1.14}, {"text": "\"Operator.\"\nJacob: \"I need the Systems Department right now!\"", "start": 179.52, "duration": 2.58}, {"text": "Operator: \"Hold on, what's your name?\"", "start": 182.18, "duration": 1.3}, {"text": "\"Oren Jacob, please connect me to Systems immediately.\"", "start": 183.48, "duration": 2.06}, {"text": "Operator: \"Who in Systems?\"", "start": 185.54, "duration": 1.22}, {"text": "Jacob: \"It doesn't matter! It's an emergency, get me anybody!\"", "start": 186.76, "duration": 2.72}, {"text": "Operator: \"Please hold.\"", "start": 189.48, "duration": 0.9}, {"text": "Jacob: \"Urgh!\"", "start": 190.42, "duration": 0.78}, {"text": "*phone ringing*", "start": 192.32, "duration": 4.62}, {"text": "\"Systems Department.\"", "start": 197.3, "duration": 1.18}, {"text": "Jacob: \"Pull out the plug on the Toy Story 2 master machine!\"", "start": 198.48, "duration": 2.22}, {"text": "Systems: \"What?\"", "start": 200.7, "duration": 1.04}, {"text": "\"This is an emergency! I'm Oren Jacob, the Technical Director.\"", "start": 201.74, "duration": 2.54}, {"text": "\"I need you to pull the plug on the Toy Story 2 master machine right now!\"", "start": 204.28, "duration": 3.54}, {"text": "Systems: \"Ah, well, we can't uh... we can't pull the machine that'll stop the animation department from being able to access the file-\"", "start": 207.84, "duration": 6.889}, {"text": "Jacob: \"I don't have time to explain! Please pull the plug right now!\"", "start": 214.729, "duration": 2.771}, {"text": "Systems: \"Hang on. Let me call the animation department, see if it's okay for me to do it first-\"", "start": 217.56, "duration": 4.26}, {"text": "Jacob: \"We don't have time! PULL THE PLUG!\"", "start": 221.82, "duration": 2.08}, {"text": "Systems: \"Alright buddy, your funeral.\"", "start": 223.9, "duration": 2.02}, {"text": "By the time the plug was pulled and the delete command was stopped,", "start": 226.86, "duration": 3.32}, {"text": "90% of the movie's files were gone. Less than a year from the film's release date.", "start": 230.24, "duration": 5.6}, {"text": "*screaming*", "start": 235.84, "duration": 1.22}, {"text": "Galyn Susman, Toy Story 2's supervising technical director, was quickly informed.", "start": 239.24, "duration": 4.86}, {"text": "And keeping a level head, called over to the I.T. department", "start": 244.1, "duration": 3.28}, {"text": "and requested that the movies backup drive be fired up.", "start": 247.38, "duration": 2.9}, {"text": "I mean, good on Pixar right? Always back up your files.", "start": 250.36, "duration": 2.88}, {"text": "Who in the right mind wouldn't regularly backup the files on a 500 million dollar motion picture?", "start": 253.24, "duration": 5.5}, {"text": "*phone ringing*", "start": 258.78, "duration": 1.28}, {"text": "\"I.T.\"\nSusman: \"Hi, we had a hard drive issue today on the Toy Story 2 project.\"", "start": 260.06, "duration": 5.54}, {"text": "\"Could you just send the backup drive over so we could restore our files?\"", "start": 265.64, "duration": 3.78}, {"text": "I.T.: \"Oh well, backups, they haven't been working for the past month.\"", "start": 269.44, "duration": 4.66}, {"text": "\"We've been trying to get it fixed... but, you know...\"", "start": 274.1, "duration": 2.44}, {"text": "\"You didn't get the memo?\"", "start": 276.92, "duration": 1.42}, {"text": "*beep*", "start": 279.1, "duration": 1.0}, {"text": "\"Hello?\"", "start": 280.1, "duration": 0.68}, {"text": "(Accurate depiction of the panic Pixar was in at that moment.)", "start": 280.78, "duration": 1.42}, {"text": "Less than 12 months from the film's opening and the entire animation team would have to start from scratch.", "start": 283.38, "duration": 6.34}, {"text": "An emergency meeting was called between the Pixar higher-ups to decide the fate of the entire project.", "start": 289.72, "duration": 5.36}, {"text": "There was talk of delaying the film and even scrapping the movie altogether,", "start": 295.1, "duration": 4.15}, {"text": "but then a light bulb went off in Galyn Susman's head.", "start": 299.25, "duration": 3.47}, {"text": "Earlier that year, Galyn had given birth to her son Eli and being the multitasking action mom that she is,", "start": 302.72, "duration": 6.28}, {"text": "occasionally worked on the movie from home,", "start": 309.0, "duration": 2.28}, {"text": "and in order to do so, she had created a personal backup of all the film's assets herself", "start": 311.28, "duration": 5.12}, {"text": "and kept it on her home computer.", "start": 316.4, "duration": 2.22}, {"text": "So Galyn and Oren drove on over to her home, wrapped her computer in blankets and pillows and", "start": 318.64, "duration": 5.52}, {"text": "carefully placed it in the back seat of her car.", "start": 324.18, "duration": 2.7}, {"text": "Driving what I assume was about 10 miles per hour back to the studio,", "start": 326.88, "duration": 4.1}, {"text": "the computer, Toy Story 2 and by extension, the entire studio's last hope,", "start": 330.98, "duration": 5.06}, {"text": "was unloaded by a team and carried into Pixar like an Egyptian pharaoh.", "start": 336.04, "duration": 4.78}, {"text": "The computer was carefully set up, carefully plugged in, carefully turned on and...", "start": 340.82, "duration": 4.84}, {"text": "and the movie's assets were restored.", "start": 345.66, "duration": 2.14}, {"text": "So let this be a lesson kids. Always backup your files and never use Linux.", "start": 347.8, "duration": 4.78}, {"text": "I can't wait to read the fanboy comments on this one. Enjoy unsubscribing, 0.4% of my audience.", "start": 352.589, "duration": 6.391}, {"text": "This video is brought to you by Dashlane.", "start": 358.98, "duration": 2.0}, {"text": "Sure, as we've learned today, backing up your system files is important.", "start": 360.98, "duration": 3.58}, {"text": "But who's keeping an eye on your online identity?", "start": 364.56, "duration": 2.92}, {"text": "Dashlane wants to help protect your accounts by giving you a tool", "start": 367.5, "duration": 3.48}, {"text": "that will generate strong passwords, storing them in memory and", "start": 370.98, "duration": 3.1}, {"text": "auto-filling on whatever site you want across all your devices.", "start": 374.08, "duration": 3.48}, {"text": "So there's that. Did I mention that Dashlane is free? It's true. What are you waiting for?", "start": 379.62, "duration": 4.8}, {"text": "It's easy to sign up and get secure.", "start": 384.42, "duration": 2.52}, {"text": "Dashlane has helped 10 million users across 150 countries with 15 billion dollars spent in e-commerce,", "start": 386.94, "duration": 6.66}, {"text": "3 billion forms filled out on 6.5 million websites,", "start": 393.6, "duration": 4.58}, {"text": "77 million check out transactions.", "start": 398.2, "duration": 3.06}, {"text": "Their patented security architecture encrypts everything so that no one except you can see your information,", "start": 401.26, "duration": 6.08}, {"text": "and if you want to go even further, you can upgrade to their premium service", "start": 407.34, "duration": 3.62}, {"text": "to get cool features like a VPN and dark web monitoring.", "start": 410.96, "duration": 3.26}, {"text": "In fact, I've got a special offer that'll let you use premium for free for a whole month!", "start": 414.22, "duration": 5.38}, {"text": "Go to dashlane.com/austinmcconnell to try premium.", "start": 419.6, "duration": 3.92}, {"text": "And if you decide to stick with it afterward, use the promo code austinmcconnell at checkout for 10% off.", "start": 423.52, "duration": 6.28}, {"text": "What was the worst data loss you ever endured? Let me know in the comments.", "start": 429.8, "duration": 3.42}]