[{"text": "Sup ya beautiful bastards. Hope you havin a fantastic Tuesday.", "start": 0.0, "duration": 2.52}, {"text": "Welcome back to the Philip Defranco show and let's just jump into it. And the first thing we're gonna talk about today one of the most requested", "start": 3.32, "duration": 5.02}, {"text": "Stories today is Roseanne Barr was back in the news for what the hill called a racially charged tweet", "start": 8.74, "duration": 5.99}, {"text": "Although many others are just calling it outright racist. The target of the tweet is former Obama White House advisor Valerie", "start": 14.73, "duration": 4.92}, {"text": "Jarrett Roseanne tweeted Muslim Brotherhood and Planet of the Apes had a baby equals VJ.", "start": 19.65, "duration": 5.19}, {"text": "VJ of course being Valerie Jarrett's initials Roseanne Barr then eventually ended up deleting that tweet later tweeting. I apologize", "start": 24.84, "duration": 5.729}, {"text": "I am now leaving Twitter, I apologize to Valerie Jarrett and to all Americans", "start": 30.57, "duration": 2.79}, {"text": "I'm truly sorry for making a bad joke about her politics and her looks I should have known better. Forgive me", "start": 33.46, "duration": 4.459}, {"text": "My joke was in bad taste and all of that I have to say and obviously this part is my opinion", "start": 37.92, "duration": 4.17}, {"text": "I say this as someone that on this show has defended comedians many times", "start": 42.09, "duration": 3.329}, {"text": "I don't know if that was really a joke. It kind of just sounds like you're going after her politics", "start": 45.42, "duration": 4.38}, {"text": "Yes by pairing her with the Muslim Brotherhood", "start": 49.8, "duration": 2.25}, {"text": "And then also just saying she looks like a monkey or ape. And then when there was pushback you're like, oh no", "start": 52.05, "duration": 4.799}, {"text": "It was just a bad joke. Also, I understand that we all come from different walks of life", "start": 56.85, "duration": 3.33}, {"text": "We have different life experiences", "start": 60.18, "duration": 1.559}, {"text": "We have different lines kind of in the sand where we think something is racist", "start": 61.739, "duration": 3.72}, {"text": "But usually I feel like it's almost a universal calling a black person or a person with a dark skinned", "start": 65.46, "duration": 4.44}, {"text": "Monkey or ape or referring to them as one in a roundabout way pretty racist", "start": 70.119, "duration": 5.27}, {"text": "You can't really even", "start": 75.39, "duration": 0.909}, {"text": "argue or at least", "start": 76.299, "duration": 0.991}, {"text": "Successfully argue outside of your own echo-chamber that she wasn't using that as a way to reference how she looked because even in her apology", "start": 77.29, "duration": 6.139}, {"text": "She references that she was taking aim at her looks but to jump from my opinion back to the story. Of course", "start": 83.43, "duration": 4.139}, {"text": "Now you're seeing a lot of people calling on ABC to get Roseanne off the air many pointing out that Disney owns ABC and ESPN", "start": 87.57, "duration": 5.699}, {"text": "and that's notable because", "start": 93.75, "duration": 1.15}, {"text": "ESPN, you might remember we even covered the story, suspended Jamel Hill. This is because she was speaking out against the president called him a white", "start": 94.9, "duration": 5.239}, {"text": "supremacist and so you have many people saying that if ABC or more importantly Disney here do not take action against Roseanne that is proof of", "start": 100.299, "duration": 5.75}, {"text": "A double standard, especially since some argue with Roseanne", "start": 106.049, "duration": 2.34}, {"text": "and we see a pattern of behavior. Many people pointing to a past moment where Roseanne called Susan Rice a man with big swinging eight balls", "start": 108.39, "duration": 6.689}, {"text": "and actually wow last second update to this story Roseanne has now been canceled. ABC Entertainment president, Shannon Dungy saying", "start": 115.079, "duration": 6.78}, {"text": "Roseanne's Twitter statement is abhorrent repugnant and inconsistent with our values and we have decided to cancel her show. And along with that", "start": 122.009, "duration": 5.88}, {"text": "We also saw executive producer and co-star Sara Gilbert tweeting about the situation denouncing", "start": 127.89, "duration": 4.44}, {"text": "Roseanne's comments and saying they do not reflect the beliefs of our cast and crew or anyone associated with our show", "start": 132.58, "duration": 4.3}, {"text": "I am disappointed in her actions to say the least and adding this is incredibly sad and difficult for all of us as we created", "start": 136.88, "duration": 5.3}, {"text": "a show that we believe in are proud of and that", "start": 142.189, "duration": 2.031}, {"text": "Audiences love, one that is separate and apart from the opinions and words of one cast member and actually now an even more recent update", "start": 144.3, "duration": 6.049}, {"text": "Reportedly Roseanne Barr has now been dropped as a client by", "start": 150.349, "duration": 2.58}, {"text": "ICM partners with all that said I do want to pass the question off to you", "start": 153.0, "duration": 3.259}, {"text": "What is your takeaway from this situation?", "start": 156.26, "duration": 1.54}, {"text": "Did you see this as a bad joke that didn't land or is this just an example of racism?", "start": 157.8, "duration": 4.759}, {"text": "Also, do you think the show should have been canceled?", "start": 162.56, "duration": 1.56}, {"text": "Yes or no?", "start": 164.12, "duration": 0.51}, {"text": "and I'm really interested on your opinion there because I've seen a variety of arguments regarding yes or no. A lot of people saying of", "start": 164.63, "duration": 4.889}, {"text": "course they had to cancel it, if they did not cancel the show or do something with Roseanne", "start": 169.519, "duration": 3.93}, {"text": "it would just seem like they were co-signing that behavior.", "start": 173.45, "duration": 2.039}, {"text": "You also have others arguing that it's not a great trend for people to lose their jobs based off of things that they say and if", "start": 175.489, "duration": 5.07}, {"text": "there is public pushback, let the audience decide if they want to continue watching the show or not.", "start": 180.56, "duration": 3.959}, {"text": "So yeah\nlet me know where you land on this in those comments down below and then let's talk about 'video games is serious business' news because", "start": 184.519, "duration": 5.55}, {"text": "Today we learned that PUBG Corp", "start": 190.069, "duration": 1.651}, {"text": "The studio behind PUBG is suing Epic Games, the developer behind Fortnite, the lawsuit claiming copyright", "start": 191.72, "duration": 5.069}, {"text": "Infringement specifically that fortnight's battle royale mode copies PUBG's interface and in-game items and even though we're just learning about this today", "start": 196.98, "duration": 6.259}, {"text": "Reportedly the lawsuit was filed back in January", "start": 203.239, "duration": 2.339}, {"text": "It's also not even a huge surprise that this lawsuit is happening. Back in 2017", "start": 205.579, "duration": 3.57}, {"text": "Blue Hole", "start": 209.15, "duration": 0.66}, {"text": "which is the parent company for PUBG", "start": 209.81, "duration": 1.567}, {"text": "Corp called out Epic Games, pointing out the similarities between the games. Saying that they might have", "start": 211.377, "duration": 4.612}, {"text": "to take legal actions", "start": 215.989, "duration": 1.08}, {"text": "and today we're learning that they moved on that. And the whole situation here is", "start": 217.069, "duration": 2.88}, {"text": "fascinating to me. Despite there being different maps different weapons, different art styles,", "start": 220.2, "duration": 3.529}, {"text": " ", "start": 223.729, "duration": 0.641}, {"text": "building in Fortnite. Games are ultimately similar at their core. Epic Games has even said that fortnight battle royale was inspired by not only", "start": 224.37, "duration": 7.399}, {"text": "PUBG but by its predecessor H1Z1 king of the kill", "start": 231.769, "duration": 2.61}, {"text": "Which was made by the same lead designer as PUBG", "start": 234.38, "duration": 2.039}, {"text": "We have people pointing out that even PUBG is based on an ARMA mod", "start": 236.42, "duration": 3.119}, {"text": "So were they essentially, through this, trying to say they own this game mode? All the while and this is kind of funny", "start": 239.54, "duration": 4.59}, {"text": "PUBG runs on the Unreal game engine which is developed by Epic Games.", "start": 244.22, "duration": 3.389}, {"text": "Also an important thing to note here is with this situation you're dealing with two courts", "start": 247.62, "duration": 3.83}, {"text": "The actual courts the legal situation and we'll see what happens there with a copyright situation", "start": 251.45, "duration": 3.689}, {"text": "but potentially the more important court here is the court of public opinion because if you look online", "start": 255.15, "duration": 4.55}, {"text": "people are not happy with PUBG. If people saying it's", "start": 259.979, "duration": 3.14}, {"text": "disgusting that you have this company seemingly trying to 'own a genre'. Many calling it a petty and desperate move to combat Fortnite's takeover of", "start": 263.22, "duration": 6.769}, {"text": "the space. And it will be interesting to see in the coming weeks, the coming months if this legal move pushes people that were sticking", "start": 269.99, "duration": 5.19}, {"text": "With PUBG away and it really wouldn't be surprising to me if that's what we see take place", "start": 275.18, "duration": 3.48}, {"text": "And as of right now I see nothing slowing down Fortnite.", "start": 278.66, "duration": 3.239}, {"text": "You've got fantastic", "start": 281.9, "duration": 0.88}, {"text": "professional but also at the same time", "start": 282.78, "duration": 1.83}, {"text": "exciting faces at the forefront like Ninja. A guy who and he really should get more credit for this because you don't always see a", "start": 284.61, "duration": 5.0}, {"text": "lot of the people at the top kind of bring people up with them but promotes other streamers. It's great for him", "start": 289.61, "duration": 4.649}, {"text": "It's great for Twitch.", "start": 294.259, "duration": 0.78}, {"text": "It's great for Fortnite.", "start": 295.039, "duration": 1.081}, {"text": "Then on top of that we've seen the rise of weekly tournaments from third parties and that was before Epic Games announced that they're putting", "start": 296.12, "duration": 5.01}, {"text": "100 million dollars into competitive Fortnite, but ultimately like with all situations", "start": 301.199, "duration": 4.399}, {"text": "we're gonna have to wait and see what happens.", "start": 305.599, "duration": 1.531}, {"text": "But to those of you kind of in this world whether you play PUBG whether you play Fortnite", "start": 307.13, "duration": 4.049}, {"text": "I'd love to know your thoughts here. But from that I want to share some stuff I love today and Today in Awesome", "start": 311.18, "duration": 4.679}, {"text": "brought to you by Squarespace. Whether you need a domain, a website, an online store, make it with Squarespace. It's intuitive", "start": 315.86, "duration": 5.429}, {"text": "It's easy to use you can make a beautiful website with their all in one platform and you've got nothing to install,", "start": 321.289, "duration": 4.44}, {"text": "patch, or upgrade ever. So if you want to make the smart move like many from the nation", "start": 325.86, "duration": 3.38}, {"text": "have, you want to start your free trial, go to", "start": 329.24, "duration": 1.58}, {"text": "Squarespace.com/Phil", "start": 330.82, "duration": 1.6}, {"text": "and then when you love it make sure you enter an offer code 'PHIL' for ten percent off your first purchase and", "start": 332.42, "duration": 3.719}, {"text": "The first bit of Awesome today is just a friendly reminder to subscribers of DeFranco elite", "start": 336.139, "duration": 3.269}, {"text": "We're doing the live Q&A and end of month townhall. A link down below for that.", "start": 339.409, "duration": 3.45}, {"text": "Then we got the honest trailers for Every Christopher Nolan Movie", "start": 342.86, "duration": 2.91}, {"text": "Whatever the hell that Golden Knight's opening", "start": 345.77, "duration": 1.78}, {"text": "ceremony was. If it's your kind of thing Weezer has also now covered Africa. We had Kevin Perry showing us 50 ways to enter a room and", "start": 347.55, "duration": 7.19}, {"text": "TED Ed gave us Are Naked Mole-rats the Strangest Mammals? And if you want to see the full versions of everything I just shared, the Secret", "start": 354.74, "duration": 5.489}, {"text": "Link of the Day, anything at all, links as always are in the description down below.", "start": 360.229, "duration": 3.451}, {"text": "And then let's talk about Mamoudou Gassama", "start": 363.78, "duration": 1.8}, {"text": "If you clicked on the secret link from yesterday's show you already know how this story starts. A video filmed in Paris went viral in", "start": 365.7, "duration": 5.14}, {"text": "the video we see someone who has now been identified as 22 year-old Mamoudou", "start": 370.849, "duration": 2.91}, {"text": "just gliding up a building to save a four-year-old boy who is dangling from a balcony. It's one of the most daring and amazing rescues", "start": 374.13, "duration": 5.329}, {"text": "I've ever seen and it has people calling him the real life spider-man", "start": 379.46, "duration": 2.639}, {"text": "One of the craziest things about this story is according to new reports the boy at the time", "start": 382.199, "duration": 3.8}, {"text": "the video was filmed had already fallen two stories before somehow managing to grab hold of the fourth-floor balcony.", "start": 386.0, "duration": 4.7}, {"text": "So the other person on the balcony who was trying to grab the child that some people had been identifying him as the father?", "start": 390.82, "duration": 4.32}, {"text": "No.", "start": 395.15, "duration": 0.48}, {"text": "That was just a random person who lived in the same building.", "start": 395.63, "duration": 2.189}, {"text": "Reportedly that resident couldn't really pick him up because there was a divider separating the two balconies and he feared dropping the kid.", "start": 398.069, "duration": 5.27}, {"text": "So that's why you see at that weird angle", "start": 403.34, "duration": 1.56}, {"text": "he's kind of just holding onto the kid's hand. And along with the general praise Mamoudou received from the general public", "start": 404.9, "duration": 4.38}, {"text": "we also saw politician standing up. Paris mayor Anne Hidalgo saying on her official Twitter", "start": 409.28, "duration": 3.6}, {"text": "Sunday that she had called Mamoudou to thank him for his act of bravery adding he explained to me that he arrived from Mali", "start": 413.009, "duration": 4.88}, {"text": "A few months ago with the dream of making a life for himself here", "start": 417.889, "duration": 2.73}, {"text": "I replied that his heroic act is an example for all citizens and that the city of Paris will obviously be keen to support him", "start": 420.62, "duration": 5.25}, {"text": "in his efforts to settle in France. French president Emmanuel Macron", "start": 425.87, "duration": 2.76}, {"text": "then met with Mamoudou on Monday presenting with a certificate in a gold medal for performing an act of courage and determination", "start": 428.63, "duration": 5.309}, {"text": "Macron also offered him a job at the Paris Fire Brigade also offering to speed up his citizenship process for his exceptional act and", "start": 434.34, "duration": 6.41}, {"text": "Mamoudou is reportedly granted a residency permit today and will receive French citizenship at a later date. But along with this feel-good hero", "start": 440.75, "duration": 6.119}, {"text": "Rising to the occasion moment. There is still the question of well, what about the parents?", "start": 447.03, "duration": 4.069}, {"text": "Where were they when the child was hanging off the balcony?", "start": 451.099, "duration": 2.1}, {"text": "How could they let this happen? As of right now,", "start": 453.199, "duration": 1.71}, {"text": "neither of the parents have been publicly named but according to a Paris prosecutor", "start": 454.909, "duration": 3.48}, {"text": "the boy was under the care of his father. The mother was reportedly not in Paris at that time and the boy had actually moved to", "start": 458.389, "duration": 4.47}, {"text": "Paris with his father about three weeks ago. The mother and the couple's second child were due to join them in June", "start": 462.86, "duration": 4.049}, {"text": "But the big standout here is reportedly the day of the incident the father had gone grocery shopping which took longer than expected to return", "start": 466.909, "duration": 5.67}, {"text": "home where he left his four year old according to the", "start": 472.58, "duration": 2.639}, {"text": "prosecutor took a long time to return home because he had decided to play the smartphone game", "start": 475.349, "duration": 4.49}, {"text": "'Pokemon Go' when he left the store.", "start": 480.03, "duration": 2.0}, {"text": "He is devastated because he realizes what he did and the tragic consequences", "start": 482.03, "duration": 3.689}, {"text": "that it could have led to and I don't even know how to respond to that level of stupid. Rather than taking your", "start": 485.909, "duration": 5.36}, {"text": "four-year-old to the store with you,", "start": 491.55, "duration": 1.64}, {"text": "you left that child at home", "start": 493.19, "duration": 1.81}, {"text": "alone in an apartment with a balcony that you did not secure for an even longer a more", "start": 495.0, "duration": 4.669}, {"text": "extended period of time because you wanted to 'catch em all'. I want to slap whoever this man is in his dumb face.", "start": 499.74, "duration": 4.609}, {"text": "But actually as far as real-world punishment", "start": 504.389, "duration": 2.029}, {"text": "the father was taken into custody on Sunday authorities have reportedly charged him with 'failure to meet parental obligations'", "start": 506.419, "duration": 4.799}, {"text": "And that's potentially a big deal because that charge against him reportedly carries a sentence of up to two years", "start": 511.219, "duration": 3.63}, {"text": "in prison. That said, he was released after", "start": 514.95, "duration": 2.209}, {"text": "questioning and he has pending a trial scheduled for September", "start": 517.229, "duration": 2.51}, {"text": "And as of right now, as far as the status of the boy, reportedly he is okay. At the time of the incident the child", "start": 519.74, "duration": 4.2}, {"text": "was bleeding from his toe and had a torn nail, but he has not really suffered", "start": 523.94, "duration": 3.059}, {"text": "any other injuries. But there is also conflicting information", "start": 527.0, "duration": 1.829}, {"text": "as far as where he is right now. Most places are reporting that he was taken by the French authorities", "start": 528.829, "duration": 3.48}, {"text": "but the Telegraph is reporting that he was then given back to the father. But for now that is where this crazy story is and it'll", "start": 532.32, "duration": 5.869}, {"text": "be interesting to see what happens next. I guess the final note I want to hit on is Mamoudou", "start": 538.19, "duration": 3.779}, {"text": "is our BAMF of the day and the father here is our D-BAG of the day. And the question", "start": 541.97, "duration": 5.28}, {"text": "I want to pass off to you with this story is is what punishment if any", "start": 547.25, "duration": 3.209}, {"text": "do you think is appropriate for the father here? And I say 'if any' because I know my opinion is mine and you might have", "start": 550.62, "duration": 5.299}, {"text": "A different outlook on the story. And then let's talk about an update around Puerto Rico and hurricane Maria", "start": 555.92, "duration": 3.69}, {"text": "Now you may remember Hurricane Maria hit them, September 20th", "start": 559.61, "duration": 2.549}, {"text": "2017. It was the most intense hurricane to hit the island in 80 years. And officially", "start": 562.16, "duration": 4.169}, {"text": "the death count is said to be 64", "start": 566.329, "duration": 1.411}, {"text": "Although a few reports early on said this was likely an undercount. That in November", "start": 567.74, "duration": 3.419}, {"text": "We saw CNN estimate at least", "start": 571.16, "duration": 1.81}, {"text": "500 in December, the New York Times estimating 1,000 and around the same time Puerto Rico's center for investigative", "start": 572.97, "duration": 5.09}, {"text": "Journalism finding similar results. And now this morning a group of independent researchers from Harvard TH Chan School of Public Health", "start": 578.25, "duration": 5.539}, {"text": "published their findings and the number is horrifying", "start": 583.86, "duration": 2.959}, {"text": "They estimate that the actual death toll was around four thousand six hundred forty-five", "start": 586.819, "duration": 3.78}, {"text": "And in fact, it could have possibly exceeded five thousand. And according to the study, of those dead", "start": 590.6, "duration": 4.2}, {"text": "approximately one third died due to delayed or interrupted medical care.", "start": 594.839, "duration": 3.17}, {"text": "And as far as how they got these numbers", "start": 598.01, "duration": 1.319}, {"text": "They reportedly visited", "start": 599.329, "duration": 1.151}, {"text": "3,000 residences and found thirty-eight people living in households that had died between September 20th when Maria hit and the end of 2017. And they spread", "start": 600.48, "duration": 6.469}, {"text": "the residences between 104 Barrios to ensure even representation between urban and rural areas. That total was then converted into a mortality rate", "start": 606.949, "duration": 6.3}, {"text": "which was 14.3 deaths per thousand residents and then was used to estimate the total for the entire island.", "start": 613.25, "duration": 4.889}, {"text": "That estimate was then compared to statistics from 2016 which showed a 62 percent increase in the mortality rate after Maria.", "start": 618.139, "duration": 6.21}, {"text": "And as far as why there is a range in the possible dead, there there are multiple factors there.", "start": 624.35, "duration": 3.479}, {"text": "There's the possibility of over sampling in rural areas, estimates regarding total population,", "start": 627.829, "duration": 4.859}, {"text": "those could be off, the total number dead could actually even be higher because those that died alone could not be surveyed and researchers found", "start": 632.689, "duration": 5.67}, {"text": "that in remote areas one in five residences were empty.", "start": 638.36, "duration": 2.579}, {"text": "And as far as my opinion on this", "start": 640.939, "duration": 0.96}, {"text": "I think that it's just important that we pay attention to the situation whether it be two thousand or eight thousand one of the most", "start": 641.899, "duration": 4.859}, {"text": "important things to consider with a disaster like this or any", "start": 646.759, "duration": 2.16}, {"text": "disaster is that the death count is not just in that moment. The bodies will continue to pile up every day", "start": 649.11, "duration": 5.119}, {"text": "we do not get the survivors back to some sort of normalcy.", "start": 654.23, "duration": 2.28}, {"text": "And when we look to Puerto Rico", "start": 656.579, "duration": 1.431}, {"text": "there are still five percent of electric customers that still don't have power after all of this time.", "start": 658.01, "duration": 3.649}, {"text": "I think that's an important mindset for us to have in general but also", "start": 661.66, "duration": 2.669}, {"text": "hurricane season's back. We need to learn from these things. So that is where I'm going to end today's show", "start": 664.85, "duration": 3.679}, {"text": "And of course remember, this is the Philip DeFranco show whether it be the last story, the first one, anything in between,", "start": 668.529, "duration": 4.08}, {"text": "I love to know your thoughts today in those comments down below", "start": 672.61, "duration": 2.609}, {"text": "also", "start": 675.22, "duration": 0.419}, {"text": "Remember if you like this video, like what I'm trying to do on this channel, hit that Like button if you're new here hit that Subscribe", "start": 675.639, "duration": 4.47}, {"text": "button, ring that bell, it even sometimes works...", "start": 680.11, "duration": 2.369}, {"text": "Also if you did miss yesterday's Daily Show", "start": 682.48, "duration": 1.62}, {"text": "You want to catch up click or tap right there to watch that or if you need something a little bit lighter you can watch", "start": 684.1, "duration": 3.75}, {"text": "The newest behind the scenes vlog but that said, of course as always my name's Philip DeFranco.", "start": 687.85, "duration": 3.69}, {"text": "You've just been phill'd in, I love yo faces and i'll see you tomorrow.", "start": 691.61, "duration": 4.01}]