[{"text": "This video was sponsored by the", "start": 0.0, "duration": 1.96}, {"text": "Online game war thunder by clicking the link in the description you get a great head start into the game with a free premium tank", "start": 1.96, "duration": 7.58}, {"text": "Or aircraft in three days of premium time find out more after the video", "start": 9.54, "duration": 4.71}, {"text": "Let's talk about World War two", "start": 14.98, "duration": 2.21}, {"text": "There were a lot of factors that led to Nazi Germany losing world war two, but the most glaring", "start": 38.699, "duration": 5.66}, {"text": "Crimson main factor was they invaded Russia", "start": 45.03, "duration": 3.889}, {"text": "And even though the Germans didn't know it when they crossed into the USSR", "start": 48.92, "duration": 4.8}, {"text": "They had effectively numbered the days of the Reich", "start": 53.969, "duration": 3.229}, {"text": "so the question arises when thinking back to World War two, what if Germany just", "start": 57.21, "duration": 5.389}, {"text": "didn't invade the Soviet Union? Now this seems preposterous to think about. Fascism and communism are", "start": 63.149, "duration": 6.829}, {"text": "Natural enemies it wouldn't make sense for them not to fight, but just stick with me", "start": 70.17, "duration": 5.419}, {"text": "Let's imagine an alternate scenario in a different timeline", "start": 75.72, "duration": 3.47}, {"text": "Nazi Germany still goes on to conquer most of Europe", "start": 79.92, "duration": 2.959}, {"text": "however", "start": 83.13, "duration": 0.5}, {"text": "The one thing Germany doesn't do is invade the Soviet Union. What could be the outcome of this?", "start": 83.63, "duration": 6.33}, {"text": "Does this make any sense? Is anything real?", "start": 90.36, "duration": 2.869}, {"text": "Let's find out first some historical context in our timeline in", "start": 93.69, "duration": 5.269}, {"text": "1930 now in a Hitler wanting to invade Poland", "start": 99.6, "duration": 2.869}, {"text": "He didn't really care about Britain and France shaking their fist at him", "start": 102.469, "duration": 3.33}, {"text": "All he worried about was how the Soviets would react even though the Nazis and Soviets", "start": 105.799, "duration": 5.25}, {"text": "hated one another both knew they could work together to get some mutual benefit and", "start": 111.21, "duration": 5.389}, {"text": "so fascists and communists joined hand-in-hand to march into Poland and slaughter everybody a", "start": 116.909, "duration": 6.47}, {"text": "Brief tenuous peace was born. It was meant to last for ten whole years", "start": 124.229, "duration": 4.46}, {"text": "Stalin was confident that this pact would keep the Soviets and Germans from going to war", "start": 129.6, "duration": 5.089}, {"text": "Believing Hitler wouldn't be stupid enough to fight a two-front war", "start": 135.12, "duration": 3.47}, {"text": "You know the logical idea by 1940 France was dead and Britain was on the brink Hitler. However", "start": 139.17, "duration": 7.069}, {"text": "Was anxious he expected that once France was gone", "start": 146.64, "duration": 3.5}, {"text": "Britain would have lost all hope in the war and would surrendered to the Reich", "start": 150.42, "duration": 4.039}, {"text": "However, Britain just didn't this is where the cogs and Hitler's head began turning", "start": 154.739, "duration": 5.42}, {"text": "Perhaps the only reason the British weren't surrendering was because they were hoping for the Russians to defeat Germany", "start": 160.799, "duration": 6.61}, {"text": "That eventual war if the Soviets would need to be pushed up. So Britain could surrender to and", "start": 167.75, "duration": 4.94}, {"text": "Well, you know how the rest went what if in an alternate timeline Hitler actually followed that decade-long pact with the Soviet Union", "start": 173.78, "duration": 7.58}, {"text": "one thing changes who the British Prime Minister is", "start": 182.21, "duration": 3.979}, {"text": "When the war began Prime Minister Neville Chamberlain the man who famously declared peace in our time with the Germans", "start": 186.62, "duration": 6.35}, {"text": "Resigned when it was shown that there wouldn't be peace in our time", "start": 193.459, "duration": 3.92}, {"text": "In his place was the cigar-smoking gruff bowling-ball of a man", "start": 197.81, "duration": 4.399}, {"text": "We all know as Winston Churchill who came to power and had one goal", "start": 202.209, "duration": 4.35}, {"text": "No surrender. As long as Churchill is Prime Minister Britain doesn't surrender", "start": 206.959, "duration": 5.3}, {"text": "so in this alternate timeline Chamberlain never resigns", "start": 212.6, "duration": 4.309}, {"text": "with the fall of France the Parliament with Chamberlain at the head is far more likely to surrender to the Germans and", "start": 217.34, "duration": 7.55}, {"text": "Recognize that the Reich controls Europe now", "start": 225.35, "duration": 3.049}, {"text": "It's not like Britain was out of the war", "start": 228.4, "duration": 2.7}, {"text": "If Germany did control Europe all that matters is whether the politicians at the time", "start": 231.1, "duration": 5.399}, {"text": "Momentarily believed it whether they actually would is extremely unlikely", "start": 237.14, "duration": 4.849}, {"text": "It's just more likely than if Churchill was in power the main thing that matters is Britain surrenders", "start": 242.18, "duration": 6.95}, {"text": "Hitler gets what he wants and celebrates the victory", "start": 249.38, "duration": 2.779}, {"text": "Stalin does not Stalin is often made fun of for not foreseeing the German invasion", "start": 253.34, "duration": 5.809}, {"text": "He believed that the Germans would never fight a two-front war", "start": 259.489, "duration": 3.5}, {"text": "He thought it would be suicidal for Germany to do so", "start": 263.21, "duration": 3.8}, {"text": "And he was right because he thought this he wanted nothing more than to delay", "start": 267.38, "duration": 6.109}, {"text": "the inevitable war as long as possible as long as Britain held out against the Germans to Stalin the", "start": 273.49, "duration": 6.66}, {"text": "Russians would be safe for now", "start": 280.4, "duration": 2.059}, {"text": "Even when evidence came in showing this was the contrary he still held on to it", "start": 282.8, "duration": 5.39}, {"text": "this changes in an alternate timeline where Britain surrenders this mindset goes out the window an", "start": 288.38, "duration": 7.159}, {"text": "Action had to be taken", "start": 296.09, "duration": 2.0}, {"text": "Instead of Russia being caught off guard and confused like in our timeline", "start": 298.099, "duration": 3.89}, {"text": "Stalin begins to mobilize his forces for a defense of Russia and most importantly an invasion", "start": 302.479, "duration": 7.13}, {"text": "Yes in this alternate timeline where germany doesn't invade the soviet union the Soviets would have certainly", "start": 339.16, "duration": 6.5}, {"text": "invaded Germany", "start": 346.0, "duration": 1.08}, {"text": "The Germans would find themselves at the height of their power fighting a defensive war", "start": 347.08, "duration": 5.179}, {"text": "against an incoming communist army while this convoluted thing begins", "start": 352.63, "duration": 4.73}, {"text": "let's take a break and focus on what America is doing if", "start": 357.43, "duration": 3.26}, {"text": "Britain is out of the war", "start": 360.97, "duration": 1.22}, {"text": "then the US doesn't have an ally to send supplies to and also an island to conduct a certain invasion from", "start": 362.19, "duration": 6.36}, {"text": "So for a bit their main focus would be with Japan who is still going about with their own expansion", "start": 368.74, "duration": 5.779}, {"text": "Japan like the belle of the ball can decide to go to war with either two countries the Soviets or the Americans?", "start": 374.86, "duration": 7.489}, {"text": "Okay, so now going back into Europe a war where the Soviets invaded", "start": 387.85, "duration": 5.179}, {"text": "By a confused thing to predict think of it as a scenario to ponder here are a few little facts", "start": 394.6, "duration": 6.35}, {"text": "I think you could consider and come to your own conclusion for how such a war could end", "start": 400.95, "duration": 4.95}, {"text": "one if Germany declares war in the United States", "start": 406.27, "duration": 3.079}, {"text": "then the US would give weapons in supplies to the Soviets through the lend-lease act to fight against their enemy to", "start": 409.35, "duration": 7.019}, {"text": "if Germany conquers the British and uses their territory", "start": 416.62, "duration": 3.559}, {"text": "Then they have access to oil from the Middle East", "start": 420.37, "duration": 2.69}, {"text": "Allowing them to maintain their industry instead of needing to invade southern Russia for oil", "start": 423.49, "duration": 5.66}, {"text": "I think the main thing that could be taken away from this", "start": 429.15, "duration": 2.97}, {"text": "Is that a war where the Germans are instead invaded by the Russians would be a far more", "start": 432.12, "duration": 3.96}, {"text": "confusing affair for the rest of the world", "start": 436.21, "duration": 2.299}, {"text": "The Soviets who were the boogieman to the West for 20 years were now attempting to storm into Central Europe", "start": 438.79, "duration": 7.07}, {"text": "If that was the case, then what people in Western Europe and America support Hitler or an ideology?", "start": 446.08, "duration": 6.319}, {"text": "They have been opposed to for far longer the fate of Europe fought between two", "start": 452.44, "duration": 5.54}, {"text": "Authoritarian despots these seem like strange events to ponder but the scenario was based on the ideas that both Hitler and Stalin", "start": 458.44, "duration": 7.709}, {"text": "contemplated over during the years of", "start": 466.61, "duration": 2.0}, {"text": "1939", "start": 469.159, "duration": 1.47}, {"text": "1940 a war was going to happen", "start": 470.629, "duration": 2.179}, {"text": "It just depended on small factors for who was going to throw the first punch. This is Cody of altering history of", "start": 473.27, "duration": 7.669}, {"text": "Special thanks to war thunder for sponsoring this video all my friends play war thunder. They really do", "start": 493.88, "duration": 6.049}, {"text": "Always on Steam now you can join them war thunder is realistic free-to-play vehicle combat game", "start": 500.6, "duration": 6.38}, {"text": "It has more than a thousand historically accurate tanks aircraft and ships", "start": 506.98, "duration": 4.5}, {"text": "From the 1930s through to the 90s and that especially means Russian in German", "start": 512.06, "duration": 5.989}, {"text": "It's on PC ps4 and Xbox one. So you don't really have an excuse by dinner either speaking of joining", "start": 518.05, "duration": 6.57}, {"text": "You can actually get a good head start by clicking the link down below", "start": 524.62, "duration": 3.09}, {"text": "You get a free premium tank or aircraft in three days of premium time just for registering", "start": 528.23, "duration": 6.619}, {"text": "So yeah, I'd recommend it. This is Cody of altering history hub", "start": 534.98, "duration": 4.49}]