[{"text": "What's going on Nation? I'm going to demonstrate for you guys how to do a face pull now this exercise", "start": 14.78, "duration": 5.569}, {"text": "It's an isolation exercise. We're gonna be hitting the traps really hard here and what this exercise is also gonna", "start": 20.449, "duration": 6.289}, {"text": "do is help you with doing a lot of movement such as cleans or power cleans now", "start": 26.739, "duration": 4.521}, {"text": "what you're gonna need is a cable machine", "start": 31.26, "duration": 1.239}, {"text": "and a rope and what you want to do is set up your pulley so that it's about chest", "start": 32.509, "duration": 4.7}, {"text": "height or a little bit lower. You don't want to be pulling from too high now although", "start": 37.61, "duration": 5.569}, {"text": "this is an isolation exercise for the traps", "start": 43.18, "duration": 2.61}, {"text": "it's not that easy and it's gonna be a hard to", "start": 45.98, "duration": 2.9}, {"text": "really get those shoulder blades to retract which you guys gonna see in a", "start": 48.88, "duration": 3.03}, {"text": "minute", "start": 51.91, "duration": 0.25}, {"text": "But you're also gonna be hitting a lot of muscles that are used throughout your external rotation of the shoulder", "start": 52.16, "duration": 4.129}, {"text": "Such as your teres major, teres minor posterior delts. Okay guys", "start": 56.6, "duration": 5.27}, {"text": "So what I want you to do is get an overhand grip on the rope take a couple steps back", "start": 62.39, "duration": 4.789}, {"text": "And make sure the shoulders are dropped. You don't want to start up here drop those shoulders", "start": 67.39, "duration": 4.05}, {"text": "Your feet about shoulder width apart and what you're gonna do is you're gonna pull the rope to your face", "start": 72.77, "duration": 5.3}, {"text": "That's why it's called a face pull and as you pull the rope you want to make sure those elbows", "start": 78.07, "duration": 4.92}, {"text": "are always higher than your wrists", "start": 83.06, "duration": 2.0}, {"text": "You don't want them down here, and it doesn't take that much movement to do it, so you really", "start": 85.069, "duration": 4.451}, {"text": "have to focus and pay attention", "start": 89.52, "duration": 1.449}, {"text": "Now once you have that part down and you're able to pull the rope back and keep those elbows nice and high", "start": 91.52, "duration": 6.139}, {"text": "you want to focus on trying to get that", "start": 97.819, "duration": 2.12}, {"text": "retraction in your back and getting those shoulder blades to pinch so come on over here and take a look up", "start": 100.25, "duration": 4.55}, {"text": "I'm gonna pull back", "start": 105.619, "duration": 2.0}, {"text": "and really squeeze those shoulder blades while keeping those elbows higher than the wrists come back forward", "start": 108.11, "duration": 7.819}, {"text": "come back squeeze get those elbows high", "start": 118.129, "duration": 3.32}, {"text": "Just like this. We'll do one more", "start": 122.899, "duration": 2.0}, {"text": "Nice big squeeze", "start": 128.41, "duration": 2.0}, {"text": "shoulder traction", "start": 130.84, "duration": 2.0}, {"text": "Bring it in so that's how you do a face pull.", "start": 133.3, "duration": 3.02}, {"text": "Hope you guys enjoyed this great demonstration video for", "start": 136.84, "duration": 3.06}, {"text": "more information visit us on Scotthermanfitness.com and as always", "start": 139.9, "duration": 4.37}, {"text": "more good stuff coming soon. See you guys", "start": 144.7, "duration": 2.51}]