[{"text": "Okay, I wanted to tell you about the number 2,084.", "start": 0.0, "duration": 3.8}, {"text": "It arises at the end of a little story.", "start": 3.8, "duration": 3.06}, {"text": "This particular one came about on a chessboard.", "start": 7.3, "duration": 5.24}, {"text": "This is a really big chessboard, this is an infinite board.", "start": 12.54, "duration": 3.66}, {"text": "And so I'm going to number the squares. So I'll start off, I'll pick any square,", "start": 16.2, "duration": 3.78}, {"text": "and number it 1. And now we work in a spiral around it.", "start": 21.48, "duration": 3.28}, {"text": "And we number them. It's called a square spiral. And we go around and around and around until we've filled up the whole board.", "start": 24.76, "duration": 5.58}, {"text": "Now what we do is we take a knight, an ordinary chess knight, and we start him off at square number one.", "start": 30.6, "duration": 7.92}, {"text": "And now we look at all the squares that he can jump to. The knight could move from 1 to 12.", "start": 38.52, "duration": 5.48}, {"text": "Or from 1 to 18. The rule is we always go to the smallest square and we can't repeat a square,", "start": 44.4, "duration": 6.86}, {"text": "we have to always go to a new square. So from 1 it looks to me like we could get to 10 - there are 8 squares and 10 is the smallest.", "start": 51.26, "duration": 12.88}, {"text": "So we're going to get a sequence which is the sequence of the squares where the knight goes to.", "start": 64.32, "duration": 6.16}, {"text": "So it starts off at 1, its first move is to the smallest number that it can go to - that it hasn't already been to.", "start": 70.8, "duration": 8.06}, {"text": "So it can go to 10. From 10, aha! It can move back to 3.", "start": 78.86, "duration": 4.52}, {"text": "So 10 goes to 3. So the third term in the sequence is 3.", "start": 83.38, "duration": 4.16}, {"text": "Then from 3 we could go to 6. 6 is obviously the next number.", "start": 88.0, "duration": 5.74}, {"text": "And then 9, 4 - so that's the sequence.", "start": 94.0, "duration": 2.94}, {"text": "We do that forever. It would be nice if we could do it forever.", "start": 97.0, "duration": 4.0}, {"text": "But something strange happens. After we've been going on for a long time, it gets trapped.", "start": 101.0, "duration": 5.02}, {"text": "In fact, after 2,016 steps it gets stuck, it cannot move.", "start": 106.8, "duration": 7.24}, {"text": "Every square, every one of the 8 squares around it that it could move to, it's already been to.", "start": 114.04, "duration": 6.56}, {"text": "So it di- the sequence dies at that point. After 2,016 steps and the last number that it reaches is 2,084.", "start": 120.6, "duration": 11.24}, {"text": "And I have in my notebook here a picture of the spiral. So you can see it starts off here,", "start": 132.36, "duration": 5.6}, {"text": "and the colours, it gets lighter and lighter. It starts off fairly dark and then we have blue and green and yellow.", "start": 139.2, "duration": 9.62}, {"text": "And then it moves around, there are very strange long lines of points where it moves in a straight line, this knight.", "start": 148.82, "duration": 5.98}, {"text": "Moving 2 and 1, 2 and 1 and so on. But eventually it gets to this red dot.", "start": 156.36, "duration": 4.88}, {"text": "And there it gets stuck. All of the 8 squares it could possibly move to it's already visited.", "start": 161.24, "duration": 5.92}, {"text": "(Brady: It's deliciously arbitrary isn't it? And unexpected that it could - you would have that some pattern or system had emerged where)", "start": 167.46, "duration": 7.06}, {"text": "(\"oh, it's gonna go forever now.\" Does that surprise you?)", "start": 174.52, "duration": 3.56}, {"text": "It's wonderful! Yeah, it surprises me! I think it's wonderful! It's uh...yeah, it's a strange sequence.", "start": 178.08, "duration": 5.58}, {"text": "The missing numbers - that's another sequence. So if we look at the ones it doesn't visit there are infinitely many, that's an infinite sequence.", "start": 184.06, "duration": 7.08}, {"text": "And the smallest one it doesn't get to is 961.", "start": 191.14, "duration": 2.7}, {"text": "You can do it with other chess pieces. You can do it with a castle, a rook. You could do it on a chess board of a different shape,", "start": 194.2, "duration": 9.14}, {"text": "you could do it on the kind of chess board that you get if you just - just one quadrant. One quarter of the infinite board.", "start": 203.4, "duration": 10.7}, {"text": "So let's pretend we have our chess board and we number the squares just as we did in the spiral.", "start": 214.4, "duration": 5.5}, {"text": "Here we're going to number them in - along diagonals. More precisely along antidiagonals.", "start": 219.9, "duration": 6.72}, {"text": "2, 3 and so on.", "start": 227.2, "duration": 1.98}, {"text": "(Brady: Then what, same game again?)", "start": 230.22, "duration": 1.62}, {"text": "You play the same game.", "start": 231.84, "duration": 1.2}, {"text": "1, and what's the smallest square it can move to? Well it can only move to 8 or 9 so it has to go the smaller of them.", "start": 233.04, "duration": 6.94}, {"text": "So the sequence goes 1, 8. Now from 8 we could move to some big numbers here,", "start": 240.4, "duration": 6.46}, {"text": "but the smallest number is obviously 6.", "start": 246.86, "duration": 2.36}, {"text": "So 1, 8, 6. And then to 2. And then to 12 it looks like? And so on.", "start": 249.5, "duration": 7.38}, {"text": "So 1, 8, 6, 2, 12. Again, the sequence is finite. At step 2,402 it reaches 1378 and there are no squares it can move to.", "start": 257.26, "duration": 12.76}, {"text": "It dies at that point. Again it's colour coded. It starts off in the corner and as the trajectory moves along the colours get lighter and lighter,", "start": 270.02, "duration": 12.86}, {"text": "and you see that red X there? That's where it gets trapped.", "start": 282.88, "duration": 4.16}, {"text": "(Brady: You love it don't you?)\n- I do.", "start": 287.6, "duration": 2.0}, {"text": "So you can do the same thing with the rook. With a queen it doesn't get stuck, it keeps going.", "start": 293.52, "duration": 5.58}, {"text": "(Brady: Do you play chess?)\n- No. Not any more. I retired. I retired at the age of 14.", "start": 299.1, "duration": 6.12}, {"text": "It was taking up too much time. \n- (So you do this instead?)", "start": 306.2, "duration": 4.8}, {"text": "Well, I didn't start this 'till I was in grad school.", "start": 311.0, "duration": 2.7}, {"text": "Hey everyone. Have a look at this. And this. And how about this?", "start": 315.0, "duration": 6.14}, {"text": "These are just some of the quizzes and puzzles and questions you'll find on Brilliant, which is a sponsor of today's episode.", "start": 321.14, "duration": 6.52}, {"text": "Now I've met some of the people that work at Brilliant. They're real science/math people", "start": 329.12, "duration": 4.1}, {"text": "and they take it really seriously. These courses, these quizzes, these questions they're designing, they're really well thought out.", "start": 333.22, "duration": 6.66}, {"text": "They really think about how to design these in such a way that people like you, who are doing them, are going to be smarter.", "start": 339.88, "duration": 6.6}, {"text": "They really want to change the way you think. Now there's lots of stuff on the Brilliant site that's free.", "start": 346.48, "duration": 4.5}, {"text": "But Numberphile viewers can also get a 20% discount on a premium membership which has got even more good stuff", "start": 351.2, "duration": 7.0}, {"text": "by going to brilliant.org/numberphile. And our thanks to Brilliant for supporting this episode. Why don't you go and check them out. There's also a link down in the description.", "start": 358.6, "duration": 8.84}]