[{"text": "It’s August of the year 1278.", "start": 0.3, "duration": 2.62}, {"text": "The two strongest rulers within the Holy Roman Empire confront one another fourty kilometres north-east of Vienna", "start": 3.06, "duration": 6.6}, {"text": "to finally resolve their five-year-long power struggle.", "start": 9.66, "duration": 3.28}, {"text": "The flower of European knighthood, several thousand of the finest riders on either side,", "start": 13.1, "duration": 4.8}, {"text": "is preparing for the inevitable clash.", "start": 18.06, "duration": 2.08}, {"text": "The decisive battle for hegemony in Central Europe is about to happen.", "start": 20.14, "duration": 5.4}, {"text": "This is video is sponsored by Throne: Kingdom at War!", "start": 26.44, "duration": 3.3}, {"text": "If you enjoy medieval warfare set in a tactical game reminiscent of the classic strategy genre of yesteryear,", "start": 29.74, "duration": 6.36}, {"text": "then we highly recommend you check out, Throne: Kingdom at War.", "start": 36.1, "duration": 4.42}, {"text": "Free to play, Throne: Kingdom at War allows you to forge alliances, gather precious resources", "start": 40.52, "duration": 5.34}, {"text": "and build magnificent cities all in the pursuit of your ultimate goal, your ascension to the throne of the Empire.", "start": 46.02, "duration": 6.08}, {"text": "Build vast armies, research cunning advantages and equip your hero with the means to lead your efforts… to glory.", "start": 52.1, "duration": 7.3}, {"text": "Support our channel - click the link in the description below,", "start": 59.62, "duration": 3.18}, {"text": "join the game and you’ll get a bonus 200 gold and 1 day’s VIP status to spur your conquest!", "start": 63.6, "duration": 8.6}, {"text": "It’s the first half of the year 1261.", "start": 80.28, "duration": 3.04}, {"text": "Ottokar II, King of Bohemia, having achieved a stunning victory in the recent Battle of Kressenbrunn,", "start": 83.44, "duration": 6.78}, {"text": "forces Hungarian King Bela IV to sign an unfavourable peace treaty, awarding control over the Duchy of Styria to Ottokar.", "start": 90.38, "duration": 9.3}, {"text": "Unquestionably, this was a big leap forward for the Bohemian King,", "start": 99.68, "duration": 4.36}, {"text": "who secured his eastern border and strengthened his authority over Austria and Styria.", "start": 104.18, "duration": 5.26}, {"text": "In addition, with papal permission, Ottokar ended his childless marriage with his ageing first wife", "start": 109.62, "duration": 6.68}, {"text": "and married Bela’s young granddaughter Kunigunda, future mother of his legitimate children.", "start": 116.3, "duration": 6.12}, {"text": "Although Ottokar’s latest gains were formally recognized by the incumbent King of the Romans,", "start": 122.66, "duration": 4.72}, {"text": "the Bohemian King was aware that Richard of Cornwall was just a titular ruler of the empire with no real power,", "start": 127.58, "duration": 7.5}, {"text": "but with a serious Castillan opponent on his back, who also claimed the imperial title.", "start": 135.08, "duration": 5.66}, {"text": "Ottokar capitalized on the Great Interregnum within the empire", "start": 140.9, "duration": 3.86}, {"text": "and elevated his already strong position by balancing between two claimants in the subsequent years", "start": 144.88, "duration": 5.98}, {"text": "in order to make sure that by the time of the next election, he himself would be the strongest candidate for the imperial throne.", "start": 150.86, "duration": 8.0}, {"text": "With his ardent expansion policy, on the eve of next decade,", "start": 159.06, "duration": 3.92}, {"text": "Ottokar took advantage of local dynastic disputes and spread farther south acquiring control of Carinthia, Carniola and the Windic March.", "start": 162.98, "duration": 9.42}, {"text": "Yet he didn’t stop there and in 1272 he managed to add the northern Italian region of Friuli to his domain.", "start": 172.62, "duration": 8.18}, {"text": "As a result, Ottokar exercised control over the land stretching from Sudetes Mountains to the Mediterranean Sea,", "start": 181.0, "duration": 7.42}, {"text": "definitely a boast-worthy feat.", "start": 188.42, "duration": 2.84}, {"text": "But this time, serious challenges started presenting themselves.", "start": 191.52, "duration": 4.2}, {"text": "King Bela of Hungary was dead and replaced by his son Stephen,", "start": 195.92, "duration": 3.66}, {"text": "whose attitude towards Ottokar was, to put it mildly, lukewarm.", "start": 199.58, "duration": 4.76}, {"text": "Even though the latter tried to placate his neighbour with a peace treaty,", "start": 204.54, "duration": 3.78}, {"text": "the former heedlessly raided his borderlands until he fell ill and conveniently died,", "start": 208.32, "duration": 5.32}, {"text": "having outlived his father by just two years.", "start": 213.64, "duration": 3.18}, {"text": "It was a particularly eventful year as another noble shuffled off this mortal coil,", "start": 216.82, "duration": 5.18}, {"text": "Richard of Cornwall, the nominal King of the Romans.", "start": 222.0, "duration": 3.34}, {"text": "Inevitably, another imperial election was forthcoming.", "start": 225.46, "duration": 4.52}, {"text": "This was what the Bohemian King had waited for, for a very long time.", "start": 230.3, "duration": 5.14}, {"text": "Being at the apex of his power and prestige Ottokar felt he was an obvious favorite for the imperial throne.", "start": 235.76, "duration": 6.74}, {"text": "But unfortunately for him, the worst-case scenario played out.", "start": 242.64, "duration": 3.64}, {"text": "The electoral princes, dreading that Ottokar had grown too strong,", "start": 246.54, "duration": 4.24}, {"text": "decided to turn down his advances and instead chose a minor count from Swabia – Rudolf of Habsburg,", "start": 251.0, "duration": 7.32}, {"text": "whom they assumed, lacked the strength to single-handedly rule the Empire", "start": 258.5, "duration": 4.62}, {"text": "and also was unable to regain the crown-lands the electors had claimed during the Great Interregnum.", "start": 263.2, "duration": 6.0}, {"text": "Infuriated the King of Bohemia, himself an elector, obviously protested,", "start": 269.66, "duration": 5.62}, {"text": "arguing that the Duke of Bavaria voted as a lay elector in Ottokar’s stead,", "start": 275.28, "duration": 5.02}, {"text": "but the opposition was overwhelming and his efforts to block the election were futile.", "start": 280.56, "duration": 4.7}, {"text": "On the 24th of October 1273, Rudolf of Habsburg was crowned as King of the Romans in Aachen Cathedral", "start": 285.54, "duration": 8.1}, {"text": "thus ending the decades long interregnum period in the Holy Roman Empire.", "start": 293.64, "duration": 5.08}, {"text": "While Rudolf was supposedly meant to be a weak ruler,", "start": 299.24, "duration": 3.2}, {"text": "from the onset he showed signs of a robust politician and able diplomat.", "start": 302.44, "duration": 5.48}, {"text": "Not only had he won papal support by renouncing the imperial rights in Rome", "start": 308.02, "duration": 4.88}, {"text": "and by promising to take part in another crusade to the Holy Land,", "start": 312.9, "duration": 3.5}, {"text": "but more importantly deciding that all lands seized since the death of the last emperor must be returned to the crown.", "start": 316.4, "duration": 7.8}, {"text": "Moreover, he urged the King of Bohemia to come to the Imperial Diet held at Nuremberg and recognise the new king.", "start": 324.48, "duration": 8.88}, {"text": "Rudolf’s action meant that Ottokar had to concede all of his territorial gains over the last twenty years,", "start": 333.94, "duration": 6.06}, {"text": "leaving him with just Bohemia and Moravia.", "start": 340.0, "duration": 3.08}, {"text": "Unsurprisingly, Ottokar refused to do so and was placed under Imperial ban by Rudolf,", "start": 343.08, "duration": 5.98}, {"text": "who declared war on the Bohemian King.", "start": 349.16, "duration": 2.7}, {"text": "Imperial forces besieged Ottokar in Vienna and simultaneously a revolt broke out in Bohemia,", "start": 352.16, "duration": 6.66}, {"text": "all these setbacks eventually compelled Ottokar to yield, sign a treaty recognizing Rudolf as King of the Romans", "start": 358.98, "duration": 7.38}, {"text": "and renounce his claims to lands he had acquired throughout his reign.", "start": 366.5, "duration": 4.56}, {"text": "It was indeed a bitter pill to swallow but Ottokar didn’t give up so easily.", "start": 371.28, "duration": 5.2}, {"text": "He spent the next two years building up his military potential and looking for allies eager to back his cause.", "start": 376.54, "duration": 6.74}, {"text": "Just like twenty years earlier, Brandenburgian and Silesian dukes answered and joined Ottokar’s side.", "start": 383.68, "duration": 6.8}, {"text": "In addition, he bought the support of the Duke of Lower Bavaria,", "start": 390.58, "duration": 3.9}, {"text": "who was employed with the task of delaying the assembly of Rudolf’s army.", "start": 394.48, "duration": 4.88}, {"text": "War preparations were at a peak and the summer campaign of the year 1278 was about to begin.", "start": 399.66, "duration": 5.88}, {"text": "Ottokar’s initial plan was to march directly to Vienna, where Rudolf resided,", "start": 405.96, "duration": 4.9}, {"text": "but the gathering of his troops took significantly longer than expected,", "start": 411.1, "duration": 3.68}, {"text": "so he first attempted to storm two fortresses on the borderlands.", "start": 415.02, "duration": 4.0}, {"text": "When Rudolf heard reports of the enemy’s movements, he decided to march out of the city and set a camp in the open,", "start": 419.42, "duration": 6.66}, {"text": "so the light Cuman cavalry of the allied Hungarian King Ladislaus would have an easier time joining the imperial host.", "start": 426.08, "duration": 7.52}, {"text": "Curiously, Rudolf set a rally point roughly at the place where Ladislaus’ grandfather", "start": 433.92, "duration": 5.46}, {"text": "Bela of Hungary was defeated by Ottokar eighteen years earlier.", "start": 439.38, "duration": 4.34}, {"text": "Thanks to the Czech’s own delays with troop gathering,", "start": 444.18, "duration": 2.82}, {"text": "Rudolf was able to thoroughly examine the surroundings and relocated his camp closer to the battlefield he had chosen,", "start": 447.14, "duration": 7.42}, {"text": "an open plain between the villages of Dürnkrut and Jedenspeigen, a suitable place for a heavy cavalry bout.", "start": 454.64, "duration": 7.62}, {"text": "Eventually, early in the morning of the 26th of August,", "start": 462.8, "duration": 3.82}, {"text": "the Bohemian host arrived in the vicinity and set a camp north of the plain.", "start": 466.68, "duration": 5.36}, {"text": "While both armies counted roughly around 30,000 men each,", "start": 472.18, "duration": 4.02}, {"text": "infantry units were meant to solely guard the camps,", "start": 476.26, "duration": 3.26}, {"text": "while the proper battle, as was the custom,", "start": 479.52, "duration": 2.54}, {"text": "was to be fought between both sides’ mounted units.", "start": 482.06, "duration": 3.8}, {"text": "Several hours after dawn, with the morning sun already quite high on the horizon bathing nearby meadows in light,", "start": 486.2, "duration": 7.02}, {"text": "events were set in motion.", "start": 493.22, "duration": 2.12}, {"text": "Cuman cavalry archers began harassing Bohemian heavy knights forming their battle formation.", "start": 495.34, "duration": 5.64}, {"text": "Unsurprisingly, they were unable to rout Ottokar’s units or cause any major damage,", "start": 501.22, "duration": 5.54}, {"text": "but their plan was more to inflict fatigue and worsen the enemy’s morale.", "start": 506.84, "duration": 4.88}, {"text": "Eventually, the ground trembled as several thousands of mounted knights with their armour blazoned by the August sun", "start": 512.16, "duration": 7.98}, {"text": "charged and clashed with the enemy across the field.", "start": 520.26, "duration": 3.34}, {"text": "The clamour of bent steel, shattered lances and human agony filled the surroundings.", "start": 523.8, "duration": 5.06}, {"text": "Ottokar’s knights were not only more numerous, but also heavier equipped and better trained,", "start": 528.96, "duration": 5.66}, {"text": "which soon became abundantly clear on the battlefield,", "start": 534.7, "duration": 3.76}, {"text": "as Rudolf’s men, despite their efforts, were forced to yield ground.", "start": 538.6, "duration": 4.48}, {"text": "At one point, even the German King was in serious danger,", "start": 543.2, "duration": 3.84}, {"text": "as his horse was killed beneath him and only the swift reaction of his guards saved him from certain death.", "start": 547.04, "duration": 6.54}, {"text": "Three hours into the battle, Ottokar’s forces were winning,", "start": 554.26, "duration": 3.7}, {"text": "although fatigue became a serious problem for his steel-embroiled knights", "start": 558.06, "duration": 4.62}, {"text": "as the summer sun was reaching noon.", "start": 562.8, "duration": 2.54}, {"text": "Rudolf’s units were not in a much better condition, yet the German king had an ace up his sleeve.", "start": 565.6, "duration": 5.58}, {"text": "Horns roared as auxiliary units concealed in the forest and lead by Ulrich von Kapellen", "start": 571.52, "duration": 5.8}, {"text": "emerged from the woods to the west and charged at Ottokar’s unsuspecting right flank.", "start": 577.46, "duration": 5.48}, {"text": "In the 13th century such action was still considered unchivalrous, and not many agreed to fill such a dishonourable role,", "start": 583.3, "duration": 8.36}, {"text": "but the effect of this sudden attack on the weary Bohemian flank was about to turn the tide of the battle.", "start": 591.72, "duration": 6.5}, {"text": "Though surprised, Ottokar reacted immediately and ordered his reserve line to turn back and attack the fresh German troops.", "start": 598.48, "duration": 8.22}, {"text": "However, this manoeuvre was poorly executed", "start": 607.12, "duration": 3.26}, {"text": "and for many of his fatigued knights fighting in the first line it looked like a retreat.", "start": 610.38, "duration": 6.04}, {"text": "Their cohesion started to break, as one by one, Czech cavalrymen lost faith and ran from the battlefield.", "start": 616.92, "duration": 7.0}, {"text": "Rising confusion eventually resulted in an uncoordinated retreat of the Bohemian troops.", "start": 624.14, "duration": 5.9}, {"text": "Many of those who were unable to run were killed in the final phase, among them King Ottokar.", "start": 630.38, "duration": 6.68}, {"text": "Cuman light cavalry pursued their defeated enemy and only increased the death toll.", "start": 637.5, "duration": 5.4}, {"text": "The disastrous Battle on the Marchfeld was Ottokar’s last resort to regain his lands and power", "start": 643.52, "duration": 5.1}, {"text": "through a direct confrontation with German King Rudolf.", "start": 648.62, "duration": 3.4}, {"text": "Being unable to yield, he risked and lost everything.", "start": 652.16, "duration": 3.42}, {"text": "In the immediate aftermath of the battle a period of political and economic turmoil descended on Bohemia,", "start": 655.74, "duration": 5.94}, {"text": "as Ottokar’s son and heir Wenceslaus II was still a minor and virtually served as a puppet for various interests of local aristocracy.", "start": 661.92, "duration": 8.92}, {"text": "The internal crisis lasted for a good portion of the next decade.", "start": 671.02, "duration": 4.2}, {"text": "For Rudolf, the battle was a turning point in his career, as he eliminated his most serious opponent", "start": 675.5, "duration": 6.12}, {"text": "and wisely used the prestigious victory on the Marchfeld to achieve his own political goals", "start": 681.62, "duration": 5.9}, {"text": "and set a solid foundation for the future power of one of the most influential royal dynasties in Europe – the House of Habsburg.", "start": 687.52, "duration": 9.58}]