[{"text": "Which one of us is the best Indiana Jones", "start": 0.02, "duration": 2.0}, {"text": "Oh, Carmichael", "start": 6.86, "duration": 1.22}, {"text": "Hi, I'm the Tom Cruise championship holder Niko Pueringer and I'm here today to test out which one of us is the best Indiana Jones.", "start": 10.26, "duration": 6.9}, {"text": "We all love action movies and everybody thinks they're as cool as Indiana Jones", "start": 17.16, "duration": 3.5}, {"text": "The real question is who's got what it takes to make the cut", "start": 20.66, "duration": 3.3}, {"text": "dont interupt him hes introing the video", "start": 26.58, "duration": 2.58}, {"text": "You know, you just gave me a great Wren,  if you think that you have what it takes", "start": 29.16, "duration": 3.44}, {"text": "let's just make sure that your souls are pure real quick. I think I got a little arc blast prepared for you guys", "start": 32.6, "duration": 4.54}, {"text": "A little Ark of the Covenant blast you just gonna blast you real quick", "start": 37.14, "duration": 2.159}, {"text": "If you melt, then you're out of the competition, but you don't melt then were ready to kick this thing off", "start": 39.3, "duration": 4.29}, {"text": "I don't want to get a sunburn. Hi im Illinois Jones. They call me Oregon Jones Jake come here", "start": 43.59, "duration": 5.819}, {"text": "Actually, my name's not Jake in this video. It's Kentucky Jones. All right, how I become, Indiana?", "start": 49.69, "duration": 4.79}, {"text": "Sure thing Kentucky. If you flinch, open your eyes follow the frame, do anything that shows weakness", "start": 54.66, "duration": 5.52}, {"text": "You are disqualified from entering the competition stand there and bear it for ten seconds. What's happening?", "start": 60.43, "duration": 6.319}, {"text": "You have a pure soul but you lose one point because your  hat fell off", "start": 104.04, "duration": 2.82}, {"text": "All right Wren sorry to say but you lose a point but you're still in the game.", "start": 108.92, "duration": 4.44}, {"text": "Can't be Indiana Jones if you can't whip it. Rules are simple three things on the sawhorse", "start": 113.36, "duration": 3.0}, {"text": "Whoever can knock them all off in the least amount of whips wins. Here's who goes first", "start": 116.46, "duration": 3.86}, {"text": "I knew that was coming", "start": 123.66, "duration": 1.44}, {"text": "Alright 3, 2, 1 Whip", "start": 125.24, "duration": 2.56}, {"text": "Thats Not a Whip", "start": 131.14, "duration": 1.04}, {"text": "Thats Not a whip", "start": 132.64, "duration": 1.46}, {"text": "He said I can whip however I want I can whip up down I can whip to the side I can whip however I want illinois", "start": 134.94, "duration": 6.16}, {"text": "Not Whif it however you want", "start": 141.1, "duration": 1.56}, {"text": "Look at him swing it", "start": 143.46, "duration": 2.0}, {"text": "Back it Up", "start": 149.04, "duration": 1.4}, {"text": "Let me hear that crack", "start": 150.96, "duration": 2.0}, {"text": "It counts I guess, 7", "start": 161.52, "duration": 3.16}, {"text": "He hit the sawhorse which knocked the can over he didn't actually hit the can itself so that counts correct. I'm sorry", "start": 165.76, "duration": 5.12}, {"text": "I've made my rules. You can hit the cans off with real power. You see please I'm not one to tell you. Mr", "start": 170.88, "duration": 5.339}, {"text": "Indiana Jones how to whip his cans Indiana Jones is a creative problem solver coming up with solutions", "start": 176.26, "duration": 6.319}, {"text": "No one else would think of so I have an idea. You have to stay on the carpet, Illinois. Stop. Cheatin, Illinois", "start": 182.58, "duration": 4.9}, {"text": "On the carpet", "start": 188.94, "duration": 2.0}, {"text": "You step off the carpet one more time, I'm gonna deduct a point.", "start": 194.24, "duration": 2.42}, {"text": "Hold this out", "start": 199.82, "duration": 2.0}, {"text": "Barely", "start": 204.74, "duration": 2.0}, {"text": "That's less than you!", "start": 212.74, "duration": 2.0}, {"text": "Oregon, you're up. All right, that's the only way to accomplish this", "start": 216.76, "duration": 4.34}, {"text": "Nailed it! Indie style, baby!", "start": 230.44, "duration": 3.72}, {"text": "That was inventive", "start": 234.16, "duration": 1.9}, {"text": "That's what  I call some Jones-like abilities", "start": 236.06, "duration": 2.32}, {"text": "Was that what you were expecting me to do? Yeah, nice", "start": 238.38, "duration": 2.28}, {"text": "Tie game me and Wrenn. Somehow about that inventiveness", "start": 240.92, "duration": 2.86}, {"text": "Jake caught that whip his fast reactions, he's always observant", "start": 244.04, "duration": 1.99}, {"text": "showed me that he might have the spark of what it takes being Indiana Jones and then Wrenn of course showing that he definitely has the spark of what it", "start": 246.03, "duration": 5.63}, {"text": "Takes to be Indiana Jones by winning the competition. Sam's at 0 right now", "start": 251.66, "duration": 2.8}, {"text": "Hello and welcome to round three of the Tournament of Champions. That's right", "start": 255.75, "duration": 4.309}, {"text": "We're back again", "start": 260.06, "duration": 0.57}, {"text": "And this time to fight for the honor of all honors to represent lady Squarespace", "start": 260.63, "duration": 4.649}, {"text": "If you haven't been watching the last few Tournament of Champions, here's how this works", "start": 265.35, "duration": 3.859}, {"text": "The winner goes to a final tournament where they will face off against three other", "start": 269.449, "duration": 3.779}, {"text": "Contestants for the right to win honor for that brand", "start": 273.66, "duration": 3.709}, {"text": "please leave a comment in this video if you use square space or you sign up because of this video because if either", "start": 277.37, "duration": 5.82}, {"text": "Carmichael and I win in the final tournament of champions we get to pick one person", "start": 283.32, "duration": 4.129}, {"text": "And we get to pay for your Squarespace", "start": 287.699, "duration": 2.3}, {"text": "the only way we're gonna find out who that person is though is if you leave a comment in this video Squarespace", "start": 290.0, "duration": 4.26}, {"text": "Free-for-all the rest of 2019 I'd say that's a pretty good deal", "start": 294.62, "duration": 3.44}, {"text": "Welcome to what month is it? We who are about to die salute you King Sam", "start": 298.08, "duration": 6.3}, {"text": "Wait, why do you have a crown? Because I'm a Duke in another. I'm a Duke in another land", "start": 304.58, "duration": 4.54}, {"text": "Scrap me on my leg", "start": 316.249, "duration": 2.0}, {"text": "Squarespace has an all-in-one platform where you can claim a domain build a website sell online and market your brand", "start": 335.81, "duration": 7.1}, {"text": "On to round 2", "start": 344.81, "duration": 2.0}, {"text": "Squarespace has beautiful designer templates and award-winning 24/7 customer service", "start": 363.53, "duration": 4.94}, {"text": "I knew this thing would pay off sooner or later Squarespace has a fantastic marketing tool", "start": 377.72, "duration": 4.13}, {"text": "So if you need to create a campaign reuse templates check metrics, you can all do that on their site. It's wonderful", "start": 381.85, "duration": 6.69}, {"text": "and go", "start": 389.96, "duration": 2.0}, {"text": "My artery bleeds out", "start": 400.71, "duration": 2.539}, {"text": "Squarespace has an amazing domain experience. You can transfer your third-party domains to Squarespace if you so desire", "start": 409.439, "duration": 7.19}, {"text": "If you want to be a meditating master and win your own axe head over to squarespace.com slash corridor crew get 10% off your first purchase", "start": 417.479, "duration": 6.049}, {"text": "Remember to leave a comment because the Tournament of Champions is gonna be one heck of a ride King Sam. He's definitely gonna be there", "start": 423.87, "duration": 6.229}, {"text": "Indiana Jones's worst nemesis German Nazis", "start": 437.09, "duration": 2.9}, {"text": "Secret German Nazis these three cards I'm going to dish out", "start": 440.51, "duration": 3.14}, {"text": "One of them is the traitor card whoever's the traitor is a secret German Nazi when you are confident shout it out", "start": 443.65, "duration": 5.639}, {"text": "So one's the Nazi the other two are not. You've got it", "start": 449.29, "duration": 3.269}, {"text": "Tom Cruise final answer Tom Cruise final Answer. Budget Adam Savage final answer", "start": 453.5, "duration": 4.55}, {"text": "I'm not the Nazi", "start": 458.86, "duration": 2.0}, {"text": "I\"m not the Nazi", "start": 461.38, "duration": 2.0}, {"text": "I'll spin I commit", "start": 465.16, "duration": 2.0}, {"text": "Hold on Indiana Jones actually never gets this right. So therefore the ones who guessed incorrectly get the point", "start": 468.58, "duration": 5.58}, {"text": "I'ts true, it's true. He never knows who's a Nazi", "start": 478.98, "duration": 2.88}, {"text": "Constantly falling in love with 'em", "start": 481.86, "duration": 1.14}, {"text": "He couldn't even guess the blonde girl in the movie. I literally can't argue that, dang.", "start": 483.0, "duration": 3.56}, {"text": "Jake is in the lead is 2 points. Sam and Wrenn are tied at one point. It's a close game", "start": 487.979, "duration": 3.32}, {"text": "It's time for my favorite game the boulder run challenge", "start": 494.36, "duration": 2.2}, {"text": "We had to harness some cutting-edge technology and really push ourselves to figure out how to simulate the boulder from Indiana Jones", "start": 496.58, "duration": 6.62}, {"text": "That's a boulder right there", "start": 504.84, "duration": 2.0}, {"text": "Dr. Jones, here's the rules", "start": 509.78, "duration": 1.34}, {"text": "This game are simple. Start down here with your hand touching the wall get down there grab the idol make it back", "start": 511.13, "duration": 4.26}, {"text": "Whoever makes it through this doorway in the least amount of time wins", "start": 515.419, "duration": 3.869}, {"text": "The only twist is that there's a boulder that's gonna chase you when you grab the idol. Good luck", "start": 519.39, "duration": 4.19}, {"text": "You guys need some luck. You're the one with the one point", "start": 523.77, "duration": 2.869}, {"text": "Are you guys okay? It just lost control till about here we both went down and I couldn't get the shot Sam was too fast", "start": 540.16, "duration": 6.8}, {"text": "You're up next, Kentucky", "start": 547.4, "duration": 1.18}, {"text": "3 2 1 Go", "start": 548.58, "duration": 2.0}, {"text": "Oh, Carmichael", "start": 557.76, "duration": 2.0}, {"text": "Oh, yeah, I just fear that Wren's gonna get out before that", "start": 564.44, "duration": 2.52}, {"text": "3 2 1 Go", "start": 568.5, "duration": 2.14}, {"text": "Wren, yeah 9.8. Come on Carmichael", "start": 582.3, "duration": 4.26}, {"text": "That means we got a tie game going into the final round here fine little challenge guessing the weight of the idol", "start": 588.77, "duration": 5.359}, {"text": "It's kind of like price is right", "start": 594.13, "duration": 1.17}, {"text": "But instead of the price you're guessing the weight. The thing is get to be as close to possible", "start": 595.3, "duration": 3.809}, {"text": "While being just slightly over because Indiana Jones guesses just slightly too heavy", "start": 599.72, "duration": 4.4}, {"text": "No one may hold the Idol to see how much it weighs they may observe me moving it", "start": 604.12, "duration": 3.39}, {"text": "Tossing it doing whatever with it. Each has filled this bag with rocks to what they think the idol weighs", "start": 608.0, "duration": 5.63}, {"text": "I will put this bag on a scale and measure it", "start": 613.63, "duration": 2.279}, {"text": "After all three have taken a pass and I've gotten the weights of their bag", "start": 616.01, "duration": 2.719}, {"text": "I will then measure the idol in front of all of them and we'll see who got closest you want to be as close as", "start": 618.76, "duration": 5.279}, {"text": "Possible while still being slightly over if you are on or below you lose", "start": 624.04, "duration": 4.36}, {"text": "98.5. I'm supposed to fill this bag", "start": 635.28, "duration": 3.12}, {"text": "That's it yeah Wow, all right, I'm gonna say 520", "start": 642.92, "duration": 5.08}, {"text": "Almost half a kilogram", "start": 648.0, "duration": 1.68}, {"text": "1 pound a nervous system is finely tuned", "start": 649.68, "duration": 3.56}, {"text": "Alright Sam is at 390", "start": 654.75, "duration": 2.599}, {"text": "We have all the measurements bring them in. That look real close", "start": 658.74, "duration": 4.32}, {"text": "Here we go. Whoever wins this wins it all. We're going to measure the weight of the idol if this doesn't balance it", "start": 663.34, "duration": 7.26}, {"text": "Kentucky South", "start": 671.36, "duration": 2.0}, {"text": "Just you and me just you and me this is a 200 gram weight", "start": 678.18, "duration": 3.32}, {"text": "His hat is removed", "start": 683.52, "duration": 2.0}, {"text": "Oh, man", "start": 687.5, "duration": 2.02}, {"text": "Illinois Jones had 390 but if it's 395, he technically doesn't win when three hundred and fifty to sixty two and seven", "start": 697.5, "duration": 7.549}, {"text": "We're at 370", "start": 705.05, "duration": 2.0}, {"text": "And that is just slightly more heavier. Just want to say from this point forward we all know what the true victor is.", "start": 707.48, "duration": 5.669}, {"text": "Precision. Steven Spielberg, you know who to call when you're making the next Indiana Jones movie. It's this guy", "start": 717.12, "duration": 5.27}, {"text": "Stuck me in a fridge", "start": 723.87, "duration": 1.5}, {"text": "For those of you guys who are sad to see Wren walk away", "start": 725.37, "duration": 2.84}, {"text": "Or Jake walk away or Clint not even participate stay tuned for the Tom Cruise and Indiana Jones", "start": 728.34, "duration": 5.209}, {"text": "Host the Jackie Chan special. Who is Jackie Chan?", "start": 733.68, "duration": 3.559}, {"text": "Don't forget to hit that new notification button YouTube has done some little changes to it", "start": 739.68, "duration": 4.22}, {"text": "So you should click on that notification bell. See what happens. Yeah, what does happen? I don't know if I can find out", "start": 743.9, "duration": 5.549}]