[{"text": "I'm sure most of you have been asked the question", "start": 4.48, "duration": 2.21}, {"text": "\"What do you want to be when you grow up?\"", "start": 6.69, "duration": 2.11}, {"text": "And I'm sure half of you have replied with \"Hot and famous of course!\"", "start": 8.8, "duration": 3.7}, {"text": "But later realizing that maybe the world isn't ready for your hotness", "start": 12.6, "duration": 2.98}, {"text": "and that maybe you should reconsider something else.", "start": 15.58, "duration": 2.32}, {"text": "What's worse is that you've probably been asked that very question", "start": 18.0, "duration": 2.56}, {"text": "as early as when you were maybe five years old", "start": 20.56, "duration": 2.72}, {"text": "I remember being five and being asked that and when you were that age,", "start": 23.54, "duration": 3.3}, {"text": "let's be honest you were probably only exposed to a select few jobs:", "start": 26.86, "duration": 3.88}, {"text": "a police officer, a firefighter,", "start": 30.9, "duration": 2.22}, {"text": "an astronaut, a doctor, a princess...", "start": 33.12, "duration": 3.28}, {"text": "I wanted to be a princess, but I figured the world wasn't ready for that, so I said I wanted to be a teacher.", "start": 36.82, "duration": 4.92}, {"text": "As a kid, I thought teachers were an elite level of humans who possessed infinite knowledge.", "start": 42.2, "duration": 4.1}, {"text": "They just know everything there is to know.", "start": 46.34, "duration": 1.76}, {"text": "I wanted their intelligence", "start": 48.22, "duration": 1.3}, {"text": "I respected them", "start": 49.68, "duration": 1.06}, {"text": "and I still do", "start": 50.84, "duration": 0.88}, {"text": "well, most anyway.", "start": 52.08, "duration": 1.46}, {"text": "Some do an amazing job at it, while others like to rely on reading mundane overhead projector notes verbatim", "start": 53.88, "duration": 5.48}, {"text": "and having weekly quizzes pertaining to those notes", "start": 59.44, "duration": 2.34}, {"text": "and you question if there even is an influential teacher present.", "start": 61.88, "duration": 2.9}, {"text": "Because what you're actually doing is just regurgitating data based on memory", "start": 64.82, "duration": 3.76}, {"text": "and not actually learning the practicality of the information you're being exposed to.", "start": 68.64, "duration": 4.32}, {"text": "But yeah, I wanted to be a teacher.", "start": 73.2, "duration": 2.66}, {"text": "but looking back, I think it was only because I didn't know there were thousands of other options", "start": 76.02, "duration": 3.94}, {"text": "that would pique my interest.", "start": 79.96, "duration": 1.18}, {"text": "and I think that's the issue of why a lot of us are stuck wondering what we want to do", "start": 81.34, "duration": 3.66}, {"text": "and feel the pressures of possibly not being able to contribute to the society in the world", "start": 85.0, "duration": 4.74}, {"text": "For a lot of you, your parents might have been a driving factor as to what you've chosen", "start": 89.92, "duration": 3.9}, {"text": "or will choose to be.", "start": 93.82, "duration": 1.439}, {"text": "While some may be the epitome of strict parenting", "start": 95.26, "duration": 2.74}, {"text": "where they try to mold what they want you to become since day one", "start": 98.0, "duration": 2.56}, {"text": "(Asian parents, I'm looking at you)", "start": 100.78, "duration": 1.66}, {"text": "Most are generally content with what you do in life, as long as you don't end up being a bum and", "start": 102.52, "duration": 4.3}, {"text": "amounting to nothing despite the privileges and opportunities available to you.", "start": 106.82, "duration": 3.6}, {"text": "And I can vouch for that.", "start": 110.62, "duration": 1.5}, {"text": "See, both of my parents were born and raised in the third-world country of Philippines", "start": 112.4, "duration": 4.06}, {"text": "They both grew up with eight or so brothers and sisters", "start": 116.46, "duration": 2.72}, {"text": "so you can assume wealth and luxury weren't aspects of their lives", "start": 119.18, "duration": 3.2}, {"text": "But once they were adults,", "start": 122.56, "duration": 1.16}, {"text": "my parents knew they had to leave the country in search of a better life for themselves and their future children.", "start": 123.72, "duration": 4.76}, {"text": "I've mentioned before that I lived in Saudi Arabia for a few years,", "start": 128.74, "duration": 2.92}, {"text": "but that was just a stepping stone for moving to Canada.", "start": 131.66, "duration": 2.22}, {"text": "Actually, my parents were deciding between Canada and Australia and they chose the former.", "start": 134.02, "duration": 4.38}, {"text": "Can you imagine an Aussie Domics?", "start": 139.06, "duration": 1.62}, {"text": "Here's my attempt at offending the Australian accent.", "start": 141.26, "duration": 3.08}, {"text": "*clears throat*", "start": 144.38, "duration": 2.14}, {"text": "Crikey, the bum! A bloody good thing I reckon, mate!", "start": 147.08, "duration": 3.98}, {"text": "Sorry.", "start": 151.96, "duration": 0.7}, {"text": "But yeah, we moved to Canada, and being able to experience the immigration process with them", "start": 152.98, "duration": 4.54}, {"text": "in retrospect, I can appreciate their efforts for seeking a better lifestyle", "start": 157.74, "duration": 3.72}, {"text": "and I think a lot of second and third generation kids are just unaware of how good we have it.", "start": 161.62, "duration": 4.42}, {"text": "Our parents literally left the homeland of family and friends", "start": 166.18, "duration": 3.26}, {"text": "left the lifestyle that they grew up with", "start": 169.54, "duration": 1.96}, {"text": "to go to another land where they had to start over.", "start": 171.68, "duration": 2.56}, {"text": "A new and different land where they weren't necessarily familiar with the language and culture", "start": 174.44, "duration": 4.22}, {"text": "but are willing to adapt for a better life for their children.", "start": 178.66, "duration": 2.96}, {"text": "My parents probably had less than half of the privileges I had growing up.", "start": 181.68, "duration": 3.74}, {"text": "As an adult now, I understood why my parents were so strict towards my sisters and I to focus on our studies.", "start": 185.56, "duration": 5.56}, {"text": "Because there are way more career opportunities here than there were back in the homeland.", "start": 191.16, "duration": 3.76}, {"text": "It was their way of telling us that if we worked hard enough,", "start": 195.14, "duration": 2.48}, {"text": "we could be successful and live comfortably.", "start": 197.62, "duration": 2.32}, {"text": "Not necessarily become rich, but not have to face the struggles of potential poverty as it was back home.", "start": 199.98, "duration": 6.0}, {"text": "So I understood my parents concerns when I came home with a bad grade on a test,", "start": 206.16, "duration": 3.86}, {"text": "and they were probably like", "start": 210.08, "duration": 0.96}, {"text": "\"Shit, did we come all the way here for nothing?\"", "start": 211.04, "duration": 2.14}, {"text": "A little harsh and exaggerated, but I wouldn't blame them if they actually thought that.", "start": 213.52, "duration": 4.26}, {"text": "A little self-awareness for y'all who think your parents don't love ya", "start": 217.92, "duration": 3.06}, {"text": "I've mentioned before how my parents kind of discouraged my ambition to become an artist,", "start": 221.16, "duration": 3.86}, {"text": "and how we met halfway when they let me study architecture.", "start": 225.02, "duration": 2.9}, {"text": "It seemed unfair at the time, yes,", "start": 228.24, "duration": 1.98}, {"text": "but I understood their perspective and preconceived notion of the starving artist.", "start": 230.22, "duration": 4.64}, {"text": "As excited as I was to design structures, my passion for the field diminished over time.", "start": 234.98, "duration": 4.56}, {"text": "But my fear of disappointing my parents was greater than that,", "start": 239.54, "duration": 3.08}, {"text": "and so I went through my four-year Bachelor's program", "start": 242.98, "duration": 2.94}, {"text": "graduated, got my degree, and then did jack shit with it", "start": 246.16, "duration": 3.6}, {"text": "After a while, I realized I needed to find another option", "start": 249.94, "duration": 3.08}, {"text": "I felt that my parents would understand if I chose an alternative if I really didn't enjoy what I was doing", "start": 253.1, "duration": 5.18}, {"text": "I started Domics as a webcomic series during my third year of university,", "start": 258.4, "duration": 3.86}, {"text": "and used it as an outlet for the stress I had from school.", "start": 262.26, "duration": 2.68}, {"text": "Once I graduated, I postponed getting an architecture career to pursue being an animator on YouTube", "start": 265.34, "duration": 5.06}, {"text": "I'll admit the first couple of paychecks were pretty bad and was less than what I earned with my part-time job", "start": 270.66, "duration": 5.1}, {"text": "which I quit in order to focus on my videos.", "start": 275.86, "duration": 2.56}, {"text": "I had architecture as a plan B, even though I studied it for four years.", "start": 278.86, "duration": 3.76}, {"text": "My parents were a little concerned with what I was doing since being a Youtuber didn't sound like a normal job to them", "start": 282.86, "duration": 5.74}, {"text": "and even for some of you watching", "start": 288.72, "duration": 1.8}, {"text": "Apparently, I don't have a \"real\" job", "start": 290.78, "duration": 1.72}, {"text": "so I guess I've just been feeding myself and paying the bills with Monopoly money...", "start": 292.5, "duration": 3.52}, {"text": "On the bright side, at least your mother accepts it as payment.", "start": 296.6, "duration": 2.66}, {"text": "But I was fortunate enough that my parents remained patient with me because I assured them that I'd become", "start": 300.48, "duration": 4.16}, {"text": "successful as long as they gave me time.", "start": 304.64, "duration": 2.5}, {"text": "and they did", "start": 307.52, "duration": 0.6}, {"text": "after my channel grew a bit", "start": 308.58, "duration": 1.36}, {"text": "I showed them my earnings, and they were like", "start": 309.94, "duration": 1.82}, {"text": "\"yeah yeah, okay", "start": 311.86, "duration": 1.16}, {"text": "you can do what you want\"", "start": 313.02, "duration": 1.12}, {"text": "Becoming a Youtuber opened my eyes towards what people can actually do for a living", "start": 314.4, "duration": 3.98}, {"text": "While traditional jobs still exist,", "start": 318.42, "duration": 2.14}, {"text": "new and unique jobs have flourished with the advances in technology and worldwide network.", "start": 320.56, "duration": 4.6}, {"text": "Tools and information are much more accessible now,", "start": 325.36, "duration": 2.32}, {"text": "and allow us to achieve things on our own that may have been more difficult a decade ago", "start": 327.68, "duration": 3.96}, {"text": "People asked me what school I went to or where I went to learn animation, but the truth is I'm self-taught.", "start": 331.82, "duration": 5.64}, {"text": "I mean I've been drawing and keeping my artistic passion intact my whole life,", "start": 337.72, "duration": 3.1}, {"text": "but specifically learning animation was an independent effort.", "start": 340.84, "duration": 3.3}, {"text": "I use Adobe Flash", "start": 344.38, "duration": 1.22}, {"text": "(I know it's - it's \"Animate\" now)", "start": 345.6, "duration": 2.18}, {"text": "for my animations", "start": 347.78, "duration": 1.42}, {"text": "and so I looked up tutorials on how to use the software", "start": 349.22, "duration": 2.8}, {"text": "combined with the knowledge I got from friends who were already more experienced than I", "start": 352.24, "duration": 3.52}, {"text": "animating became easier the more I did it", "start": 355.94, "duration": 1.9}, {"text": "If you look back and compare the quality of my first few videos to my current,", "start": 358.18, "duration": 3.38}, {"text": "you can tell that there's been improvement", "start": 361.66, "duration": 1.92}, {"text": "(or at least I'd like to believe so)", "start": 363.62, "duration": 1.78}, {"text": "Anyway, my point is that it's okay to not know what you want to be when you grow up", "start": 365.68, "duration": 3.88}, {"text": "and if you're already an adult", "start": 369.56, "duration": 1.58}, {"text": "It's still okay to be unsure as long as you have the drive to do something, anything.", "start": 371.14, "duration": 4.8}, {"text": "I wasn't even sure what I wanted to do for a living until I was already doing it", "start": 376.12, "duration": 3.68}, {"text": "I did consider being an animator as an adolescent because of all the cartoons and anime that I watched", "start": 380.12, "duration": 4.74}, {"text": "but I would have never guessed I'd end up here being a full-time YouTuber", "start": 385.12, "duration": 3.84}, {"text": "Despite having studied something completely different from animation", "start": 389.18, "duration": 2.94}, {"text": "I probably wouldn't go back and tell my five-year-old self to change my history.", "start": 392.18, "duration": 3.82}, {"text": "despite all the struggles, I think it was necessary to make me who I am today...", "start": 396.14, "duration": 3.88}, {"text": "A bloody wanker", "start": 401.3, "duration": 1.3}, {"text": "Actually, as a kid, what I really wanted to be when I grew up was become a Super Saiyan", "start": 407.3, "duration": 3.98}, {"text": "Which... you can't do unless you're a normal Saiyan first", "start": 411.64, "duration": 3.58}, {"text": "which you can't really work towards and can only be passed down by bloodline", "start": 415.58, "duration": 4.48}, {"text": "aw....", "start": 421.0, "duration": 0.52}, {"text": "But at least I can enjoy watching the sequel series of my childhood anime, Dragon Ball Super", "start": 422.42, "duration": 4.22}, {"text": "and you can as well! ad-free", "start": 426.64, "duration": 2.08}, {"text": "professionally subbed and in full HD", "start": 428.78, "duration": 1.98}, {"text": "if you head over to crunchyroll.com/domics", "start": 430.76, "duration": 2.78}, {"text": "link in the description", "start": 433.54, "duration": 1.28}, {"text": "and trying a premium membership for 30 days", "start": 434.82, "duration": 2.64}, {"text": "You'll be able to find tons of other anime, manga, and drama titles as well", "start": 437.52, "duration": 4.12}, {"text": "If overpowered humans and aliens pummeling each other 'ain't yo thing', I hear Yuri on Ice is getting epic", "start": 441.7, "duration": 5.4}, {"text": "so maybe I'll give that a shot.", "start": 447.1, "duration": 1.86}, {"text": "Again that's crunchyroll.com/domics - link below!", "start": 448.96, "duration": 3.9}, {"text": "Enjoy!", "start": 453.08, "duration": 0.76}]