[{"text": "This video was made possible by Brilliant: math and science done right.", "start": 0.0, "duration": 3.44}, {"text": "Keep watching until the end of the video to learn how you can get 20% off the annual premium subscription!", "start": 3.94, "duration": 6.8}, {"text": "Washington's butt was sufficiently kicked (not licked), winter was here, his troops' morale was low, some just up and left.", "start": 10.86, "duration": 5.58}, {"text": "Washington needed to do something; anything, to restore faith in the revolution.", "start": 16.44, "duration": 3.74}, {"text": "The British had spread throughout New Jersey and settled in for a winter of drinking cider and partying hard.", "start": 20.18, "duration": 4.28}, {"text": "Nobody expected an attack in the winter,", "start": 24.46, "duration": 1.88}, {"text": "so Washington started making plans for an attack in the winter. (Of course he did, He's George Washington.)", "start": 26.34, "duration": 2.609}, {"text": "The British had hired a large force of Hessian mercenaries from the German states of Hesse-Kassel and Hesse-Hanau to fight the rebels.", "start": 28.949, "duration": 5.67}, {"text": "It was these mercenaries that were stationed across the Delaware River from Washington and his army.", "start": 34.62, "duration": 4.06}, {"text": "And there were more Hessian reinforcements incoming, but they made an unscheduled stop because their commander got thirsty.", "start": 38.68, "duration": 4.849}, {"text": "No, not that kind of thirsty,", "start": 43.529, "duration": 1.211}, {"text": "that kind of thirsty. ;)", "start": 45.14, "duration": 0.88}, {"text": "It was Christmas Eve with a blizzard outside when Washington heard the Hessian defenses were down and he decided to attack. (Again, it's George Washington.)", "start": 46.02, "duration": 5.3}, {"text": "He made a perilous crossing of the icy Delaware River", "start": 51.34, "duration": 2.86}, {"text": "with 2,400 men and marched nine miles to Trenton,", "start": 54.2, "duration": 2.54}, {"text": "where he caught the Hessian forces completely off-guard.", "start": 56.74, "duration": 2.5}, {"text": "After a short, but fierce battle the Hessian surrendered in droves.", "start": 59.24, "duration": 3.01}, {"text": "It was a much-needed victory that sent a clear message, not only to the British,", "start": 62.25, "duration": 3.51}, {"text": "but to Americans across the colonies; the war was far from lost.", "start": 65.76, "duration": 3.56}, {"text": "General Cornwallis led the British forces South to counter-attack the Americans, but in a series of battles,", "start": 69.32, "duration": 4.66}, {"text": "Washington's defensive positioning and flanking maneuvers defeated the British three times in ten days, (There's a taste of 'Murica for you.)", "start": 73.98, "duration": 4.62}, {"text": "and the British decided to abandon Southern New Jersey for the rest of the winter.", "start": 78.6, "duration": 3.38}, {"text": "Washington finally set up a winter camp in Morristown, but for the Americans, there was much less partying than the British.", "start": 81.98, "duration": 5.28}, {"text": "Elsewhere, the British had taken Newport, Rhode Island because it was a good naval base.", "start": 87.3, "duration": 3.52}, {"text": "In the South, they failed to take Charleston, South Carolina,", "start": 90.82, "duration": 1.94}, {"text": "which left British loyalists unsupported and vulnerable to more harassment, and even mass expulsion.", "start": 92.76, "duration": 5.04}, {"text": "Congress sent Benjamin Franklin to France on a mission to convince them to join the war.", "start": 97.84, "duration": 3.62}, {"text": "And while the French generally loved any opportunity to hoodwink the Brits,", "start": 101.46, "duration": 3.26}, {"text": "they didn't want to join unless it was a sure win. (That coward)", "start": 104.72, "duration": 1.92}, {"text": "So, for now, Franklin spent his days chilling out and chasing tail. (Really, Ben?)", "start": 106.649, "duration": 3.011}, {"text": "The British Parliament couldn't believe the war wasn't over yet, and the pressure was on to end it.", "start": 109.66, "duration": 3.44}, {"text": "So the British came up with a plan;", "start": 113.1, "duration": 1.48}, {"text": "General Burgoyne in Montréal and General William Howe in New York would advance", "start": 114.76, "duration": 3.48}, {"text": "through the Hudson Valley and meet in the middle,", "start": 118.24, "duration": 1.62}, {"text": "splitting the colonies in two, and thus screwing over the American communication lines.", "start": 119.86, "duration": 3.78}, {"text": "Burgoyne began his movement South and after taking Fort Ticonderoga quite easily,", "start": 123.64, "duration": 3.46}, {"text": "he then came across heavy American resistance.", "start": 127.1, "duration": 2.26}, {"text": "So he sent Howe a dingle-dongle, asking if he'd be showing up anytime soon.", "start": 129.36, "duration": 3.1}, {"text": "Meanwhile, Howe completely abandoned the plan and gone for all-out personal glory by capturing the American capital, Philadelphia.", "start": 132.48, "duration": 5.04}, {"text": "He defeated Washington and his army at Brandywine Creek by using the old hit-him-with-a-decoy-and-flank-him-from-behind tactic,", "start": 137.52, "duration": 5.36}, {"text": "and Philadelphia was now in British hands, forcing Congress to escape to York. (Oof rekt)", "start": 142.92, "duration": 3.74}, {"text": "But Burgoyne was left on his own to face the ever-increasing American force in Saratoga.", "start": 146.66, "duration": 3.82}, {"text": "American General Horatio Gates teamed up with our old friend Benedict Arnold to deal one final blow to Burgoyne's army.", "start": 150.85, "duration": 5.089}, {"text": "Arnold wanted to take the fight to the British, but Gates wanted to wait for the British to come to them.", "start": 156.0, "duration": 3.9}, {"text": "After a heated debate, Gates, the senior officer, told Arnold to go to his room,", "start": 159.9, "duration": 3.56}, {"text": "but Arnold defied his orders and at the Battle of Bemis Heights, he charged at the British, and obliterated them.", "start": 163.46, "duration": 4.34}, {"text": "Great job, Horatio! By the way, what happened to that other guy who was in Saratoga?", "start": 167.8, "duration": 3.54}, {"text": "Who?", "start": 171.34, "duration": 0.5}, {"text": "Benedict Arnold.", "start": 171.84, "duration": 0.82}, {"text": "Never heard of him.", "start": 172.66, "duration": 0.84}, {"text": "Ouch. (So sad, Alexa play Despacito)", "start": 173.76, "duration": 0.5}, {"text": "Hey, George.", "start": 175.24, "duration": 0.8}, {"text": "Didn't I do a great job?", "start": 176.42, "duration": 1.12}, {"text": "Taking Philadelphia and all?", "start": 177.82, "duration": 1.26}, {"text": "Hmm?", "start": 179.76, "duration": 0.5}, {"text": "Didn't I-", "start": 180.84, "duration": 0.5}, {"text": "You're fired. (lol)", "start": 181.34, "duration": 0.5}, {"text": "Both Burgoyne and Howe returned to Great Britain, leaving British General Henry Clinton to take charge of the war.", "start": 181.84, "duration": 4.7}, {"text": "And the war was about to take a nasty turn, because with the victory at Saratoga,", "start": 186.54, "duration": 3.16}, {"text": "the French were finally ready to join the Americans.", "start": 189.7, "duration": 2.12}, {"text": "Alright Benny, we're in.", "start": 191.87, "duration": 1.47}, {"text": "Hey, isn't this kind of funny?", "start": 193.34, "duration": 1.18}, {"text": "You know, 'cause you're a republic trying to overthrow an absolute monarchy,", "start": 194.52, "duration": 2.78}, {"text": "and I'm an absolute monarchy helping you?", "start": 197.3, "duration": 1.67}, {"text": "Like,", "start": 198.97, "duration": 0.57}, {"text": "like could you imagine if your revolution inspired my people to revolt against me?", "start": 199.76, "duration": 3.22}, {"text": "And then they imprison me and all my family?", "start": 203.28, "duration": 1.44}, {"text": "And they chopped all of our heads off?", "start": 205.0, "duration": 1.0}, {"text": "(lol shut up)", "start": 206.0, "duration": 0.5}, {"text": "Could you imagine?", "start": 206.66, "duration": 0.66}, {"text": "That's called foreshadowing!", "start": 209.58, "duration": 0.98}, {"text": "For now, in America, winter was here once again, which meant yet more disease, more starvation,", "start": 210.98, "duration": 4.42}, {"text": "and even a little mutiny.", "start": 215.4, "duration": 1.1}, {"text": "After losing Philadelphia, Washington's job was again on the line.", "start": 216.5, "duration": 3.2}, {"text": "But suddenly, a Prussian guy with a very fancy name, hired by Benjamin Franklin, showed up out of nowhere and said,", "start": 219.72, "duration": 4.82}, {"text": "\"Hey, I'm here to give your man a European military training.\"", "start": 224.54, "duration": 2.84}, {"text": "And train them, he did! They learned how to shoot accurately, how to march in formation,", "start": 227.38, "duration": 3.56}, {"text": "where to poop and where not to, and strict punishments were handed out to any who didn't comply.", "start": 230.94, "duration": 4.2}, {"text": "Washington's army came out of the winter in 1778 a new and improved force,", "start": 235.18, "duration": 3.8}, {"text": "ready to take Philadelphia back from the British.", "start": 238.98, "duration": 2.08}, {"text": "In the end though, they didn't have to.", "start": 241.06, "duration": 1.56}, {"text": "With the French entry into the war, the British ordered General Clinton to evacuate Philadelphia,", "start": 242.62, "duration": 3.82}, {"text": "and consolidate all of the British forces in New York.", "start": 246.44, "duration": 2.499}, {"text": "So Washington sent Benedict Arnold to reoccupy and secure the city,", "start": 248.94, "duration": 3.18}, {"text": "as he pursued the British through New Jersey on land, eventually finding a good opportunity to attack at Monmouth Courthouse.", "start": 252.12, "duration": 5.4}, {"text": "The battle took place on a sweltering hot summer's day, and as many soldiers died from heatstroke as they did from battle.", "start": 257.52, "duration": 5.4}, {"text": "In the end, after some incompetent/borderline treason from Washington's second-in-command,", "start": 262.92, "duration": 4.0}, {"text": "it was a draw, and in this war a draw is kind of a victory for the Americans.", "start": 266.92, "duration": 4.06}, {"text": "Next up, let's talk about this guy.", "start": 270.98, "duration": 1.9}, {"text": "This is John Paul Jones. John Paul Jones is handsome, Scottish, and absolutely insane.", "start": 272.88, "duration": 4.36}, {"text": "When the war first broke out, everyone was like,", "start": 277.24, "duration": 1.94}, {"text": "\"How do the colonies expect to stand up to the might of the British Navy with their meager fleet of converted merchantme-\"", "start": 279.18, "duration": 3.92}, {"text": "Yep, try telling that to John Paul Jones.", "start": 283.11, "duration": 1.55}, {"text": "This guy sailed to the British Isles, somehow captured a British ship off the coast of Ireland, and brought it back to France.", "start": 284.66, "duration": 4.7}, {"text": "Then he returned, attacking more ships, raiding towns, and evading capture the entire time.", "start": 289.36, "duration": 4.3}, {"text": "These are basically pirate tactics, but hey, if it works, it works.", "start": 293.66, "duration": 3.82}, {"text": "In one incident, he captured a British ship and returned to a Dutch port without an official ensign, because his was lost during the battle.", "start": 297.66, "duration": 5.9}, {"text": "That's a big no-no, and can have you arrested as a pirate.", "start": 303.57, "duration": 2.57}, {"text": "The Dutch helped him out by quickly creating a design based on Benjamin Franklin's description of what the American flag should look like,", "start": 306.14, "duration": 4.88}, {"text": "and they entered it into their records as an official U.S. flag.", "start": 311.02, "duration": 2.7}, {"text": "What they came up with looks pretty cool!", "start": 313.72, "duration": 1.58}, {"text": "The whole campaign probably played heavily on British morale,", "start": 315.3, "duration": 2.3}, {"text": "and brought into question their ability to win the war.", "start": 317.6, "duration": 2.08}, {"text": "And, Fun Fact, he was so cool that one of the towns he raided in 1778 gave him an official honorary pardon in 1999.", "start": 319.7, "duration": 6.24}, {"text": "Keep rippin' in heaven, John Paul Jones. You're an angel now.", "start": 325.94, "duration": 3.24}, {"text": "What the Continental Navy was lacking resources, though, the French entry into the war made up for.", "start": 329.18, "duration": 4.24}, {"text": "The French began with naval skirmishes in the English Channel, and they sent a large fleet to America,", "start": 333.42, "duration": 4.14}, {"text": "although it sustained a lot of damage in a storm off Rhode Island.", "start": 337.56, "duration": 2.4}, {"text": "The Americans were hoping for a bigger commitment from the French,", "start": 340.02, "duration": 2.44}, {"text": "so John Adams went to France to help Benjamin Franklin continue negotiations.", "start": 342.46, "duration": 3.08}, {"text": "Oh good. You're finally here. Check this out. Hey ladies. I'd like to fight you like a kite, cuz you're electrifying!", "start": 345.54, "duration": 6.08}, {"text": "Isn't this great?", "start": 352.21, "duration": 0.99}, {"text": "Is this...", "start": 353.2, "duration": 0.76}, {"text": "Is this what you've been doing?", "start": 354.3, "duration": 1.04}, {"text": "Yeah, why?", "start": 355.34, "duration": 1.08}, {"text": "We were sent here on a diplomatic mission to secure military support from France, not to philander with the locals.", "start": 356.7, "duration": 4.46}, {"text": "Wait, no, ladies come back! Ugh...", "start": 361.16, "duration": 2.12}, {"text": "Worst. Wingman. Ever.", "start": 364.72, "duration": 0.94}, {"text": "But the Americans would get some more help; the Dutch provided aid, although they never formed an official alliance.", "start": 367.62, "duration": 4.38}, {"text": "More significantly though, the Spanish, who had already been providing aid officially joined the war in June 1779.", "start": 372.0, "duration": 5.54}, {"text": "They would provide support in the Midwest and the Gulf Coast,", "start": 377.54, "duration": 2.7}, {"text": "campaigns that heavily impacted the Native American tribes in those areas.", "start": 380.24, "duration": 3.12}, {"text": "Both sides actually enlisted the help of Native American tribes throughout the war,", "start": 383.38, "duration": 3.4}, {"text": "sometimes even pitting those tribes against each other.", "start": 386.78, "duration": 2.16}, {"text": "In the summer of 1779, after a series of raids against the Americans by the Iroquois,", "start": 389.0, "duration": 4.42}, {"text": "Washington organized an expedition that burned down more than 40 villages,", "start": 393.42, "duration": 3.44}, {"text": "forcing the tribes to relocate to Canada for British protection.", "start": 396.86, "duration": 3.0}, {"text": "And another group that shouldn't go unmentioned were African Americans, both free and enslaved.", "start": 399.86, "duration": 5.12}, {"text": "They joined both sides of the war, hoping to gain their freedom,", "start": 404.98, "duration": 2.76}, {"text": "but afterwards, many were simply returned to slavery, particularly those who had fought for the Americans.", "start": 407.74, "duration": 5.56}, {"text": "Despite owning slaves himself, Jefferson had written a condemnation of slavery in the Declaration of Independence,", "start": 413.3, "duration": 5.5}, {"text": "but out of fear of offending the southern colonies, this was removed from the final draft.", "start": 418.8, "duration": 3.92}, {"text": "For the same reason, the American Army stopped enlisting African American men in 1775,", "start": 422.72, "duration": 4.36}, {"text": "a policy that Washington, a slave owner himself, supported.", "start": 427.08, "duration": 3.76}, {"text": "But they were forced to reverse the policy after the British promised freedom to any slaves who joined them.", "start": 430.84, "duration": 4.4}, {"text": "In general, you stood a better chance of gaining freedom if you fought for the British.", "start": 435.24, "duration": 3.9}, {"text": "However, even those that left with the British after the war suffered mistreatment and discrimination in their new lives outside of America.", "start": 439.14, "duration": 6.34}, {"text": "Our good friend Benedict Arnold is now in charge of Philadelphia, having a good time, partying down with,", "start": 445.9, "duration": 3.98}, {"text": "and even marrying a member of the Philadelphia elite,", "start": 449.88, "duration": 2.7}, {"text": "the same elite that had partied down with the British when they controlled the city, and suddenly the people of Philadelphia,", "start": 452.58, "duration": 5.04}, {"text": "including the state governor, started accusing Arnold of having pro-British sentiments.", "start": 457.62, "duration": 3.52}, {"text": "To keep the people happy, Washington wrote a letter rebuking Arnold, calling his conduct imprudent and improper,", "start": 461.14, "duration": 5.3}, {"text": "and that was too many ouchies for Benedict Arnold to handle.", "start": 466.44, "duration": 2.86}, {"text": "He asked Washington to put him in charge of the fort at West Point,", "start": 469.3, "duration": 2.699}, {"text": "then he contacted the British, offering to hand the plans of the fort over to them and join their side.", "start": 472.0, "duration": 4.42}, {"text": "Our good friend Benedict Arnold is our good friend no more.", "start": 476.8, "duration": 3.4}, {"text": "Luckily, the treasonous plans were discovered on a captured British officer,", "start": 480.44, "duration": 2.86}, {"text": "but Arnold managed to escape before he was arrested.", "start": 483.3, "duration": 2.54}, {"text": "As a British Brigadier General, he would go on to lead raids against American cities, most notably his rate of Richmond, Virginia in 1781.", "start": 485.84, "duration": 6.64}, {"text": "His betrayal shook George Washington, who had once again set up camp at Morristown.", "start": 492.48, "duration": 3.56}, {"text": "His leadership somehow held the Continental Army together through the harshest winter of the war.", "start": 496.04, "duration": 4.72}, {"text": "We're entering 1780, and Parliament was hopping mad that the war still wasn't over.", "start": 500.86, "duration": 4.0}, {"text": "The British debt was soaring, and despite taking parts of Massachusetts in late 1779, the North was in a stalemate.", "start": 504.86, "duration": 5.04}, {"text": "So the British decided to make a major shift in strategy to the South, an economically rich area with a higher level of support for the British.", "start": 509.92, "duration": 6.72}, {"text": "Or so the British thought.", "start": 516.64, "duration": 1.2}, {"text": "A year earlier, they had captured the under-defended city of Savannah, Georgia easily,", "start": 517.84, "duration": 3.42}, {"text": "and a joint American French counter-siege failed.", "start": 521.26, "duration": 2.16}, {"text": "Now, they laid siege to Charleston, South Carolina.", "start": 523.42, "duration": 2.68}, {"text": "It fell within months, with thousands of American troops surrendering to the British, a costly defeat.", "start": 526.1, "duration": 4.58}, {"text": "The British quickly moved to take control, and they sent stereotypical Hollywood villain with a British accent Bannister \"the Butcher\" Tarleton into the back country,", "start": 531.42, "duration": 6.2}, {"text": "where he hunted down rebels and destroyed them with ruthless brutality.", "start": 537.62, "duration": 3.06}, {"text": "The British presence also inspired local loyalist militias in the back country to rise up against their persecutors.", "start": 540.68, "duration": 5.26}, {"text": "The British really seemed to be onto something with their new strategy, and the ball was very much in Washington's court.", "start": 545.94, "duration": 4.72}, {"text": "I'm gonna send my most loyal general, Nathanael Greene, to the south to stop the British.", "start": 550.66, "duration": 4.0}, {"text": "Gonna have to overrule you there, George.", "start": 554.66, "duration": 1.68}, {"text": "We're sending Hero of Saratoga and your biggest rival, Horatio Gates.", "start": 556.34, "duration": 3.02}, {"text": "Watch this, George. I'm gonna save the day again, everybody will love me, and I'm gonna get your job.", "start": 559.36, "duration": 3.9}, {"text": "Here I go!", "start": 563.26, "duration": 0.62}, {"text": "And he got into one battle with Cornwallis, got annihilated, and ran away.", "start": 563.88, "duration": 3.28}, {"text": "Alrighty. Let's go with your guy.", "start": 567.54, "duration": 1.42}, {"text": "Nathaniel Greene knew the British outnumbered his own forces, and wouldn't be defeated with conventional tactics.", "start": 568.96, "duration": 4.18}, {"text": "So he had to think outside the box.", "start": 573.14, "duration": 1.4}, {"text": "He split his army into two, said \"Hey, Big Boy, look at me!\"", "start": 574.54, "duration": 3.08}, {"text": "and then they went running in two different directions", "start": 577.62, "duration": 1.56}, {"text": "Cornwallis sent Tarleton after Morgan, and he caught up with him at Cowpens, where Morgan proceeded to kick Tarleton's butt.", "start": 579.4, "duration": 5.12}, {"text": "Then the two led Cornwallis on a wild chase through North Carolina,", "start": 584.52, "duration": 2.96}, {"text": "his bigger and better equipped army, much heavier and slower than Greene's quick and mobile troops.", "start": 587.48, "duration": 4.04}, {"text": "Greene led Cornwallis further and further from his supply line, then crossed the Dan River into Virginia,", "start": 591.52, "duration": 4.8}, {"text": "picked up some reinforcements, and turned back to face the now exhausted British.", "start": 596.32, "duration": 3.86}, {"text": "At the Battle of Guilford Courthouse, the two sides engaged in vicious close combat.", "start": 600.18, "duration": 3.76}, {"text": "Cornwallis, fearing loss, fired his big guns into the chaotic fighting, cutting down many of his own men.", "start": 603.94, "duration": 4.46}, {"text": "Greene retreated, giving Cornwallis the victory,", "start": 608.4, "duration": 1.88}, {"text": "but Cornwallis lost a quarter of his men in the fighting, so it felt much more like a British defeat.", "start": 610.28, "duration": 4.0}, {"text": "At this point, both sides desperately needed something to happen soon to end the fighting.", "start": 614.28, "duration": 3.92}, {"text": "The British were running out of money, while the Americans were again facing mutinies,", "start": 618.2, "duration": 3.3}, {"text": "as the men went without pay or even basic living needs.", "start": 621.5, "duration": 2.78}, {"text": "Fortunately, the French were now showing up in greater numbers and were ready to fight.", "start": 624.32, "duration": 3.52}, {"text": "After his encounter with Greene, Cornwallis decided the only way to win the South", "start": 627.84, "duration": 3.12}, {"text": "was to first prevent the Southern Continental Army from using Virginia as a supply base.", "start": 630.96, "duration": 3.64}, {"text": "So he abandoned the Carolina's, moving to Wilmington, and on to Yorktown,", "start": 634.6, "duration": 3.5}, {"text": "a position the British believed would be easy to supply and support.", "start": 638.1, "duration": 3.14}, {"text": "On his march to Yorktown, he raided many farms, stealing horses and supplies from the locals,", "start": 641.24, "duration": 4.28}, {"text": "but also freeing thousands of slaves, many of whom joined him.", "start": 645.529, "duration": 2.951}, {"text": "The French saw Cornwallis' new position as an opportunity to land a decisive blow on the British.", "start": 648.48, "duration": 4.82}, {"text": "Washington wanted to attack Clinton in New York, but the French said it was a really dumb idea,", "start": 653.3, "duration": 3.76}, {"text": "and, to be fair, it was.", "start": 657.06, "duration": 1.3}, {"text": "Instead, Washington sent out fake dispatches to make it look like they would attack Clinton,", "start": 658.499, "duration": 3.859}, {"text": "but secretly their combined force marched all the way down to Virginia.", "start": 662.359, "duration": 2.861}, {"text": "A large French fleet under the command of Compte de Grasse arrived and successfully cleared the British Navy out of the Chesapeake Bay.", "start": 665.22, "duration": 5.32}, {"text": "The combined land and naval forces then laid siege to Cornwallis' army in Yorktown.", "start": 670.54, "duration": 3.84}, {"text": "The American and French forces tightened in around the city, raining artillery down on Cornwallis,", "start": 674.58, "duration": 4.52}, {"text": "who desperately appealed to Clinton for aid, but Clinton was unusually chilled out about the whole thing.", "start": 679.1, "duration": 4.24}, {"text": "Cornwallis held out for nearly a month before he had no choice but to surrender.", "start": 683.34, "duration": 3.94}, {"text": "Over 7,000 British troops were captured, a crushing defeat, and with that, Parliament had reached the end of its rope.", "start": 687.28, "duration": 6.18}, {"text": "The war just wasn't worth it, and it needed to end now. The British still held New York, Charleston, and Savannah,", "start": 693.46, "duration": 5.24}, {"text": "but fighting between the two sides mostly ceased as peace negotiations opened up in Paris.", "start": 698.7, "duration": 3.94}, {"text": "The resulting treaty in 1783 saw Great Britain remove its troops from American soil, recognize U.S. independence,", "start": 702.64, "duration": 5.38}, {"text": "and cede territory up to the Mississippi River.", "start": 708.02, "duration": 2.1}, {"text": "In return, the Americans agreed to pay any debt still owed to Britain, and gave fair treatment to any colonists who remained loyal to the Crown.", "start": 710.12, "duration": 5.9}, {"text": "The Spanish got Florida, while the French got an economic crisis that led to its own revolution a decade later. (Best reward ever.)", "start": 716.02, "duration": 4.6}, {"text": "Washington retired to his home in Mount Vernon, wishing his men farewell by saying,", "start": 720.62, "duration": 3.44}, {"text": "\"I most devoutly wish that your latter days may be as prosperous and happy as your former ones have been glorious and honorable.\"", "start": 724.06, "duration": 5.86}, {"text": "He hoped to live out the rest of his days in peace, but unfortunately for him,", "start": 729.92, "duration": 3.14}, {"text": "a number of people wanted him to be the first leader of the new country.", "start": 733.06, "duration": 2.7}, {"text": "And by a number of people, I mean literally everyone.", "start": 735.76, "duration": 2.2}, {"text": "The first election campaign in American history was basically a grassroots effort to convince Washington to accept the office.", "start": 737.96, "duration": 5.879}, {"text": "He was sworn in on April 30th, 1789, and he himself established many of the standards and limitations of what the American leaders should be.", "start": 743.84, "duration": 7.06}, {"text": "First of all, there was debate on what he should be called. Is he a king? Is he our glorious leader?", "start": 750.9, "duration": 3.52}, {"text": "In the end, they went for a word that, at the time, was pretty modest; president.", "start": 754.42, "duration": 3.8}, {"text": "Like the president of your local bowling club, or office bake sale committee.", "start": 758.22, "duration": 3.079}, {"text": "He set up a cabinet of expert advisors knowing that no president could know everything,", "start": 761.3, "duration": 3.9}, {"text": "no matter how much of a stable genius they claimed to be.", "start": 765.2, "duration": 2.1}, {"text": "He proposed major legislation to Congress, and gave an annual State of the Union address to keep his own power in check.", "start": 767.31, "duration": 5.219}, {"text": "He stated that the U.S. should remain neutral in foreign conflicts,", "start": 772.529, "duration": 2.79}, {"text": "and in the end he voluntarily gave up his power after just two terms.", "start": 775.32, "duration": 3.39}, {"text": "He could have made the presidency anything he wanted,", "start": 778.71, "duration": 2.53}, {"text": "but his careful and cautious actions helped set the precedent of an office that is powerful in its limitations,", "start": 781.24, "duration": 5.44}, {"text": "decisive through its diplomacy, and respected in its humility.", "start": 786.68, "duration": 3.7}, {"text": "And so the United States was born, and everything was perfect. It had no problems. Not a single one.", "start": 790.38, "duration": 5.14}, {"text": "Certainly nothing that would, I don't know, cause such an extreme divide that it would lead to a civil war.", "start": 795.52, "duration": 3.76}, {"text": "Anyway, moving on.", "start": 800.6, "duration": 1.28}, {"text": "Quick quiz! Name the most American thing you can think of.", "start": 801.88, "duration": 2.3}, {"text": "Baseball? Bald Eagles? (Orange dude that wants to build a giant wall?)", "start": 804.18, "duration": 1.52}, {"text": "Calling the winner of an America-only sports tournament World Champions? (Sounds right.)", "start": 805.76, "duration": 3.64}, {"text": "Or maybe math and science?", "start": 809.4, "duration": 1.1}, {"text": "Wait. Math and science?", "start": 810.92, "duration": 1.42}, {"text": "That's right. If you didn't know, science is American as combining chicken with waffles.", "start": 812.66, "duration": 4.04}, {"text": "And don't just take my word for it, ask Thomas Jefferson!", "start": 816.7, "duration": 2.68}, {"text": "Of course, to do that, you would need a time machine, and that would take some math and a lot of science.", "start": 819.38, "duration": 4.48}, {"text": "If you want to deeply understand math and science, say you want to calculate the age of the universe,", "start": 823.86, "duration": 4.12}, {"text": "take a crack at special relativity, or just train your critical thinking with some fun logic puzzles,", "start": 827.98, "duration": 4.46}, {"text": "then you've got to check out Brilliant.", "start": 832.44, "duration": 1.57}, {"text": "Brilliant guides you through a whole host of fascinating topics by breaking them down", "start": 834.01, "duration": 3.69}, {"text": "and getting you to actively solve problems in an experience that is interactive, addictive, and so easy to understand.", "start": 837.7, "duration": 5.94}, {"text": "This intuitive approach makes it appropriate for students, professionals, and enthusiasts all of the world.", "start": 843.64, "duration": 5.46}, {"text": "To support OverSimplified and learn more about Brilliant, go to brilliant.org/OverSimplified,", "start": 849.1, "duration": 5.32}, {"text": "and sign up for free. And the first 200 people to use our link, which can also be found in the description below,", "start": 854.42, "duration": 4.92}, {"text": "will get 20% off the annual premium subscription. So check it out now!", "start": 859.34, "duration": 3.62}]