[{"text": "Hey Wisecrack, Jared here. Bojack is back.", "start": 3.22, "duration": 5.78}, {"text": "That means it's time to saddle up and head back to the strange and depressing world", "start": 9.0, "duration": 4.34}, {"text": "of Hollywoo. Now we've already talked about proto narrative and distraction in", "start": 13.349, "duration": 4.231}, {"text": "previous videos but this season really dives deep into an idea that's always", "start": 17.58, "duration": 3.869}, {"text": "been present in the show. That idea: loneliness. Who's comfortable with it,", "start": 21.449, "duration": 4.711}, {"text": "who's uncomfortable with it, and who takes a hundred painkillers a day to", "start": 26.16, "duration": 3.449}, {"text": "avoid it at all costs. Through its ensemble of dysfunctional relationships,", "start": 29.609, "duration": 4.681}, {"text": "Bojack gives us a fresh and quite nuanced perspective on loneliness not", "start": 34.29, "duration": 4.679}, {"text": "often seen on TV. Can loneliness be healthy or even necessary well let's", "start": 38.969, "duration": 5.671}, {"text": "find out in this Wisecrack Quick Take on Bojack Horseman season 5 and of course,", "start": 44.64, "duration": 4.47}, {"text": "spoilers ahead but real quick a shout out to our new channel sponsor Wicks.", "start": 49.11, "duration": 3.69}, {"text": "We're building a new website using Wix that will have a bunch of fun and", "start": 52.8, "duration": 3.36}, {"text": "interactive features including a way for you to vote on what we should cover in", "start": 56.16, "duration": 3.18}, {"text": "an upcoming episode. So more on that at the end of the video but for now back to", "start": 59.34, "duration": 4.05}, {"text": "Bojack. So first guys, a quick recap. This season revolves around the production of", "start": 63.39, "duration": 4.92}, {"text": "Bojack's new TV show Philbert where Bojack navigates a semi relationship", "start": 68.31, "duration": 4.65}, {"text": "with his co-star Gina. Meanwhile Princess Carolyne attempts to adopt a baby,", "start": 72.96, "duration": 3.87}, {"text": "Todd manages his career as a VP at whattimeisitrightnow.com and Mr. Peanutbutter", "start": 76.83, "duration": 4.98}, {"text": "and Diane finalized their divorce in an attempt to move on with their", "start": 81.81, "duration": 3.3}, {"text": "lives. As early as the first line, lowliness is established as a central", "start": 85.11, "duration": 4.829}, {"text": "theme of the season. \"Nothing's lonelier than a party.", "start": 89.939, "duration": 4.051}, {"text": "Good thing I don't need anyone or I might feel lonesome\" and as we'll see, every", "start": 93.99, "duration": 4.35}, {"text": "major character struggles with this in their own way. Let's start with the most", "start": 98.34, "duration": 3.779}, {"text": "obvious one: Diane, who is struggling to reconcile her identity as a newly", "start": 102.119, "duration": 3.991}, {"text": "divorced single woman. We've seen in previous seasons how hard she used to", "start": 106.11, "duration": 4.11}, {"text": "try to keep up with Mr. Peanutbutter's\nexpectations to be a fun party goer like him.", "start": 110.22, "duration": 4.17}, {"text": "Having to find herself in relation to him for so long", "start": 114.39, "duration": 3.689}, {"text": "only made her focus on her supposed shortcomings as an introvert while", "start": 118.079, "duration": 4.11}, {"text": "abandoning other aspects of herself that she actually liked. \"This is all the stuff", "start": 122.189, "duration": 3.991}, {"text": "that cool twenty-something Diane had to put away when she moved in with old man Peanutbutter.", "start": 126.18, "duration": 4.28}, {"text": "In episode two, we follow her non-sequentially", "start": 130.46, "duration": 2.28}, {"text": "across a time line that starts with her hitting on Bojack. \"We could totally", "start": 132.74, "duration": 3.36}, {"text": "make out right now.\" During a moment of lonely desperation. Then after finding", "start": 136.1, "duration": 4.23}, {"text": "out that Mr. Peanutbutter has a new\ngirlfriend, she flees to Vietnam for a", "start": 140.33, "duration": 3.33}, {"text": "solo trip. Once there she's rendered ndoubly alone by her inability to speak", "start": 143.66, "duration": 3.96}, {"text": "Vietnamese and her fellow American's assumptions that she doesn't speak", "start": 147.62, "duration": 3.54}, {"text": "English. \"You Vietnam.\" \"No, me America.\" She copes with her loneliness in various", "start": 151.16, "duration": 6.48}, {"text": "ways at one point engaging in a mega brief romance with a grip but every", "start": 157.64, "duration": 4.89}, {"text": "interaction puts Diane more ill at ease. From a conversation with Todd about something.", "start": 162.53, "duration": 5.55}, {"text": "\"I'm supposed to go to the\nroller rink later. Hopefully there won't", "start": 168.08, "duration": 3.33}, {"text": "be any mob bosses there. What am I\nsaying, that's so random.\" To the grips", "start": 171.41, "duration": 5.01}, {"text": "endless pontification, Diane realizes that often interacting with the outside", "start": 176.42, "duration": 4.17}, {"text": "world only leaves her feeling more alone. She eventually comes to terms with her", "start": 180.59, "duration": 5.25}, {"text": "romantic aloneness, apologizing to Bojack for her mixed messages and admitting that:", "start": 185.84, "duration": 4.47}, {"text": "\"I just really need a friend right now.\" Over\nthe course of the season she seems", "start": 190.31, "duration": 3.09}, {"text": "increasingly self actualized. From being able to comfort her romantic semi rival", "start": 193.4, "duration": 4.71}, {"text": "Pickles to performing a solo\nintervention for Bojack.", "start": 198.11, "duration": 3.55}, {"text": "Now more on that later. Generally she's able to exist more", "start": 201.66, "duration": 2.86}, {"text": "truthfully now that she's not dating someone who doesn't align with her values.", "start": 204.52, "duration": 3.78}, {"text": "Even her therapist admits that:\n\"It sounds like our time together is done.\"", "start": 208.3, "duration": 5.02}, {"text": "\"What?\" \"The fact that you're setting a boundary is good go forth with the tools I've given you.\"", "start": 213.32, "duration": 4.84}, {"text": "Through Diane, we see that self-sufficiency and embracing solitude", "start": 218.16, "duration": 3.64}, {"text": "can be key to realizing the truest strongest version of yourself. \"Now while", "start": 221.81, "duration": 5.37}, {"text": "Diane is able to be happily alone, other characters attempt to make relationships", "start": 227.18, "duration": 3.869}, {"text": "work in order to avoid confronting loneliness. Just as Diane's relationship", "start": 231.049, "duration": 4.201}, {"text": "with Mr. Peanutbutter makes her obsess\nover her fun quotient,", "start": 235.25, "duration": 3.36}, {"text": "Todd's relationships seem to only bring\nout his two shortcomings. First in his", "start": 238.61, "duration": 4.53}, {"text": "relationship with Yolanda, Todd is hurt by the hyper focus on his", "start": 243.14, "duration": 3.51}, {"text": "lack of life direction. \"Why did you tell your family I went to college?\" \"Oh I don't", "start": 246.65, "duration": 4.619}, {"text": "know I guess I just wanted you to seem impressive.\"", "start": 251.269, "duration": 2.311}, {"text": "Ultimately he decides to end the relationship. \"Yolanda we need to breakup.\"", "start": 253.58, "duration": 4.74}, {"text": "Second, he's so eager to make things work\nwith Emily that he constructs a", "start": 258.32, "duration": 4.06}, {"text": "sex robot. Which he is convinced could compensate for his disinterest in sex.", "start": 262.38, "duration": 4.44}, {"text": "While Emily isn't super into boning the sex robot, the bigwigs at whattimeisitrightnow.com", "start": 266.82, "duration": 5.58}, {"text": "are impressed by its moxie and the robot is ultimately", "start": 272.4, "duration": 3.2}, {"text": "promoted to CEO. Todd ultimately destroys the sex robot and takes off his", "start": 275.61, "duration": 4.23}, {"text": "executive suit. Thereby eliminating the parts of himself that were trying to", "start": 279.84, "duration": 4.02}, {"text": "please Yolanda and Emily. As with Diane\nTodd's interactions show how some", "start": 283.86, "duration": 4.83}, {"text": "romantic relationships can leave you feeling more alone and more lacking.", "start": 288.69, "duration": 4.8}, {"text": "And now for princess Carolyn. In episode 5 we get some deeper insights into her past.", "start": 293.49, "duration": 4.47}, {"text": "Learning how she went from being the helps knocked-up daughter at the mercy", "start": 297.96, "duration": 3.63}, {"text": "of her boyfriends answering machine tape dynasty. Only to miscarry and find", "start": 301.59, "duration": 4.2}, {"text": "herself on her own. Instead of mourning the life she lost, she created an", "start": 305.79, "duration": 4.53}, {"text": "entirely new one for herself by moving to LA and clawing her way up the", "start": 310.32, "duration": 4.29}, {"text": "Hollywoo ladder. It's worth noting that her latest journey in self-sufficiency", "start": 314.61, "duration": 4.35}, {"text": "also came after a miscarriage. The one that blew up her relationship with Milton.", "start": 318.96, "duration": 4.29}, {"text": "Once again we see Princess Carolyn land on her feet and channeled", "start": 323.25, "duration": 4.26}, {"text": "the same bravery as her teenage self and starting over after a difficult loss.", "start": 327.51, "duration": 4.77}, {"text": "While sitting in the hospital waiting to meet her maybe baby, she admits to Milton", "start": 332.28, "duration": 5.04}, {"text": "that fourth season princess Carolyn did want him to stick around the night she", "start": 337.32, "duration": 3.66}, {"text": "kicked him out. \"I wish you'd stayed with me that night.\"", "start": 340.98, "duration": 2.4}, {"text": "\"You told me to leave.\" \"Yeah I guess the\nlesson is don't listen to me, right?\"", "start": 343.38, "duration": 4.91}, {"text": "However later she clearly tells him to leave saying that she doesn't want to", "start": 348.29, "duration": 5.29}, {"text": "raise the baby with him and this time she means it. She's learned what she wants:", "start": 353.58, "duration": 4.11}, {"text": "self-sufficiency. Princess Carolyn's joke about her baby's name:", "start": 357.69, "duration": 4.14}, {"text": "\"Untitled Princess Carolyn Project\" suggests that, as with her previous", "start": 361.83, "duration": 4.32}, {"text": "career successes, Princess Carolyn will manage single motherhood just fine.", "start": 366.15, "duration": 4.59}, {"text": "Alright so Diane, Todd, and Princess Carolyn's journeys through season 5", "start": 370.74, "duration": 3.81}, {"text": "illustrate various takes on that double-edged sword of loneliness and", "start": 374.55, "duration": 3.87}, {"text": "self-sufficiency which brings us to Mr. Peanutbutter. Mr. Peanutbutter also", "start": 378.42, "duration": 4.26}, {"text": "fits this narrative because as the character most in need of company,", "start": 382.68, "duration": 4.17}, {"text": "he's also the least inclined to self-reflections.", "start": 386.85, "duration": 2.76}, {"text": "\"Oh, I'm not tough enough huh? I'll show them how tough I can be...", "start": 389.61, "duration": 6.49}, {"text": "We'll be back with more of the red carpet pre-show fashion Stravaganza.\"", "start": 396.1, "duration": 4.6}, {"text": "unlike the other characters Mr. Peanutbutter rarely appears to want anything beyond", "start": 400.7, "duration": 4.06}, {"text": "fame, fun, and Parties. He seems physically incapable of being alone. Getting with", "start": 404.77, "duration": 6.179}, {"text": "the first half-his-age dog-lady he meets after signing his divorce papers. As a", "start": 410.949, "duration": 4.591}, {"text": "serial monogamist, he may desperately hide from loneliness or self-reflection,", "start": 415.54, "duration": 4.26}, {"text": "seeking solace in relationships the same way he seeks solace in loud parties.", "start": 419.8, "duration": 5.19}, {"text": "In the Halloween episode, Mr. Peanutbutter gets dangerously close to introspection.", "start": 424.99, "duration": 4.08}, {"text": "As he wonders how each of his wives became bitter and unhappy by the end of", "start": 429.07, "duration": 4.44}, {"text": "their relationship. \"What's the common denominator?\" Diane offers some insight", "start": 433.51, "duration": 4.17}, {"text": "you keep dating women in their 20s. \"I do do that.\" \"They're not fully formed yet,", "start": 437.68, "duration": 4.92}, {"text": "life changes people.\" \"Well not me.\" The women he marries eventually grow up", "start": 442.6, "duration": 4.59}, {"text": "while Mr. Peanutbutter remains the same. It seems that in constantly dating women", "start": 447.19, "duration": 4.74}, {"text": "who are younger than him, Mr. Peanutbutter has carved out a convenient", "start": 451.93, "duration": 3.51}, {"text": "emotional niche he can continue to occupy as he replaces each consecutive", "start": 455.44, "duration": 4.5}, {"text": "life with a younger more fun version. This safe paint-by-numbers approach to", "start": 459.94, "duration": 4.89}, {"text": "marriage has kept Mr. Peanutbutter happy but prevented him from maturing in", "start": 464.83, "duration": 3.93}, {"text": "any meaningful way. Ultimately Mr. Peanutbutter reveals himself to be truly", "start": 468.76, "duration": 4.08}, {"text": "pathological in his need to be coupled up when, instead of telling pickles the", "start": 472.84, "duration": 3.75}, {"text": "truth about his infidelity and risking losing her, he decides to put a ring on it.", "start": 476.59, "duration": 4.79}, {"text": "And finally our boy Bojack. While Mr. Peanutbutter may be needy, at least he's", "start": 481.38, "duration": 4.9}, {"text": "totally upfront about it. Bojack on the other hand has a more", "start": 486.28, "duration": 3.27}, {"text": "complex and more painful relationship to\nthe outside world.", "start": 489.55, "duration": 3.77}, {"text": "From calling Hollyhock in the middle of the night to inform her that", "start": 493.32, "duration": 2.899}, {"text": "he liked her on Instagram. \"Well I wanted to let you know that I hearted your", "start": 496.219, "duration": 2.85}, {"text": "Instagram photo.\" \"Okay.\" To pretending to match Gina's blase take on their relationship.", "start": 499.069, "duration": 4.691}, {"text": "\"We work together, we make sex together, we don't talk about our", "start": 503.76, "duration": 2.839}, {"text": "feelings and yet sometimes a begrudging respect can blossom into...\" \"Nope.\"", "start": 506.599, "duration": 4.44}, {"text": "\"...blossoms into nothing, is what I was gonna say\" Bojack's need for human / animal companionship is", "start": 511.039, "duration": 5.37}, {"text": "palpable. Bojack has gone the Mr. Peanutbutter", "start": 516.409, "duration": 2.641}, {"text": "route in the past. Getting with women to avoid solitude. A toxic pattern that", "start": 519.05, "duration": 4.799}, {"text": "peaked with the near seduction of his ex-girlfriend's teenage daughter.", "start": 523.849, "duration": 3.451}, {"text": "This season he's kind of dating the supremely jaded Gina. Who doesn't appear to need", "start": 527.3, "duration": 5.13}, {"text": "anything from him emotionally. \"I love\nbeing alone. I wish I were alone right now.\"", "start": 532.43, "duration": 3.39}, {"text": "Leaving him just as lonely as before. So he decides to bypass the whole", "start": 535.82, "duration": 4.41}, {"text": "learning to be alone with your thoughts thing by altering his state of being.", "start": 540.23, "duration": 3.45}, {"text": "Enter painkillers. Writer Johann Hari makes a compelling case for considering", "start": 543.68, "duration": 5.19}, {"text": "drug addiction as a disease of bonding. Humans have an innate primal need to", "start": 548.87, "duration": 4.589}, {"text": "bond and when they're unable to bond with other people, they'll bond with a", "start": 553.459, "duration": 3.511}, {"text": "negative behavior like smoking or gambling. Essentially he argues that", "start": 556.97, "duration": 3.989}, {"text": "substance use is a substitute for meaningful human connection and while", "start": 560.959, "duration": 4.171}, {"text": "researchers are also studying how other social and economic factors can", "start": 565.13, "duration": 3.69}, {"text": "influence addiction, in the fictional world of Bojack, loneliness seems like a", "start": 568.82, "duration": 4.56}, {"text": "close lick. Bojack find solace and drugs even as they embed him deeper into a", "start": 573.38, "duration": 4.74}, {"text": "fantasy world. Increasingly cutting him off from the people around him, he begins", "start": 578.12, "duration": 4.05}, {"text": "to see friends and loved ones as tools for getting what he wants. Gina is a tool", "start": 582.17, "duration": 4.89}, {"text": "for helping him seize the limelight and Hollyhock is a tool for helping him", "start": 587.06, "duration": 3.81}, {"text": "steal his pills back from Gina's medicine cabinet.", "start": 590.87, "duration": 2.55}, {"text": "Our sense of bojack's loneliness is augmented by the Philbert TV show", "start": 593.42, "duration": 3.72}, {"text": "narrative. Philbert is a hard-boiled loner detective with a penchant for secrets and", "start": 597.14, "duration": 4.559}, {"text": "grizzly voiceover. \"Why do you still use a landline?\" What am I supposed to tell her?", "start": 601.699, "duration": 4.381}, {"text": "I'm just an old-fashioned guy or maybe I like things that are plugged to the wall.", "start": 606.08, "duration": 3.6}, {"text": "Something to grab onto if I start floating away.\" From the opening lines of the", "start": 609.68, "duration": 3.84}, {"text": "series, Bojack tries to imply that he relates to the character as a fellow", "start": 613.52, "duration": 3.9}, {"text": "loner slash cynic. This develops into an ongoing joke about the similarities", "start": 617.42, "duration": 4.109}, {"text": "between the two. The set of the show looks exactly like Bojack's house and", "start": 621.529, "duration": 3.511}, {"text": "Bojack's constantly wearing his Philbert costume off set. \"It's a costume. I just", "start": 625.04, "duration": 4.77}, {"text": "finished filming a show.\" \"Normally people return the costume.\" Also Bojack frequently", "start": 629.81, "duration": 5.1}, {"text": "reads too deeply into his character's narrative despite reminders that", "start": 634.91, "duration": 3.72}, {"text": "\"It's not about you, you know, it's Philbert. By the end he's become so dissociated he's", "start": 638.63, "duration": 5.28}, {"text": "completely lost himself in the character. Even the character Philbert loses track", "start": 643.91, "duration": 4.41}, {"text": "of where he begins and ends: inventing a make-believe partner who he blames for", "start": 648.32, "duration": 4.56}, {"text": "his wife's murder rather than taking responsibility for it. \"There's no record", "start": 652.88, "duration": 4.08}, {"text": "of you ever having a partner at all.\" \"What're you saying?\" \"You killed your wife, and the", "start": 656.96, "duration": 6.84}, {"text": "chief, and the coroner, and the others.\" Similarly Bojack loses any distinction", "start": 663.8, "duration": 3.93}, {"text": "between himself and Philbert, also because he can't cope with the horrible things", "start": 667.73, "duration": 4.59}, {"text": "he's done. The result of this disassociation: Bojack pretty much", "start": 672.32, "duration": 4.35}, {"text": "retreats into a fantasy world where he does crazy shit like choke Gina.", "start": 676.67, "duration": 4.83}, {"text": "At one point he comes face to face with the bloated balloon version of himself. As if", "start": 681.5, "duration": 3.96}, {"text": "to illustrate the fact that his inability to face himself is ultimately", "start": 685.46, "duration": 4.23}, {"text": "to blame for all of his problems. In an interesting moment in the season finale,", "start": 689.69, "duration": 4.44}, {"text": "Bojack begs Diane to write one of her internet takedowns of him. He wants", "start": 694.13, "duration": 4.44}, {"text": "everyone to know about his worst behavior. He wants to be despised,", "start": 698.57, "duration": 3.3}, {"text": "chastised, and punished. Here Bojack craves the feeling of being held", "start": 701.87, "duration": 4.14}, {"text": "accountable by the world for the same exact reason he craves it's company:", "start": 706.01, "duration": 4.05}, {"text": "praise and romantic attention because he has no consistent sense of self.", "start": 710.06, "duration": 5.7}, {"text": "He needs the world to reconcile his persona as lovable Hollywoo leading", "start": 715.76, "duration": 3.96}, {"text": "man and narcissistic creep because he can't seem to do it on his own.", "start": 719.72, "duration": 4.25}, {"text": "A self-actualized Diane is no longer interested in playing Bojack's games and", "start": 723.97, "duration": 3.97}, {"text": "Diagnoses his request for what it is, self-serving. Eventually Diane convinces", "start": 727.94, "duration": 5.28}, {"text": "him that the only person whose job it is to hold him accountable is himself.", "start": 733.22, "duration": 5.13}, {"text": "\"I am asking to be held accountable.\" \"And I'm telling you it's not", "start": 738.35, "duration": 2.789}, {"text": "gonna happen. Whatever you put in that story, no one is gonna hold you", "start": 741.139, "duration": 4.38}, {"text": "accountable. You need to take responsibility for yourself.\"", "start": 745.519, "duration": 3.391}, {"text": "And faster than you can say Narcotics Anonymous, she's persuaded him to go to rehab.", "start": 748.91, "duration": 4.44}, {"text": "So, what are we to take from Bojack Season 5? \"You can't rely on other people, Bojack.\"", "start": 753.35, "duration": 4.37}, {"text": "Well, not quite. Bojack and his dad's certainly know how", "start": 757.72, "duration": 3.13}, {"text": "to put a pessimistic spin on relationships but we shouldn't buy into", "start": 760.85, "duration": 3.359}, {"text": "their bleakest insights. Well we can't hide ourselves in the company of others.", "start": 764.209, "duration": 3.81}, {"text": "We have options beyond live and die alone", "start": 768.019, "duration": 2.82}, {"text": "While romantic relationships may fail or\nprove toxic. It's the platonic", "start": 770.839, "duration": 4.35}, {"text": "friendships that radiate through season 5. Whether it's the budding roommate-hood", "start": 775.189, "duration": 3.87}, {"text": "between Todd and Princess Carolyn, or the lasting bond between Diane and", "start": 779.059, "duration": 4.14}, {"text": "Bojack. They may have their ups and downs and stolen cheese sticks but they prove", "start": 783.199, "duration": 4.89}, {"text": "uniquely enduring. Bojack starts the season claiming he doesn't need anyone", "start": 788.089, "duration": 4.08}, {"text": "but he ends it knowing there's one person he can count on: his friend, Diane.", "start": 792.169, "duration": 4.801}, {"text": "So what do you guys think, are we all alone in the world? Are romantic", "start": 796.97, "duration": 3.659}, {"text": "relationships elaborate traps for making us feel bad about ourselves? And is there", "start": 800.629, "duration": 4.44}, {"text": "power in being able to tolerate loneliness? Let us know what you think in the comments", "start": 805.069, "duration": 4.111}, {"text": "and as always thanks for watching.", "start": 809.18, "duration": 3.779}, {"text": "but before you go, we have an announcement in the coming months we're going to be launching some exciting new", "start": 812.959, "duration": 3.03}, {"text": "community features on a brand new\nwebsite created with our new channel", "start": 815.989, "duration": 3.45}, {"text": "sponsor wigs Wix is a great platform to\ncreate websites for any new project", "start": 819.439, "duration": 4.95}, {"text": "business event blog or pretty much any\nendeavor you can think of we've been", "start": 824.389, "duration": 4.44}, {"text": "planning out our new site and I've been\nblown away by all the options there's", "start": 828.829, "duration": 3.75}, {"text": "the Wix Pro Gallery which is an amazing\nmultimedia gallery where you can post", "start": 832.579, "duration": 3.81}, {"text": "and enhancer images Wix events where you\ncan set up everything you need to put on", "start": 836.389, "duration": 4.081}, {"text": "a show or a party and the comments app\nwhich you can include on your site to", "start": 840.47, "duration": 4.019}, {"text": "interact directly with your audience\nit's all very professional and", "start": 844.489, "duration": 3.361}, {"text": "high-quality and you have total creative\nfreedom to use their tools and create", "start": 847.85, "duration": 3.959}, {"text": "your own personal unique and original\nmasterpiece so whether you've never", "start": 851.809, "duration": 4.05}, {"text": "launched a website or you're seasoned\npro we encourage you to try out Wix and", "start": 855.859, "duration": 3.93}, {"text": "see what a great experience it is and\nstay tuned because we have some exciting", "start": 859.789, "duration": 3.36}, {"text": "stuff rolling out for you on our Wix\nwebsite that will help us connect", "start": 863.149, "duration": 3.54}, {"text": "further with you guys so thanks for\nwatching and as always guys peace", "start": 866.689, "duration": 8.541}]