[{"text": "It’s early morning of the 11th of December 1941.", "start": 0.0, "duration": 4.36}, {"text": "Aboard the light cruiser Yubari rear admiral Sadamichi Kajioka holds a final briefing before a planned invasion", "start": 4.68, "duration": 7.06}, {"text": "as his task force steams towards the Wake Atoll, a US military outpost in the western Pacific Ocean.", "start": 11.82, "duration": 6.34}, {"text": "The war has just started and the powerful Imperial Japanese Navy already inflicted several serious blows,", "start": 18.28, "duration": 6.66}, {"text": "crippling American influence in the region.", "start": 24.94, "duration": 2.42}, {"text": "The upcoming assault of US fortifications on the atoll was to be another striking success for the Japanese armed forces.", "start": 27.36, "duration": 7.22}, {"text": "The struggle for Wake Island is about to begin.", "start": 34.58, "duration": 3.26}, {"text": "This video is sponsored by War Thunder!", "start": 39.06, "duration": 2.18}, {"text": "If you enjoy vehicle combat set in the latter half of the 20th century, then be sure to check out War Thunder.", "start": 41.4, "duration": 5.86}, {"text": "Free to play on PC, Xbox One and PS4 with cross platform support, War Thunder lets you take to the land, sea and air in a myriad of combat vehicles.", "start": 47.38, "duration": 9.26}, {"text": "With over 1200 vehicles to choose from and more than 80 theatres of war (such as Wake Island featured in today’s video),", "start": 56.64, "duration": 6.5}, {"text": "you really can pick your battles!", "start": 63.14, "duration": 2.24}, {"text": "With amazing graphics and authentic physics you will be immersed in conflict.", "start": 65.38, "duration": 4.12}, {"text": "Join over 20 million players from around the world, in a game that is constantly being updated with new content and multiple game-modes to engage.", "start": 69.5, "duration": 8.0}, {"text": "Support our channel by clicking the link in the description below,", "start": 77.5, "duration": 3.28}, {"text": "register online for free and enjoy premium access for three days along with a premium vehicle to pilot your way to glory!", "start": 80.78, "duration": 7.76}, {"text": "It’s late September of the year 1941.", "start": 94.26, "duration": 3.14}, {"text": "Pursuing an aggressive expansionist policy, the Empire of Japan prepares to launch an invasion", "start": 97.4, "duration": 5.74}, {"text": "on the lucrative Dutch East Indies and British Malaya in an attempt to overcome the oil embargo imposed by Western Powers and,", "start": 103.14, "duration": 8.28}, {"text": "and, more importantly, gain much coveted economic independence.", "start": 111.42, "duration": 3.92}, {"text": "Yet such a bold plan unsurprisingly came with some uncertainties.", "start": 115.46, "duration": 4.3}, {"text": "Being aware of the close ties between the United Kingdom and the United States,", "start": 119.76, "duration": 4.46}, {"text": "Japanese planners expected the latter to react to any aggression in Southeast Asia and join the war on the Allied side.", "start": 124.28, "duration": 7.92}, {"text": "In order to remedy this potential problem,", "start": 132.42, "duration": 2.62}, {"text": "the Imperial Japanese Navy was tasked with incapacitating the United States Pacific Fleet with a pre-emptive strike", "start": 135.04, "duration": 6.94}, {"text": "to ease Japan’s expansion into the south and subsequent establishment of good defensive positions.", "start": 141.98, "duration": 6.2}, {"text": "Whilst Japan applied the last polishes to its ambitious plan,", "start": 148.28, "duration": 3.54}, {"text": "the US government didn’t dawdle, pulling all diplomatic strings to prevent Japanese expansion.", "start": 151.9, "duration": 5.7}, {"text": "Moreover the primary base of the US Pacific Fleet was moved to an „advanced” station at Pearl Harbor naval base in Hawaiian territory,", "start": 157.72, "duration": 8.6}, {"text": "in the hope of dissuading Japanese expansion plans.", "start": 166.52, "duration": 3.3}, {"text": "On top of that, military bases were built in the central Pacific territories under American control", "start": 169.9, "duration": 5.86}, {"text": "to strengthen their presence in the region.", "start": 175.76, "duration": 2.74}, {"text": "One such remote defensive outpost was located on the Wake Atoll,", "start": 178.54, "duration": 4.76}, {"text": "roughly 2,000 miles west of Hawaii and just 600 miles north of the Marshall Islands, being under Japanese control.", "start": 183.3, "duration": 8.4}, {"text": "Construction of military facilities began in early 1941", "start": 191.92, "duration": 4.4}, {"text": "and by the beginning of December of the same year more than 1,100 civil construction staff were working on the atoll.", "start": 196.32, "duration": 7.76}, {"text": "But being a military base, almost 450 U.S. Marines along with several dozen navy and army personnel were also garrisoned on the island.", "start": 204.26, "duration": 9.64}, {"text": "Apart from machine guns and small arms they were equipped with six coastal artillery pieces,", "start": 214.18, "duration": 5.66}, {"text": "twelve antiaircraft guns and last but not least twelve F4F Wildcat fighter planes.", "start": 219.92, "duration": 7.56}, {"text": "One could imagine that nearly a half thousand hardware-reinforced marines", "start": 227.74, "duration": 4.84}, {"text": "were sufficient to properly defend a tiny speck of land on the vast Pacific Ocean.", "start": 232.66, "duration": 5.34}, {"text": "Yet Navy Commander Winfield Cunningham, who flew to the island late November to assume overall command", "start": 238.16, "duration": 6.06}, {"text": "knew that the garrison on the Wake Atoll should be at least four times bigger to pose a serious deterrent to the powerful Japanese navy.", "start": 244.48, "duration": 8.6}, {"text": "Nevertheless, Cunningham got straight to work, giving top priority to finishing the airstrip and defensive fortifications as soon as possible.", "start": 253.52, "duration": 8.68}, {"text": "But in spite of the earnest efforts of the Wake Island’s personnel,", "start": 262.32, "duration": 3.68}, {"text": "the war in the Pacific broke out well before they had a chance to complete their duties.", "start": 266.0, "duration": 5.42}, {"text": "Early in the morning of the 8th of December 1941,", "start": 271.6, "duration": 3.42}, {"text": "a radio technician on Wake Island opened daily communications with Hickam Field at Pearl Harbor on the other side of the international date line.", "start": 275.02, "duration": 7.92}, {"text": "Yet the initial transmission was distorted and barely intelligible.", "start": 282.94, "duration": 3.96}, {"text": "Something was not right.", "start": 286.9, "duration": 1.64}, {"text": "Soon, renewed attempts to establish communication made it abundantly clear", "start": 289.26, "duration": 4.0}, {"text": "Pearl Harbor was suffering a relentless assault from carrier-based Japanese warplanes.", "start": 293.26, "duration": 5.46}, {"text": "The United States was at war.", "start": 298.72, "duration": 2.72}, {"text": "Within the next hour Commander Cunningham and Major Devereux of the United States Marine Corps made hasty preparations for an impending attack.", "start": 301.82, "duration": 8.04}, {"text": "Soldiers scrambled, manning defensive positions and readying antiaircraft guns.", "start": 310.0, "duration": 4.9}, {"text": "As the Wake Island outpost still lacked proper radar equipment,", "start": 315.1, "duration": 3.58}, {"text": "four Wildcats took to the skies and despite poor visibility, attempted to patrol the area.", "start": 318.82, "duration": 5.94}, {"text": "Several hours had passed as the island’s defenders, feeling the tension and fear mount,", "start": 325.1, "duration": 4.9}, {"text": "looked across the sky for any sign of enemy aircraft.", "start": 330.0, "duration": 3.76}, {"text": "Eventually, almost precisely at noon the roar of 36 Japanese twin engined medium bombers", "start": 333.98, "duration": 7.08}, {"text": "filled the air as they approached through a rain squall.", "start": 341.06, "duration": 3.44}, {"text": "Antiaircraft gunners struggled to match their range, as Japanese bombs pulverized the station’s facilities", "start": 344.5, "duration": 6.44}, {"text": "and destroyed all eight Wildcats that remained on the ground.", "start": 350.94, "duration": 3.74}, {"text": "23 men were killed, mainly air personnel.", "start": 354.68, "duration": 3.92}, {"text": "From December 8, Wake Island was subjected to almost daily air raids, though not as severe as the first.", "start": 358.82, "duration": 6.58}, {"text": "The four remaining Wildcats, assisted by antiaircraft fire managed to shoot down two unescorted Japanese Mitsubishi G3M bombers the very next day,", "start": 365.6, "duration": 10.94}, {"text": "but this small victory only served to maintain the dwindling morale of the American soldiers as the attacks continued unabated.", "start": 376.58, "duration": 7.82}, {"text": "After three days of air bombardments, early on the 11th of December,", "start": 384.8, "duration": 4.18}, {"text": "a Japanese invasion fleet under rear admiral Kajioka was spotted on the horizon by the island lookouts.", "start": 389.1, "duration": 6.52}, {"text": "It would seem that the struggle for the Wake Atoll was about to enter its decisive phase.", "start": 395.7, "duration": 5.54}, {"text": "Three light cruisers, six destroyers and two troop transports arrived off Wake Island", "start": 401.34, "duration": 5.58}, {"text": "and closed the distance to the beaches, with purpose.", "start": 406.92, "duration": 3.24}, {"text": "Japanese artillery boomed as the task force steamed along the coast, but the island’s defences remained silent.", "start": 410.16, "duration": 6.82}, {"text": "Admiral Kajioka, probably being encouraged by the bomber crews’ optimistic reports", "start": 417.2, "duration": 4.96}, {"text": "ordered his ships to close the distance further and continue the artillery  barrage.", "start": 422.16, "duration": 5.16}, {"text": "The Japanese distance to the beach steadily decreased as Kajioka’s ships shelled the shoreline,", "start": 427.88, "duration": 5.66}, {"text": "destroying some civilian buildings, but inflicting no damage to the island’s defensive encampments.", "start": 433.54, "duration": 5.36}, {"text": "Major Devereux, commanding the Marine Corps patiently waited.", "start": 439.12, "duration": 3.84}, {"text": "He was aware of the shortcomings of his 5 inch coastal guns and ordered to hold fire until the Japanese ships drew closer,", "start": 443.24, "duration": 7.5}, {"text": "virtually into point-blank range.", "start": 450.74, "duration": 3.06}, {"text": "At last, the American batteries answered and an initial salvo scored first hits on the Yubari, much to Kajioka’s surprise.", "start": 454.08, "duration": 8.2}, {"text": "The Japanese admiral realized he had been lured into a trap and was forced to immediately retreat to a safer range,", "start": 462.28, "duration": 6.38}, {"text": "hoping to avoid serious losses.", "start": 468.66, "duration": 2.58}, {"text": "But accurate fire from the coastal guns soon yielded significant results.", "start": 471.42, "duration": 4.78}, {"text": "Some of the American shells struck the aft torpedo mounts on one of the destroyers,", "start": 476.2, "duration": 4.4}, {"text": "causing a large explosion on board, tearing the ship in two.", "start": 480.6, "duration": 4.22}, {"text": "Within the next few minutes the Hayate was enveloped by the waves along with her crew of 168 men.", "start": 485.02, "duration": 7.1}, {"text": "Yet the bad news did not end for Admiral Kajioka.", "start": 492.34, "duration": 3.34}, {"text": "In that time, the four Wildcats took off from the airstrip and joined the fray, pouncing on the retreating Japanese vessels.", "start": 495.92, "duration": 7.56}, {"text": "Initially the American aircraft dealt minimal damage to the cruisers, but soon,", "start": 503.62, "duration": 5.12}, {"text": "one of their bombs exploded on the Kisaragi, another destroyer, by chance, igniting her depth charges.", "start": 508.74, "duration": 7.38}, {"text": "The chain of explosions that followed ripped the Japanese ship apart,", "start": 516.34, "duration": 4.08}, {"text": "and just like Hayate minutes earlier, Kisaragi went under.", "start": 520.6, "duration": 4.36}, {"text": "A further 157 sailors were killed.", "start": 524.96, "duration": 3.94}, {"text": "At the loss of two Wildcats, the US defenders managed to repel the invasion,", "start": 529.2, "duration": 4.66}, {"text": "sinking two destroyers and damaging several other ships.", "start": 533.86, "duration": 3.74}, {"text": "It was the first tactical defeat of the Japanese navy in World War II,", "start": 537.74, "duration": 4.48}, {"text": "giving hope to all Americans after the disastrous attack on Pearl Harbor.", "start": 542.28, "duration": 5.0}, {"text": "But for the defenders on Wake Island it was but the first round.", "start": 547.42, "duration": 3.8}, {"text": "Japanese air raids continued for the next twelve days.", "start": 551.6, "duration": 3.52}, {"text": "A constant state of vigilance drew a significant toll on the marines,", "start": 555.12, "duration": 3.94}, {"text": "as they had to remain at their gun positions around the clock.", "start": 559.06, "duration": 3.46}, {"text": "With little respite between Japanese bombardments, Wake Island was not left entirely to its own fate,", "start": 562.52, "duration": 5.9}, {"text": "as a relief force dispatched from Hawaii was already on the move.", "start": 568.64, "duration": 3.28}, {"text": "Yet by 22 December it was still far away from the atoll, all the while the situation on Wake grew increasingly dire.", "start": 572.12, "duration": 7.68}, {"text": "The two last Wildcat fighters were lost in dogfights with a new threat - Japanese carrier-based Zero’s which complemented the waves of bombers.", "start": 579.96, "duration": 8.34}, {"text": "This could only mean that another invasion was but hours away.", "start": 588.3, "duration": 4.66}, {"text": "Indeed, early in the morning of the very next day Admiral Kajioka’s task force returned.", "start": 593.12, "duration": 5.64}, {"text": "But this time, he was reinforced by two fleet carriers and several other heavier warships.", "start": 598.76, "duration": 5.9}, {"text": "Two old destroyers were ran aground to allow the almost 2,000 strong Japanese unit to land on the beach.", "start": 604.86, "duration": 6.66}, {"text": "Soon a desperate battle was fought across the island,", "start": 611.56, "duration": 3.14}, {"text": "as the weary defenders struggled to hold their ground against the numerically superior enemy.", "start": 614.7, "duration": 5.22}, {"text": "After hours of desperate infantry combat, shrinking the defence lines to a couple of strongpoints,", "start": 620.22, "duration": 6.2}, {"text": "Commander Cunningham, seeing that further resistance was futile, ordered his men to lay down their weapons.", "start": 626.5, "duration": 6.7}, {"text": "After fifteen days of air raids and two invasions later,", "start": 633.78, "duration": 3.58}, {"text": "the Imperial Japanese Navy finally captured the US outpost on Wake Island, but at a high cost.", "start": 637.36, "duration": 6.48}, {"text": "They had to sacrifice four warships, more than twenty bombers", "start": 644.06, "duration": 3.46}, {"text": "and just short of a thousand soldiers to overcome the fierce island’s defenders,", "start": 647.52, "duration": 4.62}, {"text": "who lost just over 100 American and Guamanian men.", "start": 652.14, "duration": 4.04}, {"text": "The survivors became prisoners of war, 98 of whom were to be used on the island as forced labour,", "start": 656.38, "duration": 5.94}, {"text": "the rest were evacuated to camps in Japan and China.", "start": 662.44, "duration": 3.94}, {"text": "The gallant stand of the Wake Island defenders, though ultimately forced to yield,", "start": 666.74, "duration": 4.52}, {"text": "was one of the sparse bright points for the United States during the first gloomy weeks of the war.", "start": 671.38, "duration": 5.58}, {"text": "Their unbending will served as a rare morale-boost", "start": 677.08, "duration": 3.5}, {"text": "to all American soldiers scattered on the Pacific Ocean theater in the dark, bitter days of early 1942.", "start": 680.68, "duration": 8.38}, {"text": "Once again a big thank you to War Thunder for sponsoring this video.", "start": 691.18, "duration": 4.14}, {"text": "Remember, to hit the link in the description, to claim you three days premium access", "start": 695.32, "duration": 4.26}, {"text": "along with premium vehicle, and you will be supporting us to creat more content.", "start": 699.58, "duration": 4.96}]