[{"text": "Now that we've seen what a derivative means, and what it has to do with rates of change.", "start": 11.68, "duration": 4.32}, {"text": "Our next step is to learn how to actually compute these guys, as in if I give you some kind of function", "start": 16.0, "duration": 5.0}, {"text": "with an explicit formula you'd want to be able to find what the formula for its derivative is.", "start": 21.0, "duration": 4.1}, {"text": "Maybe it's obvious, but I think it's worth stating explicitly why this is an important thing", "start": 25.19, "duration": 5.81}, {"text": "to be able to do. Why much of a calculus students time ends up going towards grappling with", "start": 31.0, "duration": 5.0}, {"text": "derivatives of abstract functions rather than thinking about concrete rate of change problems,", "start": 36.02, "duration": 5.78}, {"text": "Is because a lot of real-world phenomena. The sort of things that we want to use calculus", "start": 41.8, "duration": 4.4}, {"text": "to analyze are modeled using polynomials, trigonometric functions, exponential's", "start": 46.2, "duration": 5.3}, {"text": "and other pure functions like that. So if you build up some fluency with the ideas", "start": 51.56, "duration": 4.54}, {"text": "of rates of change for those kinds of pure abstract functions. It gives you a language to more", "start": 56.15, "duration": 5.35}, {"text": "readily talk about the rates at which things change in concrete situations that you might be", "start": 61.5, "duration": 3.6}, {"text": "using calculus to model. But it is way too easy for this process to feel like just memorizing a list", "start": 65.1, "duration": 7.2}, {"text": "of rules. And if that happens, if you get that feeling it's all so easy to lose sight of the fact that", "start": 72.3, "duration": 4.7}, {"text": "derivatives are fundamentally about just looking at tiny changes to some quantity,", "start": 77.06, "duration": 3.54}, {"text": "and how that relates to a resulting tiny change in another quantity. So in this video", "start": 80.63, "duration": 5.27}, {"text": "and in the next one, my aim is to show you how you can think about a few of these rules intuitively", "start": 85.9, "duration": 4.0}, {"text": "and geometrically. And I really want to encourage you to never forget that tiny nudges", "start": 89.999, "duration": 4.901}, {"text": "are at the heart of derivatives. let's start with a simple function like f(x) = x^2, what if I asked", "start": 94.9, "duration": 2.249}, {"text": "you it's derivative. That is if you were to look at some value x like x = 2 and compare it to a value", "start": 102.109, "duration": 6.191}, {"text": "slightly bigger, just dx bigger. What's the corresponding change in the value of the", "start": 108.3, "duration": 5.0}, {"text": "function df, and in particular what's df divided by dx - The rate at which this function is changing", "start": 113.359, "duration": 7.041}, {"text": "per unit change in x as a first step for intuition. We know that you can think of this ratio df/dx", "start": 120.4, "duration": 6.8}, {"text": "as the slope of a tangent line to the graph of x^2, and from that you can see that the slope", "start": 127.279, "duration": 6.121}, {"text": "generally increases as x increases. At 0 the tangent line is flat so the slope is 0 at x = 1.", "start": 133.4, "duration": 0.809}, {"text": "That's something a bit steeper at x = 2, it's steeper still but looking at graphs isn't generally the", "start": 139.879, "duration": 7.121}, {"text": "best way to understand the precise formula for a derivative, for that it's best to take", "start": 147.08, "duration": 1.68}, {"text": "a more literal look at what x^2 actually means. And in this case let's go ahead and picture a square", "start": 152.2, "duration": 5.2}, {"text": "whose side length is x if you increase x by some tiny nudge, some little dx.", "start": 157.489, "duration": 3.541}, {"text": "What's the resulting change in the area of that square, that slight change, in area", "start": 163.25, "duration": 5.65}, {"text": "is what df means in this context. It's the tiny increase to the value of f(x) = x^2 caused by", "start": 168.9, "duration": 7.2}, {"text": "increasing x by that tiny nudge dx. Now you can see that there's three new bits of area in this diagram, two thin", "start": 176.18, "duration": 3.27}, {"text": "rectangles and a miniscule square. The two thin rectangles each have side lengths of x and dx", "start": 183.379, "duration": 5.221}, {"text": "so they account for two times x * dx units of new area. For example let's say x was 3 and dx was 0.01.", "start": 188.6, "duration": 8.8}, {"text": "Then that new area from these two thin rectangles would be 2 * 3 * 0.01 which is 0.06,", "start": 197.4, "duration": 5.9}, {"text": "about 6 times the size of dx. That little square there has an area of dx^2, but you should", "start": 203.3, "duration": 4.11}, {"text": "think of that as being really tiny, negligibly tiny. For example, if dx was 0.01, that would be only 0.0001.", "start": 207.41, "duration": 11.29}, {"text": "And keep in mind, I'm drawing DX with a fair bit of width here just so we can actually", "start": 218.7, "duration": 9.1}, {"text": "see it, but always remember - in principle dx should be thought of as a truly tiny amount", "start": 227.81, "duration": 5.29}, {"text": "and for those truly tiny amounts. A good rule of thumb is that you can ignore anything that includes a dx", "start": 233.1, "duration": 6.6}, {"text": "raised to a power greater than 1. That is a tiny change squared is a negligible change what this leaves us with", "start": 239.75, "duration": 8.05}, {"text": "is that df is just some multiple of dx, and that multiple 2x which you could also write as df/dx", "start": 247.8, "duration": 8.0}, {"text": "is the derivative of x^2. For example, if you were starting at x = 3, then as you slightly increase x", "start": 255.8, "duration": 7.4}, {"text": "the rate of change in the area per unit change in length added dx^2/dx would be 2 * 3 or 6.", "start": 263.2, "duration": 8.6}, {"text": "And if instead you were starting at x = 5, the rate of change would be ten units of area per unit change in x.", "start": 271.8, "duration": 9.1}, {"text": "Let's go ahead and try a different simple function f(x) = x^3. This is going to be the geometric view", "start": 280.9, "duration": 6.4}, {"text": "of the stuff that I went through algebraically in the last video. What's nice here is that we can think of x^3", "start": 287.35, "duration": 5.45}, {"text": "as the volume of an actual cube, whose side lengths are x. And when you increase x by a tiny nudge, a tiny dx", "start": 292.8, "duration": 2.14}, {"text": "the resulting increase in volume is what I have here in yellow. That represents all the volume in a cube", "start": 300.9, "duration": 6.5}, {"text": "with side lengths x plus dx. That's not already in the original cube, the one with side length x.", "start": 307.4, "duration": 5.4}, {"text": "It's nice to think of this new volume as broken up into multiple components, but almost all of it comes", "start": 312.84, "duration": 5.56}, {"text": "from these three square faces, or set a little more precisely as dx approaches zero.", "start": 318.4, "duration": 3.99}, {"text": "Precisely as dx approaches zero, those three squares comprise a portion closer and closer to 100%", "start": 322.39, "duration": 7.11}, {"text": "of that new yellow volume. Each of those thin squares has a volume of x^2 * dx,", "start": 329.5, "duration": 8.6}, {"text": "the area of the face times that little thickness dx. So in total this gives us 3x^2 dx of volume change.", "start": 338.1, "duration": 8.1}, {"text": "And to be sure there are other slivers of volume here, along the edges, and that tiny one in the corner. But all", "start": 346.2, "duration": 6.6}, {"text": "of that volume is going to be proportional to dx^2 or dx^3 so we can safely ignore them.", "start": 352.8, "duration": 5.9}, {"text": "Again this is ultimately because they're going to be divided by dx, and if there's still any dx remaining", "start": 358.74, "duration": 6.76}, {"text": "then those terms aren't going to survive the process of letting dx approach 0. What this means is", "start": 365.5, "duration": 6.6}, {"text": "that the derivative of x^3, the rate at which x^3 changes per unit change of x is 3x^2.", "start": 372.13, "duration": 8.57}, {"text": "What that means in terms of graphical intuition is that the slope of the graph of x^3", "start": 380.77, "duration": 3.989}, {"text": "at every single point x is exactly 3x^2. And reasoning about that slope, it should make sense", "start": 385.1, "duration": 10.9}, {"text": "that this derivative is high on the left, and then zero at the origin, and then high again as you move to the right.", "start": 396.099, "duration": 7.001}, {"text": "But just thinking in terms of the graph would never have landed us on the precise quantity 3x^2.", "start": 403.18, "duration": 5.72}, {"text": "For that we had to take a much more direct look at what x^3 actually means now in practice.", "start": 408.9, "duration": 6.3}, {"text": "You wouldn't necessarily think of the square every time you're taking the derivative of x^2. Nor would", "start": 415.2, "duration": 5.2}, {"text": "you necessarily think of this cube whenever you're taking the derivative of x^3, both of them fall under a pretty", "start": 420.49, "duration": 5.51}, {"text": "recognizable pattern for polynomial terms the derivative of x^4 turns out to be 4x^3. The derivative", "start": 426.069, "duration": 7.531}, {"text": "of x^5 is 5x^4. The derivative of x to the n for any power n is nx^(n-1).", "start": 433.63, "duration": 12.97}, {"text": "This right here is what's known in the business as the power rule. In practice", "start": 446.699, "duration": 5.501}, {"text": "we all quickly just get jaded and think about this symbolically as the exponent", "start": 452.229, "duration": 4.271}, {"text": "hopping down in front leaving behind one less than itself. Rarely pausing to think about the", "start": 456.58, "duration": 5.12}, {"text": "geometric delights that underlie these derivatives. That's the kind of thing", "start": 461.77, "duration": 4.23}, {"text": "that happens when these tend to fall in the middle of much longer computations.", "start": 466.0, "duration": 3.7}, {"text": "But rather than tracking it all off to symbolic patterns let's just take a moment and think about why this works.", "start": 469.71, "duration": 5.59}, {"text": "For powers beyond just 2 and 3 when you nudge that input x, increasing it slightly to x + dx, working out the", "start": 475.3, "duration": 8.6}, {"text": "exact value of that nudged output would involve multiplying together these n separate x + dx terms.", "start": 483.909, "duration": 6.891}, {"text": "The full expansion would be really complicated but part of the point of derivatives is that most of that", "start": 490.8, "duration": 6.9}, {"text": "complication can be ignored. The first term in your expansion is x^n, this is analogous to the", "start": 497.7, "duration": 5.9}, {"text": "area of the original square or the volume of the original cube from our previous examples.", "start": 503.65, "duration": 6.85}, {"text": "For the next terms in the expansion, you can choose mostly x's with a single dx since there are", "start": 510.599, "duration": 12.601}, {"text": "n radicals from which you could have chosen that single dx. This gives us n separate terms all of which include", "start": 523.2, "duration": 6.9}, {"text": "n-1 x's times a dx giving a value of x^(n-1) times dx. This is analogous to how the majority of", "start": 530.12, "duration": 9.38}, {"text": "the new area in the square came from those two bars each with area x * dx,", "start": 539.51, "duration": 5.09}, {"text": "or how the bulk of the new volume in the cube came from those three thin squares.", "start": 544.64, "duration": 5.26}, {"text": "Each of which had a volume of x^2 times dx. There will be many other terms of this expansion", "start": 549.92, "duration": 6.88}, {"text": "but all of them are just going to be some multiple of dx^2 so we can safely ignore them.", "start": 556.8, "duration": 5.1}, {"text": "And what that means is that all but a negligible portion of the increase in the output", "start": 561.9, "duration": 4.9}, {"text": "comes from n copies of this x to the (n-1) * dx - that's what it means.", "start": 566.81, "duration": 5.89}, {"text": "For the derivative of x^n to be n * x^(n-1) and even though, like I said in practice, you'll find", "start": 572.72, "duration": 8.78}, {"text": "yourself performing this derivative quickly and symbolically imagining the exponent,", "start": 581.54, "duration": 3.96}, {"text": "hopping down to the front. Every now and then it's nice to just step back and remember why these rules work.", "start": 585.5, "duration": 7.4}, {"text": "Not just because it's pretty, and not just because it helps remind us that math actually makes sense", "start": 592.9, "duration": 4.0}, {"text": "and isn't just a pile of formulas to memorize. But because it flexes that very important muscle of", "start": 596.9, "duration": 5.9}, {"text": "thinking about derivatives in terms of tiny nudges. As another example think of the function f(x) = 1/x.", "start": 602.839, "duration": 9.161}, {"text": "Now, on the one hand you could just blindly try applying the power rule since 1/x", "start": 612.0, "duration": 6.2}, {"text": "is the same as writing x^(-1). That would involve letting the negative 1 hop down in front", "start": 618.2, "duration": 5.8}, {"text": "leaving behind 1 less than itself which is -2. But let's have some fun and see if we can reason about this", "start": 624.06, "duration": 6.54}, {"text": "geometrically rather than just plugging it through some formula. The value 1/x is asking what number", "start": 630.69, "duration": 7.81}, {"text": "multiplied by x equals 1, so here's how I'd like to visualize it - imagine a little", "start": 638.5, "duration": 5.4}, {"text": "rectangular puddle of water sitting in two dimensions whose area is 1, and let's say that its width is x.", "start": 643.949, "duration": 6.351}, {"text": "Which means that the height has to be 1/x since the total area of it is 1, so if x was", "start": 650.3, "duration": 7.1}, {"text": "stretched out to 2 then that height is forced down to 1/2 and if you increased x up to 3", "start": 657.42, "duration": 5.88}, {"text": "then the other side has to be squished down to 1/3 this is a nice way to think about the graph of 1/x.", "start": 663.3, "duration": 6.7}, {"text": "By the way, if you think of this with x of the puddle as being in the xy plane then that corresponding output 1/x,", "start": 670.0, "duration": 7.9}, {"text": "the height of the graph above that point is whatever the height of your puddle has to be to maintain an area of 1.", "start": 677.97, "duration": 2.19}, {"text": "So with this visual in mind for the derivative, imagine nudging up that value of x by some tiny amount,", "start": 686.459, "duration": 6.041}, {"text": "some tiny dx. How must the height of this rectangle change so that the area of the puddle remains", "start": 692.5, "duration": 6.7}, {"text": "constant at 1 - That is increasing the width by dx, add some new area to the right here so the puddle", "start": 699.209, "duration": 6.191}, {"text": "has to decrease in height by some d(1/x) so that the area lost off of that top cancels out the area gained.", "start": 705.4, "duration": 9.5}, {"text": "You should think of that d(1/x) as being a negative amount. By the way since it's decreasing the height", "start": 714.9, "duration": 6.5}, {"text": "of the rectangle and you know what I'm", "start": 721.47, "duration": 3.479}, {"text": "going to leave the last few steps here", "start": 724.949, "duration": 1.44}, {"text": "for you for you to pause and ponder and", "start": 726.389, "duration": 2.01}, {"text": "work out an ultimate expression and once", "start": 728.399, "duration": 2.43}, {"text": "you reason out what D of 1 over X / DX", "start": 730.829, "duration": 3.031}, {"text": "should be I want you to compare it to", "start": 733.86, "duration": 2.01}, {"text": "what you would have gotten if you had", "start": 735.87, "duration": 1.38}, {"text": "just blindly applied the power rule", "start": 737.25, "duration": 1.649}, {"text": "purely symbolically", "start": 738.899, "duration": 1.321}, {"text": "to", "start": 740.22, "duration": 0.51}, {"text": "X to the negative one and while I'm", "start": 740.73, "duration": 4.08}, {"text": "encouraging a deposit ponder here's", "start": 744.81, "duration": 1.68}, {"text": "another fun challenge if you're feeling", "start": 746.49, "duration": 1.409}, {"text": "up to it see if you can reason through", "start": 747.899, "duration": 2.161}, {"text": "what the derivative of the square root", "start": 750.06, "duration": 2.01}, {"text": "of x should be", "start": 752.07, "duration": 2.72}, {"text": "to finish things off I want to tackle", "start": 756.13, "duration": 2.25}, {"text": "one more type of function trigonometric", "start": 758.38, "duration": 2.22}, {"text": "functions and in particular let's focus", "start": 760.6, "duration": 2.31}, {"text": "on the sine function so for this section", "start": 762.91, "duration": 3.119}, {"text": "I'm going to assume that you're already", "start": 766.029, "duration": 1.141}, {"text": "familiar with how to think about trig", "start": 767.17, "duration": 1.95}, {"text": "functions using the unit circle the", "start": 769.12, "duration": 2.579}, {"text": "circle with the radius one centered at", "start": 771.699, "duration": 1.861}, {"text": "the origin", "start": 773.56, "duration": 0.829}, {"text": "for a given value of theta like say zero", "start": 774.389, "duration": 3.19}, {"text": "point eight you imagine yourself walking", "start": 777.579, "duration": 2.041}, {"text": "around the circle starting from the", "start": 779.62, "duration": 1.829}, {"text": "rightmost point until you've traversed", "start": 781.449, "duration": 1.861}, {"text": "that distance of zero point eight in arc", "start": 783.31, "duration": 2.67}, {"text": "length this is the same thing as saying", "start": 785.98, "duration": 2.37}, {"text": "that the angle right here is exactly", "start": 788.35, "duration": 2.099}, {"text": "theta radians", "start": 790.449, "duration": 1.32}, {"text": "since the circle has a radius of one", "start": 791.769, "duration": 2.24}, {"text": "then what sine of theta means is the", "start": 794.009, "duration": 3.25}, {"text": "height of that point above the x-axis", "start": 797.259, "duration": 2.461}, {"text": "and as your theta value increases and", "start": 799.72, "duration": 3.21}, {"text": "you walk around the circle your height", "start": 802.93, "duration": 2.19}, {"text": "Bob's up and down between negative one", "start": 805.12, "duration": 2.25}, {"text": "and one so when you graph sine of theta", "start": 807.37, "duration": 3.36}, {"text": "versus theta you get this wave pattern", "start": 810.73, "duration": 2.729}, {"text": "the quintessential wave pattern", "start": 813.459, "duration": 3.621}, {"text": "and just from looking at this graph we", "start": 817.08, "duration": 2.4}, {"text": "can start to get a feel for the shape of", "start": 819.48, "duration": 2.01}, {"text": "the derivative of the sine the slope at", "start": 821.49, "duration": 3.15}, {"text": "zero is something positive since sine of", "start": 824.64, "duration": 2.49}, {"text": "theta is increasing there and as we move", "start": 827.13, "duration": 3.03}, {"text": "to the right and sine of theta", "start": 830.16, "duration": 1.14}, {"text": "approaches its peak that slope goes down", "start": 831.3, "duration": 2.43}, {"text": "to zero then the slope is negative for a", "start": 833.73, "duration": 3.21}, {"text": "little while while the sine is", "start": 836.94, "duration": 1.71}, {"text": "decreasing before coming back up to zero", "start": 838.65, "duration": 2.1}, {"text": "as the sine graph levels out and as you", "start": 840.75, "duration": 4.05}, {"text": "continue thinking this through and", "start": 844.8, "duration": 1.38}, {"text": "drawing it out if you're familiar with", "start": 846.18, "duration": 1.77}, {"text": "the graph of trig functions you might", "start": 847.95, "duration": 1.98}, {"text": "guess that this derivative graph should", "start": 849.93, "duration": 2.19}, {"text": "be exactly cosine of theta since all the", "start": 852.12, "duration": 2.73}, {"text": "peaks and valleys line up perfectly with", "start": 854.85, "duration": 1.74}, {"text": "where the peaks and valleys for the", "start": 856.59, "duration": 1.44}, {"text": "cosine function should be and spoiler", "start": 858.03, "duration": 2.79}, {"text": "alert the derivative is in fact the", "start": 860.82, "duration": 1.92}, {"text": "cosine of theta but aren't you a little", "start": 862.74, "duration": 2.31}, {"text": "curious about why it's precisely cosine", "start": 865.05, "duration": 2.28}, {"text": "of theta I mean you could have all sorts", "start": 867.33, "duration": 2.07}, {"text": "of functions with peaks and valleys at", "start": 869.4, "duration": 1.68}, {"text": "the same points that have roughly the", "start": 871.08, "duration": 1.53}, {"text": "same shape but who knows maybe the", "start": 872.61, "duration": 2.04}, {"text": "derivative of sine could have turned out", "start": 874.65, "duration": 1.47}, {"text": "to be some entirely new type of function", "start": 876.12, "duration": 1.98}, {"text": "that just happens to have a similar", "start": 878.1, "duration": 1.95}, {"text": "shape well just like the previous", "start": 880.05, "duration": 2.49}, {"text": "examples a more exact understanding of", "start": 882.54, "duration": 2.94}, {"text": "the derivative requires looking at what", "start": 885.48, "duration": 1.77}, {"text": "the function actually represents rather", "start": 887.25, "duration": 2.1}, {"text": "than looking at the graph of the", "start": 889.35, "duration": 1.32}, {"text": "function so think back to that walk", "start": 890.67, "duration": 2.7}, {"text": "around the unit circle having traversed", "start": 893.37, "duration": 2.34}, {"text": "an arc with length theta and thinking", "start": 895.71, "duration": 2.16}, {"text": "about sine of theta as the height of", "start": 897.87, "duration": 1.77}, {"text": "that point", "start": 899.64, "duration": 1.66}, {"text": "now zoom in to that point on the circle", "start": 901.3, "duration": 2.37}, {"text": "and consider a slight nudge of D theta", "start": 903.67, "duration": 2.61}, {"text": "along their circumference a tiny step in", "start": 906.28, "duration": 2.82}, {"text": "your walk around the unit circle how", "start": 909.1, "duration": 2.7}, {"text": "much does that tiny step change the sign", "start": 911.8, "duration": 2.28}, {"text": "of theta how much does this increase D", "start": 914.08, "duration": 2.76}, {"text": "theta of arc length increase the height", "start": 916.84, "duration": 2.16}, {"text": "above the x-axis", "start": 919.0, "duration": 1.67}, {"text": "well zoomed in close enough the circle", "start": 920.67, "duration": 2.83}, {"text": "basically looks like a straight line in", "start": 923.5, "duration": 1.59}, {"text": "this neighborhood so let's go ahead and", "start": 925.09, "duration": 1.74}, {"text": "think of this right triangle where the", "start": 926.83, "duration": 2.25}, {"text": "hypotenuse of that right triangle", "start": 929.08, "duration": 1.5}, {"text": "represents the nudge D theta along the", "start": 930.58, "duration": 2.7}, {"text": "circumference and that left side here", "start": 933.28, "duration": 2.4}, {"text": "represents the change in height the", "start": 935.68, "duration": 2.01}, {"text": "resulting D sine of theta now this tiny", "start": 937.69, "duration": 2.88}, {"text": "triangle is actually similar to this", "start": 940.57, "duration": 2.1}, {"text": "larger triangle here with the defining", "start": 942.67, "duration": 2.22}, {"text": "angle theta and whose hypotenuse is the", "start": 944.89, "duration": 2.55}, {"text": "radius of the circle with length one", "start": 947.44, "duration": 3.02}, {"text": "specifically this little angle right", "start": 950.46, "duration": 2.47}, {"text": "here is precisely equal to theta radians", "start": 952.93, "duration": 3.47}, {"text": "now think about what the derivative of", "start": 956.4, "duration": 2.65}, {"text": "sine is supposed to mean it's the ratio", "start": 959.05, "duration": 2.73}, {"text": "between that D sine of theta the tiny", "start": 961.78, "duration": 2.58}, {"text": "change to the height divided by D theta", "start": 964.36, "duration": 2.52}, {"text": "the tiny change to the input of the", "start": 966.88, "duration": 1.98}, {"text": "function and from the picture we can see", "start": 968.86, "duration": 2.85}, {"text": "that that's the ratio between the length", "start": 971.71, "duration": 1.95}, {"text": "of the side adjacent to the angle theta", "start": 973.66, "duration": 2.3}, {"text": "divided by the hypotenuse well let's see", "start": 975.96, "duration": 3.22}, {"text": "adjacent divided by hypotenuse that's", "start": 979.18, "duration": 2.73}, {"text": "exactly what the cosine of theta means", "start": 981.91, "duration": 1.98}, {"text": "that's the definition of the cosine", "start": 983.89, "duration": 3.09}, {"text": "so this gives us two different really", "start": 986.98, "duration": 2.1}, {"text": "nice ways of thinking about how the", "start": 989.08, "duration": 1.35}, {"text": "derivative of sine is cosine one of them", "start": 990.43, "duration": 3.06}, {"text": "is looking at the graph and getting a", "start": 993.49, "duration": 1.5}, {"text": "loose feel for the shape of things based", "start": 994.99, "duration": 1.86}, {"text": "on thinking about the slope of the sine", "start": 996.85, "duration": 1.83}, {"text": "graph at every single point and the", "start": 998.68, "duration": 2.61}, {"text": "other is a more precise line of", "start": 1001.29, "duration": 1.56}, {"text": "reasoning looking at the unit circle", "start": 1002.85, "duration": 1.68}, {"text": "itself for those of you that like to", "start": 1004.53, "duration": 3.48}, {"text": "pause and ponder see if you can try a", "start": 1008.01, "duration": 1.8}, {"text": "similar line of reasoning to find what", "start": 1009.81, "duration": 1.98}, {"text": "the derivative of the cosine of theta", "start": 1011.79, "duration": 1.77}, {"text": "should be in the next video I'll talk", "start": 1013.56, "duration": 4.17}, {"text": "about how you can take derivatives of", "start": 1017.73, "duration": 1.56}, {"text": "functions who combine simple functions", "start": 1019.29, "duration": 2.07}, {"text": "like these ones either as sums or", "start": 1021.36, "duration": 2.04}, {"text": "products or function compositions things", "start": 1023.4, "duration": 2.01}, {"text": "like that and similar to this video the", "start": 1025.41, "duration": 2.31}, {"text": "goal is going to be to understand each", "start": 1027.72, "duration": 1.5}, {"text": "one geometrically in a way that makes it", "start": 1029.22, "duration": 2.25}, {"text": "intuitively reasonable and somewhat more", "start": 1031.47, "duration": 1.8}, {"text": "you", "start": 1048.864, "duration": 2.06}, {"text": "you", "start": 1051.284, "duration": 2.06}]