[{"text": "*intro*", "start": 0.0, "duration": 3.42}, {"text": "*clap*", "start": 3.88, "duration": 0.5}, {"text": "Cheating!", "start": 4.92, "duration": 0.86}, {"text": "(read the screen)", "start": 5.78, "duration": 1.66}, {"text": "*tsk*", "start": 11.96, "duration": 0.5}, {"text": "Come on guys. I've cheated. You've cheated.", "start": 12.46, "duration": 3.5}, {"text": "We've all cheated in some form or another.", "start": 16.0, "duration": 2.18}, {"text": "Although there are different degrees of cheating that the majority of us have agreed to be less acceptable than others,", "start": 18.34, "duration": 5.33}, {"text": "it's safe to assume that at some point in our lives, we have, or will eventually, cheat!", "start": 23.67, "duration": 5.189}, {"text": "Cheating on tests.", "start": 29.4, "duration": 1.56}, {"text": "Aside from relationships, this is probably the first situation that comes to mind for most of you.", "start": 30.96, "duration": 4.22}, {"text": "Yes, I've cheated, mostly everyone in the Chunin Exams cheated,", "start": 35.34, "duration": 3.44}, {"text": "I'm sorry mom and dad that you had to find out that your son was a dishonest boy,", "start": 38.78, "duration": 3.44}, {"text": "but can I just say that most methods of testing are a pretty poor way to actually determine a person's level of understanding on a topic.", "start": 42.26, "duration": 7.04}, {"text": "The majority of tests are designed for you to simply regurgitate information in a given amount of time.", "start": 49.3, "duration": 5.78}, {"text": "They are designed to test your memory.", "start": 55.12, "duration": 2.12}, {"text": "Which is fair, to an extent, you need to be able to retain some information without relying on the source,", "start": 57.24, "duration": 4.5}, {"text": "but if it's strictly memory based, then that doesn't encourage a deeper level of understanding on the content.", "start": 61.8, "duration": 6.22}, {"text": "And what ends up happening is students will just study for a test and then forget that information afterwards to make room for the next test.", "start": 68.02, "duration": 6.32}, {"text": "They're not learning the content.", "start": 74.34, "duration": 1.86}, {"text": "They're just learning how to temporarily contain it, and then repeat it to the tester.", "start": 76.2, "duration": 4.06}, {"text": "Does... does that make the person who takes the test... The Testtee?", "start": 80.62, "duration": 3.88}, {"text": "Pla*GIA*rism", "start": 84.5, "duration": 1.3}, {"text": "also known as plagiarism is another form of cheating, and of course I do not condone it.", "start": 85.8, "duration": 5.02}, {"text": "I can't tell you how many times my comics and videos get reuploaded without proper crediting, as opposed to cheating on tests where you're just", "start": 90.84, "duration": 6.54}, {"text": "transferring information from the source to your brain and to the examination.", "start": 97.38, "duration": 3.9}, {"text": "Plagiarism is transferring the content from the source to an audience and then saying:", "start": 101.68, "duration": 4.36}, {"text": "\"This, this is mine. I-I made this... By myself...", "start": 106.34, "duration": 3.62}, {"text": "All me baby!\"", "start": 111.16, "duration": 0.94}, {"text": "And that just sets up a shitstorm of confusion among people. Don't-don't do it,", "start": 112.1, "duration": 4.44}, {"text": "It's pretty much theft, just-just give credit and be on your merry way, okay?", "start": 116.54, "duration": 5.14}, {"text": "Just-just go, just stop writing your name on other people's shit.", "start": 121.68, "duration": 3.74}, {"text": "Cheating on games can be a little different, if you're playing with friends and a certain level of an honor system is necessary", "start": 126.22, "duration": 6.06}, {"text": "for the enjoyment of the game, then don't cheat! Where's the fun in that?", "start": 132.28, "duration": 3.98}, {"text": "\"I won because you trusted me, and I took that trust and said fuck you, I actually wasn't closing my eyes when you went to hide, bitch!\"", "start": 136.26, "duration": 7.68}, {"text": "Even if you're playing with strangers, like on an online video game, and you're killing everyone with hacks,", "start": 143.94, "duration": 4.52}, {"text": "how is that enjoyable? The only reason I can think of is maybe they need a way to feel like they're above other people,", "start": 148.48, "duration": 5.399}, {"text": "so they can feel a little better about their sad selves, by brutally murdering everyone on the server? I don't know.", "start": 153.92, "duration": 6.559}, {"text": "Hacking is like bringing a bomb to show and tell, when it's not show and tell day.", "start": 161.0, "duration": 4.22}, {"text": "Cheating on solo games.", "start": 165.8, "duration": 1.8}, {"text": "Eh, go for it. If you are the only participant of th e game, then cheating on it just destroys the value of your experience.", "start": 167.88, "duration": 6.84}, {"text": "I'm sure the developers who work hard on the game would have preferred that you actually go through the content,", "start": 174.94, "duration": 4.439}, {"text": "but if you're willing to just skip to the end,", "start": 179.38, "duration": 2.0}, {"text": "then you're probably not in their intended demographic. The game doesn't give a fuck if you cheated!", "start": 181.48, "duration": 5.16}, {"text": "\"You saved the princess in two minutes?", "start": 187.38, "duration": 2.44}, {"text": "uh, cool, y-yeah, well-well that's what we'd hoped you'd do,", "start": 189.82, "duration": 3.9}, {"text": "just kind of expected it to take at least, 10 hours or so, but yeah, this is fine, too!\"", "start": 193.72, "duration": 5.14}, {"text": "\"I can do it quicker... I must be quicker!\"", "start": 199.24, "duration": 3.26}, {"text": "\"What the hell's wrong with him?\"", "start": 203.78, "duration": 1.97}, {"text": "\"I hear he's what they call... A 'speedrunner'\"", "start": 205.75, "duration": 3.41}, {"text": "And then of course there's cheating in relationships, and that... That, I just can't seem to understand how some people can justify it.", "start": 209.38, "duration": 7.7}, {"text": "\"Well, he was kind of being a jerk to me the other day", "start": 217.48, "duration": 2.2}, {"text": "and then he was...\"\n\"Okay, well then talk to him and have a discussion about your problems like mature people?\"", "start": 219.68, "duration": 5.58}, {"text": "\"Yeah, but he's always a jerk and doe sn't treat me right.\"", "start": 225.26, "duration": 3.34}, {"text": "\"Then why the fuck are you still with him? Unless he's holding you hostage, in which case", "start": 228.6, "duration": 3.68}, {"text": "you should probably call the police, then you have no reason to stay in something you can't fix.\"", "start": 232.3, "duration": 4.44}, {"text": "Maybe if you were forced into an arranged marriage, but you don't exactly agree with the practice and never loved your partner,", "start": 236.86, "duration": 5.08}, {"text": "but you did love another and the marriage is not exactly something you can just walk out of,", "start": 241.94, "duration": 3.38}, {"text": "then okay that might be one of the few complicated situations where I'd encourage picking the person you actually love.", "start": 245.419, "duration": 5.81}, {"text": "But if you yourself had the choice to get into the relationship, then you should have the choice to leave as well, right?", "start": 251.23, "duration": 5.729}, {"text": "-Right?!\n-...Yes...", "start": 257.92, "duration": 1.72}, {"text": "If you've fallen out of love with someone, how does finding temporary solace in someone else solve that,", "start": 259.92, "duration": 5.54}, {"text": "and if they're not temporary why not finish your business before moving on to the next?", "start": 265.46, "duration": 4.14}, {"text": "Why do they have to intersect? You know how at restaurants you have appetizers,", "start": 269.9, "duration": 3.38}, {"text": "and you're done eating them, and your server points to your empty plate and asks, \"Can I take that away for you hon?\"", "start": 273.28, "duration": 4.92}, {"text": "Because you know you probably have no use for an empty plate and need some room on the table for your next dish,", "start": 278.2, "duration": 5.0}, {"text": "you're not going to be like \"No. I wish for this plate to remain where it is.\"", "start": 283.2, "duration": 4.92}, {"text": "Unless you're one of those people who eat their appetizers alongside with their entrées, in which case this is a poor metaphor,", "start": 288.12, "duration": 5.36}, {"text": "but the point is there, don't waste other people's time.", "start": 293.48, "duration": 3.28}, {"text": "I understand that surveying people on the internet can sometimes be a poor choice when you want honest answers to your questions,", "start": 297.28, "duration": 5.22}, {"text": "because half the people just want a shot at trying to be funny,", "start": 302.5, "duration": 2.46}, {"text": "but I tweeted asking if there was a situation where cheating on someone was acceptable.", "start": 304.96, "duration": 4.56}, {"text": "I already believed that there wasn't, but I think it's safe to say that most people would agree as well.", "start": 309.92, "duration": 4.7}, {"text": "The people who did try to validate it were the ones who believed in fighting fire with fire, if they cheat on you first then you can cheat on them too.", "start": 315.3, "duration": 6.76}, {"text": "If they mistreat you first, then do wrong back to them.", "start": 322.06, "duration": 2.92}, {"text": "If they loved you unconditionally with all their heart, then *psh* love em' right back! That'll show em'! Take that bitch!", "start": 325.18, "duration": 5.82}, {"text": "Hey guys!", "start": 332.5, "duration": 0.5}, {"text": "Just want to give my thanks to dollar shave club for sponsoring this video.", "start": 333.0, "duration": 3.7}, {"text": "If you guys are in need a very affordable and very effective shaving razors you can check out", "start": 336.7, "duration": 4.82}, {"text": "dollarshaveclub.com/domics", "start": 341.52, "duration": 2.04}, {"text": "or click the link in the description and start your one month trial of any razor for only a dollar.", "start": 343.76, "duration": 4.8}, {"text": "They'll deliver your top-of-the-line razors straight to you every month so you won't have to worry about troubling yourself to go to the store.", "start": 348.56, "duration": 6.309}, {"text": "Free shipping, no commitments, cancel anytime.", "start": 354.869, "duration": 2.571}, {"text": "Dollar Shave Club offers a selection of different razors to fit your needs, and not only that, they also have body cleansers, shampoo, and conditioners available.", "start": 357.44, "duration": 7.52}, {"text": "Pretty much the whole bathroom experience", "start": 364.96, "duration": 1.9}, {"text": "conveniently at one place. Again, that's", "start": 367.0, "duration": 2.14}, {"text": "dollarshaveclub.com/domics", "start": 369.14, "duration": 2.26}, {"text": "one dollar for the first month, happy shaving and enjoy.", "start": 371.4, "duration": 3.84}, {"text": "(yay finally done with the captions...)", "start": 376.46, "duration": 0.5}, {"text": "*SHAMELESS SELF PLUG*\nfollow me on tumblr @caliswager pls k tnx", "start": 378.54, "duration": 0.5}]