[{"text": "Want to see more cool videos on our channel we do", "start": 7.0, "duration": 2.84}, {"text": "So press this Bell and enable to send notifications the seven wonders of the natural world may have been named to quickly", "start": 9.84, "duration": 7.17}, {"text": "Wonders like the Grand Canyon and Victoria Falls are certainly big and anyone who sees them will surely be impressed", "start": 17.529, "duration": 6.799}, {"text": "But sheer size isn't enough to truly leave a person in awe. There are other places in this world though that are far stranger", "start": 24.97, "duration": 7.699}, {"text": "places that seem almost alien as if they could only exist on a planet that evolved separately from our own these are places that", "start": 33.28, "duration": 7.79}, {"text": "Scientists have had to struggle just to understand how they ever could have been formed", "start": 41.44, "duration": 4.25}, {"text": "places that will truly make you wonder not just because they're beautiful but because they seem to follow", "start": 46.21, "duration": 5.9}, {"text": "Scientific laws that don't exist anywhere else on earth", "start": 52.48, "duration": 3.17}, {"text": "number 10 Devil's kettle as", "start": 56.62, "duration": 2.27}, {"text": "far as natural mysteries go The Devil's kettle in Minnesota is one of the most intriguing ones at a", "start": 59.38, "duration": 6.079}, {"text": "Particular point along the Brule River the river's water splits into two one split continues", "start": 66.04, "duration": 5.989}, {"text": "Its course onto the Lake Superior and the other split. Well, we have no clue where it goes", "start": 72.03, "duration": 5.849}, {"text": "Scientists know it has to end up somewhere, but we don't know where that is", "start": 79.03, "duration": 4.279}, {"text": "Scientists first tried putting dye into the kettle and waited to see which part of the lake turns up colors", "start": 84.31, "duration": 5.33}, {"text": "It was a futile effort. Nothing turned up", "start": 89.89, "duration": 3.05}, {"text": "Next they decided to try it with ping pong balls. They also vanished without a trace", "start": 93.7, "duration": 5.15}, {"text": "What the hell is going on?", "start": 99.549, "duration": 2.0}, {"text": "We all know that laws of science dictate that the water has to turn up somewhere", "start": 101.799, "duration": 4.31}, {"text": "Even if it is being stored underground there should be markings and it should be traceable", "start": 106.479, "duration": 5.33}, {"text": "Aliens parallel universe glitch in our programming some Mayan trick your guess is as good as mine", "start": 112.6, "duration": 7.79}, {"text": "number 9 has Dolan lights", "start": 121.09, "duration": 2.18}, {"text": "Residents of his doll and Valley Norway are continually living in a realm of great scientific mystery", "start": 124.33, "duration": 5.509}, {"text": "Almost every night lights appear in the sky. They are of bright colors. They dance around shift shapes", "start": 130.299, "duration": 6.95}, {"text": "Unmistakeably and disappear only to appear the next day during the night. This has been going on for four decades at least", "start": 138.73, "duration": 7.639}, {"text": "Scientists are perplexed by this mystery", "start": 147.7, "duration": 2.0}, {"text": "There are theories though", "start": 149.86, "duration": 1.34}, {"text": "but none seems to be good enough since at least the early 1930s people have spotted the lights and", "start": 151.2, "duration": 6.24}, {"text": "Hypothesized what could be causing them one theory suggests that the lake is radioactive", "start": 157.78, "duration": 4.669}, {"text": "The radon Rides dust particles and upon elevations it decays and produces lights", "start": 162.97, "duration": 5.419}, {"text": "Another theory suggests that the base of the valley is full of sulfuric acid", "start": 169.09, "duration": 4.009}, {"text": "Sulfur reacts to the water and produces what scientists call sparks", "start": 173.769, "duration": 4.01}, {"text": "Hundreds of tests have been performed to pinpoint the exact cause but to no avail", "start": 178.36, "duration": 4.669}, {"text": "number eight movile cave in", "start": 183.97, "duration": 2.479}, {"text": "southeastern romania there is a cave that was locked away from the slightest ray of light for five point five million years and that", "start": 187.18, "duration": 8.0}, {"text": "Has a completely different atmosphere from the earth. The cave was discovered by workers looking to set up a power plant", "start": 195.18, "duration": 6.51}, {"text": "they tested the ground to see if it was a safe place to build and", "start": 201.85, "duration": 3.649}, {"text": "Cracked open a pathway that leads into one of the strangest places on earth", "start": 205.6, "duration": 3.799}, {"text": "If you descend through the narrow shaft and past a series of tunnels you enter a chamber with a lake of sulfuric water", "start": 209.859, "duration": 7.279}, {"text": "stinking of rotten eggs, the air there is toxic filled with hydrogen sulfide and", "start": 217.359, "duration": 5.57}, {"text": "contaminated with 100 times the surfaces level of carbon dioxide", "start": 223.48, "duration": 3.229}, {"text": "The strangest part though. Is that a whole ecosystem has survived inside it", "start": 227.59, "duration": 4.729}, {"text": "Researchers have found 33 species inside the cave that don't exist anywhere outside of it", "start": 232.959, "duration": 5.48}, {"text": "They've adapted to survive in a sulfuric atmosphere living by feeding off a foam on top of the stones", "start": 238.69, "duration": 6.139}, {"text": "number 7 Lake Karachay", "start": 245.65, "duration": 2.0}, {"text": "The Soviet Union had many nuclear facilities and most of them were ill planned and unsafe", "start": 248.41, "duration": 5.839}, {"text": "Inside one such factory there is a lake the lakes water has more radioactive material than anywhere else on earth", "start": 254.889, "duration": 7.25}, {"text": "Lake Karachay is so radioactive that you will die within an hour if you stand near it", "start": 262.539, "duration": 6.23}, {"text": "Soviets dumped nuclear waste into the lake their nuclear practices have caused a few problems with the lake in the past in", "start": 269.409, "duration": 7.34}, {"text": "1957 an explosion blew the factory apart and the radioactive particles spread more than", "start": 277.48, "duration": 5.3}, {"text": "23,000 kilometers the area is more radioactive than Chernobyl", "start": 283.42, "duration": 4.369}, {"text": "The lake has been covered with concrete to keep these disasters from happening", "start": 287.79, "duration": 4.32}, {"text": "Still the entire place is eerily unstable and massively radioactive", "start": 292.81, "duration": 4.849}, {"text": "number 6 the Doubletree of kiss or sow in the countryside of pia Monti Italy", "start": 298.3, "duration": 5.779}, {"text": "There is an unusual sight. There is a cherry tree there that looks in most respects", "start": 304.08, "duration": 5.22}, {"text": "Just like any other healthy cherry tree except that it happens to be growing directly on top of a mulberry tree", "start": 309.3, "duration": 6.72}, {"text": "This isn't completely unprecedented", "start": 316.9, "duration": 2.0}, {"text": "Parasitic trees have grown out of others before", "start": 319.81, "duration": 2.179}, {"text": "But normally they are small stunted things that live short lives before falling off the double tree of couse orzo", "start": 322.39, "duration": 7.67}, {"text": "though consists of two fully formed healthy trees each spreading its branches 5 metres across", "start": 330.06, "duration": 6.299}, {"text": "Nobody quite knows how it happened the locals believe that a bird may have dropped a cherry seed on top of the mulberry tree", "start": 337.33, "duration": 6.709}, {"text": "The seed grew roots that push through the mulberry trees hollow trunk and reached all the way to the soil below", "start": 344.26, "duration": 6.08}, {"text": "Letting it survive and grow into a full healthy tree", "start": 350.71, "duration": 3.619}, {"text": "number 5 the sleeping city of cahuachi", "start": 355.06, "duration": 2.75}, {"text": "The city of cahuachi kazakhstan is not disney's creation. It is as real as it gets", "start": 358.66, "duration": 5.599}, {"text": "citizens of kolache face a very peculiar epidemic", "start": 365.23, "duration": 3.17}, {"text": "People just collapse into naps randomly even while walking on the road", "start": 368.77, "duration": 4.579}, {"text": "They also report memory loss fatigue and hallucinations", "start": 373.81, "duration": 3.86}, {"text": "The epidemic affects people from all genders and ages", "start": 378.28, "duration": 3.319}, {"text": "Kazakhstan has even recommended evacuations", "start": 382.57, "duration": 2.48}, {"text": "But they are no closer to solving the problem one theory suggests that the residents are facing some kind of radiation poisoning", "start": 385.12, "duration": 7.22}, {"text": "Since the area is near a uranium mine", "start": 392.59, "duration": 2.149}, {"text": "However, there are flaws in that theory all the blood tests and other monitoring has turned up zero evidence", "start": 395.11, "duration": 6.559}, {"text": "Secondly, there is a town which is closer to the mind than kolache and they have reported no such epidemic", "start": 402.73, "duration": 6.349}, {"text": "number four circles of namibia", "start": 409.659, "duration": 2.54}, {"text": "There is an ecological mystery sitting throughout Namibian deserts", "start": 412.75, "duration": 3.889}, {"text": "There are fields of grass with circles carved in them at regular intervals", "start": 417.009, "duration": 4.61}, {"text": "The circles are almost perfectly created and can range from 10 to 65 feet in diameter", "start": 421.99, "duration": 5.839}, {"text": "And by the way, if you are thinking of the movie the signs you are not alone", "start": 427.84, "duration": 5.089}, {"text": "Forget explaining the circles", "start": 433.599, "duration": 2.0}, {"text": "Scientists are not even sure of the more basic questions such as why are there circles? Why not any random shape?", "start": 435.879, "duration": 7.01}, {"text": "Nothing grows in these circle patches", "start": 443.74, "duration": 2.0}, {"text": "scientists have come up with various theories and all have been debunked almost immediately in", "start": 446.349, "duration": 5.48}, {"text": "2013 norbert Jergens an environmental scientist said that termites were the cause of the circles, but in 2015", "start": 452.439, "duration": 7.04}, {"text": "biologist Walter Schinkel tested the hypothesis and disproved it number three the hum of Taos a", "start": 460.27, "duration": 6.769}, {"text": "Barely audible buzzing sound that you cannot pinpoint can infuriate you", "start": 467.83, "duration": 4.639}, {"text": "we have all been there when a distant lawnmower or our TV starts making a buzz and", "start": 472.75, "duration": 5.179}, {"text": "Unless and until we don't find where it's coming from. It feels like our brain is eating itself from the inside", "start": 478.3, "duration": 6.019}, {"text": "Now imagine the pain and frustration of residents of Taos in New Mexico since the early 1990s", "start": 485.229, "duration": 6.77}, {"text": "Large numbers of residents of Taos have complained about a constant humming sound", "start": 492.629, "duration": 4.2}, {"text": "It can be heard all around the town and has driven people nuts", "start": 496.96, "duration": 4.22}, {"text": "For twenty years various investigators have tried to locate the hum", "start": 501.669, "duration": 4.04}, {"text": "But to no success some scientists have hypothesized", "start": 505.779, "duration": 3.29}, {"text": "that the town's residents are super hearers who can detect sound that ordinary humans can't", "start": 509.379, "duration": 5.72}, {"text": "But doesn't that raise more questions than it answers", "start": 515.529, "duration": 3.08}, {"text": "number two", "start": 519.43, "duration": 1.469}, {"text": "never-ending lightning storm in", "start": 520.899, "duration": 2.0}, {"text": "Western Venezuela over the Catatumbo River there is a storm that never ceases", "start": 522.969, "duration": 5.42}, {"text": "Starting at 7:00 p.m. Every night lightning crashes over the water for 10 hours every night", "start": 528.94, "duration": 5.509}, {"text": "260 nights each year", "start": 535.63, "duration": 1.92}, {"text": "Nobody knows for sure why it happens up until recently the leading theory was that it had something to do with uranium in the bedrock", "start": 537.55, "duration": 6.84}, {"text": "Although scientists are starting to doubt it today the leading theory is a complicated one", "start": 544.7, "duration": 5.029}, {"text": "It posits that the shape of the mountains caused warm trade winds to collide with cold air from the Andes", "start": 549.8, "duration": 5.9}, {"text": "That collision is then fueled by the rapidly evaporating water below and methane from a nearby oil field", "start": 555.92, "duration": 6.229}, {"text": "Nobody actually knows for sure though why it happens", "start": 562.88, "duration": 2.839}, {"text": "Everything about it is mysterious", "start": 566.36, "duration": 2.0}, {"text": "Including one moment in 2010 when it inexplicably stopped one day the storm just died down without", "start": 568.7, "duration": 7.369}, {"text": "Explanation and seemed for a while to be over then after six weeks of silence", "start": 576.41, "duration": 5.6}, {"text": "It sparked up again and has been raging ever since", "start": 582.01, "duration": 3.449}, {"text": "number one the boiling River", "start": 586.22, "duration": 2.059}, {"text": "Deep in the Amazon lies a river four miles long and unlike any other on earth", "start": 588.95, "duration": 5.0}, {"text": "The shehnai Tim fishka is so hot that any animal that steps into it gets boiled alive", "start": 594.44, "duration": 6.26}, {"text": "When a hapless creature wanders in the eyes cook first melting in its skull", "start": 601.25, "duration": 4.94}, {"text": "Soon the animal is in too much pain to keep swimming to safety", "start": 606.74, "duration": 3.739}, {"text": "water fills its mouth and lungs and it is cooked from the inside out the", "start": 610.88, "duration": 4.82}, {"text": "River gets as hot as 91 degrees Celsius", "start": 616.22, "duration": 3.08}, {"text": "196 degrees fahrenheit and", "start": 620.3, "duration": 2.0}, {"text": "Scientists aren't completely sure. Why?", "start": 622.64, "duration": 2.0}, {"text": "Normally water that gets this hot is fed by a volcano", "start": 625.25, "duration": 3.229}, {"text": "But this one is 700 kilometres removed from the nearest one. There is a theory though", "start": 628.76, "duration": 5.809}, {"text": "scientists believe that boiling hot water from under the earth cracks through fault lines and heats up the river making the water a", "start": 635.18, "duration": 7.399}, {"text": "geothermal system unlike any other on earth", "start": 643.01, "duration": 2.51}, {"text": "Thank you so much for watching. And if you enjoy the video, please let me know by clicking the like button", "start": 646.459, "duration": 5.119}, {"text": "Do share write a comment and don't forget to subscribe so that you can catch up my next video", "start": 652.1, "duration": 5.359}]