[{"text": "Back in February of 2019, I released a video\nentitled “Building my Dream Computer.”", "start": 12.07, "duration": 5.69}, {"text": "In that video I made the case for making a\nmodern 8 or 16 bit computer made from all", "start": 17.76, "duration": 5.62}, {"text": "off the shelf components.", "start": 23.38, "duration": 2.34}, {"text": "Since we don’t have the rights to the Commodore\nbrand name, I had given it a temporary code-name", "start": 25.72, "duration": 4.26}, {"text": "of Commander 16. After all, Commander has\nthe same number of syllables and same number", "start": 29.98, "duration": 4.57}, {"text": "of letters, and the two words actually have\nsimilar meanings. Despite being a temporary", "start": 34.55, "duration": 4.71}, {"text": "code name, that name turned out to be quite\npopular, so we decided to keep it. However,", "start": 39.26, "duration": 4.56}, {"text": "we were concerned about people abbreviating\nit to C16, which might be easily confused", "start": 43.82, "duration": 4.899}, {"text": "with the Commodore 16, which is a very different\nproduct. So, we changed the name to Commander", "start": 48.719, "duration": 5.101}, {"text": "X16 so that people would abbreviate it X16\ninstead.", "start": 53.82, "duration": 3.57}, {"text": "And so, I’m going to give you an update\non what has transpired over the last 6 months.", "start": 57.39, "duration": 5.16}, {"text": "And, the first priority was to find a working\nvideo chip, even if it was temporary.", "start": 62.55, "duration": 5.14}, {"text": "In the last video I showed the Gameduino being\nused in a little adapter card on the user", "start": 67.69, "duration": 5.15}, {"text": "port. This actually worked fine and it allowed\nme to do some experimentation with low-level", "start": 72.84, "duration": 4.23}, {"text": "SPI programming as well as kernel development.\nKevin ended up making a custom board for me", "start": 77.07, "duration": 5.089}, {"text": "that had the gameduino integrated onto the\nboard. I was able to get the board working", "start": 82.159, "duration": 4.261}, {"text": "on the C64, and with slight modifications\nto the code, I also had it working on the", "start": 86.42, "duration": 3.87}, {"text": "VIC-20.", "start": 90.29, "duration": 1.41}, {"text": "The graphics capabilities of the Gameduino\nare far superior to the Commodore 64, which", "start": 91.7, "duration": 4.65}, {"text": "was one of my requirements for a video chip.\nHowever, it did lack a true bitmap mode, which", "start": 96.35, "duration": 5.67}, {"text": "concerned a lot of people. I wasn’t terribly\nconcerned since it had so many sprites you", "start": 102.02, "duration": 4.82}, {"text": "could use them together to create a pseudo\nbitmap mode for those sort of games that needed", "start": 106.84, "duration": 4.0}, {"text": "it. Still, this wasn’t the biggest hurdle\nto overcome. The biggest problem was speed.", "start": 110.84, "duration": 5.09}, {"text": "It uses an SPI interface, which is not ideal\nfor an 8-bit system. I had asked the community", "start": 115.93, "duration": 5.83}, {"text": "if anyone could modify the gameduino to work\non an 8-bit system bus and there were a few", "start": 121.76, "duration": 4.13}, {"text": "volunteers for the job. But it turns out the\nGameduino was designed on an obsolete Spartan", "start": 125.89, "duration": 4.34}, {"text": "3 and not that many people were familiar with\nit. And so, this product hung in the balance", "start": 130.23, "duration": 4.78}, {"text": "for some time as to whether or not it would\nbe the final video chip.", "start": 135.01, "duration": 4.68}, {"text": "Another problem we faced is with the 65816\nprocessor. I had originally said I wanted", "start": 139.69, "duration": 4.86}, {"text": "to use this processor because it had a 24-bit\naddress bus and could therefor address up", "start": 144.55, "duration": 4.2}, {"text": "to 16 megabytes of RAM. However, this presented\nanother problem. You see, the 6502 has 16", "start": 148.75, "duration": 5.959}, {"text": "address lines. These are the lines it uses\nto tell the rest of the system which byte", "start": 154.709, "duration": 3.551}, {"text": "of RAM its currently working with. And it\nhas 8 data lines. These are the lines that", "start": 158.26, "duration": 4.31}, {"text": "allow it to read and write a byte of RAM somewhere\nin the system. Well let’s look at the 65816.", "start": 162.57, "duration": 5.89}, {"text": "It has the same number of pins as the 6502.\nIt also has 16 address and 8 data lines. But", "start": 168.46, "duration": 6.91}, {"text": "in order to address 16 megabytes of RAM, it\nshould technically have 24 address lines.", "start": 175.37, "duration": 5.38}, {"text": "So where are they? Well, it shares them with\nthe data lines. Yes, these 8 data lines alternate", "start": 180.75, "duration": 5.79}, {"text": "during the clock cycle to be data lines or\nthe upper 8 address lines. This behavior is", "start": 186.54, "duration": 5.39}, {"text": "extremely annoying and requires a lot of external\ncircuitry to decode this and split it out.", "start": 191.93, "duration": 5.74}, {"text": "The board had already gotten complex due to\nthis, but things continued to get worse. You", "start": 197.67, "duration": 4.09}, {"text": "see, I never really wanted to use any FPGAs\non the system to begin with. But I conceded", "start": 201.76, "duration": 4.52}, {"text": "that we would have to for the video chip.\nBut before long, some of the guys working", "start": 206.28, "duration": 4.35}, {"text": "on the board design ended up having 3 FPGAs\non the board, along with all other sorts of", "start": 210.63, "duration": 4.53}, {"text": "complex things like DMA controllers. And at\nsome point I just started to feel like this", "start": 215.16, "duration": 4.44}, {"text": "project had allowed feature creep to spiral\nout of control and it really no longer resembled", "start": 219.6, "duration": 4.49}, {"text": "the system I originally wanted.", "start": 224.09, "duration": 2.22}, {"text": "I also had a strong belief that this board\nwould wind up still born.", "start": 226.31, "duration": 4.54}, {"text": "To illustrate the problem, imagine you have\n10 components. And you can’t test component", "start": 230.85, "duration": 4.41}, {"text": "A without all of the rest of the components\nworking. And you can’t test component B", "start": 235.26, "duration": 5.05}, {"text": "without all of the other components working,\nand so on. This means that if you make any", "start": 240.31, "duration": 3.92}, {"text": "mistake anywhere, the whole board won’t\nwork and it will be impossible to figure out", "start": 244.23, "duration": 4.4}, {"text": "which part is not working. At this point I\nwas really becoming skeptical that this project", "start": 248.63, "duration": 4.56}, {"text": "was ever going to work. And even if it did,\nit really no longer lined up with my original", "start": 253.19, "duration": 4.43}, {"text": "goal.", "start": 257.62, "duration": 1.07}, {"text": "And just to reiterate, I just wanted a computer\nthat was similar to the Commodore 64 but made", "start": 258.69, "duration": 5.84}, {"text": "from all off the shelf components and probably\na little bit more powerful.", "start": 264.53, "duration": 3.81}, {"text": "Then one day I was cleaning up my studio room\nand I came across this VIC-20 motherboard", "start": 268.34, "duration": 4.53}, {"text": "I had been using to test chips in a few months\nearlier. I started looking at the board and", "start": 272.87, "duration": 4.72}, {"text": "had an epiphany. I realized that every single\nchip and component on this board is still", "start": 277.59, "duration": 5.15}, {"text": "available today, except for the video chip\nitself. I sat there and thought about it for", "start": 282.74, "duration": 4.92}, {"text": "a while and realized we could essentially\nbuild a VIC-20. This would mean going back", "start": 287.66, "duration": 4.47}, {"text": "to the 6502 processor. Of course, our VIC-20\nwould have a lot more RAM, better video, and", "start": 292.13, "duration": 4.61}, {"text": "better audio. So, it wouldn’t have any of\nthe shortcomings of the VIC-20. But it would", "start": 296.74, "duration": 3.77}, {"text": "have the advantage that it is a known working\ndesign, which greatly reduces the amount of", "start": 300.51, "duration": 4.72}, {"text": "untested features.", "start": 305.23, "duration": 1.47}, {"text": "The VIC-20 design also has another important\naspect, it’s super simple. And that was", "start": 306.7, "duration": 5.22}, {"text": "always one of my goals. I wanted the computer\nto be easy enough for a single person to understand", "start": 311.92, "duration": 4.33}, {"text": "the whole board, and I wanted it to be easy\nto program. Just as an example, if you look", "start": 316.25, "duration": 4.76}, {"text": "at the C64 memory map, the first 32K is pretty\neasy to use, but then the rest of the RAM", "start": 321.01, "duration": 5.07}, {"text": "is all shared with different things. And using\nthe last 12K of RAM is actually a real pain", "start": 326.08, "duration": 4.27}, {"text": "in the rear.", "start": 330.35, "duration": 1.86}, {"text": "By comparison, if you look at the VIC-20 memory\nmap, there is no banking. Everything stays", "start": 332.21, "duration": 3.95}, {"text": "exactly where it is all of the time. The bad\nnews is that you can usually only get about", "start": 336.16, "duration": 4.58}, {"text": "32K of RAM in a VIC-20. So obviously we would\nneed some way to increase that. I also need", "start": 340.74, "duration": 4.63}, {"text": "to explain how a VIC-20 or C64 handle their\nvideo RAM. You see, the memory in these computers", "start": 345.37, "duration": 6.08}, {"text": "runs a 2 mhz. And the CPU takes turns with\nthe video chip accessing the RAM on alternating", "start": 351.45, "duration": 6.18}, {"text": "clock cycles. So the CPU runs effectively\nat 1 mhz. This also means you need to have", "start": 357.63, "duration": 5.41}, {"text": "room in your memory map for video RAM and\ncharacter ROM. However, since our video chip", "start": 363.04, "duration": 5.21}, {"text": "will use its own RAM this whole setup is unnecessary.\nThis frees up a lot of the design.", "start": 368.25, "duration": 5.86}, {"text": "When you look at the crystal that runs a Commodore\n64 or VIC-20, the speed of these crystals", "start": 374.11, "duration": 4.029}, {"text": "is often based on the NTSC or PAL signal frequency.\nSo, for example, the NTSC version of the C64", "start": 378.139, "duration": 6.501}, {"text": "has a clock crystal running just over 14 mhz.\nThis signal is divided up with logic chips", "start": 384.64, "duration": 5.27}, {"text": "to produce the the color sub-carrier frequency,\nthe dot-clock, the memory bus speed, and eventually", "start": 389.91, "duration": 4.8}, {"text": "the CPU speed, which as I mentioned runs half\nof the memory bus speed because it alternates", "start": 394.71, "duration": 4.29}, {"text": "cycles with the video chip. It’s also important\nto realize that other chips like the SID-chip", "start": 399.0, "duration": 5.05}, {"text": "and the CIA chips have timers and all work\noff of those frequencies as well. That is", "start": 404.05, "duration": 4.66}, {"text": "why it is nearly impossible to overclock a\ncomputer like this, as all of these things", "start": 408.71, "duration": 4.48}, {"text": "are dependent on that main clock signal, and\nmessing with any one of them can cause significant", "start": 413.19, "duration": 5.09}, {"text": "problems.", "start": 418.28, "duration": 1.0}, {"text": "However, since the Commander X16 will be using\nVGA and the video chip is going to have its", "start": 419.28, "duration": 4.51}, {"text": "own clock, the speed of the CPU is less constrained.\nThe 65c02 is technically rated at 14 mhz,", "start": 423.79, "duration": 7.87}, {"text": "but we knew there would be other chips on\nthe board that might present a bottleneck", "start": 431.66, "duration": 2.99}, {"text": "such as the RAM and ROM. So the goal was to\nrun it at 8 Mhz. Failing that, I’d be totally", "start": 434.65, "duration": 6.14}, {"text": "happy with 4 mhz, and could even live with\n2 mhz if it came down to it.", "start": 440.79, "duration": 4.87}, {"text": "As such, this is the memory map I came up\nwith. You get almost 40K of base memory, which", "start": 445.66, "duration": 5.03}, {"text": "we are calling “low memory” in our design.\nAnd then over here we have another 8K. But", "start": 450.69, "duration": 4.61}, {"text": "what makes this area special, is that it is\nbanked. And the banking system for this is", "start": 455.3, "duration": 3.99}, {"text": "so much simpler than what the C64 uses. You\nsee, there are 256 banks of 8K each, giving", "start": 459.29, "duration": 6.29}, {"text": "a total memory area of 2 megabytes. We are\ncalling this area the high memory area. The", "start": 465.58, "duration": 5.26}, {"text": "entire 16K ROM area also banks, as there are\n8 possible banks for this, allowing us to", "start": 470.84, "duration": 4.95}, {"text": "cram a lot of built in application into the\nsystem.", "start": 475.79, "duration": 3.379}, {"text": "Now there are some things I should mention\nabout this design. A lot of people will look", "start": 479.169, "duration": 3.131}, {"text": "at this 39K area here and say “that’s\nall?” But the reality is, this is more than", "start": 482.3, "duration": 4.85}, {"text": "a lot of people might realize. For one thing,\nthis RAM is all available. Other similar computers", "start": 487.15, "duration": 4.54}, {"text": "of the era would also have to incorporate\nvideo RAM into this area, which could be a", "start": 491.69, "duration": 4.61}, {"text": "lot if graphics mode were to be used. As I\nmentioned, we don’t need that since our", "start": 496.3, "duration": 4.28}, {"text": "video RAM is separate. Second of all, our\ncomputer doesn’t need to load any sort of", "start": 500.58, "duration": 4.18}, {"text": "DOS into RAM like an Apple II, Atari, or IBM\nwould have needed to do.", "start": 504.76, "duration": 4.67}, {"text": "Another consideration is that BASIC requires\ncontiguous memory area. Which means this area", "start": 509.43, "duration": 4.57}, {"text": "here is all that can be used by BASIC directly,\nso it will have a similar amount of available", "start": 514.0, "duration": 4.159}, {"text": "BASIC RAM as a Commodore 64, which boots up\nwith 38K free. And to be honest, I’ve almost", "start": 518.159, "duration": 5.701}, {"text": "never seen anyone use up the entire 38K in\na BASIC program. It’s actually really hard", "start": 523.86, "duration": 5.62}, {"text": "to do.", "start": 529.48, "duration": 1.0}, {"text": "I’d like to draw your attention to the memory\nmap I showed for Planet X2 a while back. The", "start": 530.48, "duration": 4.5}, {"text": "entire game code actually fit in the first\n16K section of RAM. Actually, I think the", "start": 534.98, "duration": 5.109}, {"text": "game code was really something more like 13K.\nAll of the rest of the RAM was used for things", "start": 540.089, "duration": 4.571}, {"text": "like graphics, music, play field map, and\nvariable data. If I were to design that game", "start": 544.66, "duration": 5.3}, {"text": "for this computer, for example, I would be\nable to use this entire area for code, which", "start": 549.96, "duration": 4.451}, {"text": "is 3 times larger than what I had available\non the Commodore 64. And all of the other", "start": 554.411, "duration": 4.928}, {"text": "data could go into this banked area.", "start": 559.339, "duration": 1.961}, {"text": "Now, let me explain how these RAM banks are\ncontrolled. It is ridiculously simple. We", "start": 561.3, "duration": 4.201}, {"text": "have taken one of the 6522 chips and used\nan entire 8-bit I/O area and connected these", "start": 565.501, "duration": 5.199}, {"text": "to the upper address lines of the RAM chips.\nSo, you can literally just type POKE 40801", "start": 570.7, "duration": 5.57}, {"text": "and then any number between 0 to 255 to select\nyour RAM bank. Or, if you were doing this", "start": 576.27, "duration": 4.92}, {"text": "in assembly language, you would just need\ntwo commands, LDA with your RAM bank number,", "start": 581.19, "duration": 4.15}, {"text": "and then STA $9F61. So, it is super fast and\neasy to select RAM banks and there is up to", "start": 585.34, "duration": 5.53}, {"text": "2 MB of high RAM available.", "start": 590.87, "duration": 1.59}, {"text": "Once we had a plan for the board, then we\nreally needed a better long-term video chip", "start": 592.46, "duration": 4.86}, {"text": "solution. So, I reached out to the community\nto some people who were FPGA experts to see", "start": 597.32, "duration": 4.79}, {"text": "if they could design a custom video chip.", "start": 602.11, "duration": 2.02}, {"text": "I only had a few requirements. I said I wanted\nit to output VGA video. I wanted it to use", "start": 604.13, "duration": 5.58}, {"text": "its own RAM. And I wanted it to interface\nto the system bus through 4 registers. So,", "start": 609.71, "duration": 4.06}, {"text": "it would essentially occupy 4 bytes of system\nRAM. The first byte is the auto-increment", "start": 613.77, "duration": 5.35}, {"text": "value, I’ll explain this in a moment. Next\nyou have the high address byte, and the low", "start": 619.12, "duration": 4.39}, {"text": "address byte. And last you have the read/write\nbyte. So if you wanted to write to the first", "start": 623.51, "duration": 6.32}, {"text": "byte of video RAM, you would set these two\nvalues to zero, and then you could write the", "start": 629.83, "duration": 3.91}, {"text": "value you wanted to put in there to this register.\nYou can also read this register to find out", "start": 633.74, "duration": 4.84}, {"text": "what byte is in there.", "start": 638.58, "duration": 1.02}, {"text": "Now, at first this would appear to be slower\nto use than a setup like the C64 where the", "start": 639.6, "duration": 4.69}, {"text": "video RAM is shared with the CPU. However,\nthat’s where this auto-increment byte comes", "start": 644.29, "duration": 4.39}, {"text": "in handy. If you set this byte to 1, then\nevery time you write a byte to this register,", "start": 648.68, "duration": 5.75}, {"text": "the value in these registers will automatically\nincrease by one. So, you can set the starting", "start": 654.43, "duration": 5.09}, {"text": "location and just keep writing bytes one after\nthe next. This means that when doing block", "start": 659.52, "duration": 4.18}, {"text": "copies of data to and from the video chip,\nit is actually just about as fast, and in", "start": 663.7, "duration": 4.24}, {"text": "some cases faster, than using shared video\nRAM.", "start": 667.94, "duration": 3.36}, {"text": "I actually ended up getting working submissions\nfrom two different people. Ross Andrews sent", "start": 671.3, "duration": 5.84}, {"text": "me this daughter board here which we code\nnamed Project Vulcan. And Frank Van de Hoef", "start": 677.14, "duration": 4.55}, {"text": "sent me this little video board codenamed\nproject Vera. In the beginning these boards", "start": 681.69, "duration": 5.36}, {"text": "only had text modes, which was fine because\nI said that’s all we needed to get started", "start": 687.05, "duration": 3.59}, {"text": "as long as the bus interface worked. Both\nof these boards worked so we ended up having", "start": 690.64, "duration": 4.44}, {"text": "to select one going forward, which wasn’t\nan easy decision. We ended up selecting the", "start": 695.08, "duration": 4.29}, {"text": "Vera chip for the long-term. Frank had already\ndesigned a small single board computer he", "start": 699.37, "duration": 4.75}, {"text": "called Koneko, which means kitten in Japanese.\nIt already had working VGA output. So he was", "start": 704.12, "duration": 6.35}, {"text": "able to use a lot of that experience to design\nthe Vera chip.", "start": 710.47, "duration": 4.22}, {"text": "One of the first things we needed to do was\nget the Vera chip connected to a Commodore", "start": 714.69, "duration": 3.92}, {"text": "64 so that we could start testing things.\nKevin built this little board where the Vera", "start": 718.61, "duration": 4.61}, {"text": "daughterboard can just connect in like this,\nand then we can plug in a VGA monitor and", "start": 723.22, "duration": 4.16}, {"text": "plug it into the C64’s cartridge port. Of\ncourse, it didn’t work first time. As always", "start": 727.38, "duration": 4.7}, {"text": "with these things, it took a bit of debugging.\nBut we did eventually get it working and you", "start": 732.08, "duration": 3.4}, {"text": "can see it here working on the C64. It was\nreally important to be able to see the chip", "start": 735.48, "duration": 4.799}, {"text": "working on a C64, not only so we could prove\nthat the FPGA design worked and was compatible", "start": 740.279, "duration": 5.331}, {"text": "with a 6502 processor, but also so we could\nstart developing kernel code that would eventually", "start": 745.61, "duration": 4.72}, {"text": "make its way into the final production board.\nIn fact, we’ve talked about making this", "start": 750.33, "duration": 4.23}, {"text": "into a separate product for C64 users once\nall of the FPGA design is complete, which", "start": 754.56, "duration": 5.469}, {"text": "would give all of the Commander X16’s video\nfeatures to C64 users. Or heck even VIC-20", "start": 760.029, "duration": 4.971}, {"text": "and PET users for that matter.", "start": 765.0, "duration": 2.399}, {"text": "So what is this Vera chip capable of? Well,\nfor starters it has several text modes starting", "start": 767.399, "duration": 4.311}, {"text": "with the 80x60 mode, and can go all the way\ndown to a VIC-20 like resolution of 20x15.", "start": 771.71, "duration": 6.58}, {"text": "Text mode works in 16 colors, with a user\ndefinable palette, although the default palette", "start": 778.29, "duration": 4.41}, {"text": "mimics the Commodore 64. However, unlike the\nCommodore 64, you can define both foreground", "start": 782.7, "duration": 5.25}, {"text": "and background color for each character. There\nis also a 256 color text mode, as well as", "start": 787.95, "duration": 5.97}, {"text": "special tile modes. There is also a 4 color,\n16 color, and 256 color bit map mode, with", "start": 793.92, "duration": 6.47}, {"text": "a master palette of 4,096 colors to choose\nfrom. It also has features such as smooth", "start": 800.39, "duration": 5.819}, {"text": "scrolling, multiple layers, and sprites. It\nalso has 128K of dedicated video RAM. This", "start": 806.209, "duration": 6.311}, {"text": "will put the Commander X16’s video capabilities\nvery much in line with the Amiga, actually", "start": 812.52, "duration": 4.91}, {"text": "superior in many ways. And even superior to\nVGA graphics as well. This is actually far", "start": 817.43, "duration": 6.12}, {"text": "more than I really ever even wanted for the\nsystem. But the main thing is, it works.", "start": 823.55, "duration": 4.87}, {"text": "Now, at this point the main people working\non this project was evenly split between myself", "start": 828.42, "duration": 4.83}, {"text": "doing kernel development, Kevin Williams doing\nthe board design, and Frank Van de Hoef doing", "start": 833.25, "duration": 5.019}, {"text": "the video chip. However, in searching for\nhelp with the Kernal, I ended up contacting", "start": 838.269, "duration": 4.401}, {"text": "Michael Steil, who is an expert with the Commodore\nKernal and he became excited about the project", "start": 842.67, "duration": 4.55}, {"text": "and so he jumped on board. And to be honest,\nmost of the heavy lifting in this project", "start": 847.22, "duration": 3.77}, {"text": "is now being done by these 3 people. And so\nwhile this is still my dream computer, don’t", "start": 850.99, "duration": 5.969}, {"text": "for a moment think that I’m designing this\nby myself. In fact, quite the opposite.", "start": 856.959, "duration": 4.021}, {"text": "In fact, I have somebody working on a custom\ncase, and two different keyboard solutions", "start": 860.98, "duration": 5.45}, {"text": "including a low-end keyboard and a high-end\nkeyboard with mechanical switches, and a user", "start": 866.43, "duration": 5.24}, {"text": "manual. And that person would be Christian\nSimpson, better known as Perifractic.", "start": 871.67, "duration": 3.72}, {"text": "Thank you so much, the 9-bit guy. The extra\nbit is for parity, right? She’s bored already.", "start": 875.39, "duration": 4.89}, {"text": "But yes, Perifractic here from retro recipes.\nAnd you may know my channel for puppyfractic,", "start": 880.28, "duration": 7.21}, {"text": "or ladyfractic’s repairs. Or of course,\nfor my full sized working lego Commodore 64,", "start": 887.49, "duration": 8.56}, {"text": "the “brixty-four,” which I designed and\nbuilt. And it’s on the subject of design", "start": 896.05, "duration": 8.23}, {"text": "is why I was brought on board to the Commander\nX16 team.", "start": 904.28, "duration": 2.34}, {"text": "So, basically, me and my small design department,\nwhich is Puppyfractic, and my braw Scottish", "start": 906.62, "duration": 1.0}, {"text": "friend Gaz Marshall, we’re heading up the\nexterior design team. And the first challenge", "start": 907.62, "duration": 1.11}, {"text": "we set ourselves was looking at the logo.\nSo, basically, I see the Commander X16 as", "start": 908.73, "duration": 5.9}, {"text": "being about rebirth. You know, it’s the\nfirst of a new breed of retro machines. And", "start": 914.63, "duration": 6.18}, {"text": "it was about the time we were looking at the\nlogo design that we had this butterfly invasion", "start": 920.81, "duration": 4.38}, {"text": "here in California. So here is the Commander\nX16 butterfly logo.", "start": 925.19, "duration": 7.079}, {"text": "As you can see, we tried to incorporate modern\nelements like those sharp cutting edges and", "start": 932.269, "duration": 5.741}, {"text": "the modern font. But with the juxtaposition\nof the old school color gradient. And we were", "start": 938.01, "duration": 5.0}, {"text": "able to work with David to take a version\nof that logo to the BASIC screen. But what", "start": 943.01, "duration": 4.269}, {"text": "else can we put the logo on? Well, that brings\nus neatly to the subject of the case.", "start": 947.279, "duration": 5.05}, {"text": "And in this case, pun intended, I didn’t\nwant to re-invent the wheel. There are so", "start": 952.329, "duration": 5.281}, {"text": "many great cases out there already that we\ncould actually rebrand, rewrap, and customize.", "start": 957.61, "duration": 4.33}, {"text": "So, that’s what I’m doing. And I’m already\nworking with a company on that. And here’s", "start": 961.94, "duration": 5.519}, {"text": "the first sample. So, this is going to be\nfor the mini ITX version which is going to", "start": 967.459, "duration": 4.911}, {"text": "be released a little way down the line. And\nwe’re going to re-wrap this. Here’s a", "start": 972.37, "duration": 1.399}, {"text": "couple of the mockups of what we have in mind.\nAnd, as part of this design process, I consulted", "start": 973.769, "duration": 1.0}, {"text": "with R. Nicholas Jensen, who is known for\nsome of his incredible retro designs. Now,", "start": 974.769, "duration": 1.0}, {"text": "Micro is weirdly bigger than mini, although\nLadyfractic assures me that size doesn’t", "start": 975.769, "duration": 3.981}, {"text": "matter. But, we are going to need a micro\nATX case first. So, I’ve also worked on", "start": 979.75, "duration": 5.8}, {"text": "a design for that and here’s the mockup\nof it. We’re not sure which color to go", "start": 985.55, "duration": 5.14}, {"text": "yet. We’ll probably put this to a poll on\nthe facebook group. We might even go full", "start": 990.69, "duration": 9.45}, {"text": "retro and make the whole thing beige, kind\nof like an Apple IIgs. But either way, right", "start": 1000.14, "duration": 1.568}, {"text": "now, you can see that it kind of looks like\nan old book that you might find in a grand", "start": 1001.708, "duration": 1.0}, {"text": "library somewhere. We want people to learn\nfrom this machine. Either way, with this we", "start": 1002.708, "duration": 1.0}, {"text": "try to embody the retro meets modern feel,\nwith those blue LEDs shining through the old.", "start": 1003.708, "duration": 1.0}, {"text": "And I’ve kind of put a little Easter egg\nnod there. Or a tap on the shoulder. On that", "start": 1004.708, "duration": 1.0}, {"text": "front panel, it doesn’t just show you where\nthe power button is; if you read it a certain", "start": 1005.708, "duration": 4.222}, {"text": "way it actually says 8-Bit Power! And to me,\na lot of that power comes from the nostalgia.", "start": 1009.93, "duration": 6.55}, {"text": "But this case won’t just be nostalgic. We’re\ngoing to make sure that in the back you’ve", "start": 1016.48, "duration": 4.39}, {"text": "got lots of room for expandability and any\nof your own hacks you want to do.", "start": 1020.87, "duration": 4.77}, {"text": "So What about the keyboard? Well, again, we’re\ngoing down a standard route, but rebranding", "start": 1025.64, "duration": 4.46}, {"text": "and rewrapping it so you get the best of both\nworlds. Here’s a little mockup of how it", "start": 1030.1, "duration": 4.12}, {"text": "might look with those PETSCII characters in\nplace and the logo on the top. And also on", "start": 1034.22, "duration": 5.77}, {"text": "the team we’re lucky to have Andrew Owen,\nyeah you like him, right? He’s looking at", "start": 1039.99, "duration": 3.49}, {"text": "the possibility of a deluxe, all singing,\nall dancing, keyboard using cherry MX micro", "start": 1043.48, "duration": 5.909}, {"text": "switches. She loves those.", "start": 1049.389, "duration": 2.341}, {"text": "That just leaves the user guide. And for this,\nmy one prerequisite is that it must be spiral", "start": 1051.73, "duration": 5.639}, {"text": "bound. I know David is in agreement with that.\nSo, we’re already well into the process", "start": 1057.369, "duration": 4.221}, {"text": "of producing that. And it will be kind of\nlike the old-school VIC-20 user guide or the", "start": 1061.59, "duration": 4.89}, {"text": "BASIC programming guides of the eighties,\nwith lots of illustrations and easy to follow", "start": 1066.48, "duration": 4.289}, {"text": "along BASIC programs. Well, that’s about\nit for the updates on the exterior design.", "start": 1070.769, "duration": 5.461}, {"text": "OK, all right, I put a treat in there you\ncan take it. Do follow along on the facebook", "start": 1076.23, "duration": 6.1}, {"text": "group, though, because I do post updates there\nand polls asking for your opinion from time", "start": 1082.33, "duration": 4.299}, {"text": "to time. And I might even post some updates\non my youtube channel. But, for now, for me", "start": 1086.629, "duration": 4.37}, {"text": "and Puppyfractic, back to you in the studio,\nthe 8-Bit Murray. Bye.", "start": 1090.999, "duration": 5.37}, {"text": "OK, thank you, Perifractic! Now, let’s talk\nabout sound chips for a moment. So, this was", "start": 1096.369, "duration": 6.3}, {"text": "a really difficult decision because I wanted\na chip that was still in production, and that", "start": 1102.669, "duration": 4.051}, {"text": "would interface with a 6502 processor, and\nwas easy to program for.", "start": 1106.72, "duration": 3.76}, {"text": "Now what I mean by easy to program, is if\nyou look at the Commodore VIC-20, which is", "start": 1110.48, "duration": 4.259}, {"text": "the computer I learned to program on. I could\nsimply POKE a value to one of the 4 sound", "start": 1114.739, "duration": 5.021}, {"text": "generators, and immediately get sound. It\nwas that easy. When moving to the Commodore", "start": 1119.76, "duration": 8.2}, {"text": "64, however, making the SID chip do anything\nrequired a lot of setup, which was often annoying", "start": 1127.96, "duration": 4.01}, {"text": "when I just wanted a beep or two. However,\nmuch like the video situation, there really", "start": 1131.97, "duration": 4.86}, {"text": "wasn’t much available that seemed appropriate.\nWe ended up selecting the General Instruments", "start": 1136.83, "duration": 4.969}, {"text": "AY-3-8910, which is the same sound chip used\nin a lot of systems from the 80s including", "start": 1141.799, "duration": 4.721}, {"text": "the Sinclair Spectrum, Intellivision, Vectrex,\nMSX computers, the Mockingboard for the Apple", "start": 1146.52, "duration": 6.42}, {"text": "II series computers, and the Atari ST. And\nwhile these are inferior to the SID chip found", "start": 1152.94, "duration": 5.25}, {"text": "in the C64, we figured we could partially\nmake up for that by including two chips, giving", "start": 1158.19, "duration": 4.109}, {"text": "us 6 voices. And here’s a sample of what\nthat might sound like.", "start": 1162.299, "duration": 11.551}, {"text": "You can find lots more samples on Youtube\nand Soundcloud if you want.", "start": 1173.85, "duration": 3.909}, {"text": "So to test these chips, Kevin also designed\na board for the C64’s cartridge port that", "start": 1177.759, "duration": 4.201}, {"text": "has two of the AY-3 chips on board. As you\ncan see, it has the two AY-3 chips and what", "start": 1181.96, "duration": 5.9}, {"text": "you can’t see is underneath each chip is\na digital-to-analog converter, or DAC. So", "start": 1187.86, "duration": 4.699}, {"text": "that gives stereo digital output as well.\nI wrote a sample program where I can test", "start": 1192.559, "duration": 4.891}, {"text": "the various voices of the chips like this.\nIt doesn’t do anything terribly impressive,", "start": 1197.45, "duration": 5.049}, {"text": "but it allows me to test the function of all\n6 voices. There wasn’t a lot of existing", "start": 1202.499, "duration": 4.39}, {"text": "code to use since the AY-3 chips were rarely\never used in 6502 based computers. Anyway,", "start": 1206.889, "duration": 6.701}, {"text": "everything was looking promising with these\nchips, but in the end we had to abandon them,", "start": 1213.59, "duration": 3.949}, {"text": "which I’ll talk more about later.", "start": 1217.539, "duration": 1.36}, {"text": "So, now I want to talk about my master plan.\nSo, much like Elon Musk had a master plan", "start": 1218.899, "duration": 5.66}, {"text": "to introduce mass market electric vehicles\nin 3 different stages, I also have 3 different", "start": 1224.559, "duration": 6.381}, {"text": "stages I’m working on. So, originally, I\nhad suggested that I wanted to be able to", "start": 1230.94, "duration": 4.609}, {"text": "sell this product for $50. Unfortunately,\nthat’s not going to happen. At least not", "start": 1235.549, "duration": 4.46}, {"text": "at stage one.", "start": 1240.009, "duration": 1.63}, {"text": "The first product will be a motherboard designed\nfor a Micro-ATX style case. The board will", "start": 1241.639, "duration": 4.811}, {"text": "be all DIP package just like a vintage computer.\nIt will be very hackable. It will have expansion", "start": 1246.45, "duration": 5.069}, {"text": "slots so you can add cards and other hardware.\nThis first board is going to lay the foundation", "start": 1251.519, "duration": 4.951}, {"text": "of the architecture and it will be aimed at\nhardware and software developers. And it’s", "start": 1256.47, "duration": 3.6}, {"text": "going to be kind of expensive. I don’t know\nan exact price at this point, but I’m thinking", "start": 1260.07, "duration": 4.75}, {"text": "somewhere between $200 and $300. I can’t\nget more exact because we haven’t finalized", "start": 1264.82, "duration": 4.799}, {"text": "the hardware and we even found a company to\nmanufacture it. In fact, we may be looking", "start": 1269.619, "duration": 4.39}, {"text": "at selling the board by itself, or possibly\ngetting a custom case manufactured. It may", "start": 1274.009, "duration": 4.79}, {"text": "even be sold as a kit that the end user can\nassemble. So there are a lot of unknowns.", "start": 1278.799, "duration": 4.661}, {"text": "The second stage of this development would\nbe to build a second board that uses smaller", "start": 1283.46, "duration": 4.0}, {"text": "surface mount parts. This would reduce the\nsize and cost of the board, as well as most", "start": 1287.46, "duration": 4.73}, {"text": "likely the cost of assembly. It would most\nlikely be aimed at a mini-ITX style board,", "start": 1292.19, "duration": 5.25}, {"text": "and be far less expandable and less hackable.", "start": 1297.44, "duration": 2.339}, {"text": "But, I still don’t think that would put\nus anywhere near the $50 price range I had", "start": 1299.779, "duration": 4.65}, {"text": "initially suggested. For that, we would need\nto condense the entire thing down to maybe", "start": 1304.429, "duration": 4.61}, {"text": "a single FPGA with a RAM chip or something.\nAnd if there is enough demand, maybe even", "start": 1309.039, "duration": 4.47}, {"text": "a custom ASIC. At this point you’d have\nsomething about the size of a Raspberry Pi.", "start": 1313.509, "duration": 4.741}, {"text": "So that is the end goal, and whether we get\nthere or not will depend greatly on how the", "start": 1318.25, "duration": 3.6}, {"text": "first two stages go.", "start": 1321.85, "duration": 1.25}, {"text": "OK, so I’ve got Kevin Williams from TexElec\nback with us again, and he is the main designer", "start": 1323.1, "duration": 5.259}, {"text": "behind the Commander 16 prototype board and\nwe’ve got our first prototype. So, these", "start": 1328.359, "duration": 6.181}, {"text": "were actually made by PCBWay. They’ve been\nfollowing this project with enthusiasm and", "start": 1334.54, "duration": 4.519}, {"text": "they offered to make our first 10 prototype\nboards for free and so big thanks to out to", "start": 1339.059, "duration": 4.301}, {"text": "PCBWay. Yeah, they’re great boards, good\nquality, they’re going to serve us well", "start": 1343.36, "duration": 3.97}, {"text": "for this project. All right so, I’ve going\nto have Kevin give you a little overview of", "start": 1347.33, "duration": 3.539}, {"text": "these finished boards.", "start": 1350.869, "duration": 2.201}, {"text": "This is the first fully populated board that\nwe built to do some testing and in this empty", "start": 1353.07, "duration": 3.599}, {"text": "slot right here is actually where the Vera\nvideo is meant to be installed. Before we", "start": 1356.669, "duration": 4.161}, {"text": "installed this module initially, however,\nwe wrote some sample assembly code to do some", "start": 1360.83, "duration": 3.63}, {"text": "various tests like flash an LED, test the\nmemory decode logic, as well as the IO select", "start": 1364.46, "duration": 5.23}, {"text": "logic. And once we had written enough code\nto feel fairly comfortable that the processor", "start": 1369.69, "duration": 3.619}, {"text": "was operating and doing what it was supposed\nto do, we moved into the next phase, which", "start": 1373.309, "duration": 3.62}, {"text": "was to test the Vera video module. Unfortunately,\nthat is when we discovered our first issue,", "start": 1376.929, "duration": 4.87}, {"text": "the module is actually being installed backwards\ndue to a bit of a miscommunication between", "start": 1381.799, "duration": 4.671}, {"text": "Frank and I, and after we determined OK, let’s\nmove that module to the bottom, I then discovered", "start": 1386.47, "duration": 5.809}, {"text": "however, that the PS/2 port also had a mirrored\nimage. So, this is the board that we actually", "start": 1392.279, "duration": 6.171}, {"text": "wound up starting to use. As you can see,\nthe video header is on the bottom as well", "start": 1398.45, "duration": 4.559}, {"text": "as the PS/2 keyboard port. And now, we just\nhave to install the board. And this is another", "start": 1403.009, "duration": 8.11}, {"text": "board that we made. It’s actually the same\nas the green one. It’s just a different", "start": 1411.119, "duration": 4.37}, {"text": "color. And now we have a machine fully ready\nto run.", "start": 1415.489, "duration": 5.17}, {"text": "Let’s just walk around the board real quick\nand show the different ports and features", "start": 1420.659, "duration": 3.561}, {"text": "that are available. First on the right here\nwe have the Commodore IEC serial port which", "start": 1424.22, "duration": 5.37}, {"text": "is also used for printers and floppy drive\non Commodore 64s and Vic-20s. I also have", "start": 1429.59, "duration": 5.459}, {"text": "a header on here. Initially I didn’t have\nthe connector, but we decided to go ahead", "start": 1435.049, "duration": 2.85}, {"text": "and add both of them so we could plug in an\nSD-2-IEC or any other floppy drive as we get", "start": 1437.899, "duration": 4.561}, {"text": "further into development. Next, you’ll notice\nthe dreaded 7805 regulator that everyone hates.", "start": 1442.46, "duration": 5.829}, {"text": "I put that on there just because I have a\nlot of them. Ultimately the board will be", "start": 1448.289, "duration": 4.01}, {"text": "powered by ATX so the barrel connector and\nthe large capacitor will be a thing of the", "start": 1452.299, "duration": 4.75}, {"text": "past. They are just here for our prototype.\nOn the back of the board, there are actually", "start": 1457.049, "duration": 4.98}, {"text": "3 different connectors that were initially\ndesigned for video. We only have two of them", "start": 1462.029, "duration": 3.5}, {"text": "populated at the moment. The 3rd is S-Video.\nThat’s actually planned to come back at", "start": 1465.529, "duration": 5.451}, {"text": "some point but for the moment we don’t have\nthe connector installed. The others are of", "start": 1470.98, "duration": 4.23}, {"text": "course, VGA, and composite video. Next is\nthe PS/2 keyboard which is also installed", "start": 1475.21, "duration": 5.36}, {"text": "upside-down as we previously discussed, but\nworking great. Lastly is the audio jack on", "start": 1480.57, "duration": 5.0}, {"text": "this side as far as external connectors go.\nThat will allow you to hear the sound from", "start": 1485.57, "duration": 4.75}, {"text": "the AY-3 chips.", "start": 1490.32, "duration": 1.719}, {"text": "Let me turn the board. On the back of the\nboard, we have 4 expansion headers that we", "start": 1492.039, "duration": 6.12}, {"text": "put in pace just for us to test other functions\nand other things that we might want to add", "start": 1498.159, "duration": 3.76}, {"text": "after the final board. These aren’t going\nto be representative of what the final has,", "start": 1501.919, "duration": 3.61}, {"text": "they will actually be much larger and actually\nlined up to where they will fit in a Mini", "start": 1505.529, "duration": 4.691}, {"text": "ITX ATX style case. Just below those are the\nAY-3-8910 chips. Unfortunately, these won’t", "start": 1510.22, "duration": 7.169}, {"text": "be in the final product. They’re just simply\nnot going to work fast enough to run at 8", "start": 1517.389, "duration": 5.24}, {"text": "Mhz, but you’ll see 2 small header expansion\npins here. The AY-3 chips themselves have", "start": 1522.629, "duration": 5.66}, {"text": "2 ports much like a VIA or a 6522 chip would\nhave. One port is connected to a DAC on either", "start": 1528.289, "duration": 7.73}, {"text": "one. And the other is just open. Unfortunately\nwe will have to migrate this. The LCD screen", "start": 1536.019, "duration": 4.59}, {"text": "was originally installed as a way for us to\nhave some sort of video before the VERA chip", "start": 1540.609, "duration": 4.53}, {"text": "was complete. However as we competed the design\nof the motherboard and had them manufactured,", "start": 1545.139, "duration": 5.201}, {"text": "the Vera board was actually compete right\naround the same time. So, as a result of that,", "start": 1550.34, "duration": 4.539}, {"text": "the LCD will also be removed from the final\nboard. But, for the moment it works so we", "start": 1554.879, "duration": 3.68}, {"text": "left it on there just to play with it. And\nlater, its certainly something that could", "start": 1558.559, "duration": 3.58}, {"text": "be built into an expansion port if you desired\nto do so.", "start": 1562.139, "duration": 2.9}, {"text": "So, let’s talk a little about what chips\nare actually on the board. As you can see", "start": 1565.039, "duration": 3.75}, {"text": "here, is the 6502 CPU, and just above it is\nthe first of 6522 VIA chips. These are the", "start": 1568.789, "duration": 7.911}, {"text": "peripheral style chips similar to what the\nVIC-20 has. And there’s the second VIA chip", "start": 1576.7, "duration": 5.159}, {"text": "up here as well. And just to it you’ll see\na small expansion port that says USER port.", "start": 1581.859, "duration": 4.761}, {"text": "These pins are actually very similar to the\nuser port on a Commodore VIC-20 or Commodore", "start": 1586.62, "duration": 4.559}, {"text": "64. Just to the right of that are the two\njumper settings that control the master clock", "start": 1591.179, "duration": 3.71}, {"text": "signals for the system. As well for the AY-3.\nWe actually have a 16 megahertz crystal and", "start": 1594.889, "duration": 5.66}, {"text": "two chips that just divide down to different\nfrequencies. We can actually set the master", "start": 1600.549, "duration": 3.96}, {"text": "clock anywhere between 16 and 1 mhz and the\nAY3 clock with the 16 megahertz crystal from", "start": 1604.509, "duration": 6.201}, {"text": "4 down to 1 megahertz as well. This won’t\nbe on the final board either. It’s really", "start": 1610.71, "duration": 4.48}, {"text": "for us to test and as you can see we’re\nactually running at 2 megahertz right now.", "start": 1615.19, "duration": 4.359}, {"text": "And there’s some various reasons for that,\nbut as we’re progressing we hope that the", "start": 1619.549, "duration": 3.75}, {"text": "board will actually be able to get up to 8.", "start": 1623.299, "duration": 2.71}, {"text": "Just below the video card header we have two\nports labelled NES / SNES ports. The reason", "start": 1626.009, "duration": 4.75}, {"text": "these are here as pin headers at this point\nis we haven’t decided what physical port", "start": 1630.759, "duration": 3.89}, {"text": "we’re going to use on the final product\nbut for now we can actually take a game controller", "start": 1634.649, "duration": 4.561}, {"text": "and modify it so we can connect it on here\nfor testing.", "start": 1639.21, "duration": 3.029}, {"text": "The last section to talk about really is at\nthe bottom here. There’s the ROM chip and", "start": 1642.239, "duration": 3.851}, {"text": "the main RAM for the system. The first chip\nhere is 128K and contains actually 8 banks", "start": 1646.09, "duration": 6.639}, {"text": "of 16K which is available as the top section\nof the ROM. The bottom 48 or 40K of memory", "start": 1652.729, "duration": 6.99}, {"text": "is actually stored on this chip which is just\na physical SRAM chip and these 4 chips are", "start": 1659.719, "duration": 4.89}, {"text": "the 2 megs of RAM which are banked in the\nA000 of RAM. Lastly at the bottom we have", "start": 1664.609, "duration": 7.471}, {"text": "an NMI as well as a reset button. We will\nhave a reset button in the form of the case,", "start": 1672.08, "duration": 4.919}, {"text": "its not clear we’re going to have an NMI\nbutton on the case which is mostly because", "start": 1676.999, "duration": 3.68}, {"text": "cases don’t have two buttons often. But\nwe may have the ability to add one with a", "start": 1680.679, "duration": 4.401}, {"text": "pin header if you choose to have one there.", "start": 1685.08, "duration": 2.49}, {"text": "Now I’ll give you a quick little demonstration\nof the prototype board actually running. I’ll", "start": 1687.57, "duration": 4.37}, {"text": "just plug it in. And there it is.", "start": 1691.94, "duration": 3.969}, {"text": "I don’t have any way to load anything yet\nsince the disk drive routines aren’t working", "start": 1695.909, "duration": 4.21}, {"text": "yet. But I can type in stuff in BASIC. I’ll\ntype in the famous little random maze program.", "start": 1700.119, "duration": 4.601}, {"text": "So, as Kevin mentioned it is only running\nat 2 Mhz right now. However, I can at least", "start": 1704.72, "duration": 4.22}, {"text": "say it is very stable. I’ve had it running\nfor several days on end without any sort of", "start": 1708.94, "duration": 4.199}, {"text": "glitching or lockups.", "start": 1713.139, "duration": 1.64}, {"text": "I also wrote a small clock program to test\nthe LCD screen.", "start": 1714.779, "duration": 3.211}, {"text": "OK, so this is the emulator. It runs in Linux,\nWindows, or Mac. And this is what we’ve", "start": 1717.99, "duration": 5.549}, {"text": "been using to develop the kernal with, but\nnow we’re moving more into the software", "start": 1723.539, "duration": 4.02}, {"text": "side of things with it. I’ll just give you\nsome little examples here. And there you go,", "start": 1727.559, "duration": 6.781}, {"text": "same type of thing you might do for a little\ntest. So, it also runs in 40 columns mode.", "start": 1734.34, "duration": 5.799}, {"text": "You can press F4. This is the exact same behavior\nthat the real computer will do as well, so", "start": 1740.139, "duration": 3.932}, {"text": "you can go into 40 columns and of course it\npreserves your program. It doesn’t reboot", "start": 1744.071, "duration": 3.358}, {"text": "or anything like that. You can actually switch\nback and forth between them just by pressing", "start": 1747.429, "duration": 4.29}, {"text": "F4. OK, so what I want to show you now, let\nme clear the screen. We’ve added a new command", "start": 1751.719, "duration": 5.42}, {"text": "to BASIC. So, because the video RAM is stored\nseparately from regular RAM, you’re not", "start": 1757.139, "duration": 4.322}, {"text": "able to use POKE commands at least to directly\nmodify video memory. So, we added a new command", "start": 1761.461, "duration": 4.758}, {"text": "called VPOKE. And the way this works is you\nput in the bank number. There’s like 4 or", "start": 1766.219, "duration": 4.43}, {"text": "5 memory banks in the video card. We’re\ngoing to use bank zero, and we’re going", "start": 1770.649, "duration": 3.72}, {"text": "to use location zero so that will actually\ncorrespond to the top-left character on the", "start": 1774.369, "duration": 4.571}, {"text": "screen. And I’m going to put in a 1 which\nis the letter A. And, as you can see, it will", "start": 1778.94, "duration": 3.939}, {"text": "POKE that right to the video memory. And you\ncan come over here and change it to a 2 and", "start": 1782.879, "duration": 4.51}, {"text": "then you have a B and so forth. Now, the video\nattributes, the color attributes is actually", "start": 1787.389, "duration": 3.9}, {"text": "the next byte after the characters. So, if\nwe go to to byte one then you can see it changes", "start": 1791.289, "duration": 5.35}, {"text": "the color attribute. And then you can do this\nbackwards. You can do print oops, not PEEK,", "start": 1796.639, "duration": 5.52}, {"text": "VPEEK, and then you can put in bank zero comma\none and it should return two. Because that’s", "start": 1802.159, "duration": 6.47}, {"text": "what is in video RAM at that spot. So, that’s\nVPOKE and VPEEK. We also have a monitor. Wouldn’t", "start": 1808.629, "duration": 4.951}, {"text": "want to show you a whole lot about this because\nI’m not sure we’ll be able to use this", "start": 1813.58, "duration": 4.329}, {"text": "monitor because I don’t know if we have\nthe rights to it. And we have a different", "start": 1817.909, "duration": 2.701}, {"text": "monitor that we’re working on, which I’ll\nshow you later in the video. So, I will exit", "start": 1820.61, "duration": 4.679}, {"text": "out of that. Now I want to show you a couple\nof programs that have been written using the", "start": 1825.289, "duration": 5.51}, {"text": "emulator here. I’ll start off with my own\nprogram. PetdrawX16. And by the way, you don’t", "start": 1830.799, "duration": 5.911}, {"text": "need a comma eight or anything like you would\non the C64 because if you leave it, at least", "start": 1836.71, "duration": 5.459}, {"text": "on the emulator anyway, if you put no drive\nit defaults to device 1, which is of course", "start": 1842.169, "duration": 5.25}, {"text": "the local file system where the emulator is,\nwhoops. So there we go. All right, so this", "start": 1847.419, "duration": 10.281}, {"text": "is written entirely in assembly language.\nOK, so this is PetDraw. I kind of re-wrote", "start": 1857.7, "duration": 4.449}, {"text": "this from scratch just for the Commander X16.\nIt’s pretty similar to the Commodore 64", "start": 1862.149, "duration": 4.311}, {"text": "version in the way it works. Obviously it\ntakes advantage of a lot of the new hardware.", "start": 1866.46, "duration": 4.48}, {"text": "So, you may be wondering, “well gee what\nis Petdraw?” Well, if you push F1 you go", "start": 1870.94, "duration": 3.88}, {"text": "into draw mode. You can press enter. You can\npick like any of the characters from the PETSCII", "start": 1874.82, "duration": 5.26}, {"text": "character set and you can just put them on\nthe screen like that. And you might think", "start": 1880.08, "duration": 4.299}, {"text": "that’s not all that useful or interesting\nbut actually it is, and I’ll show you why.", "start": 1884.379, "duration": 4.961}, {"text": "Let me load in an example photo. I haven’t\nhad a chance to do much artwork because I’ve", "start": 1889.34, "duration": 3.279}, {"text": "been too busy writing the program. But, I\ndid write one test picture. And here we go,", "start": 1892.619, "duration": 5.54}, {"text": "I’ll load that in. It’s just the Commander\nX16 logo. Not exactly the same one you see", "start": 1898.159, "duration": 5.71}, {"text": "on boot up, it’s a little bit bigger. So\nlet me show you one of the neat features here.", "start": 1903.869, "duration": 3.601}, {"text": "You can push F5 and select a screen size.\nIt actually changes on the fly as you scroll", "start": 1907.47, "duration": 4.64}, {"text": "through to these different sizes. So yeah,\nyou can go all the way up to the big huge", "start": 1912.11, "duration": 4.13}, {"text": "text characters of 20 by 15, which kind of\nlook like Commodore VIC-20 characters. Let", "start": 1916.24, "duration": 4.519}, {"text": "me write some test text so you can see yeah\nit is pretty big. So, you also have features", "start": 1920.759, "duration": 6.8}, {"text": "where you can shift whole pieces of the screen\neither left and they’ll loop all the way", "start": 1927.559, "duration": 8.04}, {"text": "around. I can also go right. You can also\ngo up and down. It’s almost like playing", "start": 1935.599, "duration": 4.381}, {"text": "with a Rubik’s cube. But it’s handy for\nmoving stuff around on the screen. Now you", "start": 1939.98, "duration": 3.34}, {"text": "might ask what use this program has, well\nthe main thing is when I design other software,", "start": 1943.32, "duration": 4.299}, {"text": "a lot of the time I need to design or figure\nout how things are going to go, where they", "start": 1947.619, "duration": 3.02}, {"text": "are going to be placed on the screen. For\nexample, if I push the help screen here and", "start": 1950.639, "duration": 3.29}, {"text": "it pops up with this screen. Well, I actually\ndesigned the help screen in PetDraw. So, the", "start": 1953.929, "duration": 4.33}, {"text": "same thing for example with I pick the color\nscreen. I designed this screen in PetDraw.", "start": 1958.259, "duration": 4.3}, {"text": "And when you design software, you’re going\nto need to design little screens like this.", "start": 1962.559, "duration": 4.08}, {"text": "It’s just a handy developer tool for me,\nI’ve always found. So that’s the main", "start": 1966.639, "duration": 3.601}, {"text": "reason I designed PetDraw. So, now I want\nto show you this neat little demo that somebody", "start": 1970.24, "duration": 4.659}, {"text": "on the facebook group posted just a couple\nof days ago. Sorry, I don’t even remember", "start": 1974.899, "duration": 3.86}, {"text": "what the guy’s name was, but it’s probably\nthe coolest demo on the system so far. It’s", "start": 1978.759, "duration": 3.59}, {"text": "called green space. And as you can see, it’s\nall written in assembly language. And, this", "start": 1982.349, "duration": 6.141}, {"text": "is what it does. So yeah, you’ve got like\nthe little matrix effect there, which is actually", "start": 1988.49, "duration": 5.879}, {"text": "pretty cool. A neat little demonstration of\nthe text mode. Now, what they’re actually", "start": 1994.369, "duration": 3.071}, {"text": "using here is, you notice there is a lot of\nshades of green here. So they’re actually", "start": 1997.44, "duration": 3.13}, {"text": "using the 256 color text mode. Either that\nor they’ve redefined the palette on the", "start": 2000.57, "duration": 4.979}, {"text": "16 colors. I’m not sure. But either way,\nneat little effect. The next program I want", "start": 2005.549, "duration": 5.162}, {"text": "to show you is tile demo. And this is actually\nwritten in BASIC. And it just does, that.", "start": 2010.711, "duration": 10.119}, {"text": "So, what I can do is I can actually list the\nprogram here and I can run this little demo.", "start": 2020.83, "duration": 7.88}, {"text": "And one of the things you can do is you can\nsee it that it draws this graphic over the", "start": 2028.71, "duration": 3.73}, {"text": "text. It doesn’t. You know, it’s not destructive\nto what’s on the screen. And that’s because", "start": 2032.44, "duration": 3.53}, {"text": "it’s actually using a different layer. And\nthat’s one of the neat things about the", "start": 2035.97, "duration": 3.159}, {"text": "Vera chip is it has two different tile or\nbitmap layers. So you can do neat effects", "start": 2039.129, "duration": 4.39}, {"text": "like this which will probably be really cool\nfor some 2D games later on, so anyway, moving", "start": 2043.519, "duration": 4.24}, {"text": "along. Ok, so the next thing I want to show\nyou is called mode four demo dot PRG. Now,", "start": 2047.759, "duration": 6.14}, {"text": "this is going to demonstrate one of the tile\nmodes. So this is the 256 color tile mode.", "start": 2053.899, "duration": 5.101}, {"text": "It doesn’t move or anything like that. It’s\njust a still image but it is using 256 color", "start": 2059.0, "duration": 4.23}, {"text": "tiles. It looks obviously very reminiscent\nof Mario. This was actually designed by Frank,", "start": 2063.23, "duration": 5.429}, {"text": "actually the guy who made the Vera chip. Anyway,\nlooks really nice. This is actually running", "start": 2068.659, "duration": 4.391}, {"text": "in one of the lower res modes. It can actually\ndo higher resolution than this. But this would", "start": 2073.05, "duration": 4.19}, {"text": "be the perfect mode for games like this. So\nall right, moving along, I want to show you", "start": 2077.24, "duration": 6.24}, {"text": "mode 7 demo. Now, I’m going to warn you\nthis demo only half works. So, this is a demonstration", "start": 2083.48, "duration": 8.29}, {"text": "of the 256 color bitmap mode of the Vera chip.\nYou may be wondering, “well gee why does", "start": 2091.77, "duration": 5.55}, {"text": "it only show half the screen?” Well, that’s\nbecause it has to load the picture into low-RAM", "start": 2097.32, "duration": 4.63}, {"text": "and copy it up to the video chip and there\njust isn’t enough low RAM to copy the whole", "start": 2101.95, "duration": 4.14}, {"text": "picture in 256 color modes, so he’s only\nloading half the photo. Obviously what you", "start": 2106.09, "duration": 4.95}, {"text": "would need to load a whole still photo into\nvideo RAM is you would need to design a custom", "start": 2111.04, "duration": 4.97}, {"text": "loader that loads a separate file from disk\nand then copies it directly into video RAM,", "start": 2116.01, "duration": 4.75}, {"text": "which we just don’t have yet. But, that\nwill be coming. But anyway, you can get kind", "start": 2120.76, "duration": 4.14}, {"text": "of an idea what the 256 color mode will look\nlike.", "start": 2124.9, "duration": 2.55}, {"text": "Eventually, I’d like to work on a BASIC\neditor that works similar to the text-editor", "start": 2127.45, "duration": 4.29}, {"text": "on the Maximite computer where you have labels\nand can scroll up and down.", "start": 2131.74, "duration": 4.07}, {"text": "I also had the idea for an assembly language\nmonitor that sort of blurred the lines between", "start": 2135.81, "duration": 6.45}, {"text": "a monitor and an actual assembler. This was\nsomething I hoped could be included in final", "start": 2142.26, "duration": 5.19}, {"text": "ROM with the product so that you could actually\nwrite assembly code on the actual computer.", "start": 2147.45, "duration": 4.8}, {"text": "And, so I talked this over a while back with\nMichael Allison and he got to work on developing", "start": 2152.25, "duration": 4.22}, {"text": "the software for that. And here’s a little\nvideo he made showing you the progress he’s", "start": 2156.47, "duration": 3.06}, {"text": "made so far.", "start": 2159.53, "duration": 1.25}, {"text": "Hi, Mike Allison here with the Commander 16\nassembly language environment. We want to", "start": 2160.78, "duration": 5.69}, {"text": "make assembly language as fun and as accessible\nas BASIC is. This new environment is going", "start": 2166.47, "duration": 6.09}, {"text": "to give you the ability to dynamically examine\nyour code, write code online, insert, edit,", "start": 2172.56, "duration": 9.98}, {"text": "and delete instructions. This example program\nis showing that we support labels. Labels", "start": 2182.54, "duration": 5.921}, {"text": "both in place and as arguments for the instructions.\nThe interactive debugger will allow us to", "start": 2188.461, "duration": 8.549}, {"text": "examine memory, set break points, and see\ntheir values as the application runs. We also", "start": 2197.01, "duration": 7.88}, {"text": "support a lot of the traditional functionality\nof a normal monitor, examining and modifying", "start": 2204.89, "duration": 7.28}, {"text": "memory contents as an example. There’s a\nlot more to come, so stay tuned.", "start": 2212.17, "duration": 7.3}, {"text": "So, hopefully when this product is ready for\nrelease, it will be possible to program it", "start": 2219.47, "duration": 3.4}, {"text": "in multiple different languages, including\nBASIC and assembly language right on the computer", "start": 2222.87, "duration": 4.48}, {"text": "without needing any sort of cross-compiler\nfrom a more modern computer. But now, let’s", "start": 2227.35, "duration": 5.15}, {"text": "talk a little bit about performance.", "start": 2232.5, "duration": 2.42}, {"text": "To give you an idea of the speed difference\nbetween the C64 and what we have here, I’m", "start": 2234.92, "duration": 4.06}, {"text": "just going to use this BASIC program I wrote.\nIt’s a pretty simple program, as you can", "start": 2238.98, "duration": 3.65}, {"text": "see, the whole program fits on a single screen\nhere. When you start the program it switches", "start": 2242.63, "duration": 4.1}, {"text": "to 40 column mode and asks how many balls.\nLet’s say 5 for this demonstration. What", "start": 2246.73, "duration": 5.54}, {"text": "it does first is fill the screen with balls.\nThen colors them black. The reason behind", "start": 2252.27, "duration": 3.98}, {"text": "this is that it is faster if all we have to\ndo is update the color attribute to move the", "start": 2256.25, "duration": 5.051}, {"text": "balls around. Anyway, you can see what it\ndoes here. Nothing terribly exciting. And", "start": 2261.301, "duration": 3.82}, {"text": "keep in mind this program IS written in BASIC,\nwhich is always going to be pretty slow. But", "start": 2265.121, "duration": 4.789}, {"text": "let’s see how essentially the same program\nruns on the Commodore 64. Again, we’ll choose", "start": 2269.91, "duration": 5.43}, {"text": "5 balls. And it takes quite some time to draw\nall of the blank balls on the screen, so I’ll", "start": 2275.34, "duration": 4.99}, {"text": "skip ahead a bit. And there we go. Now you\ncan get an idea of the speed difference between", "start": 2280.33, "duration": 4.95}, {"text": "this and the C64. So, imagine for a moment\na game like space station oblivion. This is", "start": 2285.28, "duration": 9.17}, {"text": "how fast it really runs on the C64. It gets\nabout 1 frame every few seconds. It’s terrible.", "start": 2294.45, "duration": 6.43}, {"text": "With the miracle of video editing I can speed\nthis up 8 times just to get an idea of how", "start": 2300.88, "duration": 3.94}, {"text": "it might run on the Commander. But, it would\nactually probably be better than this. The", "start": 2304.82, "duration": 4.861}, {"text": "reason is, the way the C64 handles it’s\nvideo RAM with color cells and an akward memory", "start": 2309.681, "duration": 4.849}, {"text": "layout, it requires a lot of extra calculations\nto deal with that. But the Vera chip in the", "start": 2314.53, "duration": 4.43}, {"text": "Commander X16 is a much simpler layout, meaning\ngames like this would be easier to program", "start": 2318.96, "duration": 4.89}, {"text": "and run faster.", "start": 2323.85, "duration": 1.32}, {"text": "So, what could I compare this system to in\nterms of raw performance?", "start": 2325.17, "duration": 4.36}, {"text": "Well, one thing to keep in mind, the 6502\nprocessor at 1 mhz runs almost as fast as", "start": 2329.53, "duration": 5.32}, {"text": "a 4.77 Mhz IBM XT. The reason is that a 6502\ndoes a lot more work in a single clock cycle.", "start": 2334.85, "duration": 7.64}, {"text": "And since our chip is going to be running\nat 8 Mhz, that would be similar to a 32 mhz", "start": 2342.49, "duration": 4.8}, {"text": "Xt, which never existed. So probably a better\ncomparison would be a 286 running at maybe", "start": 2347.29, "duration": 4.93}, {"text": "12 or 16 Mhz. So, I think there will be no\nproblem designing games that you would have", "start": 2352.22, "duration": 5.15}, {"text": "expected to see in the 16 bit era. In fact,\nI wouldn’t be surprised if somebody could", "start": 2357.37, "duration": 4.23}, {"text": "get something like Wolfenstein 3D to run on\nthis thing.", "start": 2361.6, "duration": 3.15}, {"text": "There’s something else I want to say. The\nCommodore 64 can definitely do some fun and", "start": 2364.75, "duration": 4.26}, {"text": "impressive games. However, one of the reasons\nthat development for this platform is probably", "start": 2369.01, "duration": 4.4}, {"text": "not greater than it is has to do with how\nhard it is to write games like this. You see,", "start": 2373.41, "duration": 5.66}, {"text": "games like Sam’s Journey are using nearly\nevery trick in the book to make this work", "start": 2379.07, "duration": 4.46}, {"text": "on a C64. You have to be literally a C64 programming\ngod to accomplish this sort of thing on a", "start": 2383.53, "duration": 7.87}, {"text": "C64. I wanted the Commander X16 to be a bit\nmore powerful so that regular coders would", "start": 2391.4, "duration": 3.67}, {"text": "be able to write fun and impressive games\nwithout having to spend 10 years learning", "start": 2395.07, "duration": 4.2}, {"text": "every trick of the book.", "start": 2399.27, "duration": 1.55}, {"text": "OK, so let’s talk about the sound chip situation.\nIt turns out the AY-3 chips really aren’t", "start": 2400.82, "duration": 5.84}, {"text": "designed to work on a system bus operating\nat greater than 1 or 2 Mhz. This should have", "start": 2406.66, "duration": 4.38}, {"text": "been obvious to us when we started work on\nthis looking in hindsight. After all, if you", "start": 2411.04, "duration": 4.85}, {"text": "look at the Mockingboard card for the Apple\nII systems, they actually use 6522 I/O controllers", "start": 2415.89, "duration": 5.2}, {"text": "as middlemen to talk to the AY-3 chips. However,\nthis is not something I wanted to do because", "start": 2421.09, "duration": 5.31}, {"text": "it makes programming for the chips more complicated,\nplus it adds additional parts and expense", "start": 2426.4, "duration": 4.27}, {"text": "to the board. And while we have the AY-3 chips\nworking on the board right now, that’s only", "start": 2430.67, "duration": 5.05}, {"text": "if we keep it jumpered at 2 mhz. And believe\nit or not, the same issue is true of the LCD", "start": 2435.72, "duration": 4.75}, {"text": "screen. It also won’t work reliably past\n2 Mhz. So that’s another reason this will", "start": 2440.47, "duration": 4.48}, {"text": "have to go. You could still interface one\nof these, but it would also need some sort", "start": 2444.95, "duration": 4.13}, {"text": "of middle-man so to speak, so that communication\ncould be slower.", "start": 2449.08, "duration": 3.29}, {"text": "So, we started looking for other options for\nsound. Some other options being investigated", "start": 2452.37, "duration": 4.47}, {"text": "right now is the possibility of the Yamaha\nYM2151 chip, which was used in the Sharp X68000,", "start": 2456.84, "duration": 7.62}, {"text": "many many arcade machines, and is a close\nrelative of the sound chip found in the Yamaha", "start": 2464.46, "duration": 4.47}, {"text": "DX27 and DX100 keyboards. This is an 8-voice,\n4 operator FM chip. Here’s a sample of what", "start": 2468.93, "duration": 7.03}, {"text": "that chip sounds like. Now these are technically\nnot made anymore, but there are quite a few", "start": 2475.96, "duration": 13.53}, {"text": "old-stock still available. And worse case,\nthere is an FPGA core available too in case", "start": 2489.49, "duration": 4.62}, {"text": "we ever ran out. Kevin just now produced an\nexpansion card for this chip and we’re about", "start": 2494.11, "duration": 5.44}, {"text": "to start testing to see if it will work at\n8 mhz. Other options include the SAA1099 which", "start": 2499.55, "duration": 6.74}, {"text": "was most famously used in the creative labs\ngame blaster, and was also an add-on chip", "start": 2506.29, "duration": 4.87}, {"text": "for the Sound Blaster. This doesn’t have\nthe best sound ever, but if we used it, hopefully", "start": 2511.16, "duration": 5.31}, {"text": "it would be in combination with the FM chip.\nThat way there would be an easy to program", "start": 2516.47, "duration": 4.33}, {"text": "sound chip for simple sounds, and something\nmore advanced for those that want it. If either", "start": 2520.8, "duration": 5.19}, {"text": "of these fail to work out, Frank has also\nsaid he could add some sound to the VERA chip", "start": 2525.99, "duration": 4.61}, {"text": "that would give it an 8-channel sound system\nthat would sound similar to the SID chip in", "start": 2530.6, "duration": 3.66}, {"text": "the Commodore 64. So, we just don’t know\nyet where the sound will wind up. But whatever", "start": 2534.26, "duration": 4.48}, {"text": "it is, I think you’ll wind up liking it.\nAnd we plan to have a a stereo DAC as well,", "start": 2538.74, "duration": 4.55}, {"text": "no matter what sort of sound chip we come\nup with. So, doing things like MOD tracker", "start": 2543.29, "duration": 3.52}, {"text": "music should be within the scope of this machine.", "start": 2546.81, "duration": 3.0}, {"text": "There are still some challenges ahead. So\nbefore you start yelling shut up and take", "start": 2549.81, "duration": 3.33}, {"text": "my money, let me tell you about a few possible\nsetbacks.", "start": 2553.14, "duration": 2.81}, {"text": "So, I know I said the product would be using\nthe 6502 microprocessor, and our prototype", "start": 2555.95, "duration": 4.64}, {"text": "certainly is. And honestly that is good enough\nfor me. However, we plan to experiment a bit", "start": 2560.59, "duration": 4.91}, {"text": "more with using the 65816 processor like I\nmentioned before. However, if we use this", "start": 2565.5, "duration": 5.63}, {"text": "processor it will be with the current design,\nassuming it works at all. Now, what I mean", "start": 2571.13, "duration": 4.12}, {"text": "by that is that we would not be using the\nfull 24-bit addressing system, so the CPU", "start": 2575.25, "duration": 4.7}, {"text": "would still be limited to 64K address space.\nHowever, it would allow you to do 16 bit math", "start": 2579.95, "duration": 6.13}, {"text": "internally, and 16-bit copy operations, which\ncould greatly benefit certain applications.", "start": 2586.08, "duration": 5.22}, {"text": "At this point I cannot say for sure which\nCPU it will have, but the good news is if", "start": 2591.3, "duration": 3.99}, {"text": "you target your code to the 6502, it will\nwork either way.", "start": 2595.29, "duration": 3.28}, {"text": "And the last thing I’d like to bring your\nattention to is the Commander X16 facebook", "start": 2598.57, "duration": 4.12}, {"text": "group. You can find the link down in the description.\nThis is a place where regular people can find", "start": 2602.69, "duration": 4.23}, {"text": "updates and post questions about the project\nas it goes along. I’ll also take this opportunity", "start": 2606.92, "duration": 4.68}, {"text": "to mention there is a Planet X3 facebook group\nas well, which I forgot to mention when I", "start": 2611.6, "duration": 4.18}, {"text": "did the last episode on Planet X3. And so\nif you are a fan of that game and want to", "start": 2615.78, "duration": 3.3}, {"text": "chat with others about it, I’ll add the\nlink for that one as well.", "start": 2619.08, "duration": 3.36}, {"text": "Also, if you want to see the Commander X16\nprototype in person and up and running, I’m", "start": 2622.44, "duration": 4.78}, {"text": "going to have this on display at the vintage\ncomputer festival in Elmhurst, Illinios in", "start": 2627.22, "duration": 4.98}, {"text": "just a few days time. And there’s a link\nin the description for that as well.", "start": 2632.2, "duration": 3.99}, {"text": "And that about wraps it up. Obviously, I will\nbe doing further updates as progress evolves", "start": 2636.19, "duration": 5.01}, {"text": "on this computer, so stay tuned for that and\nthanks for watching.", "start": 2641.2, "duration": 3.07}]