[{"text": "Hi, I received a link from my friend \"The Neckless Steve'.", "start": 0.0, "duration": 3.389}, {"text": "*Mehdi suddenly laughs*", "start": 3.8, "duration": 1.589}, {"text": "Sorry Steve, he's my ex-colleague engineer and a very talented photographer. Make sure to check out his art.", "start": 5.62, "duration": 6.05}, {"text": "Anyway, the webpage he sent claims that \"woman dies after dropping charging phone into bathtub\".", "start": 11.8, "duration": 6.019}, {"text": "But as I've said in my previous videos by design such things should not happen.", "start": 17.88, "duration": 4.22}, {"text": "But it seems people still keep dying one after another...", "start": 22.28, "duration": 3.0}, {"text": "So would you or would you not die if you drop your charging phone in the bathtub while you're in the bathtub full of soapy water?", "start": 25.34, "duration": 6.6}, {"text": "Is it possible to get electrocuted in the bathtub? Of course!", "start": 32.22, "duration": 3.02}, {"text": "But there are specific protections in place to save you, at least where I live.", "start": 35.38, "duration": 4.42}, {"text": "In two of my previous videos, I checked a specific case where a young girl was electrocuted in the bathtub.", "start": 40.04, "duration": 5.38}, {"text": "She had bypassed the ground fault protection outlet (GFCI) by plugging her extension cord", "start": 45.72, "duration": 5.37}, {"text": "which had frayed exposed live wires outside the bathroom with no ground fault protection.", "start": 51.09, "duration": 5.21}, {"text": "Let me demonstrate; in North American bathrooms, they must have these GFCI outlets", "start": 56.78, "duration": 5.1}, {"text": "and if the current instead of between live and neutral", "start": 61.88, "duration": 3.24}, {"text": "runs between live and Earth", "start": 65.9, "duration": 2.18}, {"text": "*GFCI pops*", "start": 68.68, "duration": 0.5}, {"text": "* It detects it and shuts down.", "start": 69.18, "duration": 1.88}, {"text": "Now, imagine you're in the bathtub the faucet and drain are grounded which grounds the water.", "start": 71.16, "duration": 4.52}, {"text": "I connected my big spoon to live wire through the GFCI outlet and if I shove it in the water", "start": 75.68, "duration": 5.62}, {"text": "*GFCI pops again*", "start": 82.06, "duration": 0.5}, {"text": "The breaker opens. I put some soap in the water to make it even more conductive", "start": 82.57, "duration": 4.519}, {"text": "See, I can even turn on an LED through the water.", "start": 87.28, "duration": 3.0}, {"text": "* GFCI pops another time*", "start": 90.28, "duration": 0.5}, {"text": "Oops, the breaker opened.", "start": 90.78, "duration": 1.32}, {"text": "Now I put my leg in the water to show you that the protection actually works. You never try it at home.", "start": 92.1, "duration": 5.74}, {"text": "Any electricity will only run through my leg and is not dangerous. Now if I put the spoon in the water;", "start": 97.84, "duration": 5.16}, {"text": "*GFCI pops*", "start": 103.62, "duration": 0.5}, {"text": "Scared me. If I put the spoon in the water;", "start": 105.78, "duration": 2.48}, {"text": "*GFCI again*", "start": 108.7, "duration": 0.5}, {"text": "I felt some electric tickling in my toes, but the breaker quickly opened. Most of the current runs through the water around my leg anyway.", "start": 109.68, "duration": 6.82}, {"text": "It's much more dangerous if the current runs through your body first then into the water.", "start": 116.5, "duration": 4.08}, {"text": "(Hesitant) Let's try it. (weak laugh)", "start": 121.12, "duration": 2.0}, {"text": "Yeooowww! F*** (censored word)", "start": 124.1, "duration": 2.12}, {"text": "Well, that was super painful, not even comparable to if you just put the spoon in the water.", "start": 126.4, "duration": 4.04}, {"text": "*GFCI opens*", "start": 130.88, "duration": 0.5}, {"text": "Fortunately, GFCI opened, which means the current was above five milliamps and limited the period of pain,", "start": 131.72, "duration": 6.14}, {"text": "and let me tell you, that pain was the pain where your muscles contract and you can't let go and you're done.", "start": 137.86, "duration": 5.82}, {"text": "Thank you, GF.", "start": 144.08, "duration": 0.98}, {"text": "*kissing GFCI*", "start": 145.06, "duration": 0.5}, {"text": "So this is important, If you need to plug any electronics in your bathroom", "start": 145.7, "duration": 3.899}, {"text": "You must plug it into a GFCI protected outlet, and this will save you if anything happens", "start": 149.6, "duration": 5.62}, {"text": "Also, if you drop your hairdryer in the water, it's less dangerous while it's in the water", "start": 155.32, "duration": 4.72}, {"text": "It's more dangerous if you try to take it out because the entire current runs through your body", "start": 160.04, "duration": 5.24}, {"text": "So jump out of the bathtub first,", "start": 165.28, "duration": 2.0}, {"text": "unplug it then remove it.", "start": 167.5, "duration": 1.42}, {"text": "A N D   N E V E R   T A K E   L I V E   W I R E S   W I T H   Y O U   I N   T H E   B A T H T U B ! ! !", "start": 169.02, "duration": 3.0}, {"text": "But what if you don't plug your phone charger into a GFCI and drop your phone in the bathtub?", "start": 172.14, "duration": 5.48}, {"text": "Still nothing should happen because the output of the charger is isolated from the live wires.", "start": 177.72, "duration": 5.1}, {"text": "Here, I'm probing between the charger output and live wire, both plugged into the same outlet.", "start": 182.82, "duration": 5.46}, {"text": "And I see some AC voltage, but because the charger out with a live wire are isolated,", "start": 188.42, "duration": 5.22}, {"text": "if I short them there is no current running between them and the edge of-", "start": 193.64, "duration": 3.26}, {"text": "*sparks* [Profanity]", "start": 197.08, "duration": 1.4}, {"text": "*facepalm x6* lol", "start": 198.48, "duration": 1.06}, {"text": "The probe ground is connected to earth!", "start": 199.54, "duration": 1.74}, {"text": "Why do I keep forgetting?\nUgh, melted my probe, need more of these.", "start": 201.599, "duration": 4.22}, {"text": "I guess that's one of the reasons this video was sponsored by Keysight!", "start": 205.819, "duration": 3.99}, {"text": "This is actually good; Keysight is holding a contest for graduate and undergraduate students all around the world.", "start": 209.81, "duration": 7.199}, {"text": "The winner not only receives up to $50,000 in cash,", "start": 217.009, "duration": 3.171}, {"text": "Their university gets $50,000 in keysight tools. You can enter from the link below", "start": 220.68, "duration": 5.42}, {"text": "Basically, students try to tackle two important global issues, and I will be one of the judges to pick the winners.", "start": 226.409, "duration": 6.289}, {"text": "Is that a good thing? Just for entering your idea in the contest", "start": 232.739, "duration": 4.1}, {"text": "the first 240 eligible registrants get the fancy keysight DMM. So do it!", "start": 237.359, "duration": 4.7}, {"text": "I'll also give away two of them at the end and beside the cash and tools, your brilliant idea may change the world.", "start": 242.06, "duration": 6.18}, {"text": "*huge pop*", "start": 248.24, "duration": 0.64}, {"text": "F**K!", "start": 249.0, "duration": 0.6}, {"text": "S**t!", "start": 250.18, "duration": 0.5}, {"text": "Forgot to unplug this s**t. Anyways, here I am isolated from any conductor and this is, of course, live", "start": 251.94, "duration": 6.2}, {"text": "Now if I touch the white neutral wire or the green ground wire, nothing happens and if I touch the live", "start": 258.28, "duration": 7.4}, {"text": "Never try this at home. It is okay because I'm isolated", "start": 266.48, "duration": 4.48}, {"text": "Okay, nothing happens", "start": 272.88, "duration": 1.7}, {"text": "Again, I'm measuring between the charger output versus the livewire and this time with an isolated differential probe", "start": 274.58, "duration": 6.36}, {"text": "And if I touch the charger contact versus the neutral wire, I feel nothing which means the voltage across my body is low", "start": 280.94, "duration": 7.259}, {"text": "But what if I touch between the charger contact and the livewire and this shows 120 volt AC between them?", "start": 288.199, "duration": 5.97}, {"text": "Look at that my body resistance is shorting the output so it's actually floating", "start": 297.81, "duration": 6.32}, {"text": "Let me make my body more conductive", "start": 305.069, "duration": 2.66}, {"text": "There my body shorts it completely", "start": 308.819, "duration": 2.029}, {"text": "So the output of the charger is truly isolated and it's pretty safe to drop your phone in the bathtub while charging", "start": 310.849, "duration": 6.33}, {"text": "but if you drop your hair dryer in the bathtub", "start": 317.18, "duration": 2.5}, {"text": "There is no isolation and you are only relying on the GFCI to save you, so always plug it into the GFCI", "start": 319.86, "duration": 5.76}, {"text": "With those two protections in place, why people are still dying in the bathtub?", "start": 325.82, "duration": 5.28}, {"text": "Let's read up on the article a bit in one of those ad-infested pages", "start": 331.1, "duration": 2.78}, {"text": "\"A woman has been found dead after using her phone in the bath while the charging lead was a still plugged in\"", "start": 334.06, "duration": 6.36}, {"text": "I saw Nastya lying in an empty bath. I assumed the water drained over time", "start": 340.42, "duration": 3.6}, {"text": "Hmm, \"milkman who's never missed a shift force to retire after float stolen\", well, somebody beated him up", "start": 344.28, "duration": 5.86}, {"text": "According to reports she died from a severe electric shock", "start": 350.43, "duration": 3.47}, {"text": "Legging for 24 them in just over a year five people have died in Russia having used their plugged in mobile phone in the bath", "start": 354.33, "duration": 7.79}, {"text": "earlier this year", "start": 362.37, "duration": 1.31}, {"text": "This girl died. In December. That girl died. Why is it all girls? Another 12 year old girl listening to the music on her phone.", "start": 363.68, "duration": 7.769}, {"text": "Authorities in Russia have issued warnings about using your phone in the bathtub an", "start": 372.0, "duration": 3.76}, {"text": "Electronic engineer said relaxing in a bathroom with your mobile phone plugged is like playing Russian roulette", "start": 376.04, "duration": 5.8}, {"text": "Well, it shouldn't be unless I guess you're in Russia.", "start": 382.14, "duration": 3.17}, {"text": "Now, I'm not racist", "start": 385.31, "duration": 0.78}, {"text": "But it seems like these reports are from countries where the government", "start": 386.09, "duration": 3.269}, {"text": "Doesn't regulate the product sold in their market and instead tells people to be careful", "start": 389.789, "duration": 4.73}, {"text": "That's not racist. If people are consistently being electrocuted in their bathtub", "start": 394.83, "duration": 5.029}, {"text": "It means there missing both the ground fault protection and the isolation in their phone charger.", "start": 399.889, "duration": 5.45}, {"text": "I don't know", "start": 405.34, "duration": 0.63}, {"text": "If you have seen the KREOSAN channel a bunch of fine", "start": 405.97, "duration": 3.149}, {"text": "Ukrainian lads doing interesting and deadly projects in a successful YouTube channel", "start": 409.34, "duration": 4.309}, {"text": "what I can't help what to notice is the", "start": 413.78, "duration": 2.57}, {"text": "Environment they live in quite old homes and neighborhoods and if most homes around there are aged like this", "start": 416.63, "duration": 6.169}, {"text": "I won't expect their bathrooms to be updated with GFCI outlets.", "start": 422.8, "duration": 4.14}, {"text": "I also don't remember having those outlets back in Iran and both countries use", "start": 426.94, "duration": 4.859}, {"text": "220 volt AC which is of course more dangerous. And for the isolation of the charger adapter", "start": 432.11, "duration": 4.61}, {"text": "I'm afraid there are non isolated chargers out there being sold", "start": 436.789, "duration": 3.83}, {"text": "I mean all it takes is for some guy to say \"I'm gonna make a super cheap", "start": 440.62, "duration": 3.92}, {"text": "Product and help everyone save tons of money and make money in the process\" - and with no government regulations, they can sell it", "start": 444.64, "duration": 6.42}, {"text": "I mean, have you seen the video reviews of the suicide showerhead done by youtubers like big Clive or diodes gone?", "start": 451.06, "duration": 6.78}, {"text": "wild they actually sell it on Amazon too- basically the showerhead", "start": 457.849, "duration": 3.92}, {"text": "consists of exposed wires of a heating element where the water passes through and gets hot", "start": 462.229, "duration": 5.42}, {"text": "It shovels your brain with electrified water if you stand in the water or touch the faucets", "start": 467.65, "duration": 5.22}, {"text": "You will get a shock", "start": 472.87, "duration": 0.84}, {"text": "The funny thing is that they also have a ground wire in the way of the water thinking they are smart", "start": 473.71, "duration": 5.639}, {"text": "And this will de-electrify the water before it hits your head", "start": 479.349, "duration": 3.691}, {"text": "But if you watch those YouTubers' video reviews, you see that not only the water still has some good charge on it", "start": 483.04, "duration": 5.58}, {"text": "But also in order to make this showerhead work, you have to bypass your ground fault protection", "start": 488.62, "duration": 5.07}, {"text": "Otherwise the GFCI will pop open because the ground draws current from the live wire", "start": 494.21, "duration": 5.48}, {"text": "So in order to use this showerhead you have to bring unprotected live wires with you into the shower", "start": 499.759, "duration": 5.839}, {"text": "If something like this sells I have no doubt there could be crappy knockoff phone chargers out there cooking people", "start": 505.599, "duration": 6.12}, {"text": "so the moral of the story is that don't buy questionable knockoff electronics and always plug them into a GFCI outlet and", "start": 511.72, "duration": 7.439}, {"text": "Just don't bring your electronics into the bathroom with you", "start": 519.409, "duration": 2.72}, {"text": "Just let your mind be free in that period you might come up with great ideas that you can submit to Keysights IOT Innovation", "start": 522.13, "duration": 7.289}, {"text": "Challenge from the link below the deadline for your ideas is May 15", "start": 529.42, "duration": 3.779}, {"text": "There are two challenges to tackle using IOT solutions", "start": 533.199, "duration": 3.03}, {"text": "Make urban life healthier in big cities and keep waterways clean", "start": 536.72, "duration": 4.309}, {"text": "These two are real things humanity faces as the population grows", "start": 541.189, "duration": 4.16}, {"text": "Remember no idea is too simple or stupid", "start": 545.66, "duration": 2.779}, {"text": "Sometimes the simplest stuff have the biggest impact", "start": 548.439, "duration": 2.55}, {"text": "so follow the link below to learn more and submit your idea. Six people or teams will be selected and will be given an", "start": 551.149, "duration": 7.01}, {"text": "All-expense-paid trip to New York Maker Faire where they can demo their solutions. Then three winners will be picked by the judges", "start": 558.5, "duration": 6.589}, {"text": "including yours truly", "start": 565.67, "duration": 1.469}, {"text": "winners take twenty five thousand or fifty thousand dollars cash that can help them realize their ideas and", "start": 567.139, "duration": 5.929}, {"text": "Win equivalent amount of test equipment for their own university to help excel education and help improve human lives", "start": 573.41, "duration": 7.82}, {"text": "So put your brains to work", "start": 581.529, "duration": 1.081}, {"text": "We need it", "start": 582.61, "duration": 0.719}, {"text": "Give Away- - - in addition to the first", "start": 583.329, "duration": 2.489}, {"text": "240 eligible registrants to this competition that get a handheld", "start": 586.25, "duration": 4.009}, {"text": "Keysight multimeter I also give away two of them for that", "start": 590.48, "duration": 3.619}, {"text": "You can either become my patron at patreon.com or register from my link in the description for free. Thank you", "start": 594.1, "duration": 6.239}, {"text": "ey potupey potupey xb", "start": 600.339, "duration": 2.0}]