[{"text": "Thanks to Brilliant for supporting\nthis episode of SciShow.", "start": 0.22, "duration": 2.7}, {"text": "Go to Brilliant.org/SciShow to learn more.", "start": 2.92, "duration": 3.22}, {"text": "[INTRO ♪]", "start": 6.14, "duration": 1.9}, {"text": "Sea snakes are the most common group of marine reptiles in the entire ocean, with almost seventy individual species.", "start": 10.98, "duration": 7.76}, {"text": "But despite their impressive diversity,\nnone of them live in the Atlantic Ocean.", "start": 18.74, "duration": 5.4}, {"text": "Which is weird, and also nice!\nThere’s a whole ocean with no snakes in it!", "start": 24.14, "duration": 4.54}, {"text": "But also there’s an entire ocean of snake food and\nliving space out there, so what’s going on?", "start": 28.68, "duration": 5.66}, {"text": "The answer lies in their evolution, their biology,\nand a weirdly “dry” part of the ocean.", "start": 34.34, "duration": 6.94}, {"text": "The first reason is deceptively simple:\nmodern sea snakes didn’t evolve in the Atlantic.", "start": 41.28, "duration": 5.0}, {"text": "All sea snakes alive today evolved in a part of the Pacific known as the Coral Triangle and nearby regions,", "start": 46.28, "duration": 6.68}, {"text": "with most species evolving in the last\ntwo and a half million years.", "start": 52.96, "duration": 3.54}, {"text": "So they might not have started in the Atlantic, but they’ve had millions of years to theoretically move there and establish new populations.", "start": 56.5, "duration": 7.08}, {"text": "But they haven’t, in part because it’s a pretty big ocean for such little reptiles.", "start": 63.58, "duration": 5.68}, {"text": "Only one species of sea snake, the yellow-bellied\nsea snake, lives in the open ocean.", "start": 69.26, "duration": 5.56}, {"text": "Most of the others only live in\nnear-shore shallows.", "start": 74.82, "duration": 3.76}, {"text": "The yellow-belly is the only species that\nwould have much chance of making it to the Atlantic.", "start": 78.58, "duration": 4.98}, {"text": "But each of the different ways it could even hypothetically reach the Atlantic has its problems.", "start": 83.56, "duration": 4.46}, {"text": "Like, going around the tip of South America or Africa might be too cold.", "start": 88.02, "duration": 4.02}, {"text": "Yellow-bellied sea snakes need temperatures above 20 degrees Celsius in order to be toasty enough to breed.", "start": 92.04, "duration": 5.58}, {"text": "And too far below 18 and they’ll flat out die.", "start": 97.62, "duration": 2.76}, {"text": "Given an annual mean ocean temperature of less than 17 degrees off the coast of South Africa, that’s a no-go.", "start": 100.38, "duration": 6.06}, {"text": "Yellow-bellied sea snakes actually can live directly south of Africa, but it might be that the ocean is too cold just west of there,", "start": 106.44, "duration": 7.84}, {"text": "so they still couldn’t make the whole trip.", "start": 114.28, "duration": 1.94}, {"text": "Oddly enough, going around Africa\nmight also be too dry.", "start": 116.22, "duration": 4.62}, {"text": "Sea snakes can’t drink salt water.", "start": 120.84, "duration": 3.08}, {"text": "Instead, they drink a thin layer of rainwater that floats on the surface of the ocean after storms.", "start": 123.92, "duration": 7.78}, {"text": "Yes, this is a thing. That’s wild.", "start": 131.7, "duration": 2.96}, {"text": "But the southwest coast of Africa includes the Namib Desert with its infamous Skeleton Coast.", "start": 134.66, "duration": 5.44}, {"text": "This region may go years without rain,\neven out at sea.", "start": 140.1, "duration": 4.3}, {"text": "Sea snakes going this way could\nbecome dehydrated and die.", "start": 144.4, "duration": 3.54}, {"text": "And they might not have any more\nluck trying to go the other way, where\nNorth and South America are the obstacle.", "start": 147.94, "duration": 4.12}, {"text": "Millions of years ago, there was an open corridor between the Pacific and the Atlantic in what is now Panama—", "start": 152.06, "duration": 5.739}, {"text": "a much warmer route than rounding the southern tips of Africa or South America.", "start": 157.8, "duration": 4.36}, {"text": "Trouble is, the isthmus of Panama formed long before sea snakes evolved,", "start": 162.16, "duration": 5.6}, {"text": "blocking them from simply swimming from\none ocean to the other.", "start": 167.76, "duration": 3.62}, {"text": "We humans have opened that passage back up in the form of the Panama canal.", "start": 171.38, "duration": 4.58}, {"text": "And there have been reports of individual sea snakes on the Caribbean coast of Colombia—which presumably made the trip through the canal.", "start": 175.96, "duration": 8.0}, {"text": "Even so, scientists think it’s unlikely they’ll establish an actual breeding population via this route.", "start": 183.96, "duration": 5.9}, {"text": "So in the end, even though it might seem like the Atlantic could be a nice home for the sea snakes with warm water and tasty prey,", "start": 189.86, "duration": 7.84}, {"text": "their biology and evolutionary history put that possibility pretty much out of reach.", "start": 197.7, "duration": 5.06}, {"text": "If you’re the kind of person who wonders why certain reptiles never moved to certain parts of the ocean—well, you are as curious as we are.", "start": 202.76, "duration": 7.34}, {"text": "If you want to keep up your streak of learning new things, you might enjoy the daily challenges over on Brilliant.org.", "start": 210.1, "duration": 5.48}, {"text": "From stats to electricity to computer science, there are fresh new challenges every day.", "start": 215.58, "duration": 4.72}, {"text": "And whether you’re commuting or just relaxing at home, they give you a fun, bite-sized way to learn, apply, and master new concepts.", "start": 220.3, "duration": 8.3}, {"text": "And if you like what you learned from a given challenge, there’s a more in-depth course connected to each one.", "start": 228.6, "duration": 4.76}, {"text": "And they’re even free—but Brilliant’s premium members get access to the entire archive of challenges if you want to catch up.", "start": 233.36, "duration": 6.78}, {"text": "The first 200 people to sign up at Brilliant.org/SciShow will get 20% off an annual premium subscription.", "start": 240.14, "duration": 5.54}, {"text": "So if that sounds up your alley, click on the link in the description, and thanks for supporting us.", "start": 245.68, "duration": 4.48}, {"text": "[OUTRO ♪]", "start": 250.16, "duration": 9.64}]