[{"text": "Hi, everyone this is Wolfychu - before we start i want to talk to you, guys", "start": 0.0, "duration": 3.959}, {"text": "About something it's this app called quidd that lets you collect stickers", "start": 3.96, "duration": 3.82}, {"text": "Gifs, cards and even 3d figures for your phone, they have a huge selection form all different kinds of fandoms like", "start": 7.9, "duration": 7.159}, {"text": "Five nights at freddy's, Rick and Morty", "start": 15.06, "duration": 2.06}, {"text": "Marvel, Adventure Time and much much more and it's all completely free! you can trade stickers of your friends and even send them in text", "start": 17.28, "duration": 8.72}, {"text": "Messages to other people.There will  be more about this up at the end of the video.", "start": 26.109, "duration": 4.61}, {"text": "i did a video awhile ago talking about how awkward my time in primary school, was and well?...", "start": 30.72, "duration": 5.2}, {"text": "Turns out my high school years were not all that much better. I've had lots of embarrassing moments throughout my life", "start": 36.32, "duration": 6.66}, {"text": "And high school in particular, was no exception.", "start": 42.989, "duration": 2.76}, {"text": "Let me tell you some of them.", "start": 46.27, "duration": 2.509}, {"text": "You know how everyone has those nightmares in school that maybe one day they might show up to class wearing really", "start": 48.78, "duration": 4.799}, {"text": "Weird clothes or just their underwear or even no clothes at all? (wat ._.)", "start": 53.579, "duration": 5.91}, {"text": "Yeah, well...", "start": 59.489, "duration": 0.701}, {"text": "Something like that kind of happened to me once. One time at school, my class decided that they", "start": 60.19, "duration": 5.99}, {"text": "wanted to have a Pajama Day (oooo :D) since i was so shy back then, i wasn't really sure if i wanted to come to school in my pajamas", "start": 66.22, "duration": 6.469}, {"text": " ", "start": 72.689, "duration": 0.581}, {"text": "It seemed kind of embarrassing but", "start": 73.27, "duration": 2.09}, {"text": "My friend insisted that i should do it just because if i didn't id be only one in the entire class to not be wearing pajamas (poor wolfy ;-;)", "start": 75.36, "duration": 8.3}, {"text": "I really didn't want to stand out like that and be the boring one of the year", "start": 84.12, "duration": 3.92}, {"text": "the next morning", "start": 89.04, "duration": 0.96}, {"text": "I put on my shoes and i walked to school in my pajamas :3", "start": 90.12, "duration": 4.92}, {"text": "it felt really Awkward to be walking around outside in my pajamas i felt like everybody, was staring at me i also didn't know", "start": 95.17, "duration": 6.8}, {"text": "If the people from other classes knew, about  pajama, day, since it was only my year that", "start": 101.97, "duration": 4.739}, {"text": "Was doing it. When i got to school i kind of waited out of sight for everybody else to go inside so i could sneak", "start": 106.71, "duration": 6.629}, {"text": "In with as little people seeing", "start": 113.34, "duration": 1.95}, {"text": "Me as possible. I was moving down those hallways like a ninja >:3", "start": 115.29, "duration": 3.509}, {"text": "avoiding every single person that I saw.", "start": 119.17, "duration": 2.449}, {"text": "I knew I'd be fine once i was in the classroom with all of the other people in their pajamas", "start": 121.719, "duration": 4.85}, {"text": "Then i go to my classroom and i ran straight inside but then i realized that, something", "start": 126.7, "duration": 6.49}, {"text": "Wasn't right. I looked around and realized that not one other person", "start": 133.319, "duration": 6.11}, {"text": "Was wearing their pajamas. i stood there frozen not knowing, what to do, while everybody", "start": 139.43, "duration": 5.88}, {"text": "Else just started to laugh at me. T^T .It turns out that everybody decided to back out", "start": 145.31, "duration": 4.77}, {"text": "the pajama", "start": 150.08, "duration": 0.629}, {"text": "Day at the last minute and nobody told me", "start": 150.709, "duration": 2.4}, {"text": "So i was the only one who turned up to school in my pajamas and to make it worse i remember", "start": 153.36, "duration": 6.02}, {"text": "My pajamas were really dorky looking as, well and that's not even where that story ends because on the same", "start": 159.38, "duration": 6.569}, {"text": "Day since i was embarrassed about being the only one wearing pajamas i wanted to get changed as soon as i could.", "start": 165.95, "duration": 7.229}, {"text": "The bathroom was full of people. The only stall available, was the one at the end with the broken lock.", "start": 173.18, "duration": 6.21}, {"text": "I didn't really want to use that one but since i didn't want to stand in the middle of a", "start": 179.39, "duration": 4.139}, {"text": "busy", "start": 183.53, "duration": 0.4}, {"text": "Bathroom in my pajamas i decided to just go in there anyway i started to get changed and everything was fine until", "start": 183.93, "duration": 7.1}, {"text": "i noticed footsteps coming towards this side of the", "start": 191.34, "duration": 3.38}, {"text": "Bathroom then all of a sudden the door swung open and my worst fears have been realized", "start": 194.91, "duration": 5.119}, {"text": "A girl, was standing in the door looking right at me", "start": 200.25, "duration": 3.589}, {"text": "I didn't know", "start": 204.38, "duration": 0.87}, {"text": "what to do i started to freak out and she just ran away i was so embarrassed i wanted to cry i", "start": 205.25, "duration": 6.329}, {"text": "Hurried up to get the rest of my clothes on i rushed out of that bathroom", "start": 211.859, "duration": 3.92}, {"text": "As fast as i could >.<", "start": 215.78, "duration": 1.239}, {"text": "Just hoping that nobody else had seen what happened as soon as i got to my next lesson", "start": 217.019, "duration": 4.91}, {"text": "And thought that i could finally forget about it i realized that the exact, same girl, was in this class i could", "start": 221.93, "duration": 7.709}, {"text": "Feel her staring at me for the entire lesson", "start": 229.639, "duration": 2.79}, {"text": "And that's not even where the embarrassing stories end do any of you remember heely's?", "start": 232.43, "duration": 4.919}, {"text": "I used to love them it was always so much fun to skate around on them everywhere i went i did have a", "start": 237.62, "duration": 6.69}, {"text": "Few bad falls in them though, like this one time in P.E where i don't remember exactly what we were doing", "start": 244.31, "duration": 7.139}, {"text": "but we were coming up one by one to the front of the class to do some kind of jumps", "start": 251.609, "duration": 5.57}, {"text": "I was wearing my heely's that day", "start": 257.18, "duration": 1.27}, {"text": "But it was the kind where the wheel was kind of tucked in neatly to the shoes so you could", "start": 258.45, "duration": 5.209}, {"text": "Still use them as ordinary runners", "start": 263.659, "duration": 2.34}, {"text": "They did make all the noise when i ran in them though", "start": 266.0, "duration": 2.23}, {"text": "anyway", "start": 268.6, "duration": 0.5}, {"text": "When it was my turn to go up to the front of the class i was feeling", "start": 269.1, "duration": 3.39}, {"text": "Confident because of i thought i was actually pretty good at doing different kinds of jumps", "start": 272.56, "duration": 4.4}, {"text": "So i bent down and jumped up as high as i could", "start": 277.27, "duration": 3.169}, {"text": "And then went for the perfect landing but as soon as i hit the ground i felt", "start": 280.44, "duration": 5.369}, {"text": "my\nfeet slip from underneath of me because of four wheels and my shoes and i had what was probably the most dramatic", "start": 285.81, "duration": 7.409}, {"text": "Looking fall anyone in my class had ever seen", "start": 293.65, "duration": 3.439}, {"text": "Right down onto my butt", "start": 297.67, "duration": 1.01}, {"text": "just picture a cartoon character slipping on a banana peel because that's probably exactly", "start": 298.68, "duration": 6.779}, {"text": "What i looked like. I remember it would hurt to sit down for like two, days after that happened as well.", "start": 305.46, "duration": 5.729}, {"text": "I also, never wore my heely's on p.e days ever again", "start": 311.19, "duration": 3.6}, {"text": "And there are some of my embarrassing, high school stories! I have a lot more stories like", "start": 314.82, "duration": 4.95}, {"text": "This, so let me know", "start": 319.77, "duration": 1.2}, {"text": "If you'd like to see more! My boyfriend just recently posted a brand new, fully animated music video on his channel", "start": 320.97, "duration": 5.79}, {"text": "its animated", "start": 327.28, "duration": 1.04}, {"text": "By GingaNingaOwO and you can even find me hiding somewhere in the video!", "start": 328.32, "duration": 3.673}, {"text": "there's a link to it in the", "start": 331.993, "duration": 1.397}, {"text": "Description down below so be sure to check it out! Also if you're interested in the app Quidd that i talked", "start": 333.67, "duration": 5.75}, {"text": "About at the beginning of the video, be sure to check it out! If you're into cartoons and pop", "start": 339.42, "duration": 5.009}, {"text": "Culture or just like collecting and trading things then, this app will be perfect for you", "start": 344.5, "duration": 5.0}, {"text": "Because there's so many sets of stickers to complete not to mention there's new. Stuff released. Everyday too", "start": 349.51, "duration": 6.529}, {"text": "It has such a", "start": 356.67, "duration": 0.84}, {"text": "Big variety of stickers there's really something for everyone this app is totally free to download the link is in the description down below", "start": 357.51, "duration": 7.95}, {"text": "Thank you for watching, bye! -w-", "start": 365.86, "duration": 2.0}]