[{"text": "HEY, do you like TheOdd1sout or Domics", "start": 0.0, "duration": 0.0}, {"text": "or RubberNinja or", "start": 0.0, "duration": 0.0}, {"text": "Egoraptor/Arin Hanson or most importantly...", "start": 0.0, "duration": 0.0}, {"text": "mmmmany laughs?", "start": 0.0, "duration": 0.0}, {"text": "ᵃⁿᵈ ᵐᵉ", "start": 0.0, "duration": 0.0}, {"text": "Then hey, you should go to scribbleshowdown.com", "start": 0.0, "duration": 0.0}, {"text": "and check that out!", "start": 0.0, "duration": 0.0}, {"text": "James, Dom, Ross and Arin", "start": 0.0, "duration": 0.0}, {"text": "They're all gonna be doing the comedy", "start": 0.0, "duration": 0.0}, {"text": "and drawing and improv games", "start": 0.0, "duration": 0.0}, {"text": "and I'm gonna be there too...", "start": 0.0, "duration": 0.0}, {"text": "So if that sounds like a fun time,", "start": 0.0, "duration": 0.0}, {"text": "you should go to scribbleshowdown.com.", "start": 0.0, "duration": 0.0}, {"text": "Check out what cities we're going to,", "start": 0.0, "duration": 0.0}, {"text": "what the dates are and they'll see you there.", "start": 0.0, "duration": 0.0}, {"text": "and so will I :)", "start": 0.0, "duration": 0.0}, {"text": "My mom put me in a lot of extracurricular activities when I was growing up,", "start": 0.236, "duration": 3.56}, {"text": "like I've mentioned before,", "start": 3.796, "duration": 1.34}, {"text": "and one I haven't talked about yet", "start": 5.136, "duration": 1.46}, {"text": "was the summer camp called \"Camp Operetta\".", "start": 6.596, "duration": 2.0}, {"text": "When I was the ripe age of eight,", "start": 8.636, "duration": 1.66}, {"text": "my mom decided I wasn't enough of a versatile super-child yet,", "start": 10.296, "duration": 3.8}, {"text": "and it was time for me to dip my toes into the showbiz puddle", "start": 14.096, "duration": 3.1}, {"text": "that is musical theater.", "start": 17.196, "duration": 1.48}, {"text": "I did piano and stuff,", "start": 18.676, "duration": 1.42}, {"text": "but I've never been interested in the Performing Arts.", "start": 20.096, "duration": 2.5}, {"text": "So, when my mom asked me if I wanted to do this", "start": 22.696, "duration": 2.1}, {"text": "\"Camp Operetta\" thing during the summer,", "start": 24.796, "duration": 1.78}, {"text": "I was like...", "start": 26.576, "duration": 1.2}, {"text": "''Okay.\"", "start": 27.776, "duration": 0.76}, {"text": "''Wait, what is this?''", "start": 30.416, "duration": 0.82}, {"text": "Look, I just agreed with anything my parents told me as a kid!", "start": 31.236, "duration": 3.14}, {"text": "I didn't know I could actually have an opinion!", "start": 34.376, "duration": 2.44}, {"text": "I'm assuming that most of you don't know what \"Camp Operetta\" is", "start": 36.836, "duration": 2.86}, {"text": "because I Googled it... and got no results.", "start": 39.696, "duration": 2.02}, {"text": "To be fair, it was a one-off indie camp", "start": 41.796, "duration": 2.22}, {"text": "one of the local elementary schools just did.", "start": 44.016, "duration": 2.3}, {"text": "so...", "start": 46.476, "duration": 0.68}, {"text": "Basically \"Camp Operetta\" was for young artsy theater kids", "start": 47.156, "duration": 2.96}, {"text": "and would start off by sitting in a group", "start": 50.116, "duration": 1.88}, {"text": "and reading a picture book.", "start": 51.996, "duration": 1.18}, {"text": "Then everyone works together to rewrite it into a musical play", "start": 53.176, "duration": 2.82}, {"text": "to perform in front of the parents at the end of the camp", "start": 55.996, "duration": 2.32}, {"text": "Teacher: \"And then what should the tiger say?\"", "start": 58.816, "duration": 1.5}, {"text": "Random Kid 1: ''𝕞𝕒𝕜𝕖 𝕙𝕚𝕞 𝕤𝕒𝕪 𝕥𝕙𝕖 𝕗 𝕨𝕠𝕣𝕕''", "start": 61.076, "duration": 1.46}, {"text": "Then we all get assigned roles for the play,", "start": 62.536, "duration": 1.78}, {"text": "\"write the music\", and make the costumes and set.", "start": 64.316, "duration": 2.32}, {"text": "It was actually really fun and I looked forward to it a lot!", "start": 66.636, "duration": 2.42}, {"text": "Also when I say write music,", "start": 69.056, "duration": 1.64}, {"text": "I mean the teachers tell us how to play nursery songs", "start": 70.696, "duration": 3.0}, {"text": "on xylophones and those colored plastic tubes.", "start": 73.696, "duration": 2.5}, {"text": "We weren't dropping fire in 4th grade.", "start": 76.216, "duration": 2.22}, {"text": "The first year I did \"Camp Operetta\",", "start": 78.436, "duration": 1.56}, {"text": "the book we were supposed to theater-ize was...", "start": 79.996, "duration": 2.7}, {"text": "I can't remember.", "start": 83.336, "duration": 0.74}, {"text": "I just know it was about a bunch of animals in the jungle,", "start": 84.076, "duration": 2.58}, {"text": "and I wanted to land the role of cheetah,", "start": 86.656, "duration": 2.04}, {"text": "because I thought cheetahs were cool,", "start": 88.696, "duration": 1.7}, {"text": "and obviously, I'm the best cheetah out of all of you losers!", "start": 90.396, "duration": 3.24}, {"text": "She wasn't the main character,", "start": 93.636, "duration": 1.26}, {"text": "but I've never been a \"main character\" kind of guy.", "start": 94.896, "duration": 2.6}, {"text": "I'm the \"I can't cope with #1 spots", "start": 97.676, "duration": 2.54}, {"text": "because the expectation, spotlight, and stress is enough to break me\" kind of guy.", "start": 100.216, "duration": 3.92}, {"text": "So that's why I'm always happy to sit at, like, #2 in most things.", "start": 104.136, "duration": 3.56}, {"text": "It proves, \"Hey, I'm talented and hard-working enough", "start": 107.696, "duration": 2.7}, {"text": "to land an important and high up role,", "start": 110.396, "duration": 1.8}, {"text": "without complete judgement and pressure", "start": 112.196, "duration": 2.1}, {"text": "of being at the top with everyone waiting for you to mess something up.\"", "start": 114.296, "duration": 3.1}, {"text": "A bit of a... depressing life hack for you guys.", "start": 117.476, "duration": 2.66}, {"text": "Spoiler alert: I nailed the audition and reeled myself in the role of cheetah.", "start": 120.276, "duration": 3.92}, {"text": "The catch was there were too many kids in the camp for the amount of characters in the play.", "start": 124.416, "duration": 4.0}, {"text": "So what the teachers decided we'd do was assign two people per character, then halfway through the play switch out casts.", "start": 128.416, "duration": 6.4}, {"text": "The girl who landed Cheetah 2 was this one girl who I don't remember the name of,", "start": 134.816, "duration": 3.56}, {"text": "but I thought she was super cool because she only had one arm.", "start": 138.376, "duration": 3.26}, {"text": "It's a good thing the teachers didn't care that the two kids who shared a role didn't have to look similar,", "start": 141.776, "duration": 4.58}, {"text": "Because they'd either have to dye her hair dark brown", "start": 146.536, "duration": 1.88}, {"text": "and make her look Asian somehow, or chop one of my arms off.", "start": 148.416, "duration": 3.94}, {"text": "We made masks out of paper plates, painted a jungle scenery on big sheets of paper for the background.", "start": 152.516, "duration": 5.16}, {"text": "I think the costumes were made of paper too...", "start": 157.685, "duration": 2.331}, {"text": "Look, they didn't have much money.", "start": 160.196, "duration": 1.64}, {"text": "I remember one day I decided I wanted to bring my favorite stuffed animal to camp with me and show them off to the other kids.", "start": 161.836, "duration": 6.06}, {"text": "It was this stuffed mouse I got at a book store I named Raoole spelled R-A-O-O-L-E, because that was 8 year old me trying my best.", "start": 167.916, "duration": 8.28}, {"text": "I brought out Raoole during lunch/break time, and we all started playing with him.", "start": 176.196, "duration": 3.92}, {"text": "We stood in a big circle and tossed him hot potato style to each other,", "start": 180.116, "duration": 3.222}, {"text": "and after a few minutes of this, I went to go use the bathroom real quick.", "start": 183.338, "duration": 3.358}, {"text": "Raoole has always been really special to me because he was the first purchase I made completely on my own without my parents' permission.", "start": 186.696, "duration": 6.44}, {"text": "At the end of the school year, if you read enough books and took a little test to prove you read it, you'd get to go on a field trip to a book store.", "start": 193.136, "duration": 6.32}, {"text": "And I, being the bookworm I am, barely scraped in by reading the bare minimum amount of books to make it.", "start": 199.456, "duration": 6.42}, {"text": "In a desperate attempt to make the cut in time I even requested a bunch of random book tests in some miracle I'd guess enough answers to pass and get points for.", "start": 206.056, "duration": 9.26}, {"text": "It was pathetic, and it worked.", "start": 215.316, "duration": 2.04}, {"text": "\"Hell yeah suckers, I totally earned this trip! WOOO--!\"", "start": 217.456, "duration": 3.84}, {"text": "The purpose of the trip was for kids to get excited about reading and buy some books they'd read over summer break.", "start": 221.296, "duration": 5.42}, {"text": "So I walked around the bookstore, looked at the books that people were talking about,", "start": 226.716, "duration": 4.04}, {"text": "skimmed the new releases, and then bought a mouse, because I don't like reading.", "start": 230.76, "duration": 4.616}, {"text": "And I was really excited about it because it was my first 100% own personal choice.", "start": 235.376, "duration": 5.04}, {"text": "I didn't have to go: \"Mommy, can I get this?\"", "start": 240.416, "duration": 2.66}, {"text": "I made my own decision... with their money.", "start": 243.076, "duration": 3.06}, {"text": "Since that field trip I took Raoole everywhere and he's always been my favorite stuffed animal and super special to me.", "start": 246.296, "duration": 5.74}, {"text": "Random Kid 2: \"Hey, we ripped his foot off.\"", "start": 253.276, "duration": 2.1}, {"text": "So in the literal 2 minutes I was gone taking a pee,", "start": 255.396, "duration": 2.9}, {"text": "the kids got so rambunctious that they ripped Raoole's foot off and all the fricking beans were spilling all out the gash hole!", "start": 258.296, "duration": 7.26}, {"text": "What the frick!? You BARBARIANS!!!", "start": 265.556, "duration": 2.1}, {"text": "I immediately put Raoole back in my bag, upside down so no more beans spilled out, but I wasn't really that upset about it.", "start": 267.656, "duration": 6.98}, {"text": "For some sixth-sense reason while I was in the bathroom, I actually thought to myself:", "start": 274.636, "duration": 4.02}, {"text": "\"They're gonna rip him open somehow.\" and they did.", "start": 279.516, "duration": 2.8}, {"text": "I was cool and we were all able to joke about it. The beans that spilled out looked like little eggs,", "start": 282.416, "duration": 4.8}, {"text": "so we were like: \"Oh, he's laying eggs, oooh.\"", "start": 287.216, "duration": 2.76}, {"text": "After camp my mom was able to stitch him back up too, so he's all good.", "start": 289.976, "duration": 3.68}, {"text": "Look, here he is. Doing good  B)", "start": 293.656, "duration": 1.7}, {"text": "Anyway, we kept working on the play, finished getting the show set up, practiced our lines,", "start": 295.576, "duration": 4.084}, {"text": "and after a couple of weeks we were ready to perform in front of the parents.", "start": 299.66, "duration": 3.456}, {"text": "And I think it went really well, I honestly don't remember anything about it,", "start": 303.336, "duration": 3.756}, {"text": "but my parents are sending video taped footage they took of it, so here's some of that.", "start": 307.096, "duration": 4.52}, {"text": "*children in cast singing* Ha, ha ha ha ha ha! You are ugly! Ha, ha ha ha ha ha ha--!", "start": 311.616, "duration": 9.08}, {"text": "But that's not the end of \"Camp Operetta\". I went again next year and this time we did a play on the Rainbow Fish.", "start": 320.696, "duration": 5.26}, {"text": "The story of a special fish with shiny, rainbow scales", "start": 325.996, "duration": 2.86}, {"text": "and no one wanted to hang out with him because he wouldn't give them what makes him special.", "start": 328.876, "duration": 4.22}, {"text": "and the only way he felt like he could be happy was to give away his special-ness to the fish who only wanted to leech off his beauty.", "start": 333.096, "duration": 6.52}, {"text": "Setting aside the controversial morals of the book, we got to work turning it into a play.", "start": 339.616, "duration": 4.72}, {"text": "There weren't as many kids this year so we didn't need to share roles.", "start": 344.336, "duration": 3.08}, {"text": "I ended up again with a semi-main character... the seahorse.", "start": 347.416, "duration": 3.64}, {"text": "Now hardcore rainbow fish fans are probably saying: \"Wait, there's no seahorse in that story...\" and you're right.", "start": 351.296, "duration": 7.52}, {"text": "As a group of kids, we decided to completely create a new character in the story because, we liked sea horses...", "start": 358.816, "duration": 5.98}, {"text": "And that was the cohesive moral story about acceptance and loneliness... Random Kid 3: \"Can we add a sea horse?\"", "start": 365.016, "duration": 6.66}, {"text": "Random Kid 1: \"make him say the f-word!\"", "start": 372.216, "duration": 1.18}, {"text": "During the music learning part of the play, the teachers asked us who could play the piano,", "start": 373.396, "duration": 2.22}, {"text": "because they wanted to assign someone the role of playing the Under the Sea melody from the Little Mermaid without botching it up.", "start": 375.616, "duration": 6.94}, {"text": "I, along with three other kids raised our hands, and we were taken to the piano to do a little musical audition.", "start": 382.696, "duration": 5.48}, {"text": "The other kids took turns playing Mary had a Little Lamb and Twinkle Twinkle Little Star, and I quickly realized I was overqualified for this part.", "start": 388.276, "duration": 8.1}, {"text": "When it was my turn to play, I sat down and played Pachelbel's Canon I memorized from my piano recital, like a showoff.", "start": 396.696, "duration": 7.58}, {"text": "That was the one time I realized I was the Asian kid in a scenario. I got the part.", "start": 404.536, "duration": 4.9}, {"text": "The night of the play, we got into our costumes.", "start": 409.436, "duration": 2.1}, {"text": "Mine was made out of a towel with the bottom rolled up to look like a seahorse tail.", "start": 411.536, "duration": 3.92}, {"text": "I thought the costume was actually really cool, but a problem arose when I was in the middle of my final lines in the performance.", "start": 415.496, "duration": 5.86}, {"text": "I had a solo part where I was supposed to build hype for the ending of the play, then raise my arms up at the end to deliver the lines that induce the big finale.", "start": 421.516, "duration": 8.3}, {"text": "But as I was saying my lines and getting ready to raise my arms up, I realized the bracelet I was wearing was caught on one of the towel strings. (rip)", "start": 429.836, "duration": 7.06}, {"text": "I started freaking out because this was the big finishing move for my character. It said in the script: \"Seahorse raises both arms, blah blah blah blah blah.\"", "start": 436.976, "duration": 8.54}, {"text": "This was the big moment and it's gonna be ruined because my costume is a towel. I was wiggling my wrist in all directions, and trying to get my arm free as time was ticking down quickly.", "start": 445.696, "duration": 9.52}, {"text": "Finally, I delivered the last line... and could only raise up one arm.", "start": 455.336, "duration": 5.2}, {"text": "Like Cheetah 2.", "start": 461.356, "duration": 0.82}, {"text": "I remember feeling really stupid because no one raises one arm to do anything but ask to use the bathroom... or be flamboyant.", "start": 462.316, "duration": 7.14}, {"text": "I felt like I ruined the big moment but talking to my parents afterwards, they said they didn't notice,", "start": 469.456, "duration": 4.8}, {"text": "and looking back it was probably a much bigger deal in my 9 year old head than it actually was.", "start": 474.256, "duration": 5.1}, {"text": "I still feel like that was one of my biggest failures in life though. See, that's exactly why I don't like main roles in anything.", "start": 479.456, "duration": 5.38}, {"text": "A prime example of self-fulfilling prophecy.", "start": 484.836, "duration": 2.62}, {"text": "and that was my time in \"Camp Operetta\". No, I didn't do it a third year,", "start": 487.596, "duration": 4.4}, {"text": "because they didn't have enough money or participants, so they had to shut it down. I told you they didn't have much money.", "start": 491.996, "duration": 6.66}, {"text": "You will be forever missed, \"Camp Operetta\", you made my summers more fun, and my Raoole's foot all janky.", "start": 498.776, "duration": 6.52}, {"text": "Who knows if I would've became a theater kid if \"Camp Opperetta\" never shut down?", "start": 505.796, "duration": 3.98}, {"text": "But either way, I'm not doing any of that stuff now.", "start": 509.776, "duration": 2.76}, {"text": "I do drawings behind a screen.", "start": 512.536, "duration": 1.58}, {"text": "I mentioned it already, but just a reminder that there's still a few tickets left to see James, Dom, Ross, Arin and me frantically trying to draw and be funny at Scribble Showdown.", "start": 514.116, "duration": 8.08}, {"text": "They're selling out fast so cop a tic if you really wanna see it.", "start": 522.276, "duration": 3.46}, {"text": "You can go to scribbleshowdown.com to see which cities we're going to, and on which dates.", "start": 525.736, "duration": 4.56}, {"text": "We hope to see you there and I'm excited to win every show.", "start": 530.296, "duration": 2.9}, {"text": "Just you wait...", "start": 533.996, "duration": 0.5}, {"text": "Thanks for watching the video. This is a warning:", "start": 534.496, "duration": 2.18}, {"text": "Don't trust anyone with your Rooales, they can and will rip their foot off, and stay away from bracelets when your shirt is a towel.", "start": 536.676, "duration": 5.78}, {"text": "Bye bye!  ᕕ( ᐛ )ᕗ", "start": 542.496, "duration": 0.8}]