[{"text": "London the capital of the United Kingdom often called Northern Ireland and mates", "start": 0.099, "duration": 5.24}, {"text": "But it was once the capital of the entire world and it still has those", "start": 5.41, "duration": 4.67}, {"text": "Capital of the entire world prices spent 30 pounds on breakfast once like a dumbass, but now you won't have to. Hello", "start": 10.24, "duration": 7.76}, {"text": "I'm Killian, and I'm here to save you a plane ticket.", "start": 18.0, "duration": 3.359}, {"text": "Two weeks ago I decided to fly to London with two goals", "start": 23.41, "duration": 3.83}, {"text": "visit and review every tourist attraction and", "start": 27.88, "duration": 2.87}, {"text": "Find Jack the Ripper. It's been 130 years. It's time to bring in a professional when I landed on Friday. It was sunny, London", "start": 31.449, "duration": 7.76}, {"text": "It's not supposed to be sunny supposed to be foggy and cloudy. I was worried weather would ruin my trip", "start": 39.21, "duration": 5.43}, {"text": "Fortunately for the rest of my visit the weather was properly depressing", "start": 45.61, "duration": 3.769}, {"text": "So what attraction should I start with? Maybe the oldest one. The Tower of London. Yes", "start": 49.41, "duration": 6.119}, {"text": "Your first thought is  that is not a Tower", "start": 55.53, "duration": 1.919}, {"text": "That's a fort and next to the fort is The Tower Bridge, which actually has two towers and the city itself is called Lunden", "start": 57.449, "duration": 7.139}, {"text": "But it has two O's in it so it should be called low and down this rabbit hole never ends", "start": 64.589, "duration": 5.22}, {"text": "Just stay out of it", "start": 69.81, "duration": 1.32}, {"text": "the Tower's been a Palace, a fort, a", "start": 71.13, "duration": 2.069}, {"text": "Prison and the top rated TripAdvisor page many visit for this building which houses the crown jewels. They are", "start": 73.299, "duration": 7.1}, {"text": "Protected by a very long queue to bore thieves into not stealing", "start": 80.619, "duration": 4.85}, {"text": "I preferred the old crown jewels in this house. Can... can someone steal them for me?", "start": 85.47, "duration": 5.909}, {"text": "I think you can climb on this as Assassin´s Creed style and then sort of mission", "start": 91.38, "duration": 3.84}, {"text": "Impossible your way in and if you then mail them to me, I will PayPal you 200 bucks. The building in the middle is called the white", "start": 95.29, "duration": 6.829}, {"text": "Brown-ish tower. It's a weapons museum where you can find cannons and", "start": 103.24, "duration": 4.909}, {"text": "medieval", "start": 108.729, "duration": 1.111}, {"text": "Assault rifles it even has weapons used in actual battles like this", "start": 109.84, "duration": 5.809}, {"text": "robot dragon used against a French Robot Unicorn", "start": 116.02, "duration": 3.65}, {"text": "But when I walk around this fort, I can't shake the feeling that it was better back in the day", "start": 120.49, "duration": 6.529}, {"text": "There used to be a polar bear and animal gladiator fights", "start": 127.02, "duration": 3.599}, {"text": "Vegetarians really ruin the appeal of this place worse than that", "start": 131.319, "duration": 3.68}, {"text": "The tower guards are called beefeaters because they were paid in beef now", "start": 135.0, "duration": 4.199}, {"text": "They are allegedly paid in money, which makes this whole place unauthentic", "start": 139.2, "duration": 5.099}, {"text": "The cafeteria doesn't even serve roast beef turn it back into a prison", "start": 144.37, "duration": 4.759}, {"text": "Let's go to the neighbor attraction instead Tower Bridge finished in", "start": 149.129, "duration": 4.11}, {"text": "1894 its purpose was to be in the background of social media photos so that you can show people you went to London they had", "start": 153.79, "duration": 7.22}, {"text": "To close down the top portion in 1910 because like everything if you leave it alone long enough", "start": 161.01, "duration": 6.21}, {"text": "it becomes a brothel so you have to realize that my", "start": 167.22, "duration": 3.299}, {"text": "expectations were impossibly high", "start": 171.099, "duration": 1.98}, {"text": "But they turn it into a place to read bridge facts barely any prostitutes. Then you go to the engine room", "start": 173.079, "duration": 7.4}, {"text": "I like steampunk", "start": 180.93, "duration": 1.05}, {"text": "So this place is pretty neat", "start": 181.98, "duration": 1.72}, {"text": "But tickets were 7 pounds and they didn't let us open the bridge we pay we say from the bridge you can see st", "start": 183.7, "duration": 6.229}, {"text": "Paul's Cathedral and people, this is one mighty building but scam warning not actually owned by st", "start": 189.93, "duration": 7.35}, {"text": "Paul it was tallest building in the city for 300 years until they built this thing", "start": 197.28, "duration": 5.25}, {"text": "Surpassing it in both height and beauty beautiful art a great view from the roof", "start": 202.989, "duration": 5.48}, {"text": "But the most important thing of all probably has the best museum coffee, but the decorations kind of hurt my enjoyment", "start": 208.54, "duration": 6.559}, {"text": "I'm looking at the statue raised to a general that fell to the French at Waterloo and I feel kinda guilty", "start": 215.099, "duration": 6.06}, {"text": "Sitting here eating a croissant", "start": 221.319, "duration": 1.431}, {"text": "Those are three famous London buildings, but let's visit the most famous one of them all Palace of Westminster", "start": 222.75, "duration": 6.329}, {"text": "It's so fun being in another country's parliament because it's like here decisions are made", "start": 229.54, "duration": 5.449}, {"text": "That doesn't affect me at all", "start": 234.989, "duration": 2.0}, {"text": "Look its battle paintings listen to an audio guide fail to convince you the Queen shouldn't have all the power", "start": 237.15, "duration": 5.79}, {"text": "But I really came here to find out if Jack the Ripper was a government cover-up", "start": 243.04, "duration": 4.339}, {"text": "So I asked the Prime Minister, but it was awkward because she was trying to get through a door", "start": 247.389, "duration": 6.32}, {"text": "But was holding two Starbucks cups, but refused to put one down and refused to ask me for help", "start": 253.709, "duration": 6.929}, {"text": "She said there are no classified documents in the Elizabeth Tower. So I", "start": 260.859, "duration": 4.84}, {"text": "Can't get in there because it's cocooning to become a butterfly", "start": 266.1, "duration": 3.41}, {"text": "I do agree that it's a bit suspicious that they randomly decided to renovate it", "start": 269.7, "duration": 5.51}, {"text": "Just two years before I came here", "start": 275.21, "duration": 1.9}, {"text": "You might have heard this tower called by another name", "start": 277.11, "duration": 2.869}, {"text": "But that's actually the Bell and if you call it Big Ben the locals, they will have no idea what you're talking about", "start": 279.98, "duration": 4.709}, {"text": "We just confuse them. So I learned nothing about Jack and as a side effect. I learned the entire history of London", "start": 285.08, "duration": 6.779}, {"text": "so now I might as well share it with you The history of London, so", "start": 291.96, "duration": 3.859}, {"text": "at some point in history", "start": 296.34, "duration": 2.0}, {"text": "They created London then it gained enough experience", "start": 299.19, "duration": 3.44}, {"text": "To become Victorian London and they built a clock and it made a bunch of money so they said to themselves", "start": 303.75, "duration": 4.4}, {"text": "How can we make more tourist money find out in the next segment Killian visits tourist traps! This is a Travel Guide", "start": 308.31, "duration": 7.07}, {"text": "So I have to do things. I don't want to do for example visit Coca-Cola presents the Coca-Cola London Eye", "start": 315.77, "duration": 5.489}, {"text": "By Coca-Cola a big ferris wheel sponsored by an American soft drink company", "start": 321.26, "duration": 4.649}, {"text": "Can't remember which one it is the slow ferries, right? It can't be that bad wrong", "start": 325.91, "duration": 5.01}, {"text": "It was raining trying to book the correct ticket might require in eBook", "start": 331.25, "duration": 4.05}, {"text": "They tried to get me to buy 50 add-ons while standing in line a large school class appeared in front of me", "start": 335.4, "duration": 6.829}, {"text": "I'm guessing from another dimension a woman was complaining to an employee about the weather as it is", "start": 342.45, "duration": 6.109}, {"text": "Sixteen-year-old intern had the power to change the will of God and I had to pee I just wanted to go see the fishies", "start": 349.02, "duration": 7.039}, {"text": "I recommend London Eye to everyone protip to the food trucks next to the eye", "start": 356.09, "duration": 4.529}, {"text": "You can make a fortune selling Pepsi from all the people taking ironic pictures", "start": 360.93, "duration": 4.73}, {"text": "I guess you still make money from the huge crowds, but I want to visit the most overcrowded attraction in London backs people", "start": 365.66, "duration": 6.36}, {"text": "I think the line to get in was 30 minutes and the line to buy tickets were two hours", "start": 372.02, "duration": 5.519}, {"text": "If only some local lads had connected all the computers so you could buy a ticket from one of those", "start": 377.88, "duration": 5.51}, {"text": "You were obviously not supposed to visit this place alone", "start": 383.58, "duration": 3.769}, {"text": "The entrance code actually said oh you're alone you were supposed to go with someone and say wow", "start": 387.57, "duration": 6.619}, {"text": "some of these look really realistic and some of these don't", "start": 394.32, "duration": 3.26}, {"text": "And they will agree with you and you will live happily ever after there's also a ride that shows the history of London", "start": 397.72, "duration": 5.369}, {"text": "But what's the point now that you have this video? I like these Story characters", "start": 403.19, "duration": 4.22}, {"text": "But last time I was here camera phones were not mainstream and my god can't I go to another place filled with", "start": 407.72, "duration": 6.29}, {"text": "pop-culture references and royal wedding souvenirs like", "start": 414.23, "duration": 2.69}, {"text": "Westminster Abbey, it's the burial site of", "start": 417.47, "duration": 2.389}, {"text": "3,300 people", "start": 420.71, "duration": 1.32}, {"text": "Composers writers scientists Queens Kings. No one above that though I'm saying there are no footballers", "start": 422.03, "duration": 6.38}, {"text": "everyone has a monument and expect the grandest monuments to belong to someone important but it's usually like the Duke of Arsenal's cat's", "start": 428.63, "duration": 7.07}, {"text": "Previous owner. It's been the coronation site of every British King", "start": 435.95, "duration": 3.409}, {"text": "I don't know the rules I snuck in and sat on the coronation chair and coordinated myself", "start": 439.36, "duration": 5.76}, {"text": "I think I'm the king of Britain now. If not, I'm very disappointed", "start": 445.12, "duration": 4.559}, {"text": "Mister edsall building. I can look out over my kingdom a building that looks like your mother", "start": 450.47, "duration": 5.54}, {"text": "Wanted to make your apartment less depressing so she bought a generic vase", "start": 456.02, "duration": 4.13}, {"text": "What's that the view from the shard is surprisingly nice go to the 68th floor", "start": 460.73, "duration": 5.479}, {"text": "Grab some champagne and realize you didn't actually have to visit all these landmarks. You could've just enjoyed them from here", "start": 466.55, "duration": 6.05}, {"text": "God save you London computer speaker or London air conditioner. What do people call you the", "start": 472.6, "duration": 6.389}, {"text": "Walkie-talkie. It looks nothing like one, but that makes sense", "start": 479.66, "duration": 2.839}, {"text": "See during the tower this beautiful baby needs protection and the best way to protect him is the HMS Belfast", "start": 482.57, "duration": 6.799}, {"text": "You walk around this light cruiser turned museum and you think to yourself", "start": 489.68, "duration": 3.739}, {"text": "how could they live like this then you find out they drank rum literally every day and you're like, oh", "start": 493.49, "duration": 6.26}, {"text": "Do they have any openings? I mean sure everything looks cramped and uncomfortable, but god damn", "start": 500.0, "duration": 6.019}, {"text": "Did they have some nice toilets?", "start": 506.02, "duration": 1.959}, {"text": "Honestly, though same problem like with the bridge even though they have a bunch of missiles fact", "start": 507.979, "duration": 4.79}, {"text": "they don't let you fire the cannons the disappointment in the", "start": 512.96, "duration": 3.739}, {"text": "Seven-year-old girls faces makes this museum so hard to bear but it reminds me that", "start": 517.07, "duration": 5.809}, {"text": "Vacations are supposed to be relaxing but this is a Travel Guide. I have walked non-stop", "start": 523.159, "duration": 5.21}, {"text": "I've basically been on a military march every day much will visit the Imperial War Museum", "start": 528.37, "duration": 5.27}, {"text": "That shows Britain in World War one, two and cold war. Conditions", "start": 534.07, "duration": 4.13}, {"text": "Of the soldiers during World War one were really terrible", "start": 538.36, "duration": 4.07}, {"text": "I can relate after my visit to the Eye museum also runs", "start": 542.67, "duration": 4.5}, {"text": "Churchill's bunker a man who insulted so many people they decided he should insult a guy named", "start": 547.48, "duration": 6.05}, {"text": "Adolf into defeat. the World War 1 excavation is very ambitious World War two less so", "start": 553.72, "duration": 5.72}, {"text": "I think it's to show how unprepared Britain was for the Second World War by being less prepared for visitors", "start": 559.44, "duration": 6.57}, {"text": "Both of these places threw me out because I was the last one left his entire city closes too early yet", "start": 566.5, "duration": 6.049}, {"text": "Seeing these memories of divide", "start": 573.19, "duration": 2.359}, {"text": "Reminds me why I created this new series", "start": 576.55, "duration": 2.869}, {"text": "To flex on you bitches while you'll be sitting at home", "start": 580.03, "duration": 3.259}, {"text": "I'll be flying in the premium rest of economy sleeping in the freshest four-star hotels and eating at the fanciest", "start": 583.29, "duration": 6.69}, {"text": "Fast-food places but doing that has made me broke", "start": 590.2, "duration": 3.049}, {"text": "Today's sponsor the third reason I went to England to hide my identity online", "start": 593.65, "duration": 4.729}, {"text": "Then I found out I could have just used North VPN", "start": 599.05, "duration": 2.75}, {"text": "They have over 1,000 servers in 61 plus countries including this place", "start": 601.8, "duration": 4.799}, {"text": "Click the link in the top of the description for 75% of a three-year plan", "start": 606.7, "duration": 4.369}, {"text": "And if you use the code Killian experience you get a month for free. So why do I need internet privacy?", "start": 611.08, "duration": 6.139}, {"text": "It's because I like pineapple on pizza. There are ancient orders trying to hunt us down", "start": 617.22, "duration": 4.92}, {"text": "If a VPN had single data encryption", "start": 622.42, "duration": 3.11}, {"text": "They might find us but Nord VPN has double data encryption for increased anonymity", "start": 625.53, "duration": 5.339}, {"text": "Click on top link in the description Nord VPN now sponsoring a nord. Now that I have zero money", "start": 631.03, "duration": 6.469}, {"text": "I need to check out free stuff. So we are off to a Plaza called", "start": 637.5, "duration": 4.169}, {"text": "Trafalgar Square, it celebrates Admiral Nelson who single-handedly", "start": 642.34, "duration": 4.429}, {"text": "Bet I am the first person to make that pun. Defeated Napoleon's Navy", "start": 648.25, "duration": 3.83}, {"text": "Behind the square is a building containing paintings if you weren't sure what paintings are", "start": 652.41, "duration": 5.129}, {"text": "It's like concept art for history it even has an entire room dedicated to the smartest ninja turtle", "start": 657.97, "duration": 6.71}, {"text": "Even if it's full of epic artwork, this one is my favorite", "start": 664.779, "duration": 3.77}, {"text": "It's doctors debating Jesus, but he already knows everything like me", "start": 668.55, "duration": 4.979}, {"text": "I like it because the doctors like who is this guy and Jesus breaks the fourth wall and looks at the audience like", "start": 673.529, "duration": 6.27}, {"text": "They don't even know. I'm the Son of God, not every painting is great", "start": 679.959, "duration": 3.71}, {"text": "Some of these are obviously as to word clipart", "start": 683.67, "duration": 2.4}, {"text": "But I can't show you most of these paintings because I'll get demonetised then I got ripped off again", "start": 686.08, "duration": 5.239}, {"text": "I went to a British Museum, but it was a world history museum you go through a timeline of ancient artifact", "start": 691.32, "duration": 6.659}, {"text": "So it's like Egyptian stuff then Assyrian then Greek Persian", "start": 697.98, "duration": 3.33}, {"text": "Roman and that's as far as I got before they closed it maybe the next", "start": 701.529, "duration": 4.04}, {"text": "Country's like Texas, an ancient barbecue", "start": 705.88, "duration": 3.5}, {"text": "I love this place because of the audio guide a British narrator can form a completely different picture of history", "start": 709.38, "duration": 7.409}, {"text": "they are like the centaur part represent the powerful bites of Athens democracy when in reality", "start": 717.16, "duration": 6.049}, {"text": "it was just some drunk Greek aristocrat going Hey!", "start": 723.209, "duration": 3.12}, {"text": "Make one of the worst people bites the guy this place is massive all these giant", "start": 726.61, "duration": 5.33}, {"text": "Imperial buildings how huge must my new house be make your way through a bunch of commercials to reach", "start": 732.4, "duration": 6.619}, {"text": "Buckingham Palace. Oh", "start": 739.839, "duration": 2.0}, {"text": "I'm sorry, it's not that impressive when Parliament is done discussing their current problem in", "start": 741.88, "duration": 6.26}, {"text": "2050 they should really consider giving the Queen the gherkin gherkin ham palace", "start": 748.87, "duration": 6.229}, {"text": "All right. I don't want to be king anymore. I'm going home with it being Sunday", "start": 755.11, "duration": 4.25}, {"text": "It was time to return to Sweden where it's 15 degrees colder worst country", "start": 759.36, "duration": 5.729}, {"text": "So that was my weekend in London. God, dammit", "start": 765.16, "duration": 3.38}, {"text": "I forgot to catch Jack the Ripper what I'm saying all attractions have major flaws and Reaper is still on the loose", "start": 768.54, "duration": 6.9}, {"text": "So if you're ever in London just stay in your hotel room and only order room service and that's the kilian experience", "start": 775.6, "duration": 7.76}]