[{"text": "This video is made possible by Skillshare,", "start": 0.0, "duration": 2.116}, {"text": "home to over 17,000 classes that could teach you a new life skill.", "start": 2.116, "duration": 3.504}, {"text": "Get your first 3 months for just 99 cents when you sign up using the link below.", "start": 5.62, "duration": 4.07}, {"text": "If you've ever been to an amusement park before, then you've probably ridden on a roller coaster.", "start": 9.69, "duration": 4.667}, {"text": "Roller coasters are fun and a good way to experience", "start": 14.357, "duration": 2.502}, {"text": "what feels like a near-death experience without actually having to die in the process.", "start": 16.86, "duration": 4.98}, {"text": "But one man named Julijonas Urbonas decided that he wanted to change all of that.", "start": 21.958, "duration": 5.2}, {"text": "Eight years ago in 2010, he designed this monstrosity", "start": 27.378, "duration": 3.3}, {"text": "and affectionately named it the Euthanasia Coaster.", "start": 30.68, "duration": 3.12}, {"text": "If you've ever played a Rollercoaster Tycoon game and designed a ride to fail and blow up on purpose, then this is kind of like the real-life version of that.", "start": 33.86, "duration": 8.68}, {"text": "To start things off the train on the ride is capable of loading 24 passengers on board.", "start": 42.54, "duration": 4.5}, {"text": "Once that's been done the train would ascend a steep lift to a crazy height of 510 meters in the sky.", "start": 47.04, "duration": 6.0}, {"text": "To put that into perspective,", "start": 53.04, "duration": 1.56}, {"text": "the tallest rollercoaster ever built so far is the King Da Ka in Six Flags Great Adventure in New Jersey and, that's only 139 meters tall.", "start": 54.6, "duration": 8.88}, {"text": "The Euthanasia Coaster would be well over", "start": 63.64, "duration": 2.34}, {"text": "three times taller than even that, which is just a little bit shorter than the One World Trade Center in New York City,", "start": 65.98, "duration": 6.6}, {"text": "the tallest building in the United States.", "start": 72.58, "duration": 2.34}, {"text": "It would take the train going up the lift a full two minutes to reach the top, which would give the riders time to contemplate their decision of getting on the thing.", "start": 74.92, "duration": 8.26}, {"text": "Seeing the surface and buildings below get smaller and smaller would undoubtedly be a terrifying experience.", "start": 83.18, "duration": 6.2}, {"text": "And knowing that death would follow upon dropping down the other side would increase the tension felt by many.", "start": 89.46, "duration": 5.82}, {"text": "Once at the top, the train would stop and allow anybody who wanted to get off the option to leave and descend back down to the surface safely.", "start": 95.28, "duration": 7.44}, {"text": "Everybody remaining on the train would have to manually push a button committing to the ride.", "start": 102.72, "duration": 4.92}, {"text": "And then the rest of the experience would begin.", "start": 107.7, "duration": 2.84}, {"text": "The train would plummet over the side of the hill hurtling down at a speed of 360 km/h, close to its terminal velocity.", "start": 110.54, "duration": 7.86}, {"text": "After the 500 meter initial drop, the track flattens out and begins the first of seven inversions in a row,", "start": 118.4, "duration": 5.94}, {"text": "and this is the deadly part.", "start": 124.34, "duration": 1.82}, {"text": "It would take 60 seconds for the train to go through all seven of these inversions and each inversion gradually gets a smaller and smaller", "start": 126.16, "duration": 7.22}, {"text": "diameter in order to maintain 10 Gs of force to all the passengers during the entire 60-second experience.", "start": 133.44, "duration": 6.98}, {"text": "To understand just how much of a force that really is, here's a little bit of further context:", "start": 140.42, "duration": 5.52}, {"text": "If you're standing on the surface at sea level,", "start": 146.0, "duration": 2.06}, {"text": "then you're currently experiencing about 1 G of force.", "start": 148.06, "duration": 3.26}, {"text": "If you accelerate from 0 to 60 miles per hour in 2.4 seconds in a Bugatti Veyron, you'd experience 1.55 Gs.", "start": 151.32, "duration": 7.66}, {"text": "If you were on a space shuttle during launch you'd experience 3Gs.", "start": 158.98, "duration": 4.1}, {"text": "Driving a Formula One car around a sharp lateral turn would give you a taste of 6.5 Gs.", "start": 163.12, "duration": 5.24}, {"text": "And even the astronauts aboard Apollo 11 during reentry with Earth's atmosphere only experienced a force of 7.19 Gs.", "start": 168.36, "duration": 7.36}, {"text": "So here's what would happen to you", "start": 175.72, "duration": 1.4}, {"text": "experiencing 10 Gs for 60 seconds flying through the inversions on this death coaster.", "start": 177.12, "duration": 4.72}, {"text": "You would gradually begin experiencing worsening cases of cerebral hypoxia.", "start": 181.84, "duration": 3.96}, {"text": "Meaning that your blood would rush to the lower parts of your body, and so your brain wouldn't be getting enough oxygen to survive.", "start": 185.9, "duration": 6.46}, {"text": "The first thing that you would notice is your vision graying out, which would then gradually turn into tunnel vision.", "start": 192.44, "duration": 6.32}, {"text": "From there, you would begin experiencing a blackout and,", "start": 198.76, "duration": 2.82}, {"text": "ultimately you would eventually lose consciousness and die.", "start": 201.58, "duration": 3.84}, {"text": "While it sounds extremely morbid, Julijonas Urbonas designed the Euthanasia Coaster for", "start": 205.42, "duration": 5.12}, {"text": "exactly what its name implies.", "start": 210.54, "duration": 2.24}, {"text": "Euthanasia, while undoubtedly a madman, he designed the coaster with the intent to give people with horrifically painful diseases or incurable conditions", "start": 212.84, "duration": 8.96}, {"text": "the ability to end their lives with a painless and euphoric experience.", "start": 221.8, "duration": 4.42}, {"text": "Some exceptionally robust people may even be able to survive the entire experience,", "start": 226.3, "duration": 4.92}, {"text": "which would undoubtedly leave a lasting memory.", "start": 231.22, "duration": 2.562}, {"text": "But either way, this is one ride that you'll probably never be able to experience.", "start": 233.782, "duration": 4.438}, {"text": "The Euthanasia Coaster has always just been an art concept and a testament to the lengths of human imagination,", "start": 238.36, "duration": 6.52}, {"text": "where it should probably remain.", "start": 244.88, "duration": 1.94}, {"text": "If you want to learn how to design your own crazy rollercoaster,", "start": 247.04, "duration": 2.92}, {"text": "you'll need to know how to draw a blueprint, which you can learn in courses like this one on Skillshare.com", "start": 249.96, "duration": 5.22}, {"text": "As you've heard before on this channel, Skillshare is an incredible place to learn what you want to learn because they have over", "start": 255.3, "duration": 6.12}, {"text": "17,000 classes about anything you're curious to learn about.", "start": 261.42, "duration": 3.82}, {"text": "They even have a class taught by friends at Kurzgesagt about how to animate videos on YouTube just like they do.", "start": 265.24, "duration": 5.92}, {"text": "A premium membership to Skillshare gives you unlimited access to all of these classes.", "start": 271.16, "duration": 4.42}, {"text": "Which you can also download for offline viewing on your mobile device when you need to.", "start": 275.58, "duration": 4.22}, {"text": "If you want to start learning how to animate", "start": 279.8, "duration": 1.92}, {"text": "your own videos or start your own business, you can get Skillshare premium for three months for only", "start": 281.72, "duration": 5.16}, {"text": "$0.99 by clicking the link in the description or by going to skl.sh/rll99", "start": 286.92, "duration": 7.2}]