[{"text": "Have you ever seen anything so full of splendor", "start": 1.27, "duration": 2.51}, {"text": "Okay, so let me just say up front that I like Westworld.", "start": 4.509, "duration": 2.78}, {"text": "It's got some of the best acting on television right now, and I'm very interested in the themes it wants to explore.", "start": 7.29, "duration": 7.259}, {"text": "I just want to like it more.", "start": 14.549, "duration": 2.0}, {"text": "Because it can be a frustrating show to watch for a lot of reasons", "start": 17.35, "duration": 4.009}, {"text": "but with this video, I don't want to just snipe at the show's faults,", "start": 21.369, "duration": 3.53}, {"text": "I also want to look at ways the show can improve and I think it's a good time to do", "start": 24.9, "duration": 5.399}, {"text": "so considering the fact that the season 2 finale", "start": 30.3, "duration": 2.099}, {"text": "basically leaves the door open for the show runners to completely reinvent the story they're telling.", "start": 32.95, "duration": 5.209}, {"text": "That's your spoiler warning!", "start": 38.68, "duration": 1.399}, {"text": "But first, here's what this video is not about: it's not about the show's", "start": 40.079, "duration": 4.86}, {"text": "challenging narrative structure or its use of multiple timelines", "start": 45.399, "duration": 3.17}, {"text": "or its love affair with plot twists. Those definitely matter and are a", "start": 48.76, "duration": 5.06}, {"text": "little overdone this season I think, but they're also sort of woven into the basic appeal of the show.", "start": 53.949, "duration": 5.63}, {"text": "They make the story difficult to engage with emotionally", "start": 59.739, "duration": 3.26}, {"text": "but compelling as a puzzle that the viewer has to solve.", "start": 63.0, "duration": 3.269}, {"text": "Basically, that criticism of the show is that it's too complicated.", "start": 66.67, "duration": 3.769}, {"text": "My criticism is that the show is actually too simple because", "start": 70.689, "duration": 4.01}, {"text": "Westworld is, at least in season two, very limited as an ensemble.", "start": 74.86, "duration": 4.189}, {"text": "Ensemble Basics", "start": 79.049, "duration": 4.431}, {"text": "So, an ensemble is any story that has multiple", "start": 85.42, "duration": 2.98}, {"text": "protagonists. I've often cited John Truby's The Anatomy of Story on this channel because it's a book with a ton of great advice for how", "start": 89.17, "duration": 6.349}, {"text": "to put together a screenplay. But it's written primarily as a way to write film screenplays and not all of those lessons are", "start": 95.52, "duration": 6.809}, {"text": "transferable to television or at least they need some refinement", "start": 102.61, "duration": 4.159}, {"text": "He's got a few words to say about ensembles, warning us that introducing more than one protagonist", "start": 106.77, "duration": 5.4}, {"text": "decreases narrative drive, the pace of the story.", "start": 112.57, "duration": 2.389}, {"text": "So, he's got a few suggestions on how to have several protagonists while also writing a story that feels like it's moving quickly", "start": 115.24, "duration": 7.099}, {"text": "including: connecting the characters by making them all examples of a single subject or theme;", "start": 122.77, "duration": 4.639}, {"text": "funneling the characters from many locations into one location; and making the hero of one storyline the opponent in", "start": 128.08, "duration": 7.439}, {"text": "another storyline. And that's the one I want to talk about because Westworld does follow that guideline.", "start": 135.709, "duration": 6.8}, {"text": "Dolores is opposed to the man in black, who is opposed to Maeve, who was opposed to Charlotte, who is opposed to Bernard,", "start": 142.909, "duration": 5.3}, {"text": "who is opposed to Dolores, who is opposed to Akecheta, and both of them are opposed to Charlotte. I'd like to call this the", "start": 148.209, "duration": 6.24}, {"text": "Structure of the Conflict. Each line of conflict here is a place where the show can mine", "start": 154.849, "duration": 5.419}, {"text": "dramatic situations out of. And we've got a lot of conflict here, which is a good thing.", "start": 160.64, "duration": 4.129}, {"text": "But it's the intensity of this conflict, the fact that most of these protagonists want to kill the other", "start": 165.019, "duration": 6.139}, {"text": "protagonists, that causes two problems for the show: backpedaling and wheel spinning.", "start": 171.739, "duration": 4.94}, {"text": "So, Maeve and the man in black are about to face off once and for all. Nearly two seasons of setup has prepared us for this", "start": 179.87, "duration": 6.559}, {"text": "inevitable moment. One of them is going to kill the other. Even when Lawrence intervenes, it's still a question of which one will die.", "start": 186.65, "duration": 7.13}, {"text": "She reminds Lawrence of how the man in black has treated him and suddenly we have three character archs hitting a crescendo at once.", "start": 193.78, "duration": 6.989}, {"text": "This is great stuff! And then...", "start": 200.87, "duration": 2.75}, {"text": "some random guys show up and stop the scene from happening. The same exact thing happens later with Dolores and Charlotte.", "start": 209.58, "duration": 7.61}, {"text": "They are the two generals of their respective sides and everything in the scene points to Dolores killing Charlotte. She's about to act and then...", "start": 217.19, "duration": 7.529}, {"text": "Some random guys show up and stop the scene from happening!", "start": 232.799, "duration": 3.47}, {"text": "She's even about to do it a second time, when there's another interruption from her father,", "start": 236.42, "duration": 4.349}, {"text": "which is at least more character motivated than the first interruption", "start": 240.769, "duration": 3.99}, {"text": "but at that point the constant interruptions have become comical.", "start": 244.76, "duration": 3.809}, {"text": "There's a word for this it's called: plotblocking, coined by Andrew Matthews in his essay on Stranger Things.", "start": 248.569, "duration": 7.229}, {"text": "It's a phenomenon where the writers find an artificial excuse to stop something from happening", "start": 255.799, "duration": 4.619}, {"text": "so that the story can be longer since, you know, TV has a lot of airtime to fill up and you can't play your big", "start": 260.609, "duration": 5.33}, {"text": "cards too quickly. The scene in Stranger Things Matthews points to is this one:", "start": 265.94, "duration": 4.739}, {"text": "when Jonathan finally finds proof that his mother isn't crazy, he rushes home to have that emotional reunion", "start": 270.86, "duration": 6.63}, {"text": "we've been waiting for but his dad stops him. \"Don't bother her right now. She's been through a lot.\"", "start": 277.49, "duration": 4.529}, {"text": "Jonathan doesn't grow or change to overcome this obstacle.", "start": 282.51, "duration": 3.319}, {"text": "He literally tells her later. What purpose can that serve other than to make us wait for what we want to see?", "start": 286.08, "duration": 6.709}, {"text": "Dolores is prevented from killing Charlotte and then just does so later.", "start": 293.16, "duration": 4.189}, {"text": "She actually has undergone a character change by that point", "start": 297.349, "duration": 3.0}, {"text": "but there's nothing in the first scene that implies how she needs to change in order to successfully kill Charlotte,", "start": 300.349, "duration": 6.06}, {"text": "she's just not interrupted this time. Maeve and the man in black are separated", "start": 306.41, "duration": 5.009}, {"text": "but we can presume that there will eventually be a Round 2. This particular scene would have been better had it not followed Truby's", "start": 311.419, "duration": 7.47}, {"text": "suggestion. Had it been some other character that Maeve was traumatized by,", "start": 319.169, "duration": 3.8}, {"text": "someone not so vital to the rest of the plot, we could have had the catharsis of her defeating him here instead of an", "start": 323.07, "duration": 6.559}, {"text": "unsatisfying stalemate. Matthews attributes this to the difference between film", "start": 330.18, "duration": 4.16}, {"text": "storytelling and TV storytelling. Both Westworld and Stranger Things are TV reimagining of stories that began as", "start": 334.59, "duration": 6.769}, {"text": "films, although not directly in the case of Stranger Things. That's a task", "start": 341.62, "duration": 3.54}, {"text": "Matthews calls trying to stretch a twin sheet onto a king mattress. So, how can we avoid this pitfall?", "start": 345.32, "duration": 6.709}, {"text": "Well, since the show was designed to be the next flagship show for HBO after Game of Thrones,", "start": 357.25, "duration": 5.6}, {"text": "let's take a look at how", "start": 363.04, "duration": 1.65}, {"text": "that story structure is it's conflict. And I think it's a fair comparison since Game of Thrones is", "start": 364.69, "duration": 5.69}, {"text": "also about various factions fighting over control of a region. In Game of Thrones,", "start": 370.48, "duration": 4.76}, {"text": "there is a clear divide between what we can call the macro-level", "start": 375.25, "duration": 3.709}, {"text": "conflict of war between the various royal families and the micro-level conflict of the individual plot lines.", "start": 379.39, "duration": 6.619}, {"text": "The Starks want to overthrow the Lannisters is a macro level conflict.", "start": 386.31, "duration": 4.829}, {"text": "The Starks are in conflict with the Karstarks over how to defeat the Lannisters is a micro-level conflict or more broadly", "start": 391.14, "duration": 7.05}, {"text": "macro-level conflicts are usually conflicts between enemies and", "start": 398.65, "duration": 3.859}, {"text": "micro-level stories are between presumed allies with differences of opinion. The", "start": 403.0, "duration": 5.72}, {"text": "macro-level", "start": 409.03, "duration": 0.75}, {"text": "conflict provides the", "start": 409.78, "duration": 1.14}, {"text": "motivation for a lot of the story but the characters that want to kill each other are kept far away from one another.", "start": 410.92, "duration": 6.17}, {"text": "They're practically on different planets.", "start": 417.19, "duration": 2.059}, {"text": "Martin is funneling", "start": 419.59, "duration": 1.34}, {"text": "the characters together like Truby suggests", "start": 420.93, "duration": 2.19}, {"text": "but he's only doing that at the end of the series, not at the end of every", "start": 423.12, "duration": 4.079}, {"text": "installment, which helps him avoid a lot of the problems outlined here. And", "start": 427.54, "duration": 3.739}, {"text": "because he's got so much conflict to work with on both the macro and micro levels,", "start": 431.41, "duration": 3.979}, {"text": "he can drop a whole plotline by killing off a main character and still keep the story going. Westworld, on the other hand, relies almost", "start": 435.39, "duration": 6.54}, {"text": "entirely on these 4 characters. It nearly writes out 3 of them this season", "start": 442.48, "duration": 4.609}, {"text": "but all are revived in some way. The man in black", "start": 447.09, "duration": 2.789}, {"text": "miraculously survives a gajillion", "start": 450.34, "duration": 1.8}, {"text": "bullet wounds, Dolores is brought back in a new body and hints are given that Maeve will come back too. Unlike Game of Thrones,", "start": 452.14, "duration": 6.23}, {"text": "Westworld doesn't know which parts of its story on the macro level it can lop off and still keep going.", "start": 458.8, "duration": 6.11}, {"text": "The other lesson I wish this show would take from Game of Thrones is in how much conflict there is in the micro-level", "start": 465.64, "duration": 6.47}, {"text": "stories.", "start": 472.48, "duration": 0.54}, {"text": "Every protagonist is surrounded by allies, advisers and opponents that provide a deep well of drama to draw from.", "start": 473.02, "duration": 7.52}, {"text": "Westworld usually follows these squabbles of two characters while they are walking somewhere. This is the second and more", "start": 480.85, "duration": 7.459}, {"text": "important problem with how the show has structured its conflict because it leads to...", "start": 488.44, "duration": 4.489}, {"text": "Wheel Spinning", "start": 492.929, "duration": 2.851}, {"text": "A lot of West world scenes feel like scenes", "start": 496.48, "duration": 3.1}, {"text": "we've already seen before on Westworld and while that may be a meta commentary on the robots living life on a loop,", "start": 499.59, "duration": 7.41}, {"text": "repetition gets old quick in a story. Bernard will learn something on a computer,", "start": 507.31, "duration": 3.71}, {"text": "realize he needs to go to a different computer to learn the next part of the story and then he goes to that computer,", "start": 511.39, "duration": 5.149}, {"text": "realizes he needs to go to a different computer to learn the next part of the story and then he goes to that computer...Scenes", "start": 516.789, "duration": 5.18}, {"text": "with the man in black involve him sitting around for a few minutes and then murdering everyone else in the scene.", "start": 521.97, "duration": 4.679}, {"text": "Dolores likes to get real up and close with people while monologuing about free will. And then there's Maeve's storyline which,", "start": 526.93, "duration": 6.169}, {"text": "yikes, she is the show's best character, but she spends half of the season doing nothing but walking as more and more", "start": 533.98, "duration": 7.4}, {"text": "superfluous characters join her group. And then for three episodes, she's lying on an operation table.", "start": 541.99, "duration": 4.94}, {"text": "The only conflict in that plot line is between Maeve and Sizemore.", "start": 546.93, "duration": 4.109}, {"text": "Which is okay? Like it is a conflict with growth and character change", "start": 551.04, "duration": 4.68}, {"text": "but it's also pretty", "start": 555.72, "duration": 0.94}, {"text": "slight. Like the he was a coward and then he did something brave storyline shouldn't take ten episodes to tell. I mean", "start": 556.66, "duration": 6.319}, {"text": "what about all of these other characters?", "start": 562.98, "duration": 1.86}, {"text": "Why not tell a story that involves them as more than just", "start": 564.84, "duration": 2.639}, {"text": "background noise. Or maybe have her find her daughter earlier on and have her deal with the interesting philosophical", "start": 567.58, "duration": 6.14}, {"text": "dilemma of meeting her own replacement. Wheel spinning", "start": 574.21, "duration": 2.899}, {"text": "happens in a story when writers have to find something for a character to do before actually arriving at the main story. And there's a", "start": 577.39, "duration": 6.83}, {"text": "lot of wheel spinning in Westworld because the show doesn't have much interest in developing any of the characters outside of the main four or", "start": 584.22, "duration": 6.809}, {"text": "five, but it also can't put them in a scene together or less they kill each other.", "start": 591.03, "duration": 4.019}, {"text": "So, they all just wander around separately until the finale. Keeping them apart is fine", "start": 595.05, "duration": 5.61}, {"text": "that's what I'm arguing for earlier, but the show needs more character centric drama between the characters who are allies to fill up that time.", "start": 600.66, "duration": 7.739}, {"text": "So, I hope that when Westworld returns that it can keep the macro-level", "start": 608.949, "duration": 3.71}, {"text": "conflict separate from each other in a way where they still influence one another in subtle ways instead of colliding in", "start": 612.999, "duration": 5.84}, {"text": "unsatisfying standoffs and that it can add more gradations of conflict to each of the micro-level plot lines.", "start": 619.359, "duration": 6.26}, {"text": "And I think if it did so it wouldn't have to rely so heavily on", "start": 625.619, "duration": 3.78}, {"text": "obscurantist narrative tricks and could put more focus on telling stories that are compelling in their own right.", "start": 630.16, "duration": 6.079}, {"text": "Westworld isn't yet the best show on television but it absolutely can be. My hope for every episode of the show", "start": 636.609, "duration": 7.25}, {"text": "is that when it ends the only thing I can say is", "start": 643.859, "duration": 3.059}, {"text": "Have you ever seen anything so full of splendor?", "start": 647.559, "duration": 2.51}, {"text": "One of the most fascinating qualities of Westworld is how it manages to make the robot characters more", "start": 653.66, "duration": 6.529}, {"text": "sympathetic than the human characters.", "start": 660.47, "duration": 2.059}, {"text": "But there is one actual human character whose struggles I find pretty relatable, even though she's kind of a monster.", "start": 662.57, "duration": 7.13}, {"text": "I mean Charlotte Hale spends all season trying to secure her company's data and over the last year", "start": 669.7, "duration": 6.779}, {"text": "I've gone pretty serious about protecting my own online accounts.", "start": 676.48, "duration": 3.45}, {"text": "Which meant juggling a bunch of giant passwords, forgetting them constantly and wasting a lot of time signing into different sites.", "start": 679.93, "duration": 7.32}, {"text": "But I recently started using", "start": 687.25, "duration": 2.0}, {"text": "Dashlane, which has made the whole process much simpler and stress-free. Basically Dashlane secures all of your passwords in one", "start": 689.42, "duration": 7.88}, {"text": "safe place and will let you automatically log in to the sites you want to log into without any hassle.", "start": 697.3, "duration": 5.489}, {"text": "That way you don't have to remember a bunch of random passwords and you can sleep easy knowing that your", "start": 702.79, "duration": 4.86}, {"text": "accounts are secure. And the best part? You can actually use Dashlane for free.", "start": 707.84, "duration": 4.82}, {"text": "All you have to do is click on the link in the description of this video: Dashlane.com/justwrite", "start": 712.66, "duration": 5.729}, {"text": "there's also a", "start": 718.4, "duration": 1.05}, {"text": "premium version of the app with some added features like the ability to sync your passwords across all of your devices. If you want to", "start": 719.45, "duration": 6.649}, {"text": "get that, then Dashlane is offering a 10% discount", "start": 726.1, "duration": 2.76}, {"text": "when you go to Dashlane.com/justwrite and sign up for the premium plan with the offer code", "start": 728.86, "duration": 6.0}, {"text": "JustWrite. I want to thank Dashlane for sponsoring this video,", "start": 734.93, "duration": 3.35}, {"text": "I want to thank you for watching it, and for my patrons for supporting this channel! Keep writing everyone!", "start": 738.28, "duration": 5.579}]