[{"text": "When it comes to writing a mopeds or motorcycle in a group there will sometimes be a verbal communication problem", "start": 0.78, "duration": 7.189}, {"text": "but that doesn't have to be this way because most helmets come with indentations on the inside where you can mount speakers and", "start": 8.64, "duration": 7.579}, {"text": "Thus use modern communication systems like this Kardos gala, right  but cost high", "start": 16.5, "duration": 8.0}, {"text": "What is not awesome though is its high price? Which got me thinking?", "start": 25.77, "duration": 3.949}, {"text": "Whether it is possible to use the Arduino development boards to create a walkie talkie", "start": 30.27, "duration": 4.789}, {"text": "duplex mode can receive and transmit audio", "start": 35.819, "duration": 5.93}, {"text": "So in this video, let me show you  how to build DIY method", "start": 43.05, "duration": 6.019}, {"text": "But let me already warned you then. It does not come with decent audio quality", "start": 49.319, "duration": 4.55}, {"text": "Nevertheless though. Let's get started", "start": 55.35, "duration": 2.329}, {"text": "This video is sponsored by jl CPC beer where you can get $2 PCBs super easily", "start": 70.14, "duration": 6.5}, {"text": "also a customer feedback is getting discussed and", "start": 77.189, "duration": 3.38}, {"text": "Evaluated within the company to constantly improve the PCB ordering process", "start": 80.82, "duration": 4.909}, {"text": "Which you can experience yourself by uploading yokubou files today", "start": 86.159, "duration": 4.639}, {"text": "To start off I had to think about how a walkie talkie  buid know basic principle", "start": 92.67, "duration": 7.879}, {"text": "It's most important peripheral features for this job or its 16-bit timer, and it's ten bits ADC", "start": 101.46, "duration": 7.309}, {"text": "But of course we firstly need an audio signal that we want to transmit", "start": 109.71, "duration": 4.219}, {"text": "For that I got myself those flexible microphones, which come over 3.5 millimeter stereo", "start": 114.81, "duration": 6.409}, {"text": "jack and are built around a simple contents a microphone that", "start": 121.219, "duration": 4.05}, {"text": "Means all I had to do was to add a 10 kilo", "start": 126.21, "duration": 3.2}, {"text": "Ohm, resistor 10 mukha farad capacitor and the voltage source to the stereo", "start": 129.41, "duration": 4.949}, {"text": "You check like it is shown here in order to get an AC voltage audio signal right after the capacitor", "start": 134.42, "duration": 6.75}, {"text": "This audio signal needs to get samples by the ADC or analog to digital converter of the microcontroller", "start": 142.08, "duration": 6.979}, {"text": "In order to turn the analog voltages of the signal into digital values that we can let ascend", "start": 149.52, "duration": 6.739}, {"text": "This also requires the 16-bit timer though in order to trigger one a DC conversion", "start": 157.29, "duration": 6.08}, {"text": "For example, every sixty two point five microseconds, which would equal a sampling rate of 16. Kilo Hertz", "start": 163.709, "duration": 7.16}, {"text": "This sampling rage does of course not offer the best audio quality", "start": 171.98, "duration": 3.72}, {"text": "But let's play it safe for this first experiments and let's rather focus on a bigger problem", "start": 176.6, "duration": 5.84}, {"text": "These small peak to peak voltages of only around 100 millivolts of our audio signal", "start": 183.12, "duration": 5.6}, {"text": "Due to them these samples digital values would only differ slightly", "start": 189.569, "duration": 4.1}, {"text": "Which could lead to distortion problems later on?", "start": 194.37, "duration": 2.779}, {"text": "let we use lm358 operational amplifier which works with a minimum voltage of 3 volts", "start": 198.299, "duration": 7.49}, {"text": "which will be important later on and", "start": 206.34, "duration": 2.48}, {"text": "Created a simple inverting amplifier bovitz on a breadboards with a gain of 100", "start": 209.549, "duration": 4.94}, {"text": "connect microphone see the result", "start": 216.12, "duration": 7.55}, {"text": "So now that our microcontroller cut our audio signal digitalized", "start": 224.7, "duration": 4.43}, {"text": "We need a way to wirelessly send it over to another microcontroller", "start": 229.56, "duration": 3.979}, {"text": "For that I wanted to use the NIF 24 l 0 1 + 2.4 gigahertz transceiver", "start": 234.57, "duration": 6.859}, {"text": "Because I not only used them successfully before", "start": 241.98, "duration": 2.599}, {"text": "But also because I had those long-range antenna ones laying around for quite a while", "start": 245.25, "duration": 5.479}, {"text": "so after 1 NIF 24 transmitted the audio data, and another one received at the", "start": 251.609, "duration": 6.71}, {"text": "second receiving microcontroller will once again use its tama one with its output pins 9 and 10 to create a", "start": 258.78, "duration": 7.459}, {"text": "PWM signal", "start": 266.4, "duration": 1.56}, {"text": "changing duty cycle according to the received audio signal", "start": 267.96, "duration": 3.619}, {"text": "This way the quickly changing", "start": 272.52, "duration": 2.0}, {"text": "PWM signal does not only look fascinating", "start": 274.979, "duration": 2.899}, {"text": "lets hear sound by connecting speaker", "start": 278.159, "duration": 6.559}, {"text": "That is how a basic Audrina walkie-talkie could function", "start": 285.509, "duration": 3.38}, {"text": "All that was left to do was to write the fitting code for its", "start": 289.59, "duration": 3.709}, {"text": "Luckily though before I started losing my mind creating such a complicated codes. I found the RF 24 audio library", "start": 294.64, "duration": 7.92}, {"text": "Which apparently offers real-time audio streaming and comes with pretty awesome features?", "start": 303.18, "duration": 5.6}, {"text": "After downloading its and having a look at its codes", "start": 309.98, "duration": 3.02}, {"text": "I realized that it's more or less follows the functional steps of not win a walkie talkie here. I mentioned early on", "start": 313.009, "duration": 7.2}, {"text": "So I opened its minimal sketch in order to determine the most important pins for the components", "start": 321.18, "duration": 6.259}, {"text": "except for the volume control pins, which I pretty much scrapped by simply setting the volume to the maximum and", "start": 327.93, "duration": 6.529}, {"text": "Then created a suitable schematic for my first bread for tests", "start": 334.979, "duration": 4.13}, {"text": "It is important to note though that the NIF 24 requires a powerful 3.3 volt power source", "start": 339.389, "duration": 7.399}, {"text": "Which is why for my later PCB prototype?", "start": 347.49, "duration": 2.69}, {"text": "I made my life easier by simply powering all the components with 3.3 volts", "start": 350.18, "duration": 5.489}, {"text": "But nevertheless after I pulled up one transmitter and one receiver on a breadboard", "start": 356.55, "duration": 5.089}, {"text": "Uploading these slightly modified codes and powering everything", "start": 362.729, "duration": 3.649}, {"text": "It seemed like the transmitted audio data was properly received", "start": 367.02, "duration": 4.19}, {"text": "Indicated by the receive status LED connected to pin 6", "start": 372.06, "duration": 4.039}, {"text": "But on the other hands the audio quality was quite terrible", "start": 377.069, "duration": 3.8}, {"text": "Listen for yourself", "start": 381.719, "duration": 2.0}, {"text": "At this point I thought the breadboard construction was the culprits for this bad quality and", "start": 388.71, "duration": 6.259}, {"text": "Thus decided to move on with a PCB prototype", "start": 395.219, "duration": 3.08}, {"text": "For that a fousey decided on the size of the PCB and where to position the jack plugs for the microphone and the headphones", "start": 399.2, "duration": 7.82}, {"text": "Since the speaker was too quiet for my tastes the locking push button to start the transmission", "start": 407.42, "duration": 5.989}, {"text": "The micro USB inputs for power a power switch and finally a small 100. Kilo. Ohm potentiometer", "start": 413.81, "duration": 7.13}, {"text": "To set the gain of the microphone amplifier. I", "start": 421.61, "duration": 2.929}, {"text": "Did this because at this point I was still convinced that I would mount the system", "start": 425.33, "duration": 4.699}, {"text": "Along with a small power bank to my helmets and actually uses", "start": 430.28, "duration": 3.92}, {"text": "So as soon as the blueprint of my PCB design was completes", "start": 435.17, "duration": 3.859}, {"text": "I created a proper fully fledged schematic for my walkie. Talkie", "start": 439.03, "duration": 4.23}, {"text": "Which through the help of eazy-e da I then converted into a PCB design", "start": 443.81, "duration": 5.24}, {"text": "It took me roughly around four hours to position all the components as close to one another as possible", "start": 449.93, "duration": 6.35}, {"text": "While still being able to do all the routing successfully on the top and bottom sites", "start": 456.56, "duration": 5.33}, {"text": "and as soon as I was happy with my design", "start": 462.8, "duration": 2.629}, {"text": "I ordered five PCBs of its through which il CPC beer for only two dollars after", "start": 465.46, "duration": 6.059}, {"text": "Waiting for week. I received the PCBs which like always made a positive first impression and", "start": 472.61, "duration": 6.739}, {"text": "once I sourced all of the required components", "start": 480.23, "duration": 2.329}, {"text": "I firstly sold out all SMD components to two PCBs and", "start": 482.81, "duration": 4.489}, {"text": "Then moved on by soldering in only tht components which all an old took me around three hours", "start": 487.64, "duration": 6.529}, {"text": "Now to program the microcontrollers, I used an Arduino Uno as a programmer", "start": 495.59, "duration": 4.73}, {"text": "Which I hooked up to the PCBs according to this wiring scheme", "start": 500.42, "duration": 4.1}, {"text": "In the arduino ide I then simply had to choose the correct", "start": 505.04, "duration": 4.25}, {"text": "microcontroller ports and the arduino si SP and click upload using programmer as", "start": 509.69, "duration": 6.35}, {"text": "You can see the uploading worked out smoothly and thus I repeated this process", "start": 516.62, "duration": 5.15}, {"text": "For the other pc beer and then hooked up all the external components and finally power", "start": 522.08, "duration": 5.599}, {"text": "Just like before both PCBs can talk with one another", "start": 528.71, "duration": 3.349}, {"text": "But the audio quality was so bad that it is pretty much unusable", "start": 532.73, "duration": 4.289}, {"text": "Now I tried a couple of things like altering the sampling rate and transfer speeds and", "start": 544.98, "duration": 5.929}, {"text": "Also improving the microphone amplifier circuits, but nothing helped to improve the audio quality", "start": 551.22, "duration": 6.35}, {"text": "So me telling you that the transmitting range of around 50 meters is okay", "start": 559.05, "duration": 4.82}, {"text": "the current consumption of 50 milliamps would guarantee a long run time and", "start": 564.209, "duration": 4.73}, {"text": "That designing a suitable housing for mounting. The PCBs worked out smoothly is not necessary anymore", "start": 569.19, "duration": 6.679}, {"text": "Because for me this Arduino walkie-talkie was a big failure. I", "start": 576.449, "duration": 4.25}, {"text": "Guess sticking to dedicated wireless audio streaming", "start": 581.459, "duration": 3.32}, {"text": "Isis would have been the way to go which I might try out in a future video but", "start": 584.779, "duration": 5.46}, {"text": "nevertheless feel free to pick up my design schematic and PCB of the projects in", "start": 591.149, "duration": 5.45}, {"text": "Order to maybe even fix an obvious and dumb mistake. I made I", "start": 596.819, "duration": 4.22}, {"text": "Hope you enjoyed this video anyway, and learned bits about wireless", "start": 601.86, "duration": 4.13}, {"text": "Audio transmission even though my practical application did not work out as plans", "start": 605.99, "duration": 5.7}]