[{"text": "Hey guys! So... Ah! *camera falls* Oh my god...", "start": 0.0, "duration": 3.28}, {"text": "That was close. Definitely still experiencing my 343 years of bad luck.", "start": 3.44, "duration": 4.38}, {"text": "Anyway, I recently went back up north and my northern friends were like \"Ay Phil, we should have a reunion.\"", "start": 7.86, "duration": 4.46}, {"text": "They don't speak like that. And I was like \"Yeah, catching up! Board games, Guitar Hero,  anti-gravity tennis!\"", "start": 12.36, "duration": 6.02}, {"text": "That doesn't exist yet does it? Come on science, it's 2015. Catch up.", "start": 18.38, "duration": 3.1}, {"text": "But when I arrived it was a different story, as they...", "start": 21.5, "duration": 2.0}, {"text": "Wanted to go to a night club.", "start": 23.5, "duration": 1.76}, {"text": "*sound effect*", "start": 25.26, "duration": 0.74}, {"text": "Phil and night clubs are kind of un-mixey things, like a penguin and a volcano.", "start": 26.08, "duration": 4.2}, {"text": "Or a dog... and an anti-dog machine.", "start": 30.4, "duration": 2.88}, {"text": "They don't gel.", "start": 33.28, "duration": 1.36}, {"text": "I'm not saying I don't like having fun and socialising, I love house parties. I just don't really enjoy clubs that much.", "start": 34.7, "duration": 5.1}, {"text": "Let's have a flash back to university.", "start": 39.8, "duration": 1.62}, {"text": "Hey, sorry about the total lack of communication recently.", "start": 41.48, "duration": 2.82}, {"text": "What was going on with my hair? I don't know why it was bright orange...", "start": 44.36, "duration": 2.78}, {"text": "Or what was happening, but yeah, that was me in my second year university house with five friends who'd want to go out clubbing at least", "start": 47.3, "duration": 5.58}, {"text": "twice a week, sometimes every night of the week. And it could be fun sometimes, but mostly...", "start": 52.88, "duration": 5.74}, {"text": "It wasn't the best.", "start": 58.62, "duration": 1.32}, {"text": "Firstly, me attempting to dance looks like this: *music*", "start": 59.94, "duration": 5.88}, {"text": "Before you even get into the club, the bouncers are usually terrifying.", "start": 65.92, "duration": 3.22}, {"text": "You're not coming in mate, you're not wearing shoes.", "start": 69.18, "duration": 2.0}, {"text": "These are shoes! Did I say you can talk?", "start": 71.24, "duration": 2.34}, {"text": "Once you get past the national guard, it's so loud, if you're trying to catch up with friends, conversations usually go like:", "start": 73.58, "duration": 5.84}, {"text": "*shouting* So what is going on with you?", "start": 79.48, "duration": 2.52}, {"text": "What?", "start": 82.0, "duration": 0.8}, {"text": "What is new with you?", "start": 82.8, "duration": 1.96}, {"text": "You need a poo?", "start": 84.76, "duration": 1.3}, {"text": "I remember one time when I was attempting to dance when I noticed a girl had a really awesome fox tattoo,", "start": 86.08, "duration": 5.0}, {"text": "so I kind of got transfixed by this tattoo, I forgot it wasn't really socially acceptable to just stare at people on the dance floor,", "start": 91.12, "duration": 5.38}, {"text": "till all of a sudden Baldy McGee was up in my face saying, \"Are you making eyes on my girl?\"", "start": 96.5, "duration": 5.76}, {"text": "No, no, no, I was just looking at her fox!", "start": 102.42, "duration": 2.22}, {"text": "You calling my girl an ox?", "start": 104.64, "duration": 1.5}, {"text": "Oh god.", "start": 106.14, "duration": 0.78}, {"text": "Then he got really mad and pushed me into another guy who got really angry cause I had been pushed into him, so he pushed me back,", "start": 106.94, "duration": 4.24}, {"text": "and then a massive push fight just started on the dance floor, so I kind of just...", "start": 111.2, "duration": 3.26}, {"text": "slithered down onto the floor and crawled away as Mr. Brightside was playing. Yeah, I should really stop staring at strangers.", "start": 114.54, "duration": 6.76}, {"text": "Where was I? Oh yeah.", "start": 124.76, "duration": 0.92}, {"text": "Then, if you need to pee, drunk strangers in the toilet are scarily talkative.", "start": 125.74, "duration": 3.68}, {"text": "I'm not gonna be able to pee if some guy is staring directly at me and telling me about Manchester United's new football shoelace colours.", "start": 129.44, "duration": 6.04}, {"text": "I even saw a guy so distracted that he dropped his phone into his own pee flow.", "start": 135.48, "duration": 3.44}, {"text": "Blahh!", "start": 138.92, "duration": 0.7}, {"text": "Kind of surprised I've never done that to be honest, but that is besides the point.", "start": 139.62, "duration": 3.1}, {"text": "Another thing that may surprise you is that the guys that were the rowdiest frm my entire university", "start": 142.72, "duration": 4.18}, {"text": "were the chemistry students and we had a few mutual friends so I'd go out with them sometimes,", "start": 147.0, "duration": 4.22}, {"text": "And they were kind of laddish and I didn't get on with them that well, but I went along anyways, I wanted to be with my friends.", "start": 151.26, "duration": 4.0}, {"text": "But there was this one guy that I'm going to call Schplichael who knew I was uncomfortable and kind of singled me out,", "start": 155.32, "duration": 4.6}, {"text": "So in drinking games he'd always be like \"Pick Phil! Pick Phil!\"", "start": 159.92, "duration": 3.22}, {"text": "Which wasn't that funny, and also he'd make me down drinks while everyone was watching, and I just didn't really like it that much, or", "start": 163.14, "duration": 6.22}, {"text": "Him.", "start": 169.36, "duration": 0.74}, {"text": "Anyway, one night they poured about 12 different drinks into one glass and Schplichael was like \"Huh, let's get Phil to down it!\"", "start": 170.12, "duration": 5.96}, {"text": "And I didn't want to do that at all. So thankfully I thank fast and told them I was allergic to orange juice.", "start": 176.12, "duration": 5.8}, {"text": "So I couldn't...", "start": 181.92, "duration": 1.48}, {"text": "Drink the disgusting drink, when in reality I should have been like \"No thanks, Schplichael.\"", "start": 183.42, "duration": 4.96}, {"text": "If you're that excited about it, why don't you drink it yourself?", "start": 188.42, "duration": 2.54}, {"text": "But I went with the orange excuse.", "start": 190.96, "duration": 1.7}, {"text": "Orange excuse... That sounds like a good band name.", "start": 192.8, "duration": 1.98}, {"text": "But there will be times in life when people do pressure you to do stuff like that, but a proper friend won't really care if you say no.", "start": 194.78, "duration": 5.22}, {"text": "Which is why I've deleted Schplichael off Facebook.", "start": 200.1, "duration": 2.56}, {"text": "Yes! As I didn't really need people like him in my life.", "start": 202.74, "duration": 3.14}, {"text": "And I'm a lot happier that way.", "start": 205.88, "duration": 1.68}, {"text": "Why did you tell this particular story, Phil?", "start": 207.56, "duration": 1.86}, {"text": "It's a new year, so I thought it might inspire you to cut some of those unhealthy \"friends\"", "start": 209.42, "duration": 4.3}, {"text": "out of your life that you don't like that much, or maybe just not feel pressured into doing something that you don't want to do.", "start": 213.78, "duration": 4.68}, {"text": "And you may have heard people on YouTube talking about \"Rise Above\" and I thought it was a great idea so I decided to tell you about it too.", "start": 218.48, "duration": 5.18}, {"text": "If you go to riseabove.org.uk which is also in the description below, there are loads of things that can help you out with these kinds of situations.", "start": 223.66, "duration": 6.22}, {"text": "Including activities and videos, and including some made by my bro slice PJ.", "start": 230.02, "duration": 4.74}, {"text": "So make sure you check it out below!", "start": 234.88, "duration": 2.12}, {"text": "Anyway, flash back to 2014, I actually had a really great time with my northern friends, even if I did still dance like this:", "start": 237.04, "duration": 4.92}, {"text": "It was definitely about the friends I was going with rather than the experience itself.", "start": 242.98, "duration": 3.36}, {"text": "But in all honesty, give me Mario Kart and popcorn any day of the week.", "start": 246.4, "duration": 2.84}, {"text": "Today's draw Phil naked is: *music*", "start": 249.32, "duration": 6.16}, {"text": "Please thumbs up this video if you've enjoyed it and please click the subscribe button to join my team.", "start": 255.52, "duration": 3.86}, {"text": "Join my team? Why'd I just say join my team?", "start": 259.46, "duration": 2.18}, {"text": "And if you haven't yet, make sure to subscribe to my gaming channel, DanAndPhilGAMES, for even more videos.", "start": 261.64, "duration": 4.14}, {"text": "Go do it.", "start": 266.44, "duration": 1.18}, {"text": "Click.", "start": 267.62, "duration": 1.6}, {"text": "Goodbye.", "start": 269.22, "duration": 1.3}]