[{"text": "We all have the ability to start a crowdfunding campaign the ability to make a video and share our", "start": 4.15, "duration": 5.839}, {"text": "Brilliant idea to the world. and although", "start": 10.179, "duration": 2.93}, {"text": "sometimes that works out for a really great other times not so much and", "start": 13.11, "duration": 4.23}, {"text": "Today I plan to do a follow up on a follow up", "start": 17.71, "duration": 4.399}, {"text": "I've done 10 dumb kickstart video and consoles that failed and another 10 dumb kickstarter videogame consoles that failed and now I'm gonna do an", "start": 22.439, "duration": 7.98}, {"text": "Yet another 10 dumb video game consoles that failed. Yes guys", "start": 30.91, "duration": 4.52}, {"text": "I got loads of these to come and even though it is getting harder to name them the scripts just write themselves because these", "start": 35.43, "duration": 7.37}, {"text": "absolutely idiotic consoles are so", "start": 43.46, "duration": 2.68}, {"text": "Mind-bendingly weird and stupid that you will know that be sitting with your mouth open in absolute shock", "start": 46.539, "duration": 5.3}, {"text": "Then anybody was foolish enough to propose the idea", "start": 52.14, "duration": 3.14}, {"text": "You know to score by now consoles such as the ouya and the game stick can move aside", "start": 56.44, "duration": 5.34}, {"text": "For now because in this video we are gonna be chatting about the mostly too dumb to get funded campaigns", "start": 62.14, "duration": 6.44}, {"text": "We have a sprinkling of good old scammy goodness", "start": 68.65, "duration": 2.989}, {"text": "Hi everybody. I'm Daniel  aka DJ slow from slopes game room", "start": 72.28, "duration": 4.97}, {"text": "And this is yet another 10 dumb video game consoles that failed", "start": 77.25, "duration": 5.459}, {"text": "That's really really bad", "start": 86.2, "duration": 2.0}, {"text": "10 dumb Kickstarter game consoles that fail 3. Yeah. That's slightly better I suppose", "start": 89.53, "duration": 7.2}, {"text": "Sponsor time", "start": 99.5, "duration": 2.0}, {"text": "Raid the awesome collection RPG game that is already a mega hit a phenomenon a blockbuster and everything else under the Sun", "start": 101.6, "duration": 6.679}, {"text": "I mean", "start": 108.28, "duration": 0.54}, {"text": "Of course", "start": 108.82, "duration": 0.54}, {"text": "It is get involved and be one of the 10 million players who have already downloaded the game in less than six", "start": 109.36, "duration": 6.389}, {"text": "Months for free might I add you can collect over 400 champions gabber orcs undead Knights elves and more a similar team through 16", "start": 116.03, "duration": 6.65}, {"text": "who roaring actions explore over 1 million champion builds discover 13 spectacular locations", "start": 122.68, "duration": 3.989}, {"text": "Enjoy everybody where story campaign favorite friends or clans vainglory in the PvP arena", "start": 126.67, "duration": 3.3}, {"text": "in other words guys", "start": 131.39, "duration": 1.25}, {"text": "You got a lot to do as seen here", "start": 132.64, "duration": 2.34}, {"text": "The characters designs and assets are pretty damn impressive", "start": 134.98, "duration": 2.309}, {"text": "But the storylines that great the characters are great and the customizations and upgrades of becoming very addictive", "start": 137.29, "duration": 5.549}, {"text": "I must say quick reminder", "start": 142.84, "duration": 2.279}, {"text": "It's a mobile game and it is a mobile game that's growing super fast as seen here in this roadmap video", "start": 145.12, "duration": 6.059}, {"text": "they just", "start": 151.18, "duration": 0.4}, {"text": "Published because you've got new factions attack team arena feature a new clan boss, even the ability fight with your clan mates", "start": 151.58, "duration": 6.83}, {"text": "Download the game using the link below to get yourself 50,000 silver and a free epic champion as part of the new player program", "start": 159.04, "duration": 7.22}, {"text": "isnt it a shame", "start": 169.04, "duration": 2.0}, {"text": "That we live in a world where video games and karaoke are two different things", "start": 171.42, "duration": 4.92}, {"text": "Yep, someone out there hasn't heard a sing star, sing on, karaoke, sing party, everybody sing, karaoke revolution", "start": 177.5, "duration": 7.85}, {"text": "We sing, rap star, lips", "start": 185.35, "duration": 2.13}, {"text": "Disney sing it, rock band, ultra star, boogie and the no doubt crazy", "start": 187.82, "duration": 4.19}, {"text": "amounts of other ones that I couldn't find and if you are one of those people", "start": 192.11, "duration": 3.47}, {"text": "That can't afford a ten pound playstation 2 and quite possibly the cheapest games for that system", "start": 195.86, "duration": 6.229}, {"text": "Well, I'm sure this patent-pending $109 console is probably right up your street", "start": 202.34, "duration": 5.33}, {"text": "Yes, yes. Yes I know what your thinking", "start": 208.85, "duration": 2.059}, {"text": "But Dan", "start": 211.7, "duration": 1.89}, {"text": "PlayStation 2s can't play angry birds???", "start": 213.59, "duration": 2.24}, {"text": "I'm sorry", "start": 216.89, "duration": 2.0}, {"text": "idiot", "start": 219.41, "duration": 2.0}, {"text": "As you can see I have a", "start": 224.36, "duration": 2.0}, {"text": "Xbox one and it is running", "start": 227.78, "duration": 2.569}, {"text": "I've set a simple fan on top. They normally run between a hundred and thirty and a hundred and fifty degrees", "start": 231.64, "duration": 7.29}, {"text": "I've had the fan on there for about 20 minutes", "start": 240.51, "duration": 4.039}, {"text": "And as you can see", "start": 246.48, "duration": 2.0}, {"text": "It's running at a good", "start": 249.4, "duration": 2.0}, {"text": "Forty to fifty degrees or more lower than it normally would", "start": 252.43, "duration": 5.12}, {"text": "We'll sit here and let it see how far it climbs", "start": 258.88, "duration": 2.48}, {"text": "Yet whilst this horrid fan blows in the background let me explain this one sure", "start": 262.92, "duration": 4.94}, {"text": "It's not technically a console but it is for a console and before you take the mickey", "start": 267.86, "duration": 5.36}, {"text": "This isn't the final product funny guy. That's just a prototype", "start": 273.24, "duration": 4.08}, {"text": "Ricky Seaman, the guy behind this idea was only asking for", "start": 277.84, "duration": 3.14}, {"text": "$35,000 to turn his incredibly well designed piece of art into a final product", "start": 281.2, "duration": 5.26}, {"text": "Let me just stop it right there. I cannot do the whole segment like that", "start": 287.26, "duration": 3.949}, {"text": "So yeah as stated all the money is actually going on having someone else come in and design it for him", "start": 292.18, "duration": 5.93}, {"text": "And thankfully he has thought it through", "start": 298.11, "duration": 2.039}, {"text": "I mean you saw the design right and in the risks and challenges", "start": 300.15, "duration": 3.21}, {"text": "He does explain that some of the challenges have to do with design where the disc would go in", "start": 303.36, "duration": 5.189}, {"text": "You see and you thought the whole thing was silly. sadly I didn't get to this one earlier because I would have easily slapped down", "start": 308.92, "duration": 6.979}, {"text": "$1,000 to get something like this. I mean I doubt I could ever get it cheaper than that, right?", "start": 317.8, "duration": 4.7}, {"text": "Hi, my name's Sam and this is Qubi", "start": 333.19, "duration": 2.66}, {"text": "Something we've discovered by working with people around the world. Is that no matter where you live people have televisions", "start": 336.73, "duration": 5.779}, {"text": "The TV started off its life pretty simple", "start": 343.42, "duration": 2.689}, {"text": "Just needing a DVD player a VCR. But nowadays it's getting pretty complicated. You need a unit to watch your local content", "start": 346.21, "duration": 7.039}, {"text": "You need another unit to stream sites like Hulu Netflix", "start": 353.25, "duration": 3.149}, {"text": "YouTube and Pandora and then if you or your kids want to play a game you need another unit for that as well", "start": 356.74, "duration": 7.16}, {"text": "What we wanted to do was find one unit that could consolidate all these different boxes into one", "start": 364.45, "duration": 4.94}, {"text": "What? hang on a minute isn't this pretty much every single console from the last ten years or so", "start": 369.64, "duration": 5.63}, {"text": "Getting the Qube just go and get an Xbox instead. Oh", "start": 376.039, "duration": 3.119}, {"text": "It's running XBMC", "start": 380.219, "duration": 1.92}, {"text": "For those that don't know what that is. It stands for the Xbox Media Player and independently develops homebrew media player application", "start": 382.139, "duration": 8.0}, {"text": "Better know now as Cody. Oh, yes, of course, of course", "start": 390.719, "duration": 4.13}, {"text": "It's also being touted as a games console as well because you know, nobody here has access to games such as Angry Birds", "start": 395.369, "duration": 7.43}, {"text": "Temple Run fruit ninja right", "start": 403.439, "duration": 2.42}, {"text": "Should we move on quickly, please", "start": 407.669, "duration": 2.51}, {"text": "Do you want to know how to make two hundred and seventy four dollars", "start": 413.249, "duration": 3.35}, {"text": "Absolutely, no strings attached go to youtube find some free stock footage create a 3d rendered bit of footage of the most bog-standard", "start": 417.659, "duration": 7.79}, {"text": "Handheld console you could possibly imagine and create an indiegogo account and congratulations. You've now got enough money to go buy a console", "start": 425.999, "duration": 7.7}, {"text": "That's actually decent", "start": 433.699, "duration": 2.0}, {"text": "Yep, that's all we got stock footage that means", "start": 435.749, "duration": 2.69}, {"text": "Absolutely, nothing", "start": 438.99, "duration": 0.75}, {"text": "I mean look at this unlike some other handhelds you should go with was built in the 21st century", "start": 439.74, "duration": 5.029}, {"text": "full gaming experience with you and download the latest and greatest games wherever and whenever as little as free", "start": 445.11, "duration": 6.199}, {"text": "Embark on a new adventure, ride into first place", "start": 451.919, "duration": 2.51}, {"text": "Become a champion", "start": 455.08, "duration": 1.5}, {"text": "Save the day all without tapping clunky touchscreen buttons. What has that got to do with the console at all?", "start": 456.58, "duration": 6.829}, {"text": "Nothing, and of course, yeah, like I say you got a few close-ups of this soon to never be built console", "start": 463.96, "duration": 5.449}, {"text": "But what does this actually mean?", "start": 469.9, "duration": 1.79}, {"text": "And what does it have to do with a handheld game console?", "start": 471.69, "duration": 3.149}, {"text": "Thankfully a quick scroll down shows that this little handheld is actually more powerful than both the Vita and the 3ds", "start": 475.3, "duration": 6.649}, {"text": "Heck whilst me making all of this crap up. Why don't we just say is more powerful than a PlayStation 17. Yeah. Ah", "start": 482.17, "duration": 5.959}, {"text": "Guys, you've forgot about flexible funding now you need to raise wait what $400,000??", "start": 488.86, "duration": 7.13}, {"text": "So close so close", "start": 497.56, "duration": 2.059}, {"text": "You know what hubbiz, hubbits? whatever you want to call it", "start": 504.82, "duration": 3.2}, {"text": "Is it the worst I did problem is it's just been done before", "start": 508.02, "duration": 4.14}, {"text": "So why would you ever buy a console solely dedicated to this feature?", "start": 512.65, "duration": 4.339}, {"text": "No, I'll let the trailer", "start": 517.57, "duration": 2.0}, {"text": "explain", "start": 520.12, "duration": 2.0}, {"text": "( annoying clicky music plays)", "start": 522.88, "duration": 2.0}, {"text": "This is habbiz the first audio based gaming console", "start": 526.7, "duration": 4.26}, {"text": "You can play it alone or with others", "start": 532.339, "duration": 2.54}, {"text": "Havas offers a huge variety of games such as quizzes dice games music guessing and even", "start": 536.06, "duration": 6.95}, {"text": "educational games", "start": 543.35, "duration": 1.65}, {"text": "so essentially what it is is a quiz game just like this and", "start": 545.0, "duration": 3.89}, {"text": "Just like this", "start": 549.709, "duration": 1.56}, {"text": "Sure, it's got the hold dice thing too. But yeah, here you go", "start": 551.269, "duration": 5.0}, {"text": "The system claims to be an upgrade from wargames, but honestly", "start": 556.88, "duration": 3.889}, {"text": "How much are you actually gonna do by just rolling a dice and not physically seeing any real board games?", "start": 560.769, "duration": 6.03}, {"text": "Sounds to me like the first ever smart audio based gaming console. It's a little bit boring", "start": 567.29, "duration": 6.26}, {"text": "You rolled a 5", "start": 574.04, "duration": 1.83}, {"text": "You moved 5 spaces forward you have landed on space number 57", "start": 575.87, "duration": 5.75}, {"text": "You landed on a snake you went down the snake you are now on space number 36", "start": 582.2, "duration": 6.559}, {"text": "Your turn is over", "start": 589.18, "duration": 2.0}, {"text": "(tinkle meme audio clip)", "start": 593.94, "duration": 1.12}, {"text": "(wii channel shop music plays)", "start": 600.24, "duration": 2.0}, {"text": "Creating a game controller that is unique to a", "start": 603.84, "duration": 2.56}, {"text": "Specific games console is a risky one and honestly only the big companies can get away with it", "start": 606.779, "duration": 5.69}, {"text": "Which is why almost every single Kickstarter project that does the same kind of thing will always fail case in point", "start": 612.47, "duration": 7.53}, {"text": "The combiform. It's a controller in one instance. Looks like a crazy uncomfortable version of a standard controller", "start": 620.37, "duration": 6.77}, {"text": "I mean who the hell has got fingers long enough for those buttons and then you got the other way round of playing it", "start": 627.14, "duration": 5.849}, {"text": "Too by turning into a no doubt incredibly top-heavy handlebar if for whatever reason this system looks good to you", "start": 632.99, "duration": 6.33}, {"text": "You will probably want to go with the option to get four controllers for maximum connectivity", "start": 639.32, "duration": 5.159}, {"text": "This is the option that most people banked and even though that ended up costing backers", "start": 644.64, "duration": 4.369}, {"text": "$92 for early birds and $99 after that which honestly isn't too bad a price", "start": 649.65, "duration": 5.149}, {"text": "It would have needed to sell slightly over", "start": 655.08, "duration": 2.059}, {"text": "900 units to be a success almost double that if people were choosing the 2 controller option", "start": 657.54, "duration": 5.179}, {"text": "But obviously it didn't get anywhere near that number", "start": 662.85, "duration": 3.08}, {"text": "Thankfully the website combiformgame.com now directs you to a website that's you know there to help", "start": 666.87, "duration": 6.739}, {"text": "ladies with thinning hair", "start": 673.71, "duration": 2.0}, {"text": "Say no it's not all a loss.", "start": 675.81, "duration": 2.0}, {"text": "Oh My god yet another", "start": 681.63, "duration": 2.0}, {"text": "Android based console there's yet again promising way too much", "start": 684.33, "duration": 4.519}, {"text": "Essentially what it's trying to do is mirror what you've got on your phone and put it onto the big screen", "start": 689.46, "duration": 3.949}, {"text": "But it's asking for $250,000!!!", "start": 693.72, "duration": 3.47}, {"text": "it has a really nice flashy video and for people to really really", "start": 697.86, "duration": 3.83}, {"text": "really want to play android games on a TV they can for only", "start": 702.089, "duration": 3.44}, {"text": "$89 and eventually $99 a piece", "start": 706.35, "duration": 2.39}, {"text": "Thankfully this didn't happen as 125 backers only got it up to $12,564", "start": 709.35, "duration": 6.35}, {"text": "Although during its life. It didn't have a fair bit more from people to eventually cancelled their pledge. Who were these people?", "start": 716.22, "duration": 7.91}, {"text": "Well, those were the guys that pledged towards the equiso", "start": 724.709, "duration": 2.99}, {"text": "Smart TV a typical HDMI dongle thing turns TVs into Smart TVs and that project gained close to", "start": 727.7, "duration": 7.649}, {"text": "$250,000 and it's a pile of crap if the comments section is anything to go by", "start": 736.529, "duration": 4.82}, {"text": "Resulting in the comment section for this the  equiso play", "start": 742.2, "duration": 2.359}, {"text": "to be full of people pledging warning backers to drop their investment and Adam McBride", "start": 744.56, "duration": 6.21}, {"text": "That's the campaign's owner and his family basically just get into a pissing match with everyone", "start": 751.1, "duration": 5.52}, {"text": "Bad-mouthing the project because of this the campaign was canceled without a single update ever given", "start": 757.02, "duration": 7.219}, {"text": "Listener Adam McBride should probably fix what he did in the first place before I bring up another account", "start": 765.06, "duration": 4.88}, {"text": "Hiding as someone else but naming the product the same bloody thing. What a wally", "start": 770.459, "duration": 6.05}, {"text": "(some inaudible words) We're from Columbus, Ohio and we're seeking", "start": 777.06, "duration": 4.52}, {"text": "$150,000 for a 5% equity stake in our business locked out industrial  bank company Oh", "start": 782.55, "duration": 4.789}, {"text": "Would you look at that?", "start": 787.95, "duration": 1.34}, {"text": "He's on shark tank pushing his latest Kickstarter and IndieGoGo projects not consoles this time", "start": 789.29, "duration": 6.419}, {"text": "but theft proof backpacks that did get delivered and according to the comments are sometimes good and sometimes", "start": 795.72, "duration": 6.41}, {"text": "Not so good. Oh", "start": 802.74, "duration": 2.0}, {"text": "Nice little earner though. That's for sure", "start": 805.02, "duration": 2.299}, {"text": "Ok, ok ok", "start": 813.72, "duration": 1.01}, {"text": "This one is a little strange and actually a little bit risky as well because the guy that's behind this campaign", "start": 814.73, "duration": 6.359}, {"text": "Has been known to track down individuals that badmouth him", "start": 821.399, "duration": 4.429}, {"text": "So yeah, I should probably be worried, right?", "start": 826.86, "duration": 2.24}, {"text": "(cracks a laugh)", "start": 830.24, "duration": 0.88}, {"text": "Before going ahead. Be sure to go and support Mads little pixel who unknowingly helped with some of the research for this particular one", "start": 831.42, "duration": 7.02}, {"text": "There'll be a link below as usual", "start": 838.47, "duration": 2.0}, {"text": "This one ladies and gentlemen is called the Indigo a console that has had three campaigns on", "start": 840.6, "duration": 7.01}, {"text": "Kickstarter two of which hit target and one didn't and another free on IndieGoGo where one failed with a fixed goal", "start": 847.95, "duration": 7.159}, {"text": "Another failed with flexible funding and finally one succeeded which totals two if I'm not mistaken", "start": 855.44, "duration": 7.22}, {"text": "153,581 euros by", "start": 864.5, "duration": 2.76}, {"text": "819 backers, but honestly, I'm not a hundred percent sure that's accurate and we'll get to why in a little bit", "start": 868.72, "duration": 7.48}, {"text": "You see the comment section most notably", "start": 876.95, "duration": 3.44}, {"text": "The Kickstarter side of things is full of people asking where their consoles are and a good sprinkling of people to actually have receive them", "start": 880.39, "duration": 7.85}, {"text": "Give Pascal purpura. his due he does seem to be replying to pretty much everybody", "start": 888.56, "duration": 4.88}, {"text": "but guys", "start": 893.56, "duration": 1.3}, {"text": "What I'm struggling with is the fact that even though many of people should have got this system or as nothing exists to prove this", "start": 894.86, "duration": 6.619}, {"text": "Point there's the occasional badly taken image that pops up on his facebook feed from time to time", "start": 901.48, "duration": 5.489}, {"text": "But who knows what that is as these cases are quite easy to get hold of. Yes", "start": 907.34, "duration": 4.909}, {"text": "I know I'm fine accusations around here", "start": 912.25, "duration": 1.89}, {"text": "but surely the way to", "start": 914.14, "duration": 1.21}, {"text": "Answer them is to be open and create a proper detailed video on the system", "start": 915.35, "duration": 4.519}, {"text": "Which is yet again and whilst we pie in the case with a disk drive and for the console itself", "start": 919.87, "duration": 6.06}, {"text": "well", "start": 925.97, "duration": 0.5}, {"text": "I'm not gonna stand here and say why would you pay someone to do this when you could just do it yourself?", "start": 926.47, "duration": 4.71}, {"text": "Cheaper because honestly as a dad with a full time job", "start": 931.28, "duration": 3.26}, {"text": "I do see the temptation to literally get someone else to go and do it for me", "start": 934.55, "duration": 4.25}, {"text": "But with that said when somebody else is doing this kind of thing", "start": 938.8, "duration": 3.959}, {"text": "obviously it is gonna get a hell of a lot of backlash of", "start": 942.95, "duration": 2.869}, {"text": "Plenty of us nerds that are gonna go out there and attack him the only difference with this campaign", "start": 945.88, "duration": 5.0}, {"text": "Is that the guy actually fights back and is willing to sue you", "start": 950.88, "duration": 4.9}, {"text": "LOL The guy who trolled our last campaign sued me LOL", "start": 957.4, "duration": 3.68}, {"text": "The good thing is that I have now your real data and really sue you (not a typo). Thank you for making things easy", "start": 961.16, "duration": 6.349}, {"text": "The whole thing is a huge mess is the company constantly", "start": 967.97, "duration": 3.169}, {"text": "Showcases themselves as being added on the PAT N.E.S Punk video from three years before and in this particular instance", "start": 971.51, "duration": 6.559}, {"text": "I think the best that is to move along and completely forget about the Indigo which has become a complete train wreck", "start": 978.07, "duration": 6.69}, {"text": "Hello, my name is Zack and my company is Zeno corporation", "start": 991.86, "duration": 3.919}, {"text": "We have created a pc gaming console", "start": 996.3, "duration": 3.409}, {"text": "Called the super GFX and we need your help to get it into production. Oh", "start": 1000.14, "duration": 4.759}, {"text": "Yeah, you must feel for the guy a little awkward. Sure", "start": 1005.779, "duration": 3.44}, {"text": "Ok, Zack. Let's see the console", "start": 1010.339, "duration": 2.36}, {"text": "Zack the console, mate", "start": 1013.519, "duration": 2.0}, {"text": "Zack where is it?", "start": 1016.13, "duration": 2.0}, {"text": "Zack", "start": 1018.2, "duration": 1.259}, {"text": "Zack", "start": 1019.46, "duration": 1.999}, {"text": "ZAAAAAAKKKKKK????!!!!!", "start": 1021.78, "duration": 2.0}, {"text": "Yeah, there really isn't anything here what I can tell you is that he wants to make 250 of these things", "start": 1025.18, "duration": 6.18}, {"text": "that will be the same size as an Xbox one and will be", "start": 1031.36, "duration": 3.66}, {"text": "aluminium if you pledge $20 you get a laser engraved dog tag and if you pay", "start": 1035.36, "duration": 4.28}, {"text": "$399 you'll get the lower end PC and $799 will get you the higher end", "start": 1040.459, "duration": 5.089}, {"text": "PC and in the end only two people back to the dog tag options", "start": 1045.679, "duration": 5.51}, {"text": "So here's something that's a little bit different a console that was actually financially successful as well a", "start": 1057.02, "duration": 6.739}, {"text": "video game console is entirely dedicated to your", "start": 1064.309, "duration": 3.619}, {"text": "happiness", "start": 1068.48, "duration": 0.72}, {"text": "(WARNING UPCOMING KEYWORDS FOR SMART DEVICES!! )", "start": 1069.28, "duration": 0.899}, {"text": "The emo spark and as the video shows it may seem just like Siri or Alexa or whatever", "start": 1070.179, "duration": 6.42}, {"text": "But it's actually quite a bit more", "start": 1076.79, "duration": 1.769}, {"text": "You see the big difference is the fact that it actually out of the blue speaks to you and offers you", "start": 1078.559, "duration": 4.76}, {"text": "Music pictures of the family and it's just so much more", "start": 1083.51, "duration": 2.989}, {"text": "For the right sort of person this very unique system is actually quite a good idea", "start": 1086.809, "duration": 4.609}, {"text": "I suppose as the main focus here is to give you little bursts of endorphins right your day to make you feel good", "start": 1091.419, "duration": 7.5}, {"text": "However, there is one other reason why this particular console is a little bit different from others on this list as well", "start": 1099.32, "duration": 5.69}, {"text": "Because it was kind of actually", "start": 1105.65, "duration": 2.359}, {"text": "produced what do I mean by kind of well, if you go to the comments section", "start": 1108.65, "duration": 4.909}, {"text": "You'll see an endless stream of backers that just never got it", "start": 1113.559, "duration": 4.02}, {"text": "However, one did one Brian Ganga did and the reason was big", "start": 1118.13, "duration": 5.599}, {"text": "he was a beta tester a privilege that he only got because he paid", "start": 1123.82, "duration": 4.46}, {"text": "$1400 well", "start": 1128.74, "duration": 2.16}, {"text": "I actually found the guy and I asked him to go into detail about his experience with the emo spark", "start": 1130.9, "duration": 7.32}, {"text": "I think I read you was an early adopter. Do you mind explaining that for me? Did you pay extra? What would you experience?", "start": 1139.95, "duration": 6.299}, {"text": "I was a beta tester and it did cost extra the device barely worked when I reported errors or issues", "start": 1146.25, "duration": 6.239}, {"text": "They would take weeks to get back to me", "start": 1152.5, "duration": 2.09}, {"text": "Once it was 2 months then complete radio silence and I think that's around when they sunk", "start": 1154.59, "duration": 5.789}, {"text": "I still have the beta cube", "start": 1160.38, "duration": 2.16}, {"text": "I also pre-ordered back to regular cubes $1,400 total and never saw a dime", "start": 1162.54, "duration": 7.44}, {"text": "back", "start": 1170.14, "duration": 1.02}, {"text": "So all you have is the beta cube, correct? And it stopped working during beta testing and that's when they went silent", "start": 1171.16, "duration": 7.16}, {"text": "So it doesn't turn on or anything anymore", "start": 1178.48, "duration": 2.06}, {"text": "It would turn on", "start": 1180.55, "duration": 1.26}, {"text": "Freeze then nothing from there or it might just be black screen now having tested this it's the last time way back then", "start": 1181.81, "duration": 6.109}, {"text": "Hahaha, not bad for a hundred and seventy eight", "start": 1188.44, "duration": 2.75}, {"text": "Thousand dollars is it?", "start": 1192.13, "duration": 2.0}, {"text": "And an extra twelve thousand in the second campaign", "start": 1194.23, "duration": 2.69}, {"text": "Hey there guys thanks for checking out the video. I want to give a big special shout out to this video sponsor raid guys", "start": 1204.729, "duration": 7.4}, {"text": "Thank you", "start": 1212.169, "duration": 0.59}, {"text": "Very very very much for supporting the show is a massive massive help and like I said if you want to go and check out", "start": 1212.759, "duration": 5.52}, {"text": "Raid shadow legends yourself. There'll be a link down below", "start": 1218.739, "duration": 2.78}, {"text": "But anyway back to the patrons who support the show every single month", "start": 1221.62, "duration": 4.849}, {"text": "(PATREON CREDIT ROLL + UNSCRIPTED Q&A)", "start": 1226.56, "duration": 151.36}, {"text": "Yes, there you go guys", "start": 1379.68, "duration": 2.08}, {"text": "Anyway, if you want to get your name shout out get your name shown come and ask me questions", "start": 1381.93, "duration": 3.619}, {"text": "Which I'm now answering at the end of my videos and Oh", "start": 1385.68, "duration": 2.719}, {"text": "Anything else or if you want to support me by buying any of the games", "start": 1388.74, "duration": 2.869}, {"text": "You see at the top of the screen right there", "start": 1391.61, "duration": 1.38}, {"text": "There'll be a player Asia down below for you to do so to all of these different things", "start": 1392.99, "duration": 4.109}, {"text": "There's lots of awesome ways to support me and guys. Thank you all so so much for continuing to do so", "start": 1398.25, "duration": 6.53}, {"text": "So yes right now having that's enough", "start": 1405.3, "duration": 3.38}, {"text": "So yeah, this is DJ slope signing out and hopefully I'll see you all next time", "start": 1408.68, "duration": 4.89}]