[{"text": "This video is sponsored by Squarespace.", "start": 0.76, "duration": 2.72}, {"text": "It was a damp and cloudy morning in the Norse outpost somewhere in Western Scotland.", "start": 5.52, "duration": 4.64}, {"text": "Commander Ogmund Crowsdance was already on his feet gutting a recently caught rabbit he planned to cook over his fire.", "start": 10.62, "duration": 6.88}, {"text": "He stood up to relieve his back pain and took a look around over the nearby hilly plains.", "start": 17.5, "duration": 5.24}, {"text": "To his surprise, a couple of kilometres to the south, an armed column emerged from behind the hill,", "start": 22.94, "duration": 5.92}, {"text": "marching towards them.", "start": 28.86, "duration": 1.68}, {"text": "Ogmund instantly dropped his would be meal and alerted his companions.", "start": 30.54, "duration": 4.2}, {"text": "The battle was about to begin.", "start": 34.74, "duration": 2.66}, {"text": "It’s early summer of the year 1249.", "start": 49.96, "duration": 3.16}, {"text": "For the last thirty five years, the medieval Kingdom of Alba has been ruled by Alexander II of the House of Dunkeld,", "start": 53.64, "duration": 8.16}, {"text": "whose main ambition has been to capitalize on the deeds of his forebears and enhance royal control in the region.", "start": 61.8, "duration": 7.64}, {"text": "Throughout his career, Alexander managed to subdue the semi-independent county of Argyll and to quell revolt in Galloway.", "start": 69.68, "duration": 8.24}, {"text": "He even laid a claim to the northern English counties,", "start": 77.92, "duration": 3.14}, {"text": "but eventually reached a compromise with the English king,", "start": 81.06, "duration": 3.0}, {"text": "sealing the course of the border by signing the Treaty of York in 1237.", "start": 84.06, "duration": 5.04}, {"text": "By 1244, when Alexander’s matters with the English were solved for good,", "start": 89.54, "duration": 5.0}, {"text": "the ambitious King of the Scots had already begun to turn his focus to the north-west", "start": 94.66, "duration": 4.7}, {"text": "and he became increasingly interested in the Hebrides, a diverse archipelago off the west coast of the Scottish mainland.", "start": 99.48, "duration": 7.4}, {"text": "At the time, the archipelago formed part of the Norse Kingdom of the Isles,", "start": 106.88, "duration": 4.72}, {"text": "a dominion of Haakon the Old, King of Norway.", "start": 111.6, "duration": 4.04}, {"text": "At first, Alexander pursued a more civilised way to gain control over the Western Isles and made a number of offers to simply buy them.", "start": 116.2, "duration": 8.04}, {"text": "Haakon staunchly rejected these requests,", "start": 124.46, "duration": 2.64}, {"text": "as he considered the Hebrides a Norse territory and he was determined to keep control of the region.", "start": 127.2, "duration": 6.04}, {"text": "Unwilling to give up on his ambition, Alexander eventually resorted to warfare to win the region.", "start": 133.38, "duration": 6.36}, {"text": "He mustered an armed contingent in June of 1249 and prepared to exert his dominance over the Western Isles.", "start": 139.9, "duration": 7.1}, {"text": "But this campaign was never to depart the Scottish mainland.", "start": 147.16, "duration": 3.3}, {"text": "Alexander contracted a fever and his condition rapidly worsened.", "start": 150.6, "duration": 4.22}, {"text": "All too suddenly, on the 6th of July, the King of the Scots died and the Scottish ambitions died with him.", "start": 155.04, "duration": 7.0}, {"text": "This was an unfortunate event for the Kingdom of Alba,", "start": 162.64, "duration": 3.44}, {"text": "as Alexander’s only son, conveniently also named Alexander, was a seven year old boy,", "start": 166.24, "duration": 5.56}, {"text": "who initially was simply an insignificant figure in what was ultimately the power struggle between the Scottish nobility.", "start": 171.8, "duration": 7.34}, {"text": "As time passed by, however, none of the parties vying for power were able to dominate the young king’s entourage", "start": 179.44, "duration": 6.5}, {"text": "and upon reaching majority in 1262 Alexander managed to concentrate enough political power", "start": 185.98, "duration": 6.42}, {"text": "to unite and lead all of the Scottish clansmen.", "start": 192.46, "duration": 3.54}, {"text": "Soon after Alexander came to power", "start": 196.58, "duration": 2.14}, {"text": "it became quite obvious that the reigning monarch was as equally ambitious a man as his late father.", "start": 198.72, "duration": 5.9}, {"text": "His aspiration was to resume his father’s endeavour and finally bring the Western Isles under Scottish control.", "start": 204.68, "duration": 7.54}, {"text": "Yet just as a decade earlier,", "start": 212.36, "duration": 2.0}, {"text": "formal requests to cede the isles in exchange for gold had fallen on the deaf ears of the Norwegian King Haakon,", "start": 214.36, "duration": 6.66}, {"text": "who not only rejected the offer, but even imprisoned the Scottish envoys.", "start": 221.18, "duration": 5.02}, {"text": "This of course enraged Alexander, who saw the conquest of the Hebrides", "start": 226.46, "duration": 4.66}, {"text": "as an excellent chance to gain popularity early in his reign and to cement his position on the Scottish throne.", "start": 231.12, "duration": 6.24}, {"text": "Thus, a number of plundering raids were launched, aiming for the Norse-controlled island of Skye.", "start": 237.58, "duration": 6.02}, {"text": "The Scottish force wreaked havoc among Skye’s population,", "start": 244.08, "duration": 3.28}, {"text": "and soon these atrocities brought the attention of King Haakon.", "start": 247.5, "duration": 3.6}, {"text": "Upon hearing the rumours that the Scottish action was not merely a few raids,", "start": 251.5, "duration": 3.98}, {"text": "but rather the beginning of a bigger operation to conquer the Western Isles,", "start": 255.48, "duration": 4.22}, {"text": "Haakon decided to defend his possessions to the West and gather his troops.", "start": 259.9, "duration": 5.16}, {"text": "It was the beginning of the year 1263.", "start": 265.06, "duration": 3.08}, {"text": "A sizeable fleet of over 120 leidang warships departed Bergen in the beginning of July,", "start": 268.82, "duration": 6.82}, {"text": "setting sail to Scotland to curb the ambitions of the Scottish King.", "start": 275.72, "duration": 3.78}, {"text": "About three weeks later, Haakon’s ships reached Orkney and then sailed through the Outer Hebrides,", "start": 279.74, "duration": 6.22}, {"text": "enlisting some of his liegemen on the go.", "start": 286.14, "duration": 2.78}, {"text": "Eventually, the Norse fleet entered the Firth of Clyde and landed on the Isle of Arran,", "start": 289.18, "duration": 5.88}, {"text": "where they set a camp.", "start": 295.06, "duration": 1.38}, {"text": "From there, Haakon sent raiding parties to ravage nearby settlements and awaited a response from the King of the Scots.", "start": 296.76, "duration": 7.48}, {"text": "But Alexander seemed to be unprepared for the upcoming encounter.", "start": 304.72, "duration": 3.74}, {"text": "His army was still being assembled,", "start": 308.56, "duration": 2.22}, {"text": "and even with full numbers he could not hope to gain the upper hand against the  superior numbers", "start": 310.78, "duration": 5.24}, {"text": "that the Norwegian King had brought to Scotland.", "start": 316.02, "duration": 2.5}, {"text": "Thus, Alexander’s envoys were tasked with a mission to possibly delay the Norwegian host, at least until autumn.", "start": 319.02, "duration": 8.02}, {"text": "Luckily for the Scots, the talks lasted until late September,", "start": 327.42, "duration": 3.84}, {"text": "when Haakon relocated his main camp to another island some distance to the north, closer to the mainland.", "start": 331.26, "duration": 6.66}, {"text": "A mere two days later, on the night of the 30th of September,", "start": 338.48, "duration": 3.96}, {"text": "a violent storm occurred that battered the Norwegian ships berthed on the shore.", "start": 342.6, "duration": 5.18}, {"text": "A number of Haakon’s men drowned, but what was worse,", "start": 347.96, "duration": 3.34}, {"text": "many of his boats were blown away onto the hostile Scottish mainland, just south of the town of Largs.", "start": 351.3, "duration": 5.98}, {"text": "The Norse couldn’t afford abandoning these vessels, as they were essential for the mobility of the army.", "start": 357.56, "duration": 5.92}, {"text": "So a small force sailed to the Scottish shore to salvage the ships and the cargo.", "start": 363.76, "duration": 4.66}, {"text": "Unsurprisingly, Scottish scouts were well aware of these events and as soon as the Norse landed,", "start": 368.72, "duration": 5.88}, {"text": "they came under the attack of archers and slingers raining projectiles down upon them.", "start": 374.82, "duration": 5.08}, {"text": "The Norse, upon conceding some losses, managed to hide behind the boats until King Haakon, seeing the disturbance on the other side,", "start": 380.14, "duration": 8.38}, {"text": "rushed his men and landed a significant force to relieve and protect the repair crews, compelling the harassing Scots to flee.", "start": 388.58, "duration": 8.4}, {"text": "A unit of two hundred men under Ogmund Crowsdance was positioned on a nearby hillock", "start": 397.8, "duration": 5.52}, {"text": "overlooking the southerly approach when the rest of Haakon’s men set a camp for the night", "start": 403.32, "duration": 5.36}, {"text": "and focused on protecting the boats at the beach.", "start": 408.68, "duration": 2.78}, {"text": "Although the night was calm and uneventful, the very next day the Norwegian force was met with an even greater challenge.", "start": 411.46, "duration": 8.1}, {"text": "Early in the morning of the 2nd of October a several thousand strong Scottish contingent sent by King Alexander", "start": 420.04, "duration": 7.58}, {"text": "was spotted by Ogmund’s men approaching from the south.", "start": 427.62, "duration": 3.48}, {"text": "The Norsemen rushed to their position, preparing to defend the hillock.", "start": 431.1, "duration": 4.34}, {"text": "Soon the fighting ensued between the vanguards, but Ogmund quickly realised that the rest of Scottish troops were marching straight to the beach.", "start": 435.44, "duration": 9.06}, {"text": "To avoid possible encirclement he commanded a withdrawal,", "start": 444.84, "duration": 3.8}, {"text": "even though his troops were probably standing firmly up to this moment.", "start": 448.64, "duration": 4.68}, {"text": "The retreat, albeit orderly at first, gradually plunged into disarray, which soon caused some panic among Haakon’s ranks at the beach,", "start": 453.72, "duration": 8.92}, {"text": "seeing their kin running. Just behind Ogmund’s men, several thousand Scots were marching to meet the enemy.", "start": 462.64, "duration": 6.98}, {"text": "Haakon already knew that he would not stand a chance to stop the Scottish with just a fraction of his own army present,", "start": 470.0, "duration": 6.68}, {"text": "and so he sent some of his men forward to delay the opponent, while the rest hastily prepared all seaworthy boats for their departure.", "start": 476.88, "duration": 8.1}, {"text": "Subsequently, the two sides clashed in an uneven battle.", "start": 484.98, "duration": 4.36}, {"text": "The Norsemen did their best to stop the enemy from reaching the ships,", "start": 489.48, "duration": 3.82}, {"text": "but the Scots, apart from their superior numbers, also had a hundred or more heavy cavalrymen at their disposal,", "start": 493.4, "duration": 6.62}, {"text": "which played a decisive role in quickly pushing back the Norwegian footmen.", "start": 500.02, "duration": 4.86}, {"text": "Soon, as their line grew weaker, losses on the Scandinavian side mounted.", "start": 504.88, "duration": 5.56}, {"text": "A general retreat to the remaining boats followed, while the Scottish troops rushed to inflict as much damage as possible.", "start": 510.58, "duration": 7.44}, {"text": "Although the good part of his crew managed to escape, it was a significant defeat for Haakon,", "start": 518.64, "duration": 5.5}, {"text": "who was forced to leave behind boats, men and supplies in the wake of this surprise attack launched by the King of the Scots.", "start": 524.24, "duration": 7.4}, {"text": "He still had a considerable number of troops under his command, scattered in the area,", "start": 531.74, "duration": 4.82}, {"text": "but it was eventually decided to not tempt their fate,", "start": 536.7, "duration": 3.08}, {"text": "and the Norse fleet retreated back to Orkney to resupply, over-winter and plan the campaign for the next year.", "start": 539.78, "duration": 6.88}, {"text": "Unfortunately for Haakon, during his stay on the windy archipelago,", "start": 547.22, "duration": 3.96}, {"text": "he caught cold and in the middle of December died, prompting his liegemen to disband the army and return back home to Norway.", "start": 551.28, "duration": 8.24}, {"text": "The death of the Norwegian King was an opportune event for Alexander.", "start": 559.8, "duration": 4.02}, {"text": "While we could call Alexander lucky, we ought to admit that he wisely chose the right moment to leverage his luck", "start": 563.98, "duration": 7.34}, {"text": "and to strike the Norwegian invading army in order to yield the maximum possible results.", "start": 571.32, "duration": 5.84}, {"text": "In the end, Alexander’s strategy proved to be effective as four years later", "start": 577.38, "duration": 4.38}, {"text": "Haakon’s son and the next King of Norway – Magnus the Law-mender agreed to trade the Hebrides and the Isle of Man to Alexander", "start": 581.88, "duration": 9.18}, {"text": "in exchange for a yearly payment and a considerable sum of silver.", "start": 591.06, "duration": 4.38}, {"text": "This deed helped Alexander to achieve a strong position on the throne,", "start": 595.5, "duration": 4.98}, {"text": "from where he firmly ruled the kingdom for the next twenty years as the last ruler of House of Dunkeld before the turbulent times of the early 14th century.", "start": 600.52, "duration": 11.88}, {"text": "This video is sponsored by SquareSpace.", "start": 614.44, "duration": 2.28}, {"text": "If you’re looking for an all-in-one platform to build awesome websites with tons functionality, then SquareSpace is what you’re after.", "start": 617.12, "duration": 7.3}, {"text": "With great features such as:", "start": 624.7, "duration": 1.4}, {"text": "Vibrant and versatile design via Modern Templates, meaning that your sites will look amazing on any browser or device.", "start": 626.1, "duration": 7.02}, {"text": "Video Backgrounds so that like you, your site is always on the move!", "start": 633.26, "duration": 4.14}, {"text": "But without a doubt the most powerful weapon in your SquareSpace arsenal is the Integrated Analytics providing detailed reports on your sites activities.", "start": 637.6, "duration": 8.52}, {"text": "Click the link in the discretion below, visit squarespace.com/bazbattles and not only will you be supporting our channel but you will save 10% on your first site-content purchase.", "start": 646.38, "duration": 11.02}, {"text": "Building a web presence has never been easier thanks to SquareSpace!", "start": 657.4, "duration": 5.06}]