[{"text": "This part of the video was sponsored by LastPass!", "start": 0.58, "duration": 2.98}, {"text": "When we started Stop Skeletons From Fighting,", "start": 3.56, "duration": 2.0}, {"text": "we had to keep our passwords easy for everyone to remember, and that's not great for security.", "start": 5.56, "duration": 4.76}, {"text": "And if you're anything like the Hot Dog Gamer,", "start": 10.32, "duration": 1.84}, {"text": "you struggle with object permanence and remembering long passwords.", "start": 12.16, "duration": 3.7}, {"text": "LastPass not only makes it easy so you don't have to remember passwords or usernames,", "start": 15.86, "duration": 3.96}, {"text": "they make your passwords safe!", "start": 19.82, "duration": 1.64}, {"text": "No more writing passwords down, no more remembering, no more resetting,", "start": 21.46, "duration": 3.52}, {"text": "no more Hot Dog Getting Locked Out Of Your Account!", "start": 24.98, "duration": 2.78}, {"text": "It even works on mobile, and on apps and on websites,", "start": 27.76, "duration": 3.04}, {"text": "and it even lets you write secure messages with top-secret info!", "start": 30.8, "duration": 3.56}, {"text": "With unlimited password storage and free cross-device sync,", "start": 34.42, "duration": 3.98}, {"text": "you can put your passwords on autopilot with LastPass!", "start": 38.46, "duration": 3.1}, {"text": "Click the link below to find out more!", "start": 41.58, "duration": 2.14}, {"text": "Thanks again, LastPass, for sponsoring this part of the video.", "start": 43.82, "duration": 2.82}, {"text": "A winner is you!", "start": 46.7, "duration": 1.38}, {"text": "Conglaturation.", "start": 48.08, "duration": 1.26}, {"text": "I am Error.", "start": 49.36, "duration": 0.88}, {"text": "English localization was a delicious mess in the early days of console gaming.", "start": 50.24, "duration": 4.0}, {"text": "It's How the West was Worse.", "start": 54.28, "duration": 1.92}, {"text": "But one company in particular stands out: Capcom.", "start": 56.24, "duration": 3.12}, {"text": "Their games and their localization errors are prolific, spanning decades.", "start": 59.5, "duration": 4.78}, {"text": "For our last video on our How the West was Worse series,", "start": 64.3, "duration": 3.16}, {"text": "we focused on the ways Konami changed games when bringing them into western markets,", "start": 67.46, "duration": 4.74}, {"text": "but for this episode, we're mostly going to leave gameplay behind", "start": 72.22, "duration": 3.0}, {"text": "and focus on the changes Capcom made to the meaning of their games.", "start": 75.22, "duration": 4.0}, {"text": "I'm Derek, this is Stop Skeletons from Fighting,", "start": 79.34, "duration": 2.18}, {"text": "and welcome to How the West was Worse: Capcom Edition.", "start": 81.54, "duration": 3.22}, {"text": "This episode is gonna focus on localization, which is different from just translation.", "start": 93.1, "duration": 4.96}, {"text": "Localization is the process of making a game make sense on a cultural level for wherever you wanna sell it.", "start": 98.1, "duration": 5.76}, {"text": "Translation is a part of that process:", "start": 103.86, "duration": 2.62}, {"text": "All localizations have been translated, though not all translations have been localized.", "start": 106.48, "duration": 4.44}, {"text": "Localization also sometimes gets misconstrued as censorship, which... is a whole can of worms.", "start": 110.92, "duration": 5.08}, {"text": "We think the censorship debate can get overblown, or isn't discussed in a nuanced enough way,", "start": 116.14, "duration": 4.84}, {"text": "we even think \"censorship\" is too strong of a word for it, but we'll address these on a case-by-case basis.", "start": 120.98, "duration": 5.2}, {"text": "Localization was WILD in the 80's and 90's,", "start": 126.3, "duration": 3.08}, {"text": "mostly due to a lack of time, money, communication and manpower given to localizers,", "start": 129.44, "duration": 5.28}, {"text": "and almost no-one was worse at communicating with each other than Capcom Japan and Capcom USA.", "start": 134.72, "duration": 5.86}, {"text": "We mostly stopped seeing screw-ups on the level of \"This story is happy end\" after the 2000's.", "start": 140.58, "duration": 5.38}, {"text": "Global markets have become bigger money makers than Capcom's home market of Japan.", "start": 145.96, "duration": 4.2}, {"text": "It's more important than ever to get it right.", "start": 150.16, "duration": 2.48}, {"text": "Before we dive in, a disclaimer: We are not experts.", "start": 152.64, "duration": 3.22}, {"text": "I actually have a bachelor's degree in Japanese that I have literally never used.", "start": 155.86, "duration": 4.48}, {"text": "Haruda-sensei, if you're watching... sorry.", "start": 160.48, "duration": 2.48}, {"text": "We got a lot of the information in this video from the heroes at The Cutting Room Floor,", "start": 163.0, "duration": 4.26}, {"text": "and Clyde Mandelin's fantastic Legends of Localization series.", "start": 167.26, "duration": 3.42}, {"text": "We have two of his books, and links to all this stuff is in the description below.", "start": 170.72, "duration": 3.88}, {"text": "And now, let's get to it!", "start": 174.8, "duration": 1.36}, {"text": "We have to start with one of my favorite video game series of all time, Mega Man!", "start": 176.16, "duration": 4.04}, {"text": "He's also a good one to start with, because of course, Mega Man is Rockman in Japan.", "start": 180.22, "duration": 4.72}, {"text": "Mega Man's western localization in the early days was kind of a mess,", "start": 184.98, "duration": 3.54}, {"text": "and we've got these terrible boxes to prove it.", "start": 188.52, "duration": 2.68}, {"text": "Side note: We all laugh at North America's hilarious box art,", "start": 191.2, "duration": 3.4}, {"text": "but forget that Mega Man 1's PAL box art was shockingly good!", "start": 194.6, "duration": 4.08}, {"text": "That second one though, yeesh, what happened?", "start": 198.96, "duration": 2.3}, {"text": "But the boxes aside, was the name \"Mega Man\" a bad choice for Capcom", "start": 201.32, "duration": 4.1}, {"text": "that made the series worse for the West?", "start": 205.42, "duration": 2.36}, {"text": "Famously, Mega Man's original Japanese name is Rockman", "start": 207.78, "duration": 2.76}, {"text": "because the game is supposed to be rock 'n' roll.", "start": 210.54, "duration": 2.1}, {"text": "But I've always though that that was kinda weird.", "start": 212.64, "duration": 2.08}, {"text": "Yes, he has a sister named Roll,", "start": 214.72, "duration": 1.8}, {"text": "but the games' aesthetic and gameplay has literally nothing to do with rock 'n' roll, or music at all,", "start": 216.52, "duration": 5.64}, {"text": "even if the series does have some of the greatest video game music of all time.", "start": 222.2, "duration": 3.42}, {"text": "Also, he doesn't pick up boulders!", "start": 225.64, "duration": 2.0}, {"text": "Can he jam out on the guitar?", "start": 227.68, "duration": 1.7}, {"text": "\"Rock\" says nothing of his function as a robot for an English-speaker.", "start": 229.5, "duration": 3.96}, {"text": "Mega Man is honestly a pretty decent name,", "start": 233.46, "duration": 2.34}, {"text": "because it captures the idea that Mega Man is the ultimate robot who can have all the powers,", "start": 235.8, "duration": 4.38}, {"text": "which was an idea that made perfect sense to me as a kid!", "start": 240.18, "duration": 2.86}, {"text": "It's worth noting that Capcom didn't change almost any other major name on a level like this.", "start": 243.16, "duration": 5.08}, {"text": "Mega Man's is the most major, though there are others, like the mystifying change of Forte to Bass.", "start": 248.24, "duration": 5.32}, {"text": "And it's \"Bays\", not \"Baas\", Mega Man 8!", "start": 253.62, "duration": 2.38}, {"text": "MEGA MAN: \"Hey Baas!\"\nBASS: \"Shut up!\"", "start": 256.0, "duration": 1.52}, {"text": "We're gonna focus on two major characters that highlight a classic Japanese translation problem:", "start": 259.02, "duration": 5.34}, {"text": "[alarm sirens]\nThe L/R Catastrophe!", "start": 264.66, "duration": 2.32}, {"text": "Okay, I'm being a little dramatic, but switched up L's and R's are some of the most common mistakes", "start": 267.06, "duration": 4.88}, {"text": "when bringing a Japanese game to the West.", "start": 271.94, "duration": 1.96}, {"text": "And hopefully I don't embarrass Haruda-sensei too much by trying to explain it, but here we go.", "start": 274.04, "duration": 4.34}, {"text": "So the Japanese language doesn't really have a soft R sound, it's hard like an L.", "start": 278.5, "duration": 4.88}, {"text": "I've always thought of it as the Japanese language doesn't have an R or an L sound,", "start": 283.38, "duration": 4.34}, {"text": "but really an R AND an L sound smashed together.", "start": 287.72, "duration": 2.72}, {"text": "But ra-re-ri-ro-ru is translated into English writing, or Romaji, as an R,", "start": 290.6, "duration": 5.56}, {"text": "which is why a lot of people say there isn't an L in the Japanese language,", "start": 296.16, "duration": 3.58}, {"text": "even though that's not necessarily true when you're listening to the language.", "start": 299.74, "duration": 3.28}, {"text": "Which is why Mega Man's creator Dr. Light is... well, Dr. Light over here, versus Dr. Right, or Raito, in Japan.", "start": 303.02, "duration": 6.96}, {"text": "It honestly went back-and-forth for the first few games:", "start": 310.02, "duration": 2.62}, {"text": "At the end of Mega Man 3, he's Dr. Right, but in the Mega Man 1 instruction book, he's also Dr. \"W\" Wright,", "start": 312.64, "duration": 6.36}, {"text": "and consequently, he's also Dr. Wright in Captain N.", "start": 319.0, "duration": 3.06}, {"text": "♫ \"One of these things is not like the others\" ♫", "start": 322.06, "duration": 3.96}, {"text": "Eventually though, he would settle into Dr. Light,", "start": 326.02, "duration": 2.58}, {"text": "which is more than we can say about our other favorite L/R mix-up:", "start": 328.6, "duration": 3.32}, {"text": "Clash Man, or Crash Man, from Mega Man 2.", "start": 332.0, "duration": 2.92}, {"text": "We went crazy trying to figure out his official name!", "start": 335.04, "duration": 3.6}, {"text": "In Rockman 2 for the Famicom, he is Clash Man,", "start": 338.7, "duration": 2.84}, {"text": "but in the NES Mega Man 2, he is Crash Man.", "start": 341.54, "duration": 2.8}, {"text": "But in the Mega Man 2 instruction book, he is both Crash Man AND Clash Man!", "start": 344.4, "duration": 4.58}, {"text": "Also, shout-out to Fish Man.", "start": 349.08, "duration": 1.28}, {"text": "When Mega Man 2 came to the Game Boy, he was Clash Man again,", "start": 350.56, "duration": 2.98}, {"text": "but in the Mega Man Anniversary Collection, he is Crash Man.", "start": 353.54, "duration": 3.18}, {"text": "He's also Crash Man in the Power Battles arcade game,", "start": 356.72, "duration": 2.98}, {"text": "and his power is Crash Bomb, even in the Japanese port for the Neo Geo Pocket Color.", "start": 359.7, "duration": 4.72}, {"text": "Personally, I like Crash Man better, because the idea of clashing is more of an abstract concept,", "start": 364.42, "duration": 5.08}, {"text": "and he's a robot that throws bombs, not contrarian opinions!", "start": 369.5, "duration": 3.22}, {"text": "But on Spotify, he's Clash Man again, so honestly, who knows.", "start": 372.84, "duration": 3.94}, {"text": "On the topic of naming problems, we gotta talk about Mega Man X5.", "start": 376.88, "duration": 4.06}, {"text": "In the Mega Man X series, the robot Mavericks are all named after animals... kinda.", "start": 380.96, "duration": 4.62}, {"text": "Boomer Kuwanger always threw me for a loop,", "start": 385.58, "duration": 2.04}, {"text": "but it's wordplay on the Japanese word for \"stag beetle\" that never got properly localized.", "start": 387.62, "duration": 4.8}, {"text": "Anyway, the localization company that worked on Mega Man X5", "start": 392.42, "duration": 3.18}, {"text": "decided to completely throw tradition out the window, and name the Mavericks after Guns N' Roses references.", "start": 395.6, "duration": 5.5}, {"text": "So like, Volt Kraken is named Squid Adler, because it's kinda like Steven Adler, get it?", "start": 401.24, "duration": 5.04}, {"text": "There's also a hilarious translation error involving Squid Adler:", "start": 406.34, "duration": 3.3}, {"text": "There's a part where X apologizes for Octopardo, which makes no sense until you realize", "start": 409.64, "duration": 4.62}, {"text": "the localizers didn't realize that X was talking about Launch Octopus from Mega Man X1.", "start": 414.26, "duration": 5.08}, {"text": "Whoops!", "start": 419.56, "duration": 0.66}, {"text": "This decision was actually made by Alyson Court,", "start": 420.22, "duration": 2.6}, {"text": "who did the voice for Claire in Resident Evil, as well as a bunch of other stuff for Capcom!", "start": 422.82, "duration": 4.04}, {"text": "It was done as a tribute to her then-husband,", "start": 426.86, "duration": 2.26}, {"text": "and hilariously, someone at Capcom must have realized it too late,", "start": 429.12, "duration": 3.68}, {"text": "because these Guns N' Roses names didn't make it into the manual.", "start": 432.8, "duration": 3.36}, {"text": "These references would also appear in the X Collection for the PS2 and Gamecube,", "start": 436.16, "duration": 3.78}, {"text": "but were finally released in the Legacy Collection, released in 2018.", "start": 439.94, "duration": 3.58}, {"text": "There are other problems that I'm tempted to file under the West being better:", "start": 443.62, "duration": 3.94}, {"text": "There's probably tons of issues in the various Mega Man spinoff series,", "start": 447.56, "duration": 3.0}, {"text": "but I wanna highlight Mega Man Battle Network 4, for giving us classics like:", "start": 450.56, "duration": 4.1}, {"text": "\"What a polite young man she was!\"", "start": 454.72, "duration": 1.76}, {"text": "and the admirably inappropriate \"I'll jack into your squirrel if that's what it takes!\"", "start": 456.58, "duration": 4.04}, {"text": "These are bad, but also amazing.", "start": 460.66, "duration": 2.68}, {"text": "Mega Man 7's ending makes our hero WAY more bloodthirsty than in Rockman 7,", "start": 463.44, "duration": 4.94}, {"text": "and then there's one that's quite personal for me: Mega Man 8.", "start": 468.38, "duration": 3.74}, {"text": "Mega Man 8 was the first time I heard Mega Man talk, outside of the Captain N cartoons,", "start": 472.12, "duration": 4.98}, {"text": "and I absolutely hated it!", "start": 477.1, "duration": 2.1}, {"text": "MEGA MAN: \"I understand, Dr. Light. I'm on it!\"", "start": 479.2, "duration": 2.48}, {"text": "DEREK: Augh, why does he sound like a little boy?!", "start": 481.68, "duration": 1.82}, {"text": "I hated Mega Man's voice so much that I wasn't able to appreciate the real stunner here:", "start": 483.5, "duration": 4.88}, {"text": "Dr. Light's voicework.", "start": 488.4, "duration": 1.56}, {"text": "DR. LIGHT: \"You must recova all de enegy imedely, W- Mega Man!\"", "start": 490.22, "duration": 2.96}, {"text": "\"We may a- be able to locade an other energy emishun from de wadar room.\"", "start": 493.32, "duration": 3.98}, {"text": "\"When we find dat medeoh, we'll find Doctoh Waawee.\"", "start": 497.66, "duration": 3.1}, {"text": "DEREK: How did this make it into the final game?!", "start": 500.84, "duration": 2.08}, {"text": "Did they not have time for a second take, was- or was this the best take they had?!", "start": 503.06, "duration": 3.82}, {"text": "Also, being a light RPG with lots of dialogue,", "start": 507.1, "duration": 2.6}, {"text": "Mega Man Legends had some significant localization done to it,", "start": 509.7, "duration": 2.96}, {"text": "but I wanna shout out the decision to take out the animal abuse:", "start": 512.66, "duration": 3.1}, {"text": "In Rockman Dash, you could hurt all animals instead of just the jerk dogs.", "start": 515.76, "duration": 4.72}, {"text": "The Hot Dog Gamer thanks you for it.", "start": 520.54, "duration": 1.64}, {"text": "And then there's Grace's and mine's personal favorite line from any Mega Man game ever,", "start": 522.34, "duration": 4.82}, {"text": "the ultimate culmination of localization decisions made years earlier:", "start": 527.22, "duration": 4.18}, {"text": "\"And we named this baby Mega Man.\"", "start": 531.78, "duration": 2.14}, {"text": "It's brilliant. It's brilliant!", "start": 534.6, "duration": 1.4}, {"text": "Our next series for How the West was Worse is another favorite: Resident Evil.", "start": 536.06, "duration": 4.34}, {"text": "We talked about some of this in our Re:Certified Classic video on Resident Evil 1,", "start": 540.54, "duration": 3.56}, {"text": "but this series has plenty of localization... let's just call them \"quirks\".", "start": 544.1, "duration": 5.18}, {"text": "\"JILL-JILL-JILL JILL SANDWICH\"", "start": 549.28, "duration": 1.88}, {"text": "First off, the name.", "start": 551.16, "duration": 1.26}, {"text": "\"Resident Evil\" is the result of a naming contest held within Capcom USA,", "start": 552.52, "duration": 4.2}, {"text": "because the Japanese name, \"Biohazard\", would be too difficult to trademark in the US.", "start": 556.72, "duration": 4.8}, {"text": "This was a great name for the first game, which took place in a house,", "start": 561.52, "duration": 3.68}, {"text": "but it lost most meaning when the series became a monstrously successful, globetrotting hit.", "start": 565.24, "duration": 5.08}, {"text": "While all localization decisions come down to how much money you think you can make in a certain market,", "start": 570.4, "duration": 4.58}, {"text": "this is especially true for gameplay decisions made for Resident Evil:", "start": 574.98, "duration": 3.98}, {"text": "It was pretty common for Japanese game difficulty to be altered for the international market,", "start": 578.96, "duration": 4.74}, {"text": "and this was basically because of one factor, one not present in Japan: Rentals!", "start": 583.7, "duration": 4.48}, {"text": "Vanilla Resident Evil 1 had the auto-aim purposefully taken out", "start": 588.2, "duration": 3.76}, {"text": "so that it would make the game harder and take longer to finish, meaning more rentals.", "start": 591.98, "duration": 4.12}, {"text": "And we got this little fact wrong in our Re:Certified Classic video, so I wanna take a second to correct it:", "start": 596.12, "duration": 3.98}, {"text": "Resident Evil 2 also had a easier Japanese version, though you CAN turn on the auto-aim in the US version,", "start": 600.32, "duration": 6.46}, {"text": "it's just not automatically on, like it is in the Japanese version.", "start": 606.78, "duration": 2.62}, {"text": "These sorts of difficulty differences would continue for many titles throughout the series.", "start": 609.58, "duration": 5.08}, {"text": "Resident Evil trafficked in video game violence during a time in the US where that was more controversial.", "start": 614.8, "duration": 5.72}, {"text": "The first game in particular had its fair share of censorship, and here's some highlights:", "start": 620.52, "duration": 4.22}, {"text": "The opening cinematic had a few things changed, like Chris' smoking - drugs are bad, kids -", "start": 624.74, "duration": 4.34}, {"text": "and poor JosEeEeph's...", "start": 629.08, "duration": 1.76}, {"text": "JILL: \"JosEeEeph!\"", "start": 630.84, "duration": 1.2}, {"text": "DEREK: ... gory demise.", "start": 632.04, "duration": 1.14}, {"text": "For the Director's Cut version of Resident Evil 1, Capcom promised to release the uncensored version,", "start": 633.2, "duration": 5.32}, {"text": "but... accidentally shipped it censored!", "start": 638.52, "duration": 2.64}, {"text": "Another version, the Dual Shock release, had the infamous Mamoru Samuragouchi soundtrack, and...", "start": 641.16, "duration": 5.66}, {"text": "well, that's not censorship or localization, that's... just really how everyone got it worse.", "start": 647.0, "duration": 4.62}, {"text": "[♫ RE Dual Shock Version Mansion Basement theme ♫]", "start": 651.82, "duration": 6.88}, {"text": "There's a ton of examples of violence in the series being censored,", "start": 658.86, "duration": 3.44}, {"text": "but in later years, the censorship got flipped and Japan got the censored versions,", "start": 662.3, "duration": 4.56}, {"text": "while most of the rest of the world was able to revel in the extra gore!", "start": 666.86, "duration": 3.64}, {"text": "For the Resident Evil 2 Remake, a couple of particularly gory scenes were toned down.", "start": 670.68, "duration": 4.66}, {"text": "This one in particular feels ironic,", "start": 675.48, "duration": 2.04}, {"text": "because to me it feels like an homage to the first zombie reveal in the first game,", "start": 677.52, "duration": 4.76}, {"text": "which was, of course, missing a key scene.", "start": 682.28, "duration": 2.24}, {"text": "This switch into censorship for the series started", "start": 684.6, "duration": 2.64}, {"text": "because of the Japanese adoption of its ratings board, CERO, in 2002.", "start": 687.24, "duration": 4.36}, {"text": "This actually resulted in Biohazard 4 having some violence toned down,", "start": 691.68, "duration": 4.5}, {"text": "but that's not the main content difference I wanna focus on.", "start": 696.22, "duration": 2.56}, {"text": "In Biohazard 4, the Japanese version, when you play as Ashley in chapter 3-4,", "start": 698.8, "duration": 4.58}, {"text": "you have the original fixed camera angles instead of the over-the-shoulder camera!", "start": 703.38, "duration": 4.12}, {"text": "There's a lot of talk of how censorship in the Japanese version makes the western versions better,", "start": 707.56, "duration": 4.32}, {"text": "but for my money, this is the real thing I wish we had over here.", "start": 711.88, "duration": 3.7}, {"text": "Since the Ashley section's all about taking your weapons away from you,", "start": 715.58, "duration": 3.08}, {"text": "it really feels like a throwback to the series' survival horror roots,", "start": 718.66, "duration": 3.34}, {"text": "and really adds to the tension of that moment!", "start": 722.0, "duration": 2.4}, {"text": "It's a small thing overall, but I think this would have made Resident Evil 4 just that much better!", "start": 724.4, "duration": 5.24}, {"text": "But of course, that real cheese here is that translation.", "start": 729.76, "duration": 3.46}, {"text": "Well... not so much the translation, but the localization.", "start": 733.24, "duration": 3.42}, {"text": "Resident Evil is infamous for its terrible/wonderful voice acting,", "start": 736.86, "duration": 4.1}, {"text": "but we think a lot of the problems with its script are due to a too-literal translation,", "start": 740.96, "duration": 5.42}, {"text": "meaning Resident Evil didn't suffer from a bad translation, but a bad localization.", "start": 746.38, "duration": 5.0}, {"text": "For the early Resident Evil games, the script was first written in Japanese,", "start": 751.52, "duration": 4.04}, {"text": "and then translated/localized into English.", "start": 755.56, "duration": 2.7}, {"text": "That English script is what the voice actors spoke, but for the Japanese version of the game,", "start": 758.26, "duration": 4.76}, {"text": "the Japanese subtitles are mostly the original Japanese script, and don't follow the English voices.", "start": 763.02, "duration": 5.8}, {"text": "This makes it easy to look at localization issues, for example,", "start": 768.94, "duration": 3.26}, {"text": "and we wanna thank Residenteevee over on GameFAQs for pointing this out,", "start": 772.2, "duration": 3.38}, {"text": "the infamous \"Master of Unlocking\" is an almost-literal translation of the phrase Barry says in Japanese.", "start": 775.58, "duration": 6.18}, {"text": "But no-one speaking English in the American Midwest would talk like that,", "start": 781.76, "duration": 3.94}, {"text": "which is why the line became this in the remake:", "start": 785.7, "duration": 2.7}, {"text": "BARRY: \"It's a lockpick. You'd make better use of it.\"", "start": 788.4, "duration": 3.24}, {"text": "DEREK: ... which is not as fun, but it is a better localization of the line.", "start": 791.7, "duration": 4.12}, {"text": "Resident Evil 4 comes up a lot in this \"localization vs. straight translation\" debate.", "start": 795.92, "duration": 4.64}, {"text": "There's always been a bit of controversy around the tonal shift that Resident Evil 4 represented for the series,", "start": 800.56, "duration": 5.34}, {"text": "not the least of which comes from Leon's character.", "start": 805.9, "duration": 2.32}, {"text": "Though the signs that Resident Evil was going to become a cheesy action series", "start": 808.28, "duration": 3.84}, {"text": "were already there earlier than Resident Evil 4.", "start": 812.12, "duration": 2.56}, {"text": "Hell yeah! Claire can outrun a helicopter", "start": 814.76, "duration": 2.5}, {"text": "and shatter the laws of physics by falling faster than both her gun and gravity!", "start": 817.26, "duration": 4.64}, {"text": "Mah gurl!", "start": 821.9, "duration": 0.9}, {"text": "Anyway, while the idea that Resident Evil ever had a consistent tone is kinda hilarious,", "start": 823.12, "duration": 4.36}, {"text": "there are some valid complaints that Leon had a personality shift between Resident Evil 2 and 4.", "start": 827.48, "duration": 5.86}, {"text": "His cocky, smarmy action-guy attitude was not present in the Japanese subtitles for Biohazard 4.", "start": 837.2, "duration": 6.54}, {"text": "The best example of this is my favorite line in video game history:", "start": 843.88, "duration": 3.62}, {"text": "LEON: \"Where's everyone going? Bingo?\"", "start": 847.56, "duration": 2.34}, {"text": "DEREK: [chuckles] Makes me laugh every time.", "start": 849.9, "duration": 1.92}, {"text": "But in the Japanese script, this line is instead simply \"Dō natteru...?\"", "start": 851.82, "duration": 4.36}, {"text": "which, thanks to Haruda-sensei, I know is a very standard \"What's happening? / What's going on?\"", "start": 856.36, "duration": 5.5}, {"text": "No jokes, just a simple statement of confusion: \"Dō natteru...?\"", "start": 861.9, "duration": 3.84}, {"text": "So this makes the bingo line a poor literal translation.", "start": 865.76, "duration": 4.12}, {"text": "There's sadly no mention of bingo in the Japanese script,", "start": 869.94, "duration": 2.94}, {"text": "however, I think it's an amazing localization, because it gives RE4 a cheesy action movie feel", "start": 872.88, "duration": 5.78}, {"text": "that I think is fitting for how over-the-top and bananas that game is!", "start": 878.66, "duration": 4.16}, {"text": "For our next game, we're actually gonna tag-team this one.", "start": 883.02, "duration": 3.0}, {"text": "Be right back.", "start": 886.02, "duration": 0.94}, {"text": "Hey! It's Grace, and I'm gonna step in to talk about our next series,", "start": 887.46, "duration": 3.66}, {"text": "because I was obsessed with it in my gamer youth: Breath of Fire.", "start": 891.12, "duration": 4.66}, {"text": "Now, there are a couple of localization issues across the series,", "start": 895.78, "duration": 3.92}, {"text": "I mean, Breath of Fire I had a character's race changed, which... yikes.", "start": 899.7, "duration": 4.58}, {"text": "Breath of Fire IV also had some sexy things taken out,", "start": 904.3, "duration": 2.78}, {"text": "but like, honestly, that didn't really make the games worse, or like, THAT much worse.", "start": 907.08, "duration": 4.88}, {"text": "The big fish to fry here is actually Breath of Fire II.", "start": 911.96, "duration": 3.68}, {"text": "Where to start...", "start": 915.74, "duration": 1.72}, {"text": "Breath of Fire II on the Game Boy Advance is one of  the first JRPGs I ever played.", "start": 917.54, "duration": 4.84}, {"text": "I absolutely love it.", "start": 922.38, "duration": 2.12}, {"text": "However, I am still embarrassed that 12-year-old me didn't notice the awful translation", "start": 924.5, "duration": 5.88}, {"text": "- not just localization, translation -", "start": 930.38, "duration": 2.42}, {"text": "that was present in the SNES version and was only partially fixed for any of its other versions.", "start": 932.8, "duration": 5.3}, {"text": "It's actually kind of amazing that it got released as-is, even in the mid-90's.", "start": 938.12, "duration": 4.64}, {"text": "The translation is so bad that it's pretty hard to show off on video.", "start": 942.78, "duration": 4.22}, {"text": "It's full of grammar mistakes like punctuation errors and misspellings,", "start": 947.0, "duration": 3.64}, {"text": "genuine mistakes like gender mixups,", "start": 950.64, "duration": 2.1}, {"text": "bad localization, and just some... weird choices.", "start": 952.74, "duration": 3.68}, {"text": "The best examples I found are actually in the various minigames, which are available to you very early on.", "start": 956.42, "duration": 5.4}, {"text": "The fishing minigame in the SNES version features issues like the L/R Catastrophe!", "start": 961.82, "duration": 5.78}, {"text": "Uh... this was fixed in the GBA version,", "start": 967.6, "duration": 2.56}, {"text": "but words are still abbreviated in really weird ways throughout the game,", "start": 970.16, "duration": 3.94}, {"text": "likely because English is a longer language than Japanese,", "start": 974.14, "duration": 2.96}, {"text": "and they shorten words instead of finding a better substitution.", "start": 977.1, "duration": 3.22}, {"text": "Hunting isn't much better:", "start": 980.4, "duration": 1.2}, {"text": "\"Roast is found\" sure is an interesting way to describe the boaricide I just committed.", "start": 981.66, "duration": 4.76}, {"text": "There's spacing and grammar issues throughout these menus,", "start": 986.42, "duration": 2.8}, {"text": "and then they also don't localize Japanese words like \"unagi\", which means \"eel\" in English.", "start": 989.22, "duration": 5.2}, {"text": "Now, I don't have a problem with this decision to keep it as \"unagi\" in general,", "start": 994.44, "duration": 4.22}, {"text": "but because this game is supposed to have a western old-timey English setting, it just feels off!", "start": 998.66, "duration": 5.8}, {"text": "The localization for this game is completely all over the place.", "start": 1004.56, "duration": 3.78}, {"text": "I love this game, and I played through it as a kid without really noticing it somehow,", "start": 1008.4, "duration": 4.46}, {"text": "but once you DO notice it, it's like... whoa.", "start": 1012.9, "duration": 3.14}, {"text": "If you really wanna see a thorough breakdown, I highly recommend Clyde Mandelin's breakdown on it,", "start": 1016.16, "duration": 4.96}, {"text": "link in the description below.", "start": 1021.12, "duration": 1.56}, {"text": "I also gotta note that the plot itself is pretty special,", "start": 1022.7, "duration": 2.96}, {"text": "if only because Capcom was able to get an anti-religious plot with references to saints and churches", "start": 1025.66, "duration": 5.68}, {"text": "through Nintendo of America's strict censors.", "start": 1031.34, "duration": 2.44}, {"text": "Though perhaps Nintendo wasn't being so heavy-handed on that stuff by 1995.", "start": 1033.78, "duration": 5.0}, {"text": "It's me again! Hey!", "start": 1039.26, "duration": 1.28}, {"text": "And now we're gonna switch it up with another series that was important to me as a kid:", "start": 1040.6, "duration": 3.12}, {"text": "Bionic Commando.", "start": 1043.72, "duration": 1.46}, {"text": "We're gonna level with you:", "start": 1045.32, "duration": 1.18}, {"text": "Bionic Commando is pretty different from its Japanese version,", "start": 1046.62, "duration": 2.88}, {"text": "and How the West was Worse is still a new concept for us,", "start": 1049.5, "duration": 3.32}, {"text": "but I'm gonna go ahead and rule that Bionic Commando is actually a How the West was Better, and here's why:", "start": 1052.82, "duration": 6.14}, {"text": "Bionic Commando, or really, Top Secret had a Hitler problem.", "start": 1059.2, "duration": 4.22}, {"text": "Let's start way back.", "start": 1063.74, "duration": 1.16}, {"text": "1985: Capcom releases Commando into arcades.", "start": 1065.0, "duration": 3.44}, {"text": "Now, some of you might be saying \"Hey, Uncle Derek,\"", "start": 1068.44, "duration": 2.52}, {"text": "\"Commando actually has nothing to do with Bionic Commando,\" and you're right!", "start": 1070.96, "duration": 3.6}, {"text": "Two years later in 1987, Capcom released Top Secret into arcades,", "start": 1074.56, "duration": 4.08}, {"text": "but you might know it as Bionic Commando.", "start": 1078.64, "duration": 2.6}, {"text": "In yet another example of changing a name to avoid copyright issues,", "start": 1081.28, "duration": 3.66}, {"text": "Capcom USA renamed Top Secret to Bionic Commando.", "start": 1084.94, "duration": 3.4}, {"text": "Despite the fact the game has almost no in-game story to speak of,", "start": 1088.52, "duration": 3.48}, {"text": "it was marketed as a sequel to Commando,", "start": 1092.0, "duration": 2.18}, {"text": "and they decided to claim the main character was Super Joe for some reason.", "start": 1094.18, "duration": 3.38}, {"text": "It seems like Capcom's Japan and USA offices weren't communicating much,", "start": 1097.62, "duration": 4.28}, {"text": "because Commando did get a sequel a few years after that: Mercs.", "start": 1101.9, "duration": 4.0}, {"text": "Now, all this is weird, but everything's fine at this point.", "start": 1106.08, "duration": 2.96}, {"text": "I- it's fine.", "start": 1109.24, "duration": 0.88}, {"text": "Until they decided to port Top Secret to the Famicom.", "start": 1110.3, "duration": 3.58}, {"text": "\"Port\" actually isn't even really that fair to say,", "start": 1114.28, "duration": 2.18}, {"text": "it's basically a completely different game from the arcade original.", "start": 1116.46, "duration": 3.26}, {"text": "The only real holdover is that it's an action-platformer where you don't jump.", "start": 1119.72, "duration": 3.38}, {"text": "But they also slapped on the subtitle \"The Resurrection of Hitler\",", "start": 1123.2, "duration": 3.14}, {"text": "and threw in some alternate history Hitler stuff that, at the end of the day, is not necessary?", "start": 1126.34, "duration": 4.96}, {"text": "North America got the better version through the transitive mathematical property of", "start": 1131.3, "duration": 4.16}, {"text": "\"Less Hitler = Better\".", "start": 1135.5, "duration": 1.64}, {"text": "Bionic Commando for the NES renamed Hitler as \"Master-D\", but his likeness is still there,", "start": 1137.18, "duration": 5.08}, {"text": "and they renamed the Nazis as \"The Badds\", which I appreciate for the honesty.", "start": 1142.26, "duration": 3.84}, {"text": "But even though the Nazi stuff was largely censored, that doesn't mean the game as a whole was.", "start": 1146.16, "duration": 4.78}, {"text": "By some miracle, this game shipped in North America with a radically gory end to Master-D,", "start": 1150.94, "duration": 5.16}, {"text": "featured a GD cuss, and there's still an interrogation scene,", "start": 1156.1, "duration": 3.64}, {"text": "but he just calls you a little boy and you can't shoot him.", "start": 1159.74, "duration": 2.7}, {"text": "Overall, the localization is still pretty bad:", "start": 1162.52, "duration": 2.56}, {"text": "There's misspellings and the computers still talk in Japanese onomatopoeia,", "start": 1165.08, "duration": 3.4}, {"text": "however, it features one of the great video game lines,", "start": 1168.5, "duration": 3.1}, {"text": "\"Get the heck out of here, you nerd!\"", "start": 1171.6, "duration": 1.64}, {"text": "It's still hilarious that they took the effort to remove the Nazi stuff, but still misspell \"Albatross\"?", "start": 1173.3, "duration": 4.84}, {"text": "Or is it the German spelling?", "start": 1178.22, "duration": 1.4}, {"text": "Or is that a misspelling, I'm saying...", "start": 1179.68, "duration": 1.4}, {"text": "I'm calling- I'm calling it-", "start": 1181.5, "duration": 1.36}, {"text": "No, that's a misspelling. No.", "start": 1182.86, "duration": 1.46}, {"text": "When the Game Boy version came out in 1992,", "start": 1184.44, "duration": 2.24}, {"text": "the series became Bionic Commando in all regions, officially dropping Top Secret.", "start": 1186.68, "duration": 4.2}, {"text": "I always felt the Game Boy version had a more futuristic Mega Man vibe to it,", "start": 1190.9, "duration": 3.54}, {"text": "less grounded in real-world World War 2 stuff.", "start": 1194.44, "duration": 2.64}, {"text": "From here, Bionic Commando games sometimes would briefly mention Albatros or Master-D,", "start": 1197.16, "duration": 4.88}, {"text": "but would never again go full Hitler.", "start": 1202.1, "duration": 2.12}, {"text": "Remember kids: Even Hitler killed Hitler.", "start": 1204.3, "duration": 2.22}, {"text": "And now we're gonna take it home with a game that has maybe the craziest localization of any Capcom game,", "start": 1206.74, "duration": 4.94}, {"text": "not because of what got changed, but when it happened!", "start": 1211.68, "duration": 3.8}, {"text": "Everything else we've talked about happened in the 80's and 90's,", "start": 1215.56, "duration": 2.84}, {"text": "but this stunner came out in 2005.", "start": 1218.68, "duration": 3.32}, {"text": "Devil Kings is the unfortunate localization for the first Sengoku Basara game.", "start": 1222.2, "duration": 4.96}, {"text": "The Sengoku Basara series - basically Samurai Heroes in English, by the way -", "start": 1227.16, "duration": 3.96}, {"text": "is kinda like if Dynasty Warriors was set in Japan.", "start": 1231.12, "duration": 3.04}, {"text": "It's a historical hack-and-slash game where everything's over-the-top crazy, fun, anime as hell.", "start": 1234.16, "duration": 4.42}, {"text": "It's kind of a loving send-up to Japanese history,", "start": 1238.68, "duration": 2.48}, {"text": "and according to Capcom, even caused a spike in tourism in Japan.", "start": 1241.16, "duration": 3.58}, {"text": "At the very least, it's popular enough for Capcom to brag about", "start": 1244.8, "duration": 2.92}, {"text": "putting Sengoku Basara characters in a Japanese \"Rock the Vote\" campaign.", "start": 1247.72, "duration": 3.96}, {"text": "So there's that.", "start": 1251.74, "duration": 0.9}, {"text": "I guess a modern equivalent would be something like this.", "start": 1252.84, "duration": 2.46}, {"text": "Now, this is VERY different from the game we got.", "start": 1255.5, "duration": 3.18}, {"text": "Basically, series producers thought that Capcom fans wanted more Devil May Cry", "start": 1258.68, "duration": 4.3}, {"text": "instead of a fantasy samurai game, which...", "start": 1262.98, "duration": 2.48}, {"text": "Okay, it was 2005 so, fair.", "start": 1265.46, "duration": 1.98}, {"text": "I mean, I fell for it, that's why I bought it.", "start": 1267.44, "duration": 2.36}, {"text": "So they slapped on a new name and a familiar font and called it good, right?", "start": 1269.88, "duration": 3.92}, {"text": "Didn't change anything else?", "start": 1273.9, "duration": 1.52}, {"text": "HA! Nope!", "start": 1275.52, "duration": 1.62}, {"text": "Devil Kings is no longer set in Japan during the Sengoku period,", "start": 1277.36, "duration": 3.78}, {"text": "it now takes place... sometime, in a weird Pangaea-like country or continent?", "start": 1281.14, "duration": 4.82}, {"text": "And because of this, tons of things got changed,", "start": 1285.96, "duration": 2.42}, {"text": "like soldiers' models were changed to look more western, kinda?", "start": 1288.38, "duration": 3.42}, {"text": "... these guys are suddenly ancient Egyptian for some reason?", "start": 1291.8, "duration": 2.72}, {"text": "Also they changed the backgrounds, basically to make the game look less Japanese and more western.", "start": 1294.52, "duration": 5.16}, {"text": "Oh, and they even got more name changes:", "start": 1299.68, "duration": 1.86}, {"text": "Oda Nobunaga is now the titular Devil King,", "start": 1301.54, "duration": 2.5}, {"text": "and actual series mascots Date Masamune and Sanada Yukimura are now Azure Dragon and Scorpio!", "start": 1304.04, "duration": 6.98}, {"text": "Beyond aesthetics, there were also numerous changes to the gameplay itself:", "start": 1311.1, "duration": 3.94}, {"text": "They cut four playable characters and made huge changes to the combat.", "start": 1315.04, "duration": 4.1}, {"text": "We won't get into mechanical specifics,", "start": 1319.18, "duration": 1.74}, {"text": "but you can understand why Sengoku fans consider this to be the worst version of the game.", "start": 1320.92, "duration": 4.82}, {"text": "It's important to note that Devil Kings came out during Capcom's Keiji Inafune-led big western push,", "start": 1325.8, "duration": 5.48}, {"text": "which we did a whole video about, though Inafune didn't appear to have any hands on this game in particular.", "start": 1331.28, "duration": 5.4}, {"text": "Devil Kings was released to mixed reviews, and Sengoku Basara didn't get another western release", "start": 1336.78, "duration": 5.06}, {"text": "until 2009's Sengoku Basara: Samurai Heroes, which notably didn't have the same treatment as Devil Kings.", "start": 1341.84, "duration": 6.8}, {"text": "However, this brings us to the actual Devil May Cry, not the shoehorned Devil May Cry.", "start": 1349.02, "duration": 4.82}, {"text": "While the series has had its questionable moments,", "start": 1353.92, "duration": 2.24}, {"text": "- the awkward second game, the difficulty changes between regions in the third game, this:", "start": 1356.16, "duration": 4.5}, {"text": "DANTE: \"I should have been the one to fill your dark soul with LIIIIGHT!!\"", "start": 1360.74, "duration": 3.78}, {"text": "DEREK: ... one game marked a new era of localization issues for Capcom.", "start": 1365.42, "duration": 3.74}, {"text": "Well, \"localization\" might be a stretch of the definition, but stick with me here,", "start": 1369.16, "duration": 3.36}, {"text": "because it's time to talk about DmC: Devil May Cry, the Devil May Cry reboot.", "start": 1372.52, "duration": 5.12}, {"text": "Again, we talked about a lot of the factors surrounding this in our Inafune Explained video,", "start": 1377.72, "duration": 4.6}, {"text": "but the period from about 2005 to 2013 had a lot of growing pains for Capcom.", "start": 1382.32, "duration": 5.42}, {"text": "Increasingly, to make a successful game for consoles", "start": 1387.74, "duration": 2.54}, {"text": "meant appealing to a more western sensibility than a Japanese one,", "start": 1390.28, "duration": 3.74}, {"text": "so the process of localization was fundamentally changed:", "start": 1394.02, "duration": 3.12}, {"text": "No longer would they take a finished Japanese game and drastically change it, like Sengoku Basara,", "start": 1397.16, "duration": 4.52}, {"text": "instead they would already be as western as possible from the jump,", "start": 1401.68, "duration": 3.5}, {"text": "a turn towards globalization instead of just localization.", "start": 1405.18, "duration": 3.38}, {"text": "Initially this meant titles like Dead Rising, Lost Planet and the little-remembered Shadow of Rome...", "start": 1408.56, "duration": 4.9}, {"text": "AGRIPPA: \"Are you satisfied?!\"", "start": 1413.5, "duration": 1.76}, {"text": "DEREK: ... were developed in-house by Capcom, but then they decided to take it a bit further,", "start": 1415.26, "duration": 3.62}, {"text": "and have games developed by external western studios, like 2009's Bionic Commando reboot.", "start": 1418.88, "duration": 5.06}, {"text": "2008; Devil May Cry 4 left Capcom feeling that that series was a little tired,", "start": 1423.94, "duration": 4.54}, {"text": "so they gave the series to British studio Ninja Theory.", "start": 1428.48, "duration": 3.12}, {"text": "But it's not like Capcom gave Devil May Cry to Ninja Theory and we magically got this...", "start": 1431.62, "duration": 4.38}, {"text": "DONTE: \"Not in a million years.\"", "start": 1436.04, "duration": 1.3}, {"text": "DEREK: Capcom, and specifically Keiji Inafune, who was a senior corporate officer at the time,", "start": 1438.2, "duration": 4.96}, {"text": "and series director Hideaki Itsuno initially pushed concepts from Ninja Theory", "start": 1443.16, "duration": 4.86}, {"text": "farther and farther away from a game that would be recognizable to Devil May Cry fans.", "start": 1448.08, "duration": 4.78}, {"text": "They felt that Dante as a character reflected gothic Japanese street cool circa early 2000's,", "start": 1452.86, "duration": 5.7}, {"text": "and they wanted Ninja Theory to merge late-2000's European street cool", "start": 1458.56, "duration": 3.78}, {"text": "with a grounded western movie aesthetic.", "start": 1462.34, "duration": 1.84}, {"text": "Which is how we got Bieber Hair Dante.", "start": 1464.42, "duration": 1.84}, {"text": "Capcom asked for this.", "start": 1466.38, "duration": 1.76}, {"text": "Understandably, fans of the series were upset", "start": 1468.24, "duration": 2.58}, {"text": "at the 2010 Tokyo Game Show reveal of this sudden stylistic reboot,", "start": 1470.82, "duration": 4.2}, {"text": "which, at a core level, betrays the original Japanese-style flashy appeal of Devil May Cry.", "start": 1475.02, "duration": 5.7}, {"text": "Side note: Inafune peaced out from Capcom literally a month later.", "start": 1480.92, "duration": 4.4}, {"text": "I'm not entirely sure that DmC: Devil May Cry is a bad game...", "start": 1485.4, "duration": 3.44}, {"text": "- it's a bad name, that's for sure -", "start": 1488.86, "duration": 1.54}, {"text": "... but it was a complete globalization misstep for Capcom,", "start": 1490.42, "duration": 3.26}, {"text": "selling way under its projected sales of two million in its first fiscal year.", "start": 1493.68, "duration": 4.5}, {"text": "That, combined with Resident Evil 6 drastically underselling,", "start": 1498.18, "duration": 2.98}, {"text": "led Capcom to blame their troubles on a \"decline in quality due to excessive outsourcing\",", "start": 1501.16, "duration": 5.18}, {"text": "and to shift their franchises back in-house.", "start": 1506.34, "duration": 3.08}, {"text": "In recent years, they've found a way to strike a globalization balance:", "start": 1509.46, "duration": 3.82}, {"text": "Monster Hunter: World did the impossible by becoming Capcom's single best-selling game in company history,", "start": 1513.28, "duration": 6.44}, {"text": "and the new Devil May Cry 5 looks to have taken Dante back to his roots.", "start": 1519.72, "duration": 3.86}, {"text": "Literally.", "start": 1523.8, "duration": 0.68}, {"text": "Alright, and that's it... ?", "start": 1524.94, "duration": 2.0}, {"text": "No, I'm sure you noticed the conspicuous absence of a couple of franchises,", "start": 1527.02, "duration": 3.84}, {"text": "and that's because Final Fight and Street Fighter are so massive, we decided they need their own video,", "start": 1530.86, "duration": 5.76}, {"text": "so stay tuned for when How the West was Worse covers Final Fight and Street Fighter.", "start": 1536.62, "duration": 5.34}, {"text": "Thanks so much for watching, we'll see ya next time,", "start": 1541.96, "duration": 2.0}, {"text": "SMASH the like button, and SMASH the subscriber button, and then smash...", "start": 1543.96, "duration": 5.5}, {"text": "GRACE: The bell!\nDEREK: ... the bell, uh...", "start": 1549.46, "duration": 1.8}, {"text": "and smash the fists and high-fives of all of the people that help support this video on Patreon,", "start": 1551.26, "duration": 5.82}, {"text": "all of them are awesome, and you can see your name here too if you go ahead and help the channel,", "start": 1557.16, "duration": 5.18}, {"text": "you can also see videos early and help with voting, be a part of our Discord,", "start": 1562.34, "duration": 4.58}, {"text": "join the Stop Skeletons family, or just hey, keep watching, keep likin', keep subscribing, stay tuned.", "start": 1566.92, "duration": 5.74}]