[{"text": "Babylonia\n700 BCE", "start": 0.489, "duration": 2.511}, {"text": "A man begins a recitation, praying for relief from his toothache. To banish this pain", "start": 3.1, "duration": 5.029}, {"text": "He recites the history of the creature that afflicts him: the worm went weeping before the Sun God", "start": 8.13, "duration": 6.269}, {"text": "His tears flowing before the God of the Void", "start": 14.7, "duration": 2.759}, {"text": "\"What will thou give me for food?\" he cries", "start": 17.98, "duration": 3.649}, {"text": "\"What will thou give me for sucking?\" the gods offer fruit", "start": 22.18, "duration": 4.519}, {"text": "but he turns away. \"What use are me the ripe fig and", "start": 26.699, "duration": 4.649}, {"text": "Apricot? Lift me up and among the teeth and gums cause me to do error. The blood of the tooth", "start": 31.689, "duration": 6.619}, {"text": "I will suck and of the gum I will gnaw its root.\"", "start": 38.309, "duration": 3.96}, {"text": "He packs medicine into his tooth and intones: \"Because thou has said this, oh tooth worm,", "start": 42.579, "duration": 5.66}, {"text": "Let the God of the Void smite you with his mighty fist.\"", "start": 48.43, "duration": 4.099}, {"text": "Thus did dentistry begin. Not with drills and sterile offices, but with magic.", "start": 53.05, "duration": 5.239}, {"text": "♪ Intro ♪", "start": 59.0, "duration": 5.0}, {"text": "This episode is sponsored by Child and Team Checkups program of Minnesota. As a parent, of course you're worried about your child.", "start": 64.9, "duration": 6.559}, {"text": "So you should visit your nearest clinic for a wellness check. Free for infants through young adults.", "start": 71.46, "duration": 4.26}, {"text": "And you'll be happy knowing your child is healthy. Learn more at the links below.", "start": 75.72, "duration": 3.809}, {"text": "Dentistry may actually be one of the oldest forms of medicine.", "start": 80.65, "duration": 2.989}, {"text": "But it was also one of the last ones to professionalize.", "start": 83.71, "duration": 2.75}, {"text": "In fact, dentistry spent several millennia mired in magic and superstition. With chance,", "start": 86.46, "duration": 5.519}, {"text": "Amulets and folk beliefs working in conjunction with brutal treatments like hand extraction.", "start": 92.26, "duration": 5.15}, {"text": "That's of course where a practitioner would take a tooth between their fingers rock it back and forth and wait, wait, wait, wait wait", "start": 97.44, "duration": 6.779}, {"text": "Please don't click away. Don't worry. We know a lot of people have phobias about dental surgery to be honest", "start": 104.22, "duration": 5.52}, {"text": "I have a few myself", "start": 109.74, "duration": 1.18}, {"text": "So Rob and I have had a talk about not getting too specific about the painful stuff in this episode", "start": 110.92, "duration": 5.3}, {"text": "Haven't we Rob Yeah, right. We're not going to have another flu pandemic series on our hands", "start": 116.37, "duration": 5.069}, {"text": "Are we Rob? Good", "start": 121.44, "duration": 1.75}, {"text": "Because we all realize now that not everyone spends their days doing research in museums full of human bodies", "start": 123.19, "duration": 5.63}, {"text": "Some people might get grossed out Rob", "start": 128.92, "duration": 2.87}, {"text": "I think we came to an understanding and Rob has assured me that this first part about", "start": 131.8, "duration": 5.419}, {"text": "Neanderthal dentistry is as bad as this episode gets so let's push on through", "start": 137.38, "duration": 4.339}, {"text": "Though the ritual that opened this episode comes from ancient Mesopotamia. We've actually discovered evidence of dental treatments in even Neolithic times", "start": 142.36, "duration": 7.94}, {"text": "13,000 years ago", "start": 151.239, "duration": 1.321}, {"text": "Neanderthals were using basic tools for tooth extraction placing sticks against an infected tooth and hitting it with a rock and", "start": 152.56, "duration": 6.29}, {"text": "Other early teeth show signs of having their infected bits scraped out with flint tools", "start": 159.04, "duration": 4.25}, {"text": "But neolithic healers only had to deal with wear and tear teeth that cracked or ground down from overuse", "start": 163.42, "duration": 5.569}, {"text": "It wasn't until the advent of Agriculture that dental caries better known as tooth decay", "start": 169.239, "duration": 5.0}, {"text": "Became a problem because farming meant sugars from bread beer wine and honey and as civilization rose", "start": 174.459, "duration": 6.5}, {"text": "oral hygiene fell", "start": 181.239, "duration": 2.0}, {"text": "particularly among the upper-class", "start": 183.519, "duration": 1.621}, {"text": "But the kicker was people didn't know that their diet was eroding their teeth", "start": 185.14, "duration": 4.49}, {"text": "To ancient folks the parties responsible were either demons imbalanced fluids known as humors or the pernicious", "start": 189.79, "duration": 6.169}, {"text": "But imaginary tooth worm that burrowed holes in teeth and gums", "start": 196.359, "duration": 3.86}, {"text": "Some treatments included smoking out the worm packing a tooth with gums and wax to smother it or wearing magical amulets to ward it away", "start": 200.56, "duration": 7.25}, {"text": "Mesopotamian texts recommend elaborate rituals and spells some of which involve venerating and kissing a human skull", "start": 208.569, "duration": 6.68}, {"text": "Tooth extraction was also a common punishment referred to twice in Hammurabi's code", "start": 215.56, "duration": 4.699}, {"text": "Because in the ancient world an eye for an eye a tooth for a tooth", "start": 220.69, "duration": 3.289}, {"text": "Was not just a catchy saying but a system for meeting out justice, but other societies like Egypt considered dentistry", "start": 224.14, "duration": 7.22}, {"text": "The tomb of court physician Hesse Rey dated 26 60. BCE is decorated with hieroglyphics", "start": 232.0, "duration": 5.36}, {"text": "Proclaiming him as the greatest of those who deal with teeth and in addition to looking after the Pharaohs teeth", "start": 237.91, "duration": 5.899}, {"text": "He was also given offices like keeper of the royal records and guard of the Pharaohs diadem", "start": 243.81, "duration": 4.919}, {"text": "It appears that high office regularly accompanied those who looked after the royal teeth", "start": 248.89, "duration": 4.22}, {"text": "Another Egyptian palace dentist cooee was rewarded with grand offices that spoke to his skill treating the Pharaohs digestive system", "start": 253.299, "duration": 7.369}, {"text": "Including the prodigious title guardian of the anus but grand titles aside", "start": 260.919, "duration": 4.91}, {"text": "Egyptian dentists were also well known for their pain relief drugs most made from opium or literal poisons", "start": 266.35, "duration": 6.079}, {"text": "They also used mouthwashes burn substances to fumigate the mouth with smoke and did tooth extractions by hand", "start": 272.43, "duration": 6.42}, {"text": "Further east things were not quite so dire", "start": 279.19, "duration": 2.389}, {"text": "The most advanced dentistry of the ancient world happened in India where Vedic texts mixed religion with sound oral advice", "start": 281.83, "duration": 7.43}, {"text": "They urged daily teeth cleanings with paste in a soft piece of shrub", "start": 289.419, "duration": 3.59}, {"text": "also mentioning doctors who can scrape away plaque and", "start": 293.139, "duration": 2.66}, {"text": "Jewelers who wire loose teeth to stronger ones with gold thread in fact some surviving dental tools", "start": 295.99, "duration": 5.359}, {"text": "Look a lot like the ones we still use today", "start": 301.349, "duration": 2.0}, {"text": "Things were also advancing in the West in Greece the medical scholar Hippocrates and the philosopher Aristotle both wrote about dental practice", "start": 303.849, "duration": 7.79}, {"text": "Throwing aside the superstition that surrounded toothaches and instead", "start": 311.83, "duration": 3.589}, {"text": "studying the eruption patterns and blood supply of teeth and like in India the Greeks also wired loose teeth and", "start": 315.7, "duration": 6.199}, {"text": "Practiced extractions with a pair of forceps barring the nightmarish name of the Oh Dante Cogan yet", "start": 322.03, "duration": 6.379}, {"text": "even these philosophers fell victim to mixing in belief on", "start": 328.409, "duration": 3.03}, {"text": "Critically repeating an old superstition that men have more teeth than women. It wasn't until Rome", "start": 331.86, "duration": 5.13}, {"text": "however", "start": 336.99, "duration": 0.359}, {"text": "That ancient dentistry came into its own though dental bridges", "start": 337.349, "duration": 3.6}, {"text": "Replacement teeth put into a plate and anchored to remaining teeth did predate Roman dentistry the dentists of the Eternal City", "start": 341.349, "duration": 6.47}, {"text": "invented gold crowns and made dental prosthetics out of materials like ivory bone and hard wood and Rome marked the first time that", "start": 348.189, "duration": 7.4}, {"text": "Dentistry began to be seen as a separate and to a certain extent less prestigious form of the wider medical profession yet", "start": 355.75, "duration": 7.189}, {"text": "there were also people who pushed back on that the Roman medical writer Celsus for example began arguing that oral health was actually a", "start": 362.939, "duration": 7.56}, {"text": "reflection of the overall state of the body but regardless of its practitioners status", "start": 370.659, "duration": 4.46}, {"text": "Roman dentists began to make advances", "start": 375.25, "duration": 2.119}, {"text": "one Syrian surgeon living in Rome was the first to use drills and circular saws to open infected teeth exposed the Pope beneath and", "start": 377.439, "duration": 7.94}, {"text": "Okay, Rob, that's too much detail. We talked about this wait way too much. I'm just gonna skip ahead if that's okay", "start": 386.62, "duration": 5.839}, {"text": "Another suggested curing gum obsesses by taking a red-hot poker and are you kidding me?", "start": 393.43, "duration": 5.75}, {"text": "We talked about this man people don't want to see that David doesn't want to draw that", "start": 399.18, "duration": 3.779}, {"text": "You know what? I'm just gonna keep turning pages until I find something that isn't excruciating. Okay. Oh,", "start": 403.0, "duration": 4.399}, {"text": "That's a big nope. Oh", "start": 407.919, "duration": 2.0}, {"text": "That's a mouthwash. Really. Oh, okay", "start": 410.529, "duration": 3.17}, {"text": "Here we go in the Middle Ages", "start": 413.699, "duration": 1.9}, {"text": "Dentists and those suffering from tooth maladies could call on Saint Apollonia who was martyred when a mob yanked out all of her", "start": 415.599, "duration": 6.44}, {"text": "Rob seriously who hurt you, you know, what word is gonna jump into early modern times", "start": 422.409, "duration": 4.1}, {"text": "Despite the intervening centuries by the 17th century", "start": 427.089, "duration": 2.84}, {"text": "Dental techniques hadn't really advanced much since the Roman era in Europe", "start": 430.36, "duration": 4.01}, {"text": "The profession was split between two types of practitioners", "start": 434.37, "duration": 2.609}, {"text": "The first tooth pullers would travel the country as part of carnival shows and variety acts", "start": 437.199, "duration": 5.269}, {"text": "extracting teeth on a stage in a weird marriage of medicine and", "start": 443.05, "duration": 3.32}, {"text": "Entertainment most were untrained charlatans who dressed in bizarre costumes and sold quack medicine trained in sleight of hand much like magicians", "start": 446.77, "duration": 7.94}, {"text": "Their assistants would mingle with the crowd and pretend to have teeth pulled early in the show", "start": 454.839, "duration": 4.43}, {"text": "Proving the process was quick and painless", "start": 459.729, "duration": 2.299}, {"text": "They left a trail of broken jaws shattered and fatal infections in their wake but in their own way", "start": 462.37, "duration": 6.42}, {"text": "they were extending the long tradition of paring magic with dentistry using the power of belief to con audiences into buying miracle tonics and", "start": 468.79, "duration": 7.739}, {"text": "lecturing on the conquest of the mythical tooth worm", "start": 476.66, "duration": 2.57}, {"text": "the relief they offered was little different from", "start": 479.3, "duration": 2.66}, {"text": "Mesopotamian priests doctors and Neolithic shamans the second type of dental practitioner was the barber surgeon", "start": 482.24, "duration": 6.17}, {"text": "Which is exactly what it sounds like a barber who also does surgery see back in the 12th century", "start": 488.42, "duration": 6.229}, {"text": "The Vatican had sent out an edict", "start": 494.65, "duration": 2.0}, {"text": "Attempting to professionalize the medical field in particular the dangerous but increasingly common practice of surgery", "start": 496.76, "duration": 6.049}, {"text": "major surgical operations were restricted to physicians", "start": 503.15, "duration": 3.02}, {"text": "whereas the more minor services such as bleeding lancing boils and", "start": 506.33, "duration": 3.679}, {"text": "Dentistry were left to the barber surgeons many countries and cities followed the Pope's lead and enacted the split", "start": 510.26, "duration": 5.75}, {"text": "So if you ever wondered what that red and white striped pole outside your barbershop represents", "start": 516.14, "duration": 4.789}, {"text": "The white is for bandages and the red is for blood in fact a spa day in the 17th century", "start": 520.93, "duration": 5.549}, {"text": "might involve getting a shave some light leach work having a bath getting the corns cut off your feet having your wig brushed out and", "start": 526.7, "duration": 7.219}, {"text": "Getting a tooth capped with gold now that sounds relaxing", "start": 534.08, "duration": 3.589}, {"text": "The barber surgeons weren't saved in the superstition of the traveling shows", "start": 538.07, "duration": 4.159}, {"text": "But they also weren't scientific and the pairing of Dentistry to cosmetic services", "start": 542.36, "duration": 4.52}, {"text": "Revealed that the people of the time considered oral health to be an aesthetic concern which couldn't be further from the truth", "start": 547.31, "duration": 5.539}, {"text": "in fact", "start": 553.03, "duration": 0.78}, {"text": "The Roman writer Celsus was right an increasing amount of modern evidence links oral health with overall health for instance", "start": 553.81, "duration": 6.78}, {"text": "Did you know that people with poor oral health are at even greater risk for heart attacks?", "start": 560.59, "duration": 4.349}, {"text": "But luckily medical dentistry was about to get its first champion in", "start": 565.07, "duration": 3.979}, {"text": "1723 the French dentist Pierre for Shard published his book the surgeon dentist a treatise on teeth and", "start": 570.17, "duration": 6.14}, {"text": "It's hard to even emphasize how revolutionary it was", "start": 576.41, "duration": 3.289}, {"text": "First of all for sure described in detail the methods of installing tooth fillings and dental prosthetics like bridges", "start": 579.95, "duration": 6.289}, {"text": "Creating a set of best practices of operations for people who had mostly learned through apprenticeships of varying quality", "start": 586.43, "duration": 5.72}, {"text": "but this book went far beyond serving as a how-to guide for restorative dentistry bushard also in a study of oral anatomy and", "start": 592.49, "duration": 7.719}, {"text": "descriptions of how the mouth teeth and gums functioned", "start": 600.399, "duration": 2.6}, {"text": "critically", "start": 603.31, "duration": 0.5}, {"text": "he identified for the first time that sugar was in fact the elusive substance that caused tooth decay after more than", "start": 603.81, "duration": 7.619}, {"text": "10,000 years for shard had banished the evil spirits and tooth worms from dental practice", "start": 611.8, "duration": 5.359}, {"text": "oral health would now be the realm of science not demons and dentistry would be its own profession, but", "start": 617.41, "duration": 6.14}, {"text": "Science can often be just as wild as superstition", "start": 624.04, "duration": 3.229}, {"text": "So join us next time as we enter the era of forensic dentistry ether rags and the pedal driven drill", "start": 627.279, "duration": 6.619}, {"text": "It won't hurt a bit", "start": 634.149, "duration": 2.0}, {"text": "Once again, thanks so much to child and teen checkups program of Minnesota for sponsoring this series as a parent", "start": 638.35, "duration": 6.169}, {"text": "I imagine you're always a little worried about your child. Are they healthy? Are you missing anything?", "start": 644.519, "duration": 4.35}, {"text": "But that's why there's free child and teen checkups", "start": 648.87, "duration": 2.759}, {"text": "Just bring your child to your clinic for a free wellness check whether there are new infants of 20 years young almost adult or any", "start": 651.759, "duration": 6.8}, {"text": "Age in between your doctor will check earring vision teeth. That's a big one and offer wellness information for your child's age", "start": 658.56, "duration": 7.169}, {"text": "So you can be happy knowing your child's healthy and best of all, it's all completely free. Learn more at the links below", "start": 665.86, "duration": 6.829}]