[{"text": "Guys, a big thank you to World of Warships for sponsoring this episode.", "start": 2.92, "duration": 4.42}, {"text": "We've been playing it all day, and we're hooked.", "start": 7.34, "duration": 2.4}, {"text": "The game is free-to-play and referred to as the \"thinking man's action game\"", "start": 9.74, "duration": 4.82}, {"text": "because it's the perfect balance of action and strategy.", "start": 14.56, "duration": 3.2}, {"text": "You can command a massive naval fleet featuring some of history's most iconic war vessels.", "start": 17.76, "duration": 5.22}, {"text": "In this game, you can unlock new ships and dominate the oceans with 30 million players worldwide.", "start": 22.98, "duration": 5.9}, {"text": "Experience combat in weather effects that make each engagement unique and change the tactics of battle", "start": 28.88, "duration": 6.3}, {"text": "At Simple History, we draw the artwork of the vehicles we talk about or feature,", "start": 35.18, "duration": 4.04}, {"text": "and World of Warships takes this to an extreme level of detail,", "start": 39.22, "duration": 3.56}, {"text": "as each in-game ship is faithfully recreated using 3D scans of the real-life historical ship.", "start": 42.78, "duration": 5.96}, {"text": "World of Warships is constantly updating the game so there's something new to experience,", "start": 48.74, "duration": 4.2}, {"text": "with a steady cadence of new missions, game updates, and events.", "start": 52.94, "duration": 3.96}, {"text": "You may even be able to play a ship that you see in a Simple History episode,", "start": 56.9, "duration": 3.72}, {"text": "as there are over 200 ships available to play across 11 different nations.", "start": 60.62, "duration": 5.02}, {"text": "Use our exclusive code below and get a free premium USS Langley aircraft carrier,", "start": 65.64, "duration": 5.74}, {"text": "which allows for a completely different form of fast-paced World of Warships gameplay.", "start": 71.38, "duration": 4.36}, {"text": "Click the link below to play World of Warships and collect an exclusive bonus starter pack.", "start": 76.02, "duration": 5.02}, {"text": "New players can register with the code PLAYLANGLEY2019 to receive", "start": 81.04, "duration": 4.62}, {"text": "300 doubloons, one million credits, the USS Langley premium aircraft carrier,", "start": 85.66, "duration": 5.1}, {"text": "three days of premium time, and more.", "start": 90.76, "duration": 2.6}, {"text": "The ship that escaped capture disguised as a tropical island - World War II", "start": 94.48, "duration": 6.18}, {"text": "HNLMS Abraham Crijnssen was a Dutch minesweeper built in the 1930s.", "start": 102.4, "duration": 5.24}, {"text": "There were many Allied ships present in Java,", "start": 107.64, "duration": 2.58}, {"text": "but the HNLMS Abraham Crijnssen would be one of the few-- and last-- to escape", "start": 110.259, "duration": 4.574}, {"text": "from the overwhelming Japanese forces in 1942, because of one ingenious idea.", "start": 114.84, "duration": 6.16}, {"text": "The minesweeper, belonging to the Royal Netherlands Navy,", "start": 121.689, "duration": 3.037}, {"text": "was stationed at Surabaya in the Netherlands East Indies", "start": 124.726, "duration": 2.983}, {"text": "along with several other ships when the Japanese forces were sweeping through the Pacific", "start": 127.899, "duration": 4.19}, {"text": "and crushing the Allies.", "start": 132.63, "duration": 1.36}, {"text": "By February 1942, the situation was growing critical", "start": 133.99, "duration": 3.038}, {"text": "as the Japanese were approaching closer and closer after defeating a combined American British Dutch", "start": 137.028, "duration": 6.412}, {"text": "Australian fleet at the Battle of the Java Sea and the medal of soon as straight the next day", "start": 143.8, "duration": 4.94}, {"text": "The sea was now swarming with Japanese warships", "start": 149.35, "duration": 2.404}, {"text": "and the skies were covered with Japanese aircraft.", "start": 151.754, "duration": 2.506}, {"text": "Considering there were destroyed allied cruisers and destroyers everywhere,", "start": 154.99, "duration": 2.36}, {"text": "there was zero chance of surviving an attack for a small minesweeper.", "start": 157.9, "duration": 4.099}, {"text": "All of the remaining allied vessels were ordered to withdraw to Australia,", "start": 162.46, "duration": 4.191}, {"text": "those remaining being HNLMS Abraham Crijnssen and three other ships.", "start": 166.66, "duration": 4.66}, {"text": "HNLMS Abraham Crijnssen was an easy target, slow-moving", "start": 171.52, "duration": 3.342}, {"text": "and very lightly armed with a 3-inch gun and two Oerlikon 20 mm cannons.", "start": 174.862, "duration": 4.978}, {"text": "The other escaping minesweepers, HNLMS pierre de bitte and HNLMS Ilan du Bois,", "start": 179.86, "duration": 5.84}, {"text": "were scuttled to prevent them from getting into enemy hands,", "start": 185.7, "duration": 0.5}, {"text": "and HNLMS Yan van Amstel was destroyed by a Japanese destroyer in the Madura Strait with many lives lost.", "start": 186.2, "duration": 9.72}, {"text": "The only way to make it out alive was to come up with a creative idea.", "start": 197.08, "duration": 3.62}, {"text": "The idea? To turn the ship into a tropical island.", "start": 201.4, "duration": 3.29}, {"text": "The captain ordered the crew to get to work.", "start": 205.87, "duration": 2.24}, {"text": "They cut down trees and branches to camouflage the ship to look like a jungle canopy,", "start": 209.17, "duration": 4.819}, {"text": "and painted the hull to look like rocks.", "start": 215.17, "duration": 2.029}, {"text": "All 184 feet of the ship had to be covered to convey the deception.", "start": 219.1, "duration": 5.179}, {"text": "Because the enemy was nearby, the Dutch crew couldn't risk them spotting a moving island.", "start": 224.8, "duration": 4.909}, {"text": "So they only moved under the cover of night, moving from island to island", "start": 229.959, "duration": 3.53}, {"text": "anchoring close during the daylight to blend in so the Japanese wouldn't notice them.", "start": 233.92, "duration": 4.069}, {"text": "For eight days, the HNLMS Abraham Crijnssen and her crew", "start": 238.84, "duration": 3.963}, {"text": "sneaked past the Japanese ships and aircraft and reached Fremantle, Western Australia, on March 20th, 1942;", "start": 242.803, "duration": 7.557}, {"text": "the only minesweeper of the four to make it out, and the last vessel to successfully escape from Java.", "start": 250.68, "duration": 5.96}, {"text": "The HNLMS Abraham Crijnssen's service did not end there", "start": 257.44, "duration": 3.769}, {"text": "however, once the minesweeper arrives in Australian waters", "start": 261.209, "duration": 3.06}, {"text": "It was commissioned into the Royal Australian Navy as an anti-submarine convoy escort vessel", "start": 264.28, "duration": 5.3}, {"text": "It's Dutch crew were joined by British survivors of HMS Jupiter and Australian personnel", "start": 270.22, "duration": 5.36}, {"text": "This led to a small feud as the Dutch and British both", "start": 275.74, "duration": 3.02}, {"text": "Insisted that a portrait of their monarch should hang from the officers mess hall as was tradition", "start": 279.01, "duration": 4.459}, {"text": "Eventually, it was decided that Queen Wilhelmina of the Netherlands would stay up instead of King George the sixth of the United Kingdom", "start": 284.83, "duration": 6.289}, {"text": "Once again, thank you to our sponsor World of Warships for sponsoring this episode.", "start": 293.29, "duration": 4.22}, {"text": "Click the link below to play World of Warships and collect an exclusive bonus starter pack.", "start": 297.88, "duration": 4.911}, {"text": "New players can register with the code PLAYLANGLEY2019 to receive", "start": 302.8, "duration": 4.5}, {"text": "300 doubloons, one million credits, the USS Langley premium aircraft carrier, three days of premium time, and more.", "start": 307.3, "duration": 6.799}]