[{"text": "Drew, what are you doing? Uh nothing. Oh hey babe, it's just you. Look, I'm testing out my new life hack.", "start": 1.5, "duration": 5.06}, {"text": "You know how I always come home, and my hands are full so I can't unlock the door.", "start": 6.569, "duration": 4.08}, {"text": "Now I don't even have to set anything down cuz my key is on my face. Check it out.", "start": 10.649, "duration": 3.651}, {"text": "A little tricky.", "start": 16.94, "duration": 0.7}, {"text": "Almost got it though.", "start": 17.64, "duration": 1.12}, {"text": "Okay, so you know how I always forget to water our plants", "start": 18.8, "duration": 2.14}, {"text": "because of my whole severe childhood brain injury?", "start": 20.94, "duration": 2.22}, {"text": "Yeah, well now I don't have to remember cuz check this out", "start": 23.36, "duration": 1.96}, {"text": "I put the plants in the sink with the water always running and that way-", "start": 25.38, "duration": 4.6}, {"text": "Great going babe, now they're gonna die", "start": 31.78, "duration": 1.74}, {"text": "Ugh, do you know how it's such a pain in the ass to come all the way over here just to turn a light on?", "start": 33.72, "duration": 4.5}, {"text": "Well, that's why I invented this, check it out.", "start": 38.32, "duration": 3.38}, {"text": "I call it the Electricity Toggle™", "start": 41.84, "duration": 2.42}, {"text": "Electricity Toggle™?", "start": 46.76, "duration": 1.38}, {"text": "NO I-", "start": 50.78, "duration": 0.78}, {"text": "I forgot my password.", "start": 53.98, "duration": 1.06}, {"text": "That was close. Almost had it that time.", "start": 55.04, "duration": 2.24}, {"text": "Almost had it that time.", "start": 58.3, "duration": 1.22}, {"text": "*drew reflecting on his life choices*", "start": 60.32, "duration": 1.34}, {"text": "Hey babe, uh, you know how I'm always spilling coffee on myself?", "start": 65.34, "duration": 2.56}, {"text": "Yeah, well now you don't have to. Check it out.", "start": 69.62, "duration": 1.88}, {"text": "No stains!", "start": 74.12, "duration": 1.4}, {"text": "I guess my prized life hack is now obsolete", "start": 75.52, "duration": 2.42}, {"text": "See look I attached the tape measure to the toaster", "start": 78.86, "duration": 2.94}, {"text": "so we'd always know how long the toaster is.", "start": 81.92, "duration": 2.88}, {"text": "Ever since I was 12, you just point your camera at something and it tells you how long it is.", "start": 84.8, "duration": 3.72}, {"text": "Kind of makes me regret how much money I spent on tape measurers.", "start": 88.52, "duration": 3.32}, {"text": "So close babe, I can feel it", "start": 91.84, "duration": 1.86}, {"text": "Fine. You know, you have no respects for my life hacks", "start": 97.46, "duration": 3.1}, {"text": "It's the wrong key", "start": 101.64, "duration": 2.0}, {"text": "babe wait", "start": 103.8, "duration": 1.29}, {"text": "Babe, if you leave then how did we get all those other shots?", "start": 105.09, "duration": 4.07}, {"text": "Eh true", "start": 109.64, "duration": 0.68}, {"text": "Yeah, that's what I thought. Hey, I'm gonna go in through the window.", "start": 110.36, "duration": 2.72}, {"text": "Hey guy, welcome back to no!", "start": 113.76, "duration": 1.84}, {"text": "Today we're gonna be talking about life hacks.", "start": 116.66, "duration": 1.76}, {"text": "It's been a while, since I've attempted to tackle these online monstrosities", "start": 118.42, "duration": 3.54}, {"text": "It's been about nine months, actually, and the main reason for the long break", "start": 121.96, "duration": 3.64}, {"text": "was simply with all the dumbass life hacks I've seen in my life", "start": 125.6, "duration": 4.02}, {"text": "I thought I had simply seen the worst of the worst", "start": 129.62, "duration": 2.76}, {"text": "I thought I had seen it all and there's no way that I could ever see anything worse", "start": 132.38, "duration": 5.91}, {"text": "And then I saw this", "start": 139.14, "duration": 1.78}, {"text": "No!", "start": 145.4, "duration": 0.6}, {"text": "Stop that! You stop that right now young man. Nobody asked for this, it's just stupid", "start": 146.62, "duration": 6.1}, {"text": "Who thought this would be a good idea?", "start": 153.56, "duration": 2.0}, {"text": "No, no", "start": 156.72, "duration": 1.72}, {"text": "What the fuck?", "start": 158.72, "duration": 1.22}, {"text": "Just crack that egg normally", "start": 160.54, "duration": 1.64}, {"text": "And that's when I knew it was time for me to come out of retirement", "start": 162.7, "duration": 3.72}, {"text": "As the unofficial YouTube life hack narc and crack down on this bullshit", "start": 166.42, "duration": 4.2}, {"text": "The same way that this guy cracked an egg all over his hands", "start": 170.62, "duration": 3.16}, {"text": "It's time to stop making life hacks, please for the love of God", "start": 173.79, "duration": 5.069}, {"text": "I'm begging you. But first, today's video sponsored by SeatGeek. It's a app!", "start": 178.86, "duration": 5.28}, {"text": "Tired of paying too much money for bad seats? *Booo*", "start": 184.14, "duration": 2.2}, {"text": "Well, not anymore with the SeatGeek app", "start": 186.6, "duration": 2.92}, {"text": "Whether you go to the big game, the small game, the medium game or a concert", "start": 189.52, "duration": 3.26}, {"text": "They've got a scoring system for every seat so, you know you're getting a good deal", "start": 192.92, "duration": 3.12}, {"text": "It'll show you a picture of what your view from that seat will look like and you can save", "start": 196.04, "duration": 3.52}, {"text": "$20 off your first purchase by using promo code: DREW No pressure or anything, but all the cool kids doing it", "start": 199.7, "duration": 6.76}, {"text": "So to recap, link in description, promo code DREW. It's a app. Now back to what I was doing", "start": 207.12, "duration": 5.38}, {"text": "Uh huh", "start": 214.42, "duration": 0.94}, {"text": "Ok", "start": 215.82, "duration": 0.5}, {"text": "Yeah alright", "start": 216.32, "duration": 2.0}, {"text": "Yeah, I don't think that actually happened. I'm gonna say no", "start": 225.3, "duration": 3.34}, {"text": "Crazy is the exact right word for that cause that's probably the stupidest thing I've ever seen in my life", "start": 235.9, "duration": 5.78}, {"text": "This one's actually pretty cool", "start": 241.71, "duration": 1.14}, {"text": "You can take any regular bottle at all and turn it into a squeeze bottle,", "start": 242.85, "duration": 3.65}, {"text": "which makes squeezing out things like mustard, super convenient", "start": 246.5, "duration": 2.66}, {"text": "So first things first, you gonna want to take your mustard and go ahead and squeeze it all ... out", "start": 249.24, "duration": 5.18}, {"text": "Wait a minute", "start": 254.42, "duration": 1.32}, {"text": "Perfect circle? It looks like shit. Yeah, I'm not even gonna watch this one", "start": 262.32, "duration": 6.58}, {"text": "Damnit kids. You left your toys all over the place. Now I have to individually pick them up one by one.", "start": 273.64, "duration": 5.66}, {"text": "Wait a second", "start": 279.3, "duration": 0.84}, {"text": "I have a snow shovel. Now, I can scoop them up in larger quantities.", "start": 280.14, "duration": 5.5}, {"text": "Don't let this happen, alright look very carefully at this and make sure this doesn't happen", "start": 285.64, "duration": 5.44}, {"text": "Okay, if you set your valuables out in the open on your towel and then walk away within three seconds", "start": 291.08, "duration": 5.47}, {"text": "Someone's gonna come up and steal them. Don't let this happen guys. Here's what you should do,", "start": 296.55, "duration": 4.11}, {"text": "First things first, you're gonna need a diaper", "start": 300.66, "duration": 2.16}, {"text": "Wait, what? Then you put chocolate in the diaper. It will melt looks like poopoo and then", "start": 302.82, "duration": 5.8}, {"text": "No one's gonna want to steal that, because it looks like a poopy diaper", "start": 308.62, "duration": 2.98}, {"text": "You know as ridiculous as that is, that might actually be the most helpful life hack we've watched so far.", "start": 311.6, "duration": 6.14}, {"text": "I love this", "start": 318.14, "duration": 0.64}, {"text": "I love this so much. I love it!", "start": 318.78, "duration": 2.52}, {"text": "What is it with life hack channels and eggs? Like they seem so obsessed with repurposing eggs", "start": 329.26, "duration": 5.8}, {"text": "In as many ways as possible", "start": 335.06, "duration": 1.36}, {"text": "Just use it as an egg. Oh, now it's a strawberry", "start": 336.42, "duration": 4.0}, {"text": "Okay. So this life hack is if you plant seeds and then water them and nourish them", "start": 340.78, "duration": 6.36}, {"text": "And the way that you would with seeds", "start": 347.14, "duration": 1.36}, {"text": "It will grow into the thing that the seed came from. That's not a life hack. That's just science", "start": 348.5, "duration": 5.14}, {"text": "This channel just discovered plants", "start": 353.71, "duration": 2.389}, {"text": "This whole video is them just planting different fruits and saying how if you put them in soil and water them", "start": 356.1, "duration": 6.78}, {"text": "And leave them in sunlight for a couple weeks. They'll grow into something", "start": 362.88, "duration": 3.3}, {"text": "This video would have been really helpful like eight hundred years ago, not so much now", "start": 366.24, "duration": 5.58}, {"text": "One of my favorite things about life hack Instagram accounts are how aggressive the captions are", "start": 371.82, "duration": 4.64}, {"text": "Try this now, don't let this happen, you need to do these. Fine, you don't have to yell at me.", "start": 376.48, "duration": 6.12}, {"text": "I'll try this, let's see what it is. Alright, holding the pants. What's next? What's the solution here?", "start": 382.62, "duration": 4.94}, {"text": "Staple, okay, you're gonna stable the pans and", "start": 388.2, "duration": 3.62}, {"text": "That is it. That's the whole life hack. If you're like me you were probably expecting", "start": 392.1, "duration": 4.98}, {"text": "something else but the whole life hack is that", "start": 397.48, "duration": 2.64}, {"text": "You just staple your pants together, never would have thought of that one myself", "start": 400.12, "duration": 3.66}, {"text": "Alright, now I don't know what this one is, but it's from five minute crafts", "start": 403.78, "duration": 3.68}, {"text": "So we know it's gonna be quick and easy and it has something to do with this Barbie", "start": 407.46, "duration": 3.54}, {"text": "So just keep that in mind, five minute crafts", "start": 411.0, "duration": 1.83}, {"text": "This is going to be very simple and easy and you'll be able to do it yourself.", "start": 412.83, "duration": 4.15}, {"text": "Okay, so, put the hair- oh, that seems like it's gonna take a while. I don't know. You're just doing one by one-", "start": 417.16, "duration": 6.58}, {"text": "Oh, never mind. They're done. Okay, they're done", "start": 423.74, "duration": 1.84}, {"text": "How did the ring even get that dirty in the first place? I assume he just bought it", "start": 433.2, "duration": 5.46}, {"text": "What i- was he doing with it? Hi, here is all of the money I have in exchange for one piece of jewelry", "start": 439.18, "duration": 5.989}, {"text": "Because that's just tradition. For some reason. I'm gonna take this home and take really good care of it", "start": 445.24, "duration": 5.089}, {"text": "Thank you, and then he gets home and like leaves it in ketchup for two months", "start": 450.33, "duration": 3.899}, {"text": "How, how did this happen? Any kids out there watching?", "start": 454.229, "duration": 3.27}, {"text": "I'm gonna need to respectfully ask you guys to look away from the screen at this point", "start": 457.5, "duration": 3.92}, {"text": "As the following hacks are only for adults", "start": 461.42, "duration": 2.82}, {"text": "Wait a minute, what? Hey guys", "start": 465.78, "duration": 2.1}, {"text": "Uughe boobs! Boobs!", "start": 467.88, "duration": 2.16}, {"text": "Get those boobs away from me and she looks like so apologetic at the end", "start": 470.04, "duration": 4.68}, {"text": "Oh, sorry about my boobs guys, but there's a solution if you do all this bullshit", "start": 474.72, "duration": 5.339}, {"text": "Then you can hide your boobs and your friends will accept you for who you are finally", "start": 480.16, "duration": 4.48}, {"text": "Ok I can't even pay attention to what's happening cause the song is so awful", "start": 490.04, "duration": 4.12}, {"text": "Trying to put your cutting board down, but your other cutting board is in the way, open a drawer dumbass", "start": 495.12, "duration": 6.18}, {"text": "now this is actually a pretty cool drawer life hack where they're teaching you how to add a", "start": 501.3, "duration": 4.96}, {"text": "secret compartment within a drawer so you can hide stuff under it,", "start": 506.44, "duration": 3.72}, {"text": "But as much as this looks like a perfect way to hide weed from your parents", "start": 510.16, "duration": 3.26}, {"text": "Do not hide drugs. Hide a surprise gift, hide a secret project, hide your feelings. Don't hide drugs.", "start": 513.42, "duration": 7.26}, {"text": "This is nuts!", "start": 520.68, "duration": 0.88}, {"text": "Man, I want to watch this video so bad and figure out how to make that orange popsicle", "start": 521.56, "duration": 4.54}, {"text": "But I have to respect the rules of No Nut November and save this for December first.", "start": 526.1, "duration": 3.96}, {"text": "Ah, finally. These should be good, these are the best life hacks", "start": 530.06, "duration": 3.42}, {"text": "What the fuck?! Slow down", "start": 537.7, "duration": 2.5}, {"text": "What is happening right now? Here's a good one. I think we've all been in the situation before", "start": 540.2, "duration": 4.48}, {"text": "Um, everyone has a tendency to put on some pounds from time to time", "start": 544.68, "duration": 2.88}, {"text": "And you go to put on some pants that you've had for awhile", "start": 547.56, "duration": 2.46}, {"text": "And they don't fit anymore, but not to worry, five minute crafts has the solution", "start": 550.02, "duration": 4.26}, {"text": "Spray a bunch of water on your pants and and now you'll be able to get them on.", "start": 554.82, "duration": 3.92}, {"text": "Sure your pants are now soaking wet, right in the crotch area, but at least you're wearing them", "start": 558.74, "duration": 4.62}, {"text": "I imagine this woman has been like struggling with her pants for a while and because of it", "start": 563.4, "duration": 3.599}, {"text": "She's running late for work and then she gets to work with wet pants. Employees, listen up", "start": 567.0, "duration": 5.64}, {"text": "All right, this company made way too much money this past quarter", "start": 572.67, "duration": 3.659}, {"text": "Now if anybody has any ideas on how we get that number down, I'm all ears.", "start": 576.329, "duration": 5.111}, {"text": "All right. I actually propose we-", "start": 581.44, "duration": 1.62}, {"text": "So sorry, I'm late guys I ran into a little bit of an issue this morning, not to worry though. It has been resolved", "start": 584.4, "duration": 6.66}, {"text": "Everything okay? Your pants are soaking wet. Huh? Yeah, they are", "start": 591.06, "duration": 5.5}, {"text": "Well guy that's gonna do for today's video, thank you so much for watching it", "start": 606.16, "duration": 2.46}, {"text": "Um, I forgot to film an outro before getting a haircut. So kind of a big continuity error there", "start": 609.24, "duration": 6.32}, {"text": "Anyway, I've got a ton of work to do so, I'm gonna-", "start": 615.56, "duration": 2.38}, {"text": "I'm gonna get back to doing the- doing work and being productive", "start": 619.84, "duration": 4.28}, {"text": "So I will see you guys in the next video. Remember like, subscribe and uh- if you wanna support the channel", "start": 624.12, "duration": 4.7}, {"text": "SeatGeek, thanks again for sponsoring, promo code DREW $20 off, free app and it is a app I checked.", "start": 628.82, "duration": 6.24}, {"text": "It's almost Thanksgiving so remember to be thankful for everything and kiss all of your family on the lips", "start": 635.06, "duration": 5.96}, {"text": "See you next time", "start": 641.58, "duration": 2.0}]