[{"text": "This video is sponsored by Squarespace.", "start": 0.68, "duration": 3.04}, {"text": "It’s late October of the year 898.", "start": 5.62, "duration": 3.06}, {"text": "A couple of hundred light riders roam through the Lombardian countryside plundering crops and valuables.", "start": 8.88, "duration": 5.74}, {"text": "Their distinct clothing, scant leather armour, and extraordinary equestrian skills,", "start": 14.88, "duration": 4.56}, {"text": "most notably their proficiency at horse archery, brings both the fear and attention of the local nobility.", "start": 19.44, "duration": 6.1}, {"text": "A new era in warfare within Europe has just begun.", "start": 25.88, "duration": 3.6}, {"text": "It is late autumn of the year 898.", "start": 41.26, "duration": 3.54}, {"text": "After twelve years of political games, armed conflicts and fortuitous deaths,", "start": 45.12, "duration": 4.98}, {"text": "margrave Berengar of Friuli enters the city of Pavia, bearing the Iron Crown of Lombardy upon his head.", "start": 50.34, "duration": 7.76}, {"text": "From that moment he became the sole, uncontested ruler of the Kingdom of Italy.", "start": 58.5, "duration": 5.08}, {"text": "Berengar’s success was possible thanks to the death of Ratold,", "start": 63.8, "duration": 3.82}, {"text": "illegitimate son of Arnulf, King of East Francia and Holy Roman Emperor, who had sent his son to rule Italy in his stead.", "start": 67.76, "duration": 8.84}, {"text": "Upon hearing the news of Berengar’s coronation, Arnulf considered reclaiming the lost kingdom.", "start": 76.88, "duration": 5.28}, {"text": "In truth, consideration was about the most Arnulf was capable of in late 898,", "start": 82.28, "duration": 5.52}, {"text": "due to the recent stroke he had suffered.", "start": 87.94, "duration": 2.1}, {"text": "Not to mention the plethora of other medical conditions that plagued his attempts to effectively rule his own domain,", "start": 90.04, "duration": 6.04}, {"text": "let alone attend to matters of foreign affairs.", "start": 96.08, "duration": 3.14}, {"text": "Berengar was well aware of this, and plotted against Arnulf,", "start": 99.56, "duration": 3.52}, {"text": "whom he deemed unworthy of the imperial title and saw himself as a better fit on the imperial throne,", "start": 103.34, "duration": 6.76}, {"text": "being the legitimate descendant of Charlemagne on his mother’s side.", "start": 110.1, "duration": 4.62}, {"text": "Yet Berengar had to put his high hopes aside at least for a while,", "start": 115.08, "duration": 3.72}, {"text": "as his newly acquired kingdom was riddled with problems.", "start": 118.8, "duration": 4.02}, {"text": "Apart from weak central authority, Berengar was concerned over groups of light riders, roaming freely across the Padan Plain,", "start": 123.06, "duration": 7.9}, {"text": "deftly avoiding bigger cities and fortifications.", "start": 130.96, "duration": 3.48}, {"text": "They seemed to be gone by the beginning of winter, but at least Berengar learned of the origin of these unwanted guests.", "start": 134.68, "duration": 6.74}, {"text": "His scouts reported that they were Magyars, a semi-nomadic people that recently crossed the Carpathian Mountains and occupied the Pannonian Basin,", "start": 141.68, "duration": 9.74}, {"text": "causing disturbances within Great Moravia and the frontier marches of East Francia.", "start": 151.42, "duration": 6.36}, {"text": "While their true goals in Italy are the subject of debate, as they had never been seen in the region before, it is plausible,", "start": 158.08, "duration": 7.36}, {"text": "that some of the Magyar chieftains were allied to Arnulf, who sought military assistance against Berengar’s rule in Italy.", "start": 165.44, "duration": 7.56}, {"text": "Unbeknownst to Berengar, these seemingly inconsequential raids were in fact thorough reconnaissance of his domain by the Hungarian riders,", "start": 173.36, "duration": 8.84}, {"text": "who attained invaluable details of the populace, landscape, strongpoints, composition of enemy troops and even possible battlefields.", "start": 182.32, "duration": 9.36}, {"text": "In late spring of 899, when Berengar was deeply embroiled in domestic disputes,", "start": 192.38, "duration": 5.36}, {"text": "a substantial Magyar force, consisting of around 5,000 riders rode around the fortified city of Aquileia unhindered", "start": 198.28, "duration": 8.04}, {"text": "and entered Northern Italy, raiding the countryside and attacking any undefended town or settlement.", "start": 206.38, "duration": 6.62}, {"text": "Upon hearing the dreadful news, King Berengar, though undoubtedly surprised by the invasion,", "start": 213.18, "duration": 5.84}, {"text": "remained level-headed and requested all his subjects to provide military support to repel the invaders.", "start": 219.1, "duration": 6.92}, {"text": "Despite his relatively weak position,", "start": 226.24, "duration": 2.48}, {"text": "the response of his retainers was swift and in unity. In the matter of a few months Berengar was able to amass a 15,000 strong army,", "start": 228.72, "duration": 9.72}, {"text": "determined to push back the enemy.", "start": 238.44, "duration": 2.8}, {"text": "These numbers alone gave Berengar a solid boost to his already bolstered confidence which, perhaps,", "start": 241.46, "duration": 6.72}, {"text": "lead to the Hungarian invaders not being confronted immediately after the Italian army was assembled.", "start": 248.18, "duration": 6.62}, {"text": "The role of underdog played well for the Magyar leaders, who had enough time to cease their plunder and gather at a meeting point in unison,", "start": 255.2, "duration": 8.12}, {"text": "luring the Italian army to attack them.", "start": 263.38, "duration": 2.9}, {"text": "But as soon as Berengar’s troops closed their distance to the Hungarian’s position,", "start": 266.7, "duration": 4.4}, {"text": "the Magyars evaded battle, riding to the East.", "start": 271.1, "duration": 3.8}, {"text": "This was a relatively easy ploy as Italian heavy cavalry, supplemented by infantry units,", "start": 275.32, "duration": 6.42}, {"text": "was simply not as manoeuvrable as the Hungarian light mounted units.", "start": 281.74, "duration": 4.76}, {"text": "Moving in such a pattern, both armies eventually reached their first major obstacle – the river Brenta.", "start": 286.74, "duration": 7.42}, {"text": "The Magyar units, though visibly tired,", "start": 294.56, "duration": 2.58}, {"text": "managed to swiftly cross the river and set a camp on the Eastern side to feast and replenish their energy.", "start": 297.22, "duration": 6.96}, {"text": "By this time, Berengar was growing frustrated, following an enemy who constantly refused to engage in battle,", "start": 305.0, "duration": 6.78}, {"text": "but at least he had all of the invaders in one place.", "start": 311.78, "duration": 3.9}, {"text": "Upon reaching the river, he ordered to pitch tents on the Western side,", "start": 315.94, "duration": 4.1}, {"text": "as crossing the river post-haste with his heavy units was deemed unwise and risky.", "start": 320.16, "duration": 5.72}, {"text": "Soon Berengar received Hungarian envoys, who pleaded mercy and agreed to leave Italy,", "start": 326.28, "duration": 5.98}, {"text": "though it was quite obvious that Berengar was in no mood to spare them his retribution,", "start": 332.26, "duration": 4.86}, {"text": "given the recent desolation of his lands by the Magyars.", "start": 337.12, "duration": 3.88}, {"text": "These talks unsurprisingly led nowhere, but the Magyars had their own intentions", "start": 341.1, "duration": 5.94}, {"text": "to buy time and foster a low level of vigilance among Berengar’s ranks.", "start": 347.04, "duration": 5.66}, {"text": "This they achieved, as for the next couple of days, unthreatened by their enemy,", "start": 353.04, "duration": 5.0}, {"text": "the Italian troops relaxed within the camp falling into drinking and feasting.", "start": 358.1, "duration": 4.42}, {"text": "But the heady times were to be soberly cut short.", "start": 362.52, "duration": 3.78}, {"text": "On the morning of the 24th of September, Berengar’s army was slowly rousing, grooming horses and preparing first meals.", "start": 367.1, "duration": 7.9}, {"text": "Strangely enough, the Hungarian camp on the other side of the river was not as busy as usual.", "start": 375.3, "duration": 5.5}, {"text": "But before anyone in the Italian camp could realise the terrible truth, the river valley trembled with the sound of thousands of hoofbeats,", "start": 380.94, "duration": 7.98}, {"text": "as the Magyar light cavalry appeared on all sides and rushed to attack the camp.", "start": 389.08, "duration": 5.48}, {"text": "During the night, the majority of the Hungarian cavalry left the camp", "start": 395.04, "duration": 4.66}, {"text": "and crossed the Brenta river through fords away from Berengar’s eyes and launched a bold attack from all sides.", "start": 399.7, "duration": 8.44}, {"text": "A rain of arrows, released in full gallop fell upon the disorientated men in the camp.", "start": 408.34, "duration": 5.78}, {"text": "Though Berengar’s encampment was well fortified,", "start": 414.56, "duration": 2.92}, {"text": "almost no one was able to reach their positions in time to mount any kind of defence against the Magyar storm.", "start": 417.68, "duration": 7.0}, {"text": "Soon, more and more Hungarian riders broke into the camp, slaughtering every man unable to flee or hide.", "start": 425.12, "duration": 8.0}, {"text": "The only reasonable decision for any defender to make, in such a position, was to run as fast as they could.", "start": 433.34, "duration": 6.88}, {"text": "In less than a matter of an hour several thousand of Berengar’s men lay dead, mercilessly killed by the Magyars.", "start": 440.4, "duration": 7.76}, {"text": "It was an utter disaster for Berengar,", "start": 448.66, "duration": 2.14}, {"text": "who managed to narrowly escape the bloodshed by disguising himself as an ordinary soldier and fleeing to safety.", "start": 450.8, "duration": 7.2}, {"text": "He was the first European ruler to experience a new type of warfare brought from the East by the Hungarians,", "start": 458.48, "duration": 7.62}, {"text": "who excelled in horse archery, ambushes, feigned retreats and the art of deception.", "start": 466.22, "duration": 6.34}, {"text": "In the wake of the battle, the entire North of Italy was at the mercy of the Hungarian chieftains,", "start": 472.82, "duration": 5.76}, {"text": "who decided to spent the mild winter there, attacking undefended towns and monasteries,", "start": 478.88, "duration": 4.64}, {"text": "taking a great toll on the Italian economy.", "start": 483.52, "duration": 3.48}, {"text": "Upon their departure in the spring of the year 900, the Magyars signed a peace treaty with Berengar,", "start": 487.54, "duration": 6.6}, {"text": "who agreed to pay a yearly tribute in exchange for the raids to abate.", "start": 494.24, "duration": 5.26}, {"text": "Though the Hungarians wreaked havoc throughout Europe for the next fifty years,", "start": 499.72, "duration": 4.52}, {"text": "Berengar quickly learned from his mistakes, conceding to the military prowess of his erstwhile enemies,", "start": 504.32, "duration": 6.98}, {"text": "and wisely using the Magyars to help in his upcoming struggle for the imperial throne.", "start": 511.38, "duration": 6.7}, {"text": "This video is sponsored by SquareSpace.", "start": 521.04, "duration": 2.72}, {"text": "Need an all-in-one platform to build awesome websites with tons functionality, then SquareSpace is what you’re after.", "start": 523.9, "duration": 6.52}, {"text": "With great features such as:", "start": 530.44, "duration": 1.24}, {"text": "Vibrant and versatile design via Modern Templates, meaning that your site will look amazing on any browser or device.", "start": 531.68, "duration": 6.56}, {"text": "Template Switching so if there’s more than one template that you like you can incorporate many into one site.", "start": 538.38, "duration": 6.12}, {"text": "And let’s not forget the most powerful weapon in your SquareSpace arsenal, the Integrated Analytics providing detailed reports on your sites activities.", "start": 544.76, "duration": 8.7}, {"text": "Click on the link in the discretion below, visit squarespace.com/bazbattles and not only will you be supporting our channel but you will save 10% on your first site-content purchase.", "start": 553.46, "duration": 10.74}, {"text": "Building a web presence is made easy thanks to SquareSpace!", "start": 564.2, "duration": 4.52}]