[{"text": "You know, I think internet fame is actually good for people these days", "start": 0.06, "duration": 2.76}, {"text": "I think that's a healthy thing for kids to chase after should encourage more kids to only care about internet fame", "start": 2.82, "duration": 4.89}, {"text": "That way we'll be creating lots of healthy well-adjusted young adults to think of it", "start": 7.71, "duration": 3.389}, {"text": "I think everybody should try to be famous. It just makes sense", "start": 11.099, "duration": 2.76}, {"text": "Hi, it's", "start": 15.85, "duration": 2.0}, {"text": "\"Greg\"... if you're watching this video, it means I have", "start": 19.42, "duration": 3.5}, {"text": "100,000 subscribers now", "start": 23.83, "duration": 2.0}, {"text": "that", "start": 26.199, "duration": 1.65}, {"text": "That's a big number. I am a satirist my videos are intentionally dripping with layers and layers of irony", "start": 27.849, "duration": 5.959}, {"text": "But I truly believe that irony is a corrosive force", "start": 33.809, "duration": 3.03}, {"text": "I think that if you live in irony for too long without saying what you mean", "start": 36.84, "duration": 3.869}, {"text": "Then eventually you will corrode yourself. Eventually. You will forget what you stand for what you believe", "start": 40.719, "duration": 5.6}, {"text": "Who you are?", "start": 46.899, "duration": 0.831}, {"text": "So I'm making this video as I do every so often in an attempt to unmask and speak openly and honestly without irony", "start": 47.73, "duration": 6.419}, {"text": "About how my life has been changed forever?", "start": 54.399, "duration": 2.87}, {"text": "from that", "start": 57.82, "duration": 1.559}, {"text": "Number going from 500 to 100,000 subscribers and that's what this video is going to be me being open and honest", "start": 59.379, "duration": 7.099}, {"text": "Haha, just kidding. I'm gonna fuck with you suborned unless I'm not a JK JK", "start": 66.64, "duration": 5.209}, {"text": "Unless in the span of a few months", "start": 72.43, "duration": 2.389}, {"text": "I went from essentially being a nobody to having more subscribers than most of the people I've watched my entire life", "start": 74.82, "duration": 4.379}, {"text": "And I know that when this happens to most people they just don't talk about it", "start": 79.2, "duration": 2.849}, {"text": "Like it's not that big of a deal but for me, it was a huge deal", "start": 82.049, "duration": 2.61}, {"text": "I have no idea how more people don't find this to be a huge deal because for me it was easily the most", "start": 84.659, "duration": 5.279}, {"text": "significant thing that has ever happened to me in my entire life and maybe that's sad and maybe that's not a big deal to most", "start": 90.31, "duration": 5.0}, {"text": "people but for me it is and so I feel like I have to talk about it because now I'm face to face with the", "start": 95.31, "duration": 4.44}, {"text": "Concept that I've been grappling with my entire life a concept. That was the only thing I thought that could make me happy and", "start": 99.75, "duration": 5.849}, {"text": "what I'm grappling with is this I", "start": 106.299, "duration": 2.0}, {"text": "Don't want to be famous part one, but you're not. I'm aware that a hundred thousand YouTube subscribers isn't Fame", "start": 108.759, "duration": 6.68}, {"text": "This isn't a video about me being famous. It's about my relationship with Fame", "start": 115.45, "duration": 5.239}, {"text": "it's about how I perceived it as a kid how I grew to have an unhealthy relationship with it and", "start": 120.729, "duration": 4.76}, {"text": "My thoughts on it now that I have some form of it", "start": 125.74, "duration": 2.84}, {"text": "This is going to be an honest video about me trying to be happy", "start": 128.58, "duration": 3.389}, {"text": "it's also going to be a about the Internet about my fears about my", "start": 132.099, "duration": 5.54}, {"text": "boring check out these four", "start": 138.16, "duration": 2.0}, {"text": "To idolize the first 21 years of my life was characterized by one thing and that is", "start": 141.7, "duration": 6.619}, {"text": "crippling existential horror", "start": 148.93, "duration": 2.0}, {"text": "I'm aware. That's a bullshit thing to complain about", "start": 152.17, "duration": 2.419}, {"text": "I am maybe even hyper aware that that's the case, but I'm going to talk about it anyway", "start": 154.59, "duration": 5.969}, {"text": "because if I'm not even going to take my feelings seriously then I", "start": 160.56, "duration": 4.35}, {"text": "Shouldn't expect anybody else. Do I'm the youngest of four kids and I live in a mid-sized government town called Ottawa", "start": 165.7, "duration": 5.089}, {"text": "I'm the youngest by a fair margin", "start": 170.79, "duration": 1.56}, {"text": "So I got to see the well-trodden path play out quite a few times before it started to become relevant to me", "start": 172.35, "duration": 5.399}, {"text": "They would go off to university study something", "start": 177.75, "duration": 2.37}, {"text": "They were tangentially interested in and then find a job mostly in the government that kind of fit that", "start": 180.12, "duration": 5.219}, {"text": "Study then they would complain about how what they do is meaningless and how their back hurts all the time now for them", "start": 185.53, "duration": 5.54}, {"text": "they ultimately didn't mind that because they had other things they wanted to focus on but for me seeing that made me feel like I", "start": 191.07, "duration": 5.789}, {"text": "Was on a conveyor belt just slowly leading me to my death. I knew myself", "start": 196.86, "duration": 4.59}, {"text": "I knew that that path which worked for them wasn't going to work for me. I'm an artist", "start": 201.49, "duration": 5.479}, {"text": "I need to create art in order to feel good about myself", "start": 206.97, "duration": 3.36}, {"text": "I'm never going to be happy spending eight hours a day doing something", "start": 210.64, "duration": 3.229}, {"text": "I'm not passionate about so from a very young age", "start": 213.87, "duration": 2.279}, {"text": "I felt that the well-trodden path for most people was death for me", "start": 216.16, "duration": 3.889}, {"text": "And I'm not exaggerating when I say that there was not a day that went by that", "start": 220.05, "duration": 3.449}, {"text": "I wasn't uh Turley crushingly depressed by that fact, you really should have called this video", "start": 223.54, "duration": 5.179}, {"text": "I'm a loser who can't cope with basic first world problem", "start": 228.72, "duration": 3.24}, {"text": "I did not want to go down the path that was laid out for me with every fiber of my being", "start": 231.96, "duration": 4.74}, {"text": "It wasn't a first world problem. I didn't see any value in living and you do now. Holy shit", "start": 236.86, "duration": 6.56}, {"text": "I mean whatever delusion floats your boat", "start": 243.42, "duration": 2.459}, {"text": "I would do internships through my program and I hated it", "start": 245.88, "duration": 4.32}, {"text": "I hated how people talked to each other and pretended like they were interested in what they were saying", "start": 250.2, "duration": 5.789}, {"text": "Hey, did you know we're gonna start that new project in a couple of weeks Wow", "start": 255.99, "duration": 3.27}, {"text": "I can't wait to start that new project in a couple of weeks. Yeah me neither", "start": 259.29, "duration": 3.299}, {"text": "Yeah, haha", "start": 263.53, "duration": 1.97}, {"text": "Does your back hurt all the time?", "start": 265.5, "duration": 2.209}, {"text": "I didn't want to complain because I didn't feel like I had anything worth complaining about I could always do art on the side", "start": 267.71, "duration": 7.2}, {"text": "I put my mind to trying to escape that path and I got nothing. I had no plans to escape", "start": 274.91, "duration": 6.48}, {"text": "I was always going to make art on the side and just work my job and cross my fingers and hope something happened it was", "start": 281.39, "duration": 6.029}, {"text": "A deeply isolating and depressing experience in my town", "start": 287.42, "duration": 3.599}, {"text": "I knew very very very few people who could relate to the kind of dread that I was feeling I", "start": 291.02, "duration": 5.61}, {"text": "Remember being deeply envious of the people who couldn't relate to my despair", "start": 297.15, "duration": 4.52}, {"text": "I remember wanting to rip the need to create art out of my body and just letting it die", "start": 301.67, "duration": 5.91}, {"text": "so I could be like them but at this dark time in my life, there was always one concept that was keeping me going a", "start": 307.92, "duration": 7.099}, {"text": "concept that", "start": 315.84, "duration": 1.26}, {"text": "made me feel like if I got it then all that angst and dread and sorrow would just go away and", "start": 317.1, "duration": 6.799}, {"text": "The concept was Fame part 3 the me of one year ago would fucking gouge", "start": 324.18, "duration": 5.09}, {"text": "Somebody's eyes out to be where I am right now. I maybe", "start": 329.46, "duration": 3.14}, {"text": "Maybe might have had a slightly unhealthy relationship with Fame", "start": 333.84, "duration": 4.01}, {"text": "I wanted to be famous so fucking badly", "start": 337.85, "duration": 3.6}, {"text": "but it was an impotent kind of once because I really didn't know what to do to get it when I was 13 I had", "start": 341.45, "duration": 5.759}, {"text": "Ridden, all these notes to my 15 year old self being like if you're not famous by now", "start": 347.21, "duration": 4.77}, {"text": "you're a failure of a person and", "start": 352.35, "duration": 2.059}, {"text": "That wasn't a good idea cuz year and year went by and I just felt more and more like a failure the thing with depression", "start": 354.81, "duration": 6.32}, {"text": "is a", "start": 361.29, "duration": 1.71}, {"text": "Lot of the time it's caused by", "start": 363.0, "duration": 2.0}, {"text": "rigidity of mindset you", "start": 365.61, "duration": 2.0}, {"text": "marry yourself to a", "start": 367.919, "duration": 1.951}, {"text": "person or an idea or an idea of a person and then when that idea leaves you or becomes impossible to achieve or", "start": 369.87, "duration": 6.86}, {"text": "Just dissipates in some other way", "start": 377.49, "duration": 1.79}, {"text": "Then you fall into a depression", "start": 379.28, "duration": 1.69}, {"text": "Almost like your entire life was a performance for that one thing and now that you can't get that one thing", "start": 380.97, "duration": 6.139}, {"text": "It's like you're performing for nobody", "start": 387.11, "duration": 2.58}, {"text": "So why bother?", "start": 389.69, "duration": 1.24}, {"text": "ever since I was a kid doing art people told me that I would be famous one day and that idea really stuck in my", "start": 390.93, "duration": 5.84}, {"text": "Head so that all the art that I did was to be famous over the years as I continued to be a nobody", "start": 396.77, "duration": 7.499}, {"text": "I", "start": 404.27, "duration": 0.609}, {"text": "Started to realize that I was never going to get what I wanted and as that ideal that I was performing for", "start": 404.879, "duration": 5.089}, {"text": "Became more and more distant. I started to become sadder and sadder and as I got sadder and sadder I started", "start": 410.039, "duration": 7.22}, {"text": "To feel like I wasn't good enough and I heard this voice", "start": 418.229, "duration": 3.649}, {"text": "Just repeating all the things that I already knew", "start": 423.15, "duration": 2.539}, {"text": "That I was never going to get anywhere that I was never going to be happy", "start": 426.419, "duration": 4.07}, {"text": "Because the only thing that could make me happy", "start": 431.669, "duration": 2.0}, {"text": "Was Fame I heard that voice. Sometimes I heard it a lot. Actually I", "start": 434.49, "duration": 6.559}, {"text": "Heard it", "start": 441.87, "duration": 2.0}, {"text": "part for all", "start": 444.0, "duration": 1.86}, {"text": "Consuming jealousy. I had no positive inspirations", "start": 445.86, "duration": 3.26}, {"text": "There wasn't anybody that was more successful than me that I liked", "start": 449.12, "duration": 3.509}, {"text": "The only people who were more successful than me were people that I hated it made it impossible", "start": 453.029, "duration": 4.43}, {"text": "for me to really like or love any specific artist because all I could think about was how I", "start": 457.71, "duration": 5.389}, {"text": "Wanted to take their place people would ask me Oh, what artists do you like?", "start": 463.229, "duration": 3.649}, {"text": "Who do you take inspiration from and all I would think about it's just all the fuckers. I wanted to overtake all the people", "start": 466.879, "duration": 6.959}, {"text": "I hated all the people. I thought I could do better than it made me very bitter and resentful", "start": 473.839, "duration": 4.11}, {"text": "I noticed you're speaking in the past tense to distract from the fact that nothing has changed. Yeah, you got it, buddy", "start": 477.949, "duration": 5.639}, {"text": "I actually have a list of people who I was just furious with whenever I saw them on, you know", "start": 483.589, "duration": 6.03}, {"text": "social media or something or that the saw video of theirs go viral, I would just be", "start": 489.839, "duration": 4.64}, {"text": "Seething essentially because they were doing something in a field that I wanted to do that same thing in and they were infinitely more successful", "start": 495.21, "duration": 7.22}, {"text": "Than me", "start": 502.43, "duration": 1.12}, {"text": "Now I'm not actually gonna like read off the list because that would be extremely", "start": 503.55, "duration": 3.889}, {"text": "Self-destructive and damaging but Savannah Brown rupee core Bo Burnham L of the mills", "start": 507.689, "duration": 5.209}, {"text": "Why is L of the mills on here her her contents? Not even remotely similar to yours. She was from my town", "start": 513.18, "duration": 5.63}, {"text": "Yeah", "start": 518.81, "duration": 0.24}, {"text": "But she had like a super public mental breakdown that was supposed to be my public mental", "start": 519.05, "duration": 5.219}, {"text": "Breakdown part five be very very careful about what you share online", "start": 524.459, "duration": 3.98}, {"text": "You wouldn't want people knowing you're a person one of the things", "start": 528.839, "duration": 3.109}, {"text": "Taught me in the program that I was studying at was to keep your Twitter", "start": 532.13, "duration": 2.789}, {"text": "Squeaky clean because you wouldn't want your employer finding something that you posted and then firing you later", "start": 535.11, "duration": 4.55}, {"text": "Now this is objectively good advice. Don't get me wrong. But for me, it felt like another form of death. Essentially it was saying", "start": 539.66, "duration": 7.019}, {"text": "You're that one part of you. That's unique your", "start": 547.23, "duration": 2.33}, {"text": "Personality will just shut that up. Don't don't express yourself at all", "start": 550.14, "duration": 4.099}, {"text": "Whenever I made a video that was even slightly edgy or pushing the envelope in any way or expressing any form of dissenting opinion", "start": 554.24, "duration": 7.02}, {"text": "I would just feel this dread that", "start": 561.26, "duration": 2.07}, {"text": "that's like oh", "start": 563.97, "duration": 1.71}, {"text": "shit, you know like", "start": 565.68, "duration": 2.0}, {"text": "This could get me fired from a job", "start": 567.78, "duration": 2.029}, {"text": "And then I wouldn't just be a nobody I would be less than a nobody", "start": 569.88, "duration": 3.89}, {"text": "I would be a nobody who couldn't even follow the well-trodden path", "start": 573.77, "duration": 3.51}, {"text": "I continued to express myself on social media and in the art that I produced, but I was never comfortable about it", "start": 577.28, "duration": 6.989}, {"text": "but I did it anyway because", "start": 584.27, "duration": 2.0}, {"text": "Just doing it", "start": 586.44, "duration": 1.71}, {"text": "gave me that 1% more chance of getting noticed and", "start": 588.15, "duration": 4.82}, {"text": "That percent chance was so valuable to me that I would sacrifice anything for it part 6 death", "start": 593.46, "duration": 6.649}, {"text": "approaches all throughout university", "start": 600.33, "duration": 1.97}, {"text": "I had this big calendar and at the end of the calendar there was a big skull and cross. So at the end of", "start": 602.3, "duration": 4.919}, {"text": "University there was the chopping block just it was gonna kill me if I reach that point", "start": 607.32, "duration": 4.13}, {"text": "I would I would have to enter the workforce and I would not have enough time to work on me art and", "start": 611.45, "duration": 4.83}, {"text": "I would essentially just be dead and eventually I reached that skull-and-crossbones date and then two things happened one", "start": 616.38, "duration": 6.979}, {"text": "I got a job offer with the place that I'd been interning at and", "start": 623.36, "duration": 3.66}, {"text": "two", "start": 627.54, "duration": 1.65}, {"text": "One of my videos started to do well part seven the hardest decision I've ever made go to high school get good grades", "start": 629.19, "duration": 6.5}, {"text": "Go to university get an internship get a job work up. The ladder find a grill reproduce die", "start": 635.73, "duration": 5.51}, {"text": "I tried working for a month and", "start": 641.24, "duration": 3.45}, {"text": "I found myself in tears at the end of each day. Every day was", "start": 645.57, "duration": 3.77}, {"text": "So bad", "start": 650.07, "duration": 2.0}, {"text": "and", "start": 652.2, "duration": 1.44}, {"text": "What's funny is?", "start": 653.64, "duration": 1.65}, {"text": "You're probably listening to this story and being like well", "start": 655.29, "duration": 2.36}, {"text": "Why didn't you just do something else you idiot?", "start": 657.65, "duration": 2.13}, {"text": "If it was making you this sad just do something else, but that's not how it worked for me", "start": 659.78, "duration": 6.599}, {"text": "I I really felt like I had no way out", "start": 666.38, "duration": 2.76}, {"text": "I felt like this is what the last four years of my life have been leading up to my high school", "start": 669.14, "duration": 5.549}, {"text": "work leads into my university work leads into this job and to", "start": 675.99, "duration": 5.0}, {"text": "Want to do something else I would be setting myself back. So I should just focus on", "start": 681.51, "duration": 4.279}, {"text": "Doing good at the job. So I finished my internship and the day with the skull and crossbones on it came and went and", "start": 686.46, "duration": 7.07}, {"text": "I didn't feel that much different, but I resigned myself to the fact that I", "start": 694.14, "duration": 4.669}, {"text": "was not going to be able to do what I wanted to do for a living and", "start": 699.3, "duration": 4.369}, {"text": "I", "start": 704.37, "duration": 1.8}, {"text": "got the email that", "start": 706.17, "duration": 2.0}, {"text": "Offered me the job and as I got that email something else started to happen", "start": 708.3, "duration": 3.98}, {"text": "One of my videos started to do. Well one day. I went from 500 subscribers to 1,000 and then from 1,000 to", "start": 712.92, "duration": 7.25}, {"text": "2,000 and then 2,000 to 3,000 to 4,000 to 5,000 to 10,000 and I thought", "start": 720.78, "duration": 4.849}, {"text": "Holy shit", "start": 726.57, "duration": 1.95}, {"text": "Holy shit", "start": 728.52, "duration": 2.0}, {"text": "Holy shit", "start": 730.589, "duration": 1.921}, {"text": "and that day I had to pick between what it felt like my entire life had been leading up to and", "start": 732.51, "duration": 5.539}, {"text": "what my entire life had actually been leading up to which is to say", "start": 738.48, "duration": 4.67}, {"text": "Not the job", "start": 744.12, "duration": 0.98}, {"text": "I", "start": 745.1, "duration": 0.7}, {"text": "Willing fully chose to submit myself to the random fluctuations of a youtube algorithm than to find a stable", "start": 745.8, "duration": 5.69}, {"text": "Steady job in my hometown and it will either end up being the worst decision of my life or the best", "start": 751.65, "duration": 5.659}, {"text": "But no middle part 8 but now everything's better and I was right all that anxiety", "start": 758.07, "duration": 6.71}, {"text": "All that existential depression and angst and dread all of that went away. Once my channels heard to blow up. It's fixed me. I", "start": 765.03, "duration": 7.879}, {"text": "used to be so sad and so depressed and so alone and now I genuinely feel like my life is", "start": 773.88, "duration": 6.89}, {"text": "Fixed I never thought that was possible before but now I know that it is everyday is a good day now", "start": 781.5, "duration": 7.4}, {"text": "And I'm making this video to thank you. Thank you so much you fixed", "start": 788.9, "duration": 4.979}, {"text": "That's funny", "start": 796.26, "duration": 1.79}, {"text": "But that's not how this works", "start": 798.05, "duration": 1.84}, {"text": "That's not how any of this works", "start": 799.89, "duration": 2.0}, {"text": "See I setup impossible parameters. So you'd be in half your whole life", "start": 802.29, "duration": 3.95}, {"text": "And you managed to reach those impossible parameters so very good, but you're not free", "start": 806.24, "duration": 5.07}, {"text": "You're still playing my game part 9 you can't be fixed. You're broken. You're stupid. Fuck you", "start": 811.769, "duration": 6.68}, {"text": "Just have a hundred thousand subscribers worth of masking tape around the cracks", "start": 818.45, "duration": 3.419}, {"text": "You think you're better just because you've got what you want. You're fucking delusional", "start": 821.87, "duration": 4.649}, {"text": "You will never be better. You will never be better", "start": 827.25, "duration": 3.769}, {"text": "You will never be better shut up because I'm continuing with my video", "start": 831.329, "duration": 4.91}, {"text": "Hey-oh on a subconscious level", "start": 836.91, "duration": 2.419}, {"text": "I did think that this would fix me and it didn't but it did help immensely and I am genuinely so grateful for everybody", "start": 839.339, "duration": 7.16}, {"text": "Who's watching me right now? A lot of my inks and read about existential things. Like what am I doing with my life?", "start": 846.5, "duration": 5.609}, {"text": "Will I ever be happy will ever be able to do something that makes me happy a lot of those things?", "start": 852.149, "duration": 4.67}, {"text": "While not entirely gone have dissipated like immensely", "start": 857.01, "duration": 3.649}, {"text": "I'm not necessarily a happy person now, but I definitely have a lot more happy moments", "start": 860.66, "duration": 4.89}, {"text": "I feel a lot happier as a person in small ways every single one of you", "start": 865.55, "duration": 4.47}, {"text": "Has given me a future", "start": 871.05, "duration": 1.279}, {"text": "I'd like to think that every time you cry on camera those your youtubes if says some real youtuber who makes better content than you", "start": 872.329, "duration": 6.45}, {"text": "is just like you're gonna come wait because they're like", "start": 878.779, "duration": 1.921}, {"text": "What's the point of me even trying at this point if this guy can make it and I?", "start": 880.7, "duration": 3.509}, {"text": "So one whose content is objectively better than yours is just quitting right now", "start": 884.42, "duration": 3.779}, {"text": "Don't you ever think how talking about this kind of stuff makes other people feel people like you part ten?", "start": 888.2, "duration": 5.94}, {"text": "Isolation the best part about being a youtuber is all the interaction I get from all my fans online", "start": 894.6, "duration": 4.82}, {"text": "From people talking about me online", "start": 899.97, "duration": 2.059}, {"text": "that I read as I Google myself ten times a day and", "start": 902.64, "duration": 2.78}, {"text": "Just end up staring at my screen more and in reality", "start": 905.94, "duration": 2.929}, {"text": "I don't actually talk to another human being for sometimes longer than a week. Oh, it's lonely on top, isn't it? Yeah", "start": 908.87, "duration": 5.61}, {"text": "Whoa, what the fuck?", "start": 914.48, "duration": 2.0}, {"text": "Moving on part 11 thick-skinned", "start": 917.07, "duration": 2.03}, {"text": "I like to think I have thick skin YouTube comments feel to me like darts kind of getting thrown at me and", "start": 919.1, "duration": 5.94}, {"text": "my skin is typically thick enough to", "start": 925.32, "duration": 2.0}, {"text": "Absorb, quite a few of those things without actually feeling anything bad about myself, but nowadays", "start": 927.96, "duration": 5.599}, {"text": "I consume so much content about myself", "start": 933.66, "duration": 2.989}, {"text": "it's almost like I'm just eating all this slop and", "start": 937.05, "duration": 3.5}, {"text": "even if like 90% of the slop is good I can have this period where I'm like", "start": 940.98, "duration": 5.119}, {"text": "Eating a lot of negativity all at once and it makes me sick like before it was like, all right", "start": 946.41, "duration": 6.199}, {"text": "I can take a dart here and there but", "start": 952.61, "duration": 1.75}, {"text": "It's not really a matter of how thick my skin is when you're consuming all that content", "start": 954.36, "duration": 4.1}, {"text": "It's more like indigestion", "start": 958.46, "duration": 1.78}, {"text": "part 12 the people who love you and the people who don't", "start": 960.24, "duration": 2.96}, {"text": "Here's what I do when I've got a good mood going that I want to ruin", "start": 963.3, "duration": 2.809}, {"text": "I open up a place where people are talking about me and then I just", "start": 966.11, "duration": 3.0}, {"text": "Scroll, here's all the good things that people are saying about me", "start": 969.3, "duration": 2.75}, {"text": "Yeah, just just scroll right on by that and go right to the verbal abuse then just chow down on it like a sandwich. I'm", "start": 972.05, "duration": 6.3}, {"text": "Delicious just look out on a sea of people who fucking hate your guts and just drink it all in", "start": 979.8, "duration": 5.75}, {"text": "Mmm, it's all true", "start": 986.61, "duration": 1.94}, {"text": "I know it is I read critiques of my work because I want to improve as an artist", "start": 988.55, "duration": 4.14}, {"text": "But some people don't want you to improve they want to burn you off the face of the fucking planet", "start": 992.69, "duration": 4.95}, {"text": "but for every one of those people who hate me, there's probably 10 others that", "start": 997.64, "duration": 4.799}, {"text": "really really like me part 13", "start": 1002.96, "duration": 2.69}, {"text": "I don't want to be famous", "start": 1005.65, "duration": 1.39}, {"text": "When I said I want to be famous as a kid what I was really saying was I want to be a successful artist", "start": 1007.04, "duration": 5.329}, {"text": "I want to make a living off of what makes me happy. I'm not an idiot", "start": 1012.37, "duration": 3.96}, {"text": "I know what famed to people I don't want a superiority complex. I don't want to overdose on drugs", "start": 1016.33, "duration": 5.669}, {"text": "I don't want a bunch of tweens to develop an unhealthy parasocial relationship with me. But at the same time", "start": 1022.07, "duration": 5.269}, {"text": "I'm an idiot. I know things", "start": 1028.91, "duration": 2.089}, {"text": "But I want a superiority complex. I want to overdose on drugs", "start": 1031.61, "duration": 4.099}, {"text": "I want to have a bunch of tweens develop an unhealthy pair social relationship with me", "start": 1035.78, "duration": 4.609}, {"text": "Why wouldn't I there's no such thing as a successful artist that doesn't have some form of fame just hobbyists", "start": 1040.79, "duration": 6.289}, {"text": "Just people who do art on the side. Most people aren't fucking artists", "start": 1047.079, "duration": 4.77}, {"text": "Most people wouldn't bleed for their craft. Those people wouldn't fucking die for it", "start": 1051.85, "duration": 4.8}, {"text": "I would agree on one hour of guitar a day after eight fucking hours of shit work isn't enough", "start": 1056.68, "duration": 6.39}, {"text": "It's nothing and just because hundreds of thousands of other people have convinced themselves that it's enough", "start": 1063.07, "duration": 5.489}, {"text": "Doesn't mean that I have to - it's not another it will never be enough", "start": 1068.63, "duration": 4.64}, {"text": "enough enough", "start": 1074.24, "duration": 2.0}, {"text": "Part 14 enough. How do you deal with the need for more? I am a very conscientious person but not because", "start": 1076.25, "duration": 7.369}, {"text": "Being conscientious makes me happy", "start": 1084.2, "duration": 2.09}, {"text": "The only thing that being status oriented has given me is this horrible anxiety?", "start": 1086.29, "duration": 3.569}, {"text": "That flares up inside of me whenever I'm not doing enough. I am miserable when I'm not creating", "start": 1090.05, "duration": 4.969}, {"text": "I am miserable when I'm not progressing towards some fit progressing so much so quickly makes it difficult to really", "start": 1095.02, "duration": 5.55}, {"text": "appreciate how far you've come in such a short amount of time that", "start": 1101.0, "duration": 3.619}, {"text": "It doesn't really feel like anything. So now over the course of five months", "start": 1105.38, "duration": 4.069}, {"text": "I've basically smashed through every goal that I had set up for myself", "start": 1109.45, "duration": 3.87}, {"text": "and now I feel like the only thing left for me to do is", "start": 1113.62, "duration": 2.55}, {"text": "Keep going and that voice in my head just keeps saying Wow a hundred thousand YouTube subscribers", "start": 1116.99, "duration": 5.75}, {"text": "Impressive very impressive, but let me ask you something. Is that enough? Really I mean", "start": 1124.04, "duration": 7.13}, {"text": "100,000 is that", "start": 1132.559, "duration": 1.59}, {"text": "Really all you want to do with your life be some needless YouTube celebrity. I don't think so", "start": 1134.149, "duration": 5.75}, {"text": "I think you should probably aim for 200,000 for 500,000 or 1 million", "start": 1139.899, "duration": 5.55}, {"text": "In fact, don't let yourself be happy until you have 1 million subscribers. How about that?", "start": 1145.45, "duration": 6.419}, {"text": "How's that?", "start": 1152.629, "duration": 1.11}, {"text": "Sound because if you think about it that unhappiness is the only reason you have anything at all. That's weird", "start": 1153.739, "duration": 6.83}, {"text": "It's almost like having 100,000 YouTube subscribers", "start": 1160.57, "duration": 2.459}, {"text": "Doesn't have any correlation at all with me fixing deep-seated emotional trauma and existential depression", "start": 1163.729, "duration": 5.869}, {"text": "strange, could it be that confusing the joy of the journey and the joy of the destination has put me in a situation where I", "start": 1170.389, "duration": 5.839}, {"text": "Can't enjoy either", "start": 1176.229, "duration": 1.78}, {"text": "No, I just need two hundred thousand YouTube subscribers, then I'll be happy", "start": 1178.009, "duration": 4.55}, {"text": "That'll fix me that'll fix you", "start": 1184.129, "duration": 2.0}, {"text": "Calm down a little bit. Oh", "start": 1192.049, "duration": 2.0}, {"text": "Yeah, sorry. I never really wanted to be famous", "start": 1194.33, "duration": 2.209}, {"text": "I just wanted to be a successful artist and in my mind all", "start": 1196.539, "duration": 3.15}, {"text": "Successful artists have some form of niche Fame at least so you chose to make personal Fame your ideal over making good art", "start": 1199.909, "duration": 6.949}, {"text": "So I chose to make good art my ideal", "start": 1206.869, "duration": 2.45}, {"text": "So I chose to make both my ideal part 15 super position. What does it mean to be superimposed?", "start": 1210.409, "duration": 5.599}, {"text": "To be one than the other sometimes both at the same time", "start": 1216.619, "duration": 3.35}, {"text": "But never neither being famous sounds like exactly what I want", "start": 1219.97, "duration": 3.75}, {"text": "and it also sounds like the exact opposite of everything that I want when I'm in an ambiguous space when I'm in a", "start": 1223.72, "duration": 6.059}, {"text": "Transitory space I feel like I am both and neither and one and the other", "start": 1229.879, "duration": 5.75}, {"text": "I don't want to be famous because I know that once I get to the top of that mountain", "start": 1235.899, "duration": 3.75}, {"text": "I'm just gonna have a very lonely view, but at the same time what else can I do but climb part?", "start": 1239.649, "duration": 6.209}, {"text": "15.5 exploiting parasocial relationships if you've been watching me for a while", "start": 1246.499, "duration": 4.52}, {"text": "Then you might have developed something called a parasocial relationship with me essentially what that means", "start": 1251.019, "duration": 4.5}, {"text": "Is that even though you don't know me and you can't know me you might feel as if though you know me", "start": 1255.519, "duration": 5.609}, {"text": "This is foundational to a lot of youtube channels the feeling as if you are really interacting with the person you see on your screen", "start": 1261.159, "duration": 6.06}, {"text": "But parasocial relationships can and often are used to manipulate people the reason sponsorships with youtubers are so successful", "start": 1267.429, "duration": 7.41}, {"text": "For example is because when a youtuber sells you something it feels as if your friend is selling you something and that's kind of fun", "start": 1274.84, "duration": 6.06}, {"text": "I'm thinking a lot about how to handle sponsorships on this channel and I've decided against doing them entirely as you know", "start": 1281.11, "duration": 5.76}, {"text": "I haven't had done a sponsorship since my DVD case video", "start": 1286.87, "duration": 2.699}, {"text": "so", "start": 1290.24, "duration": 1.2}, {"text": "I just don't think it's worth", "start": 1291.44, "duration": 2.0}, {"text": "Exploiting my relationship with you guys for cash. Oh", "start": 1295.34, "duration": 3.709}, {"text": "Shit was that a drag, you know, it's actually a transition that you can find in the movavi video editing software. Ah,", "start": 1304.309, "duration": 6.859}, {"text": "Am I breathing fire?", "start": 1312.29, "duration": 1.769}, {"text": "No", "start": 1314.059, "duration": 0.5}, {"text": "It's actually just an animated sticker that you can find built into the movavi", "start": 1314.559, "duration": 3.989}, {"text": "Software movavi video editor is a crisp and clean video editing software", "start": 1318.77, "duration": 3.979}, {"text": "That is perfect for anyone looking to get into video editing and wanting something a little more complex than Windows Movie Maker uh-oh", "start": 1322.75, "duration": 5.28}, {"text": "This one's spooky", "start": 1328.36, "duration": 2.0}, {"text": "Editing suite is really easy to navigate", "start": 1332.14, "duration": 1.62}, {"text": "Making it perfect for beginners to the craft and you don't have to know what keyframes are do stuff like this. Whoa", "start": 1333.76, "duration": 5.209}, {"text": "Look at that text flawless range is already really good", "start": 1339.28, "duration": 2.75}, {"text": "Just a fraction of what Final Cut Pro or Premiere Pro would cost but you can also use movavi buddy my promo code in order", "start": 1342.03, "duration": 6.27}, {"text": "To get a discount on your offer. Check this out. Whoa", "start": 1348.3, "duration": 2.699}, {"text": "If you're looking to get into the fast paced video editing world and don't know where to start try", "start": 1354.61, "duration": 4.34}, {"text": "Movavi, then you too can become a successful YouTube boy wonder like me, and if you don't you will never be happy", "start": 1358.95, "duration": 7.589}, {"text": "Remember to use promo code most part 16 irony if your to Irana your to IRA over in the real on the real", "start": 1385.07, "duration": 6.709}, {"text": "About anything that", "start": 1394.16, "duration": 1.86}, {"text": "Mean yet because I guess I won't let it part 17. Do you deserve this over the past five months you've passed countless?", "start": 1396.02, "duration": 7.67}, {"text": "Talented hard-working youtubers you really think you deserve that shit. You really think you're better than those people", "start": 1404.21, "duration": 6.56}, {"text": "Maybe you should just let me be happy or proud or feel accomplished for once in my life", "start": 1410.96, "duration": 4.4}, {"text": "Maybe you should stop being afraid of like part 18. What are you now? Anybody can do it?", "start": 1415.73, "duration": 5.45}, {"text": "Anybody can be famous just like you everybody with less subscribers than you as an objectively worse content creator", "start": 1421.28, "duration": 6.949}, {"text": "You're good job participating in this very shit Internet online experiment", "start": 1428.6, "duration": 5.15}, {"text": "You deserve to be where you are, and you should leave this wholeheartedly", "start": 1433.75, "duration": 2.969}, {"text": "Because and if you don't then you might have to reflect on the fact that you're only really here because it's random YouTube algorithmic", "start": 1437.03, "duration": 7.13}, {"text": "Fluctuations and while your effort did play some small role in while you're here. There's really no reason why you're here", "start": 1444.5, "duration": 5.359}, {"text": "You just are you're not put here for a purpose. You don't have meaning you're just kind of", "start": 1449.86, "duration": 4.89}, {"text": "Existing and you don't have much of a purpose to your assets", "start": 1455.33, "duration": 3.35}, {"text": "You just are you just are you're just put hair and you are and you are acting and you were doing your thing", "start": 1458.68, "duration": 6.239}, {"text": "And there's no overarching meaning to any of it at all", "start": 1464.92, "duration": 2.939}, {"text": "And none of it makes any sense and none of it should make any sense and you shouldn't want it to make sense", "start": 1467.86, "duration": 5.099}, {"text": "But you'll keep wanting it to make sense because that's the only thing that keeps you going", "start": 1472.96, "duration": 3.3}, {"text": "Huh, since you want to make some sense job", "start": 1476.26, "duration": 2.579}, {"text": "Good job", "start": 1479.54, "duration": 1.7}, {"text": "You made it", "start": 1481.24, "duration": 1.53}, {"text": "You made it and all you had to do was capitalized on", "start": 1482.77, "duration": 4.609}, {"text": "Ambiguity call for mass killing abandon your morality and values", "start": 1487.96, "duration": 4.4}, {"text": "Forget everything you stand for sell your being as a brand", "start": 1493.15, "duration": 4.669}, {"text": "Let me get AC I'm teen but I'm good all of these worries are essentially in the past now everything turned out pretty much", "start": 1508.57, "duration": 6.17}, {"text": "Okay", "start": 1514.74, "duration": 0.39}, {"text": "I'm with YouTube now and YouTube treats its creators right part 22 way pair of social relationships", "start": 1515.13, "duration": 7.26}, {"text": "You hear a lot of youtubers talk about parasocial relationships, which are one-way relationships that you know", "start": 1522.39, "duration": 5.579}, {"text": "I can't reciprocate because I'm not real essentially", "start": 1527.97, "duration": 4.02}, {"text": "I only exist as a character on your screen", "start": 1531.99, "duration": 2.67}, {"text": "but what I don't hear", "start": 1534.66, "duration": 1.24}, {"text": "Youtubers talk about is that there's kind of a two-way pair of social relationship going on right now", "start": 1535.9, "duration": 4.429}, {"text": "and that is your relationship with the persona that I am portraying on your screen and then", "start": 1540.33, "duration": 7.109}, {"text": "There's my pair of social relationship with you as an audience the hive mind that is my audience", "start": 1548.14, "duration": 6.65}, {"text": "So the parasocial relationship goes like both ways", "start": 1555.03, "duration": 3.089}, {"text": "Part 21 the grief isn't gone and that's comforting the first 21 years of my life were characterized by", "start": 1558.309, "duration": 5.869}, {"text": "extreme existential angst the fear that I would never do anything worthwhile or note worth now that I", "start": 1564.85, "duration": 4.969}, {"text": "Essentially have some kind of stability and hope for the future. I", "start": 1569.919, "duration": 3.86}, {"text": "Spent a brief moment", "start": 1574.63, "duration": 1.65}, {"text": "Wondering what kind of person I would be without that", "start": 1576.28, "duration": 3.289}, {"text": "Same extreme angst and grief that was weighing down on me my whole life and I've come to realize that", "start": 1580.0, "duration": 5.239}, {"text": "I have not even experienced a small portion of the amount of grief that life has in store for me", "start": 1585.76, "duration": 6.77}, {"text": "And that's a very comforting thought my head will go bald and I will grieve about that", "start": 1592.53, "duration": 5.429}, {"text": "My channel will stagnate or get taken down and I will grieve about that", "start": 1597.96, "duration": 3.39}, {"text": "I'll never get married and I'll grieve about that or worse. I will get married and I will grieve about that", "start": 1601.35, "duration": 5.13}, {"text": "I'll get cancelled and exposed and I'll grieve about that people I love will die and I'll grieve about that and something horrible will happen", "start": 1606.48, "duration": 6.479}, {"text": "Worldwide and I'll grieve about that", "start": 1613.21, "duration": 2.0}, {"text": "Maybe we all will I tell myself this to grieve about all my potential grief", "start": 1615.73, "duration": 4.339}, {"text": "But I also tell myself this to avoid grief", "start": 1620.17, "duration": 3.109}, {"text": "Because if I had actually gotten to the point where my life was free from grief", "start": 1623.65, "duration": 5.359}, {"text": "Then that would be worse than having grief in my life. That would be inhuman", "start": 1629.29, "duration": 5.359}, {"text": "It would be not right fundamentally life is still pain", "start": 1634.65, "duration": 4.5}, {"text": "But it's a comforting", "start": 1639.15, "duration": 1.54}, {"text": "Stockholm Syndrome II kind of pain that I've grown accustomed to and", "start": 1640.69, "duration": 3.38}, {"text": "Knowing that it's gonna continue to hurt me is a nice thought and that's why I need that pain and I need that negativity", "start": 1644.14, "duration": 7.669}, {"text": "And that's why I need you. You're an interpret and valuable part of me. I want you with me", "start": 1652.24, "duration": 5.719}, {"text": "Stay with me I owe everything to you. I love you. You know that", "start": 1658.78, "duration": 5.39}, {"text": "I know that this kind of two-way thing doesn't really make much sense", "start": 1664.17, "duration": 5.13}, {"text": "But I so mean it when I say I love you, and I know you love me too, because I need you", "start": 1669.3, "duration": 5.969}, {"text": "I need you and I'm so glad that you're here", "start": 1675.27, "duration": 2.729}, {"text": "And I know that you'll stay with me because where else would you go and who else would I perform for?", "start": 1678.0, "duration": 7.079}, {"text": "You are my significant thing", "start": 1685.67, "duration": 2.239}, {"text": "You are my ideal", "start": 1688.1, "duration": 1.62}, {"text": "And I know I can't really talk to you", "start": 1689.72, "duration": 3.02}, {"text": "But I can talk to you and that's all I need to be able to talk to", "start": 1693.02, "duration": 4.91}, {"text": "Your it you fixed me want to know a secret. I", "start": 1698.66, "duration": 3.619}, {"text": "Separate the voice to make me seem like a better person, but the truth is all those words are mine", "start": 1702.86, "duration": 6.319}, {"text": "every single one I just put it in front of a clown face so that I would seem nicer you are my", "start": 1710.06, "duration": 6.739}, {"text": "Intrusive thoughts and I don't know what the fuck I would do without you part", "start": 1717.02, "duration": 5.21}, {"text": "I'm 22 now for better or for worse. I have chosen to participate in this grand Internet experi", "start": 1722.23, "duration": 6.689}, {"text": "I'm playing with fire hair", "start": 1728.92, "duration": 1.29}, {"text": "I think that this has the potential to utterly fucking", "start": 1730.21, "duration": 3.54}, {"text": "Annihilate people and I think it would be naive of me to believe that I am immune from this annihilation", "start": 1734.0, "duration": 5.359}, {"text": "My thoughts on this are fragmented and unresolved and as a result", "start": 1739.73, "duration": 3.979}, {"text": "I am NOT going to be able to tie up this video nicely and tell you things that are going to", "start": 1743.71, "duration": 6.329}, {"text": "Resolve any of the things and conflicts that have brought up because within my own mind they are not resolved", "start": 1750.53, "duration": 5.57}, {"text": "So instead I'm gonna read you a poem that I wrote when I was 18 years old when I was younger", "start": 1756.1, "duration": 4.409}, {"text": "I wrote a large number of poems about Fame an embarrassingly large number of poems about Fame", "start": 1760.51, "duration": 5.19}, {"text": "I would write these poems for two reasons one", "start": 1765.7, "duration": 2.55}, {"text": "I would write them as a coping mechanism for never being able to be famous and", "start": 1768.25, "duration": 4.949}, {"text": "Two, I would write them as kind of a magic spell hoping that they would make me famous", "start": 1773.48, "duration": 4.309}, {"text": "I never read this one performed", "start": 1777.79, "duration": 2.7}, {"text": "This one produced this one at all", "start": 1780.49, "duration": 2.0}, {"text": "After I wrote it because I never felt like there was any need to I never felt like it was relevant at all", "start": 1782.54, "duration": 5.66}, {"text": "And now four years later, I feel like it is it's called. I want to be famous. I want to be famous", "start": 1788.2, "duration": 7.05}, {"text": "I want the world to know what my name is", "start": 1795.25, "duration": 1.83}, {"text": "I want to be home when Fame rings the phone doesn't matter if I'm a hero or the butt of the joke when people at", "start": 1797.08, "duration": 5.04}, {"text": "Parties asks, so what do you do? I want to impress them with a sentence or two", "start": 1802.12, "duration": 3.63}, {"text": "Oh nothing too big just a movie or two best-selling poetry book", "start": 1805.75, "duration": 5.009}, {"text": "Oh and a couple of other things but enough about me. What about you? I hear you working in policy", "start": 1810.76, "duration": 5.61}, {"text": "I want to have a voice, you know when I talk I want people listen. I want to make a choice", "start": 1816.37, "duration": 4.499}, {"text": "You know, I want to have some agency in this world that I live", "start": 1820.869, "duration": 2.88}, {"text": "I want to forget the expectations of everyone else. I want to follow my dreams and focus on myself. I want to inspire people", "start": 1823.749, "duration": 5.489}, {"text": "I want to light a fire in people", "start": 1829.369, "duration": 2.03}, {"text": "I want people to look up to me and think I want to get higher people will love me and maybe that", "start": 1831.399, "duration": 5.31}, {"text": "Will finally be enough to let me love people back. I want to get mentioned in casual conversation", "start": 1837.169, "duration": 5.51}, {"text": "I want my name just spread across the nation. I want to never work on my character. I want to become a fucking character", "start": 1842.679, "duration": 6.119}, {"text": "I want to be the person people recognized on the street", "start": 1848.799, "duration": 2.28}, {"text": "I want people to notice me so I can finally feel good about people to say", "start": 1851.08, "duration": 3.029}, {"text": "Hey, don't I know you from somewhere and I'll just say maybe like I just don't care", "start": 1854.109, "duration": 3.66}, {"text": "I want people to see me on the street and say hey aren't you that guy from that movie and I'll say haha", "start": 1857.769, "duration": 5.19}, {"text": "Yeah, that's me, but I won't in actuality", "start": 1862.96, "duration": 2.669}, {"text": "I'll snub him because I'll finally be too good for somebody. I want to disappoint people", "start": 1865.7, "duration": 5.449}, {"text": "I want to make them say I remember that guy from back in the day. He used to make soulful stuff", "start": 1871.149, "duration": 4.739}, {"text": "He was like dr. Dre, but now his stuffs not enough and he's lost his way. I want to be harassed", "start": 1875.889, "duration": 4.32}, {"text": "I want the paparazzi on my ass. I want to never have any privacy", "start": 1880.479, "duration": 2.31}, {"text": "I want to get stalked by TMZ because I've been force-fed this fantasy choked on the stream since the age of three I want to", "start": 1882.799, "duration": 5.719}, {"text": "Get high because I have low self-esteem. I want to be the envy of a thousand nameless teens", "start": 1888.519, "duration": 3.479}, {"text": "I want I want so desperately to know someone somewhere. It cares about me. I wanted to send into a self-destructive spiral", "start": 1891.999, "duration": 5.55}, {"text": "I want to have a sex tape of me go viral for some reason. This is appealing to me for some reason", "start": 1897.549, "duration": 4.979}, {"text": "This is my fantasy. I want to change the world have all the money in girls", "start": 1902.629, "duration": 3.68}, {"text": "I want to transcend tired concepts like", "start": 1906.309, "duration": 1.96}, {"text": "Monogamy and get anyone and anything my eyes can see I want to have people follow me home", "start": 1908.269, "duration": 4.43}, {"text": "I want to never fucking be safe alone. I want to have people worship me", "start": 1912.729, "duration": 3.66}, {"text": "I want to want to want to want to want to be a deity because ever since I was young I was told when I", "start": 1916.389, "duration": 3.839}, {"text": "performed that my name would soon be heard across the world and that", "start": 1920.299, "duration": 2.9}, {"text": "That kind of fucked me up", "start": 1923.809, "duration": 1.16}, {"text": "I was told people would love the things that I write and that made me grow up with all this hatred and spite because that's", "start": 1924.969, "duration": 5.7}, {"text": "What being famous means that's the dream of so many teens, but I don't want to be famous", "start": 1930.669, "duration": 4.38}, {"text": "I just want a place to perform something to love something to keep me warm a creative outlet someone to listen to my voice", "start": 1935.049, "duration": 6.929}, {"text": "But I feel like I don't have a choice. I want a craft that I love a craft that loves me back", "start": 1942.739, "duration": 5.06}, {"text": "Not a craft that makes me feel like I'm snorting crack", "start": 1947.799, "duration": 2.549}, {"text": "I don't even know what I mean when I say I want to be don't want to be", "start": 1950.349, "duration": 5.58}, {"text": "famous", "start": 1956.48, "duration": 2.0}]