[{"text": "This video was made possible by honker impact third.", "start": 0.0, "duration": 3.06}, {"text": "Thank you for signing up to our tour at the modern zoo of anime fans.", "start": 3.1, "duration": 3.52}, {"text": "here You will be able to learn and observe different breeds of the species known as the anime fan", "start": 6.62, "duration": 4.84}, {"text": "Please do not attempt to feed any anime fan you see as they live on a very strict diet of food", "start": 11.46, "duration": 4.829}, {"text": "water, and trashy Isekai power fantasy shows", "start": 16.57, "duration": 3.11}, {"text": "there's been lots of research of the type of anime fans that exists but", "start": 19.68, "duration": 3.42}, {"text": "Documentation of modern fans are less common", "start": 23.28, "duration": 2.18}, {"text": "As many well-known ones are now actually endangered or extinct, these include the commonly known", "start": 25.47, "duration": 5.25}, {"text": "Casual, weeaboo and elitist, these primitive forms have now evolved into many different breeds", "start": 30.97, "duration": 5.48}, {"text": "For example, now that the anime plague has become far more widely spread and accepted", "start": 36.69, "duration": 3.9}, {"text": "it is harder to classify who is actually a casual anime fan and who is just a", "start": 40.59, "duration": 4.41}, {"text": "Normal, healthy human thus we present the new classification model for the modern anime fan", "start": 45.76, "duration": 5.27}, {"text": "We start with the life stylist", "start": 51.03, "duration": 1.799}, {"text": "The life stylist has taken over as the modern image of anime fans and takes a more business casual approach towards anime many of these", "start": 52.829, "duration": 6.24}, {"text": "are ex weeaboos or otaku that have now grown up and found this awful new thing called", "start": 59.07, "duration": 4.41}, {"text": "A life, while they may have had countless hours to sink into anime when they are young", "start": 64.15, "duration": 3.739}, {"text": "they may find these slight annoyances have cropped up like", "start": 67.89, "duration": 2.519}, {"text": "Colleges or working to pay rent and try not to starve to death or god forbid a girlfriend", "start": 70.6, "duration": 5.209}, {"text": "That means they have far less time for animes. So they need to optimize it. This means mostly watching things", "start": 75.81, "duration": 5.43}, {"text": "They hear being discussed by friends or if they're really desperate might even resort to watching youtubers to give them recommendations", "start": 81.24, "duration": 5.97}, {"text": "They are however still very knowledgeable about anime in its culture", "start": 89.799, "duration": 3.83}, {"text": "So may end up spending more time discussing anime in person or online than actually watching it a trait also", "start": 93.63, "duration": 5.849}, {"text": "reminiscent of the Memer it is argued whether a meme of really counts as an anime fan or not because there has yet to be", "start": 99.79, "duration": 5.599}, {"text": "A recorded sighting of the species actually watching anime not including hentai, of course", "start": 105.39, "duration": 4.86}, {"text": "however", "start": 110.25, "duration": 0.36}, {"text": "You can find them in pretty much every facet of the anime community as it is theorized they are able to completely keep up to", "start": 110.61, "duration": 5.459}, {"text": "Anime entirely through memes absorbing the surrounding memes for information in a process called. osmemesis", "start": 116.07, "duration": 6.0}, {"text": "They are pretty easy to recognize as they have developed a unique language of communication through gifts", "start": 122.07, "duration": 4.259}, {"text": "Shitposts and smug anime girls though. The fully mature of the species can be spotted at pretty much every convention wearing the fucking ahegao hoodies", "start": 126.88, "duration": 6.379}, {"text": "It is unclear where the species normally resides in the real world", "start": 133.83, "duration": 2.789}, {"text": "but rumors suggest that many of them are currently looking to buy property on our", "start": 136.62, "duration": 3.54}, {"text": "Ana memes this brings us to the collectors", "start": 140.64, "duration": 2.49}, {"text": "The collectors have spent way too much money on anime and they themselves", "start": 143.13, "duration": 3.239}, {"text": "Cannot remember how they got in this position in life nor how to stop it", "start": 146.44, "duration": 3.83}, {"text": "They are the Pokemon trainers of this world except instead of catching Pokemon. They catch waifu's under no circumstances", "start": 150.45, "duration": 6.09}, {"text": "Should any of them be allowed within a ten-mile?", "start": 156.54, "duration": 1.99}, {"text": "Perimeter of any device that can play Gacha games and it is documented that they would even probably invest in cryptocurrency", "start": 158.53, "duration": 5.27}, {"text": "if it gave them a chance to get their waifu, despite their spending habits, they never plan to spend money it just kind of", "start": 164.1, "duration": 6.66}, {"text": "happens once they think they reach a period of financial stability when they no longer feel the urge to spend is when there is a", "start": 171.61, "duration": 5.36}, {"text": "perfectly timed summer event announcement with new limited edition", "start": 177.01, "duration": 2.659}, {"text": "Swimsuit version waifus and the next thing they know they are googling how to sell their left", "start": 179.86, "duration": 3.649}, {"text": "Kidney on the black market to make more money", "start": 183.51, "duration": 1.71}, {"text": "It is the common misconception that collectors have a lot of disposable income", "start": 185.22, "duration": 3.239}, {"text": "when in fact all they may possess a lot of is a lack of budgeting skills if we break down a standard monthly budget and", "start": 188.53, "duration": 5.419}, {"text": "Show it to a collector $200 in food $700 in rent", "start": 193.95, "duration": 3.509}, {"text": "$150 in utilities", "start": 198.1, "duration": 1.98}, {"text": "$1500 on anime figurines and $2,000 on rerolls in fate gran order. They will look at this and wonder to themselves Wow", "start": 200.08, "duration": 6.559}, {"text": "Am I really spending that much money on food and on that note", "start": 206.64, "duration": 2.25}, {"text": "I think it's a perfect time to introduce the sponsor for today's educational video honkai impact third, honkai impact is..", "start": 209.06, "duration": 5.7}, {"text": "oh for godsakes, of course you'd be here honkai impact is a free to play action mobile game", "start": 215.02, "duration": 4.6}, {"text": "Yes, these graphics and gameplay you are seeing right now are really running on my phone and it is running smoothly as well", "start": 219.63, "duration": 6.389}, {"text": "what starts as an action game with a simple attack dodge system quickly increases in depth when your lock more abilities", "start": 226.019, "duration": 4.86}, {"text": "combos different characters training abilities with different characters while parrying dodging and air juggling and it evolves into an incredibly", "start": 231.07, "duration": 6.409}, {"text": "Satisfying real-time combat system that will have you hooked you have a wide array of different", "start": 237.549, "duration": 3.77}, {"text": "Waifus to unlock with their own unique fighting style with", "start": 241.42, "duration": 2.18}, {"text": "customisable weapons and abilities to suit your playstyle as you play through the existing story mode or even use the coop features the game is", "start": 243.7, "duration": 6.349}, {"text": "Constantly being updated with the most recent addition being the dorm feature", "start": 250.049, "duration": 3.15}, {"text": "build a nice little house for your girls to rest in where they can train up in their spare time and generally just look absolutely", "start": 253.39, "duration": 4.849}, {"text": "Adorable no. No. No, these aren't yours go. Get your own go get your own", "start": 258.43, "duration": 3.38}, {"text": "If this sounds like your cup of tea", "start": 261.81, "duration": 1.05}, {"text": "or if you just want to try it out to anyway then click on the link below to download it on either IOS", "start": 262.86, "duration": 4.53}, {"text": "or Android and with that we can go back to our tour moving on next we have the hype beast", "start": 267.61, "duration": 5.659}, {"text": "The hype beast has one goal in life to get hype ever since experiencing that first", "start": 273.27, "duration": 5.07}, {"text": "Spine-tingling goosebump inducing feeling they live their life chasing that next high and will watch every anime fight", "start": 278.62, "duration": 6.14}, {"text": "Sports anime and studio trigger show hoping to be able to reach that same high they once felt, understandably", "start": 284.76, "duration": 5.64}, {"text": "They are mostly rooted in the shounen genre", "start": 290.4, "duration": 1.98}, {"text": "And while they argue that the genre has become more respected critically to enjoy for older ages", "start": 292.38, "duration": 3.989}, {"text": "This is just so they can hide the fact that they are all secretly man children nursing", "start": 296.37, "duration": 3.57}, {"text": "Their inner sugar high twelve-year-old where everything was naturally hype similarly to hype beasts. We have cancers, cancers only care about one thing", "start": 299.94, "duration": 7.92}, {"text": "Cute anime girls and every one of them is equipped with a built-in navigation", "start": 308.4, "duration": 3.45}, {"text": "System that will cause them to gravitate towards the nearest source of moe unlike the rest of the community arguing over waifus and best girls", "start": 312.16, "duration": 6.889}, {"text": "Cancers only believe in spreading love and acceptance for every girl every girl is deserving of love", "start": 319.18, "duration": 4.64}, {"text": "Because every girl is Moei and if the answer is Moe", "start": 323.95, "duration": 2.989}, {"text": "There can be no wrong answer", "start": 326.98, "duration": 3.079}, {"text": "unless the answer is Nico studies have Shown that this", "start": 330.46, "duration": 2.57}, {"text": "Overexposure to Moe has deteriorated the average specimen brain into a mindless mushy goop effects of which can be seen when they gather in one", "start": 333.16, "duration": 6.35}, {"text": "Place dividing uncontrollably to form a massive unwanted lump that spreads infecting the surrounding area with fan boy roars of Moe love", "start": 339.51, "duration": 7.199}, {"text": "Hence, the term cancer public sightings are rare. So many assume they are shut-ins who do not exercise in truth", "start": 346.71, "duration": 5.85}, {"text": "They are merely hibernating conserving their energy to the next idol concert where they are able to release all", "start": 352.56, "duration": 4.98}, {"text": "limiters doing a workout that breaks all known laws of physical human exertion within the space of a single aqua song and then we get", "start": 357.73, "duration": 6.769}, {"text": "to the intellectual evolved from the now endangered", "start": 364.5, "duration": 2.85}, {"text": "elitist the intellectual is on a journey to prove anime should be a deeply respected medium through nuanced analysis and critical discourse", "start": 367.54, "duration": 6.589}, {"text": "But deep down they know they are just looking for a way to justify the countless hours", "start": 374.29, "duration": 3.799}, {"text": "They have sunk into watching anime with no tangible achievement or merit to show for it", "start": 378.09, "duration": 4.019}, {"text": "The biggest difference between them and old school elitists is that in this day and age anime is such a wide medium", "start": 382.38, "duration": 4.709}, {"text": "So there is no longer widely accepted right taste in anime, and it is more about being able to provide a deeper well-informed", "start": 387.09, "duration": 6.39}, {"text": "justifications for one's taste", "start": 394.12, "duration": 1.31}, {"text": "however", "start": 395.43, "duration": 0.46}, {"text": "While many intellectuals may seek to enlighten the uninformed casual some may use their newfound powers to put themselves up on a pedestal", "start": 395.89, "duration": 6.6}, {"text": "perhaps they'll still unironically judge people by the number of entries on there my anime list like it's still", "start": 402.71, "duration": 4.91}, {"text": "2008 proving that while there is no right taste in anime anymore", "start": 407.9, "duration": 3.949}, {"text": "There is still definitely a wrong one though a close cousin to the intellectual", "start": 411.85, "duration": 5.46}, {"text": "We have the animationtaku a new species that has risen very recently within the anime fandom", "start": 417.31, "duration": 4.919}, {"text": "The animationtaku is a black hole for any and all knowledge about anime production", "start": 422.44, "duration": 3.84}, {"text": "They can tell you the coffee girl who is working during production on the certain episode of anime and follows approximately", "start": 426.29, "duration": 5.209}, {"text": "7,000 different animators on Twitter while they still technically enjoy anime", "start": 431.66, "duration": 3.86}, {"text": "The anime itself is an insignificant factor when compared to the knowledge of the staff members who worked on it, though?", "start": 435.52, "duration": 4.949}, {"text": "they will still experience a single involuntary orgasm at the sight of any impact frames an easy way to distinguish them is by the", "start": 440.47, "duration": 6.029}, {"text": "Uncontrollable response of disgust when someone mentions they know about anime production because they watched Shiro Barco next up", "start": 446.6, "duration": 6.35}, {"text": "We have the manga reader", "start": 452.95, "duration": 1.59}, {"text": "these are a", "start": 454.54, "duration": 0.73}, {"text": "mysterious species as we know they exist but they only really surfaced the moment an anime is announced then they all come out of the", "start": 455.27, "duration": 5.75}, {"text": "Rocks and proclaim that they've been looking forward to this", "start": 461.02, "duration": 1.75}, {"text": "Adaptation for forever only for the rest of the enemy community to wonder where the fuck they've been this entire time", "start": 462.77, "duration": 4.7}, {"text": "A true manga reader doesn't have time for anime and has realized that reading manga is a far more", "start": 467.71, "duration": 4.409}, {"text": "Efficient way to consume as much of it as possible", "start": 472.28, "duration": 2.0}, {"text": "What makes them hard to distinguish is that they may look act and talk like anime fans", "start": 474.29, "duration": 4.85}, {"text": "however", "start": 479.21, "duration": 0.5}, {"text": "in reality", "start": 479.71, "duration": 0.69}, {"text": "They would just watch one episode of an anime where they have read the source material and then pretend to everyone like they actually watch", "start": 480.4, "duration": 5.279}, {"text": "The whole damn thing. That's right. Manga readers", "start": 485.68, "duration": 2.52}, {"text": "we know. next we get to the Fujoshi", "start": 488.84, "duration": 2.86}, {"text": "ONLY ONE MAN AT A TIME YOU DIRTY WEEBS, I repeat ONLY ONE MAN AT A TIME", "start": 492.34, "duration": 4.98}, {"text": "Fujoshi are obsessed with men though have probably never interacted with one in their lifetime studies have shown they gain their lifeblood by shipping", "start": 497.86, "duration": 7.3}, {"text": "Any two males who are within a 10 meter radius of each other?", "start": 505.169, "duration": 2.73}, {"text": "Failure to observe any and all ships for an extended period of time will cause them to dissolve into a messy goop of gay porn", "start": 508.05, "duration": 5.489}, {"text": "It is said that every female fan possesses a dormant Fujo gene", "start": 513.539, "duration": 3.66}, {"text": "Even if they haven't activated it to become a full-blown fujoshi", "start": 517.2, "duration": 2.94}, {"text": "The early effects of this gene can be seen when females grow an unhealthy addiction to mystic messenger finding out their heart skipped a beat", "start": 520.289, "duration": 5.58}, {"text": "Seeing gifs of beautiful Asian boys almost kissing and fully completing their activation when they can sing the first verse of unravel by heart last", "start": 525.87, "duration": 6.33}, {"text": "But not least we have the cosplayer", "start": 532.2, "duration": 2.279}, {"text": "These are the breeds which have the largest exposure through pictures that have been spread online though. It is not commonly", "start": 534.61, "duration": 4.88}, {"text": "Known that after a photoshoot is finished", "start": 539.49, "duration": 1.83}, {"text": "They will disintegrate - back into their natural form of a pile of bobby pins and fabric tape while most humans live by a standard", "start": 541.32, "duration": 5.88}, {"text": "7 day Gregorian calendar cosplays", "start": 547.2, "duration": 2.13}, {"text": "will instead track their time in relation to how many days they have left until the next anime convention and thus exist in a perpetual", "start": 549.33, "duration": 5.519}, {"text": "State of panic trying to figure out how they're gonna complete their next costume in time", "start": 554.85, "duration": 3.3}, {"text": "recently cosplaying has evolved from just a side hobby to something people can actually do for their full-time job if you're a girl then all", "start": 558.36, "duration": 5.88}, {"text": "you need to do is grow a small but dedicated following and you may be able to turn this into your full-time profession through a", "start": 564.24, "duration": 4.59}, {"text": "combination of patreon streaming and selling prints and if you're a guy then all you need to do is", "start": 568.83, "duration": 4.769}, {"text": "Yeah. Alright, good luck with that mate. This concludes our tour of the modern zoo of anime fans", "start": 575.05, "duration": 4.22}, {"text": "Remember the anime craze has spread far further than we all imagined and knowledge is key to stopping this plague if you suspect that anyone", "start": 579.31, "duration": 7.13}, {"text": "Amongst you may watch anime", "start": 586.44, "duration": 1.2}, {"text": "Please inform your nearest police officer immediately so they can be quarantined and destroyed before they are able to contaminate anyone with their shit taste", "start": 587.64, "duration": 7.169}, {"text": "Have a lovely day", "start": 595.08, "duration": 2.0}, {"text": "Hey guys, so if you enjoyed that video", "start": 599.56, "duration": 2.0}, {"text": "Thank you again to honkai impact 3rd for sponsoring this video if you want to give that a shot just click the link", "start": 601.6, "duration": 4.76}, {"text": "In the dooblydoo and they'll bring you to whatever store your device is on and also thank you very much to robert Eyeborg", "start": 606.36, "duration": 6.239}, {"text": "Basil patrick Madison Larkin and erryone else on patreon for helping to support me for this month. and making this video possible", "start": 612.839, "duration": 6.5}, {"text": "I see a lot of you have been posting me pictures of your motherfucking tea mugs, which have now been posted out", "start": 619.34, "duration": 4.049}, {"text": "so hopefully you guys are you enjoying your tea or", "start": 623.389, "duration": 2.271}, {"text": "Coffee in these mugs and also you can watch some of my other videos", "start": 626.42, "duration": 3.72}, {"text": "or follow me on Twitter or Instagram for some my other shenanigans", "start": 630.14, "duration": 2.9}, {"text": "But aside from that until my next video I've been giguk and I will see you all next time", "start": 633.21, "duration": 6.289}]