[{"text": "It is May 2018 and I have traveled to these countries so far:", "start": 0.075, "duration": 3.725}, {"text": "It has been an intense schedule. I've been travelling on the road full", "start": 11.165, "duration": 3.02}, {"text": "time eight, ten months out of my backpack,", "start": 14.185, "duration": 2.96}, {"text": "as a minimalist, full time on the road, I don't have a house right now. I've been to", "start": 17.145, "duration": 3.055}, {"text": "about 45 countries and counting. But believe it or not", "start": 20.2, "duration": 2.64}, {"text": "at some stage, I had to start travelling for the very first time.", "start": 22.845, "duration": 2.855}, {"text": "So this video is dedicated for those hitting the road for the first", "start": 25.705, "duration": 2.7}, {"text": "time. Some tips and tricks to make you feel more at ease for the", "start": 28.405, "duration": 3.03}, {"text": "adventure of a lifetime you're about to embark on.", "start": 31.435, "duration": 2.32}, {"text": "[Music]", "start": 35.745, "duration": 1.0}, {"text": "On the screen here, these are the best places  to visit", "start": 37.405, "duration": 2.53}, {"text": "for first time travelers. Some countries", "start": 39.935, "duration": 2.09}, {"text": "are a lot easier to travel to than others that's why I'm recommending these", "start": 42.025, "duration": 3.01}, {"text": "ones because they are easy to travel to, affordable", "start": 45.035, "duration": 2.94}, {"text": "beautiful, easy to get around. Mostly in touristy places people speak", "start": 47.975, "duration": 3.1}, {"text": "English, easy to meet people. It's", "start": 51.075, "duration": 2.12}, {"text": "just a joy to travel to these places. So I couldn't recommend going", "start": 53.195, "duration": 3.03}, {"text": "to these places more for the first time. Of course this list is not", "start": 56.225, "duration": 2.96}, {"text": "fully comprehensive and lots of people might disagree on", "start": 59.185, "duration": 2.8}, {"text": "certain things. My opinion, though. What to see when you get to a place? Believe it or not", "start": 61.985, "duration": 3.38}, {"text": "Google exists in different countries. Just google", "start": 65.365, "duration": 2.82}, {"text": "top destinations to see when you're in this country and", "start": 68.185, "duration": 2.73}, {"text": "it's gonna spit out amazing suggestions. And then, on top of that,", "start": 70.915, "duration": 2.92}, {"text": "I would love for you to speak to the locals, whether you're staying", "start": 73.835, "duration": 2.58}, {"text": "in a hostel, Airbnb -ask the receptionist, the host, the best", "start": 76.415, "duration": 2.84}, {"text": "places they love to go to because they've lived there for a while,", "start": 79.255, "duration": 2.93}, {"text": "they can provide you with the best of the best advice. And of course", "start": 82.185, "duration": 2.69}, {"text": "speak to people that you've met, ask their journey, what they loved", "start": 84.875, "duration": 2.96}, {"text": "about the place, what they haven't loved and just figure out what is gonna be", "start": 87.835, "duration": 2.82}, {"text": "the best itinerary for you. A new country, the best way for", "start": 90.655, "duration": 2.83}, {"text": "me to explore and get the most out of it is to get my", "start": 93.485, "duration": 3.02}, {"text": "bearings of the place. So when I first land, I'm confused.", "start": 96.505, "duration": 2.89}, {"text": "I have no idea what anything is and everyone's gonna", "start": 99.395, "duration": 2.94}, {"text": "experience this. The best way to tackle this is to spend half a day", "start": 102.335, "duration": 2.86}, {"text": "or maybe a day just getting lost. Allowing yourself to", "start": 105.195, "duration": 3.18}, {"text": "aim wanderlessly (sic)", "start": 108.38, "duration": 1.38}, {"text": "Figure out where the local supermarket is, figure out  where the strip of best cafe is,", "start": 112.84, "duration": 3.64}, {"text": "figure out where the things to do are in your", "start": 116.485, "duration": 2.61}, {"text": "periphery. Knowing this really lets you", "start": 119.095, "duration": 2.52}, {"text": "to understand the city's layout and get the most out of the city.", "start": 121.615, "duration": 3.04}, {"text": "Booking accommodation overseas isn't ... isn't so difficult.", "start": 124.655, "duration": 3.15}, {"text": "For hostels, I use Hostelworld. I oftentimes", "start": 127.805, "duration": 2.48}, {"text": "also use booking.com especially in countries that are", "start": 130.285, "duration": 2.39}, {"text": "really affordable. Sometimes you'll be surprised how cheap a hotel room", "start": 132.675, "duration": 2.87}, {"text": "can be. However, just keep in mind it is a lot", "start": 135.545, "duration": 3.19}, {"text": "harder to meet people when you're staying in a hotel. That's why very", "start": 138.735, "duration": 3.1}, {"text": "often I still choose a hostel over a hotel", "start": 141.835, "duration": 1.97}, {"text": "in a new country because I wanna have friends when I'm travelling.", "start": 143.805, "duration": 2.48}, {"text": "So if I'm going solo for example, hostels are my bestfriend,", "start": 146.285, "duration": 2.68}, {"text": "if you're going with a group of friends, don't worry, hotels are fine. And", "start": 148.965, "duration": 2.96}, {"text": "of course, Airbnb is a really great solution also. So I use", "start": 151.925, "duration": 3.1}, {"text": "all three platforms to find me a place to sleep. If you are on a really", "start": 155.025, "duration": 3.1}, {"text": "tight budget, you can use couchsurfing or you can also volunteer", "start": 158.125, "duration": 3.1}, {"text": "in countries abroad using websites like this. Passports and visas", "start": 161.225, "duration": 3.21}, {"text": "very important. You can get stuck", "start": 164.48, "duration": 1.82}, {"text": "and denied entry if you don't have a visa. So every single time", "start": 166.4, "duration": 3.075}, {"text": "you go to a new country, every time, just type in your passport,", "start": 169.475, "duration": 2.98}, {"text": "your destination country, visa do you need. And it's gonna spit out", "start": 172.455, "duration": 3.13}, {"text": "how long you can go into this country without having a visa,", "start": 175.685, "duration": 2.78}, {"text": "what kind of visa you do need, if you have to have one. And with your", "start": 178.465, "duration": 3.01}, {"text": "passport, it has to have six months minimum validity. So", "start": 181.475, "duration": 2.76}, {"text": "if it's not valid for more than six months, you will get stuck,", "start": 184.235, "duration": 2.81}, {"text": "you will not be able to travel, you might even buy a", "start": 187.045, "duration": 2.43}, {"text": "ticket, go to the airport, they'll check the expiry, if it's less than six months,", "start": 189.475, "duration": 2.76}, {"text": "you are not flying. And that is an expensive mistake.", "start": 192.235, "duration": 3.04}, {"text": "Also have backups of your documents stored all around. So", "start": 195.275, "duration": 3.4}, {"text": "online, in different bags, just in case you need them as well. I do recommend", "start": 198.675, "duration": 3.04}, {"text": "having insurance because things can go wrong when", "start": 201.715, "duration": 2.4}, {"text": "you're overseas. Things can get stolen.", "start": 204.115, "duration": 2.31}, {"text": "I've only had one pair of shoes stolen in 12 years so it's not that", "start": 206.425, "duration": 2.61}, {"text": "big of an issue at all. Things can get lost, broken,", "start": 209.035, "duration": 2.93}, {"text": "you can get sick so insurance is really, really great. Currently", "start": 211.965, "duration": 3.01}, {"text": "I have insurance with my credit card and it's beautiful. And", "start": 214.975, "duration": 2.76}, {"text": "I've used other services in the past but I don't wanna recommend any brand", "start": 217.735, "duration": 3.02}, {"text": "because I don;t research into this area anymore because I'm so", "start": 220.755, "duration": 3.04}, {"text": "well settled with the current insurance that I have.", "start": 223.795, "duration": 2.61}, {"text": "This is up to you to find out what works best for you, what best coverage is,", "start": 226.405, "duration": 2.85}, {"text": "etc. etc. So do your research. On that note, getting sick on the", "start": 229.255, "duration": 3.09}, {"text": "road, as I mentioned, can happen. And most countries have amazing", "start": 232.345, "duration": 2.87}, {"text": "facilities as well for hospitals. Of course some third world", "start": 235.215, "duration": 2.77}, {"text": "countries aren't the best. But I've never been to a hospital in", "start": 237.985, "duration": 2.915}, {"text": "like 12 -ish years of travel. Ever. If I have to", "start": 240.9, "duration": 2.98}, {"text": "say for example, break my arm. Knock on wood. Not breakin nothin.", "start": 243.88, "duration": 3.085}, {"text": "I'd go to the local hospital, get something put on", "start": 246.965, "duration": 2.81}, {"text": "to it like a really crappy cast for example and find", "start": 249.775, "duration": 2.28}, {"text": "myself to a nearby country where I know the standard of healthcare", "start": 252.055, "duration": 3.06}, {"text": "is immaculate and I can get my arm worked after.", "start": 255.115, "duration": 3.08}, {"text": "So there are always solutions so don't freak out.", "start": 258.2, "duration": 1.98}, {"text": "Having money on the road is essential, believe it or not. Right now the deal I have with", "start": 260.2, "duration": 3.875}, {"text": "my bank is [stammers]", "start": 264.08, "duration": 2.56}, {"text": "... is amazing. So I don't", "start": 266.74, "duration": 2.6}, {"text": "have to worry about these ever. No matter if I", "start": 269.34, "duration": 2.24}, {"text": "buy something for $2 with my card, or a hundred dollars, if I withdraw", "start": 271.585, "duration": 3.07}, {"text": "cash, nothing. So if my bank can do it, I'm certain", "start": 274.655, "duration": 3.44}, {"text": "there are banks out there that are able to provide this service.", "start": 278.105, "duration": 2.59}, {"text": "There are also travel cards, credit card deals, figure out the", "start": 280.695, "duration": 3.03}, {"text": "best solution for you. Again you have to do your research.", "start": 283.725, "duration": 3.0}, {"text": "Every country is different. Every bank is different. If", "start": 286.725, "duration": 2.39}, {"text": "you haven't been able to find this deal before you're going overseas,", "start": 289.12, "duration": 2.995}, {"text": "a great way to avoid a lot of fees is to take out a chunk of money. With this worth of", "start": 292.12, "duration": 3.345}, {"text": "cash, make sure you separate it so it's not in one area 'cause", "start": 295.465, "duration": 2.675}, {"text": "if it gets lost or stolen, that would suck bad.", "start": 298.14, "duration": 2.74}, {"text": "Overpacking. Yeah, everyone. Oh my gosh, everyone does this.", "start": 301.08, "duration": 2.98}, {"text": "My rule of thumb whenever I'm packing. Even now, always,", "start": 304.235, "duration": 2.99}, {"text": "whatever you think you're gonna bring, halve it and", "start": 307.225, "duration": 2.92}, {"text": "then halve it again. You really need so", "start": 310.145, "duration": 2.99}, {"text": "little when you're on the road. It's ridiculous. And it's better to have less", "start": 313.14, "duration": 2.74}, {"text": "so you can buy a couple of more things if you're overseas than have too much and  you;re dragging", "start": 315.88, "duration": 3.92}, {"text": "it around like crazy, it hurts your back, it's just awkward.", "start": 319.8, "duration": 3.155}, {"text": "being connected when you're on the road is awesome because it gives you", "start": 322.955, "duration": 3.11}, {"text": "access to knowledge about where to eat, what good things to explore,", "start": 326.065, "duration": 3.06}, {"text": "you can contact your family and friends wherever, and the best way to be connected", "start": 329.125, "duration": 2.97}, {"text": "is through your phone. You are always with it, however,", "start": 332.095, "duration": 2.75}, {"text": "using your service provider back home is very expensive.", "start": 334.845, "duration": 2.81}, {"text": "So my solution to that is just to get a local sim", "start": 337.655, "duration": 2.05}, {"text": "card in every single country I go to and then I'm good. I'm set.", "start": 339.705, "duration": 3.16}, {"text": "It's not expensive and I'm connected everywhere.", "start": 342.865, "duration": 1.91}, {"text": "It's genius. Once you;re done in that country, just get rid of the sim card.", "start": 345.085, "duration": 3.27}, {"text": "Voila! Safety. No matter where in the world you are", "start": 348.435, "duration": 3.03}, {"text": "there are still creeps. You have to be aware of that. So you just have", "start": 351.465, "duration": 3.18}, {"text": "to be on your guard, aware of your surroundings. Please don't get", "start": 354.645, "duration": 3.015}, {"text": "ultra drunk when you're overseas. Don't walk around at nighttime", "start": 357.66, "duration": 2.08}, {"text": "by yourself, don't walk around at nighttime with headphones", "start": 359.74, "duration": 2.28}, {"text": "by yourself, don't draw attention to yourself and look", "start": 362.025, "duration": 2.18}, {"text": "like a lost, confused tourist. If you're looking for a destination or", "start": 364.205, "duration": 2.85}, {"text": "accommodation, or something, don't stop and just be like, where am I going?", "start": 367.055, "duration": 2.99}, {"text": "Go into like a little convenience store, look down, check your map,", "start": 370.045, "duration": 2.69}, {"text": "calmly, collectively be like, ooh I get it", "start": 372.735, "duration": 2.99}, {"text": "and then walk and continue going. And... uh... just blend in", "start": 375.725, "duration": 3.25}, {"text": "as much as you possibly can. I never say that because should ever", "start": 378.975, "duration": 3.27}, {"text": "blend in. But when you're travelling you should definitely blend in. Don't be unique.", "start": 382.245, "duration": 3.315}, {"text": "Only in this instance. Don't cram. A lot of us", "start": 385.9, "duration": 2.1}, {"text": "have a tendency to do this when we first travel because we feel like", "start": 388.0, "duration": 3.08}, {"text": "if we don't see this place, we might never see it again.", "start": 391.425, "duration": 2.05}, {"text": "It is much better though to just enjoy the experience because", "start": 394.115, "duration": 2.91}, {"text": "you sometimes cram so much that you forget what you've seen", "start": 397.025, "duration": 2.935}, {"text": "or you forget to breathe and be present in these destinations. So just chill out.", "start": 399.96, "duration": 4.32}, {"text": "Allow extra time for weird, unexpected adventures. If you", "start": 404.32, "duration": 2.955}, {"text": "meet someone in a hostel for example and they wanna go on an adventure, they", "start": 407.28, "duration": 3.025}, {"text": "invite you, if you've got a list of things you have to do,", "start": 410.305, "duration": 3.035}, {"text": "you're gonna miss out on what might be a much,", "start": 413.4, "duration": 2.78}, {"text": "much better adventure. So just list the top 5 things that you're", "start": 416.185, "duration": 2.81}, {"text": "desperately wanting to do and if these things on the list that you like ...", "start": 419.0, "duration": 3.4}, {"text": "I'm not so sure about that ... just don't do it. Don't feel bad about it.", "start": 422.46, "duration": 3.12}, {"text": "Really. And that's another thing. Don't allow anyone to tell", "start": 425.6, "duration": 2.835}, {"text": "you how to travel. If you love luxury travel, save", "start": 428.435, "duration": 3.08}, {"text": "up and do that. If you love hostel living, couchsurfing,", "start": 431.515, "duration": 2.97}, {"text": "that kind of thing, do that. If you do wanna cram your travels, do that.", "start": 434.485, "duration": 3.06}, {"text": "If you wanna space out and not do anything, just", "start": 437.545, "duration": 2.76}, {"text": "chill on the beach, do that. Travel is for you to discover yourself,", "start": 440.305, "duration": 3.03}, {"text": "unwind, make the most of it, enjoy life", "start": 443.34, "duration": 2.845}, {"text": "and it is different for everyone. Really different for everyone. So just", "start": 446.185, "duration": 2.815}, {"text": "do you. I wanna thank Square Space for sponsoring this video", "start": 449.0, "duration": 3.4}, {"text": "Whether you need a domain, website, or online store, make with", "start": 452.4, "duration": 2.9}, {"text": "Square Space. It's very handy having a website where all my travel", "start": 455.305, "duration": 3.0}, {"text": "content in one spot. It's a perfect business card to show off my skills. They are an all in one", "start": 458.305, "duration": 3.15}, {"text": "platform. There's nothing to install, patch or upgrade, ever.", "start": 461.455, "duration": 2.42}, {"text": "Alongside award-winning 24/7 customer service, it's", "start": 464.065, "duration": 2.86}, {"text": "never been easier to keep track of your worldwide adventure so check out", "start": 466.925, "duration": 2.895}, {"text": "squarespace.com for a free trial. And when you're ready to launch", "start": 469.82, "duration": 3.22}, {"text": "go to squarespace.com/sorelle to save 10% off", "start": 473.045, "duration": 3.09}, {"text": "your first purchase of a domain or website.", "start": 476.135, "duration": 2.55}, {"text": "Congratulations again for your first adventure. This is so very", "start": 479.015, "duration": 3.08}, {"text": "exciting. If you wanna check out my Instagram with all my adventures, please do so", "start": 482.145, "duration": 2.97}, {"text": "here. And until next time. Peace.", "start": 485.115, "duration": 2.05}]