[{"text": "Balancing a pencil or any other top heavy object on its tip is quiet precarious task", "start": 2.54, "duration": 5.02}, {"text": "It's easy to see why top heavy objects are unstable", "start": 7.68, "duration": 2.3}, {"text": "They just...Wanna fall down", "start": 10.48, "duration": 1.66}, {"text": "Any little nudge will put it off balance", "start": 12.26, "duration": 2.0}, {"text": "with gravity happy to pull its center of mass even more off balance and the more off balance it is, the more gravity pulls until...", "start": 14.28, "duration": 6.72}, {"text": "Physicist call this kind of tipping an Inverted pendulum, becouse it´s kind of like upside down pendulum.", "start": 21.54, "duration": 5.0}, {"text": "And careful mathematical analysis of inverted pendulums will tell you the obvious:", "start": 26.54, "duration": 3.86}, {"text": "They're really unstable. In fact, these equations predict that if a perfectly balanced pencil with a perfectly sharp tip", "start": 30.4, "duration": 5.96}, {"text": "were to get nudged off balance by just 1/10000th of the width of an atom,", "start": 36.36, "duration": 4.4}, {"text": "it would take only three seconds to fall over.", "start": 40.76, "duration": 2.88}, {"text": "There are indeed acrobats who can balance poles with other acrobats on top,", "start": 44.02, "duration": 3.54}, {"text": "and robots that can balance and catch and throw upright sticks,", "start": 47.56, "duration": 3.76}, {"text": "and people who make seemingly impossible artistic rock stacks.", "start": 51.32, "duration": 3.64}, {"text": "But in all these cases, keeping the objects balanced either requires an active stabilization effort,", "start": 54.96, "duration": 5.5}, {"text": "or else carefully taking advantage of the fact that the balancing point isn't actually a point.", "start": 60.46, "duration": 4.56}, {"text": "So the question is this: can you balance a pencil sharpened to a perfect single atom wide tip", "start": 65.02, "duration": 5.06}, {"text": "on its tip, without active stabilization?", "start": 70.08, "duration": 2.6}, {"text": "Well, to start, you'd better get rid of all the air bumping off the sides of the pencil,", "start": 72.8, "duration": 3.24}, {"text": "since the kinetic energy of a typical oxygen molecule is enough to destabilize the pencil", "start": 76.04, "duration": 4.38}, {"text": "Remember: if the pencil gets off-centered by even 1/10000th the width of an atom,", "start": 80.42, "duration": 4.2}, {"text": "it'll fall down in under three seconds.", "start": 84.62, "duration": 2.1}, {"text": "And you'd better cool the pencil and table down as close to absolute 0 as you can,", "start": 86.72, "duration": 4.42}, {"text": "since the thermal jiggling of their atoms when they're hotter will similarly jiggle the pencil off balance.", "start": 91.14, "duration": 5.14}, {"text": "But even then, matter at very small scales has a spread-out, wave-like nature", "start": 96.28, "duration": 4.18}, {"text": "which means you can't have both the pencil perfectly upright", "start": 100.46, "duration": 2.78}, {"text": "and not moving at the same time.", "start": 103.24, "duration": 2.0}, {"text": "And while this quantum effect is never a real life inhibitor of precarious pencil balancing,", "start": 105.24, "duration": 4.5}, {"text": "it means you never even COULD succeed.", "start": 109.74, "duration": 2.2}, {"text": "However, it's still fun to see how long you can keep a pencil balanced on your fingertip.", "start": 111.94, "duration": 4.1}, {"text": "The shorter the pencil, the harder it is.", "start": 116.04, "duration": 2.26}, {"text": "My best time for a standard 19 cm pencil was 1,3 seconds.", "start": 118.3, "duration": 4.26}, {"text": "Think you can beat it?", "start": 122.56, "duration": 2.0}, {"text": "This minutephysics video was brought to you by Audible.com,", "start": 125.76, "duration": 2.74}, {"text": "one of the leading providers of online audiobooks across all types of media", "start": 128.5, "duration": 3.42}, {"text": "including fiction, non-fiction, and periodicals.", "start": 131.92, "duration": 2.86}, {"text": "I'd like to recommend The Tipping Point by Malcolm Gladwell this week.", "start": 134.78, "duration": 3.7}, {"text": "It's a book about exponential increases in spreads, uh, trends, social trends epidemics, that sort of thing.", "start": 138.48, "duration": 7.56}, {"text": "And, uh, it's - the mathematic is somewhat related to the mathematics of", "start": 146.04, "duration": 3.8}, {"text": "balancing an object on its... tip, so, anyway, The Tipping Point, by Malcolm Gladwell.", "start": 149.84, "duration": 5.82}, {"text": "Audible.com supports minutephysics and without them, we wouldn't be able to do what we do, so...", "start": 155.66, "duration": 5.0}, {"text": "Thank you to Audible, and, uh, head to audible.com/minutephysics to get your free audiobook.", "start": 160.66, "duration": 6.96}]