[{"text": "The Sun and the Moon are about the same size\nwhen you look at them in the sky, though that’s", "start": 1.12, "duration": 3.77}, {"text": "just thanks to the coincidence that the Sun\nis about 400 times farther away than the Moon", "start": 4.89, "duration": 4.11}, {"text": "and also about 400 times bigger.\nAnother fun coincidence is that the radius of the Sun", "start": 9.0, "duration": 4.62}, {"text": "is about twice the distance to the moon, so\nif you put the sun where the Earth is,", "start": 13.62, "duration": 3.68}, {"text": "the Moon would be just over halfway to the surface\nof the Sun.", "start": 17.3, "duration": 3.34}, {"text": "The Sun is also so big that it takes light\nover 4 and a half seconds to travel across", "start": 20.64, "duration": 4.29}, {"text": "its face – though I don't know whether that\nsays more about how big the Sun is, or how", "start": 24.93, "duration": 3.55}, {"text": "slow light is, or both.", "start": 28.48, "duration": 2.11}, {"text": "What about the scale of other solar system\nobjects? Well, here are Pluto and Charon compared", "start": 30.59, "duration": 4.629}, {"text": "to the Earth and the Moon.", "start": 35.219, "duration": 1.09}, {"text": "And Jupiter; which, as a rough rule of thumb,\nhas about 10 times the radius of the earth", "start": 36.309, "duration": 4.601}, {"text": "and one tenth the radius of the Sun.", "start": 40.91, "duration": 2.57}, {"text": "Saturn is slightly smaller than Jupiter, though\nits rings go out twice as far – still only", "start": 43.48, "duration": 4.78}, {"text": "a third of the way to the Moon, though.", "start": 48.26, "duration": 2.049}, {"text": "Mars’ moons are very close and very small,\nwhich gives rise to another moon-sized coincidence:", "start": 50.309, "duration": 6.111}, {"text": "Phobos is almost the same size in the martian\nsky as the Sun, and can cause annular eclipses", "start": 56.42, "duration": 5.25}, {"text": "just like our Moon here on Earth.", "start": 61.67, "duration": 2.009}, {"text": "If two objects have the same apparent size\nin the sky, like the Moon and the Sun, it", "start": 63.679, "duration": 4.541}, {"text": "means that their radii divided by their distances\nare about the same value. This also implies", "start": 68.22, "duration": 5.03}, {"text": "that the strengths of the objects’ tidal\nforces, which are roughly proportional to", "start": 73.25, "duration": 3.53}, {"text": "the radius over the distance cubed, will also\nbe about the same. In fact, ANY two objects", "start": 76.78, "duration": 4.66}, {"text": "of roughly the same density that look about\nthe same size in the sky will have tidal forces", "start": 81.44, "duration": 4.34}, {"text": "of similar strengths.", "start": 85.78, "duration": 1.56}, {"text": "So while the apparent equal size of the moon\nand sun in our sky is a coincidence, the fact", "start": 87.34, "duration": 4.84}, {"text": "that they have similar apparent sizes AND\nroughly similar effects on the tides is a", "start": 92.18, "duration": 4.27}, {"text": "consequence - \nof geometry\nand physics.", "start": 96.45, "duration": 6.72}]