[{"text": "*commercials*", "start": 0.0, "duration": 77.254}, {"text": "Ladies and gentlemen, welcome! Let’s begin with the main thing. We are in a Lamborghini.", "start": 77.304, "duration": 4.336}, {"text": "That’s the Urus. It is the first crossover which Lamborghini ever made.", "start": 81.69, "duration": 3.326}, {"text": "This is a rental car, and its rent costs some big money even per day!", "start": 85.066, "duration": 5.429}, {"text": "And I was like: \"What bullshit, no one cares about that car; nobody would rent it.", "start": 92.997, "duration": 4.391}, {"text": "But okay, I will take it. Let's make a video about Urus.", "start": 97.438, "duration": 4.091}, {"text": "And they said that I had only one day to rent it because there’s a two-week waiting list.", "start": 101.579, "duration": 7.953}, {"text": "I also was on that list to make a video, and 14 more people are ready to pay a crazy price", "start": 109.582, "duration": 10.076}, {"text": "for driving it during one day only. WHAT?", "start": 119.708, "duration": 5.364}, {"text": "Why is it so attractive? How does that car work?", "start": 125.322, "duration": 6.138}, {"text": "Why are people willing to give such crazy money for renting and buying it? It costs $300000!", "start": 131.51, "duration": 9.086}, {"text": "And why I’m on fire already??? I’ve just got my ass on that seat!", "start": 140.646, "duration": 4.794}, {"text": "Lamborghini-f*cking-Urus, today, is on the test!", "start": 145.89, "duration": 4.529}, {"text": "Holy shit! 3,7! 3,7!", "start": 181.111, "duration": 4.29}, {"text": "Going deeper through this enchanting spectacle, because of which you’ve already gone crazy,", "start": 185.451, "duration": 4.356}, {"text": "you recognize the mode in which the car would murder you.", "start": 189.857, "duration": 4.224}, {"text": "It's because even when you are getting ready to make the launch,", "start": 194.131, "duration": 2.805}, {"text": "and you know that it will be fastened in a moment, the one completely exceeds your expectations.", "start": 196.986, "duration": 4.994}, {"text": "But then you're going out, and you're watching it and saying: \"Wait for a second! That's the blank switch!”", "start": 202.03, "duration": 7.171}, {"text": "There’s no adaptive cruise control!", "start": 209.251, "duration": 2.401}, {"text": "Then you are looking at your windshield, and you see that there's no head-up display!", "start": 211.702, "duration": 6.584}, {"text": "So what exactly I got when I paid $300k for that?", "start": 218.336, "duration": 4.79}, {"text": "Okay, I have an air suspension and some other shit, but still, there's no soft closing door!", "start": 223.176, "duration": 7.036}, {"text": "These handles too. This is Lambo, but look! They're usual.", "start": 230.262, "duration": 7.191}, {"text": "They don’t flush with the body of the car, they’re not popping out,", "start": 237.503, "duration": 2.848}, {"text": "and they’re not hidden or somehow complicated as we got used to.", "start": 240.401, "duration": 3.537}, {"text": "Is it Volkswagen here?", "start": 243.988, "duration": 2.796}, {"text": "And when we open the hood, we see \"Made in Germany” everywhere.", "start": 247.234, "duration": 4.342}, {"text": "I didn’t know that Germany has that flag. I was thinking that…", "start": 251.626, "duration": 3.37}, {"text": " Well, probably someone has already invaded the country and our slogan “We can do it again” someone already did…", "start": 255.046, "duration": 6.346}, {"text": "So, that’s all kind of weird. And you’re starting to get the hang of this.", "start": 261.442, "duration": 4.471}, {"text": "And you begin to understand that your money was paid not for the things you supposed to.", "start": 265.963, "duration": 5.286}, {"text": "And this price was made by taking one thing, then adding second thing", "start": 271.299, "duration": 8.863}, {"text": "and here you have a hybrid of two things: Lamborghini and Volkswagen.", "start": 280.212, "duration": 4.464}, {"text": "And what exactly is left here from Lambo? Of course, this is the interior.", "start": 323.424, "duration": 6.069}, {"text": "It’s the unusual gearbox control", "start": 330.343, "duration": 3.349}, {"text": "because we know that it was always uncommon in Lambo, and there was a semi-automatic transmission.", "start": 333.742, "duration": 4.424}, {"text": "Here everything is a bit weird, for example, when I need to reverse the gear, I have to do that thing, I have to do that thing,", "start": 338.216, "duration": 4.259}, {"text": "and when I want to move forward again, I have to pull the right shift paddle to turn the 1st gear on.", "start": 342.525, "duration": 4.637}, {"text": "It will even run if I release the brake.", "start": 347.212, "duration": 2.939}, {"text": "There's Also “M button” and start-stop button, of course, under the red flip cover, as it’s done in aviation style.", "start": 350.201, "duration": 6.142}, {"text": "On the left, there's a drive mode selector, and it's making unpleasant clicking.", "start": 356.393, "duration": 5.93}, {"text": "Not cool. And on the right, there's another selector which is for configurable drive mode.", "start": 366.212, "duration": 6.534}, {"text": "It's called EGO. These are settings which you choose yourself.", "start": 372.796, "duration": 3.533}, {"text": "You can select steering, suspension, shock absorbers, and AWD.", "start": 376.379, "duration": 6.514}, {"text": "Each one you can make not even soft or hard, but adjust them somewhere in the middle range.", "start": 383.743, "duration": 6.292}, {"text": "In that way, you could make a 0-100 acceleration and choose a soft suspension and", "start": 390.085, "duration": 4.972}, {"text": "sensitive steering and locked AWD coupling.", "start": 395.107, "duration": 4.456}, {"text": "For the race track, accordingly, I may select other settings and so on.", "start": 399.613, "duration": 3.449}, {"text": "These blank switches in the interior are annoying me right from the beginning.", "start": 403.312, "duration": 5.428}, {"text": "To my mind when I get a car of high class, it's better to make it without any blank switches.", "start": 408.79, "duration": 9.539}, {"text": "It was implemented in vehicles of a lower cost. But for some reason, it wasn't done here.", "start": 418.379, "duration": 6.607}, {"text": "You could buy similar wheels in both concerns, and none of them will have blank switches.", "start": 425.036, "duration": 5.52}, {"text": "I am glad that this car is authentic.", "start": 430.606, "duration": 2.9}, {"text": "In this Lambo, you won't see any parts from Audi, from Volkswagen, from Skoda, from Porsche.", "start": 433.556, "duration": 8.22}, {"text": "This is Lambo as it is. It has unique components. Everything here is something new and unique.", "start": 441.826, "duration": 5.372}, {"text": "This is a really high-quality product developed for you,", "start": 447.248, "duration": 3.247}, {"text": "and you just feel the unreal pleasure while you're driving a really unique car.", "start": 450.545, "duration": 5.272}, {"text": "That's awesome. These seats, coloring, all the stuff, crazy front console.", "start": 455.867, "duration": 5.3}, {"text": "It is clear that displays are a bit similar to Porsche Cayenne, but still, all screens look pretty identical to each other.", "start": 461.217, "duration": 5.857}, {"text": "That's not the problem.", "start": 467.124, "duration": 3.765}, {"text": "And most importantly is the fact that I will not tell you, but still, I'll try to explain it in 5 seconds.", "start": 470.939, "duration": 6.008}, {"text": "If you are driving this car in the standard mode, it's called STRADA,", "start": 476.997, "duration": 5.009}, {"text": "and it means comfort daily driving, it's 100% Porsche Cayenne.", "start": 482.056, "duration": 4.611}, {"text": "The difference is that our \"Cayenne\" is rolling on 22' wheels and that leaves a mark.", "start": 486.717, "duration": 4.755}, {"text": "If any typical Cayenne would have 20' wheels, here're 22'", "start": 491.522, "duration": 4.487}, {"text": "because these large carbon-ceramic brakes won’t fit 20’ wheels.", "start": 496.059, "duration": 4.422}, {"text": "That’s why there’s 22'. It's not showing off, it's a real technological need.", "start": 500.531, "duration": 4.256}, {"text": "And now if I close my eyes, I feel like I'm at the steer of Cayenne.", "start": 505.137, "duration": 5.774}, {"text": "But then I’m coming out of the tunnel, my eyes are open again, and I see Lamborghini!", "start": 510.961, "duration": 7.115}, {"text": "And it’s really great! It’s awesome!", "start": 518.126, "duration": 3.214}, {"text": "I was so pissed off with Huracan because it’s antsy, small, inconvenient and so on.", "start": 521.39, "duration": 5.005}, {"text": "Yes, maybe this car has lost the whole feature of those Lamborghini cars.", "start": 526.445, "duration": 3.039}, {"text": "They were uncompromising, wild, hardcore, ferocious, destroying everything that comes in their way.", "start": 529.534, "duration": 6.61}, {"text": "They were always disheveled, it was impossible to ride a Lamborghini quietly.", "start": 536.194, "duration": 3.865}, {"text": "The only thing that made me glad is mode availability: you pull two shift paddles, and you turn the neutral gear.", "start": 540.109, "duration": 4.111}, {"text": "Good, but there's no exhaust shooting because we're rolling in a standard mode.", "start": 545.335, "duration": 3.213}, {"text": "Good, let's turn CORSA mode on, then we turn neutral,", "start": 548.598, "duration": 3.204}, {"text": "and what happens with the sound? It comes from the front speakers!", "start": 553.88, "duration": 2.721}, {"text": "Oh, that’s reverse… I can’t turn the reverse on while driving, well, it passed the test.", "start": 556.651, "duration": 3.424}, {"text": "The engine sound goes out from the speakers. It’s in front, guys!", "start": 560.125, "duration": 4.317}, {"text": "I can hear it from the back and exhaust shooting too, it’s okay, but still, it's imitated.", "start": 564.492, "duration": 5.514}, {"text": "It's in front, for real. So it will be easier to turn STRADA mode one and calm down.", "start": 573.48, "duration": 6.171}, {"text": "And most importantly, unlike all Lamborghinis, there is an \"off-road\" mode.", "start": 579.701, "duration": 5.37}, {"text": "Do you imagine? Off-road! It means that in this car, the air suspension can lift the body up!", "start": 585.121, "duration": 3.767}, {"text": "And unlike Huracan, it really works.", "start": 588.938, "duration": 3.92}, {"text": "I don’t have any claims about air suspension travel.", "start": 592.908, "duration": 3.698}, {"text": "We may come off the road and try some relief!", "start": 596.656, "duration": 5.447}, {"text": "Well. Before trying off-road, we have to reach it. What can help us?", "start": 602.553, "duration": 4.0}, {"text": "Firstly, switch the drive selector to \"off-road,\" but that's okay.", "start": 606.603, "duration": 4.496}, {"text": "We should try some hardcore. We begin with driving it in Standard mode on the bad road surface.", "start": 611.149, "duration": 6.779}, {"text": "That's what I feel whenever I try to get home in my village. Will Lambo fit me?", "start": 617.978, "duration": 5.303}, {"text": "So… I’d never try to go there on any Lambo – neither Aventador nor Huracan.", "start": 623.331, "duration": 3.876}, {"text": "I’d never thought about going there on them. I’m keeping 20 km/h of speed, oops, some holes…", "start": 627.257, "duration": 5.229}, {"text": "Well, my brains are not crushed. It’s important to understand that we are on 22’ wheels.", "start": 632.536, "duration": 4.842}, {"text": "The Skoda Oktavia is going in front of us. We need to catch it up.", "start": 637.428, "duration": 3.476}, {"text": "Of course, we are going without any trouble, that's cool! Wonderful!", "start": 644.633, "duration": 5.085}, {"text": "I doubt if this one could do more. I doubt if it can do something in the snow.", "start": 649.768, "duration": 4.449}, {"text": "I don't know if it's able to overtake some intense relief, is there a full diff lock.", "start": 654.767, "duration": 4.795}, {"text": "But! If we are going on a dirt road, my voice is not shaking at all.", "start": 659.612, "duration": 5.353}, {"text": "The vehicle in front of us is really jumping on this road. It won't speed up more.", "start": 665.015, "duration": 5.721}, {"text": "But we just keep the steer straight. No need to avoid any holes. Approved! Go further.", "start": 670.786, "duration": 5.238}, {"text": "So! We're in serious trouble! Our Lambo just has met a real, harsh off-road.", "start": 676.174, "duration": 5.602}, {"text": "We're probably dead.", "start": 682.126, "duration": 1.922}, {"text": "There’s a problem because we have to lift an air suspension up.", "start": 684.398, "duration": 6.041}, {"text": "It’s really lifting. By the way, its travel isn’t as short as it could be.", "start": 690.489, "duration": 3.81}, {"text": "We also have rollover sensors, both longitudinal and transversal too.", "start": 694.349, "duration": 5.47}, {"text": "Will diff locks work or not? I don’t know. Turn the first gear on.", "start": 699.969, "duration": 3.29}, {"text": "It immediately leads to turning the second gear and here we go.", "start": 703.309, "duration": 4.544}, {"text": "In fact, it’s not so convenient because I don’t see how the wheel is going on even if I lean out like that.", "start": 708.303, "duration": 7.039}, {"text": "To be short, I should do it like that and push the gas with my tiptoe.", "start": 715.392, "duration": 4.213}, {"text": "I can’t touch a pedal in that way.", "start": 719.855, "duration": 2.86}, {"text": "Oh my god!", "start": 723.665, "duration": 1.078}, {"text": "Quiet, quiet!", "start": 725.393, "duration": 1.731}, {"text": "Will the bumper meet the concrete slab or not?", "start": 728.154, "duration": 2.12}, {"text": "What’s up here?", "start": 733.366, "duration": 1.013}, {"text": "It’s fine, it’s okay!", "start": 734.429, "duration": 1.082}, {"text": "Is it? Wait for it! It’s dangerous!", "start": 735.561, "duration": 3.0}, {"text": "Wait, wait! Easy!\nStop it! Where to steer?", "start": 738.611, "duration": 3.157}, {"text": "Left or right??? Left??? The rim should crash right into stone! I feel it!", "start": 743.169, "duration": 7.145}, {"text": "Come on, come on!\nIt’s too tough! Wait, the diagonal. It’s going to hang above the ground!", "start": 751.495, "duration": 5.731}, {"text": "Oh shit, rocker panels passed it.", "start": 757.876, "duration": 2.404}, {"text": "I think that was too tough! Easy, easy…", "start": 762.132, "duration": 2.794}, {"text": "Oh goodness!", "start": 767.787, "duration": 1.298}, {"text": "We did it?", "start": 773.031, "duration": 1.246}, {"text": "Yes!\nWe did it!", "start": 774.327, "duration": 1.503}, {"text": "Yes! That's what the pure off-road is! That's the power.", "start": 775.88, "duration": 4.822}, {"text": "Lamborghini can be all-terrain! Awesome! Wait a second. The exhaust pipe, where is it?", "start": 780.752, "duration": 6.554}, {"text": "Here it is. We've just proved that this car can withstand off-road of any level!", "start": 788.373, "duration": 6.574}, {"text": "Oh God, how beautiful you are, my dear!", "start": 794.997, "duration": 1.973}, {"text": "But still, our \"off-road\" didn't go deeper than dirtying our tires", "start": 797.12, "duration": 2.655}, {"text": "because we have a spare parts specialist – Evgeniy from VAG.center, you know him well.", "start": 799.825, "duration": 5.073}, {"text": "He estimated the cost of these giant carbon-ceramic brake discs to $4000 as a minimum for each one.", "start": 804.948, "duration": 7.338}, {"text": "They have an exciting feature – if any small stone is ricocheted", "start": 812.336, "duration": 4.591}, {"text": "and gets between the disc and the pad, there's a big chance to crack them.", "start": 816.977, "duration": 5.061}, {"text": "They are unstable to mechanical stress.", "start": 822.088, "duration": 2.28}, {"text": "And when we were dashing through the dirty stony road, it was stopped in time by his screams:", "start": 824.418, "duration": 5.06}, {"text": "“Bro! This shit may cost you $15k at the purchase price!”", "start": 829.528, "duration": 4.066}, {"text": "These are the biggest carbon-ceramic brakes that had ever been installed on stock cars.", "start": 833.644, "duration": 5.574}, {"text": "Nothing else would fit there, neither ones are taken from Audi RS7 or something else,", "start": 839.268, "duration": 3.447}, {"text": "and you won't find anything at the purchase price. It is their own brand.", "start": 842.765, "duration": 3.066}, {"text": "This is a vast and effective engineering solution which costs enormous money.", "start": 845.881, "duration": 5.012}, {"text": "So… Even if this car can do some off-road work,", "start": 850.943, "duration": 3.812}, {"text": "we have no sense to continue our experiments because it’s just too expensive.", "start": 854.805, "duration": 5.975}, {"text": "There’s also a cargo area, I don’t know how it happened.", "start": 860.83, "duration": 3.421}, {"text": "It would seem, why Lambo needs that? But apparently, there's a need in it, because we already have back seats,", "start": 864.301, "duration": 4.41}, {"text": "rear doors, offroad mode, so this car in a whole pretends to be an everyday routine car.", "start": 868.761, "duration": 4.468}, {"text": "There are two features in it. Firstly, it has 600 liters of capacity, so it’s kind of a big cargo area.", "start": 873.279, "duration": 7.565}, {"text": "Three features, then, to be exact. Secondly, We have a thing here in which you could find a", "start": 880.894, "duration": 7.258}, {"text": "hidden warning triangle with a logo of Volkswagen-Audi… Well, a sort of coincidence.", "start": 888.202, "duration": 7.797}, {"text": "And here is a donut spare tire under the floor of cargo area, in which we see a standard place,", "start": 896.049, "duration": 5.64}, {"text": "where another one warning triangle with Volkswagen-Audi logo could be attached.", "start": 901.739, "duration": 5.606}, {"text": "I think they've put two of them into just if one won't be enough.", "start": 907.395, "duration": 4.764}, {"text": "You could be furnished with triangles and continue your performance.", "start": 912.209, "duration": 3.154}, {"text": "After this, the vehicle pretends to be universal, so there is a button that will help you with", "start": 915.413, "duration": 4.752}, {"text": "loading when you need to make the cargo area lower from the back.", "start": 920.215, "duration": 3.112}, {"text": "It can be lowered if you have to load your potato here.", "start": 923.377, "duration": 3.777}, {"text": "And there is a plastic blank switch what should be wrong,", "start": 927.204, "duration": 3.071}, {"text": "but it's not so bad because it's obviously designed here to put a button for extending electric tow bar!", "start": 930.325, "duration": 10.233}, {"text": "I was searching on the Internet, and I obviously can mount a towbar here,", "start": 940.608, "duration": 6.01}, {"text": "and I may have Lambo with a towbar to carry my shit on an old rusty shitty trailer…", "start": 946.668, "duration": 6.663}, {"text": "Perfect! Just perfect!", "start": 953.944, "duration": 2.216}, {"text": "But, as you can understand, this Lambo wasn't made as an off-road vehicle.", "start": 971.706, "duration": 3.482}, {"text": "In fact, lifting of the air suspension is actually a compromise.", "start": 975.238, "duration": 3.391}, {"text": "They’ve made it for people who were angry about the Huracan,", "start": 978.679, "duration": 4.257}, {"text": "this SUV was created to feel comfortable in everyday life with this car.", "start": 982.986, "duration": 4.722}, {"text": "It was made to ignore any speed bumps and be okay with that.", "start": 987.758, "duration": 4.786}, {"text": "But, all in all, this is Lambo. Its main destiny is a highway.", "start": 992.594, "duration": 4.412}, {"text": "So everything here is made for the highway. No problem with that.", "start": 997.056, "duration": 3.351}, {"text": "It starts to speed up madly.", "start": 1001.898, "duration": 3.042}, {"text": "It’s unreal to go nice and easy in it.", "start": 1004.99, "duration": 2.358}, {"text": "These monstrous and fucking great brakes are doing 200% of their job!", "start": 1007.398, "duration": 5.536}, {"text": "Please… Yes.", "start": 1013.184, "duration": 2.441}, {"text": "Super-duper! And the rev limiter is working in manual mode too.", "start": 1016.054, "duration": 5.145}, {"text": "That's cosmic. Holy shit, we've on that speed…. My ears are totally covered.", "start": 1021.877, "duration": 5.411}, {"text": "We've flown into the viaduct so fast that the difference in height made my ears pop.", "start": 1027.338, "duration": 5.378}, {"text": "This is cosmic, it's motherfucking cosmic!", "start": 1033.266, "duration": 4.62}, {"text": "That's incredibly fast. It's probably not as comfortable as others SUVs, but it's fast.", "start": 1038.928, "duration": 6.895}, {"text": "You should always choose – speed or comfort. You always could do a pum-pum – and it’s gone.", "start": 1045.873, "duration": 5.615}, {"text": "We’re going in silence.", "start": 1053.048, "duration": 1.352}, {"text": "All sounds are stopped. We need to press a gas pedal to accelerate.", "start": 1057.79, "duration": 5.015}, {"text": "That’s interesting, really interesting.", "start": 1064.928, "duration": 3.602}, {"text": "Okay, how fast will it switch the modes?", "start": 1068.58, "duration": 2.288}, {"text": "At once! Immediately! Just instantly! A split second! No need to do anything!", "start": 1072.683, "duration": 4.744}, {"text": "Come on, bro, no need to go to the left lane.", "start": 1077.477, "duration": 3.137}, {"text": "Oh god, it’s so cosmic.", "start": 1080.664, "duration": 2.526}, {"text": "As a result...", "start": 1083.24, "duration": 0.833}, {"text": "it turned on a normal mode at once.", "start": 1087.412, "duration": 2.789}, {"text": "Yes, there’s no usual buttons on the steering wheel.", "start": 1090.251, "duration": 3.698}, {"text": "When you are going in STRADA mode you can press the button, and that's all, it's like a hyperdrive going on.", "start": 1093.999, "duration": 7.035}, {"text": "Its job of these shift paddles and how quick they work!", "start": 1101.084, "duration": 3.512}, {"text": "There's no such a button, but I really have no claims about it.", "start": 1104.746, "duration": 3.941}, {"text": "I like it so much on the highway. At the same time, does it have back seat? - Yes!", "start": 1110.67, "duration": 4.531}, {"text": "Does this seat have cup holders? – Yes! Will my children be able to seat here? – Yes!", "start": 1115.251, "duration": 5.725}, {"text": "Am I able to do all kinds of terrible things in traffic without them? – Yes!", "start": 1121.026, "duration": 5.309}, {"text": "And we came to the conclusion that in my humble estimation this is the ideal Lamborghini.", "start": 1126.885, "duration": 5.535}, {"text": "It's because I'm glad not about being able to rush, but about living everyday life with it.", "start": 1132.47, "duration": 4.845}, {"text": "First of all, I estimate this car for whether I will be able to make 150-200 km mileage on it, doing my business.", "start": 1137.365, "duration": 8.452}, {"text": "For example, even to make one of my videos, put some skis;", "start": 1145.867, "duration": 3.988}, {"text": "carry home baseboards for repair and load more cement in the cargo area – this motherfucking Lambo can do it!", "start": 1149.905, "duration": 6.578}, {"text": "Holy crap! This is the most unusual Lambo that I’ve met on Earth, and at the same time, it keeps Lambo character.", "start": 1156.533, "duration": 6.991}, {"text": "It's because….", "start": 1163.574, "duration": 1.079}, {"text": "Because it's bloody fast! Oh gosh. You have to be ready for the level of speeding up.", "start": 1166.823, "duration": 6.666}, {"text": "It is swift, and it's a great fight against lateral overloads, excellent.", "start": 1173.539, "duration": 6.193}, {"text": "I can maneuver. Oh shit, how it's reacting to the steering!", "start": 1180.248, "duration": 3.292}, {"text": "In the previous video, I was talking that I can twitch the steering wheel like that.", "start": 1183.59, "duration": 4.245}, {"text": "For that one, it's way too dangerous.", "start": 1187.885, "duration": 2.138}, {"text": "Fourteenth! (VAZ 2114, a.k.a. 14). Fourteenth. It’s time to compete with “14”!", "start": 1190.173, "duration": 3.305}, {"text": "People who drive “14\" are the most dangerous people on Earth.", "start": 1193.528, "duration": 2.589}, {"text": "Oh, God. Oh my. I love it so much.", "start": 1196.367, "duration": 4.137}, {"text": "Yep, it's not perfect at all. There's no car ionization. I can’t choose the scent of a heater, for example.", "start": 1200.554, "duration": 7.942}, {"text": "There’s no… There's plenty of blank switches. Sorry.", "start": 1208.546, "duration": 3.233}, {"text": "But it doesn’t really matter if you want to combine the car for every day with this!", "start": 1211.829, "duration": 5.273}, {"text": "I don’t know what else could be as cool as this one, especially with such a wild appearance.", "start": 1217.864, "duration": 5.679}, {"text": "Even if we may say that this is an Ultra-Cayenne;", "start": 1223.593, "duration": 2.462}, {"text": "in fact, I am a supporter of the fact that it is ultra-Cayenne, because the platform leaves the trace,", "start": 1226.105, "duration": 5.96}, {"text": "and anyway, you understand that it’s not Lamborghini’s chassis,", "start": 1232.115, "duration": 4.423}, {"text": "it’s Volkswagen’s or Audi’s or Porsche’s one and so on…", "start": 1236.588, "duration": 3.214}, {"text": "More than that, if you tried driving these cars, you may close your eyes now and clearly see what car you are driving.", "start": 1239.852, "duration": 5.213}, {"text": "But! This is maximum Cayenne, an Ultra-Cayenne. It has Lambo’s exterior.", "start": 1245.115, "duration": 5.465}, {"text": "Everyone wants it because it works everywhere and whenever!", "start": 1250.63, "duration": 3.644}, {"text": "Is it started or stopped, is it being driven or standing still, whatever it does – it’s Lamborghini.", "start": 1254.324, "duration": 4.874}, {"text": "Any person standing in front of Cayenne and Lambo will always choose Lambo.", "start": 1259.248, "duration": 6.083}, {"text": "And at the same time, it's exclusive. It has no Cayenne parts.", "start": 1265.881, "duration": 4.488}, {"text": "At least the ones you can see with your eyes.", "start": 1270.419, "duration": 3.44}, {"text": "And I don't like Lamborghini at all!", "start": 1275.055, "duration": 1.523}, {"text": "I was going to do a review, and I wanted to destroy this car, because what the fuck?", "start": 1276.628, "duration": 3.539}, {"text": "20 million and cruise control is NOT adaptive???", "start": 1280.217, "duration": 2.485}, {"text": "If I turn cruise control on and leave it like that, we will smash right into the Solaris in front of us, but why do we need such problems?", "start": 1282.752, "duration": 7.25}, {"text": "We don’t have a head-up display there too, come on, for that price, what???", "start": 1291.288, "duration": 4.871}, {"text": "But okay, these options can be bought.", "start": 1296.209, "duration": 3.285}, {"text": "These options could be here. We just need to pay some extra money.", "start": 1299.944, "duration": 4.442}, {"text": "Why not, we did find $300k; why not give them a couple more?", "start": 1304.436, "duration": 5.533}, {"text": "And, secondly, there are still carbon-ceramic brakes, and still, this is Lambo.", "start": 1310.519, "duration": 4.622}, {"text": "I can speak about it on the run so much but in fact…", "start": 1315.191, "duration": 3.449}, {"text": "That's all. It's swift. There's so much traction that you feel it even on the steering wheel.", "start": 1320.233, "duration": 5.103}, {"text": "It's incredible. It's God damn fast. That’s all I can say about this car. Just epic.", "start": 1325.386, "duration": 6.034}, {"text": "The steering is a masterpiece. It's controlled so well by the steering wheel. How it's good at cornering!", "start": 1331.47, "duration": 4.97}, {"text": "It's so amazing! Damn, I really want to test it on the race track.", "start": 1336.49, "duration": 5.438}, {"text": "But this is prohibited by the rental rules. When we got 911,", "start": 1341.978, "duration": 4.001}, {"text": "we actually agreed on the test on a race track in a rental agreement, but we didn’t do it with Lambo.", "start": 1346.029, "duration": 6.729}, {"text": "But I just want to go to the race track so much.", "start": 1353.008, "duration": 2.281}, {"text": "The SUV on the race track is the most thankless shit in this life. This is insane.", "start": 1355.339, "duration": 4.493}, {"text": "But this time, I admit in advance that it will be an exception.", "start": 1359.882, "duration": 5.914}, {"text": "Now let's turn a standard mode. My God that feels really good.", "start": 1366.246, "duration": 3.706}, {"text": "It's so nice!", "start": 1370.823, "duration": 1.284}, {"text": "Well, gentlemen, here we got a car which wasn’t unremarkable for me at the beginning.", "start": 1412.574, "duration": 4.927}, {"text": "I was thinking: what is SUV Lamborghini?", "start": 1417.551, "duration": 2.397}, {"text": "At least it's a crossover, and it's obviously not fast, not steered well, it's something heavy.", "start": 1419.998, "duration": 4.815}, {"text": "It has almost 2200 kg of weight and almost the same power that my Range Rover has.", "start": 1424.863, "duration": 4.461}, {"text": "Well, what I haven't seen there? It turned out that the same power can be performed very differently.", "start": 1429.374, "duration": 6.58}, {"text": "And there is plenty of cars with 650 horsepowers inside or even more,", "start": 1436.004, "duration": 4.233}, {"text": "but for today there's no faster crossover that that one.", "start": 1440.287, "duration": 2.659}, {"text": "It happened so that such engineering inspired Lamborghini’s philosophy into Cayenne’s body.", "start": 1442.996, "duration": 7.786}, {"text": "I should name it word by word.  First Lambor[d3i]ni, then Lambor[gi]ni.", "start": 1450.832, "duration": 3.138}, {"text": "I will be felt up with a shit right to my ears.", "start": 1454.02, "duration": 3.521}, {"text": "Because it's not already an old true Lamborghini and still it's not a Porsche Cayenne. It's something between.", "start": 1457.591, "duration": 7.118}, {"text": "On the other side, if you want to have this tough exterior and if you want to be loved by everyone, you should have it.", "start": 1464.759, "duration": 6.412}, {"text": "I understand people who buy it, actually, and I already understand people who take it in a rental.", "start": 1471.221, "duration": 5.606}, {"text": "Paying crazy money for the rent of this car seems to be nonsense.", "start": 1476.877, "duration": 5.458}, {"text": "But in fact, you would never feel anything like this nowadays.", "start": 1482.385, "duration": 4.539}, {"text": "I could even mount a towbar! A towbar, for goodness sake!", "start": 1486.974, "duration": 4.672}, {"text": "I can use it to carry a pile of manure from my granny to my lovely garden.", "start": 1491.696, "duration": 5.422}, {"text": "And thanks for that to the rental DayDream.ru!", "start": 1497.168, "duration": 4.217}, {"text": "Wow, that's the turn I've made. I'm a master of a good wordplay.", "start": 1501.435, "duration": 4.649}, {"text": "And of course thanks to Miroslava. Everyone loves Miroslava, all comments are about Miroslava.", "start": 1506.134, "duration": 5.171}, {"text": "But don't quote him on that.\nIf there wasn’t Miroslava, what would we do?", "start": 1511.355, "duration": 2.987}, {"text": "Did you like it?", "start": 1514.392, "duration": 1.274}, {"text": "We would carry the manure on Range Rover. That’s not so fancy, you know.", "start": 1515.716, "duration": 3.046}, {"text": "And now that’s all the top.", "start": 1518.812, "duration": 1.738}, {"text": "It's not so much about \"how I like it,\" but about how much my idea of Urus was turned around.", "start": 1520.7, "duration": 3.634}, {"text": "Looking at pictures of it - bullshit.", "start": 1524.384, "duration": 2.346}, {"text": "Until you get into the cabin and drive it, I can't put into words how it behaves on the road.", "start": 1526.78, "duration": 4.886}, {"text": "These brakes are crazy, the transmission is mad, the engine is insane,", "start": 1531.716, "duration": 3.361}, {"text": "as the car rental too, which is giving this monster to hands of people.", "start": 1535.127, "duration": 3.706}, {"text": "Yep.", "start": 1538.883, "duration": 0.606}, {"text": "And for some reason, the queue is two weeks long.", "start": 1539.539, "duration": 3.196}, {"text": "Of course, we could buy not only one car, but several others for that money.", "start": 1542.785, "duration": 4.547}, {"text": "Yes.\nBut we choose exactly this one. Everyone asks: “Why did you buy it?”", "start": 1547.382, "duration": 3.2}, {"text": "Of course, you could acquire a lot of Lada Vesta, Lada Granta, you could start a taxi business at least.", "start": 1550.632, "duration": 3.823}, {"text": "We could get a huge taxi fleet of such vehicles.\nSure! And then make a giveaway on Instagram.", "start": 1554.505, "duration": 6.689}, {"text": "I’m so sorry we hadn’t that idea earlier.\nYou would be covered in money.", "start": 1561.244, "duration": 2.822}, {"text": "That is the vehicle which you don’t know and have no right to judge until you ride it.", "start": 1564.116, "duration": 6.004}, {"text": "Thank you so much for watching the video. Thanks to the DayDream.ru.", "start": 1570.17, "duration": 4.077}, {"text": "We are waiting for the new crazy things in your vehicle holding!", "start": 1574.297, "duration": 2.538}, {"text": "We’ll see. Next year probably.", "start": 1576.885, "duration": 2.012}, {"text": "We will have a look and test.\nSure thing!", "start": 1578.947, "duration": 1.791}, {"text": "Great luck to all of you, thanks for watching the video, and goodbye!\nBye!", "start": 1580.788, "duration": 3.663}, {"text": "Let’s separate, that’s the tradition!", "start": 1584.501, "duration": 2.676}]