[{"text": "This is a video by RealLifeLore,", "start": 0.0, "duration": 1.74}, {"text": "sponsored by the Great Courses Plus.", "start": 1.74, "duration": 2.04}, {"text": "We all know that volcanoes can cause a massive amount of destruction whenever they erupt.", "start": 3.78, "duration": 3.8}, {"text": "They can wipe out entire cities like what happened to Pompeii in the Roman Empire", "start": 7.58, "duration": 3.72}, {"text": "or devastate entire regions like when Mount St. Helens erupted in the United States,", "start": 11.3, "duration": 4.4}, {"text": "but is it possible that if a volcano erupted with a massive enough force sometime in the future", "start": 15.7, "duration": 4.8}, {"text": "could actually destroy all of human civilization on the planet?", "start": 20.5, "duration": 3.8}, {"text": "At some point in the past, volcanoes have actually come pretty close to doing exactly that.", "start": 24.3, "duration": 5.0}, {"text": "First, we need to understand something called the Volcanic Explosivity Index,", "start": 29.3, "duration": 4.16}, {"text": "which is a scale used to measure the eruptions of volcanoes.", "start": 33.46, "duration": 3.18}, {"text": "The scale goes from zero being a relatively tiny eruption that is happening all over the world continuously", "start": 36.64, "duration": 5.46}, {"text": "all the way up to an 8, which would be a mega colossal eruption with earth-shattering consequences,", "start": 42.1, "duration": 5.16}, {"text": "similar to an asteroid impact that only happens about every 50,000 years on average.", "start": 47.26, "duration": 5.16}, {"text": "For reference in regards to how powerful volcanoes can actually get,", "start": 52.42, "duration": 3.64}, {"text": "both the Mount Vesuvius eruption that annihilated ancient Pompeii and the Mount St. Helens eruption in 1980", "start": 56.06, "duration": 5.56}, {"text": "would both be classified as only a level 5 (Cataclysmic) eruption on the scale,", "start": 61.62, "duration": 3.92}, {"text": "which is incredible because the Mount St. Helens eruption released 24 megatons,", "start": 65.54, "duration": 4.7}, {"text": "or 1,600 times the scale of the atomic bomb dropped on Hiroshima,", "start": 70.24, "duration": 4.34}, {"text": "which means the things only gets ridiculously more powerful from here.", "start": 74.58, "duration": 3.7}, {"text": "Perhaps the best-known level 6 volcanic eruption was the Krakatoa nightmare in 1883.", "start": 78.28, "duration": 5.5}, {"text": "The volcano was located on this island in Indonesia and exploded with the awe-inspiring force of 200 Megatons...", "start": 83.78, "duration": 7.1}, {"text": "13,000 times more powerful than the Hiroshima atomic bomb", "start": 90.88, "duration": 4.4}, {"text": "and four times more powerful than even the mighty Tsar Bomba,", "start": 95.28, "duration": 3.52}, {"text": "the largest nuclear weapon humanity has ever detonated.", "start": 98.8, "duration": 2.74}, {"text": "This epic explosion generated the loudest sound ever known to have happened in human history,", "start": 101.54, "duration": 5.34}, {"text": "shattering sailors' eardrums that were located 64 kilometers from the blast", "start": 106.88, "duration": 4.04}, {"text": "and capable of being heard perfectly clear as far away as Perth, Australia.", "start": 110.92, "duration": 4.4}, {"text": "Almost the entire island of the volcano it was located on was completely blown apart.", "start": 115.32, "duration": 4.44}, {"text": "The blast was so powerful that it sent coral reefs that have been dormant for centuries on the ocean floor", "start": 119.76, "duration": 5.56}, {"text": "hurtling towards land as if they were asteroids,", "start": 125.32, "duration": 2.74}, {"text": "and the explosion generated 30 meter high tsunamis that ravaged the rest of Indonesia.", "start": 128.06, "duration": 5.28}, {"text": "Everybody on the nearby island of Sebeesi was killed in the immediate aftermath,", "start": 133.34, "duration": 4.24}, {"text": "and in total up to 120,000 people in the islands were killed in the immediate aftermath of the disaster.", "start": 137.58, "duration": 6.18}, {"text": "There were reports of human skeletons on rafts that have gotten lost at sea trying to escape", "start": 143.76, "duration": 4.9}, {"text": "that began washing up on the east coast of Africa one entire year after the explosion.", "start": 148.66, "duration": 5.24}, {"text": "But perhaps the worst part about volcanic eruptions is the massive amount of ash that gets pumped into the atmosphere", "start": 153.9, "duration": 5.66}, {"text": "that can block out the sunlight and cause global temperatures to drop dramatically", "start": 159.56, "duration": 4.3}, {"text": "In the case of Krakatoa, global temperatures fell by 1.2 degrees Celsius the following year and did not recover for another four years.", "start": 163.86, "duration": 8.14}, {"text": "The ash in the atmosphere caused weird optical effects too that made the moon occasionally appear blue or even green,", "start": 172.0, "duration": 6.76}, {"text": "and even this famous painting is theorized by some to actually depict what an accurate sky above Norway looked like in the year following the eruption.", "start": 178.76, "duration": 8.3}, {"text": "Another deadly level 6 eruption happened exactly 100 years previously than this in Iceland,", "start": 187.06, "duration": 5.34}, {"text": "in which more sulfur dioxide was pumped into the Earth's atmosphere in just a few months", "start": 192.4, "duration": 4.38}, {"text": "than the entire industrial output of all of modern-day Europe combined for three years.", "start": 196.78, "duration": 5.54}, {"text": "This created a toxic gas cloud that killed fifty percent of all animal life on Iceland,", "start": 202.32, "duration": 4.98}, {"text": "which caused a famine that killed twenty five percent of the human population on the island.", "start": 207.3, "duration": 4.08}, {"text": "The toxic cloud then moved across the sea over to the rest of Europe,", "start": 211.38, "duration": 3.74}, {"text": "where 23,000 more people died in Britain alone from the poison gas.", "start": 215.12, "duration": 4.7}, {"text": "But let's get a little more crazy and move up to what a level 7 on the scale would look like.", "start": 219.82, "duration": 4.2}, {"text": "One of these such eruptions created the largest explosion ever witnessed in recorded history", "start": 224.02, "duration": 4.6}, {"text": "back only two centuries ago in 1815.", "start": 228.62, "duration": 3.04}, {"text": "Also taking place on an island in Indonesia,", "start": 231.66, "duration": 2.56}, {"text": "this explosion shot 400 million tons of ash into our atmosphere that plunge the entire planet into a year-long winter.", "start": 234.22, "duration": 7.44}, {"text": "All life on the island where the eruption took place was annihilated.", "start": 241.66, "duration": 3.52}, {"text": "A circle 600 kilometers wide from the blast was shrouded in darkness for days.", "start": 245.18, "duration": 4.78}, {"text": "And the year of 1816 became known as The Year Without a Summer,", "start": 249.96, "duration": 3.6}, {"text": "due to the fact that it snowed in New York and Maine in the middle of June,", "start": 253.56, "duration": 3.94}, {"text": "and Quebec City got a full 30 centimeters of snow during the same month.", "start": 257.5, "duration": 4.34}, {"text": "This was certainly a very devastating eruption that may have immediately killed up to 100,000 people,", "start": 261.84, "duration": 5.52}, {"text": "but it may have also caused famines worldwide due to the cold temperatures that killed crops across the world.", "start": 267.36, "duration": 5.52}, {"text": "But 75,000 years ago an enormous volcano may have caused humanity", "start": 272.88, "duration": 4.28}, {"text": "to come the closest that it's ever been to ultimate extinction.", "start": 277.16, "duration": 3.44}, {"text": "The Toba supervolcano, also located in Indonesia, exploded with a level 8 on our scale in these prehistoric times.", "start": 280.6, "duration": 7.58}, {"text": "It was three thousand times more powerful than what happened at Mount St. Helens", "start": 288.18, "duration": 4.34}, {"text": "and ejected 100 times more ash than even the Tambora explosion did in 1815.", "start": 292.52, "duration": 5.42}, {"text": "This was enough ash to completely bury all of Luxembourg beneath a full kilometer of this stuff,", "start": 297.94, "duration": 5.42}, {"text": "or all of Argentina beneath one meter.", "start": 303.36, "duration": 2.25}, {"text": "It sent the planet into a decade-long winter where global temperatures dropped by as much as 15 degrees Celsius,", "start": 305.61, "duration": 6.69}, {"text": "and early humanity was possibly almost destroyed by it.", "start": 312.3, "duration": 3.42}, {"text": "The global human population may have dwindled to as few as a mere 3,000 people during those hard times,", "start": 315.72, "duration": 6.16}, {"text": "which is about the same number of people that currently follow me on Facebook and Twitter.", "start": 321.88, "duration": 4.14}, {"text": "But humanity managed to persevere, which leaves the interesting question of what would happen if a level 8 supervolcano exploded today.", "start": 326.02, "duration": 7.1}, {"text": "The most likely and devastating culprit would be the Yellowstone supervolcano in the United States.", "start": 333.12, "duration": 5.44}, {"text": "The entire Yellowstone National Park is hiding a volcano of gargantuan proportions right beneath her visitors' feet.", "start": 338.56, "duration": 6.16}, {"text": "It is experienced three level-8 eruptions in the past 2.1 million years,", "start": 344.72, "duration": 5.02}, {"text": "with the most recent one happening 640,000 years ago.", "start": 349.74, "duration": 3.68}, {"text": "There's enough magma in the volcano system underneath the surface today to fill the entire Grand Canyon 11 times over,", "start": 353.42, "duration": 6.84}, {"text": "or bury the entire Netherlands with one full kilometer of molten rock.", "start": 360.26, "duration": 4.28}, {"text": "It is estimated that the volcano has about a one in 700,000 a chance of exploding each year,", "start": 364.54, "duration": 5.76}, {"text": "which is absurdly unlikely, but what would happen if we were absurdly unlucky?", "start": 370.3, "duration": 4.98}, {"text": "Well, here's a map of what the damage would look like.", "start": 375.28, "duration": 2.4}, {"text": "The states of Wyoming, Idaho and Montana would be largely buried beneath a full meter of ash,", "start": 377.68, "duration": 5.1}, {"text": "which would render them all uninhabitable.", "start": 382.78, "duration": 2.08}, {"text": "Anybody who didn't evacuate from these three states would likely be killed in the aftermath of the explosion.", "start": 384.86, "duration": 5.42}, {"text": "Salt Lake City and Denver would also likely suffer major damage and casualties.", "start": 390.28, "duration": 4.2}, {"text": "The only part of the mainland us that would escape any ashfall would be southern Texas and southern Florida.", "start": 394.48, "duration": 5.64}, {"text": "This event would likely create either the largest mass grave or the largest refugee crisis in history", "start": 400.12, "duration": 5.08}, {"text": "as entire states where the people would have to be evacuated and probably flee east.", "start": 405.2, "duration": 4.38}, {"text": "The entire western United States will be completely devastated and agricultural production in the country would be crippled.", "start": 409.58, "duration": 6.0}, {"text": "It would be the biggest disaster in history and likely throw the United States into a depression multiple times worse than the 1920 stock market crash.", "start": 415.58, "duration": 7.9}, {"text": "This in turn would throw the entire world economy into a severe depression,", "start": 423.48, "duration": 4.2}, {"text": "and coupled with a 10 year long winter caused by lingering ash in the atmosphere", "start": 427.68, "duration": 3.78}, {"text": "and the resulting massive crop failures and famines", "start": 431.46, "duration": 2.86}, {"text": "and the world will be a very tumultuous, cold and frightening place.", "start": 434.32, "duration": 3.84}, {"text": "Human civilization may be changed forever by that eruption and who knows what catastrophic change it may bring about,", "start": 438.16, "duration": 6.4}, {"text": "but it likely wouldn't completely end us as a species.", "start": 444.56, "duration": 3.02}, {"text": "Life would go on in some way or another as it always has.", "start": 447.58, "duration": 3.98}, {"text": "Now after saying all of that, I must take", "start": 451.56, "duration": 1.94}, {"text": "the time now to once again thank my incredible sponsor, The Great Courses Plus.", "start": 453.5, "duration": 4.06}, {"text": "The Great Courses Plus is a subscription on-demand video learning service", "start": 457.56, "duration": 3.54}, {"text": "where you can subscribe to and watch unlimited top-notch courses", "start": 461.1, "duration": 3.3}, {"text": "that are taught by brilliant ideally professors, as well as experts from", "start": 464.4, "duration": 3.18}, {"text": "National Geographic, the Smithsonian, The Culinary Institute of America", "start": 467.58, "duration": 4.04}, {"text": "and hundreds of other extremely qualified individuals.", "start": 471.62, "duration": 3.0}, {"text": "They offer an unlimited access to thousands of different lectures over pretty much anything that you could possibly be interested in.", "start": 474.62, "duration": 6.2}, {"text": "If you enjoyed the video that you just watch, then I would strongly recommend their course titled \"The Joy of Science,\"", "start": 480.82, "duration": 5.38}, {"text": "which includes lectures on volcanic activity, earthquakes and plate tectonics.", "start": 486.2, "duration": 4.26}, {"text": "It's a really fun subject to learn about and help out a lot with the research that I conducted for this video.", "start": 490.46, "duration": 5.26}, {"text": "You can watch these or hundreds of other courses completely for free", "start": 495.72, "duration": 3.44}, {"text": "when you sign up for a 30-day free trial using the link on your screen now:", "start": 499.16, "duration": 3.8}, {"text": "www.thegreatcoursesplus.com/reallifelore;", "start": 502.96, "duration": 4.4}, {"text": "or you can click on the link that's in the description.", "start": 507.36, "duration": 2.5}, {"text": "If you enjoyed the video that you just watched, then I hope you'll subscribe to my channel by clicking here.", "start": 509.86, "duration": 4.04}, {"text": "You can visit my Patreon by clicking here,", "start": 513.9, "duration": 2.36}, {"text": "Watch some older videos of mine by clicking over here on the left, (Subtitles By AlexSS)", "start": 516.3, "duration": 1.98}, {"text": "and I'll look forward to seeing you again for the next new videos soon. (Minor Edits by Kevin Yang)", "start": 518.28, "duration": 6.08}]