[{"text": "Where does London stop and the terrifying provincial nothingness begin?", "start": 0.3, "duration": 3.62}, {"text": "Is it the end of the Tube?", "start": 4.48, "duration": 1.32}, {"text": "Is it the M25?", "start": 6.22, "duration": 1.14}, {"text": "Is it the end of London's postcode area?", "start": 8.22, "duration": 2.0}, {"text": "If you must know, it's none of these.", "start": 10.68, "duration": 1.54}, {"text": "London's phone code, postcode and so on were set up at different times by different people", "start": 12.36, "duration": 4.18}, {"text": "for different purposes. So where does London officially stop?", "start": 16.54, "duration": 3.3}, {"text": "The answer is right here, at the edge of the Greater London boundary.", "start": 20.12, "duration": 4.26}, {"text": "But why is it here and not, say, several metres to the left? Who drew this boundary and when?", "start": 24.96, "duration": 4.64}, {"text": "And what difference does it make if you live inside it or not?", "start": 29.76, "duration": 2.2}, {"text": "And why does this bit stick out here?", "start": 32.36, "duration": 1.8}, {"text": "♫ ♫ ♫", "start": 36.92, "duration": 2.48}, {"text": "Greater London has been this shape and this size since 1965.", "start": 42.46, "duration": 3.66}, {"text": "But to understand why, you need to look at what London was like in 1964.", "start": 46.6, "duration": 4.36}, {"text": "Of the eight or so million people who considered themselves Londoners,", "start": 56.08, "duration": 2.92}, {"text": "as in, they commuted to London, watched London TV and read London newspapers,", "start": 59.24, "duration": 3.24}, {"text": "fewer than half of them actually technically legally officially lived *IN* London.", "start": 62.72, "duration": 4.54}, {"text": "The County of London, as it was then known, was drawn up way back in 1889", "start": 67.76, "duration": 3.96}, {"text": "in the shape of a rhinoceros to reflect how big London had grown at that time.", "start": 71.74, "duration": 3.78}, {"text": "But it had long since burst its borders... making the rhinoceros out of date.", "start": 76.06, "duration": 3.9}, {"text": "This meant that suburbanites were using London's resources", "start": 80.48, "duration": 2.36}, {"text": "without paying any taxes to the London County Council, whose job was to run the whole metropolis.", "start": 82.92, "duration": 4.44}, {"text": "And that wasn't fair.", "start": 87.92, "duration": 1.26}, {"text": "So a new border was needed that would subsume all of these new suburbs.", "start": 89.7, "duration": 3.22}, {"text": "The man asked nicely to draw the new border was Sir Edwin Herbert", "start": 93.64, "duration": 3.28}, {"text": "- Hello, I'm Sir Edwin Herbert.\n- Could you draw a new border for London please?", "start": 97.16, "duration": 3.8}, {"text": "- Yes.", "start": 101.32, "duration": 0.56}, {"text": "He assembled a crack team, including the Vice Chancellor of the University of Leeds,", "start": 102.42, "duration": 3.22}, {"text": "The President of the Institute of Chartered Accountants,", "start": 106.26, "duration": 2.0}, {"text": "Professor of Government from the University of Manchester,", "start": 108.88, "duration": 2.2}, {"text": "and the man who owned the Cadburys chocolate factory in Birmingham.", "start": 111.48, "duration": 2.42}, {"text": "The commission was notable for not containing anyone with previous involvement with local government in the London area.", "start": 114.28, "duration": 4.4}, {"text": "Creating an up-to-date border was trickier than it sounds.", "start": 119.44, "duration": 2.54}, {"text": "London didn't have an obvious edge like many other European cities, it sort of sputtered out gradually.", "start": 122.24, "duration": 4.68}, {"text": "So drawing a line around it was going to be more of an art than a science.", "start": 127.32, "duration": 3.3}, {"text": "Never-the-nonetheless, Herbert came up with three scientific tests", "start": 131.4, "duration": 2.76}, {"text": "to work out whether a suburb was a suburb or not.", "start": 134.18, "duration": 2.96}, {"text": "1. Was it an easy commute to central London?", "start": 137.7, "duration": 2.62}, {"text": "If a place was within about an hour's reach of the West End by train, it was deemed to pass the first test.", "start": 141.18, "duration": 5.04}, {"text": "2. Was it independent?", "start": 147.08, "duration": 2.0}, {"text": "Some places like Watford, Dartford and Slough, despite being close to London,", "start": 149.44, "duration": 3.62}, {"text": "functioned not as suburbs, but as proper towns in their own right,", "start": 153.16, "duration": 2.7}, {"text": "with proper shops, businesses, and entertainment, bringing people in from miles around.", "start": 155.96, "duration": 3.92}, {"text": "3. Did the local population look towards London or away from London for its cultural identity?", "start": 161.16, "duration": 4.92}, {"text": "This subjective and nebulous question was the hardest to answer and probably just involved asking people.", "start": 166.7, "duration": 4.62}, {"text": "- What?", "start": 171.9, "duration": 0.62}, {"text": "Herbert's team spent the best part of the late 50s on an exhaustive tour of boring suburbia.", "start": 173.16, "duration": 4.12}, {"text": "And when they came back, they handed Sir Edwin Herbert their results...", "start": 177.58, "duration": 2.7}, {"text": "- Thank you.", "start": 180.48, "duration": 0.64}, {"text": "...and this is the border he came up with for the new Greater London.", "start": 181.46, "duration": 3.18}, {"text": "But that's not the familiar shape of Greater London that we know and love today. So, what happened?", "start": 185.08, "duration": 4.76}, {"text": "In posh places like Epsom, despite being the epitome of London suburbia,", "start": 190.68, "duration": 3.4}, {"text": "the locals were worried that if they joined the new Greater London, they'd have to pay more tax.", "start": 194.18, "duration": 3.78}, {"text": "So they kicked up a stink, pledging allegiance to Surrey.", "start": 199.2, "duration": 2.7}, {"text": "The same thing was happening at the other end, in posh Chigwell in Essex,", "start": 202.42, "duration": 2.7}, {"text": "and posh Knockholt in Kent.", "start": 205.94, "duration": 1.48}, {"text": "The wealthy stink-up-kickers, as usual, got what they wanted.", "start": 209.06, "duration": 3.04}, {"text": "So the border had to be redrawn in a totally illogical way that arbitrarily split the suburbs in two.", "start": 212.26, "duration": 5.02}, {"text": "The only place that didn't seem to mind being in Greater London was Chessington World of Adventures.", "start": 217.78, "duration": 3.98}, {"text": "And that's how they settled on this final and now familiar shape.", "start": 223.06, "duration": 3.22}, {"text": "The London County Council would be abolished, and replaced by the Greater London Council.", "start": 226.48, "duration": 4.04}, {"text": "London was also divided into 32 new boroughs. But that's a story for another time.", "start": 231.02, "duration": 5.24}, {"text": "On the 1st of April 1965, four and a half million people woke up as Londoners for the first time", "start": 237.22, "duration": 5.2}, {"text": "and this caused some confusion.", "start": 242.76, "duration": 1.42}, {"text": "Take, for example, Romford. If you were a Romford resident, your council changed but your address didn't.", "start": 245.7, "duration": 5.2}, {"text": "It still said \"Essex\" on your envelopes. So were you still in Essex or not?", "start": 251.04, "duration": 4.46}, {"text": "Technically, the Home Counties around the outside of London all got smaller in 1965.", "start": 256.32, "duration": 4.1}, {"text": "Surrey lost a massive chunk, which bizarrely included Surrey County Hall in Kingston", "start": 261.06, "duration": 3.5}, {"text": "which, even more bizarrely, continues to run Surrey to this day despite not being in it.", "start": 264.68, "duration": 3.66}, {"text": "- Oi! Pay your council tax!\n- Why don't you come over here and make me?", "start": 268.78, "duration": 3.36}, {"text": "But one county had the worst luck of them all.", "start": 272.52, "duration": 2.1}, {"text": "Poor old Middlesex, already lumbered with a funny name, was gobbled up almost entirely by Greater London", "start": 275.24, "duration": 4.76}, {"text": "and the remaining bits were ceded to neighbouring Surrey and Hertfordshire.", "start": 280.16, "duration": 2.7}, {"text": "As a result, since 1965, Middlesex is no longer a thing. And the name lives on only on envelopes and in cricket.", "start": 283.7, "duration": 6.48}, {"text": "This is what gives Romford residents an identity crisis.", "start": 291.66, "duration": 2.42}, {"text": "Ceremonially, historically, in their accents, and perhaps in their souls, they're Essex boys and girls,", "start": 294.34, "duration": 5.14}, {"text": "but legally, politically, officially, they're Londoners, whether they like it or not.", "start": 299.78, "duration": 4.52}, {"text": "So why does this matter? What are the benefits of living in Greater London today?", "start": 306.42, "duration": 3.88}, {"text": "And why might you be hacked off if you live just outside the border?", "start": 310.72, "duration": 2.82}, {"text": "One big factor is transport.", "start": 314.48, "duration": 1.3}, {"text": "On London buses, you can pay by contactless, and take advantage of the 2-for-1 Hopper Fare.", "start": 316.02, "duration": 4.08}, {"text": "Whereas buses in the Home Counties are patchy and much more expensive.", "start": 320.42, "duration": 3.14}, {"text": "And it's not just buses that are better.", "start": 324.2, "duration": 1.6}, {"text": "When I turned 60, I got a 60+ Oyster card, which means I can travel anywhere in London for free.", "start": 325.96, "duration": 5.22}, {"text": "Whereas my friend Jill who lives over the border in Hertfordshire has to pay thousands for a season ticket.", "start": 331.6, "duration": 5.72}, {"text": "More important than all of this is democracy. If you live inside the Greater London boundary", "start": 338.2, "duration": 4.28}, {"text": "you get to take part in elections for the London Assembly and the Mayor of London.", "start": 342.52, "duration": 3.18}, {"text": "Think this doesn't matter? Look at the Metropolitan line.", "start": 346.32, "duration": 2.2}, {"text": "Fast trains to Amersham were cancelled by Boris Johnson in 2012", "start": 349.08, "duration": 3.12}, {"text": "And the planned extension to Watford Junction was cancelled by Sadiq Khan in 2016.", "start": 352.44, "duration": 3.6}, {"text": "Would these things have happened if the locals had a chance to vote the mayor out?", "start": 356.48, "duration": 2.94}, {"text": "Does anything need to be done about this?", "start": 360.04, "duration": 1.48}, {"text": "After all, the border of what counts as London has changed time and time again since the Romans.", "start": 361.8, "duration": 4.12}, {"text": "So now, 50-something years since Greater London was invented, is it time to look at those borders again?", "start": 366.22, "duration": 4.78}, {"text": "London may have stopped physically sprawling outwards when the Green Belt was introduced", "start": 371.66, "duration": 3.26}, {"text": "in the 30s, but the capital's influence is still very expanding indeed.", "start": 374.96, "duration": 3.58}, {"text": "People are now commuting into London from further than ever before as they seek cheaper housing.", "start": 379.12, "duration": 3.96}, {"text": "Shouldn't these people have a say in how the city they depend on is run?", "start": 383.46, "duration": 2.92}, {"text": "And then there's the six airports, only two of which are in Greater London. Is it about time that changed?", "start": 386.76, "duration": 4.36}, {"text": "In the end, it's not really important.", "start": 391.72, "duration": 1.7}, {"text": "In a world where borders are worryingly starting to matter more than ever before,", "start": 393.72, "duration": 3.48}, {"text": "this one that we've been discussing is thankfully quite a benign one.", "start": 397.32, "duration": 2.72}, {"text": "It's not as if Greater London is a city state that you need a passport to get into...", "start": 400.56, "duration": 3.6}, {"text": "yet.", "start": 405.04, "duration": 0.72}, {"text": "So for now, depending on how you live, work, shop and feel,", "start": 406.26, "duration": 3.34}, {"text": "the line where London stops and the outside world begins is entirely up to you.", "start": 409.86, "duration": 3.54}, {"text": "And no matter where the official boundary is officially drawn,", "start": 413.84, "duration": 2.48}, {"text": "there will always be people who feel like they're on the wrong side.", "start": 416.4, "duration": 3.48}, {"text": "Oh boy, I can't wait to try out my new Problem Solver 3000.", "start": 423.36, "duration": 3.3}, {"text": "Hello, I'm the Problem Solver 3000. Have you got problems?", "start": 429.58, "duration": 2.84}, {"text": "- Yes, several.\n- What are your problems?", "start": 432.42, "duration": 2.0}, {"text": "- I'm dehydrated.\n- Drink more water.", "start": 434.42, "duration": 1.8}, {"text": "- I've got really skinny arms.\n- Go to the gym.", "start": 436.26, "duration": 2.08}, {"text": "- I miss my mum.\n- Call your mum.", "start": 438.34, "duration": 1.58}, {"text": "I'm not as good as I'd like to be at editing software like Adobe Premiere Pro.", "start": 440.02, "duration": 3.68}, {"text": "Sign up for a monthly subscription to Skillshare.", "start": 443.82, "duration": 2.06}, {"text": "Skillshare is an online learning platform for creators.", "start": 446.26, "duration": 2.64}, {"text": "If you want to improve your skills in Adobe Premiere Pro there's a really good video course on how to use it.", "start": 449.0, "duration": 4.88}, {"text": "And by the way, it's not just editing tips you can get from Skillshare.", "start": 454.02, "duration": 3.06}, {"text": "There's online classes about all sorts of things for creative people", "start": 457.16, "duration": 3.4}, {"text": "like how to make better podcasts, or music, or animations.", "start": 460.64, "duration": 3.08}, {"text": "and best of all, it's unbelievably affordable. A year's subscription costs less than ten dollars a month.", "start": 463.86, "duration": 5.36}, {"text": "That's only £7.64 for a British person.", "start": 469.42, "duration": 2.7}, {"text": "But even better than that, there's a special offer!", "start": 472.24, "duration": 2.0}, {"text": "You can get Skillshare for free for two months.", "start": 474.44, "duration": 2.7}, {"text": "All you have to do is click on the link in the description below, and you get to use Skillshare", "start": 477.28, "duration": 4.44}, {"text": "as much as you want, completely free for two months.", "start": 481.76, "duration": 3.18}, {"text": "It's such a good offer that only 500 people can have it so you have to do it really quickly before it runs out.", "start": 484.94, "duration": 4.94}, {"text": "I can't stress enough how much I really think you should click on the link in the description below", "start": 490.22, "duration": 4.46}, {"text": "to get full access to Skillshare for free for two months.", "start": 494.76, "duration": 3.36}, {"text": "- I don't like baked beans as much as I used to.\n- Stop eating baked beans.", "start": 498.28, "duration": 2.88}, {"text": "- I've never seen Reservoir Dogs.\n- Here's a DVD.", "start": 501.22, "duration": 2.08}, {"text": "- My finger's come off.\n(screams)", "start": 503.46, "duration": 2.0}, {"text": "♫ Skillshare, Skillshare,\n♫ It's free for the first 2 months,", "start": 505.6, "duration": 3.3}, {"text": "♫ Skillshare, Skillshare,\n♫ His finger just came off.", "start": 509.42, "duration": 3.32}, {"text": "♫ ♫ ♫", "start": 513.5, "duration": 1.56}]