[{"text": "Superman is the spirit of classic Americana to the point that he's even seen as a boy Scout", "start": 0.13, "duration": 5.27}, {"text": "and it's a positive thing that Superman is an", "start": 5.58, "duration": 2.79}, {"text": "Overwhelming good guy, because he's also a force so unstoppable that without some form of kryptonite", "start": 8.889, "duration": 5.48}, {"text": "He doesn't lose, but what if you took this incorruptible symbol and broke him pushed him so far", "start": 14.41, "duration": 5.959}, {"text": "He turns those powers on the world [believed] that to save humanity he would need to rule them all with utter ruthlessness", "start": 20.369, "duration": 6.99}, {"text": "[this] is the question asked in the universe of injustice an alternate timeline", "start": 27.789, "duration": 4.699}, {"text": "detailing a world where after a horrific", "start": 32.98, "duration": 2.0}, {"text": "Tragedy Superman snaps and the man of steel uses his power to rule the [Earth] with an iron fist", "start": 35.32, "duration": 6.38}, {"text": "[in] all honesty this series is one of the best DC has released in decades, and I'd highly [recommend] it", "start": 41.86, "duration": 6.349}, {"text": "So this video is my way to teach what went down in [this]", "start": 48.21, "duration": 3.0}, {"text": "Alternate scenario since there are many events to cover and some of them aren't really that important there may be a lot [of] generalizations", "start": 51.28, "duration": 6.56}, {"text": "This also means a lot of spoilers [you've] been warned in this universe Superman's life is pretty much perfect", "start": 58.059, "duration": 6.26}, {"text": "[he's] expecting a baby with his wife Lois lane", "start": 64.36, "duration": 3.169}, {"text": "He's looking forward to a happy future", "start": 67.53, "duration": 1.72}, {"text": "But just like the hopes of a woman's studies major those dreams are about to come", "start": 69.25, "duration": 4.129}, {"text": "Crumbling down in the middle of the night Lois lane is kidnapped at the docks while investigating a tip for [the] daily [planet]", "start": 73.51, "duration": 6.349}, {"text": "with Jimmy Olsen photographer extraordinaire", "start": 80.229, "duration": 2.389}, {"text": "By morning Superman noticed she'd gone missing he finds Jimmy's dead body down at the docks", "start": 83.31, "duration": 5.94}, {"text": "Alongside a bloody joker card the rest of the Justice [league] is called in to investigate", "start": 89.71, "duration": 4.489}, {"text": "Scarecrow was found dead in his lab all his fear toxins", "start": 94.99, "duration": 3.29}, {"text": "The gas that makes people see their [worst] [fear] was stolen Joker is tracked to a submarine hiding under the docks", "start": 98.28, "duration": 5.79}, {"text": "Which superman Bergson finding Joker and Harley quinn operating on Lois if it would gas", "start": 104.35, "duration": 5.779}, {"text": "Doomsday appears without a second thought superman launches the monster into outer space that gas", "start": 110.59, "duration": 5.66}, {"text": "[was] the stolen fear toxin the sub and the toxin wasn't the only thing Joker had took he also?", "start": 116.56, "duration": 6.139}, {"text": "Stole a nuke a nuke now placed in the center [of] Metropolis set to detonate once the heartbeat of Lois lane", "start": 123.04, "duration": 7.239}, {"text": "Stopped by the time Joker's plan is pieced together. It's too late", "start": 130.59, "duration": 4.879}, {"text": "Doomsday was Lois superman had just killed her metropolis", "start": 136.05, "duration": 4.49}, {"text": "Explodes and millions die in the span of [two] minutes Superman killed everything", "start": 141.18, "duration": 5.449}, {"text": "Tying him to a normal human [life], and he snaps in his rage", "start": 146.82, "duration": 4.19}, {"text": "He promptly flies over and kills joker so do you think it's Superman just evil now driven [to] insanity?", "start": 151.01, "duration": 6.839}, {"text": "Well, not exactly superman is broken", "start": 158.22, "duration": 2.9}, {"text": "but still thinks he can do good [he] feels overwhelming guilt for well that and", "start": 161.31, "duration": 5.93}, {"text": "goes into isolation", "start": 167.61, "duration": 1.34}, {"text": "And there his mind begins to warp he relates any", "start": 168.95, "duration": 3.779}, {"text": "Conflict to his own personal tragedy [our] violence ruins countless lies every day", "start": 173.07, "duration": 5.63}, {"text": "He never wants anybody to feel the sense of loss from such destruction", "start": 178.7, "duration": 4.439}, {"text": "And now has a new purpose traditionally superman never forced his will on people", "start": 183.14, "duration": 5.1}, {"text": "He could have but instead he just protected them letting them do their own thing except for in Superman for the quest for peace", "start": 188.67, "duration": 7.369}, {"text": "We don't talk about that now now", "start": 196.04, "duration": 1.53}, {"text": "He doesn't care about anything else, but this goal nobody else is strong enough to do anything in minutes", "start": 197.57, "duration": 6.059}, {"text": "He topples a dictator bringing a bloody civil war to an immediate end he announces to the world stop your fighting or I?", "start": 203.63, "duration": 7.229}, {"text": "Will make you this means everybody even the united States [fall] in the line the rest of the Justice league is shocked", "start": 211.23, "duration": 6.829}, {"text": "But most actually signed with him. He saved the world many times", "start": 218.06, "duration": 3.6}, {"text": "He's their friend and ally and even if those actions are a bit extreme", "start": 222.18, "duration": 4.52}, {"text": "They still are with the best intentions and they prevent conflict others immediately [question] this Batman", "start": 226.95, "duration": 6.44}, {"text": "Did you see Joker get his chest punched through by supes and remember that moral to never kill except for Snyder Batman?", "start": 233.42, "duration": 7.529}, {"text": "But we don't talk about that either [Batman] remains uncorrupted believing that violence is horrible", "start": 240.95, "duration": 5.759}, {"text": "but people should be free to [choose] their own path if clark is bringing Peace by Fear is nothing more than a", "start": 246.75, "duration": 7.19}, {"text": "Tyrant even if the storyline of injustice may get muddled this is the core", "start": 254.04, "duration": 4.519}, {"text": "Ideological conflict how far should superman go to stop innocent?", "start": 258.9, "duration": 4.009}, {"text": "From being lost is ruling by fear good if people stop fighting keep that in mind", "start": 263.07, "duration": 5.339}, {"text": "Most countries don't react too well being told not to fight some stuff happens with Atlantis the Kraken is awoken [aquaman] leaves there", "start": 268.53, "duration": 7.5}, {"text": "You're welcome aquaman fan", "start": 276.24, "duration": 1.11}, {"text": "I talked about him even if you stopped war the world is still violent Crime happens [too] clark", "start": 277.35, "duration": 5.73}, {"text": "Batman's Code Kept Joker alive all these years", "start": 283.36, "duration": 2.809}, {"text": "Had he [just] killed Joker", "start": 286.78, "duration": 2.0}, {"text": "Millions when [it'd] have died including his family so we've done with mercy focuses his sights on the center of all Gotham criminals", "start": 289.03, "duration": 8.0}, {"text": "Arkham he decides all criminals need to be taken [someplace]", "start": 297.61, "duration": 2.959}, {"text": "Where they'll never get out this immediately causes risk inside the bat family Batman nightwing and Robin Young Robin", "start": 301.06, "duration": 7.04}, {"text": "Damian Wayne agrees with Superman he believes his dad has been far too merciful", "start": 308.44, "duration": 4.19}, {"text": "Criminals shouldn't be protected only to Commit Crimes again", "start": 313.45, "duration": 3.32}, {"text": "What superman do whatever he wants Superman's ideas begin normalizing this ruthless mindset?", "start": 316.93, "duration": 5.9}, {"text": "And it's easy for Damian to agree with it Batman though never Shakes his morals. This won't stop at criminals", "start": 322.83, "duration": 6.63}, {"text": "Where is that line drawn a showdown occurs in [Arkham] Batman and nightwing standing against the Justice league with Robin at their side?", "start": 329.46, "duration": 7.979}, {"text": "Chaos Erupts prisoners escape fighting occurs Robin throws his baton at nightwing [a] split second accident", "start": 337.71, "duration": 6.389}, {"text": "Nightwing loses his balance and breaks his [neck] on a rock he dies whoops this single act", "start": 344.37, "duration": 6.3}, {"text": "changes the relationship between the father and son forever", "start": 350.89, "duration": 2.989}, {"text": "Damien killed Batman's closest thing to a second son the rift between the two groves", "start": 354.22, "duration": 5.39}, {"text": "Robin living with the guilt of killing Dick Grayson and", "start": 360.19, "duration": 2.899}, {"text": "Batman pushing him away sending robin on the path of being a superman loyalist Superman's change alienated former friends", "start": 363.46, "duration": 7.94}, {"text": "Batman forms an underground resistance another Justice league who stands against Superman", "start": 371.8, "duration": 4.7}, {"text": "Green Arrow Huntress Martian Manhunter Captain Atom Harley quinn you get the point", "start": 376.87, "duration": 4.73}, {"text": "Meanwhile in the Actual Justice league Lex Luthor develops a pill allowing Superman's", "start": 381.78, "duration": 4.26}, {"text": "followers to have his powers wait Lex luthor", "start": 386.11, "duration": 3.199}, {"text": "[oh], yeah", "start": 389.31, "duration": 0.54}, {"text": "In this timeline lex was never enemies with superman their lifelong friends the pill that lex creates may not give pia", "start": 389.85, "duration": 7.17}, {"text": "pull the full power of Superman", "start": 397.11, "duration": 1.45}, {"text": "But allows them to emulate some of his abilities now Batman being Batman found out about this he [had] his own spy", "start": 398.56, "duration": 6.979}, {"text": "Martian Manhunter and the red base the entire time Robin discovered this and [notifies] superman that the spies on the base", "start": 405.639, "duration": 6.559}, {"text": "Superman tells the World Bruce Wayne is Batman [as] things heat up", "start": 412.539, "duration": 3.35}, {"text": "Batman knows that the kill and replicating [his] formula is the only way the resistance has a fighting chance", "start": 416.199, "duration": 5.66}, {"text": "That pill is in the fortress of solitude", "start": 422.169, "duration": 2.42}, {"text": "So the distraction [per] man the United States sends forces to Korea", "start": 424.96, "duration": 5.119}, {"text": "Remember Superman hates war but it was just a ruse so Batman's team could get into the fortress and oh", "start": 430.389, "duration": 7.19}, {"text": "Superman's parents are there and just in time for him [to] arrive back", "start": 438.159, "duration": 3.89}, {"text": "He sees Batman with his parents in belize the government and Batman is trying to take his family as hostages", "start": 442.09, "duration": 7.549}, {"text": "He becomes furious green arrow shoots an arrow with the pill on it to the survivors on the outside before being beat to death", "start": 449.699, "duration": 7.44}, {"text": "by an enraged Superman", "start": 457.419, "duration": 1.581}, {"text": "But green arrow sacrificed himself for a noble cause now", "start": 459.0, "duration": 3.899}, {"text": "Batman's resistance has a fighting chance knowing his power will be challenged Superman declares a new global state", "start": 463.21, "duration": 6.619}, {"text": "The regime, so there was a lot of filler as well that didn't really kind to the games", "start": 470.02, "duration": 4.819}, {"text": "So I'm sorry if I've a sleep oversimplify a lot of things for the sake of time seeing an opportunity", "start": 474.839, "duration": 4.8}, {"text": "Sinestro becomes allies was Superman's regime [Pal] Jordan helps his enemy", "start": 480.19, "duration": 4.549}, {"text": "Sinestro and Superman as the entire Green Lantern Corps", "start": 484.87, "duration": 3.5}, {"text": "All come to dispose of the tyrant a giant war erupts", "start": 488.56, "duration": 4.009}, {"text": "How loses his ring for betraying his own kind but gains a fancy yellow ring for fighting Alongside, Sinestro?", "start": 492.569, "duration": 6.39}, {"text": "So [does] Superman the Sinestro Corps feeds off fear and by using the fear of an entire planet?", "start": 498.99, "duration": 5.82}, {"text": "Superman Kills most of the Green Lantern [Corps]", "start": 505.089, "duration": 2.75}, {"text": "[I'm] going to skip over a lot of filler magic exists Raven is captured by it constantine comes along Dead man shows up", "start": 507.94, "duration": 6.619}, {"text": "Nightwing dick Grayson comes back as the new [Dead] [man]", "start": 514.959, "duration": 2.75}, {"text": "Superman stops being a yellow Lantern trigon shows up mister mit the pizza head shows up reality begins tearing apart Dr.", "start": 517.959, "duration": 7.07}, {"text": "Fate steps in the [way] detective chip flosses heck constantine says that was my plan all [along]", "start": 525.029, "duration": 4.35}, {"text": "Thing really came from that meanwhile Olympic gods like zeus are angry and come down they leave", "start": 530.14, "duration": 4.739}, {"text": "Nothing from that either flash forward it's been five years since metropolis exploded now", "start": 535.04, "duration": 4.759}, {"text": "We're getting back to the plot Superman is now a bitter shadow of his former self", "start": 539.8, "duration": 4.44}, {"text": "Simply because he lost his family he selfishly claimed many more lives Martian Manhunter Black Canary", "start": 544.91, "duration": 7.07}, {"text": "Green arrow, he's given up on being nothing less than a big dick t'V despot", "start": 552.59, "duration": 4.549}, {"text": "He doesn't even put up an image anymore", "start": 557.14, "duration": 2.369}, {"text": "Simply says that the people of Earth must obey his rule the [nation's] must obey no freedom of speech", "start": 559.51, "duration": 7.289}, {"text": "no nukes", "start": 567.29, "duration": 1.05}, {"text": "No resistance joker ironically becomes a figurehead of rebellion even though he rules all", "start": 568.34, "duration": 5.959}, {"text": "Superman is at his weakest afraid of losing power. It's turned him petty even having alfred Pennyworth secretly", "start": 574.61, "duration": 8.0}, {"text": "Assassinated simply for insulting his rule, but he knows he's right Damian Wayne has grown up in conflict now", "start": 583.22, "duration": 7.039}, {"text": "He's taken on the nightwing mantle. He doesn't have the ideology of his father", "start": 590.26, "duration": 3.989}, {"text": "He's been shaped by the merciless ideas of Superman criminals must be met with immediate death in", "start": 594.38, "duration": 6.559}, {"text": "Death is now far too common superman views the friends that he has left as simply soldiers", "start": 601.31, "duration": 6.44}, {"text": "It's costing him allies including", "start": 607.75, "duration": 2.16}, {"text": "Lex Luthor who begins working with Batman Lex believes that the only people that can defeat superman is", "start": 610.73, "duration": 6.32}, {"text": "Alternate versions of themselves they have to bring them through", "start": 617.39, "duration": 3.5}, {"text": "The multiverse the multiverse is basically all the parallel universes within DC, but to get such a machine to work", "start": 621.17, "duration": 6.5}, {"text": "They have to steal on mother box hiring Deathstroke", "start": 627.67, "duration": 3.479}, {"text": "Who's all too happy to get out of retirement [he] sends back the schematics?", "start": 631.15, "duration": 3.39}, {"text": "But [not] before being captured before superman could stop them the machine goes off transporting the alternate versions of themselves", "start": 634.54, "duration": 6.419}, {"text": "Into this universe thus beginning the plot of the injustice game", "start": 641.42, "duration": 4.25}, {"text": "I think injustice works because it brings out the complex questions that can come from power at what point does safety start and", "start": 645.85, "duration": 7.169}, {"text": "Infringing on rights begin it brings another dynamic to a superhero story", "start": 653.24, "duration": 4.58}, {"text": "Superman's Road to hell started with good intentions", "start": 658.1, "duration": 3.23}, {"text": "and conflict", "start": 662.06, "duration": 0.78}, {"text": "But as his mental health kept deteriorating he kept moving the goalposts and became the tyrant [Batman] warned about", "start": 662.84, "duration": 7.5}, {"text": "Superman may be depicted as a God at times", "start": 670.68, "duration": 2.509}, {"text": "But he's still simply a man even if he physically cannot be hurt his mind was always vulnerable", "start": 673.19, "duration": 6.12}, {"text": "Joker saw this and as he said it was far too easy. As a DC fan and a fan of alternate history", "start": 679.49, "duration": 5.429}, {"text": "I couldn't help but do a video about this it's a simple overview for people who haven't searched it out and speaking of superman even", "start": 684.96, "duration": 7.549}, {"text": "[though] he's beating Oliver queen to death. He's still clean-shaven. So what's your excuse special?", "start": 692.51, "duration": 4.98}, {"text": "Thanks to dollar shave club for sponsoring this video with all the issues in my life", "start": 697.49, "duration": 4.44}, {"text": "Razors usually are not at the top of my mind when they are", "start": 702.24, "duration": 3.589}, {"text": "It's usually want to get home and remember that I didn't get any", "start": 705.96, "duration": 3.83}, {"text": "Thus I would go through the cycles of using dull razors rather than have to go out to the store far too often", "start": 710.1, "duration": 6.739}, {"text": "But my deepest surprise dollar shave club has been", "start": 716.97, "duration": 2.779}, {"text": "Incredibly useful [I] mean I never really cared about my razors until I started using dollar shave club", "start": 720.3, "duration": 5.75}, {"text": "It was [a] smart choice", "start": 726.33, "duration": 1.35}, {"text": "Because instead of just reusing dull razors or having to get overly expensive ones", "start": 727.68, "duration": 4.939}, {"text": "They send me multiple quality razors right to my door every month and is giving me a much better shaving experience", "start": 732.72, "duration": 6.979}, {"text": "Right now for a limited time if you use my url", "start": 740.25, "duration": 2.9}, {"text": "Wwf [club] comm slash all history or click on the link in the description new members get their first month of the executive razor", "start": 744.42, "duration": 7.219}, {"text": "With a tube of their [doctor] [carver] shave butter for only [5] dollars with free shipping", "start": 751.77, "duration": 5.63}, {"text": "that's a", "start": 757.58, "duration": 0.67}, {"text": "[$15] value", "start": 758.25, "duration": 0.72}, {"text": "For five bucks and after that the razors are just a few bucks a month in your first month box", "start": 758.97, "duration": 5.96}, {"text": "You get a solid handle four cartridges and a tube of their shave butter to have a service [that] drops off razors", "start": 764.93, "duration": 6.989}, {"text": "I know or quality", "start": 771.92, "duration": 1.78}, {"text": "Consistently every month. It's just more satisfying than I ever thought", "start": 773.7, "duration": 3.38}, {"text": "It would be it's something you don't think about until you have it. So what are you waiting for [use] my url", "start": 777.08, "duration": 6.929}, {"text": "Wwf club.com slash all history or click on the link in the description and get your first month of the executive razor", "start": 785.16, "duration": 6.2}, {"text": "With a tube of their dr.. [Carver's] shave butter for only five dollars today", "start": 791.46, "duration": 4.729}]