[{"text": "I texted this clip to my wife who wanted proof", "start": 2.409, "duration": 2.0}, {"text": "I wasn't doing anything stupid on a recent trip to the Bahamas", "start": 4.41, "duration": 2.94}, {"text": "Now if you're wondering what my feet are doing in shark-infested waters with a bucket of blood 20 miles away from any land", "start": 7.35, "duration": 6.03}, {"text": "Well, that comes down to a conversation. I had with my friends at the Discovery Channel six months ago", "start": 13.599, "duration": 5.179}, {"text": "They told me Shark Week is coming up and they want to know what I would do", "start": 18.779, "duration": 2.73}, {"text": "if they could put me in the middle of the ocean on a boat surrounded by sharks for as long as I can remember", "start": 21.51, "duration": 4.979}, {"text": "I've always wanted to test if sharks can really smell a drop of blood in the water from a mile away", "start": 26.49, "duration": 4.92}, {"text": "Now before you say Mythbusters already did this", "start": 31.93, "duration": 2.659}, {"text": "They kind of did this as you can see to test this they poked their fingers and then stuck them in a barrel with these", "start": 35.26, "duration": 6.02}, {"text": "Tiny lemon sharks and since they didn't really seem to turn around and look at their fingers", "start": 41.28, "duration": 3.549}, {"text": " ", "start": 44.829, "duration": 0.5}, {"text": " ", "start": 45.329, "duration": 0.5}, {"text": " ", "start": 45.829, "duration": 0.5}, {"text": "They said it was busted now", "start": 46.329, "duration": 0.5}, {"text": " ", "start": 46.829, "duration": 0.5}, {"text": " ", "start": 47.329, "duration": 0.5}, {"text": " ", "start": 47.829, "duration": 0.5}, {"text": "I'm friends with both Kari and Adam, but I think even they would have been at least in this case", "start": 48.329, "duration": 2.88}, {"text": "The methodology was less than scientifically rigorous", "start": 51.21, "duration": 3.0}, {"text": "so I came up with a more robust test procedure built some NASA great hardware for the experiment hopped on a plane and then a", "start": 54.28, "duration": 6.229}, {"text": "Speedboat and soon enough. I was 20 miles offshore of the Bahamas", "start": 60.579, "duration": 3.11}, {"text": "To kick things off I sat down with my marine biologist shark diving expert friend Luke Tipple and explained my plan in eventually", "start": 75.009, "duration": 6.23}, {"text": "Eventually I plan to test just how far they could smell a single drop of blood in the water", "start": 81.24, "duration": 3.51}, {"text": "But first I wanted proof that they actually preferred blood over any other scent", "start": 84.75, "duration": 4.29}, {"text": "So for my first experiment", "start": 89.04, "duration": 1.289}, {"text": "I plan to put four surfboards in the water equa-distant from the back of the boat", "start": 90.329, "duration": 3.54}, {"text": "each board would host two litres of a different liquid that we would pump into the ocean over the course of an hour then using", "start": 93.869, "duration": 5.7}, {"text": "A three meter radius around each board as a gauge we would use drone footage and count how many sharks went over to check out?", "start": 99.57, "duration": 5.819}, {"text": "Each board. So this board would be fish oil, which I heard was a general attractant for lots of fish", "start": 105.39, "duration": 4.979}, {"text": "Then we would have cows blood here", "start": 110.369, "duration": 1.921}, {"text": "Then sea water here as a control to make sure the Sharks weren't just interested in the surfboard and then finally urine I've heard", "start": 112.29, "duration": 6.059}, {"text": "From surfers that a lot of them won't pee in their wetsuits because they feel like it's gonna attract a shark", "start": 118.349, "duration": 4.211}, {"text": "I don't know a surfer alive who doesn't pee in their wetsuit.", "start": 123.08, "duration": 3.32}, {"text": "But yes that's definitely something that I've heard, a lot.", "start": 126.4, "duration": 2.94}, {"text": "It'll liberate surfers everywhere, if we show it's cool to pee in your wet suit.", "start": 129.34, "duration": 4.18}, {"text": "And so after a bit more discussion Luke was on board for the first of our two experiments", "start": 133.52, "duration": 4.08}, {"text": "Well as a firm believer in the scientific method, we'll test it out", "start": 137.6, "duration": 3.46}, {"text": "And then you'll dive", "start": 141.06, "duration": 1.54}, {"text": "Well, depending on the results I dive", "start": 142.6, "duration": 2.08}, {"text": "If I can't pee, then the deal's off", "start": 144.68, "duration": 3.34}, {"text": "And so with that we started putting the four boards together", "start": 148.02, "duration": 1.98}, {"text": "[Music]", "start": 150.0, "duration": 7.28}, {"text": "We also started collecting scientific donations from the crew", "start": 157.42, "duration": 3.94}, {"text": "All right, so now it's time to fill these bags. Mm-hmm, what do you want to do first - pee or blood?", "start": 162.88, "duration": 4.819}, {"text": "Yeah, let's do pee. Okay, let's do rock-paper-scissors for who holds the bucket and who holds the bag", "start": 167.7, "duration": 5.68}, {"text": "Alright, one two three shoot?", "start": 173.38, "duration": 1.66}, {"text": "Ohh I gotta strategize... okay I know I know", "start": 175.04, "duration": 2.42}, {"text": "One two three shoot.", "start": 177.64, "duration": 2.1}, {"text": "Yeaaaa. Dammit", "start": 179.74, "duration": 1.32}, {"text": "Ohh that smells so bad", "start": 181.38, "duration": 1.62}, {"text": "It's urine", "start": 183.0, "duration": 1.24}, {"text": "Whosever's it is, they need to hydrate - dude this is going to be a nightmare.", "start": 184.24, "duration": 3.24}, {"text": "Oh it's warm", "start": 190.1, "duration": 2.0}, {"text": "Your pouring sucks!", "start": 193.4, "duration": 1.14}, {"text": "Okay", "start": 198.12, "duration": 1.12}, {"text": "Oh that smell of", "start": 199.5, "duration": 1.86}, {"text": "All in the name of science", "start": 201.37, "duration": 2.0}, {"text": "That's a great time of day to be doing this cuz we have a lot of sharks looking down here", "start": 203.4, "duration": 3.98}, {"text": "we got three or four lemons on the surface and I can actually see two Tigers", "start": 207.52, "duration": 4.34}, {"text": "down on the bottom and that's actually a massive tiger shark", "start": 211.98, "duration": 3.0}, {"text": "That is huge", "start": 215.2, "duration": 2.0}, {"text": "All right, see if you can do it better job pouring than I did. Oh", "start": 217.209, "duration": 2.809}, {"text": "my gosh", "start": 220.69, "duration": 0.5}, {"text": "Oh wow. There's a feeding frenzy", "start": 221.19, "duration": 3.49}, {"text": "It's fine", "start": 226.1, "duration": 0.58}, {"text": "What do you mean don't move it? I almost lost my hands", "start": 226.74, "duration": 2.56}, {"text": "They're not gonna jump out of the water.", "start": 229.56, "duration": 2.0}, {"text": "Okay, so we've got sea water as our control, fish oil,  we have urine, and cows blood", "start": 231.56, "duration": 5.7}, {"text": "So while Luke is bravely swimming the four surfboards out and anchoring them in place in preparation for the one hour countdown", "start": 243.72, "duration": 5.88}, {"text": "Now is a perfect time to explain the cool tech on each board", "start": 249.6, "duration": 3.2}, {"text": "I designed and built from scratch with my buddy Shawn Hodgins", "start": 252.8, "duration": 3.26}, {"text": "For this experiment to be robust", "start": 256.06, "duration": 1.089}, {"text": "All four boards need to start pumping at the exact same time after Luke has them in place", "start": 257.15, "duration": 5.01}, {"text": "That means we need to somehow start the pumps using a radio signal from the boat", "start": 262.23, "duration": 4.819}, {"text": "so each surfboard has a waterproof receiver box like this that also hosts the battery, a custom printed circuit board, and two Arduinos", "start": 267.08, "duration": 6.96}, {"text": "Then I have the remote control and as soon as I hit this button", "start": 274.04, "duration": 3.98}, {"text": "[mechanical whirring]", "start": 278.02, "duration": 1.64}, {"text": "They all start pumping at the same time", "start": 279.66, "duration": 2.08}, {"text": "We know each pump is working because the corresponding yellow light is lit up", "start": 281.75, "duration": 3.69}, {"text": "That's important because they're too far away from the boat to see if they're functioning properly", "start": 285.64, "duration": 4.36}, {"text": "To pump the blood and pee", "start": 290.0, "duration": 1.41}, {"text": "We're using a peristaltic pump", "start": 291.41, "duration": 1.53}, {"text": "this is a perfect choice because it's a totally sterile way to get the blood from the bag to the", "start": 292.94, "duration": 4.289}, {"text": "Ocean since the blood never touches any sort of valve or something", "start": 297.3, "duration": 2.869}, {"text": "It just has these rollers that sort of pinch and push the blood through the tubing in a manner that just happens to be similar", "start": 300.169, "duration": 5.58}, {"text": "To a severed artery", "start": 305.75, "duration": 0.805}, {"text": "And so with the board's in place", "start": 306.555, "duration": 1.355}, {"text": "It was go time", "start": 308.61, "duration": 1.8}, {"text": "operation shark bait test thing commence -  three two one... beep", "start": 310.41, "duration": 6.139}, {"text": "All four going we have confirmation", "start": 318.36, "duration": 2.0}, {"text": "Everything is rolling. The experiment is underway. We'll, let them go for an hour just dripping stuff out", "start": 322.83, "duration": 5.48}, {"text": "And yea we'll see what happens.", "start": 328.31, "duration": 2.0}, {"text": "And after ten minutes I was really surprised there wasn't a lot of action on any of the boards", "start": 343.9, "duration": 5.39}, {"text": "So so far. It's pretty interesting", "start": 350.08, "duration": 1.7}, {"text": "I mean we've shown if you have a massive cut and you're bleeding out and there's this many sharks within like", "start": 351.78, "duration": 6.51}, {"text": "50 yards of you that they're kind of like 'meh' so like already that's an interesting finding, right?", "start": 358.68, "duration": 5.12}, {"text": "You would think like a little bit of blood and there would just be a massive swarm", "start": 365.14, "duration": 3.8}, {"text": "But that's not the case so far", "start": 369.06, "duration": 0.66}, {"text": "And to be clear we weren't dealing with small quantities here the human body contains five liters of blood and after you use", "start": 369.72, "duration": 6.38}, {"text": "Two liters, which is the exact amount. We're putting in the water then you die", "start": 376.18, "duration": 3.83}, {"text": "About 20 minutes in things were still pretty quiet, especially at the fish oil urine and control boards", "start": 381.37, "duration": 6.32}, {"text": "But then the blood board started attracting some smaller fish and soon after one or two sharks started taking notice", "start": 387.69, "duration": 6.57}, {"text": "Not a lot of love for my pee. I don't know why I find that kind of offensive, but I'm just a little hurt", "start": 395.11, "duration": 5.48}, {"text": "Eventually with about 15 minutes left things started getting pretty wild over by the blood board", "start": 401.919, "duration": 5.51}, {"text": "The blood was spread out and made almost like a blood run way", "start": 410.38, "duration": 3.859}, {"text": "So you have the surreal line of sharks swimming up this", "start": 414.24, "duration": 3.0}, {"text": "Enticing blood trail one after another only to be super disappointed to find a big piece of styrofoam", "start": 417.4, "duration": 4.7}, {"text": "We're almost done", "start": 428.3, "duration": 1.2}, {"text": "Three-two-one, the motors have stopped our experiment is done. I just like to point out the bags have been sucked dry", "start": 429.6, "duration": 8.56}, {"text": "So the engineering part of this experiment", "start": 438.58, "duration": 2.959}, {"text": "was flawless", "start": 442.11, "duration": 1.44}, {"text": "Gunshot everywhere. Yeah, no to super pissed off targets", "start": 443.55, "duration": 4.52}, {"text": "and so now it's time to go in and review the footage and get a final tally for each board and what we found was", "start": 448.77, "duration": 6.32}, {"text": "that four sharks went to check out the fish oil then zero sharks went to check out both the control and", "start": 455.09, "duration": 5.82}, {"text": "The urine and then the blood board had a direct visit from a whopping", "start": 461.19, "duration": 3.649}, {"text": "41 sharks", "start": 465.449, "duration": 0.921}, {"text": "and so now that we debunked some surfing myths about", "start": 466.37, "duration": 2.429}, {"text": "Urine and proved that sharks certainly had a strong preference for blood over anything we tested the real question was", "start": 468.93, "duration": 6.2}, {"text": "Just how much blood is interesting to them and there was one part of the experimental design", "start": 475.26, "duration": 4.519}, {"text": "That was really nagging at me. Cuz that was cows blood right that was cows blood. You wanna try human", "start": 479.91, "duration": 5.929}, {"text": "At least 10 living braiding blood bags around here", "start": 486.36, "duration": 2.96}, {"text": "Not everyone was luke and I about this idea", "start": 491.22, "duration": 3.44}, {"text": "Yeah, and then just draw will just have fresh blood just mainline it and put it in the water one up. Would you be down?", "start": 494.85, "duration": 5.389}, {"text": "Moondog, what do you reckon look at me?", "start": 501.479, "duration": 2.0}, {"text": "So Luke made some calls and soon enough we had an amazing certified bhajami and phlebotomist on board", "start": 506.4, "duration": 5.389}, {"text": "And after some generosity from the camera crew and even captain Scotty", "start": 518.88, "duration": 3.739}, {"text": "We had four bulging bags of human blood for our second experiment", "start": 522.62, "duration": 3.359}, {"text": "This is my actual blood free to see if sharks have a taste for it", "start": 525.98, "duration": 3.119}, {"text": "And if they do I probably won't go three dining with them for the second experiment. We had three boards again", "start": 529.14, "duration": 6.44}, {"text": "We placed the control in the middle the board over here would pump the human blood", "start": 535.58, "duration": 3.959}, {"text": "Slowly at one drop a minute and then on the other side this board would pump the blood fast on", "start": 539.64, "duration": 4.669}, {"text": "average one drop every four seconds we were able to do that because another cool feature for the boxes we built was that by turning", "start": 544.529, "duration": 6.14}, {"text": "This knob you can control the flow rate", "start": 550.67, "duration": 2.19}, {"text": "So over time they can pump out different amounts and because sometimes we all have to step up and just do our part while Luke", "start": 552.86, "duration": 6.239}, {"text": "Once again risked his life by placing the three boards. I'd prepared to push a button", "start": 559.1, "duration": 3.869}, {"text": "All right, all of them are popular and good to go now the clock is ticking", "start": 571.25, "duration": 3.799}, {"text": "So we have like fifty five more minutes to go", "start": 575.3, "duration": 2.63}, {"text": "We'll see if the Sharks notice there", "start": 578.45, "duration": 2.0}, {"text": "One drop of human blood every four seconds may sound like a lot and it certainly is but it's also important to note", "start": 581.96, "duration": 5.69}, {"text": "That's 40 times less than the first experiment where we saw so much activity in this case halfway in to experiment number two", "start": 587.65, "duration": 6.539}, {"text": "Even though there were tons of sharks still in the area. The boards themselves were pretty quiet", "start": 594.38, "duration": 4.669}, {"text": "We'll have to see when we look at the footage afterwards. But so far it looks like the answer's no", "start": 599.779, "duration": 4.4}, {"text": "Five four three two one", "start": 606.17, "duration": 3.95}, {"text": "Experiments over", "start": 612.65, "duration": 0.72}, {"text": "and so after the full hour we brought in the board's and once again reviewed the footage to see that over the course of an", "start": 613.37, "duration": 5.239}, {"text": "hour zero sharks two checked out the control board zero checked out the slow blood pumping board and", "start": 618.61, "duration": 5.4}, {"text": "Exactly zero sharks checked out the fast one", "start": 624.23, "duration": 3.08}, {"text": "So this is by no means a perfect experiment", "start": 627.31, "duration": 2.549}, {"text": "but I think it's safe to", "start": 629.86, "duration": 1.15}, {"text": "Qualitatively say that if no sharks came to check out 15 drops of human blood a minute in the middle of shark-infested", "start": 631.01, "duration": 6.739}, {"text": "Waters and probably gonna be okay with a small scrape", "start": 637.97, "duration": 2.27}, {"text": "I mean there certainly won't be some kind of feeding frenzy with a single drop of blood from all sharks within a mile", "start": 640.24, "duration": 5.19}, {"text": "Now that I had some first-hand data to put my mind at ease", "start": 646.37, "duration": 2.33}, {"text": "I was willing to try diving with the sharks without a cage, but I had one final experiment", "start": 648.7, "duration": 4.619}, {"text": "I had a theory that if we secured a", "start": 653.32, "duration": 1.87}, {"text": "360 camera to the front of a hand spear and then shot it near some sharks", "start": 655.19, "duration": 3.95}, {"text": "We could create the world's first really cool matrix, like underwater bullet time effect. So I suited up", "start": 659.14, "duration": 5.459}, {"text": "and goddamn I", "start": 666.05, "duration": 2.0}, {"text": "Like theory proved correct on the whole time ham spirit because as you can see that footage", "start": 677.39, "duration": 7.58}, {"text": "What I'll take home from this shoot is just more evidence of", "start": 754.79, "duration": 3.289}, {"text": "the amazing animal that sharks are but also the ability to point people in a specific direction to say", "start": 758.81, "duration": 5.719}, {"text": "Hey your thoughts about them are a little overblown this experience. Definitely changed my perception on sharks", "start": 764.529, "duration": 6.179}, {"text": "I would say I respect them more after seeing their raw power up close at the same time", "start": 770.709, "duration": 4.59}, {"text": "There's less of that fear that comes from ignorance on top of all that I didn't die", "start": 775.3, "duration": 3.899}]