[{"text": "Do you all remember that classic kid's movie made in the 70s about a pig and a spider?", "start": 0.0, "duration": 6.046}, {"text": "Yeah, Charlotte's Web? (YOU ALREADY DID A VIDEO ABOUT THIS MAN!)", "start": 6.046, "duration": 1.86}, {"text": "Remember how it made us a lot of money?", "start": 7.906, "duration": 3.18}, {"text": "Wait, didn't we already have this conversation?", "start": 11.086, "duration": 1.98}, {"text": "Yeah, we did but we're remaking this conversation with better graphics and Will Smith! (hOw?)", "start": 13.066, "duration": 6.92}, {"text": "YaaAAaaaaAaAaAaAAaH (Das hot)", "start": 20.206, "duration": 0.99}, {"text": "but why would we remake something that's already good on its own when we could be making", "start": 21.196, "duration": 3.083}, {"text": "something totally original? (HE HAS A POINT!)", "start": 24.279, "duration": 2.767}, {"text": "Because Ethan, we don't want to take risks and this will make us more money!", "start": 27.046, "duration": 4.42}, {"text": "B-but won't it be obvious to the audience that we're only doing these remakes for the money?", "start": 31.546, "duration": 4.715}, {"text": "They'll watch it anyways. (Ya think?)", "start": 36.261, "duration": 2.165}, {"text": "(epic evil laugh for box office $$$)", "start": 38.426, "duration": 1.07}, {"text": "I don't want you to think that I think, that all sequels and remakes are bad. (Unless if they're cringy, its bad.)", "start": 39.496, "duration": 3.919}, {"text": "one of my favourite movies is a spin-off. (HOW DID WILL GET HERE?)", "start": 43.415, "duration": 2.391}, {"text": " ", "start": 45.886, "duration": 0.5}, {"text": "and I'm very excited for the remake of The Dark Crystal to come out", "start": 46.386, "duration": 3.0}, {"text": "and if you think im gonna make a video talking", "start": 49.386, "duration": 2.18}, {"text": "about it when it comes out, you are absolutely correct. (Another part 2 for baby james?)", "start": 51.566, "duration": 3.3}, {"text": "So Disney is remaking a bunch of classics into live-action movies.", "start": 54.866, "duration": 3.34}, {"text": "They did it with Tarzan, Alice in Wonderland, and they did with 101 Dalmatians.. twice!", "start": 58.466, "duration": 5.78}, {"text": "and as someone who enjoys cartoons a little too much; ( ͡° ͜ʖ ͡°)", "start": 64.246, "duration": 3.2}, {"text": "I think would be cool if they remade Treasure Planet or Atlantis into live-action.(Very Cool!)", "start": 67.806, "duration": 3.02}, {"text": "Both of those movies are underrated and have a lot of high-stake action pack adventure that would be perfect for a reboot", "start": 71.026, "duration": 5.75}, {"text": "And if they did get a reboot, it would introduce a new generation of kids to these awesome movies, but that's just my opinion", "start": 76.776, "duration": 6.29}, {"text": "I'm sure Disney has good reasons for making sequels and spin-offs.", "start": 83.286, "duration": 3.26}, {"text": " ", "start": 86.546, "duration": 0.68}, {"text": "Speaking of Disney sequels, I bet some of you forgot the very old straight to VHS Disney sequels", "start": 87.226, "duration": 5.059}, {"text": "I try to forget about them every day", "start": 92.285, "duration": 1.861}, {"text": "You can have your own opinion on the Disney sequels", "start": 94.146, "duration": 2.19}, {"text": "But all the ones that went straight to VHS are terrible. (Disney Sequels SUCK!)", "start": 96.336, "duration": 3.03}, {"text": "Even The Lion King 2? That one emo lion was kind of hot. (I perfer the live action version.)", "start": 99.506, "duration": 4.54}, {"text": "UM, Did I (glITCheS) st-st-st stutter? I know all those sequels were technically done by a different studio", "start": 104.086, "duration": 5.84}, {"text": "But let's just hope that Disney will finally break the bad sequels streak with Frozen 2 or they should just", "start": 109.966, "duration": 6.18}, {"text": "let it go.......", "start": 116.386, "duration": 0.7}, {"text": "...straight to VHS", "start": 117.526, "duration": 1.56}, {"text": "hAHaHA (HaHahHAHhAhahaHAhahahAhaHahAHahAHha)", "start": 119.086, "duration": 0.8}, {"text": "Some franchises like Harry Potter or Lord of the Rings have long overarching stories that are designed to have multiple installments", "start": 119.886, "duration": 6.56}, {"text": "And as long as the studio doesn't stretch out one book into three movies, then those types of movies are absolutely fine", "start": 126.456, "duration": 5.849}, {"text": "But I don't want to talk about those movies (Cause its better.)", "start": 132.306, "duration": 1.83}, {"text": "I want to talk about sequels to standalone films.", "start": 134.136, "duration": 3.29}, {"text": "I believe that a sequel to a standalone film can be done, but it's a delicate process.", "start": 137.426, "duration": 4.38}, {"text": "Because in the first movie you establish the characters in the world they live in", "start": 142.186, "duration": 3.5}, {"text": "then the protagonist has to overcome a problem usually", "start": 145.686, "duration": 2.34}, {"text": "defeating a villain and then the characters who live", "start": 148.156, "duration": 2.535}, {"text": "happily ever after and the story is all wrapped up nicely with a bow and just", "start": 150.691, "duration": 3.754}, {"text": "What a- what a nice story we got there (le female accent)", "start": 154.445, "duration": 2.16}, {"text": "I'm just I'm just gonna set it down and watch it from time to time and not change it one bit", "start": 156.606, "duration": 4.8}, {"text": "but then a sequel comes along and says", "start": 161.646, "duration": 1.76}, {"text": "Oh no", "start": 163.406, "duration": 0.18}, {"text": "\"OHYOUTHOUGHT THECHARACTERSWOULDLIVEHAPPILYEVERAFTER?!?!\"(You can just say, and they lived.)", "start": 163.586, "duration": 2.34}, {"text": "and then rips off the nice bow and says there's another more evil villain who wasn't mentioned", "start": 165.926, "duration": 3.86}, {"text": "In the first movie for some reason if a sequel turns out bad it can devalue the original movie (nooooooo)", "start": 169.806, "duration": 5.16}, {"text": "There's a reason we don't talk about", "start": 175.006, "duration": 1.88}, {"text": "Atlantis 2 or Pocahontas 2 (Because of Brewstew and Micheal peeing on the Pocahontas hat. Y'know?)", "start": 176.886, "duration": 2.18}, {"text": "or Mulan 2 or Hunchback 2 or Aladdin 2 or Cinderella 2 or Beauty and the Beast 2 or Tarzan 2 (HOW MUCH SEQUELS FROM DISNEY IS THERE?)", "start": 179.406, "duration": 5.16}, {"text": "Because they didn't happen.", "start": 185.026, "duration": 1.7}, {"text": "So that's why I'm always impressed", "start": 186.735, "duration": 1.561}, {"text": "whenever a good sequel is made. And a studio that I think does an amazing job at making sequels", "start": 188.296, "duration": 5.19}, {"text": "it's called DreamWorks (kids, sit down and let me tell you when shrek was respected)", "start": 193.606, "duration": 1.48}, {"text": "But I've noticed a pattern with DreamWorks franchises that I've coined the \"DreamWorks Trequal Paradox™\"", "start": 195.166, "duration": 5.78}, {"text": "I think the right word might be trilogy", "start": 201.766, "duration": 1.54}, {"text": "But I'm just gonna say trequal. (I call it a threequal)", "start": 203.315, "duration": 1.891}, {"text": "You see, DreamWorks has a track record of creating amazing sequels,(yay) but pretty sub par trequals (ew)", "start": 205.206, "duration": 5.18}, {"text": "Here's what I mean. Now keep in mind that these are.. not my opinion", "start": 210.646, "duration": 3.92}, {"text": "These reviews are objectively correct facts (yeah pretty much)", "start": 214.566, "duration": 2.039}, {"text": "And also I just want to say I know that these movies are kids movies", "start": 216.606, "duration": 3.389}, {"text": "But I like animated movies more than real ones and I'm a cartoon character. So", "start": 220.036, "duration": 4.669}, {"text": "Shrek 1- great movie great characters great", "start": 225.225, "duration": 2.539}, {"text": "message ten onion layers out of 10.", "start": 227.865, "duration": 1.911}, {"text": "Shrek 2 it's the first movie in history to be better than the original and it created the", "start": 229.776, "duration": 4.859}, {"text": "Best music video of all time. (if you wanna learn more go to your local shaffrillas productions)", "start": 234.635, "duration": 2.151}, {"text": "I need 11 heroes out of 10 (THE THUMBNAIL)", "start": 236.786, "duration": 1.94}, {"text": "Shrek 3...(disgusting)", "start": 238.726, "duration": 0.72}, {"text": "M M M M M M M M M M M M M", "start": 240.446, "duration": 1.1}, {"text": "(Imitating Shrek's beautiful voice) NOT IN MY SWAMP.", "start": 242.386, "duration": 1.16}, {"text": "Okay, I know we might not all agree", "start": 243.946, "duration": 1.96}, {"text": "But here's another example.", "start": 245.915, "duration": 1.451}, {"text": "Kung Fu Panda 1, perfect movie. Any movie with anthropomorphic animals is always a win in my book.(wait does that mean he thinks that the sonic movies good?)", "start": 247.366, "duration": 5.569}, {"text": "I think we have a best-selling franchise on our panda paws. (aw)", "start": 252.936, "duration": 3.15}, {"text": "Kung Fu Panda 2 just as good as the original (True)", "start": 256.086, "duration": 2.339}, {"text": "How many sequels have an animated bird as a villain? (Probs a bunch)", "start": 258.906, "duration": 2.549}, {"text": "Besides Stuart Little 2.", "start": 262.095, "duration": 1.591}, {"text": "So far we got tens across the board, but then Kung Fu Panda 3 comes along and I'm sorry Jablonski", "start": 263.686, "duration": 6.079}, {"text": "I just wasn't feeling this one which is why I was so worried for How to Train Your Dragon 3.", "start": 269.765, "duration": 5.429}, {"text": "and let's just say the DreamWorks trequal paradox didn't break its trend ;-;", "start": 275.586, "duration": 3.42}, {"text": "However, there's one franchise that doesn't follow the DreamWorks Trequal Paradox™ and it haunts my dreams works .", "start": 279.046, "duration": 7.2}, {"text": "and that franchise is", "start": 286.426, "duration": 1.54}, {"text": "Madagascar. (OOOOH!!!!)", "start": 288.186, "duration": 1.24}, {"text": "I remember loving this movie as a kid and apparently I wasn't the only kid who enjoyed it because it made", "start": 289.426, "duration": 4.66}, {"text": "one hundred ninety three million five hundred and ninety five thousand five hundred and twenty one dollars ($193,595,521)", "start": 294.526, "duration": 3.47}, {"text": "So DreamWorks, made two more of these movies and created the thing that haunts my dreams. (MOTO MOTO D:)", "start": 298.426, "duration": 5.44}, {"text": "Now personally, I don't really care for these movies. They're fine. I haven't rewatched them at all.", "start": 303.986, "duration": 5.04}, {"text": "So, 5/10, but there's another movie in this franchise a movie that shouldn't be as good as it is", "start": 309.406, "duration": 6.68}, {"text": "And honestly, I'm a little embarrassed to admit that it might make the list of my top 5 favorite movies", "start": 316.086, "duration": 4.889}, {"text": "I don't think enough people are talking about this movie (SHOW US THE MOVIE)", "start": 320.975, "duration": 2.351}, {"text": "So I'm gonna be the one who breaks the ice that metaphor is relevant because we're talking about", "start": 323.346, "duration": 3.928}, {"text": "Penguins of Madagascar. (yeah!!)", "start": 327.274, "duration": 2.192}, {"text": "Penguins of Madagascar is the best movie that features Penguins ever.", "start": 329.706, "duration": 3.693}, {"text": "Better than Happy Feet and Happy Feet 2 and it's a thousand times more (They both suck anyway)", "start": 333.399, "duration": 3.747}, {"text": "realistic than march of the Penguins", "start": 337.386, "duration": 1.0}, {"text": "There's a scene where the Penguins fall off an airplane and", "start": 338.896, "duration": 1.25}, {"text": "go hopping from one airplane to another it's so entertaining (I bet it was a bunch of tea)", "start": 340.146, "duration": 4.109}, {"text": "And it's all done in one continuous camera shot", "start": 344.406, "duration": 2.6}, {"text": "So I'm not talking with a hint of irony when I say that this scene is a cinematic masterpiece 👌", "start": 347.006, "duration": 5.64}, {"text": "I don't remember when I first watched Penguins of Madagascar", "start": 352.666, "duration": 3.32}, {"text": "It came out when I was 18, so I'm probably not the target demographic, but I remember after watching it thinking", "start": 355.986, "duration": 5.369}, {"text": "wahw (My expression)", "start": 362.445, "duration": 1.41}, {"text": "That's a good movie and I didn't think about that movie again until years later on Halloween night", "start": 363.855, "duration": 4.571}, {"text": "2018 I was in a discord call with some friends who are also spending their", "start": 368.426, "duration": 2.533}, {"text": "Halloween night behind a computer.", "start": 370.959, "duration": 2.327}, {"text": "And naturally we were discussing which Madagascar sequel was better", "start": 373.295, "duration": 3.419}, {"text": "some people actually liked the second one, which was surprising and I said", "start": 376.746, "duration": 3.62}, {"text": "well", "start": 380.466, "duration": 0.5}, {"text": "No matter what you think of the sequels at least we can all agree that Penguins of Madagascar is better than both of them right?", "start": 380.966, "duration": 5.06}, {"text": "and everyone in the call was like (I DONT THINK NOT)", "start": 386.306, "duration": 1.9}, {"text": "What are you talking about?", "start": 388.266, "duration": 1.08}, {"text": "And instead of watching a scary movie that Halloween night,", "start": 389.346, "duration": 3.12}, {"text": "We all virtually watched a movie about penguins together, and I think everyone liked it", "start": 392.466, "duration": 4.26}, {"text": "Okay, let's talk about another studio. Pixar.", "start": 396.796, "duration": 3.01}, {"text": "Pixar movies do a good job at appealing to a wide audience", "start": 399.806, "duration": 3.04}, {"text": "Kids like them because there are cartoon and adults like them", "start": 402.966, "duration": 3.083}, {"text": "because of their heavy themes like old people dying", "start": 406.049, "duration": 2.577}, {"text": "almost every movie Pixar has made has been a cinematic classic", "start": 408.846, "duration": 3.58}, {"text": "Penguins of Madagascar however is not one of those emotionally inducing", "start": 412.846, "duration": 3.584}, {"text": "movies. It doesn't teach a thought-provoking life lesson", "start": 416.43, "duration": 2.826}, {"text": "It's an hour and a half of penguins fighting an octopus and (Because they are \"Super Penguins\"...?)", "start": 419.256, "duration": 3.345}, {"text": "I love it every morning when I watch Penguins of Madagascar", "start": 422.601, "duration": 3.345}, {"text": "I feel like a kid again. I am jealous of the writing in this movie (I didnt get to watch the movie fully)", "start": 425.946, "duration": 3.899}, {"text": "Okay, there's one fart joke, but that's my only complaint now do I think penguins is better than all of these Pixar movies?", "start": 429.886, "duration": 6.86}, {"text": "no, definitely not. but I do think this movie is really good,", "start": 437.286, "duration": 1.52}, {"text": "and IMDb gave it a 6.7 when it CLEARLY deserves a 10 (DEFINETLY A 10. or an 12)", "start": 438.806, "duration": 5.42}, {"text": "I don't know if this video convinced you to watch Penguins of Madagascar", "start": 444.506, "duration": 3.06}, {"text": "but if you're retroactively looking for the next summer blockbuster movie to watch", "start": 447.566, "duration": 2.4}, {"text": "then it's got my recommendation.", "start": 449.966, "duration": 2.68}, {"text": "\"James, Are you being sponsored by penguins?\"", "start": 452.826, "duration": 1.88}, {"text": "I wish. (I think he got Penguin MERCH)", "start": 455.286, "duration": 1.02}, {"text": "There wasn't really a point to this video. I just wanted an excuse to talk about my favorite DreamWorks spin-off.", "start": 456.306, "duration": 5.94}, {"text": "So in conclusion", "start": 462.246, "duration": 0.8}, {"text": "I'm really excited for The Dark Crystal 2 coming out on Netflix, (Cant u see it in theatres??)", "start": 463.306, "duration": 2.7}, {"text": "The show's being released on August 30th, which is coincidentally this channel's 5 year anniversary.", "start": 466.186, "duration": 5.94}, {"text": "So don't expect me to work that day.", "start": 472.606, "duration": 1.54}, {"text": "*COME ON AND SLAM*", "start": 474.386, "duration": 0.5}, {"text": "Okay, admittedly. This video went off the rails a tiny bit. I'm sorry. Hey, everyone (TALKING TO STRANGERS :D)", "start": 474.946, "duration": 6.34}, {"text": "I feel like I always say this, but I know it's been a while", "start": 481.295, "duration": 3.45}, {"text": "I did a lot of shows recently like Scribble Showdown, which you might have heard of. I'm going on tour in early, October", "start": 484.846, "duration": 7.429}, {"text": "So click the link in the description for more information,", "start": 492.276, "duration": 2.07}, {"text": "I know it's summer when I post this video, but I don't post that often", "start": 494.706, "duration": 3.929}, {"text": "So I probably won't get another chance to tell you that there's some back-to-school", "start": 498.636, "duration": 3.209}, {"text": "bundles in my merch store.(EXCUSE ME) (WE DON'T TAKE ABOUT SCHOOL IN THIS COMMUNITY, GROSS!!!!) If you're one of those people that go to school. Big thanks to everyone who worked on this video.", "start": 501.975, "duration": 5.75}, {"text": "I couldn't have done it without them and a big thanks to you.. for watching me gush about penguins for a really long time..", "start": 507.725, "duration": 7.05}, {"text": "I hope you don't think of me any differently knowing that I...", "start": 514.775, "duration": 3.411}, {"text": "dislike The Lion King 2 (HOW DaRe-) (I don't really care)", "start": 518.706, "duration": 2.0}, {"text": "I'm sorry. I'm really tired and I want to get this video done (THEN SLEEP NOW)", "start": 520.846, "duration": 3.06}, {"text": "So I'm just going to wrap up this end card.", "start": 524.406, "duration": 2.16}]