[{"text": "Dear Fellow Scholars, this is Two Minute Papers\nwith Károly Zsolnai-Fehér.", "start": 0.42, "duration": 4.28}, {"text": "Fluid simulation is a mature research field\nwithin computer graphics with amazing papers", "start": 4.7, "duration": 5.149}, {"text": "that show us how to simulate water flows with\nlots of debris, how to perform liquid-fabric", "start": 9.849, "duration": 6.931}, {"text": "interactions, and more.", "start": 16.78, "duration": 1.65}, {"text": "This new project further improves the quality\nof these works and shows us how thin, elastic", "start": 18.43, "duration": 6.34}, {"text": "strands interact with oil paint, mud, melted\nchocolate, and pasta sauce. There will be", "start": 24.77, "duration": 6.96}, {"text": "plenty of tasty and messy simulations ahead,\nnot necessarily in that order, so, make sure", "start": 31.73, "duration": 6.539}, {"text": "to hold on to your papers, just in case.", "start": 38.269, "duration": 2.93}, {"text": "Here you see four scenarios of these different\nmaterials dripping off of a thin strand. So,", "start": 41.199, "duration": 6.38}, {"text": "why are these cases difficult to simulate?", "start": 47.579, "duration": 3.14}, {"text": "The reason why it’s difficult, if not flat\nout impossible because the hair strands and", "start": 50.719, "duration": 5.191}, {"text": "the fluid layers are so thin, it would require\na simulation grid that is so microscopic,", "start": 55.91, "duration": 6.229}, {"text": "or in other words, we would have to perform\nour computations of quantities like pressure", "start": 62.139, "duration": 5.851}, {"text": "and velocity on so many grid points, it would\nprobably take not from hours to days, but", "start": 67.99, "duration": 6.1}, {"text": "from weeks to years to compute. I will show\nyou a table in a moment where you will see", "start": 74.09, "duration": 4.97}, {"text": "that these amazingly detailed simulations\ncan be done on a grid of surprisingly low", "start": 79.06, "duration": 5.25}, {"text": "resolution.", "start": 84.31, "duration": 1.44}, {"text": "As a result, our simulations also needn’t\nbe so tiny in scale with one hair strand and", "start": 85.75, "duration": 5.71}, {"text": "a few drops of mud or water. They can be done\non a much larger scale, so we can marvel together", "start": 91.46, "duration": 6.53}, {"text": "at these tasty and messy simulations, you\ndecide which is which. I particularly liked", "start": 97.99, "duration": 5.73}, {"text": "this animation with the oyster sauce because\nyou can also see a breakdown of the individual", "start": 103.72, "duration": 5.219}, {"text": "elements of the simulation. Note that all\nof the interactions between the noodles, the", "start": 108.939, "duration": 4.88}, {"text": "sauce, the fork, and plate have to be simulated\nwith precision. Love it.", "start": 113.819, "duration": 6.37}, {"text": "And now, the promised table. Here you can\nsee the delta x that means how fine the grid", "start": 120.189, "duration": 5.92}, {"text": "resolution is, which is in the order of centimeters,\nand not micrometers. That is reassuring, and", "start": 126.109, "duration": 7.001}, {"text": "don’t forget that this work is an extension\nto the Material Point Method, which is a hybrid", "start": 133.11, "duration": 5.13}, {"text": "simulation method that both uses grids and\nparticles. And, sure enough, you can see here", "start": 138.24, "duration": 7.329}, {"text": "that it simulates up to tens of millions of\nparticles as well, and the fact that the computation", "start": 145.569, "duration": 5.381}, {"text": "times are still only measured in a few minutes\nper frame is absolutely remarkable. Remember,", "start": 150.95, "duration": 6.67}, {"text": "the fact that we can simulate this at all\nis a miracle.", "start": 157.62, "duration": 3.75}, {"text": "Now, this was run on the processor, and a\npotential implementation on the graphics card", "start": 161.37, "duration": 5.119}, {"text": "could yield us significant speedups, so I\nreally hope something like this appears in", "start": 166.489, "duration": 4.881}, {"text": "the near future. Also, make sure to have a\nlook at the paper itself, which is outrageously", "start": 171.37, "duration": 5.42}, {"text": "well written. If you wish to see more from\nthis paper, make sure to follow us on Instagram,", "start": 176.79, "duration": 5.41}, {"text": "just search for Two Minute Papers there or\nclick the link in the description.", "start": 182.2, "duration": 4.48}, {"text": "Now, I am still working as a full-time research\nscientist at the Technical University of Vienna,", "start": 186.68, "duration": 5.75}, {"text": "and we train plenty of neural networks during\nour projects, which requires a lot of computational", "start": 192.43, "duration": 5.42}, {"text": "resources. Every time we have to spend our\ntime maintaining these machines, I wish we", "start": 197.85, "duration": 5.15}, {"text": "could use Linode. Linode is the world’s\nlargest independent cloud hosting and computing", "start": 203.0, "duration": 5.54}, {"text": "provider. If you feel inspired by these works\nand you wish to run your experiments or deploy", "start": 208.54, "duration": 5.589}, {"text": "your already existing works through a simple\nand reliable hosting service, make sure to", "start": 214.129, "duration": 5.101}, {"text": "join over 800,000 other happy customers and\nchoose Linode. To reserve your GPU instance", "start": 219.23, "duration": 6.64}, {"text": "and receive a $20 free credit, visit linode.com/papers or\nclick the link in the description and use", "start": 225.87, "duration": 7.959}, {"text": "the promo code “papers20” during signup.\nGive it a try today! Our thanks to Linode", "start": 233.829, "duration": 5.421}, {"text": "for supporting the series and helping us make\nbetter videos for you.", "start": 239.25, "duration": 4.18}, {"text": "Thanks for watching and for your generous\nsupport, and I'll see you next time!", "start": 243.43, "duration": 2.35}]