[{"text": "[learning with wren time!]", "start": 0.0, "duration": 0.5}, {"text": "I was doing some research the other day when I came across this image of a battleship. Just exploding. It's pretty gnarly photo", "start": 0.5, "duration": 5.53}, {"text": "I mean you can clearly see the blast wave hitting the water after staring at it a moment", "start": 6.029, "duration": 4.5}, {"text": "I realized I wasn't looking at an explosion hitting the ship. I was looking at the most absurdly oversized muzzle flash", "start": 10.53, "duration": 5.999}, {"text": "I'd ever seen. The ship was actually firing several massive guns all at the same time", "start": 16.529, "duration": 5.13}, {"text": "And that's when I realized that I know almost nothing about", "start": 21.939, "duration": 2.75}, {"text": "Battleships or naval warfare for that matter. All of these questions come to mind, like how big are the ships, how powerful are they?", "start": 25.06, "duration": 6.74}, {"text": "What kind of guns do they have?", "start": 31.8, "duration": 1.349}, {"text": "How do they float? And the more I research the more I discover just how impressive these vessels really are and the feat of engineering", "start": 33.149, "duration": 6.6}, {"text": "It takes to create them", "start": 39.75, "duration": 1.23}, {"text": "So when world of warships reached out to me asking if I would like to make a video I was like yes", "start": 40.98, "duration": 3.959}, {"text": "Please let me do it because I wanted to share some of the crazier things I've learned", "start": 45.16, "duration": 3.5}, {"text": "So sit back relax and come on this journey with me while we discover some cool fun facts about warships", "start": 48.66, "duration": 5.28}, {"text": "We're going places that we can't normally go", "start": 54.3, "duration": 2.12}, {"text": "First things first, why don't battleships just sink. They're these huge", "start": 60.579, "duration": 4.16}, {"text": "Amalgamations of metal and concrete that somehow float. How is this even possible?", "start": 65.619, "duration": 4.16}, {"text": "Well, something you might not realize that is actually really interesting about water is that it is heavy like", "start": 70.2, "duration": 4.62}, {"text": "really heavy. A 1 meter cube of it weighs a metric ton, or", "start": 75.61, "duration": 3.799}, {"text": "2,200 pounds", "start": 79.84, "duration": 0.93}, {"text": "this box of water weighs more than 16 people and that's just because water is super dense it weighs a lot. The whole idea of", "start": 80.77, "duration": 6.889}, {"text": "Floating is based on the fact that if something is lighter than water it stays on top of that water", "start": 87.79, "duration": 4.729}, {"text": "But boats and ships are heavier than water as evidenced by all the ships at the bottom of the ocean and yet there's somehow normally", "start": 92.56, "duration": 6.199}, {"text": "Floating on top the thing is though is that they are shaped in a way to displace water pushing it aside", "start": 98.759, "duration": 5.22}, {"text": "Replacing it with just empty air. And even though boats are heavy the water they push aside is heavier. And that's the entire idea", "start": 104.259, "duration": 6.29}, {"text": "They're pushing aside water that weighs more than them. That displaced water exerts an upward force on the boats keeping them afloat", "start": 110.549, "duration": 6.06}, {"text": "And that is called buoyancy and that's what keeps pretty much all boats afloat", "start": 116.61, "duration": 3.389}, {"text": "The crazy thing is that there's not really an upper limit to this concept", "start": 120.0, "duration": 3.08}, {"text": "You could have a boat the size of a city as long as it weighs less than the water it pushes aside. Our limits", "start": 123.08, "duration": 5.16}, {"text": "There are mostly with materials science and engineering, but it's certainly not for lack trying", "start": 128.25, "duration": 4.19}, {"text": "We've tried to make some very big boats. Aircraft carriers are some of the largest floating things in existence take the USS Enterprise", "start": 132.45, "duration": 7.05}, {"text": "For example, it was commissioned in the mid 23rd century by the Federation Starfleet to help explore", "start": 139.5, "duration": 4.86}, {"text": "Oh wait, that's no that's not right. Wrong Enterprise. Hold up back up the USS Enterprise", "start": 144.42, "duration": 4.529}, {"text": "Aircraft carrier, which is actually the eighth ship to carry that enterprise name was the first nuclear-powered aircraft carrier and served for over 50 years", "start": 149.59, "duration": 7.849}, {"text": "Aircraft carriers are massive because they're not only actual runways for airplanes", "start": 158.049, "duration": 3.68}, {"text": "But they're also home to thousands of sailors and dozens of aircrafts. Friggin floating aircraft hangar!", "start": 161.73, "duration": 5.46}, {"text": "The USS Enterprise in particular is the longest warship to have ever been created with a length of", "start": 167.19, "duration": 5.159}, {"text": "1123 feet. If stood vertically it would stand about a hundred feet taller than the u.s bank building in downtown Los Angeles that would make it taller than every single building in the entire state of", "start": 173.859, "duration": 10.55}, {"text": "California. Even in new york city it'd become the seventh largest", "start": 184.78, "duration": 2.869}, {"text": "Building and actually maybe blend in? You wouldn't be able to tell it's there.", "start": 187.78, "duration": 3.84}, {"text": "Okay Yeah, warships are big but let's bring it back to battleships for a moment. Remember that photo from the beginning of the video?", "start": 191.62, "duration": 5.238}, {"text": "Well, it turns out that that ship is the decommissioned USS Iowa, which is now a museum here in Long Beach", "start": 196.87, "duration": 5.809}, {"text": "That's actually really close to us. So obviously we had to go check it out. Look at these guns", "start": 202.68, "duration": 4.619}, {"text": "Oh my god, the most interesting thing about this ship in", "start": 207.299, "duration": 3.029}, {"text": "my opinion is the fact that it has three turrets each with three guns and each of those guns have bullets that are", "start": 210.329, "duration": 5.64}, {"text": "16 inches in diameter. This was also outfitted at one point to take on nuclear shells", "start": 216.099, "duration": 4.55}, {"text": "So imagine like a bullet that's also a nuclear bomb", "start": 220.65, "duration": 2.009}, {"text": "This is the biggest bullet barrel I've ever seen pull it parallel Bullet Bill", "start": 223.65, "duration": 4.61}, {"text": "I mean, obviously it's not the Paris gun shooting from other countries, but you know", "start": 228.26, "duration": 3.389}, {"text": "Fun fact this ship is about four feet longer than the Titanic", "start": 231.65, "duration": 3.029}, {"text": "This entire thing is the turret and this isn't even actually attached to the ship. It's just sitting here", "start": 234.96, "duration": 5.509}, {"text": "It's just like dropped in if this was the capsize it would fall out and sink", "start": 240.47, "duration": 3.6}, {"text": "These guns are so powerful that they've created this misconception that if you were to fire all nine of them sideways at the exact same", "start": 244.07, "duration": 5.759}, {"text": "Time that the ship wouldn't be able to handle it and it would just rock over upside-down", "start": 249.83, "duration": 3.24}, {"text": "but that doesn't happen because water is super heavy don't forget and then acts as a buffer so yeah the ship might move like maybe", "start": 253.2, "duration": 6.289}, {"text": "three to six feet sideways, but it's not gonna capsize not even close and", "start": 259.489, "duration": 3.72}, {"text": "These are 50 caliber guns meaning at the barrel length is 50 times longer than the diameter of the bullet that it fires in the", "start": 266.4, "duration": 6.47}, {"text": "Bullets. Oh my god. The bullets are massive. They're 16 inches in diameter 6 feet tall and weighs 2,700 pounds", "start": 272.87, "duration": 6.179}, {"text": "They weigh as much as Nick's car", "start": 279.06, "duration": 2.029}, {"text": "So every time this ship fires one of those boats is as if it's firing a Kia Soul. That's a lot of hamsters", "start": 281.09, "duration": 5.73}, {"text": "So as you can see", "start": 286.82, "duration": 0.9}, {"text": "We have six of these", "start": 287.72, "duration": 1.449}, {"text": "110 pound explosive bags and they're filled with just like this explosive propellant that all explodes at the same time firing this bullet", "start": 289.169, "duration": 6.62}, {"text": "It's super far but here's where my mind was truly blown away regarding these guns. Not only are the bullets themselves like", "start": 295.79, "duration": 6.149}, {"text": "Stupid heavy, but they can be fired really far the mark 8 gun turrets of this ship can actually fire projectiles", "start": 302.13, "duration": 6.41}, {"text": "24 miles away now 24 miles might not seem like all that far", "start": 309.27, "duration": 4.519}, {"text": "It's less distance than a marathon but that's still so far away. The ship can't even see the target. It's shooting it", "start": 313.79, "duration": 6.059}, {"text": "Let me show you what I mean", "start": 319.86, "duration": 1.52}, {"text": "So if you were to actually look out at the horizon while standing on the coast of the ocean", "start": 321.38, "duration": 3.57}, {"text": "You'd only be seeing about 3 miles before the curvature of the earth starts hiding everything behind it because you know the earth is round", "start": 325.04, "duration": 5.73}, {"text": "And we're actually standing about a hundred feet up on the water right now so we can even see further", "start": 330.77, "duration": 3.719}, {"text": "But even the rangefinder of the USS can only see about 16 miles. So anything beyond that is just hidden by the horizon", "start": 334.62, "duration": 6.95}, {"text": "Imagine this, you know JPL the Jet Propulsion lab in Pasadena. They're the ones responsible for putting, you know robotic Rovers on Mars", "start": 341.79, "duration": 6.44}, {"text": "Well, let's say that the Martians aren't too happy about us driving around on their turf and they decide to invade the JPL", "start": 348.5, "duration": 5.609}, {"text": "Facility in order to stop us.", "start": 354.34, "duration": 1.66}, {"text": "Theoretically to defend ourselves", "start": 356.0, "duration": 1.509}, {"text": "we could just dock the ship in Santa Monica and be within firing range of the mothership talk about defending earth with 1940s technology and", "start": 357.509, "duration": 7.83}, {"text": "fire!", "start": 365.77, "duration": 1.23}, {"text": "Now even though this round is flying at a crazy fast velocity at maximum range", "start": 367.0, "duration": 4.849}, {"text": "It still takes about a minute and a half to reach the target", "start": 371.849, "duration": 2.58}, {"text": "It has a time of flight of about 86 seconds", "start": 374.47, "duration": 3.109}, {"text": "And since I wanted to play this entire shot out in real time", "start": 377.58, "duration": 3.059}, {"text": "That actually gives me a moment to talk to you about world of warships Legends", "start": 380.86, "duration": 4.04}, {"text": "It is the latest version of the warships franchise built from the ground up with console gaming and mind", "start": 384.94, "duration": 5.599}, {"text": "I've personally been playing on the PlayStation 4, but you can play on xbox or PC as well", "start": 390.539, "duration": 3.779}, {"text": "Legends puts the power of history's greatest", "start": 394.78, "duration": 2.029}, {"text": "Warships into your hands allowing you to recruit legendary commanders in fight for naval supremacy with other players around the world", "start": 396.969, "duration": 6.89}, {"text": "The game has officially launched with more content achievements and ships than ever before including the infamous German battleship Tirpitz", "start": 404.02, "duration": 7.489}, {"text": "Which is now the most powerful ship in the game and only available for the next few weeks world of warships", "start": 411.509, "duration": 5.399}, {"text": "Legends is available to play right now for free and if you want to experience what it's like to fire all nine of these guns", "start": 417.129, "duration": 5.779}, {"text": "at the same time click the link in the description so you can start playing it today and", "start": 422.909, "duration": 3.69}, {"text": "Boom the Martians have now been taken out and earth has been saved again", "start": 427.569, "duration": 3.649}, {"text": "But you know what could have also taken out the Martian ships", "start": 431.56, "duration": 2.449}, {"text": "freakin guided cruise missiles, dude", "start": 434.62, "duration": 2.029}, {"text": "And that's actually why we don't see battleships anymore in any Navy they've become obsolete in today's modern world", "start": 436.65, "duration": 6.509}, {"text": "It's all about air superiority unless about direct naval engagements battleships like the USS", "start": 443.159, "duration": 5.04}, {"text": "Iowa were all about having thick armor and big guns", "start": 448.199, "duration": 2.7}, {"text": "But we're alternately too costly to operate", "start": 450.9, "duration": 2.04}, {"text": "Compared to smaller and faster cruisers that could launch missiles from a much longer range in spite of that", "start": 453.19, "duration": 4.969}, {"text": "However, battleships are still incredibly impressive feats of Engineering especially considering that the ship was built almost eighty years ago", "start": 458.16, "duration": 6.22}, {"text": "It stands as a testament to human ingenuity and gumption in a time where problems couldn't be solved by just simply googling the answer.", "start": 464.46, "duration": 6.42}]