[{"text": "In the beginning there was", "start": 0.06, "duration": 2.84}, {"text": "Teamspeak", "start": 4.06, "duration": 1.38}, {"text": "then came Ventrilo, Skype, mumble, and...", "start": 5.44, "duration": 3.829}, {"text": "Skipping over a bunch of platforms that no longer exist", "start": 9.9, "duration": 2.7}, {"text": "Discord", "start": 13.44, "duration": 1.26}, {"text": "So is discord legitimately better on top of being newer, or is it just another flash in the pan?", "start": 14.7, "duration": 7.74}, {"text": "Let's find out", "start": 23.2, "duration": 1.52}, {"text": "After I talk about today's video being brought to you by...", "start": 25.32, "duration": 3.34}, {"text": "Razer coms! Na...I'm just kidding", "start": 28.94, "duration": 2.32}, {"text": "Razor coms is gone. It's be quiet", "start": 31.78, "duration": 2.959}, {"text": "Their white dark base pro 900 features a modular design to support a variety of layouts and configurations. Check it out at the link below", "start": 34.74, "duration": 7.84}, {"text": "[Intro]", "start": 43.08, "duration": 8.06}, {"text": "We'll begin with a quick rundown of our competitors teamspeak and mumble are both", "start": 51.3, "duration": 4.82}, {"text": "What are called self hosted voice and chat platforms both of them require server software", "start": 56.12, "duration": 6.14}, {"text": "either running on your desktop or a rented server in a data center somewhere and", "start": 62.34, "duration": 4.96}, {"text": "Both require you to be actively connected to receive messages", "start": 67.54, "duration": 4.2}, {"text": "Skype and discord by contrast are hosted by Microsoft and", "start": 72.28, "duration": 4.129}, {"text": "Discord respectively both of them allow you to send messages to friends who are offline", "start": 76.78, "duration": 4.58}, {"text": "They'll just be delivered later and both offer video chat in addition to voice", "start": 81.6, "duration": 4.739}, {"text": "They are structured a little differently though discord is more like a social network", "start": 86.86, "duration": 5.089}, {"text": "So you can join an existing community or make your own?", "start": 91.95, "duration": 3.0}, {"text": "while Skype", "start": 95.31, "duration": 1.21}, {"text": "operates more like your address book so like your phone you start a conversation by scrolling through your contacts list and", "start": 96.52, "duration": 7.129}, {"text": "Selecting one or more of them, okay, so now let's talk design a usability both teamspeak and mumble share a theme. That's", "start": 104.02, "duration": 7.22}, {"text": "reminiscent of the beige PC cases of", "start": 111.909, "duration": 2.9}, {"text": "Decades past though you can skin them well discord and Skype are much more modern", "start": 115.78, "duration": 5.839}, {"text": "This is an aesthetic advantage", "start": 121.78, "duration": 2.0}, {"text": "But it should be noted that while Skype does have a more conventional", "start": 123.78, "duration": 3.72}, {"text": "Desktop app the Windows Store version that Microsoft is pushing users towards", "start": 127.69, "duration": 4.61}, {"text": "Has generated many complaints about it actually being too simplistic to the point where it makes it confusing to use", "start": 132.73, "duration": 6.83}, {"text": "adding contacts for instance is done through the", "start": 140.05, "duration": 2.75}, {"text": "Search Skype box rather than intuitively by clicking on the plus button so do yourself a favor and don't use the Windows Store version", "start": 143.349, "duration": 7.76}, {"text": "Discord's design on the other hand is both beautiful and functional", "start": 151.45, "duration": 3.619}, {"text": "every server that you are a part of is displayed in the left tab along with of course your direct messages and", "start": 155.65, "duration": 5.21}, {"text": "My main gripe with discord is just the lack of", "start": 161.5, "duration": 2.959}, {"text": "Joint voice and text channels has it's kind of jarring every time your friend says yo check out this link and you have to ask", "start": 164.8, "duration": 6.559}, {"text": "Which channel. To their credit though, they finally added channel categories which is great.", "start": 171.36, "duration": 5.039}, {"text": "But all this ignores a huge factor so far: cost.", "start": 177.129, "duration": 3.83}, {"text": "Teamspeak has a number of paid licensing options, and if you don't buy one of them you are capped to 32 slots", "start": 181.79, "duration": 7.529}, {"text": "mumble on the other hand is open-source and", "start": 189.959, "duration": 2.479}, {"text": "completely free with no slot limitations", "start": 193.049, "duration": 2.87}, {"text": "Skype is free for up to 25 simultaneous users over the Internet", "start": 196.469, "duration": 4.13}, {"text": "And if you want to call conventional phones allows you to pay for a subscription or a la carte for that service and Discord", "start": 200.599, "duration": 7.47}, {"text": "seems to be taking the", "start": 208.29, "duration": 2.0}, {"text": "Silicon Valley", "start": 210.569, "duration": 1.411}, {"text": "Social network startup approach their core service is free for as many people as you want and according to them", "start": 211.98, "duration": 7.279}, {"text": "That's how it's gonna stay though", "start": 219.45, "duration": 2.029}, {"text": "We'll see how that goes after the insert multinational here acquisition", "start": 222.0, "duration": 4.459}, {"text": "Anywho, let's get to what matters most for gamers. How do they all sound?", "start": 227.4, "duration": 5.989}, {"text": "To answer this question for you guys once and for all Jake used three common microphones a blue Yeti to represent the higher", "start": 233.909, "duration": 7.43}, {"text": "End a pair of HyperX cloud twos to be a typical headset and a mod mic five", "start": 241.34, "duration": 5.609}, {"text": "Because it was on his desk at the time", "start": 247.349, "duration": 2.0}, {"text": "Each test clip was played through a host computer and then recorded on the other end", "start": 249.359, "duration": 4.22}, {"text": "This is a test recording on the blue Yeti. Every quality setting was cranked to the max", "start": 253.59, "duration": 5.089}, {"text": "And we turned off both echo and noise suppression", "start": 258.68, "duration": 3.269}, {"text": "YouTube's audio compression though may make it challenging for you guys to hear the differences, so if you're interested in the raw clips", "start": 262.919, "duration": 6.86}, {"text": "We'll have them available for download in the description", "start": 270.02, "duration": 2.0}, {"text": "We'll start with the Yeti when discord is working well more on that a little later", "start": 272.76, "duration": 5.329}, {"text": "It's basically indistinguishable from teamspeak", "start": 278.18, "duration": 2.79}, {"text": "This is a test recording on the blue Yeti blackout Edition", "start": 281.31, "duration": 3.919}, {"text": "While both mumble and Skype have a higher noise floor, but you'll notice if you listen very closely", "start": 285.57, "duration": 5.869}, {"text": "This is a test recording on the blue Yeti blackout Edition", "start": 292.08, "duration": 3.95}, {"text": "Switching over to the cloud twos", "start": 296.55, "duration": 1.799}, {"text": "We can hear that the gap between teamspeak and discord compared to mumble and Skype is more noticeable with", "start": 298.349, "duration": 6.89}, {"text": "Lesser source audio. This is a test recording with the HyperX cloud 2 gaming headset", "start": 305.699, "duration": 5.99}, {"text": "This is a test recording with the HyperX to gaming headset", "start": 311.849, "duration": 4.22}, {"text": "So mumble has a muddier sound to it while Skype maintains its background hiss", "start": 316.07, "duration": 4.619}, {"text": "This is a test recording with the HyperX cloud 2 gaming headset, then the story completely chaste", "start": 321.21, "duration": 7.309}, {"text": "Stays the same actually with the mod mic teamspeak and discord are very clear while mumble and Skype are slightly worse", "start": 329.07, "duration": 7.279}, {"text": "So okay, it seems like you can't really go wrong with teamspeak or discord as long as that one's working", "start": 336.81, "duration": 6.049}, {"text": "Let's talk about that as a regular user our writer jake has noticed a pattern of degraded or", "start": 343.229, "duration": 6.32}, {"text": "robot e voice quality on discord", "start": 350.22, "duration": 2.569}, {"text": "it's hard to say if it's load related or", "start": 353.22, "duration": 3.169}, {"text": "completely random without a much larger sample size", "start": 356.58, "duration": 3.019}, {"text": "And it can usually be fixed by temporarily changing the region of your server", "start": 359.599, "duration": 4.8}, {"text": "But it's one of those things that happens often enough that it is worth mentioning", "start": 364.74, "duration": 4.549}, {"text": "Let's move on to admin control. This varies", "start": 369.81, "duration": 2.929}, {"text": "wildly across all four platforms", "start": 373.38, "duration": 2.029}, {"text": "Skype groups are", "start": 376.229, "duration": 1.651}, {"text": "Basically limited to kickin and banning while mumble teamspeak and discord offer", "start": 377.88, "duration": 5.779}, {"text": "fully fledged rank and permission systems", "start": 383.94, "duration": 2.63}, {"text": "teamspeak", "start": 387.27, "duration": 1.11}, {"text": "Definitely takes the cake for having the deepest customized ability", "start": 388.38, "duration": 3.919}, {"text": "But it does come at the cost of the time required to set up and learn the system", "start": 392.31, "duration": 5.209}, {"text": "Discord on the other hand is much easier, and there isn't much that you can't do with it so for most people", "start": 398.159, "duration": 5.54}, {"text": "It's probably the way to go here, but", "start": 403.699, "duration": 2.55}, {"text": "Security is another big consideration because teamspeak and mumble are self hosted and can be", "start": 407.07, "duration": 7.309}, {"text": "Encrypted all the data on your server is yours and no other party can access it without your permission", "start": 415.02, "duration": 7.61}, {"text": "discord and Skype on the other hand both connected to their servers and", "start": 423.599, "duration": 4.49}, {"text": "While discord says they don't sell your information", "start": 428.729, "duration": 2.84}, {"text": "according to their privacy policy they can", "start": 432.389, "duration": 2.33}, {"text": "Share it with related companies, so that's just something to keep in mind", "start": 435.27, "duration": 4.489}, {"text": "Skype of course is a similar story and ARS technica reported that Microsoft may be snooping for", "start": 440.31, "duration": 6.32}, {"text": "Example the URLs the you send in chat on to overlays another feature not to be over looked", "start": 446.82, "duration": 6.109}, {"text": "Teamspeak has an excellent in-game overlay supplied by overwolf that gives you access to an easily repositional basically fully", "start": 453.69, "duration": 7.789}, {"text": "functional teamspeak window while in-game", "start": 461.669, "duration": 2.39}, {"text": "Mumble is much more limited by contrast, but at least does show you which users are talking in your channel", "start": 464.97, "duration": 7.129}, {"text": "discord shows you who's talking and allows you to switch channels or servers on-the-fly and", "start": 472.949, "duration": 5.27}, {"text": "Also, has some great integration with twitch so you can auto sync subscribers, and even show who's talking on stream talking talking talking", "start": 478.5, "duration": 7.94}, {"text": "Leaving us then to the final answer. What is the best voice platform out there?", "start": 487.71, "duration": 5.51}, {"text": "Well in terms of pure sound quality. It's hard to compete with team speak's", "start": 493.82, "duration": 5.0}, {"text": "reliable clarity but", "start": 499.0, "duration": 2.28}, {"text": "Discord sounds just as good most of the time", "start": 501.72, "duration": 2.5}, {"text": "And I think our poll response numbers indicates what our viewers think of its excellent chat system and community building features", "start": 504.27, "duration": 7.879}, {"text": "If you're looking for an open source solution with top-notch security though mumble is probably the way to go and as for skype", "start": 512.399, "duration": 7.76}, {"text": "well", "start": 520.68, "duration": 1.08}, {"text": "At least the IP address resolving nonsense is finally fixed and it's blue so if you like the color blue", "start": 521.76, "duration": 7.639}, {"text": "Then you should probably also still use one of the other things we talked about", "start": 530.13, "duration": 3.32}, {"text": "Speaking of using other things why not use fresh books instead of be complicated", "start": 534.48, "duration": 5.15}, {"text": "Accounting software that you're already using fresh books is cloud-based, so you've got access to it from anywhere", "start": 540.029, "duration": 6.32}, {"text": "Whether it's your desktop or even their fully featured mobile app and it has tons of great features", "start": 546.35, "duration": 6.179}, {"text": "You can create and send professional-looking invoices in less than 30 seconds you can set up online", "start": 552.81, "duration": 4.849}, {"text": "payments with just a couple of clicks you can see when your client has seen your invoice putting an end to the guessing games and", "start": 557.79, "duration": 5.929}, {"text": "Their tech support is freaking awesome. You call them someone picks up, and you actually just talked to a person no phone tree", "start": 564.45, "duration": 6.199}, {"text": "No", "start": 570.649, "duration": 0.481}, {"text": "nothing", "start": 571.13, "duration": 0.61}, {"text": "so try it out for 30 days for free by going over to FreshBooks.com/techtips and", "start": 571.74, "duration": 4.91}, {"text": "Entering Linus tech tips into how you heard about us section", "start": 576.81, "duration": 3.26}, {"text": "So thanks for watching guys that this video sucked", "start": 581.1, "duration": 2.089}, {"text": "You know what to do?", "start": 583.19, "duration": 0.63}, {"text": "But it was awesome get subscribed hit that like button or check out where to buy the stuff", "start": 583.82, "duration": 4.11}, {"text": "We featured at the link in the video description", "start": 587.93, "duration": 2.0}, {"text": "Also down there is the link to our merch store which has cool shirts like this one as well as our community forum", "start": 590.22, "duration": 4.669}, {"text": "Which you should totally join.", "start": 594.89, "duration": 2.0}]