[{"text": "Gimbals not very interesting things, right? But the thing with DGI gimbals is that they make it a lot more user friendly.", "start": 0.069, "duration": 6.74}, {"text": "Easy to use rather than this thing for geeks, but now they've got a new one, which is not so geeky at all.", "start": 7.33, "duration": 6.95}, {"text": "It's the Ronin SC here. It is boom", "start": 14.309, "duration": 3.0}, {"text": "So just like the bonus if it was like bonus", "start": 22.21, "duration": 3.17}, {"text": "But a little bit smaller and a little bit lighter the Ronin this was a beast of a thing", "start": 25.38, "duration": 5.13}, {"text": "Just before we carry on video", "start": 31.899, "duration": 1.581}, {"text": "I'm super happy to give a quick shout out to sponsor for this video", "start": 33.48, "duration": 2.88}, {"text": "North VPN because it's the VPN service that only go through with military-grade encryption superfast servers in over 61 countries and", "start": 36.51, "duration": 6.42}, {"text": "24/7 customer service Plus that says 75 cent discount for three years plus one month free by clicking using the code", "start": 43.21, "duration": 6.979}, {"text": "Ok, so what's new apart from the fact that it's light", "start": 50.59, "duration": 2.959}, {"text": "well", "start": 53.89, "duration": 0.5}, {"text": "Not light like a balloon but lighter now one of the things I hate absolutely hate is balancing a gimbal", "start": 54.39, "duration": 7.799}, {"text": "My balancing gimbal", "start": 63.939, "duration": 2.0}, {"text": "Procedure usually involves giving it to somebody else one thing it definitely is it's easier to set up", "start": 66.31, "duration": 5.959}, {"text": "Okay", "start": 73.15, "duration": 1.23}, {"text": "This is this is a this is a new thing", "start": 74.38, "duration": 2.0}, {"text": "So you can it's like a little guide for where you put your camera so you can remember it next time oh", "start": 78.1, "duration": 7.159}, {"text": "This is a new", "start": 86.049, "duration": 1.68}, {"text": "you got", "start": 87.729, "duration": 1.411}, {"text": "actual mechanical locks", "start": 89.14, "duration": 2.0}, {"text": "for locking each", "start": 91.329, "duration": 2.0}, {"text": "Axis, it just literally locks it in place", "start": 94.329, "duration": 3.68}, {"text": "That's presumably when you you're storing away in your backpack or whatever. It doesn't", "start": 99.22, "duration": 4.129}, {"text": "Do that", "start": 104.409, "duration": 1.771}, {"text": "That's potentially how it gets damaged. Oh, here's the other one. Here's another unlock. Ok, there. We are know", "start": 106.18, "duration": 5.629}, {"text": "We can balance a thing", "start": 112.63, "duration": 2.0}, {"text": "Usually if you're carrying a gimbal belt with a camera attached he'll probably flap and flop about kind of annoying with the locks", "start": 115.54, "duration": 6.949}, {"text": "He'll stop it swinging about all over the place", "start": 122.49, "duration": 2.22}, {"text": "but it's not just for the sake of transporting it but it's incredibly useful for balancing it -", "start": 124.71, "duration": 5.519}, {"text": "Okay, let's get cracking over this gimbal balancing mast class done by somebody who wouldn't call himself a master that you can call me master", "start": 130.989, "duration": 6.37}, {"text": "If you want to I'm not really testing them and all that stuff, but call me master if you like", "start": 137.36, "duration": 3.66}, {"text": "First of all, I've got put battery and I've got to take this off why because my on/off switch fell off the judge five", "start": 141.29, "duration": 7.65}, {"text": "Yeah, the problem with my jh5 is that it's always on look you can see the switch black off switch", "start": 150.209, "duration": 7.309}, {"text": "See it should be here", "start": 159.06, "duration": 2.33}, {"text": "Okay, let's put the battery in hopefully you won't be needing a solution to a broken on-and-off switch like me to start off make sure", "start": 163.44, "duration": 7.879}, {"text": "All the accesses are locked. So you've got your locks on each axis here", "start": 171.319, "duration": 4.68}, {"text": "Let's first unlock this one and sort the tilt it wrong. Is it balanced? I don't think so", "start": 176.25, "duration": 5.599}, {"text": "So ideally you want it facing up like that pointing to the sky and it doesn't I've leaned forwards or go all the way back", "start": 182.06, "duration": 6.899}, {"text": "That that's all over the shop. So let's get that sorted first of all and tighten this bit and keep adjusting it bit by bit", "start": 189.36, "duration": 7.309}, {"text": "You know something line up. Yeah", "start": 197.239, "duration": 2.0}, {"text": "Now this is the second part tilted to 45 degrees. No, you don't want that right now. We adjust this plate here", "start": 200.04, "duration": 7.13}, {"text": "The mounting plate not you did a play obviously", "start": 207.9, "duration": 3.32}, {"text": "It's done lift up at 45 degree angle and it should just stay there now that's done we lock that in place", "start": 214.44, "duration": 5.839}, {"text": "Next bit is the wrong axis. And we unlock that. Sometimes I find when you're making those micro adjustments", "start": 220.68, "duration": 6.74}, {"text": "You're pushing it just hard enough to push it 1 millimeter", "start": 228.209, "duration": 3.86}, {"text": "It's like when you're trying to let out a fart and you're trying to make it as silent as possible", "start": 234.03, "duration": 4.16}, {"text": "But like with this sometimes you just go too far and", "start": 239.79, "duration": 3.08}, {"text": "You end up shooting yourself, so I don't know what I'm talking about. Okay anyway", "start": 243.66, "duration": 3.739}, {"text": "You make the same noises Oh too far shit my pants. Okay. I think that's about right Oh", "start": 249.63, "duration": 6.259}, {"text": "Too much, so now you end up speaking English so much", "start": 257.579, "duration": 4.49}, {"text": "Come to much", "start": 264.06, "duration": 2.0}, {"text": "Okay", "start": 267.1, "duration": 2.0}, {"text": "There are row axis sorted now we can lock that in place", "start": 269.139, "duration": 3.5}, {"text": "Last but not least. It's the pan pan the pan pan tin pan. Okay, that's not too bad already", "start": 273.79, "duration": 5.599}, {"text": "So let's suggest that", "start": 280.3, "duration": 2.0}, {"text": "All right, I saw it lock that in place ready to go I mean balancing a gimbal", "start": 284.23, "duration": 6.079}, {"text": "In a matter again. Well, it's still chore", "start": 290.919, "duration": 2.15}, {"text": "but the fact is when you lock the other two axes, it doesn't zoom that it's not too confusing right the Ronin s", "start": 293.919, "duration": 7.79}, {"text": "Was some pretty heavy-duty stuff. I put c300 on that thing and it still managed to hold that weight", "start": 302.62, "duration": 6.649}, {"text": "this is", "start": 309.97, "duration": 1.38}, {"text": "Kind of a lot more useful well because it's smaller and lighter", "start": 311.35, "duration": 4.069}, {"text": "Of course the payload the amount of weight it can handle is less 2 kilograms", "start": 315.58, "duration": 5.24}, {"text": "Which is good for mirrorless shooters, probably even DSLR shooters", "start": 320.919, "duration": 3.89}, {"text": "Iligan amma CLE it feels good to grip in the hand or two if you need it's got a nice fat grip but not too", "start": 332.8, "duration": 6.2}, {"text": "Fat and it's nice and comfortable to hold for stabilizing stuff once balanced. It provides order smooth gliding goodness", "start": 339.0, "duration": 6.779}, {"text": "There's bigger Broder's you can literally make any random subject look glorious", "start": 345.78, "duration": 5.13}, {"text": "And for those who love the free 16 volt feature in the S", "start": 350.91, "duration": 3.0}, {"text": "You have it in the SC two you just simply select the option in the app. It's that easy to do", "start": 353.91, "duration": 6.389}, {"text": "How big a phone can have fit well can fit my iPhone 10 and", "start": 370.72, "duration": 4.76}, {"text": "the space for a smidgen smidgen bigger", "start": 376.12, "duration": 3.32}, {"text": "alright", "start": 380.11, "duration": 1.29}, {"text": "and that I mean", "start": 381.4, "duration": 1.37}, {"text": "What is the point it's not just for playing fruit ninja on the go while you're doing your gimbal action it is for", "start": 382.77, "duration": 5.91}, {"text": "The app the app is really what sets this apart from other gimbals. It has some neat tricks with the apps and these two", "start": 389.56, "duration": 7.7}, {"text": "Neatest tricks it has a work you press the trigger to start the act trek", "start": 397.99, "duration": 4.399}, {"text": "All on", "start": 405.1, "duration": 2.0}, {"text": "There we go", "start": 408.74, "duration": 2.0}, {"text": "That's pretty good that's really smart stuff", "start": 417.6, "duration": 2.69}, {"text": "So that's really useful for people who don't have anybody else to shoot to make it little bit more dynamic, you know", "start": 421.53, "duration": 5.119}, {"text": "You can walk about caravans follows you around", "start": 426.65, "duration": 2.429}, {"text": "Brilliant, that's how it takes stuff. But of course you were lying on the phone camera so that all depends on your focal length", "start": 429.66, "duration": 7.79}, {"text": "I mean if you've got anything tighter than this, you might be out the frames because the phone is about 28 millimeters", "start": 437.45, "duration": 6.059}, {"text": "but luckily I've got a 28 millimeter quiff on the a", "start": 443.51, "duration": 2.339}, {"text": "6400 so it should be roughly the same field of view as you see on the phone", "start": 446.25, "duration": 3.979}, {"text": "This is one of those great features that you see in their drones and also dot Osmo pocket Devonian", "start": 451.169, "duration": 5.75}, {"text": "Se is like a giant Osmo pocket really without the camera", "start": 456.919, "duration": 4.23}, {"text": "It does do a neat job of tracking subjects, although sometimes if the subject moves fast enough it might lose track", "start": 461.15, "duration": 6.3}, {"text": "Stop following me", "start": 469.889, "duration": 2.0}, {"text": "Okay, that's the trigger. Does that stop following me? Okay, there we are done. All right", "start": 471.93, "duration": 4.339}, {"text": "Now this bit is a little bit fun as well. This is force mobile. Let's switch that on", "start": 476.27, "duration": 4.23}, {"text": "That's going crazy", "start": 481.38, "duration": 2.0}, {"text": "That's going nuts", "start": 483.6, "duration": 2.0}, {"text": "That's a little bit too forceful. You can actually change it here", "start": 485.669, "duration": 3.83}, {"text": "Let's slew that down a bit mostly it works quite well. Sometimes it kind of loses track of your movement", "start": 490.26, "duration": 7.699}, {"text": "like", "start": 499.08, "duration": 1.98}, {"text": "This what do you think that you like it?", "start": 501.06, "duration": 2.33}, {"text": "SC is the lighter brother today. Yes, so it loses out on some things", "start": 506.91, "duration": 4.549}, {"text": "you could adjust the Rolexes on the s more the S has a bigger mounting plate - and", "start": 511.589, "duration": 5.75}, {"text": "Payload for the Rouen SC is cool because it focus on the user experience and that's how it should", "start": 517.589, "duration": 5.42}, {"text": "Be the SC will probably a trek on cosmic walk owners who want to take things further", "start": 523.11, "duration": 5.42}, {"text": "But also s owners who are tired of carrying all that weight", "start": 528.69, "duration": 3.919}, {"text": "It's light in weight, but heavy weight in features", "start": 533.16, "duration": 3.679}, {"text": "Ok one last shout out to non VPN for sponsoring this video type in Nord VPN comm slash coin W and use the code kinda", "start": 538.98, "duration": 5.929}, {"text": "Be for a special promo many years ago. I started off using VPNs meaning to watch region lock content", "start": 544.91, "duration": 4.83}, {"text": "But now I'm because I'm off to using the in certain public places like Intel lobbies and often they're not secured connections", "start": 549.74, "duration": 6.78}, {"text": "Normal VPN secures in seconds and provides extra anonymity with double data encryption", "start": 556.89, "duration": 5.03}, {"text": "There's no data logging also because it's registered and Panama. It's not just for the computer", "start": 562.11, "duration": 6.11}, {"text": "You can get the iOS and Android apps also with thousands of servers in over 61 countries. You can view region restricted content", "start": 568.22, "duration": 6.479}, {"text": "Which also works in China and Middle Eastern countries, and you can have up to six?", "start": 574.7, "duration": 4.109}, {"text": "Simultaneous connections and well, it's risk free 30 day money-back guarantee", "start": 579.39, "duration": 4.849}, {"text": "So here's the off again 75 cent discount for three years plus one month free by clicking and using the code right here", "start": 584.43, "duration": 6.619}, {"text": "Thanks for watching. See ya", "start": 591.42, "duration": 2.0}, {"text": "This is mike kemper the action going on here some nice cock shots", "start": 594.18, "duration": 4.1}]