[{"text": "This episode was sponsored by Skillshare", "start": 0.039, "duration": 2.181}, {"text": "[BLING]", "start": 3.1, "duration": 0.6}, {"text": "[bing]", "start": 5.0, "duration": 0.5}, {"text": "One of the most controversial balance updates the devs have ever introduced was patch 1.3.1", "start": 29.62, "duration": 5.9}, {"text": "the update which banned and nerfed the vast majority of dinosaurs marine reptiles and pterosaurs", "start": 35.52, "duration": 5.4}, {"text": "And so it should come as no surprise that one of the requests that the devs get the most is to reintroduce Dinosaurs back into the game", "start": 41.58, "duration": 7.26}, {"text": "the devs have never unbanned any classes before", "start": 48.84, "duration": 2.96}, {"text": "But what would the meta look like if the devs actually obliged and allowed players to spawn as dinosaurs again?", "start": 51.8, "duration": 6.52}, {"text": "Well to answer that question. We first need to understand why dinosaurs were banned in the first place", "start": 58.32, "duration": 4.92}, {"text": "and believe it or not, I was actually given the opportunity to ask one of the devs this very question", "start": 63.24, "duration": 4.98}, {"text": "So a lot of people have been wondering: why were the dinosaurs banned?", "start": 68.22, "duration": 3.18}, {"text": "uh you know I get this question a lot because the dinosaur class was one of the most popular in the history of the game and", "start": 72.28, "duration": 6.199}, {"text": "we definitely got a lot of pushback when you released the first extinction pack,", "start": 78.48, "duration": 4.08}, {"text": "but to be honest the meta was just getting stale", "start": 82.56, "duration": 2.7}, {"text": "Especially players opting to play larger and larger land carnivores like the t-rex", "start": 85.36, "duration": 4.58}, {"text": "Like one balanced update, we tried to buff herbivores by putting two additional horns on the Uniceratops", "start": 89.98, "duration": 5.64}, {"text": "But of course the t-rex players just specced into higher attack", "start": 95.68, "duration": 3.05}, {"text": "Then one time we even tried to nerf the rage ability of the T-Rex players by increasing the frequency they want to engage in sexual behavior,", "start": 98.88, "duration": 7.18}, {"text": "but then players thought it would be funny to shorten their arms", "start": 106.06, "duration": 2.56}, {"text": "So eventually we figured it's not worth dealing with all these complications and we should just go for the hard reset", "start": 108.62, "duration": 5.46}, {"text": "lower the oxygen levels to limit the size wars of different classes and encourage more nuanced skill trees", "start": 114.08, "duration": 5.74}, {"text": "and while we are seriously considering a dinosaur remaster due to popular demand,", "start": 120.28, "duration": 4.76}, {"text": "To be honest, even now if you look at most character model, they're just shrunk down reskinned dinosaurs we put fur on so you couldn't tell", "start": 125.04, "duration": 7.7}, {"text": "Thanks so much. I really appreciate you taking the time to comment on this matter", "start": 133.56, "duration": 3.04}, {"text": "Okay, so what would it look like if dinosaurs were unbanned?", "start": 137.28, "duration": 2.84}, {"text": "First let's talk about dinosaurs in general", "start": 140.3, "duration": 2.0}, {"text": "The dinosaur builds main advantage is its massive size.", "start": 142.32, "duration": 3.28}, {"text": "At fully-grown, the only things that could take it down were other giant dinosaurs and potentially pack hunting builds", "start": 145.6, "duration": 5.2}, {"text": "While size is an advantage on defense, it can be a challenge for overall survivability", "start": 150.82, "duration": 5.16}, {"text": "Dinosaurs require a massive amount of food potentially more than the current game could provide", "start": 155.98, "duration": 4.38}, {"text": "And so if the devs were to unban dinosaurs", "start": 160.72, "duration": 2.28}, {"text": "They'd likely also need to buff the spawn rates of pretty much everything", "start": 163.0, "duration": 3.52}, {"text": "Your average dinosaur build also tends to be pretty modest when it comes to speed and intelligence", "start": 166.52, "duration": 4.22}, {"text": "having speed comparable to an elephant and intelligence comparable to crocodiles", "start": 170.74, "duration": 4.66}, {"text": "This means that most of the current top tiers will out speed and outsmart them on a regular basis", "start": 175.4, "duration": 4.4}, {"text": "YOINK!", "start": 179.8, "duration": 0.92}, {"text": "But this isn't the case for all dinosaurs. So let's get into specifics now.", "start": 180.72, "duration": 3.36}, {"text": "Let's start with the herbivores", "start": 184.08, "duration": 1.8}, {"text": "So I don't think hadrosaurs would be very viable at all seeing as they have no good defensive abilities to protect themselves with.", "start": 185.88, "duration": 6.12}, {"text": "Their best trait is that they can communicate effectively and keep watch over each other", "start": 192.0, "duration": 4.48}, {"text": "But the best hunters today rely on stealth, a strategy specifically meant to get around his problem.", "start": 196.48, "duration": 5.48}, {"text": "Hadrosaurs would be great at spotting tall carnivore players from far away", "start": 202.64, "duration": 3.5}, {"text": "But not stealthy builds that stayed low to the ground and move through the bush", "start": 206.14, "duration": 3.64}, {"text": "Now, you might be thinking", "start": 209.78, "duration": 1.32}, {"text": "\"Oh, that's no problem, the herbivores could just outrun them\"", "start": 211.1, "duration": 2.48}, {"text": "But large herbivores had much lower mobility than today's top predator builds", "start": 213.58, "duration": 4.2}, {"text": "They'd be most comparable to an elephant like I said before", "start": 218.06, "duration": 3.16}, {"text": "but where elephants lack in mobility they make up for with intelligence", "start": 221.22, "duration": 3.82}, {"text": "You can't say the same for dinosaurs", "start": 225.04, "duration": 1.72}, {"text": "But not all herbivores would be in such a bad position", "start": 227.18, "duration": 2.68}, {"text": "Hadrosaurs lack any form of weaponry but other herbivores are much more well armed.", "start": 230.22, "duration": 3.82}, {"text": "Triceratops is perhaps the most well known armed herbivore and it's easy to see why.", "start": 234.92, "duration": 5.0}, {"text": "At full speed, a triceratops could one-shot even the tankiest of opponents.", "start": 239.92, "duration": 3.66}, {"text": "But with that said, the carnivore playerbase has gotten much better at dealing with front facing weapons like horns and tusks.", "start": 243.8, "duration": 6.16}, {"text": "So Triceratops may find itself struggling to fend off attacks that come from behind or come from multiple angles.", "start": 249.96, "duration": 5.26}, {"text": "Getting behind an opponent has become a staple trick of every carnivore's playbook", "start": 255.81, "duration": 3.559}, {"text": "Especially for canine and feline builds", "start": 259.65, "duration": 2.0}, {"text": "Sauropods were at an interesting place in the meta back during the Mesozoic and would definitely still be if they were brought back today.", "start": 262.08, "duration": 5.68}, {"text": "Their late game stats were simply impossible to beat one-on-one. No other land build has ever achieved even close to the same base stat total.", "start": 268.4, "duration": 7.82}, {"text": "Even the top predators of the time barely stood a chance even in teams.", "start": 276.34, "duration": 3.48}, {"text": "But they only reached this potential in the late game and have relatively few defensive options during early and mid game aside from just relying on high-level teammates.", "start": 280.04, "duration": 8.16}, {"text": "This means that their teammates need to be able to stop an attack before it's too late.", "start": 288.2, "duration": 3.8}, {"text": "Because of their extreme height, predators would just about never be able to sneak up on a sauropod clan in open field.", "start": 292.0, "duration": 5.7}, {"text": "But approaching using stealth isn't the only way to catch a vigilant opponent off guard.", "start": 298.06, "duration": 4.56}, {"text": "Hiding in trees is another option; one that's employed by some of the most powerful builds of present-day.", "start": 302.66, "duration": 4.74}, {"text": "Big cats tend to target the neck of their opponents", "start": 308.36, "duration": 2.78}, {"text": "and well, it would be pretty hard to miss.", "start": 311.14, "duration": 2.0}, {"text": "Even the top-tier Jaguar probably couldn't 1-shot a high-level sauropod", "start": 314.16, "duration": 3.3}, {"text": "But all of the arboreal big cats would definitely be a problem for juveniles", "start": 317.46, "duration": 3.9}, {"text": "Potentially so problematic that not enough of them would be able to reach the late game to defend the lower level players", "start": 321.46, "duration": 5.06}, {"text": "It's hard to say.", "start": 326.52, "duration": 1.24}, {"text": "Overall, they could be completely viable or completely helpless, not much in between.", "start": 327.76, "duration": 4.78}, {"text": "In my opinion the herbivore builds best suited to survive in the current meta would be the ones with tail weapons, specifically Stegosaurus and ankylosaurus.", "start": 333.1, "duration": 7.4}, {"text": "As previously mentioned, the top predator builds will tend to attack from behind,", "start": 341.06, "duration": 3.7}, {"text": "avoiding a face-to-face confrontation and staying out of range of being hit by counter-attacks with horns, tusks and bites.", "start": 344.78, "duration": 5.62}, {"text": "This strategy works great against the tanky herbivore classes of present-day", "start": 351.02, "duration": 3.54}, {"text": "But an attack from behind would be an awful idea against a build with a club or thagomizer", "start": 354.56, "duration": 5.24}, {"text": "In addition, the armor on their back would make it much harder for assassin builds like big cats to land their critical strikes.", "start": 359.8, "duration": 6.0}, {"text": "Of all the herbivores, I find these to be the most likely to become top-tier if they were unbanned.", "start": 366.08, "duration": 5.06}, {"text": "Now on to the carnivores", "start": 372.16, "duration": 1.6}, {"text": "So this might be an unpopular opinion but I don't think large tyrannosaurs would fare well in the current meta", "start": 373.76, "duration": 5.9}, {"text": "Tyrannosaurs are min/max to optimize for damage", "start": 380.02, "duration": 2.56}, {"text": "which was great when their goal was to be able to bring down tanks with HP levels as high as the dinosaurs.", "start": 382.58, "duration": 5.12}, {"text": "The only build of present-day that this would be important to have against would be the elephant", "start": 387.95, "duration": 4.129}, {"text": "and while that is important, having only one good matchup is not a top-tier strategy.", "start": 392.24, "duration": 4.7}, {"text": "All elephant players need to do to counter this specific tactic is spec into slightly higher mobility", "start": 396.94, "duration": 5.58}, {"text": "since the T-rex's top speed is extremely low compared to builds of present-day.", "start": 402.52, "duration": 4.0}, {"text": "Smaller tyrannosaurs like Albertasaurus and Daspletosaurus would still be viable though", "start": 407.38, "duration": 4.14}, {"text": "since they haven't sacrificed as much mobility as the T-rex has.", "start": 411.6, "duration": 3.24}, {"text": "Mobility really is the name of the game for predators right now", "start": 414.84, "duration": 3.36}, {"text": "and it's the reason that I'd put dromaeosaurus like Velociraptor and Deinonychus as the best contenders for being too OP for the current meta", "start": 418.2, "duration": 6.46}, {"text": "and not just because of their excellent mobility", "start": 424.82, "duration": 2.28}, {"text": "but also because they really wouldn't need to adjust much from their play style in the Cretaceous.", "start": 427.1, "duration": 4.48}, {"text": "Raptor builds in the Cretaceous preyed mostly on small animals like prehistoric mammals", "start": 431.6, "duration": 4.84}, {"text": "and occasionally banded together to take down mid weight and heavy weight builds.", "start": 436.52, "duration": 3.32}, {"text": "This niche is still very much available today and raptors would have little trouble in combat versus builds like possums, raccoons and birds", "start": 440.24, "duration": 6.9}, {"text": "Waaaaah!", "start": 447.14, "duration": 1.1}, {"text": "This is the same role that the fox and coyote occupy right now.", "start": 448.24, "duration": 3.44}, {"text": "So the question then becomes: could Raptors compete with them?", "start": 451.68, "duration": 3.62}, {"text": "In one-on-one combat, I do think Raptors have the edge.", "start": 455.3, "duration": 3.56}, {"text": "While Raptors do have lower HP than any canine,", "start": 458.86, "duration": 2.68}, {"text": "they also have much more burst damage potential.", "start": 461.54, "duration": 2.84}, {"text": "Canines use the persistence hunting strategy and need to land several attacks in order to bring down a target.", "start": 464.38, "duration": 5.04}, {"text": "Raptors on the other hand deal much higher damage because of their sickle claw that can potentially one-shot an enemy.", "start": 469.5, "duration": 5.66}, {"text": "Both employ team strats and both have high mobility and intelligence.", "start": 475.16, "duration": 4.16}, {"text": "So all else being equal, the ability for Raptors to out damage the canines would in my opinion win them the day.", "start": 479.32, "duration": 6.44}, {"text": "So overall, if individual dinosaur builds were unbanned,", "start": 485.76, "duration": 3.52}, {"text": "the Stegosaurus, Ankylosaurus and dromaeosaurus would most likely be top-tier while the others might end up struggling", "start": 489.28, "duration": 6.52}, {"text": "Dinosaur players would need to learn a lot of new abilities to be able to contend with how advanced the meta is.", "start": 495.86, "duration": 4.94}, {"text": "Especially when it comes to how OP humans are.", "start": 500.84, "duration": 2.34}, {"text": "Luckily if you're looking to quickly and easily learn new skills, Skillshare has you covered.", "start": 504.12, "duration": 4.94}, {"text": "Skillshare is an online learning community with over 20,000 classes in design, business, technology and more.", "start": 509.06, "duration": 5.48}, {"text": "Premium membership gives you unlimited access to high-quality courses on must-know topics", "start": 515.0, "duration": 4.02}, {"text": "So you can improve your skills unlock new opportunities and do the work you love.", "start": 519.02, "duration": 3.8}, {"text": "I especially love their course on motion graphics which is taught by the folks behind in a nutshell", "start": 522.82, "duration": 4.36}, {"text": "Join the millions of students already learning on Skillshare today with a special offer that's just for my subscribers.", "start": 527.18, "duration": 5.58}, {"text": "You can try Skillshare for free for two months by using the link in the description.", "start": 532.76, "duration": 3.56}, {"text": "Act now for the special offer and start learning today.", "start": 536.93, "duration": 2.34}, {"text": "And special thanks to my patrons on patreon.", "start": 539.84, "duration": 2.08}, {"text": "If you'd like to see more from me, my patreon and social media are in the description.", "start": 541.92, "duration": 3.7}, {"text": "Thanks again for watching and good luck out there.", "start": 545.72, "duration": 2.0}]