[{"text": "Think so might wanna quick skim things. Nope, I didn't skim anything. We're started!", "start": 0.0, "duration": 3.84}, {"text": "Heck yeah! We're doing it live. I should probably monitor anything anywhere", "start": 4.16, "duration": 4.32}, {"text": "Welcome to The Wan Show. Ladies and gentlemen, we've got a fantastic show for you guys", "start": 8.58, "duration": 4.22}, {"text": "Yeah, I hope, yeah, we totally do. I also hope that it's not going to", "start": 12.809, "duration": 4.74}, {"text": " ", "start": 17.549, "duration": 0.491}, {"text": "Ummm, It's not going to break the framing isn't awesome. Yeah. Oh, yeah the camera up", "start": 18.04, "duration": 5.9}, {"text": "*inaudible noise*", "start": 24.36, "duration": 1.84}, {"text": "Andy? Can I borrow you for a minute", "start": 26.2, "duration": 2.18}, {"text": "Do you think you could center the microphone in the frame for The Wan Show?", "start": 28.8, "duration": 2.92}, {"text": "Honestly no hurry its fine, they're chill.", "start": 32.44, "duration": 2.46}, {"text": "Its just, this is The Wan Show peeps.", "start": 35.22, "duration": 1.84}, {"text": "I mean if they can forgive constant frame drops throughout the stream.", "start": 37.5, "duration": 2.86}, {"text": "They can probably forgive the microphone. No, no, no the camera moves", "start": 40.68, "duration": 3.54}, {"text": "Yep, you're good", "start": 45.25, "duration": 2.0}, {"text": "*laugh* You saw it here first guys, Andy's a ninja!", "start": 47.25, "duration": 4.31}, {"text": "Ayy thats better.", "start": 51.82, "duration": 1.08}, {"text": "Speaking of ninja!", "start": 52.9, "duration": 1.16}, {"text": "Wow!", "start": 55.72, "duration": 0.9}, {"text": "Good job we did one!", "start": 56.66, "duration": 1.96}, {"text": "Ninja leaves twitch!", "start": 59.66, "duration": 1.34}, {"text": "That was a great segway!", "start": 61.2, "duration": 1.98}, {"text": "So yeah guys, we're gonna talk about that today.", "start": 64.0, "duration": 2.16}, {"text": "We're also going to talk about some pretty big float plane news!", "start": 66.18, "duration": 3.32}, {"text": "Yeah!", "start": 69.74, "duration": 0.5}, {"text": "Prices going up and a wack ton of", "start": 71.18, "duration": 3.18}, {"text": "Creators are joining, oh wait camino knows that yet. They have technically like signed. Oh okay, so then we own their lives anyway.", "start": 74.5, "duration": 6.52}, {"text": "yeah, perfect! Okay that worked out!", "start": 81.7, "duration": 1.44}, {"text": "Also, a way more important departure has happened this week that isn't Ninja but is a different creator.", "start": 83.24, "duration": 5.76}, {"text": "That has more likes on twitter.", "start": 89.66, "duration": 1.72}, {"text": "Even though more people are talking about the Ninja one.", "start": 91.82, "duration": 2.14}, {"text": "Really did I miss this?", "start": 94.14, "duration": 1.12}, {"text": "Its not in the dock, I got it though its cool.", "start": 95.42, "duration": 2.28}, {"text": "Alright, we'll talk about it later.", "start": 97.86, "duration": 1.0}, {"text": "We've also got what to expect from Samsung unpacked?", "start": 99.02, "duration": 2.12}, {"text": "Yes, some legitimate actual tech news,", "start": 101.34, "duration": 2.04}, {"text": "and google was ordered to halt voice recordings!", "start": 103.5, "duration": 3.16}, {"text": "Well not voice recordings, human but reviews of them.", "start": 107.14, "duration": 2.0}, {"text": "Lets talk about it after we roll that introooooo!", "start": 109.26, "duration": 3.14}, {"text": "oooooooooooooooooo", "start": 112.4, "duration": 3.62}, {"text": "I'm not actually waiting for anything I can press it anytime I wanted.", "start": 116.1, "duration": 2.34}, {"text": "It seems to be going well?", "start": 122.88, "duration": 1.1}, {"text": "Its still yellow,", "start": 126.52, "duration": 1.12}, {"text": "Oh! It just turned green!", "start": 128.9, "duration": 1.4}, {"text": "I don't even know what that means though.", "start": 130.88, "duration": 2.0}, {"text": "So the only feedback I'm getting so far on the flow plane is, damn. It's so crisp on footplate", "start": 133.28, "duration": 4.94}, {"text": "Dang, well, it's nice that the floatplane streaming works again", "start": 138.77, "duration": 3.589}, {"text": "Yeah, yeah", "start": 142.97, "duration": 1.68}, {"text": "Yeah, so good. Yeah, so what we discovered?", "start": 144.65, "duration": 2.9}, {"text": "What we and the management team here", "start": 149.09, "duration": 1.91}, {"text": "Which is me I've discovered is that the best way to get the floatplane team which is Luke and his minions", "start": 151.0, "duration": 5.309}, {"text": "To finish something is to give them", "start": 156.53, "duration": 2.57}, {"text": "a horrendous", "start": 159.98, "duration": 2.0}, {"text": "Like task. Okay. Yeah, so you give them like a terrifying terrifying task like hey guys", "start": 162.2, "duration": 6.59}, {"text": "You're cut off is your chair higher is the is that did the camera tilt under the weight of the lens?", "start": 169.31, "duration": 5.96}, {"text": "Hey guys, my hair is terrible today. Let's just say my back", "start": 175.27, "duration": 2.49}, {"text": "So you give them you give them a horrendous task and like hey", "start": 177.76, "duration": 3.299}, {"text": "We're gonna stream LTX live the whole time and it really needs to work", "start": 181.43, "duration": 3.95}, {"text": "and it goes from not working at all to actually working really well great, and we can rely on it and", "start": 185.9, "duration": 5.84}, {"text": "And it's like magic. Yeah, and then you bring them to the office and you're like hey, you wanna fix Wan Show?", "start": 192.62, "duration": 5.6}, {"text": "Yeah, they're all in town right now. So yeah", "start": 198.22, "duration": 1.95}, {"text": "Yeah, show is fixed this week did did they even like do anything as far as I know? Nope, but it works great", "start": 200.17, "duration": 6.27}, {"text": "so one thing we did do was we pulled a", "start": 206.5, "duration": 2.699}, {"text": "Marathi switch out of the network that shouldn't have mattered", "start": 209.84, "duration": 3.08}, {"text": "but but what I kind of wonder is if it was sort of misconfigured because we had some Wireless issues and", "start": 213.05, "duration": 6.229}, {"text": "Pulling it out seems to have fixed those as well", "start": 220.25, "duration": 3.23}, {"text": "Yeah, so I I wonder if we just need to take another run", "start": 223.48, "duration": 3.809}, {"text": "You know who actually offered to maybe come up and help me with our networking infrastructure", "start": 227.29, "duration": 4.679}, {"text": "LED eater Oh", "start": 232.519, "duration": 2.0}, {"text": "Which would be sick that'd be cool. Yeah, he was like, yeah, I don't know if I'd be comfortable on camera", "start": 234.95, "duration": 4.759}, {"text": "So he's been a long time operator on our forum", "start": 239.709, "duration": 3.029}, {"text": "Wait, quite long and super knowledgeable about stuff that I care about like he's super heavy into Windows server and stuff", "start": 242.739, "duration": 6.99}, {"text": "So I do like using Windows server because I'm an idiot and I like having a GUI", "start": 249.8, "duration": 4.369}, {"text": "Not an idiot. I'm just", "start": 255.29, "duration": 2.0}, {"text": "On Linux servers temporarily and turn it back off not all of them like so oh, yeah, that's probably true", "start": 259.81, "duration": 6.239}, {"text": "But you could just use a different one you could but we done sent to us has like out-of-date packages", "start": 266.05, "duration": 4.05}, {"text": "Anyway, so you just unfortunately, okay", "start": 270.1, "duration": 2.369}, {"text": "Let's so the things that I didn't set up the things that I allowed other people to set up for me", "start": 272.47, "duration": 3.63}, {"text": "I'm mostly running on sent to us right now, which makes my life difficult because I don't know how to use it. Okay?", "start": 276.1, "duration": 4.259}, {"text": "so anyway, if letter came up and like", "start": 280.36, "duration": 2.04}, {"text": "Hooked me up", "start": 282.919, "duration": 0.681}, {"text": "I think we could I think we could probably have something where he could legitimately", "start": 283.6, "duration": 3.869}, {"text": "Show me how to do things and then I would be able to do them for myself after right cuz that's the problem", "start": 287.63, "duration": 4.94}, {"text": "That's how you end up having like an IT firm for your company forever", "start": 292.57, "duration": 4.109}, {"text": "Because they come in set it all up for you", "start": 297.14, "duration": 2.029}, {"text": "You have no idea how to properly and then you know, I think that's how I think that's how people end up buying jellyfishes. Oh,", "start": 299.169, "duration": 6.54}, {"text": "Okay, honestly, like honestly speaking like it's not even this is not gonna get any better", "start": 306.86, "duration": 4.82}, {"text": "it's not even unreasonable to go and get a jellyfish because the support is coming from people who actually", "start": 311.86, "duration": 6.0}, {"text": "It is in their best interest for you to not need to talk to them anymore", "start": 318.05, "duration": 2.99}, {"text": "So they want you actually taken care of where cuz they're not billing you by the hour anymore. Once they sell you the thing", "start": 321.04, "duration": 5.85}, {"text": "and it's simple enough to use that it probably won't be broken as", "start": 327.62, "duration": 4.279}, {"text": "Our first topic today, we're we gonna like ninja we're gonna talk about that right away, we're gonna tie one into right away", "start": 333.74, "duration": 5.119}, {"text": "Okay, and we've been doing the thing where we talk about the title right away. So we don't screw it up later. Yeah", "start": 338.86, "duration": 4.32}, {"text": "That's cool. Okay, so", "start": 344.15, "duration": 2.0}, {"text": "Mister Beavan's actually did not know his real name's not Beavan's so you still don't", "start": 346.85, "duration": 4.91}, {"text": "Blevens Elevens I blame that display and also I need to zoom. Okay. Why did you will remove?", "start": 352.789, "duration": 5.9}, {"text": "pinch-to-zoom on google docs, yeah", "start": 359.24, "duration": 2.299}, {"text": "Why what?", "start": 362.6, "duration": 2.0}, {"text": "possible reason", "start": 364.88, "duration": 1.289}, {"text": "You guys have didn't work at one point, right? Yes. Yeah it did. Yeah", "start": 366.169, "duration": 4.73}, {"text": "now you have to control Plus and it's like a whole don't do the whole your browser's like I", "start": 370.9, "duration": 5.339}, {"text": "Need to make it bigger. This is really hard. The whole bar at the top is way bigger now", "start": 376.88, "duration": 4.159}, {"text": "It's because GPUs haven't progressed in the last 30 years. I don't know how to do this", "start": 381.039, "duration": 5.76}, {"text": "Alright so mr. Blevins better known to millions of gamers as", "start": 388.849, "duration": 3.08}, {"text": "Ninja has posted a video announcement on Twitter saying to the world that he would be leaving twitch for the Microsoft own platform", "start": 392.49, "duration": 7.739}, {"text": "mixer which is like", "start": 400.539, "duration": 1.951}, {"text": "way smaller", "start": 402.49, "duration": 2.0}, {"text": "Astronomically - it's for some reference talk about movies around tell me about makes d9 because I don't subscribe", "start": 405.099, "duration": 5.54}, {"text": "I don't know anything about mixing it so it's a Microsoft thing. Okay. It used to be called beam max. I bought it", "start": 410.639, "duration": 5.91}, {"text": "I tell the audience like they don't know that they've got 69 thousand", "start": 418.66, "duration": 3.799}, {"text": "Roughly streamers on mixer they have 1.5 million", "start": 423.43, "duration": 3.529}, {"text": "Streamers on twitch. Yeah, I don't think that is partnered streamers and get streamers in general. Sure", "start": 427.75, "duration": 5.329}, {"text": "mixer has some differences in how you can make revenue on the platform as far as I know you have to", "start": 433.3, "duration": 6.049}, {"text": "It's not the same as the partner program that twitch has I think you just need to", "start": 440.38, "duration": 3.649}, {"text": "Cross some flags, and it kind of automatically happens", "start": 444.49, "duration": 2.6}, {"text": "You have to stream a certain amount per week certain amount per month and have an at least 2,000 followers", "start": 447.09, "duration": 6.179}, {"text": "It says and like some other things then you can make money that exception was then they can avoid people like me who are partnered", "start": 453.27, "duration": 5.73}, {"text": "on twitch, but like", "start": 459.0, "duration": 2.0}, {"text": "Yeah, never stream there if it just automatically takes it am I technically still partnered on", "start": 461.289, "duration": 4.369}, {"text": "Jan you are like anymore. You don't even have to check. I'm gonna check already. No, I'm just you know, what?", "start": 466.599, "duration": 4.94}, {"text": "This is a useless. It's not it's not that I don't trust you. It's just that is that what the check mark means?", "start": 471.539, "duration": 6.03}, {"text": "There's that very about to verify there's nothing to do with. Okay. So, how do you check if your partner?", "start": 477.57, "duration": 3.749}, {"text": "I don't think you would see it here. If you were an external user who wasn't logged into your account", "start": 481.449, "duration": 3.95}, {"text": "You would see a subscribe button. Oh", "start": 485.4, "duration": 2.0}, {"text": "I see. Okay, unless it disappeared in the last two weeks. You're a partner. Okay, cool. Oh cool. All right", "start": 487.419, "duration": 5.929}, {"text": "Really really old partner agreements actually don't have exclusivity clauses", "start": 493.9, "duration": 4.279}, {"text": "I think yours does I don't think it does", "start": 499.539, "duration": 2.3}, {"text": "I think it does but not for anything other than gaming", "start": 501.84, "duration": 2.549}, {"text": "so you wouldn't be able to like game on YouTube is that that's like that's what mine is like I", "start": 504.699, "duration": 4.97}, {"text": "Can't play games on YouTube, but I can do anything else. Oh interesting through that which contract thing. So anyways, he got over", "start": 510.099, "duration": 7.19}, {"text": "500,000 subscribers on his first stream or something insane, but it's free to subscribe to him on mixer right now", "start": 518.02, "duration": 6.619}, {"text": "So so mixer is just begging him for subscribe", "start": 525.27, "duration": 4.369}, {"text": "I'm sure they paid him a massive like minimum contract thing", "start": 530.04, "duration": 4.459}, {"text": "Like I'm sure he s all same contract you can talk about that after", "start": 534.5, "duration": 3.21}, {"text": "Sure, but let's just talk about the 500 thousand people that sub to him on mixer Yeah right off", "start": 537.81, "duration": 5.15}, {"text": "so channel subscriptions are $7.99 and mixer is just eating that oh", "start": 542.96, "duration": 4.859}, {"text": "yeah, yeah, I", "start": 548.73, "duration": 2.0}, {"text": "Wonder for how long to be completely honest. I bet you the behind the scenes deal is way more intense", "start": 550.89, "duration": 4.82}, {"text": "Oh, yeah, I would I mean it would have I think this is a minute here, maybe because like what is that?", "start": 555.71, "duration": 7.469}, {"text": "What does that even?", "start": 563.18, "duration": 2.0}, {"text": "Getting on my calculator here. Well, I don't know what the split is. Not just a minute", "start": 565.26, "duration": 4.19}, {"text": "Y'all wrote the split is let's say the split is dot dot Oh 5050. Let's say they let's say they haven't learned from twitch", "start": 569.45, "duration": 5.369}, {"text": "That that's not a reasonable split and let's go times", "start": 575.79, "duration": 4.07}, {"text": "0.5 times. What is it? 799? Yeah, seven eight dollars, really?", "start": 581.22, "duration": 5.599}, {"text": "Okay, so that is quite literally", "start": 588.36, "duration": 3.019}, {"text": "two million dollars a month", "start": 592.02, "duration": 2.0}, {"text": "Yeah, but at seven ninety-nine, yes there they might just be paying themselves anyways", "start": 594.39, "duration": 4.219}, {"text": "Except that people aren't paying to subscribe to him. Yeah, right. That's fair", "start": 599.67, "duration": 4.699}, {"text": "That's good call so they are they are they're just straight to mill literally", "start": 604.37, "duration": 4.95}, {"text": "Giving him to what there's a month. Yeah for no for zero revenue. Yeah", "start": 609.99, "duration": 4.76}, {"text": "Wouldn't it be nice to be Mike that never happens though?", "start": 615.27, "duration": 2.809}, {"text": "like as far as my understanding", "start": 618.3, "duration": 1.53}, {"text": "Goes from reading stuff online else guy stuff once you hit a certain point on Twitch you get a better deal", "start": 619.83, "duration": 5.27}, {"text": "Right, right no longer fifty-fifty. So then you're just probably more gets better. Yeah. Yeah. Yeah. Okay. Yeah. Yeah. So here's how it worked", "start": 625.62, "duration": 8.0}, {"text": "I don't know if I can talk about this publicly technically vessel got purchased by like Verizon Communications or something. So", "start": 634.22, "duration": 6.779}, {"text": "I don't think nicly they own their contracts. I suspect there's no one who would follow this up work here", "start": 641.0, "duration": 6.119}, {"text": "so technically I have like a confidentiality agreement about", "start": 647.12, "duration": 3.51}, {"text": "The contract that we signed with vessel, but but I like wait until Nick has time to run down here to stop", "start": 651.15, "duration": 6.079}, {"text": "No, I better do it before he has time to run back. So vessel is at the bottom of the ocean. Yeah, that's a pun", "start": 657.23, "duration": 5.429}, {"text": "And here's how the deal worked so they came to us and they said hey, we've got this early access concept", "start": 664.08, "duration": 6.649}, {"text": "it's gonna be three dollars a month for the entire site and", "start": 670.73, "duration": 3.059}, {"text": "we", "start": 674.58, "duration": 1.89}, {"text": "Yeah, that's not that's not sustainable anyway", "start": 676.47, "duration": 4.01}, {"text": "Before they died. They were like slashing video quality and stuff trying to keep their bandwidth down", "start": 681.9, "duration": 3.949}, {"text": "it was sad anyway, so they're like, okay three dollars a month you get early access to your favorite creators and", "start": 685.88, "duration": 6.21}, {"text": "That was the pitch to the viewers now to the creators", "start": 693.18, "duration": 3.59}, {"text": "They were like, hey, this is a supplementary revenue stream, but people like me", "start": 696.77, "duration": 5.01}, {"text": "We're kind of looking at it going well now hold on a minute. It's three dollars a month per user", "start": 701.78, "duration": 4.199}, {"text": "For the entire site. So if that user watches 1/10 me and", "start": 706.74, "duration": 5.989}, {"text": "9/10", "start": 713.55, "duration": 1.11}, {"text": "Good mythical morning or something an Ellen or whatever then I only get at best my share of", "start": 714.66, "duration": 6.44}, {"text": "30 cents, which is not a lot of money", "start": 721.35, "duration": 3.17}, {"text": "making matters more difficult is the fact that you actually have to convert a", "start": 725.339, "duration": 3.89}, {"text": "significant number of YouTube followers", "start": 730.17, "duration": 1.97}, {"text": "I mean, even if it was three dollars let alone 30 cents before it starts to even put a dent in things", "start": 732.14, "duration": 6.51}, {"text": "So at 30 cents a user let's do some quick napkin math and buy napkin. I mean my computer", "start": 738.75, "duration": 4.969}, {"text": "So let's say we got our we got our user computers in napkin. We got our 30 cents. Yeah", "start": 744.42, "duration": 5.15}, {"text": "This one actually has a touchscreen. So it's like even more napkin you than anything else?", "start": 749.57, "duration": 3.45}, {"text": "so let's say we converted at the time we were like a million million subscriber channel to that was", "start": 753.089, "duration": 5.6}, {"text": "2013 I don't know. It doesn't matter. It doesn't matter", "start": 759.48, "duration": 2.51}, {"text": "The point is let's say that we managed to convert routine a lot of users. Let's say okay twenty", "start": 761.99, "duration": 5.94}, {"text": "Twenty thousand users. That seems like a lot of users, right?", "start": 768.93, "duration": 2.96}, {"text": "That is six thousand dollars a month now six thousand dollars a month is nothing to sneeze at that's a lot of money", "start": 772.05, "duration": 5.21}, {"text": "But in the context of running a business six thousand dollars a month is like one employee", "start": 778.11, "duration": 5.299}, {"text": "Like that's not I mean depending because you got yours you got overhead", "start": 784.2, "duration": 4.94}, {"text": "You've got your your kind of pension plan. You've got your health benefits their equipment any software licenses", "start": 789.24, "duration": 6.27}, {"text": "They need the actual physical space they take up legged", "start": 795.51, "duration": 3.179}, {"text": "I think actually six thousand a month for what does that work out to seventy-two thousand a year that's actually fairly", "start": 798.69, "duration": 5.609}, {"text": "conservative in terms of the total cost of sustaining an employee", "start": 804.64, "duration": 3.199}, {"text": "They need a parking spot which by the way is not free", "start": 807.839, "duration": 3.45}, {"text": "Once you get into the business world, you know free parking at the mall", "start": 811.29, "duration": 3.66}, {"text": "Enjoy that while you're a consumer when you're a business you pay for your parking spots", "start": 815.17, "duration": 3.65}, {"text": "so it's not like it's not a", "start": 820.149, "duration": 2.42}, {"text": "Game-changer and there were a lot of risks associated with taking on a service like vessel", "start": 822.85, "duration": 5.09}, {"text": "You have to pitch it to your viewers. You're gonna piss them off", "start": 827.94, "duration": 2.309}, {"text": "And that was when this whole concept was basically unheard of you know, we were breaking the news on this", "start": 830.25, "duration": 4.769}, {"text": "No, it's not a bad deal", "start": 835.019, "duration": 2.0}, {"text": "But back then it was it was quite weird", "start": 837.07, "duration": 2.69}, {"text": "I feel like we have we have been the like the the sand wall that has broken a lot of waves. Yeah", "start": 839.76, "duration": 7.859}, {"text": "We definitely we absorb that one yeah", "start": 849.73, "duration": 2.299}, {"text": "So you got a picture to your audience you you run the risk of splitting your audience", "start": 853.329, "duration": 4.34}, {"text": "So you're you're basically taking your most ardent superfans and you're saying hey pay a few bucks a month", "start": 857.67, "duration": 5.909}, {"text": "Go watch the videos early over here", "start": 863.579, "duration": 1.651}, {"text": "Well, the unfortunate news is those are exactly the people that are likely to renege down and then watch the video", "start": 865.23, "duration": 6.989}, {"text": "Immediately when the notification hits their phone driving up the initial traction of the video telling YouTube", "start": 872.86, "duration": 6.65}, {"text": "This is a good video and that they should serve it to other people. So you're potentially splitting your audience", "start": 879.51, "duration": 4.469}, {"text": "You're giving this bad message to your audience. You look like a", "start": 883.98, "duration": 3.03}, {"text": "money-grubbing Butthead", "start": 887.56, "duration": 2.0}, {"text": "You know, I mean a lot of people made those comments back in the day", "start": 890.17, "duration": 2.779}, {"text": "They used they use more offensive words than Butthead though it basically sentiment around all this stuff used to be morning", "start": 892.949, "duration": 6.24}, {"text": "Yeah and was and has the potential depending on your audience to still be really negative", "start": 899.22, "duration": 4.41}, {"text": "I find that the favorite part from my perspective. Yes back then", "start": 903.63, "duration": 4.799}, {"text": "Most users just hated it now", "start": 909.01, "duration": 2.0}, {"text": "There's a very large amount of users that are suggesting different creators going full plane because it'd be good for them. Yeah, like", "start": 911.019, "duration": 4.64}, {"text": "Sentiment changes over time isn't that crazy?", "start": 916.18, "duration": 2.0}, {"text": "So anyway to make that make any sense the way that these contracts typically work. I'm guessing just based on stuff", "start": 918.39, "duration": 7.989}, {"text": "Is that in addition to?", "start": 926.99, "duration": 2.51}, {"text": "like a signing bonus and there is absolutely", "start": 930.41, "duration": 3.14}, {"text": "No way in God's green earth fit ninja didn't get a gigantic signing bonus", "start": 934.07, "duration": 4.01}, {"text": "here's a big bag of money to take the risk of alienating your fans and", "start": 938.12, "duration": 4.039}, {"text": "Making people mad in addition to that. What is fairly typical is something called a minimum guarantee?", "start": 942.98, "duration": 5.809}, {"text": "so a minimum guarantee basically takes", "start": 949.1, "duration": 2.6}, {"text": "That math that I've done in my head where I go", "start": 952.55, "duration": 2.63}, {"text": "Wow, even if I convert like 20,000 people to this site at my stupid 30 cents a user", "start": 955.37, "duration": 6.14}, {"text": "I'm getting this amount of money. That really doesn't look worth it for me. You're relating a lot of this to YouTube", "start": 961.51, "duration": 5.369}, {"text": "It's way easier for the twitch side. I have this many paying subscribers. Yeah. Oh, yeah, right because you've already even got people paying okay", "start": 967.01, "duration": 7.339}, {"text": "Okay, cool. So this is my growth rate. Yes", "start": 974.93, "duration": 3.08}, {"text": "So it's really easy to kind of forecast what your revenue is gonna look like in the future with YouTube", "start": 978.5, "duration": 4.369}, {"text": "It's sort of more of a risk and also you don't have to leave behind your Adsense, which is another difference in the equation", "start": 982.87, "duration": 5.34}, {"text": "But anyway, that doesn't change the concept the concept is called a minimum guarantee", "start": 988.21, "duration": 3.179}, {"text": "So it takes that math that you're doing in your head going", "start": 991.49, "duration": 2.479}, {"text": "well", "start": 993.97, "duration": 0.43}, {"text": "This doesn't make any sense for me unless I can hit these mondo astronomical numbers and it takes the guesswork out of it", "start": 994.4, "duration": 7.429}, {"text": "They basically go. Okay, even if you only manage to bring 500 people over to the platform", "start": 1001.87, "duration": 5.9}, {"text": "We're gonna pay you as though you brought over", "start": 1008.35, "duration": 2.42}, {"text": "5,000 or", "start": 1011.8, "duration": 1.5}, {"text": "50,000 or", "start": 1013.3, "duration": 1.47}, {"text": "500,000 that's your minimum guarantee. Now, you have the potential for additional earnings on top of that", "start": 1014.77, "duration": 5.989}, {"text": "Let's say the threshold for ninja list was 500,000 if he manages to bring on", "start": 1020.76, "duration": 4.619}, {"text": "600 or 700 800 900", "start": 1026.11, "duration": 2.0}, {"text": "thousand ago he can get extra but at least that takes some of the", "start": 1028.36, "duration": 3.77}, {"text": "Uncertainty out of the deal so I can pretty much guarantee that", "start": 1032.38, "duration": 2.78}, {"text": "ninja has some kind of giant signing bonus as well as something called a minimum guarantee now, it's possible that", "start": 1035.709, "duration": 7.369}, {"text": "Microsoft's deal here or that in Microsoft deal. The minimum guarantee is in the form of these free subscribers", "start": 1044.079, "duration": 6.47}, {"text": "Yeah, like hey, we'll allow up to this many people a day to subscribe for free. Apparently it's days", "start": 1050.73, "duration": 6.39}, {"text": "Two months two months for free two months two months for free. Oh,", "start": 1058.559, "duration": 4.89}, {"text": "It's also possible that that two months for free could be the signing bonus. Yeah, uh, but I I don't know", "start": 1064.84, "duration": 7.04}, {"text": "I I'm actually I you know, what? No, I take that back. I'm sure there's just a casualty days you have to sign up for", "start": 1071.88, "duration": 4.559}, {"text": "Okay. Yeah, so you get the first two months for free, but I don't know how long you have to sign up for free", "start": 1077.35, "duration": 4.219}, {"text": "Yeah, I'm actually not sure", "start": 1081.57, "duration": 2.0}, {"text": "So I forget how I got onto this topic", "start": 1083.799, "duration": 3.469}, {"text": "But that is probably how the deal worked and that is pretty much how vessel deals allegedly worked", "start": 1087.269, "duration": 6.51}, {"text": "Allegedly allegedly", "start": 1095.44, "duration": 2.0}, {"text": "Oh, do we know that or is that", "start": 1100.929, "duration": 2.81}, {"text": "Yeah, okay", "start": 1106.96, "duration": 2.0}, {"text": "so yeah, I don't know if you guys can hear Nick off camera, but it's I", "start": 1109.179, "duration": 4.07}, {"text": "Mean you never sign a contract like this in perpetuity. Hey, you can't do that. It's illegal and B", "start": 1113.919, "duration": 5.18}, {"text": "that would be super stupid because just if if ninja gets unpopular which is", "start": 1119.1, "duration": 5.01}, {"text": "Possible. I mean the streaming game is one of", "start": 1124.779, "duration": 2.18}, {"text": "Just meteoric Rises to stardom and then meteoric meteors", "start": 1127.96, "duration": 5.689}, {"text": "Yeah", "start": 1134.5, "duration": 1.38}, {"text": "See how they work", "start": 1135.88, "duration": 2.0}, {"text": "So so he could get unpopular - lava tubes", "start": 1139.99, "duration": 3.349}, {"text": "Mixer could just turn into a project that Microsoft eventually kind of goes. I'm sorry", "start": 1144.07, "duration": 4.819}, {"text": "We're doing what this just isn't working", "start": 1148.929, "duration": 1.46}, {"text": "We give up like I kind of bet you this was that pivoting moment you think so. Yeah, okay", "start": 1150.389, "duration": 5.13}, {"text": "This was the do we give up or not?", "start": 1155.519, "duration": 1.801}, {"text": "If we don't give up, we do something super drastic if we do give up. We they're all over the news", "start": 1157.32, "duration": 5.489}, {"text": "Honestly that the App Store's number one app is mixer right now", "start": 1163.51, "duration": 3.679}, {"text": "I mean", "start": 1167.19, "duration": 0.579}, {"text": "that's why I that's why I would go after ninja I mean", "start": 1167.769, "duration": 3.17}, {"text": "I wouldn't go after ninja necessarily for the audience because in the grand scheme of things", "start": 1170.94, "duration": 3.15}, {"text": "500 even 500 thousand active users. Okay. It's not a lot in the modern day", "start": 1175.029, "duration": 6.05}, {"text": "Can I minorly pivot us right now won't take us completely off this topic. We come right back to the topic", "start": 1181.08, "duration": 4.38}, {"text": "Speaking of I wouldn't go after a ninja for the audience I found this", "start": 1186.01, "duration": 3.019}, {"text": "Very interesting is obviously not indicative of everything also", "start": 1189.639, "duration": 3.26}, {"text": "I think a lot of people didn't like this so they might not press a like button", "start": 1192.97, "duration": 4.789}, {"text": "But if you look at ninjas tweet about this the next chapter mix the dark arm slash ninja it's his pain to tweet", "start": 1197.799, "duration": 6.02}, {"text": "It's on his Twitter right now", "start": 1203.82, "duration": 1.9}, {"text": "166 thousand likes", "start": 1205.72, "duration": 2.0}, {"text": "Right. Yep, jump over 200k. You're totally totally changing gears here. Okay over one second", "start": 1207.85, "duration": 6.38}, {"text": "Let's throw luke screen up here Brad. Whoa, toe. Okay, who is this?", "start": 1214.23, "duration": 3.779}, {"text": "This is the this is the he's been editing videos for peopie for five years. Oh this guy. Yeah. Yeah. Yeah, okay", "start": 1218.009, "duration": 6.93}, {"text": "He just stopped working with PewDiePie. Yeah, it was a very positive on both sides is cool, but he's not working there anymore", "start": 1224.97, "duration": 5.579}, {"text": "I saw Felix's tweet, but I actually had any time. So yeah, this isn't Felix's tweet. This is Brad's Twitter", "start": 1230.82, "duration": 5.91}, {"text": "190,000 followers like it's sizable, but it's not PewDiePie and 85 one hundred and ninety five thousand likes", "start": 1237.7, "duration": 6.5}, {"text": "Really Oh ninja just got styled on", "start": 1245.2, "duration": 2.929}, {"text": "By an editor from like over there somewhere", "start": 1248.83, "duration": 2.63}, {"text": "Pretty cool. Are you hating?", "start": 1252.82, "duration": 2.179}, {"text": "I'm just saying I'm just saying", "start": 1255.94, "duration": 2.42}, {"text": "Someone leaving a YouTube channel and going on to do their own things. It's a departure. Yes", "start": 1259.119, "duration": 4.67}, {"text": "He's not gonna be working on things that people like anymore", "start": 1263.789, "duration": 2.13}, {"text": "He's not be working on the channel people like anymore all that kind of stuff people might work on his own things", "start": 1265.919, "duration": 3.66}, {"text": "Absolutely", "start": 1270.22, "duration": 1.62}, {"text": "More likes than ninjas. Okay, just say well a good job Luke", "start": 1271.84, "duration": 4.369}, {"text": "Thank you investigative journalism. Thank you for contributing Dobin hard to our mansion. Absolutely. I think Brad was a big reason for", "start": 1277.33, "duration": 7.819}, {"text": "PewDiePie's shifts in content direction and all that kind of stuff and I think it's really cool. I'm excited for his future", "start": 1286.059, "duration": 4.16}, {"text": "But yeah, I just found it interesting that these are happening at like the same time. Yeah, and", "start": 1290.22, "duration": 4.169}, {"text": "Ninja has quite literally 20 times as many followers", "start": 1294.94, "duration": 2.809}, {"text": "4.6 2 million followers on Twitter versus a hundred and sixty thousand 190,000 again. It's sizable", "start": 1299.049, "duration": 6.29}, {"text": "but so let's um, let's let's ignore the money for a second cuz you know both you and I I mean", "start": 1305.34, "duration": 5.4}, {"text": "I feel like maybe we're being unfair. I'm really focusing on the money here", "start": 1310.74, "duration": 4.469}, {"text": "Ok, let's hear let's hear it ninjas own words why he made the move? This is a quote here. Yeah", "start": 1315.21, "duration": 5.549}, {"text": "I feel like this a really good chance to get back in touch with my roots and really", "start": 1320.759, "duration": 4.71}, {"text": "Know straight face stop I", "start": 1333.49, "duration": 2.0}, {"text": "Feel like this is a really good chance to get back in touch with my roots and really remember why I fell", "start": 1336.85, "duration": 4.55}, {"text": "Honestly, okay. Alright, okay, give me a sec I gotta bite my cheek here I", "start": 1346.15, "duration": 5.329}, {"text": "Feel like this is a really good chance to get back in touch with my roots and really remember why I fell in love", "start": 1354.19, "duration": 4.88}, {"text": "He says it another time - he has a tweet that follows up the main tweet", "start": 1364.93, "duration": 3.679}, {"text": "That is like oh like everything's still gonna be cool", "start": 1368.62, "duration": 2.359}, {"text": "I'm still gonna and it's interesting how he addresses twice in the original tweet that like my win rate isn't gonna change things are still", "start": 1370.98, "duration": 6.33}, {"text": "Going to be good", "start": 1377.31, "duration": 2.0}, {"text": "There is more interactions on Twitter on mixer sorry, okay. Alright, okay. Okay mixer is actually like surprisingly different", "start": 1384.28, "duration": 6.589}, {"text": "Okay, and twitch all things considered they have some pretty cool things through the platform", "start": 1390.87, "duration": 4.109}, {"text": "There's some things that like no offense to the mixer team. They feel a little Jake sometimes. Yeah, but there is some interesting", "start": 1394.99, "duration": 5.989}, {"text": "From an alpha. Yeah. I mean we have our own jank things - it's cool, bro. I love you, but", "start": 1404.47, "duration": 4.729}, {"text": "Like yeah, there's there's it's just it is notably different", "start": 1410.41, "duration": 3.349}, {"text": "Like when you first check out the site you're like, okay, it's a it's a twitch car", "start": 1413.76, "duration": 3.209}, {"text": "But once you use a little bit more, it's like nah, no, it's different", "start": 1416.97, "duration": 2.43}, {"text": "Okay, so would you switch to mixer to get excuse me to really remember why you fell in love?", "start": 1419.4, "duration": 4.619}, {"text": "I", "start": 1424.54, "duration": 2.0}, {"text": "Liked no, probably not", "start": 1427.03, "duration": 2.0}, {"text": "Okay, I'd stream in both places", "start": 1430.06, "duration": 1.86}, {"text": "Which wouldn't be like so some people have speculated that he made the jump in order to have better work/life balance", "start": 1431.92, "duration": 4.939}, {"text": "He told the New York Times in December 2018 that the longest vacation he ever took was his honeymoon", "start": 1436.86, "duration": 4.41}, {"text": "Which was six days in total and called it", "start": 1441.43, "duration": 2.599}, {"text": "Devastating adding that it was a calculated risk", "start": 1444.55, "duration": 2.119}, {"text": "He added that taking even a couple hours off means losing 200 to 300 subscribers each hour. That's crazy. That is", "start": 1447.66, "duration": 7.38}, {"text": "By contrast in addition to features on the site mixture mixer is less saturated. So there's only 69 thousand streamers", "start": 1456.52, "duration": 6.979}, {"text": "So like he's kind of the King on twitch, but there's some contenders and mix", "start": 1463.99, "duration": 4.73}, {"text": "Well, he the God on mixer the plateau it is growing it", "start": 1468.72, "duration": 3.989}, {"text": "That's true, and there can carrot current viewer account increased by about 200 percent in 2018", "start": 1472.71, "duration": 4.799}, {"text": "So, you know, I think we're not gonna say too much more about this", "start": 1480.61, "duration": 3.65}, {"text": "But the the response from the community people are criticizing him for leaving a platform that helped him get where he is", "start": 1484.26, "duration": 5.489}, {"text": "Twitch said we've loved watching ninja on Twitter over the years", "start": 1490.18, "duration": 2.75}, {"text": "We're proud of all he's accomplished for himself and his family in the gaming community", "start": 1492.93, "duration": 2.429}, {"text": "We should wish him the best of luck in his future endeavors", "start": 1495.36, "duration": 2.0}, {"text": "But our PR PR PR PR PR PR PR, here's my kind of take to that", "start": 1497.68, "duration": 4.189}, {"text": "You know, how can you be upset with him for leaving the platform that I think?", "start": 1501.87, "duration": 5.52}, {"text": "Careers allowed to be and beware and do whatever they want. Like there's okay. So here's the thing", "start": 1510.58, "duration": 5.569}, {"text": "There is a relationship element to what we do and by we I mean online content creators. Yeah, Nick, we're good", "start": 1516.15, "duration": 7.77}, {"text": "We don't need you to supervise me saying anything dumb about vessel anymore. Oh", "start": 1523.92, "duration": 3.059}, {"text": "Why are you here? Oh", "start": 1528.64, "duration": 2.0}, {"text": "You're here for merge stuff. Oh, I thought oh", "start": 1531.13, "duration": 2.479}, {"text": "he's been he's been standing there and I thought I felt like kind of watched like what I say cuz", "start": 1534.73, "duration": 5.99}, {"text": "Okay", "start": 1541.81, "duration": 2.0}, {"text": "Really yeah, it's for sale", "start": 1547.84, "duration": 2.0}, {"text": "Oh my goodness guys, okay, we're gonna kickstart this", "start": 1554.35, "duration": 5.719}, {"text": "Oh, yeah, so you buy for you get them for 50, okay, so sorry guys, I got it", "start": 1568.27, "duration": 6.53}, {"text": "No, no, no, no, it's fine. Okay. So let's finish up the let's finish up the mixer discussion. Oh, yeah, right", "start": 1576.37, "duration": 5.69}, {"text": "So we we as online content creators on the one hand. There is an element of relationship with the platform", "start": 1582.3, "duration": 7.349}, {"text": "Like I when people ask me, you know", "start": 1589.65, "duration": 2.94}, {"text": "one of the first things you ask someone when you when you meet them for the first time is like", "start": 1592.59, "duration": 3.299}, {"text": "What do you do? What do you do and my response is?", "start": 1596.95, "duration": 3.529}, {"text": "Almost always unless they're like really old and I don't think they're gonna understand what I'm talking about", "start": 1601.24, "duration": 4.28}, {"text": "I am a youtuber", "start": 1606.42, "duration": 1.6}, {"text": "Yeah, that's my response", "start": 1608.02, "duration": 1.4}, {"text": "It's not I do YouTube Oh God - its I am a youtuber here's really complicated. Just hashtag", "start": 1609.42, "duration": 7.29}, {"text": "It's complicated", "start": 1616.71, "duration": 0.88}, {"text": "I am a youtuber and so I do feel like there's something to be said for", "start": 1617.59, "duration": 5.119}, {"text": "Riding the horse that got me here with that said", "start": 1623.2, "duration": 3.349}, {"text": "this is business and", "start": 1627.4, "duration": 2.0}, {"text": "Business is not necessarily all about money", "start": 1629.59, "duration": 2.959}, {"text": "the way that I see business is is money is obviously a", "start": 1632.55, "duration": 3.989}, {"text": "Component but business is about making things make sense", "start": 1636.97, "duration": 3.71}, {"text": "so good business when I enter into some kind of arrangement whether it's with Luke or a landlord or", "start": 1641.08, "duration": 6.979}, {"text": "Brandon or or you our community or a partner like", "start": 1648.91, "duration": 4.55}, {"text": "You know a Squarespace or something like that when I enter into a relationship it's about making it make sense", "start": 1654.79, "duration": 6.199}, {"text": "Because if it doesn't make sense for both parties you end up with vessel DICOM", "start": 1661.3, "duration": 4.76}, {"text": "Vessel signed a deal with me that didn't make any sense. It made great sense for me, but not for them", "start": 1666.91, "duration": 6.229}, {"text": "Which to be fair is not sustainable. I think everything they did didn't make any sense like them", "start": 1673.3, "duration": 4.16}, {"text": "So the thing is that in order for business to work things have to make sense for both parties", "start": 1677.46, "duration": 5.399}, {"text": "So this is a case where it no longer made sense", "start": 1683.02, "duration": 4.04}, {"text": "For ninja in the context of other factors that we don't necessarily know", "start": 1687.43, "duration": 4.609}, {"text": "Work-life balance could have been part of it money could have been part of it", "start": 1692.59, "duration": 2.929}, {"text": "participating on a smaller", "start": 1696.19, "duration": 1.35}, {"text": "platform and being a huge fish in a small pond might actually be part of it this kind of done a very cool way for", "start": 1697.54, "duration": 6.5}, {"text": "him to do a kind of and I know it's", "start": 1704.5, "duration": 3.739}, {"text": "Microsoft but hear me out a little bit to do a more like kind of startup he thing", "start": 1708.64, "duration": 4.01}, {"text": "He can't do that. He's way too big but if he goes from twitch to a new platform", "start": 1713.29, "duration": 6.05}, {"text": "He might have the ability to drive the direction of the planet. He wants to reinvent himself a little bit, too", "start": 1719.35, "duration": 4.5}, {"text": "We don't know", "start": 1723.85, "duration": 0.55}, {"text": "so basically what I'm saying is", "start": 1724.4, "duration": 2.299}, {"text": "Don't blame a creator for leaving a platform blame a platform and a creator for not", "start": 1727.19, "duration": 5.9}, {"text": "Meeting in the middle, whatever that deal looks like, you know", "start": 1733.76, "duration": 2.929}, {"text": "Just just don't be mad at ninja don't be mad at twitch understand that these are two", "start": 1736.69, "duration": 3.69}, {"text": "Adults more at more than two", "start": 1741.08, "duration": 2.0}, {"text": "Aging he's gonna pitch their whole c-suite probably was involved in this. Yeah", "start": 1743.48, "duration": 3.92}, {"text": "But these are these are adults and they're getting a deal done or they're not getting a deal done", "start": 1748.04, "duration": 3.859}, {"text": "And if there's no deal then you find a different deal", "start": 1751.9, "duration": 2.099}, {"text": "Yeah, like I find it hilarious that Brad's thing has more likes than the ninjas thing, but I don't I don't hate the move", "start": 1754.28, "duration": 7.159}, {"text": "He can do whatever he wants", "start": 1761.72, "duration": 2.0}, {"text": "Sounds good. Shoot. What did I say?", "start": 1764.059, "duration": 1.551}, {"text": "I was gonna tell that's one of the reasons why pho plane doesn't have any", "start": 1765.61, "duration": 3.209}, {"text": "Exclusivity things in it at all and will like help you leave if you want because we believe in creator choice", "start": 1769.01, "duration": 4.429}, {"text": "Okay, actually", "start": 1774.02, "duration": 1.47}, {"text": "Sorry, what did I say? I was supposed to talk about after this though merch. Oh, yeah, right. Oh, yeah. Sorry guys", "start": 1775.49, "duration": 5.569}, {"text": "So LTT store comm we have a bit of a situation", "start": 1781.24, "duration": 3.15}, {"text": "Um, I'm not gonna I'm not gonna blame anyone in particular as you have before. Oh,", "start": 1784.94, "duration": 5.18}, {"text": "Well, no. No, I'm blaming Nick for elemental because I'm taking the blame for the cable ties", "start": 1791.0, "duration": 5.689}, {"text": "So that's how we've decided to split it up. The cable ties are my bad", "start": 1796.94, "duration": 4.07}, {"text": "These are an overstock problem. We have a plan to try and get rid of them", "start": 1801.77, "duration": 3.26}, {"text": "And like everything's pretty good. Except this. This is the elemental shirt. I don't know what the name means", "start": 1805.99, "duration": 6.3}, {"text": "I don't really know what we were thinking. It looks nice. It's fine. There's nothing wrong with it", "start": 1812.29, "duration": 6.0}, {"text": "it just didn't really resonate and we sell like I", "start": 1818.299, "duration": 3.56}, {"text": "don't know a handful of them a week normally so we have a special deal because we have like", "start": 1822.29, "duration": 5.719}, {"text": "4,000 of them or something ya know. These are like a big problem. Yeah", "start": 1829.309, "duration": 4.07}, {"text": "Right now I looked for the other ones. Yeah, it was like, all right. All right, cool", "start": 1834.08, "duration": 6.26}, {"text": "Very nice. Sure. It's still an American Apparel shirt. I think honestly, I'm your biggest problem. Yeah that you made way cooler shirts", "start": 1841.46, "duration": 7.25}, {"text": "I think that is the biggest problems", "start": 1848.71, "duration": 2.219}, {"text": "These are some right after that's totally fine", "start": 1850.929, "duration": 2.369}, {"text": "And now you can get four of them for fifty bucks", "start": 1853.299, "duration": 3.46}, {"text": "Which is actually a pretty darn good deal for American Apparel shirts", "start": 1856.95, "duration": 3.919}, {"text": "All you have to do is add four of them to your cart and the discount will be automatically applied", "start": 1860.88, "duration": 5.119}, {"text": "Okay, straight up just like comfy shirt shopping. That's not bad. They're actually really nice straight up by her cell", "start": 1866.28, "duration": 6.439}, {"text": "Please take these off our head", "start": 1873.06, "duration": 2.0}, {"text": "And then while you're at it while you're at it please buy a cable type", "start": 1876.57, "duration": 3.589}, {"text": "Or or check out some of the other like actually much cooler design combinations in stock in small and large", "start": 1883.08, "duration": 5.299}, {"text": "Oh, wow processors, like out of stock. That sucks. That's a really nice shirt. I don't know hard drive one", "start": 1888.98, "duration": 5.67}, {"text": "It's out of stock in my size. Yeah car drives are really nice", "start": 1894.65, "duration": 2.969}, {"text": "I know this one Oh have a water bottle hat Stealth. We actually have a lot of products now. Okay, okay, okay", "start": 1897.62, "duration": 6.719}, {"text": "I'm not supposed to show you guys this stuff, but I'm gonna I'm gonna do it", "start": 1904.34, "duration": 4.14}, {"text": "Because I don't care Yolo. You know how many times he swipes the Hangout specialists off his screen", "start": 1909.27, "duration": 5.27}, {"text": "I don't care that you're trying to stop me from doing something terrible", "start": 1914.54, "duration": 3.15}, {"text": "How many times how many times do live right once check these out? I'm gonna show these to the audience, too", "start": 1917.69, "duration": 4.469}, {"text": "I have seen means. Oh you have seen these. Oh, man. Yeah. I I have no easy. I don't have airdrop", "start": 1922.16, "duration": 5.189}, {"text": "I don't have airdrop. I have no easy way to get this picture from here to here. I'm actually you're signed into your email there", "start": 1927.35, "duration": 5.46}, {"text": "You literally have Drive on there and that's stored in Drive", "start": 1935.73, "duration": 2.51}, {"text": "There are alternative options to what you're doing", "start": 1941.46, "duration": 2.36}, {"text": "That's fine actually looks pretty good", "start": 1944.55, "duration": 2.0}, {"text": "Look at the bokeh Oh", "start": 1947.37, "duration": 2.0}, {"text": "Brandon's gonna handle it for you", "start": 1949.38, "duration": 2.0}, {"text": "Oh", "start": 1957.54, "duration": 1.56}, {"text": "So those actually are not here yet", "start": 1959.1, "duration": 3.14}, {"text": "Those are just a picture that our supplier took for us of the circuit board", "start": 1963.33, "duration": 5.269}, {"text": "ltte water bottle design in some different color combinations", "start": 1968.82, "duration": 3.139}, {"text": "I am super excited because which okay, what's your favorite one?", "start": 1972.84, "duration": 3.98}, {"text": "It's gonna ask you but I guess you have I thought you might have been doing this. I blew it out really fast. I", "start": 1977.7, "duration": 5.269}, {"text": "Like black on white what? Okay, that's my favorite one. I don't feel it. See that's bullcrap. That's why you", "start": 1984.09, "duration": 7.069}, {"text": "See you can ask Nick. No, you're a weird clingy person. Uh, no. Okay. It's like Oh, what are you gonna get?", "start": 1992.099, "duration": 5.93}, {"text": "well, I was gonna get lucky pick that to like Oh, what's your", "start": 1998.219, "duration": 3.02}, {"text": "Frie oh wow. That's my favorite book to the summer. You should both kill John Lennon", "start": 2002.839, "duration": 3.89}, {"text": "Together", "start": 2008.57, "duration": 1.229}, {"text": "coupon", "start": 2009.799, "duration": 1.35}, {"text": "Okay rot in prison together forever. I don't think it's gonna be the most popular one though. I don't think so", "start": 2011.149, "duration": 5.689}, {"text": "I think the black on black and the white on white are gonna be the most popular ones if I had to wager I guess", "start": 2016.869, "duration": 4.53}, {"text": "I like that one, but it's very striking. So it was actually", "start": 2021.399, "duration": 3.869}, {"text": "It was actually Project snowblind the white on white that prompted us to go back", "start": 2025.879, "duration": 5.209}, {"text": "And maybe see if there's other calm color combinations we want to explore. So I said the black and white one", "start": 2031.669, "duration": 5.839}, {"text": "Yeah, and then Nick was like, okay", "start": 2037.509, "duration": 1.681}, {"text": "Yeah", "start": 2039.19, "duration": 0.279}, {"text": "But we think this one will do a lot bad Oh gold on black gold on black I think gold on black is gonna crush", "start": 2039.469, "duration": 5.33}, {"text": "It that's my second favorite and I I agree that it'll crush it. I don't necessarily think it's my second favorite", "start": 2044.799, "duration": 4.499}, {"text": "I kind of want to do both", "start": 2049.339, "duration": 2.0}, {"text": "Cuz like they look so good but the minimum order quantity. Yeah, it's like 2,000 units or something stupid like yeah, I like", "start": 2051.589, "duration": 7.699}, {"text": "It's a lot of water bottles, dude", "start": 2059.899, "duration": 2.0}, {"text": "Six months later. All right guys, we're fire sale", "start": 2062.929, "duration": 2.899}, {"text": "Folks five bucks in all seriousness. Oh, that's not gonna happen to we're only gonna do that with like", "start": 2069.77, "duration": 5.359}, {"text": "Truly desperate things, you know, what is actually moving surprisingly well", "start": 2075.859, "duration": 4.16}, {"text": "The underwear dude, they're good. I bet you I would really really really like to see stats on this because they're decently expensive", "start": 2081.169, "duration": 7.129}, {"text": "Yeah, and it's underwear and that's very like, you know, but I bet you return customers. Oh, yeah", "start": 2088.429, "duration": 7.459}, {"text": "Earn customers for the underwear is gonna be a huge thing. They'll buy some underwear and then like a little bit later", "start": 2096.619, "duration": 5.479}, {"text": "It's um be like, okay, maybe a couple more I think so and I bet you that's gonna I think sounds there's gonna happen", "start": 2102.099, "duration": 5.429}, {"text": "Yeah, it's it's funny. We've actually given them away to some content creators. No obligation whatsoever. We're just like", "start": 2107.559, "duration": 7.38}, {"text": "Here's some underwear", "start": 2115.64, "duration": 1.74}, {"text": "Do nothing with it?", "start": 2117.38, "duration": 2.0}, {"text": "BIRT burn it for all I care. Here's some underwear and of their own volition, no prompting from us", "start": 2119.93, "duration": 6.26}, {"text": "We've actually had multiple people just post on Twitter. Wow, those are actually shockingly comfortable as they are", "start": 2126.19, "duration": 7.26}, {"text": "They're really good. Did we get you any? Oh", "start": 2133.52, "duration": 2.119}, {"text": "Yeah, so, uh, you know you just come and say hi to everybody", "start": 2139.04, "duration": 3.65}, {"text": "So we take my c4 Sir Alex from low spec game Oh spec gaming low spec game", "start": 2142.69, "duration": 5.79}, {"text": "Is that it low spec gumming? You're gonna get it something. Yeah. Yeah", "start": 2148.48, "duration": 3.179}, {"text": "Gamer actually dropped by the studio today. I didn't know you were coming. What why are you still here?", "start": 2153.98, "duration": 5.839}, {"text": "LTX ended like like five days ago. I needed a week off. Oh, I did it", "start": 2160.03, "duration": 4.53}, {"text": "I'm surprised you guys they're still like churning at it. Like it's it's impressive. We took two days off", "start": 2164.6, "duration": 6.199}, {"text": "Blaine didn't actually Riley didn't at least one of the editors did and I'm pretty sure mark was here", "start": 2173.48, "duration": 5.03}, {"text": "I'm pretty sure Dennis was here. Okay, there are a fair number of people that actually didn't get any time off", "start": 2178.51, "duration": 3.569}, {"text": "I'm going insane looking at my feet and realizing that every invited creator already published. He's like", "start": 2182.08, "duration": 5.58}, {"text": "Are you doing video? Yeah. Oh cool, but I'm like midway through the script", "start": 2188.51, "duration": 4.039}, {"text": "I never when science studio had it like hours after event was done. I know how", "start": 2192.55, "duration": 4.11}, {"text": "Even yeah, he's crazy. He's crazy", "start": 2197.21, "duration": 1.97}, {"text": "I've actually been watching every single video about LTX just cuz like and feel free to say negative things to", "start": 2199.18, "duration": 6.089}, {"text": "Everyone's been super positive which has been awesome, but that's actually not helpful", "start": 2205.52, "duration": 3.59}, {"text": "Because we need to no way do better next year fair", "start": 2210.17, "duration": 2.989}, {"text": "We'll have like got like a roast so in bed at the end, okay, perfect actually sounds very helpful", "start": 2213.16, "duration": 5.369}, {"text": "Anyway, he wanted to stop and watch the win show in person", "start": 2218.53, "duration": 3.0}, {"text": "So I was like yeah cool good think think thanks for allowing me because they are creepily from a corner", "start": 2222.11, "duration": 5.63}, {"text": "I kind of like it when people watch", "start": 2227.74, "duration": 2.0}, {"text": "Anyway, you could you can you can send leave back in you should probably do our sponsor spots now", "start": 2230.18, "duration": 4.25}, {"text": "I don't know what happened on YouTube, but we dropped", "start": 2234.43, "duration": 2.849}, {"text": "10,000 viewers from 548 to", "start": 2238.19, "duration": 3.29}, {"text": "553 do you guys hate us talking about merch that much?", "start": 2242.36, "duration": 3.56}, {"text": "Be a problem anymore. Oh is elemental moving? Okay Oh", "start": 2247.25, "duration": 4.5}, {"text": "Nobody's watching cuz they're all busy buying cheap t-shirts", "start": 2257.16, "duration": 3.11}, {"text": "We can't do that", "start": 2273.57, "duration": 2.0}, {"text": "Alright, thanks Nick we should probably also talk through our spawn so hold on hold on wait", "start": 2276.66, "duration": 5.33}, {"text": "Okay, what you got to do this now, or should we wait and see if it's gonna come back again?", "start": 2281.99, "duration": 3.36}, {"text": "Um, let's do it knows there's an interesting drop here eeep off foxes in the chat says the underwear super comfy", "start": 2285.35, "duration": 6.599}, {"text": "Oh good set it live in the chat. Nice. Yeah. Okay, so that leads us perfectly into some floatplane news", "start": 2291.95, "duration": 6.39}, {"text": "This is kind of a big deal flow plane for Linus Media Group is getting more expensive", "start": 2298.88, "duration": 5.55}, {"text": "So there's gonna be a couple of stages of this stage one. It is going from $3 to", "start": 2304.43, "duration": 5.34}, {"text": "$5 for the basic", "start": 2310.53, "duration": 1.98}, {"text": "early access to Linus media group stuff", "start": 2312.51, "duration": 2.51}, {"text": "There's also some like behind-the-scenes staffs and butene videos some cool stuff like that that's going from three to five dollars", "start": 2315.57, "duration": 6.079}, {"text": "The reason for that is that three dollars just it doesn't make sense", "start": 2321.65, "duration": 4.2}, {"text": "From a content creator standpoint from a floatplane standpoint so much of that $3", "start": 2326.76, "duration": 4.969}, {"text": "It's just going to payment processing it technically doesn't make a difference for flow plain side of things. Oh, that's actually true", "start": 2331.73, "duration": 5.159}, {"text": "So it's mostly for the content creators, so you know what?", "start": 2336.89, "duration": 3.18}, {"text": "I think it probably I should probably just go pretty deep inside baseball in this shouldn't I sure? Okay. So here's the thing", "start": 2340.07, "duration": 6.359}, {"text": "Flow plane is able to survive on a fairly slim take", "start": 2348.0, "duration": 4.61}, {"text": "but right now we're asking the content creator to also take a very slim take and", "start": 2353.55, "duration": 5.179}, {"text": "The reason for that was because we we built that $3.00 pricing model back when floatplane was", "start": 2358.83, "duration": 6.379}, {"text": "Basically broken like it would it would frequently not work AJ's like yeah", "start": 2365.79, "duration": 6.199}, {"text": "So the message to our supporters was thank you guys so much", "start": 2373.01, "duration": 4.86}, {"text": "But also we're not comfortable charging you any more than this for this service because it might be broken", "start": 2378.54, "duration": 6.859}, {"text": "10% of the time. We don't know we're trying really hard over here, but we know that it's kind of jank", "start": 2385.619, "duration": 5.27}, {"text": "so so that was where that pricing came from also because Linus media group and", "start": 2392.01, "duration": 5.27}, {"text": "Floatplane Inc. Have some significant overlap in their investors and management", "start": 2397.92, "duration": 5.9}, {"text": "You know", "start": 2404.49, "duration": 0.619}, {"text": "We struck a really amazing deal where everyone kind of took one for the team", "start": 2405.109, "duration": 3.9}, {"text": "And as long as we could get anyone to subscribe on it", "start": 2409.01, "duration": 2.609}, {"text": "That would really help us keep our burn rate down and support the project without going out and seeking outside investment", "start": 2411.619, "duration": 6.36}, {"text": "Which would have other controlling interest coming in and telling us what to do is gross really unpleasant", "start": 2417.98, "duration": 4.199}, {"text": "Or you know asking our community to like kick started or something stupid like that", "start": 2422.91, "duration": 3.919}, {"text": "Like we didn't wanna do anything stupid", "start": 2426.829, "duration": 2.04}, {"text": "We wanted to do a slow sustainable build", "start": 2428.869, "duration": 2.1}, {"text": "and", "start": 2431.46, "duration": 0.75}, {"text": "We are at the point now where we are", "start": 2432.21, "duration": 2.149}, {"text": "Confident enough in the product that we are ready to roll out what we consider to be more sensible pricing", "start": 2434.49, "duration": 5.119}, {"text": "So for 1080p video it's going to be five bucks a month", "start": 2439.77, "duration": 3.349}, {"text": "For all of LMGs channels. Oh, yeah, right one of the other reasons we are bringing more creators onto the platform now and", "start": 2443.64, "duration": 5.959}, {"text": "LMGs content output as a", "start": 2450.119, "duration": 2.0}, {"text": "25-person team is not fair", "start": 2452.7, "duration": 2.449}, {"text": "If we're doing that at $3, it's going to put pressure on other creators", "start": 2455.88, "duration": 3.68}, {"text": "Their prices not that you should actually compare", "start": 2460.26, "duration": 2.419}, {"text": "Different creators pricing on flipping that also doesn't make it but it's a bad look", "start": 2463.319, "duration": 4.25}, {"text": "Yeah", "start": 2467.569, "duration": 0.481}, {"text": "and it kind of looks like", "start": 2468.05, "duration": 1.15}, {"text": "Linus Media Group has some kind of advantage like maybe it's getting a 100 percent deal or something like that when in actuality it is", "start": 2469.2, "duration": 6.619}, {"text": "not so", "start": 2475.819, "duration": 2.0}, {"text": "So the e plus Fox?", "start": 2477.93, "duration": 2.0}, {"text": "Science studio and ufd Tech are all signed on the Inc is hardly dry. I", "start": 2479.97, "duration": 6.02}, {"text": "Yeah, yeah, there's also other creators that are joining", "start": 2486.569, "duration": 2.9}, {"text": "The only reason why we're naming these three is these are the three that have like signed contracts and put channels on", "start": 2489.47, "duration": 6.33}, {"text": "You just can't subscribe to them yet. Yeah, epoch is like", "start": 2495.8, "duration": 2.699}, {"text": "Super ready? Yeah, and in the chat right now and like hey, he's the only we've just been holding him back a little bit", "start": 2499.26, "duration": 6.679}, {"text": "So that LMG can do the $5 switch and stuff. So that optics aren't a little weird", "start": 2505.94, "duration": 4.02}, {"text": "That's the only reason he's been ready for like like two weeks now actually way longer than that", "start": 2509.96, "duration": 4.29}, {"text": "He's been on the platform for like two weeks now. Yep", "start": 2514.25, "duration": 2.279}, {"text": "So so the $5 switch is to make sure that it's not bad optics for other Creators", "start": 2516.529, "duration": 6.3}, {"text": "And also make sure that I mean like the discussion we had around vessel make sure that it actually makes sense", "start": 2522.829, "duration": 5.61}, {"text": "To support these kind of these two separate audiences in these two separate communities this way", "start": 2528.869, "duration": 4.76}, {"text": "The second change that is going to take place is sometime in the near ish future each", "start": 2534.569, "duration": 5.12}, {"text": "Lynas media group channel is going to be split out into a separate float plane channel", "start": 2539.849, "duration": 4.58}, {"text": "And the reason for that again is that we don't want to set a weird unrealistic expectation that $5 a month gets you", "start": 2544.43, "duration": 7.739}, {"text": "all of the tech news you can eat all of", "start": 2553.319, "duration": 2.27}, {"text": "The tech quickie you can eat and all the Linus tech tips", "start": 2555.72, "duration": 2.78}, {"text": "You can eat like literally 13 videos a week of early access when that will not or 11 or whatever", "start": 2558.5, "duration": 5.159}, {"text": "It works out to when that will not be sustainable for other", "start": 2563.66, "duration": 3.659}, {"text": "creators so a couple of things", "start": 2568.019, "duration": 2.72}, {"text": "One if you subscribe to floatplane right now in the next two days", "start": 2571.799, "duration": 4.79}, {"text": "This $5 switch for lmg is going to go live on sunday night", "start": 2577.019, "duration": 4.07}, {"text": "If you do it in the next two days, we will grandfather you man at the existing $3 rate", "start": 2581.089, "duration": 4.65}, {"text": "Thank you for supporting the platform. Appreciate it after that. I have no idea how it works", "start": 2585.74, "duration": 5.189}, {"text": "Once we split things out", "start": 2590.93, "duration": 1.05}, {"text": "What I suspect is that we will leave the $3 rate, but it will probably be $3 per channel", "start": 2591.98, "duration": 6.329}, {"text": "Is there a technical way for us to do that?", "start": 2598.309, "duration": 2.07}, {"text": "That's up to you guys is there a way though you core the grandfathered people only so for the grandfathered people", "start": 2603.42, "duration": 7.159}, {"text": "Oh, yeah. Yeah, there's a way we've been talking about it. You know what that sounds really hard. So here's what we're gonna do instead", "start": 2610.579, "duration": 6.75}, {"text": "So if you sign up now, it's $3 a week", "start": 2618.269, "duration": 2.0}, {"text": "You get the whole LMG thing until we split it out", "start": 2620.42, "duration": 2.25}, {"text": "Then it's three dollars for just ltte", "start": 2622.67, "duration": 1.83}, {"text": "And any changes to your subscription in the future are gonna be have to be at the normal rates on a per channel basis", "start": 2624.5, "duration": 4.799}, {"text": "We have to make the platform sustainable for everyone and that means that we can't really give a special deal to", "start": 2629.43, "duration": 7.01}, {"text": "Ltte subscribers. I haven't actually talked to Kyle and tech deals about this yet", "start": 2636.809, "duration": 5.03}, {"text": "So, I don't know. When do you want to roll things?", "start": 2642.48, "duration": 2.0}, {"text": "So that phone so form is set up in a way that yeah", "start": 2644.48, "duration": 3.04}, {"text": "We aren't actually in between the creator and the user in terms of their agreement. So I", "start": 2647.52, "duration": 3.959}, {"text": "Don't set any price as the platform because your app right now. You're talking is LTTE. Yes, and I'm talking as floatplane Luke. Yes", "start": 2652.18, "duration": 7.459}, {"text": "whatever", "start": 2661.06, "duration": 1.16}, {"text": "So as the platform, I don't set any", "start": 2662.22, "duration": 2.25}, {"text": "Prices for any craters they set whatever they want. Someone could come in and be like, yeah, I make one video every", "start": 2664.99, "duration": 5.33}, {"text": "742 days and it costs", "start": 2671.53, "duration": 2.51}, {"text": "$50,000 a month to subscribe to my thing. I'd be like hey, so it doesn't make any sense", "start": 2674.92, "duration": 5.449}, {"text": "But they could do it if they wanted that's totally up to them", "start": 2681.22, "duration": 3.62}, {"text": "all right, so", "start": 2686.08, "duration": 2.0}, {"text": "Can I spit some hot fire for a second? Sure, you're totally welcome to join", "start": 2688.21, "duration": 4.34}, {"text": "I just noticed you're on nebula and I was like, oh, I don't know what this means. So oh, yeah", "start": 2692.85, "duration": 4.679}, {"text": "you don't have to talk about it now if that's yeah and uncomfortable just", "start": 2698.35, "duration": 3.8}, {"text": "Invite us out. That's all if you don't want talking with it's totally cool. We should do one more quick topic here", "start": 2703.03, "duration": 6.709}, {"text": "what to expect from Samsung's unpacked", "start": 2711.07, "duration": 2.3}, {"text": "It's August 7th in Brooklyn. I didn't get an invite so you don't expect me to be there", "start": 2714.01, "duration": 4.91}, {"text": "But it's gonna be the Galaxy Note 10-4 expecting a plus or a pro model with an even larger screen", "start": 2719.32, "duration": 5.36}, {"text": "6.8 inches instead of 6.3. Can I point out that 6.8 inches is dangerously close to tablet size", "start": 2724.87, "duration": 6.229}, {"text": "Look at the Google Nexus tablet. Yeah", "start": 2731.1, "duration": 2.219}, {"text": "Hasn't there been tablets that are that exact size are smaller like 7 inches. Yeah. Yeah. Oh, yeah", "start": 2734.35, "duration": 5.209}, {"text": "Anyway, it'll have a time-of-flight sensor, which is cool", "start": 2740.44, "duration": 3.5}, {"text": "I guess 43 hundred million power battery 12 gigs of RAM possibly a Snapdragon 855. Plus there could be a 5g model", "start": 2743.94, "duration": 6.119}, {"text": "we're also expecting a galaxy watch active 2 with ECG detection fall monitoring and", "start": 2750.06, "duration": 4.5}, {"text": "We're expecting the removal of the spinning bezel in favor of touch", "start": 2754.87, "duration": 2.989}, {"text": "Possibly we'll get a more specific release date for the Galaxy fold as well, man", "start": 2758.62, "duration": 4.129}, {"text": "Wouldn't that have been embarrassing if they made it all the way to the next phone launch without even knowing when the fold is launching?", "start": 2762.75, "duration": 4.95}, {"text": "So there's a significant amount of 6.5 inch tablets. Yeah. Yeah. Yeah. Oh here. Hold on", "start": 2767.7, "duration": 5.129}, {"text": "Ever get amounted tablets, that would be cheaper or sorry smaller than that", "start": 2774.19, "duration": 4.129}, {"text": "Definitely definitely definitely a seaport. I did mean", "start": 2779.48, "duration": 3.229}, {"text": "Speaking of speaking of cheaper", "start": 2784.49, "duration": 2.0}, {"text": "Savage jerky, it's not cheaper, but it's definitely delicious. Yes savage jerky", "start": 2787.31, "duration": 4.85}, {"text": "is handcrafted in small batches and uses the highest quality ingredients to create a high quality product that oh", "start": 2792.8, "duration": 5.719}, {"text": "There's a little bit of maple buffalo bacon in here a high quality product that without the need for nitrates or preservatives", "start": 2798.52, "duration": 5.699}, {"text": "That's delicious and isn't bad for your home. There isn't no wait. There's one little piece. Oh, I'm so excited. Mmm", "start": 2804.23, "duration": 6.08}, {"text": "They have 13 different flavors", "start": 2810.49, "duration": 2.0}, {"text": "from their sweet teriyaki to their intense spicy Carolina Reaper, and they also make hot sauces barbecue sauces and even a spice rub", "start": 2813.2, "duration": 6.68}, {"text": "It's delicious stuff news offer code LTT to save 10% on their products at LM GG g savage jerky", "start": 2820.31, "duration": 6.53}, {"text": "Also exciting display", "start": 2828.77, "duration": 2.0}, {"text": "Yeah", "start": 2830.96, "duration": 1.2}, {"text": "Make your balls look awesome with displayed", "start": 2832.16, "duration": 2.0}, {"text": "Their posters but they're made of metal. They're three millimeters thick. They have been Tanja's so you won't cut yourself", "start": 2834.89, "duration": 4.669}, {"text": "We've got a matte finish with a magnetic wall mounting system", "start": 2839.87, "duration": 3.02}, {"text": "that makes it super easy to mount them make small adjustments if they're crooked or whatever else the case may be and", "start": 2843.83, "duration": 5.0}, {"text": "Swap them out for any of the other", "start": 2848.9, "duration": 2.0}, {"text": "260,000 different designs that are available over on display for each display sold", "start": 2852.11, "duration": 4.639}, {"text": "They plant 10 trees they offer hassle-free returns and they are pre gift packed", "start": 2856.75, "duration": 4.05}, {"text": "Use code ltte to save 15%", "start": 2861.47, "duration": 2.27}, {"text": "so go to LM GG g display twin finally the show is brought to you by Pei a", "start": 2864.56, "duration": 4.79}, {"text": "Private Internet access doesn't actually pass for these spots. It's an affiliate program. So I'm gonna go really fast", "start": 2869.66, "duration": 4.789}, {"text": "It's P ia go get it", "start": 2874.69, "duration": 1.74}, {"text": "If you don't have a VPN already five devices at once lots and lots of devices supported windows Android stuff", "start": 2876.43, "duration": 6.0}, {"text": "Look at this. This has been in my talking points for P", "start": 2883.04, "duration": 2.87}, {"text": "Ia for literally the entire time we worked with them, which is over a year now", "start": 2885.91, "duration": 3.839}, {"text": "Yeah", "start": 2890.27, "duration": 1.74}, {"text": "That's still in there. It works on. I'm waiting - I'm actually I've just been waiting. I haven't said anything", "start": 2892.01, "duration": 4.4}, {"text": "I've been waiting to see if Colton or Johnno will ever fix it. You should get your own distro so far. No", "start": 2896.48, "duration": 6.44}, {"text": "Linus Linux I", "start": 2904.46, "duration": 2.0}, {"text": "Love it. Can you make can you make make it so is that the kind of thing that I can just kind of live?", "start": 2906.59, "duration": 4.489}, {"text": "Okay, it sounds like more work than that. Yeah, ah, actually, I don't really think so", "start": 2911.97, "duration": 5.359}, {"text": "Well, probably not because all you have to do is just like take a bun too and just be like repackage", "start": 2917.52, "duration": 3.8}, {"text": "Yeah, loo bun too. In fact, I think it'll bun too. There's another thing hold on a minute", "start": 2921.32, "duration": 3.719}, {"text": "Yep, loo bun too is already okay then shaking his head", "start": 2927.81, "duration": 6.14}, {"text": "All right, Google was ordered to halt human review of voice recordings", "start": 2938.31, "duration": 5.06}, {"text": "The source here is coral I on the forum and also techcrunch.com where the actual original source came from", "start": 2943.37, "duration": 6.06}, {"text": "Yeah, so a German privacy watchdog has ordered Google to cease", "start": 2949.43, "duration": 3.659}, {"text": "- I let to", "start": 2954.03, "duration": 2.0}, {"text": "Manual review of audio snippets generated by its voice AI dang it put not what'swhat's the German one. I", "start": 2961.29, "duration": 7.219}, {"text": "Know attention. Let's stop", "start": 2969.21, "duration": 2.0}, {"text": "Stop in German", "start": 2971.85, "duration": 2.0}, {"text": "German I should know this I really should", "start": 2975.15, "duration": 2.449}, {"text": "Oh, well, we already said home. Well, it sounds the a is a little bit more. Yeah, I'm sure yeah", "start": 2979.02, "duration": 5.09}, {"text": "So this fall is a leak last month of scores of audio snippets from the Google assistant service", "start": 2985.83, "duration": 4.429}, {"text": "So a contractor working as a Dutch language reviewer handled more than a thousand recordings", "start": 2990.26, "duration": 3.78}, {"text": "Are handed more than a thousand recordings to the Belgian news site VRT?", "start": 2994.14, "duration": 3.679}, {"text": "Which was then able to identify some of the people in the clips?", "start": 2997.82, "duration": 2.82}, {"text": "It reported being able to hear people's addresses discussions of medical conditions and recordings of a woman in distress", "start": 3000.8, "duration": 5.87}, {"text": "article 66 of the DD a PR to begin an", "start": 3007.82, "duration": 2.81}, {"text": "urgency procedure allows a DPA to order data", "start": 3011.39, "duration": 2.839}, {"text": "Processing to stop if it believes there's an urgent need to act in order to protect the rights and freedoms of data subjects", "start": 3014.42, "duration": 5.3}, {"text": "so Google says it responded on July 26th and already sees the practice taking the decision to manually suspend audio reviews of Google assistant across", "start": 3020.51, "duration": 7.4}, {"text": "The whole of Europe and doing so on July 10th after learning at the data leak", "start": 3027.91, "duration": 3.329}, {"text": "So you're saying article 66 is causing voice record reviewing to cease to exist", "start": 3031.51, "duration": 5.13}, {"text": "Really weird referential joke that no-one's going to get. All right", "start": 3037.37, "duration": 3.32}, {"text": "Disappointed no, I'm sorry. I actually wasn't listening. Oh, let's try we can order 66 joke", "start": 3043.96, "duration": 4.459}, {"text": "I don't actually know what order 66 even is. Not a Star Wars thing. Don't leave a Jedi", "start": 3048.42, "duration": 4.5}, {"text": "Alright, yeah. Okay. I'm sorry. It was a bad joke. Anyways, yeah", "start": 3053.53, "duration": 3.439}, {"text": "Google says manual reviews of Google assistant queries are a critical part of the process of building speech technology that new", "start": 3060.069, "duration": 6.17}, {"text": "I feel like there is stuff that they could do to properly anonymize it though", "start": 3067.03, "duration": 4.309}, {"text": "What I feel like is interesting, but why don't they just like like shift it?", "start": 3071.339, "duration": 3.51}, {"text": "Like pitch shifted voice changer. Yeah", "start": 3075.49, "duration": 2.119}, {"text": "Why aren't they doing this to all the other ones why is it just Google I", "start": 3079.42, "duration": 2.6}, {"text": "Don't know", "start": 3083.14, "duration": 0.87}, {"text": "that's the weirdest thing I found on this with that said Apple is", "start": 3084.01, "duration": 3.439}, {"text": "Suspending a similar human review quality control program for its Siri voice", "start": 3087.88, "duration": 3.86}, {"text": "Assistant doesn't seem to be a link to any sort of regulatory order. Okay, but", "start": 3091.869, "duration": 4.1}, {"text": "Yeah, I guess it does follow a report last week that contractors working for Apple regularly hear confidential details on Siri recordings", "start": 3096.67, "duration": 7.669}, {"text": "such as audio of people having sex and", "start": 3104.41, "duration": 2.27}, {"text": "Identifiable financial details regardless of the processes Apple uses to anonymize the records. Yeah", "start": 3107.23, "duration": 5.449}, {"text": "Apple on the other hand has actually suspended these manual reviews worldwide", "start": 3113.41, "duration": 4.28}, {"text": "Okay, um, what else do we have going on here? There's huge ads in space, which is just kind of like", "start": 3118.24, "duration": 6.079}, {"text": "Silly, whoa. You can play Diablo in a web browser. Let's do it now", "start": 3124.93, "duration": 4.489}, {"text": "So hold on just a ticking minute here. This is pretty cool because it's the demo. Oh my goodness. Look at this ad", "start": 3130.24, "duration": 6.709}, {"text": "Oh", "start": 3138.94, "duration": 2.0}, {"text": "Extreme tech so the other article is that there's gonna be ads in space. So extreme tech is definitely on board without", "start": 3141.069, "duration": 6.29}, {"text": "That that is not an actual book. So", "start": 3148.299, "duration": 2.81}, {"text": "It's only the demo. It's the shareware version of the game. But if you have a copy of Diablo and you find you're", "start": 3151.66, "duration": 6.5}, {"text": "diabetic", "start": 3158.68, "duration": 1.379}, {"text": "You file if you dabble and drag and drop it into the window you unlock the full game. No way", "start": 3160.059, "duration": 6.26}, {"text": "Really cool. Okay. Can we can we just play this? Where's the link just go to?", "start": 3169.299, "duration": 4.07}, {"text": "Riff softs website, please. Sure. We're there we go. Okay. We are playing we are playing Diablo right now. Where's my backpack?", "start": 3175.059, "duration": 6.86}, {"text": "You know, it's amazing. Ella flow plane was landing in the LMG lounge after hours one night. Yeah, and we plays yeah, but one", "start": 3181.93, "duration": 7.369}, {"text": "Like on this three of us not on this no. Oh my goodness", "start": 3190.0, "duration": 3.859}, {"text": "multiplayer is incredible", "start": 3195.19, "duration": 2.03}, {"text": "Okay, well I'm gonna have to do a sorcerer really did you play sorcerer it's hard, oh that's right you can't in that", "start": 3199.18, "duration": 7.459}, {"text": "No, you can't in the demo. You can only play warrior", "start": 3206.64, "duration": 1.979}, {"text": "It's ok warriors kind of better, you know, so one thing that was brutal. We all played this friendly fire is on", "start": 3208.619, "duration": 6.3}, {"text": "So the the broke actually has a bow and shoot your teammates in the back all the time. It's really brutal. I", "start": 3215.589, "duration": 6.62}, {"text": "killed you ki I", "start": 3222.819, "duration": 2.0}, {"text": "Didn't I didn't know as possible. Wow", "start": 3225.19, "duration": 2.359}, {"text": "that was shooting and I saw his character flinching but I was like, oh", "start": 3228.22, "duration": 2.929}, {"text": "He must just be getting hit by something else then he died and it was definitely me. I felt really bad. I", "start": 3231.15, "duration": 5.159}, {"text": "Can't you know what?", "start": 3237.88, "duration": 2.0}, {"text": "Wow", "start": 3241.029, "duration": 1.5}, {"text": "That looks like about exactly how it's supposed to look. Yeah. Hello my friends the well is poisoned already", "start": 3242.529, "duration": 5.66}, {"text": "I got to go get the butcher", "start": 3248.19, "duration": 2.0}, {"text": "Talk to kit what really? I don't remember it being quite this cut down", "start": 3251.349, "duration": 4.489}, {"text": "This is the shareware version. Did you play the demo back in the day? Yeah. Mmm I did before I got it", "start": 3256.869, "duration": 5.239}, {"text": "I don't remember the demo I", "start": 3262.109, "duration": 2.0}, {"text": "Remember my mind being blown when I found out that you could just hold down the mouse button and you just walked towards it forever", "start": 3264.369, "duration": 5.87}, {"text": "Instead of having to click all the time. Yeah one thing that kind of hurt me going back to this game", "start": 3270.73, "duration": 4.939}, {"text": "So recently was that you can still do the tab thing mob loading times. Sorry, I'm listening", "start": 3275.71, "duration": 6.02}, {"text": "You can still do the tab thing to permanently show your map on the screen which really helps with dungeon navigation", "start": 3281.73, "duration": 4.469}, {"text": "Yeah, but I don't think it has the show item thing", "start": 3286.2, "duration": 3.03}, {"text": "I believe that was holding alt and it like named all the items that were on the ground", "start": 3289.23, "duration": 3.449}, {"text": "I made it really easy to pick them up", "start": 3292.68, "duration": 1.81}, {"text": "So like staves and stuff are actually really hard to see because it's just a stick", "start": 3294.49, "duration": 5.179}, {"text": "Not so, you're really hardly I never knew about that feature at all", "start": 3301.48, "duration": 2.719}, {"text": "So I always just would find stuff because I can see and I have eyes that well know that feature was I think it came", "start": 3304.2, "duration": 5.219}, {"text": "In in d2. Oh", "start": 3309.42, "duration": 1.29}, {"text": "Okay. Yeah that explains so I never played Diablo 2. I only play really game. Yeah d2 was really good. Yeah amazing", "start": 3310.71, "duration": 6.349}, {"text": "I tried to get into it like years later and that's probably gonna be hard", "start": 3317.299, "duration": 3.81}, {"text": "It was not it was not actually a very good time", "start": 3321.109, "duration": 2.429}, {"text": "Yeah back in the day though back d2 was amazing back in the day back in the day", "start": 3323.72, "duration": 5.339}, {"text": "There's my maps, you know d2 is what got me into computers right? Heli", "start": 3329.089, "duration": 3.57}, {"text": "Yeah, cuz I've told this story a few times because the computer I used to play d2 on stopped working", "start": 3332.66, "duration": 4.199}, {"text": "I was like well, okay I ought to fix that is twitch gonna kick me out of the partner program", "start": 3336.859, "duration": 3.929}, {"text": "I am technically game streaming on YouTube right now. Yeah. Oh", "start": 3340.789, "duration": 3.39}, {"text": "shoot", "start": 3345.359, "duration": 1.771}, {"text": "Well me and abroad yeah, yeah", "start": 3347.13, "duration": 2.689}, {"text": "We're mixer. We're done tight. Yep, 10. We're going to mix the kids", "start": 3350.579, "duration": 4.429}, {"text": "Just kidding that ain't happenin", "start": 3355.829, "duration": 2.0}, {"text": "Alright, I mean you could you already stream on three other part remember when games were hard like when you opened your inventory and like", "start": 3358.799, "duration": 6.44}, {"text": "Stuff just kept attacking you and stuff. Yeah, I love when you pick up armor. That's almost destroyed already. That's like super awesome", "start": 3365.25, "duration": 7.609}, {"text": "This is this is the best to a wager supposed to be mad", "start": 3375.15, "duration": 3.56}, {"text": "Yeah. Yeah. I'm just playing Diablo 1 yo with a touchpad which by the way is not animal traits", "start": 3380.099, "duration": 5.75}, {"text": "We like we like to have it set up in the land center if you just want to go play there", "start": 3388.2, "duration": 4.28}, {"text": "Oh, man, I'm kind of tempted. Yeah, I don't know what's going on tonight, though", "start": 3392.48, "duration": 3.689}, {"text": "I think I'm gonna have to like actually see my kids cuz we had LTX this weekend stuff those waters", "start": 3396.17, "duration": 4.469}, {"text": "Those walking corpses cuz they're cool deal a lot of damage, dude", "start": 3400.829, "duration": 3.439}, {"text": "This game is hard this guy so my kids are never gonna watch this garbage", "start": 3404.309, "duration": 5.12}, {"text": "It's really hard we were playing in my god", "start": 3411.089, "duration": 2.449}, {"text": "I died at least once just because like the other thing too is if you can cuz you're new I", "start": 3413.539, "duration": 4.89}, {"text": "Probably put are spoiled by your diablo 2. Yeah, if you're out of health", "start": 3418.529, "duration": 4.37}, {"text": "Potions and you're go low on health. You have to walk all the way back. Yeah until you get like scrolls in town", "start": 3423.45, "duration": 6.8}, {"text": "Go annoy that third or fourth. Yeah level like it's like holy crap. Yeah, it's pretty it's pretty done", "start": 3430.25, "duration": 6.539}, {"text": "It's like kinda jank even with the whole press thing. Yeah, I know a little", "start": 3436.98, "duration": 4.429}, {"text": "Hold press is more for like walking around in town if you can call it a town", "start": 3441.99, "duration": 4.12}, {"text": "There's like four people that live in it. Oh", "start": 3446.11, "duration": 2.879}, {"text": "You have a demon problem. Why don't you move? Yeah, but uh all six of you you build like two cards. Yep, probably good", "start": 3450.41, "duration": 7.609}, {"text": "They literally have a cart that like the the peg leg boy stands next to why don't you all just get in it?", "start": 3458.02, "duration": 5.699}, {"text": "Yeah, and go somewhere else. Yeah, and why do they have such a gigantic like Church? Yeah", "start": 3463.72, "duration": 6.39}, {"text": "Yeah, maybe everyone died. Oh", "start": 3470.21, "duration": 2.36}, {"text": "That's sad. All right. So thanks for tuning in to the man show. We'll see you again next week. Same bat-time same bat-channel", "start": 3473.99, "duration": 4.699}, {"text": "Russians are trying to put ads in space also alphabet overtakes Apple as the world's most cash-rich company. Yeah. Bye see ya. Oh", "start": 3480.11, "duration": 6.709}, {"text": "No, super chats. Oh did we say that? I didn't stop yet. Nice. Nice", "start": 3487.46, "duration": 5.69}, {"text": "Okay, here we go Luke, and his minions makes me sound evil Thanks", "start": 3493.4, "duration": 3.889}, {"text": "QH", "start": 3497.96, "duration": 1.32}, {"text": "Ti9 that doesn't sound evil at all", "start": 3499.28, "duration": 2.0}, {"text": "Marco's Marcos MOS - looks like the guy who got hit by the truck in the Bride of Chucky movie", "start": 3501.65, "duration": 5.809}, {"text": "It was good to see you and she'll live last week at LTX, I was really far genuinely. Thanks", "start": 3511.16, "duration": 4.429}, {"text": "Ya meal production says this is my first time seeing the intro. I've been listening on Apple podcasts for over a year. Wow, really?", "start": 3515.59, "duration": 6.899}, {"text": "Interesting. You're you're the guy", "start": 3523.04, "duration": 2.12}, {"text": "Wow", "start": 3526.64, "duration": 1.38}, {"text": "Neat and now it now it's three people. Yeah. Yeah a broken TV says you're now two dollars closer to cashing out via adsense", "start": 3528.02, "duration": 7.489}, {"text": "We get over our threshold adcentre pretty regular than so. It's just an extra two dollars. But thank you Bruce you Jake says story", "start": 3536.42, "duration": 7.43}, {"text": "Went on", "start": 3544.64, "duration": 0.75}, {"text": "Vacation and took a bunch of pics went to edit pics and when I put the card into the PC it told me to format", "start": 3545.39, "duration": 5.479}, {"text": "Somehow lost all pics freaked out found easy OS used it works two days later. Saw an ads thought on a vid", "start": 3551.0, "duration": 6.59}, {"text": "coincidence", "start": 3558.11, "duration": 2.0}, {"text": "Neat", "start": 3561.41, "duration": 2.0}, {"text": "You know, what a cool story yeah, Jeremy says use this for LTX 2020", "start": 3563.57, "duration": 4.879}, {"text": "It's 20 bucks many thanks to the entire team. You are very welcome. Robert had a great time at LTX 19", "start": 3568.45, "duration": 5.67}, {"text": "It's grown so much from LTX 18 LC was more fun", "start": 3574.16, "duration": 3.52}, {"text": "That I though it was going to be then I thought it was going to be people who are amazing highlight of LTX was driving", "start": 3578.32, "duration": 5.96}, {"text": "Linus to the Convention Center after his ride left him at headquarters", "start": 3584.28, "duration": 3.359}, {"text": "I saw that can't wait for LTX company trying to find him cuz he didn't have his car", "start": 3587.64, "duration": 4.62}, {"text": "So I had like a couple different potential solutions I go outside and he's just like hey", "start": 3592.26, "duration": 4.02}, {"text": "I'm in here from the back of some random car. I'm like, okay got a ride back to the convention. Don't get kidnapped. Have fun", "start": 3596.28, "duration": 5.25}, {"text": "Gabriel says thanks for the i7 the LTX flasher. Oh, yeah. Yeah", "start": 3602.2, "duration": 4.939}, {"text": "Like basically ripped off his shirt to get a core i7", "start": 3608.65, "duration": 2.39}, {"text": "What is it Nick Oh", "start": 3613.93, "duration": 2.0}, {"text": "Nick has a merch update for us", "start": 3617.23, "duration": 2.0}, {"text": "Sure, why don't you tell us how many elementals we sold in last 20 minutes?", "start": 3621.49, "duration": 3.679}, {"text": "Okay, I have to guess well, he already told me some people are buying like eight at a time", "start": 3627.52, "duration": 3.079}, {"text": "yes, so I'm gonna say I'm gonna say", "start": 3630.64, "duration": 2.929}, {"text": "200 shirts. Oh", "start": 3634.69, "duration": 1.86}, {"text": "No", "start": 3636.55, "duration": 1.2}, {"text": "Way more than that. I don't know", "start": 3637.75, "duration": 2.0}, {"text": "My first number was like 1,200. Well, no", "start": 3640.63, "duration": 2.719}, {"text": "We sold 600 shirts in the last twenty", "start": 3648.67, "duration": 2.51}, {"text": "Straight-up, this is like an efficient use of money if you want a comfy shirt. It's not even likewhat for comfy shirts", "start": 3656.38, "duration": 6.679}, {"text": "Yeah, but seriously like they're nice shirts. So that's why I thought so high. It's cuz like", "start": 3663.06, "duration": 6.3}, {"text": "It's pretty logical. Even if you're not that into the design, it just kind of makes sense. Okay?", "start": 3670.15, "duration": 5.179}, {"text": "And the design is nice. There's nothing wrong design. It's joy. It's great", "start": 3676.36, "duration": 4.4}, {"text": "Yeah, they're just not quite as like really cool as the other ones. They're cool", "start": 3680.76, "duration": 4.469}, {"text": "Yeah", "start": 3685.93, "duration": 1.02}, {"text": "This is great. Okay, so Tully page says LTX was awesome, very", "start": 3686.95, "duration": 4.729}, {"text": "Disappointing the NVIDIA GeForce garage PC won Best in Show at a LAN when everyone else your fans brought their own computers", "start": 3692.23, "duration": 6.29}, {"text": "Winner wish our runner-up was chosen judge them separate. So the", "start": 3698.83, "duration": 3.86}, {"text": "Best-looking PC got a booby prize", "start": 3703.45, "duration": 2.149}, {"text": "so we actually kind of did that on purpose you get a ribbon you get nothing and if I remember", "start": 3706.33, "duration": 5.699}, {"text": "Credit. Oh really? Yeah. I was just a ribbon. Yeah, but it's nice. It was Bart's okay", "start": 3712.67, "duration": 5.81}, {"text": "But yeah, we have we actually did that just to like troll them", "start": 3719.54, "duration": 3.439}, {"text": "Yeah, cuz the prize was nothing everyone else got cool prizes like the janky-ass and all that other stuff", "start": 3723.2, "duration": 4.64}, {"text": "So we there was a method to the madness and he was cool about it", "start": 3727.84, "duration": 3.449}, {"text": "Yeah", "start": 3731.96, "duration": 1.29}, {"text": "question for senpai Luke from executive", "start": 3733.25, "duration": 2.27}, {"text": "How does Linus feel about his name being pronounced with the first syllable like Linux like lineThe we would", "start": 3735.52, "duration": 6.09}, {"text": "Yeah, so people pronounce my name in all kinds of different ways. I don't know why you would ask him", "start": 3742.76, "duration": 4.189}, {"text": "I don't know either. I've never seen you negatively react to that. I've seen it happen", "start": 3746.95, "duration": 3.69}, {"text": "Yeah, little Li news is the French way people just say like that. Yeah", "start": 3750.94, "duration": 3.39}, {"text": "Andrew says LTT. No in Vitek es city - LTX r.i.p. Ok, we are gonna invite more people next year", "start": 3756.17, "duration": 6.14}, {"text": "We were so far beyond our original creator budget. It was not even funny. Yeah", "start": 3762.31, "duration": 3.51}, {"text": "Corey says LTX was awesome. Hashtag VIP", "start": 3766.67, "duration": 2.6}, {"text": "Bartly richard says what kind of car should I get?", "start": 3770.48, "duration": 2.33}, {"text": "Wow, you aren't totally the wrong stream dude, we said if he hates driving, um,", "start": 3773.72, "duration": 4.31}, {"text": "I hate driving and being in cars with all my heart currently have a slam", "start": 3778.03, "duration": 4.919}, {"text": "2002 PT loser maybe that is what that car should have been cut like maybe that's why you hate driving", "start": 3783.44, "duration": 5.66}, {"text": "Did you sell your Lambo I would do a trade if you could be into it", "start": 3789.1, "duration": 3.869}, {"text": "My lambo was no more fun than your PT loser", "start": 3792.97, "duration": 3.18}, {"text": "I guarantee you that if you hate driving, maybe you should get a scooter", "start": 3796.15, "duration": 5.369}, {"text": "Ok, or a moped. Nice", "start": 3802.22, "duration": 3.739}, {"text": "They're different. I'm trying. Yep", "start": 3807.41, "duration": 2.0}, {"text": "Good shot Andrew why I fell in love with money in the first place. Oh, yes", "start": 3809.98, "duration": 4.229}, {"text": "This must have been back when we were talking about ninja", "start": 3814.21, "duration": 2.219}, {"text": "WMD 240sx, this was a super smart move by ninja he had 14,000 paying subs, which is very low for his view count", "start": 3817.25, "duration": 6.32}, {"text": "Choco taco has the same number of subs and pulls in a fraction of the views that only 7,000 versus 50,000 for a ninja", "start": 3825.23, "duration": 5.87}, {"text": "Okay, that's one way of looking at it the red beard. This is an opinion here", "start": 3831.29, "duration": 4.37}, {"text": "Apparently mixer equals advertisement for Azure and MS cloud business", "start": 3835.66, "duration": 4.049}, {"text": "It's not a bad. It's not a bad way of thinking about it", "start": 3840.25, "duration": 3.149}, {"text": "I don't think so necessarily of yeah, we do want a balls looking at their service. Yeah", "start": 3843.43, "duration": 3.75}, {"text": "I'm sure it does accomplish that I don't think that's the main goal", "start": 3847.18, "duration": 2.729}, {"text": "Everett for vessel comm sends three dollars", "start": 3850.97, "duration": 2.389}, {"text": "We're not. I mean that's part of it 20. We need all the rest", "start": 3854.72, "duration": 6.02}, {"text": "Yeah, go for it guys", "start": 3860.839, "duration": 1.611}, {"text": "Even if you guys sent me twenty thousand dollars", "start": 3862.45, "duration": 2.189}, {"text": "I would spend it on any I would spend it on valve indexes for my staff", "start": 3864.64, "duration": 5.13}, {"text": "Oh, okay. So I'm not even part of my doesn't matter. I want them to have it. Oh wow", "start": 3869.77, "duration": 6.149}, {"text": "I took it home the other day. I", "start": 3876.609, "duration": 2.219}, {"text": "Haven't tried it yet. It's amazing. I should come over. Yes. Why you come over? Okay", "start": 3879.349, "duration": 4.07}, {"text": "They said about my house to knit unless I bring the entire team. I don't care. Okay", "start": 3883.42, "duration": 4.169}, {"text": "I mean, I haven't checked with my wife but like there they would probably love that", "start": 3887.77, "duration": 3.929}, {"text": "I don't I'm not gonna have like food. Okay, we're gonna have to do like skip the digit order. Yeah, okay", "start": 3891.7, "duration": 4.199}, {"text": "Okay. Well, this is a big plan so later. Yeah", "start": 3897.049, "duration": 3.38}, {"text": "I would love to try it. I mean I'll drag all of them along", "start": 3901.069, "duration": 4.19}, {"text": "Says I was hoping for an announcement when you brought up merch about floatplane merge", "start": 3908.569, "duration": 3.8}, {"text": "When do floatplane fan get the option of publicly supporting? We've actually been getting tons of cake quests for this", "start": 3912.369, "duration": 5.729}, {"text": "We need to figure this out because technically creator warehouse is a separate company", "start": 3918.099, "duration": 5.58}, {"text": "So our merch store actually runs as a separate company the idea was that at some point", "start": 3923.68, "duration": 4.409}, {"text": "We could take all the lessons the hard lessons that we're learning about", "start": 3928.43, "duration": 4.189}, {"text": "running a merch business was", "start": 3933.319, "duration": 2.09}, {"text": "Hard lessons and we could convert them into lessons already learned for maybe other creators or something", "start": 3936.619, "duration": 6.65}, {"text": "We don't know what that looks like", "start": 3943.27, "duration": 1.71}, {"text": "Yeah, but we decided to do it as a separate company so that we would have the possibility of pursuing that in the future", "start": 3944.98, "duration": 5.01}, {"text": "Yes, and that's spoiler alert. That's what the full plane self Kansas. So there's technically no reason that creator warehouse", "start": 3949.99, "duration": 7.859}, {"text": "couldn't support floatplane to build a floatplane merch Pacific, but like I feel", "start": 3958.43, "duration": 4.79}, {"text": "Weird maybe what we should do is like", "start": 3964.789, "duration": 2.57}, {"text": "Offer anyone on floatplane the right to use the floatplane design", "start": 3968.329, "duration": 4.31}, {"text": "and sell their own like their own like bit wit ex floatplane merch or something or like", "start": 3972.9, "duration": 4.469}, {"text": "Plain sweet, that would be awesome. I'm super down", "start": 3978.1, "duration": 4.1}, {"text": "I'm also kind of concerned about doing that though because it would have to", "start": 3982.2, "duration": 4.26}, {"text": "We have to approve the design. Yes a working relationship thing with them. Yeah, but that would be cool", "start": 3986.98, "duration": 6.079}, {"text": "Okay", "start": 3993.4, "duration": 0.5}, {"text": "especially some of like the og creators of you don't like the first kind of big set cuz like flow plain doesn't need to make", "start": 3993.9, "duration": 5.699}, {"text": "Money on t-shirts that's not know. I was actually even going to say if we'd have to set up a store I would need", "start": 3999.6, "duration": 5.31}, {"text": "Some shirts anyways, because I want to send shirts to creators of join the platform", "start": 4005.64, "duration": 3.709}, {"text": "Okay, so like I have to hold some in stock regardless", "start": 4009.35, "duration": 2.699}, {"text": "Dmitri says yo any UK merch buyers. How much was the import tax?", "start": 4013.11, "duration": 3.739}, {"text": "I'll have to leave it to some of you guys to answer Dimitri's question there. Um Xavier says yo big apps for low spec gaming", "start": 4016.85, "duration": 6.75}, {"text": "I was just gonna say it didn't even say that they're the guy who donated got it right wise just messed with you", "start": 4026.19, "duration": 5.719}, {"text": "So apparently so you guys know I do I do know his channel name", "start": 4032.81, "duration": 3.63}, {"text": "We got it wrong on the official announcement for creators that were gonna be there. We put low spec game", "start": 4036.81, "duration": 5.719}, {"text": "I think did we leave off gamer?", "start": 4042.53, "duration": 2.0}, {"text": "PR we left off the R. So his discord has been going nuts being like yo. Yo LMG, they don't respect you", "start": 4045.45, "duration": 6.649}, {"text": "Yo, they don't respect you. They don't even know your channel name they suck and it's become kind of a meme on his discord", "start": 4052.1, "duration": 6.12}, {"text": "So that's why I'm that's why I'm like hardcore feeding into it. I do I do know his gentlemen. Um,", "start": 4058.22, "duration": 5.25}, {"text": "Robert says", "start": 4064.23, "duration": 1.83}, {"text": "Linus is right cons need your feedback. Let the mill on the LTTE forum. Totally true. Uh", "start": 4066.06, "duration": 5.15}, {"text": "Okay, we're pretty close to the end so I'm just gonna do some of the bigger ones here", "start": 4072.78, "duration": 2.93}, {"text": "Alex C says long time no see you guys. Hi also screw tablet-sized phones my hands and pockets are too small for them", "start": 4075.71, "duration": 6.329}, {"text": "I'm sorry to hear that", "start": 4082.04, "duration": 1.21}, {"text": "Justin says random Frank P is frakking awesome. Yep", "start": 4083.25, "duration": 3.649}, {"text": "Is that Diablo sound effects, I think so. Oh", "start": 4087.69, "duration": 2.659}, {"text": "That's great. They weren't working before", "start": 4091.17, "duration": 1.94}, {"text": "I don't know we get forgot that it was muted when it went to the sleep. Sweet Windows 10 is amazing. That's what year", "start": 4093.11, "duration": 5.25}, {"text": "Matthew Wu sent fifty dollars and no message Matt. You gotta type your message", "start": 4099.03, "duration": 3.919}, {"text": "Oh", "start": 4103.05, "duration": 0.72}, {"text": "Mark says volunteered at LTX was an incredible experience met a bunch of awesome", "start": 4103.77, "duration": 3.53}, {"text": "People walked over 30 miles in three days and had a blast Wow", "start": 4107.3, "duration": 2.669}, {"text": "Do we have a plan for the volunteers to feed you guys next year? I am so sorry about", "start": 4110.16, "duration": 6.26}, {"text": "Not feeding you guys on Saturday night", "start": 4117.03, "duration": 1.97}, {"text": "It really felt like something we should have done but there was literally no place that we could go that could accommodate all those people", "start": 4119.0, "duration": 5.369}, {"text": "So next year we're planning to just roll catering into the event hall once it closes for the night", "start": 4124.65, "duration": 5.779}, {"text": "And so we're gonna do LMG staff", "start": 4130.43, "duration": 2.25}, {"text": "Creators and their Plus Ones or end or like camera crews or whatever else and our volunteers", "start": 4133.11, "duration": 5.659}, {"text": "also some featured exhibitors Bob and rod didn't manage to share a meal with us until Sunday night which Sasha", "start": 4139.2, "duration": 5.839}, {"text": "And those guys have supported LT acts in so many ways. They are freaking awesome", "start": 4145.8, "duration": 4.819}, {"text": "Also since the beginning since the very beginning since number one, which was a little bit. Yeah", "start": 4150.66, "duration": 5.149}, {"text": "Okay, we are so far over our stream time, yeah, good night guys, we apparently have a dinner party to arrange see you next", "start": 4157.56, "duration": 7.68}, {"text": "Go sub to low spec game on YouTube", "start": 4171.5, "duration": 2.42}, {"text": "*Laugter*", "start": 4173.92, "duration": 2.0}]