[{"text": "There was a time when Japan was the center of game development.", "start": 0.24, "duration": 3.66}, {"text": "We take for granted how the digital age has, in a sense, shrunk the planet.", "start": 4.04, "duration": 4.58}, {"text": "I mean, we now live in a time where getting the next Yakuza or EDF game from Japan", "start": 8.62, "duration": 4.02}, {"text": "is not a matter of if, but when!", "start": 12.64, "duration": 2.68}, {"text": "And that's wonderful!", "start": 15.32, "duration": 0.9}, {"text": "Persona in Smash, what?!", "start": 16.22, "duration": 1.8}, {"text": "\"Whaaaat?!\"", "start": 18.02, "duration": 1.2}, {"text": "And despite the problems we had with Dragon Quest XI,", "start": 19.22, "duration": 3.78}, {"text": "it's awesome the world got Dragon Quest XI!", "start": 23.14, "duration": 3.4}, {"text": "But this wasn't always the case;", "start": 26.6, "duration": 2.06}, {"text": "It's bad enough to have to wait for games to come to the West from Japan,", "start": 28.66, "duration": 4.2}, {"text": "and it's a huge bummer when we never get them, but sometimes,", "start": 32.86, "duration": 3.1}, {"text": "what we got instead was even worse than nothing at all.", "start": 35.96, "duration": 3.2}, {"text": "There are a lot of examples of the American or PAL region versions of Japanese games", "start": 39.16, "duration": 5.04}, {"text": "being the worst version of the game.", "start": 44.32, "duration": 2.04}, {"text": "And I ain't talkin' about censorship, this is bigger than religious and cultural differences:", "start": 46.5, "duration": 4.58}, {"text": "This is about actual good games being changed into bad ones.", "start": 51.08, "duration": 4.08}, {"text": "And one of the worst offenders is also one of Japan's most notorious: Konami.", "start": 55.28, "duration": 4.54}, {"text": "This is Stop Skeletons From Fighting, and welcome to How the West was Worse: Konami Edition.", "start": 59.82, "duration": 4.88}, {"text": "But first, this video was sponsored by Squarespace!", "start": 64.7, "duration": 2.94}, {"text": "You can start your free Squarespace trial today by going to Squarespace.com/stopskeletons", "start": 67.68, "duration": 6.08}, {"text": "and using the offer code 'STOPSKELETONS' to get 10% off your first purchase.", "start": 73.76, "duration": 4.34}, {"text": "That's Squarespace.com/stopskeletons and the offer code 'STOPSKELETONS'", "start": 78.1, "duration": 5.12}, {"text": "Stick around at the end of the episode to hear more about how we used Squarespace", "start": 83.22, "duration": 4.18}, {"text": "to talk about the best video game dogs!", "start": 87.4, "duration": 2.96}, {"text": "[BARK!]", "start": 90.44, "duration": 0.62}, {"text": "Metal Gear is not only one of Konami's best franchises,", "start": 99.62, "duration": 3.84}, {"text": "it's one of the most celebrated franchises of all time.", "start": 103.46, "duration": 3.66}, {"text": "... or at least it was, but before that whole mess,", "start": 107.3, "duration": 2.4}, {"text": "and even before Hideo Kojima conquered the world with Metal Gear Solid in 1998,", "start": 109.7, "duration": 5.24}, {"text": "there were the humble beginnings on the MSX in 1987.", "start": 114.94, "duration": 3.56}, {"text": "The original Metal Gear is a classic and, despite some rough edges, is still very playable today.", "start": 118.62, "duration": 5.66}, {"text": "Its stealth gameplay is simple and great,", "start": 124.32, "duration": 2.62}, {"text": "its story is full of memorable moments,", "start": 126.94, "duration": 2.36}, {"text": "and it's all done in a mostly-open world!", "start": 129.3, "duration": 2.42}, {"text": "A complete revelation at the time, it's easy to see why it was successful on the MSX,", "start": 131.72, "duration": 4.4}, {"text": "despite the system's limited reach outside of Japan.", "start": 136.12, "duration": 2.88}, {"text": "It even was localized for the European market,", "start": 139.06, "duration": 2.46}, {"text": "making it one of the few games on our list that DID see some play in the West.", "start": 141.52, "duration": 3.84}, {"text": "But if you're an American, and of... a certain age,", "start": 145.58, "duration": 4.32}, {"text": "then this is not your Metal Gear,", "start": 149.9, "duration": 1.7}, {"text": "THIS is your Metal Gear.", "start": 151.6, "duration": 1.44}, {"text": "The NES version of Metal Gear is a very, very loose adaptation of the MSX original,", "start": 153.04, "duration": 5.02}, {"text": "and I loved this game, I really did when I was a kid!", "start": 158.06, "duration": 3.22}, {"text": "And it was like nothing else on the system at the time!", "start": 161.28, "duration": 2.44}, {"text": "Open world, stealth gameplay, fantastic music,", "start": 163.72, "duration": 2.74}, {"text": "and a pretty adult story for the time!", "start": 166.46, "duration": 2.34}, {"text": "I mean I was, like, six, so...", "start": 168.8, "duration": 2.28}, {"text": "... I dunno, it felt pretty adult.", "start": 171.28, "duration": 1.32}, {"text": "It was one of my favorite NES games, despite having HUGE problems,", "start": 172.6, "duration": 4.34}, {"text": "the most glaring of which being a general lack of care dedicated to enemy placement.", "start": 176.94, "duration": 4.6}, {"text": "It's far too easy to walk onto a screen and be spotted immediately.", "start": 181.64, "duration": 4.2}, {"text": "This is made mostly okay because alerts don't carry between screens,", "start": 189.5, "duration": 3.34}, {"text": "but this undermines the sneaking mechanic that is the central draw of the whole dang game!", "start": 192.84, "duration": 5.06}, {"text": "MSX Metal Gear, on the other hand, most screens are constructed in a way where that's not possible.", "start": 197.92, "duration": 5.06}, {"text": "Enemy placement will even be different depending on which direction you enter from.", "start": 203.08, "duration": 3.62}, {"text": "And if you get spotted, you can't just leave the screen and reset!", "start": 206.7, "duration": 3.22}, {"text": "There's also a general lack of direction in NES Metal Gear.", "start": 209.92, "duration": 3.02}, {"text": "It's to this game's credit that it has an almost original new layout,", "start": 213.02, "duration": 3.56}, {"text": "but the added sections are confusing and very poorly made.", "start": 216.58, "duration": 2.88}, {"text": "As a kid, it never occurred to me to walk to the back of this random truck to get captured,", "start": 219.54, "duration": 5.34}, {"text": "and there are no official mentions in the actual game of how to get through the jungle mazes.", "start": 224.88, "duration": 5.08}, {"text": "Also, there are no Metal Gears in Metal Gear, only a giant computer!", "start": 230.1, "duration": 5.1}, {"text": "However, we got a LEGENDARY English translation,", "start": 235.2, "duration": 3.32}, {"text": "and an instruction book with a story that has literally nothing to do with the game!", "start": 238.52, "duration": 4.62}, {"text": "We count these as positives.", "start": 243.4, "duration": 1.54}, {"text": "Still, we weren't the only ones subjected to Metal Gear sloppy seconds:", "start": 244.98, "duration": 3.56}, {"text": "This version was also released in Japan, which I can't imagine was an easy sell.", "start": 248.54, "duration": 4.36}, {"text": "The added intro was supposed to be a sort of extra bonus level", "start": 252.9, "duration": 3.4}, {"text": "to entice Japanese players who had already played the MSX game,", "start": 256.3, "duration": 2.82}, {"text": "but why play a poor copy when you got access to the real thing?!", "start": 259.12, "duration": 3.62}, {"text": "Despite all this, us yanks didn't know the difference, and NES Metal Gear was a hit,", "start": 262.82, "duration": 4.2}, {"text": "which led to Konami making a sequel two years later: 1990's Snake's Revenge.", "start": 267.02, "duration": 4.16}, {"text": "In many ways, this is a vast improvement over NES Metal Gear,", "start": 271.18, "duration": 3.94}, {"text": "if you look at these two games in a vacuum.", "start": 275.12, "duration": 2.08}, {"text": "It's also pretty faithful to the MSX original when you look at the gameplay.", "start": 277.36, "duration": 3.72}, {"text": "There's even Metal Gears in this version, even if \"Metal Gear\" isn't anywhere in the title.", "start": 281.08, "duration": 4.32}, {"text": "I was a big fan of Metal Gear, and an even bigger fan of Snake's Revenge,", "start": 285.62, "duration": 3.56}, {"text": "this was one of my favorite games as a kid,", "start": 289.18, "duration": 2.36}, {"text": "and it was basically because it was Metal Gear, but separated into large levels", "start": 291.54, "duration": 4.72}, {"text": "instead of a sprawling, poorly constructed open world.", "start": 296.26, "duration": 3.2}, {"text": "Plus, the guard placement had been improved, but not totally fixed,", "start": 299.64, "duration": 2.82}, {"text": "and it had another amazing soundtrack!", "start": 302.46, "duration": 2.36}, {"text": "But... despite that, it's...", "start": 304.94, "duration": 2.26}, {"text": "... it's- it's- it's- it's not- not good.", "start": 307.2, "duration": 2.78}, {"text": "It's not a good game.", "start": 310.32, "duration": 1.12}, {"text": "Seriously, I wanted to come here and say \"Snake's Revenge is not as bad as people say it is\", but...", "start": 311.68, "duration": 5.44}, {"text": "... I can't.", "start": 317.96, "duration": 1.18}, {"text": "It's got lame platforming sequences, horrible side-scrolling segments,", "start": 319.24, "duration": 3.96}, {"text": "some pretty weak and ball-bustingly hard bosses,", "start": 323.2, "duration": 2.96}, {"text": "and the same cheap deathtraps from the first game.", "start": 326.16, "duration": 2.38}, {"text": "On top of that, why am I playing as a super-roided Contra reject with the tallest butt I've ever seen?", "start": 328.54, "duration": 5.82}, {"text": "Or are those supposed to be some spare abs on his back? What is happening?!", "start": 334.52, "duration": 3.3}, {"text": "Y'know, there's a reason this game never came out in Japan.", "start": 338.08, "duration": 2.86}, {"text": "Needless to say, this game was made without Kojima's involvement whatsoever.", "start": 341.06, "duration": 4.04}, {"text": "Which brings us to the actual sequel to Metal Gear,", "start": 345.54, "duration": 2.56}, {"text": "the Japanese-only Metal Gear 2: Solid Snake, also for the MSX.", "start": 348.1, "duration": 4.56}, {"text": "Apparently, Kojima wasn't even planning on making a sequel for Metal Gear", "start": 352.66, "duration": 4.28}, {"text": "until a developer from Snake's Revenge approached Kojima", "start": 356.94, "duration": 2.64}, {"text": "and said that he needed to make the real Metal Gear 2.", "start": 359.58, "duration": 3.4}, {"text": "So in a way, Snake's Revenge is responsible for the Metal Gear franchise?", "start": 363.5, "duration": 4.22}, {"text": "... all I know is not only is Snake's Revenge a weak game on its own,", "start": 368.52, "duration": 3.72}, {"text": "there's just absolutely no comparison to Metal Gear 2: Solid Snake,", "start": 372.24, "duration": 3.96}, {"text": "and it's an absolute tragedy the West never got to see it in its time.", "start": 376.2, "duration": 4.22}, {"text": "Because while Snake's Revenge was at least a faithful ode to Metal Gear's gameplay,", "start": 380.5, "duration": 3.76}, {"text": "Metal Gear 2 is a full-blown evolution,", "start": 384.26, "duration": 2.16}, {"text": "it's so different from Snake's Revenge that it's a struggle to compare the two!", "start": 386.42, "duration": 3.84}, {"text": "Just about everything from the MSX Metal Gear is expanded and iterated on,", "start": 390.26, "duration": 3.84}, {"text": "with smarter guards, a larger world, and a story experience that feels like a movie.", "start": 394.1, "duration": 4.52}, {"text": "Metal Gear 2 is the lineage of what Metal Gear Solid would become.", "start": 398.62, "duration": 3.66}, {"text": "I'm glad the world would eventually get to experience this game", "start": 402.42, "duration": 2.72}, {"text": "with the release of Metal Gear Solid 3: Subsistence,", "start": 405.14, "duration": 2.72}, {"text": "even if it took 16 years.", "start": 407.86, "duration": 1.84}, {"text": "And speaking of Metal Gear Solid, let's fast-forward to 1998,", "start": 409.8, "duration": 3.96}, {"text": "when the Metal Gear franchise became a global phenomenon!", "start": 413.76, "duration": 3.44}, {"text": "This time the West actually got a slightly better version of Japanese Metal Gear Solid:", "start": 417.34, "duration": 4.42}, {"text": "Despite releasing less than two months apart,", "start": 421.76, "duration": 1.94}, {"text": "the North American version had a little more content and a few gameplay tweaks,", "start": 423.7, "duration": 3.64}, {"text": "like additional difficulty settings, and the absolutely essential Tuxedo Snake!", "start": 427.34, "duration": 4.24}, {"text": "To make up for this, Japanese players got the US version plus even more extras,", "start": 431.62, "duration": 4.08}, {"text": "like a crapton of VR missions and a full first-person mode,", "start": 435.7, "duration": 3.54}, {"text": "re-released to them as 1999's Metal Gear Solid: Integral.", "start": 439.24, "duration": 3.94}, {"text": "The North American and PAL regions got VR Missions instead.", "start": 443.28, "duration": 3.26}, {"text": "This is actually just a stand-alone release of the extra VR missions disc from Integral.", "start": 446.54, "duration": 4.4}, {"text": "A consolation prize, sure, but 300 new VR missions is a decent amount of game,", "start": 450.94, "duration": 4.8}, {"text": "though I really wish I could have got to play Metal Gear Solid in the first person on the PS1!", "start": 455.74, "duration": 4.96}, {"text": "Sounds like an absolutely garbage and amazing way to play that game!", "start": 460.76, "duration": 3.76}, {"text": "By the way, PAL region got the rawest deal:", "start": 464.58, "duration": 2.9}, {"text": "In PAL, the VR Missions was a data disc, meaning you had to have the original game to even play it,", "start": 467.48, "duration": 5.38}, {"text": "and because of this, there was no backwards compatibility on the PS2 and PS3.", "start": 472.9, "duration": 4.88}, {"text": "And while the world would get Integral as a PC port in 2000,", "start": 477.92, "duration": 3.66}, {"text": "the Psycho Mantis fight is shortened because the PC doesn't have a memory card for him to mind-read,", "start": 481.58, "duration": 4.94}, {"text": "though it would be funny if he searched your hard drive.", "start": 486.52, "duration": 2.3}, {"text": "\"So, you pirated Castlevania?\"", "start": 489.0, "duration": 2.2}, {"text": "Aaagh!", "start": 491.22, "duration": 0.74}, {"text": "Gah!", "start": 492.14, "duration": 0.5}, {"text": "Phew...", "start": 493.06, "duration": 0.52}, {"text": "Gah!!", "start": 493.58, "duration": 0.74}, {"text": "It's another example of why the West was worse!", "start": 495.52, "duration": 2.48}, {"text": "Our next franchise is Castlevania, another huge pillar of Konami's game empire,", "start": 500.44, "duration": 5.1}, {"text": "and actually, the West, specifically North America, had it pretty good!", "start": 505.54, "duration": 4.88}, {"text": "For example, you might have known that the Japanese name for Castlevania was \"Akumajō Dracula\",", "start": 510.5, "duration": 4.86}, {"text": "but did you know that there are five distinct games just called \"Akumajō Dracula\"?", "start": 515.44, "duration": 5.1}, {"text": "... which must have been hell for Japanese consumers.", "start": 520.58, "duration": 2.18}, {"text": "And by the way, in the PAL region there are four distinct games just called \"Castlevania\".", "start": 522.76, "duration": 4.64}, {"text": "Yeah, for some reason, in Europe Circle of the Moon and Lament of Innocence were just called \"Castlevania\".", "start": 527.42, "duration": 5.06}, {"text": "But Europe was actually lucky enough to get an early Castlevania entry:", "start": 532.72, "duration": 4.12}, {"text": "1987's Vampire Killer for the MSX.", "start": 536.84, "duration": 2.98}, {"text": "This is a fascinating and weird game", "start": 539.84, "duration": 2.32}, {"text": "that is also technically the first time an iteration of the Castlevania series left Japan.", "start": 542.16, "duration": 4.98}, {"text": "It's visually very similar to the NES Castlevania, but actually plays closer to Simon's Quest.", "start": 547.14, "duration": 5.76}, {"text": "Levels are more open world, with items to find and equipment to buy.", "start": 552.9, "duration": 3.38}, {"text": "It's stupid hard though, and there are no continues.", "start": 556.28, "duration": 3.0}, {"text": "It's not a great game, but it's a really interesting early take on the series,", "start": 559.4, "duration": 3.98}, {"text": "one that hardcore Castlevania fans should definitely check out!", "start": 563.38, "duration": 3.52}, {"text": "Though it did technically come to the West, so it's not in the spirit of this video.", "start": 566.9, "duration": 3.78}, {"text": "Vampire Killer is an outlier; most Castlevania games came to North America.", "start": 570.68, "duration": 4.58}, {"text": "There were a handful of differences between versions though:", "start": 575.58, "duration": 2.78}, {"text": "The Japanese version of Simon's Quest was released on the Famicom Disk System,", "start": 578.36, "duration": 3.66}, {"text": "and featured battery-backup saves, but horrendously long load times,", "start": 582.02, "duration": 4.1}, {"text": "and the NES passwords actually saved more of your inventory.", "start": 586.12, "duration": 3.48}, {"text": "Castlevania III for the Famicom had a more advanced sound chip,", "start": 589.68, "duration": 3.48}, {"text": "which gave the music a bigger but not necessarily better sound, at least in my opinion.", "start": 593.16, "duration": 4.46}, {"text": "However, the North American version has better aesthetics overall,", "start": 597.62, "duration": 3.24}, {"text": "so I'd call that particular case a wash,", "start": 600.86, "duration": 2.36}, {"text": "even if Sypha is, for some reason, a man.", "start": 603.22, "duration": 2.82}, {"text": "Everybody got Castlevania Adventure, so we can all share that misery together,", "start": 606.24, "duration": 4.24}, {"text": "and though we missed the Famicom version of Kid Dracula,", "start": 610.56, "duration": 3.04}, {"text": "we got the far superior Game Boy version in '93.", "start": 613.6, "duration": 3.72}, {"text": "However, 1993 is when things took a turn for the worse:", "start": 617.5, "duration": 3.96}, {"text": "First off, the original Castlevania got a massive remake on the Sharp 68000,", "start": 621.66, "duration": 4.34}, {"text": "which would see release in the West as Castlevania Chronicles the next decade.", "start": 626.0, "duration": 3.58}, {"text": "And, weirdly enough, the original Castlevania saw a Famicom cartridge re-release in '93,", "start": 629.58, "duration": 5.3}, {"text": "which featured an Easy Mode:", "start": 634.88, "duration": 2.6}, {"text": "No knockback, much weaker enemies,", "start": 637.56, "duration": 2.22}, {"text": "and you keep your subweapons and multiplier bonuses after death!", "start": 639.78, "duration": 3.32}, {"text": "It feels more like a ROM hack than an official Konami product, it's wild this thing is real!", "start": 643.1, "duration": 5.96}, {"text": "The real loss in the Castlevania franchise, however, was the Japanese-only Rondo of Blood.", "start": 649.38, "duration": 5.4}, {"text": "Released in '93 for the Super CD PC Engine, a.k.a. the Turbo Duo,", "start": 654.96, "duration": 4.52}, {"text": "it's probably the best Vintagevania ever,", "start": 659.48, "duration": 2.52}, {"text": "though my heart will always belong to Dracula's Curse and Castlevania IV.", "start": 662.0, "duration": 3.62}, {"text": "Rondo of Blood was a gorgeous and epic evolution of the Castlevania formula,", "start": 665.74, "duration": 4.36}, {"text": "but we never got that.", "start": 670.1, "duration": 1.1}, {"text": "Instead, two years later, as the Super Nintendo was being phased out,", "start": 671.2, "duration": 3.5}, {"text": "Konami graced us with a... port?", "start": 674.7, "duration": 2.24}, {"text": "... reimagining?", "start": 677.12, "duration": 1.08}, {"text": "I dunno what to call it, but we got Castlevania: Dracula X instead.", "start": 678.26, "duration": 3.46}, {"text": "While it's a poor, though not terrible, Castlevania game,", "start": 681.86, "duration": 3.48}, {"text": "it's a very poor consolation for Rondo of Blood.", "start": 685.34, "duration": 2.82}, {"text": "It took a few things from Rondo, like the ability to jump on and off stairs, which was actually a big deal,", "start": 688.16, "duration": 5.14}, {"text": "alternate levels, and subweapons that drop behind you when you pick up new ones,", "start": 693.3, "duration": 3.78}, {"text": "which were welcome additions to the Castlevania formula.", "start": 697.08, "duration": 3.02}, {"text": "Again, it's not a terrible game, but it also doesn't execute these additions all that well.", "start": 700.1, "duration": 5.22}, {"text": "The alternate levels are literally halved, Maria is in the game but not as a playable character,", "start": 705.36, "duration": 4.88}, {"text": "overall there's just way less game here, and it doesn't play that much better either.", "start": 710.24, "duration": 3.98}, {"text": "Blinking time is way down, bats and Medusa heads can hit you twice,", "start": 714.26, "duration": 3.94}, {"text": "and you can't strike a pose at the end of stages,", "start": 718.2, "duration": 2.74}, {"text": "It's the Snake's Revenge of the Castlevania games:", "start": 723.08, "duration": 2.7}, {"text": "Weak in its own right, but trash when compared to what Japan got instead.", "start": 725.78, "duration": 4.46}, {"text": "We would eventually get Rondo on the PSP in 2007,", "start": 730.36, "duration": 3.48}, {"text": "and most recently on the Castlevania Requiem for the PlayStation 4,", "start": 733.84, "duration": 3.28}, {"text": "bundled with its canonical sequel, Symphony of the Night.", "start": 737.12, "duration": 3.06}, {"text": "Though they \"fixed\" the voice acting in Symphony of the Night in these versions.", "start": 740.24, "duration": 4.08}, {"text": "An improvement? I'll let you be the judge.", "start": 744.5, "duration": 2.38}, {"text": "\"Ha! Mankind. A cesspit of hatred and lies!\"", "start": 746.88, "duration": 5.32}, {"text": "But the answer is no, this is already perfect.", "start": 753.02, "duration": 1.42}, {"text": "[airhorns]\n\"WHAT-WHAT-WHAT-WHAT IS MAN?!\"", "start": 754.44, "duration": 2.62}, {"text": "GRACE: And now, a scheduled Goemon interlude.", "start": 757.96, "duration": 3.42}, {"text": "Only five Goemon games were released outside of Japan.", "start": 762.68, "duration": 3.68}, {"text": "Out of, like... thirty?", "start": 766.98, "duration": 2.08}, {"text": "Man...", "start": 769.78, "duration": 0.92}, {"text": "... that sucks.", "start": 771.3, "duration": 1.32}, {"text": "He's a champion of the people.", "start": 773.32, "duration": 2.0}, {"text": "Good luck, Goemon.", "start": 776.44, "duration": 2.92}, {"text": "DEREK: And next, it's Contra!", "start": 784.14, "duration": 1.88}, {"text": "... oh, Contra.", "start": 786.46, "duration": 1.06}, {"text": "Contra is another giant mess for Konami,", "start": 787.84, "duration": 2.1}, {"text": "and of course, the West got the shaft almost throughout the entire series.", "start": 789.94, "duration": 4.16}, {"text": "While Castlevania and Metal Gear have their big examples,", "start": 794.1, "duration": 2.48}, {"text": "Contra's really just all over the place, so strap in!", "start": 796.58, "duration": 3.28}, {"text": "Of course, we gotta start with the first one:", "start": 799.86, "duration": 1.9}, {"text": "Contra originated in the arcades, but was soon ported to the Famicom and NES.", "start": 801.76, "duration": 3.86}, {"text": "Contra for the Famicom had a special chip inside of it", "start": 805.62, "duration": 2.96}, {"text": "that allowed the game to have a ton of features that never made it over to the worldwide release:", "start": 808.58, "duration": 4.32}, {"text": "The Japanese version had some cool graphical flourishes,", "start": 812.9, "duration": 2.82}, {"text": "a map, cutscenes and even a secret ending!", "start": 815.72, "duration": 3.04}, {"text": "Because Konami didn't want to produce that special chip for the overseas market,", "start": 818.76, "duration": 3.98}, {"text": "the North American version of Contra is way stripped down,", "start": 822.74, "duration": 3.24}, {"text": "though we did get the arguably superior additions of Mad Dog and Scorpion", "start": 825.98, "duration": 4.42}, {"text": "as codenames for Billy and Lance.", "start": 830.4, "duration": 2.16}, {"text": "PAL's Contra, on the other hand, went entirely off the deep end:", "start": 832.7, "duration": 3.78}, {"text": "Because of restrictions on violence in many parts of Europe and Australia,", "start": 836.48, "duration": 3.46}, {"text": "Konami decided to just scrap whatever cheese they had goin' on with Mad Dog,", "start": 839.94, "duration": 3.82}, {"text": "and just made everybody robots and called the game \"Probotector\".", "start": 843.76, "duration": 3.66}, {"text": "See? All better now!", "start": 847.54, "duration": 1.3}, {"text": "\"Probotector\" may sound like a weird name, but it's better than the ZX and C64 versions,", "start": 848.94, "duration": 5.32}, {"text": "which, no joke, were called \"Gryzor\"!", "start": 854.26, "duration": 3.32}, {"text": "However, Konami did make an MSX port of Contra that only came out in Japan,", "start": 857.9, "duration": 4.42}, {"text": "and of course, we need to talk about it because... c'mon, this is Stop Skeletons From Fighting, baby.", "start": 862.32, "duration": 4.08}, {"text": "Like Vampire Killer, this version of Contra is different enough that hardcore fans should definitely check it out!", "start": 866.4, "duration": 5.86}, {"text": "MSX Contra is basically the NES port we all know and love,", "start": 872.26, "duration": 3.82}, {"text": "except once you beat the alien heart, the game keeps going with eleven new levels!", "start": 876.08, "duration": 5.14}, {"text": "But it's a compromised version of Contra, that is single-player only, with no spread gun,", "start": 881.3, "duration": 5.06}, {"text": "screens instead of scrolling levels, and oh yeah, no continues.", "start": 886.36, "duration": 3.92}, {"text": "And the extra levels aren't anything to get too excited about, actually.", "start": 890.42, "duration": 3.3}, {"text": "It's maybe not a shame that it didn't ever leave Japan,", "start": 893.9, "duration": 2.84}, {"text": "but six-year-old me would have lost his damn mind if he had known about this version!", "start": 896.74, "duration": 4.26}, {"text": "Because of Konami's decision to rebrand Contra as Probotector in the PAL regions,", "start": 901.18, "duration": 4.86}, {"text": "and the general process of localization to North America,", "start": 906.04, "duration": 2.76}, {"text": "there are lots of minor differences between different versions of Contra games,", "start": 908.8, "duration": 3.08}, {"text": "but some of them are pretty hilarious!", "start": 911.88, "duration": 2.3}, {"text": "Instead of \"Super C\", PAL got \"Probotector II: Return of the Evil Forces\"!", "start": 914.22, "duration": 5.8}, {"text": "Now, I grew up with Contra so I'm a little bias, I think that's the cooler name,", "start": 920.02, "duration": 3.9}, {"text": "but man, \"Probotector\" is a pretty dumb and amazing name too!", "start": 923.92, "duration": 5.08}, {"text": "The bigger problem with Contra is that it's the inverse of Metal Gear and Castlevania:", "start": 929.0, "duration": 4.52}, {"text": "The West, and almost exclusively North America, got exclusive Contra games!", "start": 933.68, "duration": 5.42}, {"text": "Except they were the worst Contra games!", "start": 939.66, "duration": 2.5}, {"text": "Exhibit A: Contra Force.", "start": 942.34, "duration": 2.38}, {"text": "This stain on the Contra legacy was only released in the US.", "start": 944.78, "duration": 4.08}, {"text": "It originally wasn't even gonna be a Contra game,", "start": 948.86, "duration": 2.36}, {"text": "and then was gonna be Contra III before Contra III was Contra III,", "start": 951.22, "duration": 3.28}, {"text": "because for a hot minute, Contra III was gonna be Contra IV.", "start": 954.5, "duration": 3.24}, {"text": "Originally to be released in Japan as Arc Hound,", "start": 957.86, "duration": 2.64}, {"text": "it was cancelled and then dumped onto the US for some reason.", "start": 960.5, "duration": 3.16}, {"text": "Konami was literally dumping their garbage on us, because this game is terrible!", "start": 963.66, "duration": 5.0}, {"text": "It runs like crap, is a huge departure from the rest of the series gameplay-wise,", "start": 968.66, "duration": 4.04}, {"text": "and it came after arguably the greatest Contra game of all time.", "start": 972.7, "duration": 4.24}, {"text": "Contra III: The Alien Wars, by the way, has very minor differences between the various versions,", "start": 976.94, "duration": 5.18}, {"text": "so it's not really a part of How the West was Worse.", "start": 982.12, "duration": 2.38}, {"text": "But while I've always had a soft spot for III,", "start": 984.64, "duration": 2.34}, {"text": "I know some people are out there for Hard Corps on the Genesis,", "start": 986.98, "duration": 3.02}, {"text": "which I always thought was just a little too damn hard for its own good.", "start": 990.0, "duration": 4.2}, {"text": "But it turns out, it's because I was playing a much worse version!", "start": 994.2, "duration": 3.98}, {"text": "The Japanese version of Hard Corps features a life gauge instead of instant death, and unlimited continues!", "start": 998.18, "duration": 5.8}, {"text": "The North American version has no such life bar, and only five continues,", "start": 1003.98, "duration": 3.7}, {"text": "which is slightly easier than the PAL region's four continues.", "start": 1007.68, "duration": 3.5}, {"text": "But playing the Japanese version, I can finally see why people hold this game up so high!", "start": 1011.18, "duration": 4.06}, {"text": "Hard Corps IS a good Contra game, it's just that it never got a chance to show its best self in the West.", "start": 1015.24, "duration": 5.1}, {"text": "It's also the second and last game in the PAL region to be called just Probotector.", "start": 1020.34, "duration": 4.98}, {"text": "In 1997, PAL would finally join the rest of the world with the Contra name,", "start": 1025.52, "duration": 4.4}, {"text": "however, that game happens to be Contra: Legacy of War.", "start": 1029.92, "duration": 3.78}, {"text": "Poor guys.", "start": 1034.44, "duration": 0.74}, {"text": "Now we're truly getting into How the West was Worse,", "start": 1035.26, "duration": 2.34}, {"text": "because the three worst Contra games only came to the West,", "start": 1037.6, "duration": 3.5}, {"text": "and two of those only came to North America.", "start": 1041.1, "duration": 2.78}, {"text": "Legacy of War was Contra's big third-dimension debut, and I do mean that literally.", "start": 1043.88, "duration": 4.4}, {"text": "It even shipped with 3D glasses!", "start": 1048.28, "duration": 1.8}, {"text": "And hey, if you have your 3D glasses, put them on now!", "start": 1050.08, "duration": 3.2}, {"text": "Get a load of this!!", "start": 1053.64, "duration": 1.28}, {"text": "Wow!", "start": 1055.9, "duration": 1.0}, {"text": "Who thought this was a good idea?!", "start": 1056.9, "duration": 1.78}, {"text": "Produced by Appaloosa Interactive, a Hungarian-owned studio best known for Ecco the Dolphin,", "start": 1059.1, "duration": 5.18}, {"text": "Legacy of War was an early 3D title, so it's understandable that some mistakes were made.", "start": 1064.28, "duration": 5.02}, {"text": "But there's no excuse for the second Appaloosa-developed title,", "start": 1069.3, "duration": 3.44}, {"text": "C: The Contra Adventure, being even worse.", "start": 1072.74, "duration": 3.42}, {"text": "It gets bonus points for having the blandest title in the franchise,", "start": 1076.16, "duration": 4.02}, {"text": "but it attempts to rectify Legacy of War's mistakes by reverting to 2,5D run-and-gun stages,", "start": 1080.18, "duration": 5.58}, {"text": "but it's just so listless and boring!", "start": 1085.86, "duration": 2.72}, {"text": "Contra Force was made by Japanese and dumped on America.", "start": 1088.58, "duration": 3.22}, {"text": "C: The Contra Adventure was made by Europeans, and dumped here as well.", "start": 1091.8, "duration": 3.94}, {"text": "Y'know, maybe it's fair that PAL didn't get Contra 4.", "start": 1095.74, "duration": 2.96}, {"text": "... nah, I'm just kidding.", "start": 1098.86, "duration": 1.18}, {"text": "But thankfully, everyone got Neo Contra and Contra: Shattered Soldier, and now...", "start": 1100.04, "duration": 4.0}, {"text": "... no-one gets Contra games!", "start": 1104.12, "duration": 1.62}, {"text": "Konami doesn't even make 'em anymore! No-one gets 'em!", "start": 1105.78, "duration": 2.64}, {"text": "... so all's well that ends well, I guess.", "start": 1108.68, "duration": 2.14}, {"text": "Konami's been makin' games...", "start": 1110.96, "duration": 1.66}, {"text": "... WAS making games... for several decades,", "start": 1112.68, "duration": 2.56}, {"text": "and these sorts of practices have mostly vanished!", "start": 1115.24, "duration": 2.9}, {"text": "When Castlevania Requiem was released, it received a worldwide release date!", "start": 1118.14, "duration": 3.98}, {"text": "This is where we are today!", "start": 1122.34, "duration": 1.5}, {"text": "No more staggered release dates between regions, well... far fewer anyway.", "start": 1123.84, "duration": 3.58}, {"text": "We called this video Why the West was Worse because I liked the title,", "start": 1127.42, "duration": 3.9}, {"text": "and because the 80's and 90's were kind of the Wild West for video games.", "start": 1131.32, "duration": 4.08}, {"text": "And I got more ideas for this, so...", "start": 1136.08, "duration": 2.52}, {"text": "... Yippee ki-yay, m**********s!", "start": 1139.52, "duration": 1.82}, {"text": "Let us know if you liked this format!", "start": 1141.42, "duration": 1.76}, {"text": "I did a swear!", "start": 1143.42, "duration": 1.26}, {"text": "GRACE: You did it!\nDEREK: I did a s- I did a swear! Hey ma!", "start": 1145.12, "duration": 2.26}, {"text": "GRACE: Wow, all grown up!", "start": 1147.6, "duration": 1.2}, {"text": "This video was sponsored by Squarespace, they have an all-in one platform:", "start": 1148.8, "duration": 3.88}, {"text": "No plugins, no updates, no patches EVER,", "start": 1152.78, "duration": 3.0}, {"text": "which makes it super easy for the Hot Dog Gamer to add pictures of his favorite video game dogs", "start": 1155.78, "duration": 4.86}, {"text": "to his website, Nochumpzone.com!", "start": 1160.64, "duration": 2.9}, {"text": "They also have 24/7, 365-day support just in case you're havin' trouble", "start": 1163.64, "duration": 5.06}, {"text": "making your dog reviews look doggin' good!", "start": 1168.7, "duration": 2.7}, {"text": "You can start your free Squarespace trial today by going to Squarespace.com/stopskeletons,", "start": 1171.56, "duration": 5.32}, {"text": "using the code 'STOPSKELETONS' to get 10% off your first purchase.", "start": 1176.88, "duration": 4.14}, {"text": "That's Squarespace.com/stopskeletons.", "start": 1181.02, "duration": 3.4}]