[{"text": "Liquid metal", "start": 0.339, "duration": 1.26}, {"text": "It's a hell of a drug You know, first you delid", "start": 1.599, "duration": 3.32}, {"text": "your CPU and then that high wears off so then you like liquid metal your laptop and again", "start": 4.92, "duration": 7.049}, {"text": "You're rewarded with amazing temps and even a performance boost and that keeps you going for another week or so and then", "start": 11.969, "duration": 7.83}, {"text": "You notice something getting kind of hot in your pants.", "start": 20.529, "duration": 3.35}, {"text": "You know the idea it starts small, but then it grows grows getting more and more", "start": 24.22, "duration": 5.27}, {"text": "solid.", "start": 30.34, "duration": 1.2}, {"text": "What if you could make your phone", "start": 31.54, "duration": 2.0}, {"text": "run cooler and faster with liquid metal?", "start": 34.18, "duration": 3.349}, {"text": "Well guess what that's a super risky,Maybe even bad idea", "start": 38.14, "duration": 4.369}, {"text": "So we're gonna show you how to do it.", "start": 43.059, "duration": 2.0}, {"text": "After we tell you today's video is brought to you by shade tree", "start": 45.399, "duration": 3.77}, {"text": "Sunglasses shade tree sunglasses are hand made from hard wood materials featuring polarized lenses of variety of designs and even", "start": 49.42, "duration": 6.77}, {"text": "Cool new carbon frames .get 10% off your next order through our link below", "start": 56.379, "duration": 4.25}, {"text": "So it is common for phone performance to nosedive", "start": 70.0, "duration": 3.8}, {"text": "During any workload that takes more than a couple of seconds with gaming being a common culprit so your processor", "start": 74.2, "duration": 7.07}, {"text": "Starts out cool and fast then the hotter it gets the more it thermal throttles so", "start": 81.49, "duration": 6.26}, {"text": "Liquid metal likely wouldn't do anything for that initial cold performance", "start": 88.24, "duration": 5.06}, {"text": "But it could allow us to maintain peak performance for", "start": 93.49, "duration": 5.209}, {"text": "Longer. so we chose the razor phone as our victim, excuse me a test subject", "start": 99.1, "duration": 4.849}, {"text": "Compared to most phones its thermal design is very respectable", "start": 104.77, "duration": 3.829}, {"text": "But it is still not perfect. check this out our first 3d mark result puts us in the top", "start": 108.64, "duration": 7.009}, {"text": "83 % of razor phones so that looks pretty good, but then a second run immediately", "start": 116.05, "duration": 5.899}, {"text": "Afterwards gave much worse results and it dropped all the way down to 20% worse after a 15 minute stress test", "start": 122.53, "duration": 7.97}, {"text": "That is the kind of performance impact that you would notice in an extended mobile gaming session.", "start": 130.78, "duration": 5.899}, {"text": "So let's get started then ,you'll need a good set of screwdrivers and prying tools some isopropyl alcohol", "start": 137.23, "duration": 6.38}, {"text": "Some paper towel some conformal coating ,cotton swabs and a heat gun because getting inside phones", "start": 143.89, "duration": 6.319}, {"text": "Sucks and of course you'll also need liquid metal will be using thermal grisly conductonaut. now your phone's", "start": 150.61, "duration": 7.399}, {"text": "Disassembly process will be different unless you have a razor phone", "start": 158.17, "duration": 3.77}, {"text": "But we'd recommend watching this whole process anyway without skipping around if you plan to follow along.", "start": 162.13, "duration": 6.5}, {"text": "So first, we made sure the device was off then we took a heat gun to the speaker grills", "start": 169.18, "duration": 4.79}, {"text": "With the adhesive softened we peeled them off with a prying tool", "start": 174.19, "duration": 3.44}, {"text": "Next we removed this combination of regular Phillips and Torx screws. we recommend always", "start": 178.0, "duration": 5.209}, {"text": "Placing things like this in a parts tray in the same position as they came out of the phone in so you don't have to", "start": 183.67, "duration": 5.569}, {"text": "Guess which ones go where during reassembly.", "start": 189.239, "duration": 2.01}, {"text": "Then we used guitar picks to keep the phone from snapping back together while we pried it apart", "start": 191.98, "duration": 4.88}, {"text": "Until well, it pried apart and the screen popped off.", "start": 197.32, "duration": 3.289}, {"text": "then once we got inside and took off the cables for the LCD screen and", "start": 200.68, "duration": 4.35}, {"text": "Battery giving us our first good look at the razor phone's heat pipe cooler", "start": 205.4, "duration": 5.0}, {"text": "It's insulated from the battery and actually seems to be designed to use the screen to increase its surface area for heat dissipation.", "start": 210.4, "duration": 7.41}, {"text": "Pretty cool, with the stock thermal paste removed", "start": 218.18, "duration": 2.75}, {"text": "it wasn't entirely clear actually how to", "start": 220.93, "duration": 3.029}, {"text": "Proceed. we lifted this small copper heat spreader very carefully with a razor blade", "start": 224.239, "duration": 5.6}, {"text": "Not to be confused with a razor blade", "start": 230.239, "duration": 1.97}, {"text": "And then had a planning session .so if liquid metal gets on anything", "start": 232.209, "duration": 4.589}, {"text": "aluminium the gallium in it will destroy it with corrosion .so,", "start": 237.17, "duration": 4.22}, {"text": "What we've decided is to put the best thermal compound that we have between the copper sheet and the processor and then", "start": 241.58, "duration": 7.849}, {"text": "liquid metal the heat pipe", "start": 250.01, "duration": 2.089}, {"text": "To the copper heat spreader with regular thermal compound all around it. time then to execute we applied", "start": 252.38, "duration": 7.13}, {"text": "Conformal coating around the CPU with a cotton swab", "start": 259.669, "duration": 2.66}, {"text": "to act as a line of defense if the liquid metal spills off the CPU then, to put our copper heat spreader back on we", "start": 262.4, "duration": 7.82}, {"text": "used arctic silver thermal adhesive", "start": 270.22, "duration": 1.93}, {"text": "Which you mix up in equal parts and then spread across the surfaces that you want to stick together.", "start": 272.15, "duration": 4.639}, {"text": "just like an epoxy. we then cleaned the copper spreader and", "start": 276.86, "duration": 3.83}, {"text": "carefully placed it back on removing any wrinkles with a guitar pick and", "start": 281.24, "duration": 3.98}, {"text": "Clamping it all together for about 20 minutes to make sure that it was set.", "start": 285.47, "duration": 4.19}, {"text": "Moving over to the back of the screen ,we applied a generous amount of thermal paste here", "start": 290.479, "duration": 4.61}, {"text": "And then it was finally time for liquid metal.", "start": 295.09, "duration": 3.72}, {"text": "We put a small drop in a cleaned parts tray, then picked up a tiny bit with a cotton swab.", "start": 299.03, "duration": 6.23}, {"text": "This was carefully spread out over the copper heat pipe.", "start": 305.75, "duration": 3.44}, {"text": "You only need a little bit of this stuff to do the trick.", "start": 309.229, "duration": 3.23}, {"text": "Time for reassembly if you are performing this mod on a razor phone by the way", "start": 312.669, "duration": 4.44}, {"text": "I would strongly recommend that you get new speaker grills first because they don't just stick back on", "start": 317.11, "duration": 5.55}, {"text": "So we used what we fondly refer to as that sticky tar crap to put them back on as best We could,", "start": 322.789, "duration": 5.81}, {"text": "I give it a 4 out of 10.", "start": 329.74, "duration": 2.0}, {"text": "Anyway, hitting the power button it boots so now it's time for the payoff or lack thereof we", "start": 332.06, "duration": 7.759}, {"text": "Weren't sure given that we weren't liquid metals all the way to the chip itself if this was even really gonna work", "start": 339.819, "duration": 6.39}, {"text": "So in 3d mark, We immediately recorded our highest result yet, but", "start": 346.97, "duration": 5.119}, {"text": "not by a very significant margin.", "start": 352.789, "duration": 2.21}, {"text": "cautious optimism that best at this point, then on the second run", "start": 356.06, "duration": 4.399}, {"text": "Whoa!!", "start": 361.099, "duration": 1.711}, {"text": "No decrease in performance", "start": 362.81, "duration": 2.179}, {"text": "Whatsoever. also in the Vulcan test which comes after the OpenGL one is finished running we went from very", "start": 366.319, "duration": 7.13}, {"text": "middle-of-the-road performance compared to other razer phones to being in the top", "start": 374.06, "duration": 4.309}, {"text": "4% and our other benchmarks saw modest gains and performance too, so this phone right here", "start": 379.159, "duration": 5.72}, {"text": "It's got ugly grills, but you could game on It indefinitely and see virtually no drop in performance an", "start": 385.009, "duration": 6.86}, {"text": "A+ result. so then, would we recommend performing this operation?", "start": 392.419, "duration": 5.0}, {"text": "The answer is no.", "start": 398.36, "duration": 2.0}, {"text": "Given the low mounting pressure for the cooler and the way that phones get moved and tossed around all the time", "start": 401.21, "duration": 5.75}, {"text": "we believe that the chances of the liquid metal shifting and", "start": 407.33, "duration": 3.829}, {"text": "Damaging the aluminum inside your phone or even shorting something out and bricking it entirely are", "start": 411.59, "duration": 5.299}, {"text": "too high.", "start": 417.409, "duration": 1.5}, {"text": "Also, we can't know how much of the performance increase came from the liquid metal", "start": 418.909, "duration": 4.4}, {"text": "And how much was simply from repasting the phone with a higher quality thermal interface material.", "start": 423.31, "duration": 4.829}, {"text": "So bottom line then unless you're going for phone performance records", "start": 428.98, "duration": 4.3}, {"text": "It's really cool, and the results surprised even us, but I wouldn't recommend voiding your warranty over it.", "start": 433.56, "duration": 6.64}, {"text": "Speaking of things I would recommend", "start": 441.54, "duration": 2.0}, {"text": "Ting is the mobile carrier, that's focused on customer service and customer satisfaction.", "start": 444.229, "duration": 4.52}, {"text": "When you call ting you don't speak to robot you get put through directly to a person", "start": 449.3, "duration": 4.7}, {"text": "And you don't pay extra for the privilege the average ting bill is just 23 bucks a month per device", "start": 454.0, "duration": 5.729}, {"text": "And if you're stuck in a contract and switch to ting they'll cover 25 percent of your cancellation fee up to 75 bucks", "start": 459.729, "duration": 6.72}, {"text": "the cool thing about ting is that you only pay for", "start": 466.7, "duration": 3.019}, {"text": "Exactly the airtime and data that you use and data is now just 10 bucks a gig beyond the first gig", "start": 469.91, "duration": 6.2}, {"text": "So try out their savings calculator, it's over at Linus.ting.com", "start": 476.27, "duration": 3.679}, {"text": "We'll have that link below and find out if you would save money on ting. when you sign up at our link you'll get", "start": 479.95, "duration": 5.88}, {"text": "25 bucks in service credit or towards a new device", "start": 485.83, "duration": 2.579}, {"text": "So, thanks for watching guys if this video sucked", "start": 490.19, "duration": 2.239}, {"text": "You know what to do.", "start": 492.43, "duration": 0.99}, {"text": "But if it was awesome", "start": 493.42, "duration": 0.94}, {"text": "Get subscribed hit that like button or check out the link to where to buy the stuff we featured in the video description", "start": 494.36, "duration": 5.0}, {"text": "Also, link down There's our merch store, which has cool shirts like this one and our community forum, which you should totally join", "start": 499.82, "duration": 6.83}, {"text": "No one no one's to know this was Linus, and we'd have made it in the video", "start": 507.17, "duration": 4.939}, {"text": "But fortunately my uncle and it's generally goes under the radar", "start": 512.11, "duration": 3.15}, {"text": "You actually think that the editors are going to take the time to go through all this footage and listen to it", "start": 515.87, "duration": 4.01}, {"text": "I really strongly doubt it", "start": 519.88, "duration": 2.0}]