[{"text": "When you ask someone to draw a star, they'll\nprobably draw something like this - or this", "start": 1.09, "duration": 4.92}, {"text": "or this. Even ignoring the rainbows, this\ndoesn't seem very scientific, since we know", "start": 6.01, "duration": 4.96}, {"text": "stars are actually big hot ROUND balls of\nplasma and far enough away that they're basically", "start": 10.97, "duration": 4.95}, {"text": "just dots. So why do we draw stars that have\npoints?", "start": 15.92, "duration": 4.1}, {"text": "The answer is surprisingly simple: we see\nstars as pointy. Look carefully next time", "start": 20.02, "duration": 5.3}, {"text": "you're outside on a dark night - or just look\nat this dot (it works best if you make the", "start": 25.32, "duration": 4.049}, {"text": "video fullscreen, close one eye, and relax\nthe other as if you're looking at something", "start": 29.369, "duration": 4.131}, {"text": "far away). You should see a pointy, star-like\nshape! In fact, it's not just humans that", "start": 33.5, "duration": 5.21}, {"text": "see pointy stars - some telescopes see them\nthat way, too!", "start": 38.71, "duration": 3.75}, {"text": "This is all because light is a wave. When\nlight from a distant source passes through", "start": 42.46, "duration": 4.4}, {"text": "an opening or around an object, its waves\nare bounced or bent slightly and interfere", "start": 46.86, "duration": 4.5}, {"text": "with each other, so the passing light picks\nup an imprint of that opening or object. A", "start": 51.36, "duration": 4.55}, {"text": "straight line (whether it's a slit letting\nlight through or a rod blocking the light)", "start": 55.91, "duration": 4.309}, {"text": "leaves its imprint by spreading the light\nout into a perpendicular series of dashes", "start": 60.219, "duration": 3.84}, {"text": "(- like what you see when you squint!) A cross\ncreates two, perpendicular, sets of dashes,", "start": 64.059, "duration": 5.071}, {"text": "circles cause concentric rings, squares spawn\na kind of dashed four-pointed star, hexagons", "start": 69.13, "duration": 5.839}, {"text": "dashed six-pointed stars; and the famous double\nslit experiment gives a series of dashed dashes.", "start": 74.969, "duration": 6.341}, {"text": "My favorite diffraction pattern, though, is\nprobably that of the Penrose tiling - it's", "start": 81.31, "duration": 4.629}, {"text": "simply gorgeous… not that you see Penrose-tiling-shaped\nopenings very often. But… the point of all", "start": 85.939, "duration": 5.691}, {"text": "of these imprints is that they're the result\nof a point of light being spread out when", "start": 91.63, "duration": 3.699}, {"text": "viewed through a particular opening or past\na particular object.", "start": 95.329, "duration": 3.57}, {"text": "For example, the Hubble space telescope has\nfour struts that support its small secondary", "start": 98.899, "duration": 4.371}, {"text": "mirror, and their imprint causes the 4-pointed\nstars in hubble photos. And I bet you can", "start": 103.27, "duration": 5.409}, {"text": "guess the shape of the aperture on the lens\nthat took this picture. Similarly, the lenses", "start": 108.679, "duration": 4.021}, {"text": "of our eyes have subtle structural imperfections\ncalled suture lines where the fibers that", "start": 112.7, "duration": 4.809}, {"text": "make up the lens meet. These imperfections\nleave a very particular imprint on light as", "start": 117.509, "duration": 5.02}, {"text": "it passes by, as researchers have confirmed\nby shining lasers in people’s eyes.", "start": 122.529, "duration": 4.55}, {"text": "So, even though stars themselves are just\ntiny round dots, by the time the light reaches", "start": 127.079, "duration": 4.591}, {"text": "our retina, it's been smeared out into a starlike\nshape. Every single eye on earth will see", "start": 131.67, "duration": 5.45}, {"text": "a slightly different starlike smear depending\non the exact nature of its suture lines - even", "start": 137.12, "duration": 5.63}, {"text": "your left and right eyes will differ! What's\nweird, though, is that any particular eye", "start": 142.75, "duration": 4.629}, {"text": "sees the same shape for every star - so while\nit is scientifically acceptable to draw stars", "start": 147.379, "duration": 5.78}, {"text": "like this, if you draw more than one in a\nsingle picture, you better make sure they're", "start": 153.159, "duration": 3.881}, {"text": "all the exact same shape!", "start": 157.04, "duration": 1.509}, {"text": "On top of that, since diffraction spreads\nlonger wavelength red light out more than", "start": 158.549, "duration": 3.711}, {"text": "bluer light, the arms of these star-shapes\nare actually mini-rainbows with red on the", "start": 162.26, "duration": 4.66}, {"text": "outside and blue in the middle! Which, again,\nyou can see in hubble photographs or if you", "start": 166.92, "duration": 4.849}, {"text": "look even more carefully at a single point\nof light. So as crazy as it sounds, coloring", "start": 171.769, "duration": 4.621}, {"text": "in stars with rainbows is super scientifically\naccurate - as long as the colors go the right", "start": 176.39, "duration": 7.0}, {"text": "way.", "start": 188.319, "duration": 7.0}]