[{"text": "When working with power sources like their bench power supplies", "start": 0.74, "duration": 3.559}, {"text": "Batteries or even solar panels? It is sometimes mandatory to test how much current and power they can output over time", "start": 4.819, "duration": 7.91}, {"text": "this way you can determine their output capabilities or the true capacity or", "start": 13.73, "duration": 5.17}, {"text": "even track their output power in order to find a maximum power point", "start": 18.9, "duration": 0.5}, {"text": "Even track they'll put power in order to find a maximum power point", "start": 19.4, "duration": 4.25}, {"text": "Now in a previous video I already showed you how to create a simple constant current loads", "start": 24.86, "duration": 5.66}, {"text": "Which lucky name implies draws a constant current from our power source, even when the power source voltage varies", "start": 30.98, "duration": 7.279}, {"text": "But let's face it that circuit was not very intuitive to use and could not dissipate much heat", "start": 39.02, "duration": 6.55}, {"text": "Which means it is not suited to test big current loss", "start": 45.57, "duration": 0.5}, {"text": "Which means it is not suited to test big current Ross", "start": 46.07, "duration": 3.47}, {"text": "so in this video", "start": 50.66, "duration": 1.05}, {"text": "Let's step it up a notch and create a very intuitive to use adjustable constant loads", "start": 51.71, "duration": 5.779}, {"text": "Which not only offers a constant current and constant power modes", "start": 57.95, "duration": 3.589}, {"text": "But can also dissipate a lot more heat due to its heating and thus can be used for much higher current and power levels", "start": 61.94, "duration": 7.7}, {"text": "So let's not waste any more time and let's find out how I made it", "start": 70.76, "duration": 4.039}, {"text": "But can also dissipate a lot more heat due to its heatsink and thus can be used for much higher current and power levels", "start": 74.799, "duration": 4.361}, {"text": "This video is sponsored by jlc PCB in order to help electronic", "start": 87.29, "duration": 5.659}, {"text": "Enthusiasts to build their projects at a lower costs", "start": 93.439, "duration": 2.87}, {"text": "Jlc PCB provides a special offer only", "start": 96.92, "duration": 2.87}, {"text": "Two dollars for 10 PCBs per order with quick bail time and reliable quality", "start": 100.25, "duration": 5.329}, {"text": "Two dollars for 10 PCBs per order with quick reall time and reliable quality", "start": 105.579, "duration": 2.181}, {"text": "There are two main parts for these projects one of them is the power electronics parts", "start": 107.76, "duration": 5.389}, {"text": "basically how we measure the current and voltage of our power source and", "start": 113.85, "duration": 4.039}, {"text": "how we dissipate a precise and constant amount of its power in heat and", "start": 118.17, "duration": 4.789}, {"text": "The other part is the interface which deals with how the system will inputs and outputs the data", "start": 123.63, "duration": 6.229}, {"text": "the power electronics require and produce", "start": 130.14, "duration": 2.779}, {"text": "So let's start off with the power electronics parts whose main component will be a simple MOSFETs", "start": 133.68, "duration": 6.379}, {"text": "This one is an IRF", "start": 140.97, "duration": 1.14}, {"text": "Z44N who according to its data sheets can handle up to 55 volts and 49 amps", "start": 142.11, "duration": 0.5}, {"text": "Z44N who according to its data sheets can handle up to 55 volts and 49 amps", "start": 142.61, "duration": 0.5}, {"text": "Z44N who according to its data sheets can handle up to 55 volts and 49 amps", "start": 143.11, "duration": 0.5}, {"text": "who according to its data sheets can handle up to 55 volts and 49 amps", "start": 143.61, "duration": 0.5}, {"text": "who according to its data sheets can handle up to 55 volts and 49 amps", "start": 144.11, "duration": 0.5}, {"text": "who according to its data sheets can handle up to 55 volts and 49 amps", "start": 144.61, "duration": 0.5}, {"text": "who according to its data sheets can handle up to 55 volts and 49 amps", "start": 145.11, "duration": 0.5}, {"text": "who according to its data sheets can handle up to 55 volts and 49 amps", "start": 149.69, "duration": 0.7}, {"text": "But keep in mind that a 49 amp current draw can only be reached if the heat dissipation of the MOSFETs heatsink allows it", "start": 150.39, "duration": 7.04}, {"text": "By keeping it cool, which will most likely not be possible with my passive cooling solution", "start": 157.43, "duration": 0.5}, {"text": "By keeping it cool, which will most likely not be possible with my passive cooling solution", "start": 157.93, "duration": 0.5}, {"text": "By keeping it cool, which will most likely not be possible with my passive cooling solution", "start": 158.43, "duration": 6.29}, {"text": "But something like 3 amps at 6 volts is easily possible", "start": 165.33, "duration": 4.039}, {"text": "By looking further through the data sheets. We can also find the most important graph of the MOSFETs its typical output", "start": 170.46, "duration": 7.459}, {"text": "characteristics graph", "start": 178.68, "duration": 2.0}, {"text": "Usually you want to utilize a MOSFET in its ohmic or linear region on the left sides", "start": 180.75, "duration": 5.66}, {"text": "So that you get a minimum voltage drop across its range to source path and thus have minimal power losses", "start": 186.87, "duration": 6.47}, {"text": "But that is not what we want", "start": 194.16, "duration": 2.0}, {"text": "We want to get lots of power losses across the MOSFETs", "start": 196.2, "duration": 3.259}, {"text": "Which means we have to use it in its saturation region on the right sides", "start": 199.77, "duration": 4.399}, {"text": "there we got higher drain to source voltage drops and thus big power losses as", "start": 205.05, "duration": 5.27}, {"text": "An example I mounted the MOSFET to my big heatsink", "start": 211.14, "duration": 3.68}, {"text": "Connected its drain", "start": 215.58, "duration": 1.46}, {"text": "to the plus terminal of my power source", "start": 217.04, "duration": 1.679}, {"text": "its source to the minus terminal and its gates to another voltage source, which I slowly cranked up as", "start": 219.12, "duration": 6.68}, {"text": "You can see at a voltage level of around 3 point 4 volts", "start": 226.47, "duration": 3.41}, {"text": "the MOSFETs starts working in its saturation region and", "start": 230.489, "duration": 3.65}, {"text": "Thus can be used kind of like a variable power resistor", "start": 234.51, "duration": 4.009}, {"text": "Now, of course, we cannot use the graph to determine the gate voltage for each current a slash power draw", "start": 239.31, "duration": 6.619}, {"text": "Instead we have to measure the current and power values and then either increase or decrease the gate voltage", "start": 246.84, "duration": 6.979}, {"text": "To keep the measured values at a constant level", "start": 254.22, "duration": 2.54}, {"text": "For the current measuring I will be using an ACS seven one two, IC", "start": 257.85, "duration": 5.179}, {"text": "Which is a Hall effect based linear current sensor. I", "start": 263.4, "duration": 3.47}, {"text": "Went with the 20 M version which features a sensitivity of 102 millivolts per amp", "start": 267.69, "duration": 6.589}, {"text": "That means that once we power the IC and connect a power source to its terminals", "start": 275.19, "duration": 5.089}, {"text": "We can measure a voltage on its output terminal of around 2.5 or 2 volts at 0 amps", "start": 280.65, "duration": 5.989}, {"text": "2.60 2 volts at 1 amp", "start": 287.58, "duration": 2.0}, {"text": "2.70 2 volts at 2 amps and so on and on", "start": 290.22, "duration": 3.169}, {"text": "Later, we'll be sampling this voltage with the ADC of the Arduino and tasks at the current information we require for", "start": 294.389, "duration": 7.94}, {"text": "the current and power modes and", "start": 302.33, "duration": 2.04}, {"text": "Speaking of power modes for that. We also need to monitor the voltage of the power source", "start": 305.099, "duration": 5.63}, {"text": "That is why I utilized a voltage divider", "start": 311.729, "duration": 2.57}, {"text": "Consisting of a 10 kilo. Ohm and 2 kilo", "start": 314.97, "duration": 2.569}, {"text": "Ohm resistor, which will converge the maximum power source voltage of 30 volts down to 5 volts", "start": 317.539, "duration": 6.3}, {"text": "Once again, this voltage will then be sampled by the ADC of the Arduino and just like that", "start": 324.87, "duration": 6.589}, {"text": "We got all the measurement values we require", "start": 331.46, "duration": 2.61}, {"text": "To control the MOSFET gate though. We cannot simply use a pwm pin of the arduino. Nano", "start": 334.919, "duration": 5.69}, {"text": "Since that would be a signal with only 5 volts and ground logic levels", "start": 341.31, "duration": 4.429}, {"text": "Instead we can hook up the signal to a TCU 4420 MOSFET driver", "start": 346.949, "duration": 4.79}, {"text": "twos outputs we can connect a low-pass filter", "start": 352.26, "duration": 2.75}, {"text": "Whose job is to turn the square wave signal", "start": 355.71, "duration": 2.209}, {"text": "into an analog voltage", "start": 358.53, "duration": 1.62}, {"text": "Whose level is determined by the duty cycle of the PWM signal?", "start": 360.15, "duration": 4.25}, {"text": "With that voltage we can easily control the saturation region of the MOSFETs", "start": 365.37, "duration": 5.059}, {"text": "Which means we are done with the power electronics powers", "start": 370.77, "duration": 3.2}, {"text": "Next is the interface powered for which I utilized an I square C capable sixteen by two LCD year and a rotary encoder", "start": 375.09, "duration": 7.639}, {"text": "Which connect to pin a4 and a5 of the arduino and pin two three and four now?", "start": 383.52, "duration": 5.57}, {"text": "I have used this interface component combination in a lot of previous projects", "start": 389.58, "duration": 5.059}, {"text": "So feel free to watch them if you want more detailed information on how to interact with them", "start": 394.92, "duration": 5.3}, {"text": "But what is more important for the beginning is what kind of menu I want to create for the LCD?", "start": 401.1, "duration": 5.6}, {"text": "So I came up with a total of eight screens", "start": 407.52, "duration": 2.899}, {"text": "The first one basically greets the user and the second one lets you choose between power and current modes", "start": 411.27, "duration": 6.979}, {"text": "After choosing either modes the rest of the screens between the two modes is very similar", "start": 419.43, "duration": 4.819}, {"text": "In the first one, you can either select to change the power slash current start the test or go back", "start": 425.04, "duration": 6.619}, {"text": "when choosing to adjust the power slash current you can then", "start": 432.36, "duration": 3.44}, {"text": "obviously adjust those values and if you choose start you can see the set value and the currently measured value", "start": 436.17, "duration": 7.13}, {"text": "ofcourse, there's also a stop button  there", "start": 443.94, "duration": 2.3}, {"text": "all those eight screens", "start": 446.82, "duration": 1.77}, {"text": "Basically make up the whole system and let me tell you that after using this piece of equipment for quite a while", "start": 448.59, "duration": 6.469}, {"text": "I think this menu creation was the right choice", "start": 455.42, "duration": 3.059}, {"text": "But nevertheless let's move on to creating the hardware for the projects", "start": 459.6, "duration": 4.64}, {"text": "For which I skipped the breadboard prototype and immediately sold out all the required components to piece breadboard", "start": 464.58, "duration": 7.19}, {"text": "according to my finalized schematic and", "start": 472.08, "duration": 2.179}, {"text": "For connecting the LCD and rotary encoder, I utilized female headers and male-to-female had a wires", "start": 475.05, "duration": 7.16}, {"text": "Once the hardware prototype was complete. I started the programming for the Arduino", "start": 483.36, "duration": 5.269}, {"text": "Here is a simple overview of how I did it. I", "start": 489.18, "duration": 2.779}, {"text": "utilized interrupts to detect the turning of the rotary encoder and whether its push button was pushed and", "start": 492.84, "duration": 7.369}, {"text": "Through the help of a screen variable and of course a few other state variables as well", "start": 500.91, "duration": 5.209}, {"text": "I told the micontroller what to do at which menu screen when either", "start": 506.12, "duration": 5.1}, {"text": "Attorneys detectives or the button is pushed", "start": 511.53, "duration": 2.75}, {"text": "To actually implement the power electronics functionality. I utilized the 16 bit timer one of the", "start": 515.25, "duration": 7.01}, {"text": "atmega328p in order to create an 11 bits PWM signal", "start": 522.87, "duration": 4.7}, {"text": "Its duty cycle is represented by the OCR one a value and a zero percent duty cycle", "start": 528.51, "duration": 6.44}, {"text": "for the value 0 and", "start": 535.2, "duration": 2.0}, {"text": "100 percent duty cycle for the value", "start": 537.33, "duration": 2.779}, {"text": "2047", "start": 540.99, "duration": 1.5}, {"text": "When the power or current mode is then activated?", "start": 542.49, "duration": 2.66}, {"text": "this value increases or decreases", "start": 545.88, "duration": 2.119}, {"text": "depending on the measured values", "start": 549.06, "duration": 2.0}, {"text": "But there's a lot more going on in this code than just adds", "start": 551.19, "duration": 3.469}, {"text": "so feel free to download it through the link in the video description so that you can go through it line by line and", "start": 554.94, "duration": 7.25}, {"text": "After uploading the codes to the Arduino. My constant load prototype was complete", "start": 563.13, "duration": 5.479}, {"text": "all that was left to do was", "start": 569.37, "duration": 2.0}, {"text": "mounting the components inside a suitable enclosure and adding binding terminals for the power source inputs any", "start": 571.56, "duration": 7.13}, {"text": "DC jack to the 5 foods power inputs", "start": 579.089, "duration": 2.63}, {"text": "To finish up these projects. I also conducted a couple of tests which all turned out acceptable", "start": 582.63, "duration": 6.709}, {"text": "the only mentionable thing to notes which many viewers will probably complain about", "start": 590.04, "duration": 5.0}, {"text": "Is that a super precise down to milliamp or milliwatt loads cannot be achieved with the system?", "start": 595.47, "duration": 6.2}, {"text": "since the measure values all depends on a 10-bit ADC", "start": 602.16, "duration": 3.44}, {"text": "Whose resolution like the bit number implies is not that high", "start": 606.39, "duration": 4.549}, {"text": "So if you want to improve this builds", "start": 611.61, "duration": 2.03}, {"text": "Then feel free to add a batterer ADC and maybe even a better DAC for the MOSFET gate voltage", "start": 613.64, "duration": 6.63}, {"text": "This way you will get more precise and stable values", "start": 620.91, "duration": 3.38}, {"text": "But overall I'm still satisfied with the end results and I will hopefully continue improving the software side", "start": 625.05, "duration": 7.429}, {"text": "So that I can get rid of those oscillating measured values", "start": 632.82, "duration": 3.5}, {"text": "Anyway, I hope you enjoyed this very if so, don't forget to Like share and subscribe", "start": 637.5, "duration": 5.48}, {"text": "Stay creative and I will see you next time", "start": 644.19, "duration": 3.8}]