[{"text": "Hey guys salut it's Alex. Welcome back to the ramen addiction series this visit is part of my instant ramen", "start": 0.0, "duration": 6.029}, {"text": "addiction series I have this", "start": 6.279, "duration": 2.0}, {"text": "Love/hate relationship with ramen noodles. I mean I love them, but they hate me", "start": 8.679, "duration": 4.1}, {"text": "I mean they're not that good for me So I'm on a quest to build my own instant ramen noodle soup. Hopefully by now", "start": 12.78, "duration": 6.12}, {"text": "you know how to make fresh noodles, instant noodles, fresh broth, instant broth - I'm genuinely asking the", "start": 18.9, "duration": 6.84}, {"text": "Legitimate question is it the end like is it over?", "start": 26.04, "duration": 4.5}, {"text": "I mean despite all the effort. We did put in so far all we did is just a base really yeah", "start": 30.82, "duration": 6.32}, {"text": "You see whenever I need my ramen fix", "start": 37.14, "duration": 2.04}, {"text": "I never have it that pure or that minimal if you wish.", "start": 39.18, "duration": 3.959}, {"text": "I always add a few things along the way just to make it a real dish so today", "start": 43.36, "duration": 4.549}, {"text": "I'm gonna share with you four ramen hacks as known as four quick and dirty ways to just", "start": 47.91, "duration": 5.879}, {"text": "instantly upgrade your instant ramen noodle soup", "start": 54.12, "duration": 4.06}, {"text": "Okay so within this video I'm going to be using that beautiful", "start": 58.2, "duration": 3.98}, {"text": "Chef's knife from Victorinox that was sent to me by massdrop.com which is a", "start": 62.44, "duration": 5.0}, {"text": "Community driven commerce platform. I've got a cool surprise for you guys so be sure to stick to the end of this video", "start": 67.869, "duration": 6.29}, {"text": "But in the meantime", "start": 74.159, "duration": 0.791}, {"text": "Let's start with the first ramen upgrade. Begin with a tablespoon of soy sauce", "start": 74.95, "duration": 4.819}, {"text": "Then a teaspoon of our instant ramen broth, homemade of course, then another teaspoon of instant", "start": 80.26, "duration": 6.2}, {"text": "dashi...uhhh", "start": 87.08, "duration": 1.64}, {"text": "So FYI my instant dashi powder is just you know", "start": 88.72, "duration": 3.82}, {"text": "Katsuobushi and kombu blitz together into a fine powder", "start": 93.189, "duration": 3.8}, {"text": "Add a bunch of homemade instant noodles and cover that up with boiling water", "start": 97.39, "duration": 5.0}, {"text": "Let that sit on the side for about five minutes", "start": 102.39, "duration": 3.389}, {"text": "Afterwards add nori seaweed, a soft-boiled egg which I forgot and now it's a hard boiled egg, and fried bacon on the side", "start": 115.96, "duration": 7.76}, {"text": "So of course the classic side dish on ramen noodles is", "start": 124.18, "duration": 3.56}, {"text": "chashu pork", "start": 128.509, "duration": 1.051}, {"text": "Which is you know that marinated pork belly", "start": 129.56, "duration": 3.319}, {"text": "And you know that's fine on the weekend when you definitely got time to do it, but on weekdays, nah", "start": 132.879, "duration": 4.919}, {"text": "I just use bacon. Finishing with finely chopped spring onions in the center, so there you go", "start": 137.799, "duration": 5.91}, {"text": "It's a quick Tokyo style ramen noodle soup on the cheap of course", "start": 143.709, "duration": 4.38}, {"text": "But let's be clear using only homemade ingredients. Now, it's important", "start": 148.089, "duration": 4.231}, {"text": "itadakimasu! (I gratefully receive)", "start": 152.88, "duration": 1.48}, {"text": "What I really like about this ramen is the mix between the sea and the earth", "start": 157.76, "duration": 5.18}, {"text": "Like the nori seaweed and the dashi on one side and the pork and the chicken and the eggs on the other", "start": 163.43, "duration": 6.619}, {"text": "There is so many layers of flavor", "start": 170.12, "duration": 2.029}, {"text": "You've got the noodles, the broth, the dashi, the eggs, and the spring onion - for some nice freshness -", "start": 172.25, "duration": 5.929}, {"text": "Okay next: the second ramen upgrade is a very comforting one made to counter winter and ice and", "start": 180.92, "duration": 7.639}, {"text": "frost or just you know to recover from a", "start": 188.56, "duration": 2.84}, {"text": "Severe Hangover", "start": 191.4, "duration": 1.97}, {"text": "Start with a teaspoon of red miso then a teaspoon of our instant ramen broth.", "start": 193.37, "duration": 5.83}, {"text": "Add instant noodles and cover up with boiling water", "start": 199.5, "duration": 3.25}, {"text": "Let that sit on the side for five minutes. Afterwards add boiled ground pork and cabbage on the side", "start": 202.75, "duration": 6.72}, {"text": "But to me what it's truly special a bit of sweet corn and a good nub of butter", "start": 209.47, "duration": 6.52}, {"text": "Oh, they really bring the comfort to the next level like not this level like more like this level", "start": 216.03, "duration": 6.08}, {"text": "Finish it with the superfine nori seaweed", "start": 222.84, "duration": 2.38}, {"text": "This is like liquid comfort", "start": 228.78, "duration": 2.66}, {"text": "I think it's the butter and then the corn that really makes this dish more comforting and you know more reassuring", "start": 233.24, "duration": 6.02}, {"text": "Okay", "start": 241.36, "duration": 1.76}, {"text": "Next quick update guys. I've got some new and useful merch, it's gonna be available in my shop", "start": 243.12, "duration": 6.17}, {"text": "I'll put the link in the description box down below. It's two beautiful posters made around the", "start": 249.29, "duration": 6.23}, {"text": "mind-mapping situation", "start": 255.8, "duration": 1.68}, {"text": "it's all about herbs one is about", "start": 257.48, "duration": 2.4}, {"text": "Full-bodied herbs like. Thyme rosemary all that stuff and the other one is about fresh herbs like coriander, parsley", "start": 260.42, "duration": 6.84}, {"text": "You know all those fragile herbs. Hopefully they are gonna", "start": 267.26, "duration": 2.94}, {"text": "Help you in the kitchen big time", "start": 270.2, "duration": 2.609}, {"text": "And if you ask me they are a perfect Christmas gift ok ok ok ok ok back to ramen", "start": 273.3, "duration": 4.7}, {"text": "Third ramen upgrade, this ramen upgrade is really about what you can find at the moment at the market", "start": 278.28, "duration": 6.62}, {"text": "I've got carrots, soy bean sprouts zucchini, and mushrooms so that will be my ramen upgrade.", "start": 284.9, "duration": 5.72}, {"text": "Begin with a tablespoon of soy sauce,", "start": 290.62, "duration": 2.5}, {"text": "then a teaspoon of our instant ramen broth then another teaspoon of our instant dashi", "start": 293.12, "duration": 5.22}, {"text": "Add a bunch of instant noodle and cover that up with boiling water. Let that sit on the side for about five minutes", "start": 298.59, "duration": 6.74}, {"text": "Cut everything very finely and then add them to the bowl", "start": 311.43, "duration": 3.41}, {"text": "Finally give it a generous sprinkle of sesame seed", "start": 316.38, "duration": 2.809}, {"text": "And there you have it a homemade fresh and super convenient dish that just ticks all the boxes", "start": 319.19, "duration": 6.089}, {"text": "The simple super convenient fresh kick I need when I edit my videos", "start": 325.8, "duration": 5.39}, {"text": "You've got the nice fresh mushroom. You've got some", "start": 331.4, "duration": 2.79}, {"text": "Crunchy carrots you've got an egg for good protein, and then you've got some soybean sprouts just to bring some", "start": 334.71, "duration": 5.72}, {"text": "diversity in texture", "start": 341.28, "duration": 2.0}, {"text": "Mm-hmm", "start": 345.18, "duration": 1.02}, {"text": "Okay, next the last ramen upgrade is the one I use when I seriously need to wake up. Quite surprisingly", "start": 346.2, "duration": 7.7}, {"text": "Chili got on me the same impact coffee does which is basically a slap in the face", "start": 353.9, "duration": 6.26}, {"text": "Start with a teaspoon of chili bean sauce called doubanjiang, then a teaspoon of our instant ramen broth.", "start": 361.2, "duration": 7.6}, {"text": "Add instant noodle and cover that up with boiling water and let that sit on the side for five minutes.", "start": 368.98, "duration": 5.2}, {"text": "I think you get it now", "start": 374.18, "duration": 2.1}, {"text": "Afterwards add tofu cubes", "start": 380.74, "duration": 2.0}, {"text": "caramelized browned pork, a bit of kimchi - that Korean fermented", "start": 382.96, "duration": 4.66}, {"text": "Spicy cabbage - a few spring onions, finely chopped, and finish him and finish me too all that matter with a lavish", "start": 388.56, "duration": 7.88}, {"text": "sprinkling of szechuan peppercorn powder and a completely unnecessary drizzle of", "start": 396.819, "duration": 5.69}, {"text": "Chili oil that could possibly wake up a dead person, or you know make me one", "start": 402.88, "duration": 5.54}, {"text": "ooohh I can already feel the heat coming through!", "start": 410.7, "duration": 3.9}, {"text": "Wish me luck", "start": 415.6, "duration": 2.38}, {"text": "I don't know why it hurts so bad but it tastes so good", "start": 427.54, "duration": 2.56}, {"text": "Okay", "start": 432.54, "duration": 2.0}, {"text": "And now a few words about the victorinox", "start": 437.96, "duration": 3.28}, {"text": "8-inch fibrox chef's knife honestly", "start": 441.36, "duration": 2.72}, {"text": "I like everything about this like this sharpness the way the handle and last but not least a good price point to me", "start": 444.08, "duration": 7.22}, {"text": "That's how knives should be like", "start": 451.32, "duration": 2.0}, {"text": "Reliable and inexpensive and the guys at Massdrop made it even better by getting that beauty under", "start": 453.78, "duration": 7.58}, {"text": "$30 if you ask me, that's a steal", "start": 462.12, "duration": 3.1}, {"text": "I'll share the link to that time-limited offer in the description box down below.", "start": 468.16, "duration": 4.12}, {"text": "So guys that's it, I hope you enjoyed this ramen upgrade ramen hacks video if you did", "start": 472.54, "duration": 5.18}, {"text": "Please give it a big thumbs up, like it and share that over all your social media. You know how it works", "start": 477.73, "duration": 4.829}, {"text": "Just spread it like butter if you have a personal favorite ramen upgrade", "start": 482.56, "duration": 3.93}, {"text": "Please share that in the comments down below so that", "start": 486.49, "duration": 2.189}, {"text": "Everyone can benefit from this and lastly please click subscribe because I make new videos every week, and if it's always about food", "start": 489.08, "duration": 6.079}, {"text": "It's often about ramen those days. Let's be honest", "start": 495.16, "duration": 3.45}, {"text": "It's more, or less about just giving you the power to cook in the kitchen okay?", "start": 498.64, "duration": 5.28}, {"text": "Take care. Bye. Bye. Salut", "start": 504.68, "duration": 2.0}]