[{"text": "Today's video has been sponsored by Dashlane. In today's world,", "start": 0.0, "duration": 0.0}, {"text": "everything requires a password. Even worse, each one of these has their own set of very specific", "start": 0.0, "duration": 0.0}, {"text": "requirements. One special character, one number, one capital letter...", "start": 0.0, "duration": 0.0}, {"text": "It's a mess!", "start": 0.0, "duration": 0.0}, {"text": "How awesome would it be if you could throw all of these into just one app?", "start": 0.0, "duration": 0.0}, {"text": "That's where Dashlane comes in - Dashlane is a multi-platform and", "start": 0.0, "duration": 0.0}, {"text": "multifunction secure password and digital identity manager that takes the stress out of your everyday login struggle.", "start": 0.0, "duration": 0.0}, {"text": "Gone are the days of remembering an endless list of login credentials,", "start": 0.0, "duration": 0.0}, {"text": "credit card info and clicking that dreaded forgot password button to reset yours for the 50th time as this one service can remember them all", "start": 0.0, "duration": 0.0}, {"text": "for you. All it takes is one master password to access your virtual and secure vault and you can not only add", "start": 0.0, "duration": 0.0}, {"text": "logins, but with their low price Premium Subscription,", "start": 0.0, "duration": 0.0}, {"text": "secure notes, online checkout information, personal ID cards and contacts.", "start": 0.0, "duration": 0.0}, {"text": "Even better, this membership includes access to their Virtual Private Network, dark web monitoring,", "start": 0.0, "duration": 0.0}, {"text": "secure password generation and complete seamless info synchronization across all of your devices.", "start": 0.0, "duration": 0.0}, {"text": "The really cool thing about this is that if there's any breach at all with any of your info that's linked to the service, the", "start": 0.0, "duration": 0.0}, {"text": "app will promptly notify you and help you take action accordingly.", "start": 0.0, "duration": 0.0}, {"text": "If password security is important to you online, I highly recommend trying them out.", "start": 0.0, "duration": 0.0}, {"text": "I've been using it for about a month or so now and it's by far the best password manager that I've used to date.", "start": 0.0, "duration": 0.0}, {"text": "Check out the link in the description, dashlane.com/Nexpo, to try it out for free.", "start": 0.0, "duration": 0.0}, {"text": "Even better, the first 200 to put in code Nexpo at checkout will get 10% off a subscription of Dashlane Premium,", "start": 0.0, "duration": 0.0}, {"text": "should you choose to try that out.", "start": 0.0, "duration": 0.0}, {"text": "Definitely get on this. It's  dashlane.com/Nexpo", "start": 0.0, "duration": 0.0}, {"text": "Throughout time, fascination with death has been an ongoing and shared subject for many.", "start": 34.149, "duration": 4.34}, {"text": "The grim, oddly fascinating part about the afterlife", "start": 39.129, "duration": 2.839}, {"text": "Involves a possibility of forming some sort of connection with a lingering entity or loved one that might have passed.", "start": 42.279, "duration": 4.94}, {"text": "Oftentimes, either to satisfy this curiosity or to cope with loss,", "start": 48.428, "duration": 3.62}, {"text": "people will attempt to contact the dead by either visiting their gravesite or, in more extreme cases,", "start": 52.329, "duration": 4.309}, {"text": "by using certain communication devices such as a Ouija board or some sort of radio.", "start": 56.889, "duration": 4.429}, {"text": "By this point in time, as we all know, these definitely provide heavily mixed results depending on who you are", "start": 62.079, "duration": 5.869}, {"text": "But, what about those that take this fascination too far?", "start": 68.919, "duration": 3.32}, {"text": "Historically, we've had a few very infamous names pop up about certain people keeping dead bodies for themselves.", "start": 73.389, "duration": 5.66}, {"text": "Such was the case with Carl Tanzler, the necrophile that kept a deceased and mummified", "start": 79.839, "duration": 5.49}, {"text": "22 year old in his home to live with him for over seven years.", "start": 85.449, "duration": 2.88}, {"text": "This case is crazy in and of itself, but it's been covered time and time again.", "start": 89.169, "duration": 4.699}, {"text": "Because of this I wanted to focus on a similar, if not slightly more extreme situation that came to light a few years ago", "start": 94.568, "duration": 6.32}, {"text": "surrounding the bizarre happenings of a Russian man by the name of Anatoly Moskvin.", "start": 101.619, "duration": 4.97}, {"text": "Moskvin is a 52 year old that, back in the mid to late 2000s,  was regarded a genius by many.", "start": 116.369, "duration": 5.149}, {"text": "He was a historian who authored various scientific papers and acquired the knowledge of upwards of 13 different languages.", "start": 122.159, "duration": 6.169}, {"text": "Many of his peers and family saw him as a quiet, ordinary person with no real cause for concern regarding his behavior.", "start": 128.819, "duration": 6.41}, {"text": "The thing is though, he had this unforgiving obsession with the afterlife", "start": 135.779, "duration": 4.25}, {"text": "and the scientific papers and magazine publications that he would provide over the years", "start": 140.129, "duration": 3.9}, {"text": "would actually come to assist in explaining the secret and deeply outlandish behavior that he was committing right under everyone's nose.", "start": 144.129, "duration": 6.729}, {"text": "You see, Moskvin was a very disturbing character.", "start": 151.769, "duration": 4.96}, {"text": "In late 2011 he had single-handedly thrown Russian police and media", "start": 156.829, "duration": 3.63}, {"text": "Into a whirlwind down one of the darkest and most bizarre criminal cases in the country's history.", "start": 160.709, "duration": 5.419}, {"text": "Backing up to 1966, Anatoly was born in Nizhny Novgorod, Russia to his parents by the names of", "start": 177.398, "duration": 6.031}, {"text": "Yuri Fedorovich and Elvira Alexandrovna.", "start": 183.529, "duration": 3.9}, {"text": "According to his parents, he was very socially awkward and had pretty intense difficulty making friends. On the flip side of this,", "start": 187.479, "duration": 6.5}, {"text": "he was extremely smart and his parents simply chalked up his awkwardness to his intelligence, not thinking much of it.", "start": 194.189, "duration": 6.059}, {"text": "Young Anatoly had a childhood that was far from conventional though.", "start": 201.099, "duration": 3.619}, {"text": "According to an account by him, for example, one day in the third grade", "start": 205.479, "duration": 4.15}, {"text": "he had returned home from school completely covered in bruises.", "start": 209.639, "duration": 3.19}, {"text": "As it turns out, these were caused by a man that raped him sometime that day.", "start": 213.029, "duration": 4.3}, {"text": "To date, it's unclear whether he ever relayed that information to his parents or not.", "start": 217.329, "duration": 4.9}, {"text": "This was far from the first odd instance that played out in his youth.", "start": 223.868, "duration": 3.47}, {"text": "In fact, one could argue that what we're about to discuss was the true beginning of his obsession with the very unconventional topic: the dead.", "start": 227.338, "duration": 9.191}, {"text": "This fascination stems way back to when he was only 13. In a local weekly publication that focuses on cemeteries and obituaries", "start": 238.269, "duration": 7.819}, {"text": "Moskvin outlines a very strange ritual that he found himself tangled up in. In the publication dated", "start": 246.428, "duration": 6.32}, {"text": "October 26th, 2011, he explains that a group of men in black suits stopped him on his way home from school.", "start": 252.968, "duration": 5.63}, {"text": "They were in route to the funeral of 11 year old Natasha Petrova and ended up", "start": 258.968, "duration": 4.579}, {"text": "dragging young Anatoly along to her coffin where they forced him to kiss the girls' corpse.", "start": 263.708, "duration": 4.13}, {"text": "Further on in his writing, he explains that, quote, \"I kissed her once. Then again. Then again.\"", "start": 268.629, "duration": 7.9}, {"text": "Afterwards, the girl's mother then allegedly placed a wedding ring on the 13 year old's finger and one on the hand of her dead daughter.", "start": 276.778, "duration": 5.839}, {"text": "\"My strange marriage with Natasha Petrova was useful.\" Moskvin claimed", "start": 283.828, "duration": 4.25}, {"text": "Useful it was, as Moskvin's unapologetic obsession with the undead was just beginning to take root.", "start": 289.048, "duration": 7.309}, {"text": "After this, Moskvin began to have very ominous dreams about the dead girl.", "start": 300.028, "duration": 3.829}, {"text": "According to him, she would visit him nightly and would try to profess her knowledge of black magic upon him whilst pleading for him to", "start": 304.438, "duration": 6.35}, {"text": "return to the village where the ritual had taken place.", "start": 310.788, "duration": 2.19}, {"text": "Apparently, after heading back there, the visitation stopped.", "start": 314.248, "duration": 2.809}, {"text": "But this would be short lived, as once he ceased to visit it regularly, she would once again appear in his dreams", "start": 317.458, "duration": 5.779}, {"text": "Reporting this to his parents was ineffective at best, as they simply took him to a doctor that chalked it up to Moskvin enduring puberty.", "start": 324.358, "duration": 7.071}, {"text": "With this diagnosis, he also went forth to prescribe him Valerian, an herbal sedative that aids in relaxation.", "start": 331.708, "duration": 6.139}, {"text": "After an entire year of visits by Natasha, she would eventually grow tired of Moskvin's refusals to do what she wanted.", "start": 338.758, "duration": 6.019}, {"text": "Since this was the case,", "start": 345.448, "duration": 1.17}, {"text": "she tasked him with performing a black magic ritual using a classmate's tooth in exchange for her leaving him alone forever.", "start": 346.618, "duration": 6.769}, {"text": "Somehow, according to Moskvin, this ritual was carried out successfully, and as a result, she never came back again", "start": 354.988, "duration": 6.889}, {"text": "This so-called \"task\" would have other implications on his life however,", "start": 364.429, "duration": 4.54}, {"text": "as it successfully kicked off Anatoly's interest in black magic and the occult.", "start": 369.109, "duration": 4.16}, {"text": "Later on in life, Moscov studied at the", "start": 374.689, "duration": 2.4}, {"text": "University of Moscow and earned a degree in Celtic studies, a culture that bears a very close blend in beliefs between life and death.", "start": 377.089, "duration": 6.289}, {"text": "Also, he would go on to join the Society of the Luciferians and would embrace the left-hand path which bears a focus on sexual magic", "start": 384.169, "duration": 7.04}, {"text": "and personal anarchy.", "start": 391.209, "duration": 2.0}, {"text": "This, coupled with his interest in black magic, would result in Moskvin performing various rituals on dead animals and", "start": 393.649, "duration": 6.529}, {"text": "eventually vowing celibacy.", "start": 400.368, "duration": 2.0}, {"text": "After graduation, it became known that he had grown to acquire extensive knowledge of the intricacies of all the surrounding cemeteries in his area.", "start": 403.218, "duration": 7.61}, {"text": "When sharing his knowledge throughout his various writings,", "start": 411.558, "duration": 2.51}, {"text": "he claims that he went to upwards of over seven hundred and fifty two of them from 2005 to", "start": 414.069, "duration": 4.739}, {"text": "2007 in his home town for his so-called \"research trip.\"", "start": 419.149, "duration": 3.95}, {"text": "Assisted by a well-known historian named Oleg Riabov,", "start": 425.418, "duration": 3.14}, {"text": "the two began their trek across the region to document cemeteries and to unearth local history along the way.", "start": 428.629, "duration": 5.63}, {"text": "The end goal was to publish a book by the name of Nizhny Novgorod Necropolis", "start": 435.069, "duration": 4.48}, {"text": "that contained all of his findings, but as you might have guessed, Moskvin had ulterior motives in mind.", "start": 439.669, "duration": 7.06}, {"text": "In 2009, local residents began to notice that the gravesites of their loved ones were either desecrated or dug up entirely.", "start": 448.829, "duration": 5.88}, {"text": "This eventually led to a two-year long investigation into these occurrences that seemed to lead nowhere at all.", "start": 455.449, "duration": 6.409}, {"text": "In 2011 an anti-muslim terror attack would unfold at the airport in Moscow and, very shortly afterwards,", "start": 463.229, "duration": 6.12}, {"text": "authorities caught wind of some Muslim grave sites that were allegedly being dug up and vandalized.", "start": 469.559, "duration": 4.32}, {"text": "After going to investigate that for a potential terror suspect, Moskvin would quickly jump to act like he was simply painting over some gravestones.", "start": 474.699, "duration": 6.32}, {"text": "But he was, in turn, promptly arrested, caught red-handed in the act of vandalism.", "start": 481.479, "duration": 5.45}, {"text": "Shortly afterwards, police would then launch an investigation into these bizarre acts by Moskvin, and the first place of interest to search", "start": 488.979, "duration": 6.619}, {"text": "was his living quarters.", "start": 496.059, "duration": 2.0}, {"text": "Fully expecting Moskvin to be an extremist,", "start": 498.209, "duration": 2.34}, {"text": "they were anticipating the discovery of various anti-muslim propaganda to litter his living quarters.", "start": 500.549, "duration": 5.14}, {"text": "What they would find in reality, however, would leave police completely baffled.", "start": 506.569, "duration": 4.0}, {"text": "The raid, which took place in an apartment that he actually shared with his parents, ended up leading to the discovery of", "start": 511.269, "duration": 7.28}, {"text": "29 life-sized dolls.", "start": 518.849, "duration": 2.88}, {"text": "\"Russian police have released this video they shot in what can be described as a house of horrors.", "start": 525.729, "duration": 5.12}, {"text": "They say those aren't dolls strewn about the apartment,", "start": 531.049, "duration": 2.929}, {"text": "but actual remains of people a historian had dug up and dressed in women's clothing and then put on display.\"", "start": 533.979, "duration": 6.21}, {"text": "The figures, heavily representing antique dolls, wore various types of clothing.", "start": 541.729, "duration": 4.34}, {"text": "Apparently, Moskvin dressed all of these up in makeup, even going as far as to place buttons or various circular objects in their eye sockets", "start": 546.919, "duration": 6.83}, {"text": "to give them a more lifelike appearance.", "start": 553.749, "duration": 2.0}, {"text": "The thing is though, these weren't simply dolls", "start": 556.789, "duration": 3.169}, {"text": "Rather, these were all created with the dead corpses of girls ranging in age from 3 to just 12 years old.", "start": 560.569, "duration": 7.519}, {"text": "Even more disturbing, when police began to move the bodies in this investigation,", "start": 569.449, "duration": 3.529}, {"text": "most of them would emit some sort of jingle, and it was later revealed that Moskvin stuffed each of the rib cages", "start": 573.339, "duration": 4.92}, {"text": "with music boxes so they could emit some sort of audible feedback when he interacted with them.", "start": 578.389, "duration": 4.549}, {"text": "Moskvin also allegedly kept track of their birthdays in his room and celebrated them when the time came.", "start": 584.299, "duration": 4.489}, {"text": "According to police, there were photographs and plaques taken off of gravestones, doll making manuals and maps of local cemeteries littering the apartment.", "start": 589.669, "duration": 7.82}, {"text": "Furthermore, the clothes that most of these dolls were wearing were the actual clothes in which they were buried.", "start": 598.249, "duration": 5.63}, {"text": "Moskvin later admitted that he achieved structural integrity of the corpses by wrapping their legs and arms with rags before stuffing those into nylon tights.", "start": 605.959, "duration": 7.43}, {"text": "He performed this for each of their limbs and their faces before inserting buttons into their eye sockets as to, quote,", "start": 614.299, "duration": 6.44}, {"text": "\"Allow them to watch cartoons with him.\"", "start": 620.929, "duration": 2.0}, {"text": "In police interrogations that followed, he claimed that he loved most of them, however they were a few that he simply wasn't content with.", "start": 624.608, "duration": 6.41}, {"text": "The ones that he had grown to dislike were promptly stuffed into their small garage and left to be forgotten.", "start": 631.689, "duration": 5.419}, {"text": "Apparently, he did all this out of loneliness.", "start": 638.529, "duration": 2.119}, {"text": "His parents claimed that he'd grown this massive obsession with creating life-sized dolls and bizarrely didn't think much of it,", "start": 640.929, "duration": 5.78}, {"text": "regardless of the smell that he would emit.", "start": 647.108, "duration": 2.0}, {"text": "\"We saw these dolls, but we did not suspect there were dead bodies inside.", "start": 649.989, "duration": 3.169}, {"text": "We thought it was his hobby to make such big dolls and we didn't see anything wrong with it.\" his mother claimed in an interview.", "start": 653.288, "duration": 5.809}, {"text": "According to a neighbor, there would be a constantly putrid smell that would emit from their apartment every time he passed by,", "start": 661.149, "duration": 5.68}, {"text": "however he chopped it up to being a sewage problem below the building, not thinking much of it.", "start": 666.889, "duration": 4.26}, {"text": "Out of all the corpses that he kept locked up in his apartment,", "start": 671.918, "duration": 2.48}, {"text": "there was one of them that was with him for upwards of nine years.", "start": 674.799, "duration": 3.109}, {"text": "With all these findings by police, Moskvin was eventually charged with extremely heavy crimes.", "start": 678.788, "duration": 5.239}, {"text": "In late 2011, with new nicknames given by the media such as \"Lord of the Mummies\" and \"The Puppeteer\",", "start": 685.778, "duration": 6.14}, {"text": "Moskvin eventually confessed to 44 counts of grave abuse and was sentenced to a psychiatric ward shortly afterwards.", "start": 692.408, "duration": 6.29}, {"text": "There, he was diagnosed with schizophrenia and has been in confinement ever since.", "start": 699.668, "duration": 4.369}, {"text": "It's been reported that Moskvin was repeatedly beaten by guards at this facility, and", "start": 705.309, "duration": 4.01}, {"text": "according to his mother, was also fed up to 15 pills per day, which kept him in a catatonic state.", "start": 709.509, "duration": 5.089}, {"text": "Since this was the case, a human rights lawyer by the name of Violetta Volkova was hired to represent Moskvin.", "start": 715.269, "duration": 6.44}, {"text": "Her end goal was to get him out of this facility and into an independent clinic in Moscow for re-examination,", "start": 722.199, "duration": 5.059}, {"text": "expressing a primary distrust in the wards' doctors.", "start": 727.929, "duration": 3.109}, {"text": "This grueling legal fight ended up earning him a second hearing, and as of September of 2018,", "start": 733.549, "duration": 5.299}, {"text": "he was offered the opportunity to continue his psychiatric treatment at home, and alongside this, the ability to essentially walk free.", "start": 738.889, "duration": 7.7}, {"text": "As you might expect though, this decision has been met with pretty heavy controversy.", "start": 747.619, "duration": 4.849}, {"text": "One of the victims' mothers, a woman by the name of Natalia Chardymova, didn't realize that this entire time,", "start": 765.258, "duration": 5.84}, {"text": "she was visiting an empty coffin when going to her daughter's gravesite.", "start": 771.429, "duration": 3.119}, {"text": "The corpse of her daughter Olga was one of the 29 girls that he dug up and kept locked up in his home.", "start": 775.458, "duration": 5.84}, {"text": "Apparently, she had been brutally murdered at age ten, and it's completely tragic to think about what this mother could have gone through during that.", "start": 782.148, "duration": 6.169}, {"text": "Coming to the realization that her daughter was taken from her not only once, but a second time", "start": 789.228, "duration": 4.52}, {"text": "Infuriates her, and she's one of the very many that unapologetically opposed the potential release of him.", "start": 794.119, "duration": 5.69}, {"text": "\"He needs to be kept under surveillance. This creature brought fear, terror and panic into my life.\"", "start": 802.549, "duration": 5.51}, {"text": "Anatoly Moskvin is set to walk free from a psychiatric ward sometime this year.", "start": 811.709, "duration": 4.4}, {"text": "The order of his containment with the facility was set to expire last December,", "start": 816.429, "duration": 3.82}, {"text": "so his release comes in only a matter of time.", "start": 820.429, "duration": 2.0}, {"text": "While he might walk as a quote-unquote \"free man\",", "start": 823.559, "duration": 3.049}, {"text": "his crimes will forever go down as some of the darkest and most bizarre in history.", "start": 826.829, "duration": 5.0}, {"text": "The emotions that these parents are going through is completely inconceivable,", "start": 833.098, "duration": 3.41}, {"text": "and we can only hope that authorities keep a close eye on him for the remainder of his life, as he could very easily", "start": 836.699, "duration": 5.239}, {"text": "still possess the inner drive to continue with his disturbing antics.", "start": 842.329, "duration": 4.709}, {"text": "Thank you so much for watching. I'll see you in the next one. I love you all, and good night.", "start": 852.429, "duration": 5.149}]