[{"text": "Mexico has got a lot going on in its history,", "start": 0.16, "duration": 2.8}, {"text": "from ancient civilizations building temples to the Sun and sowing panic about the year 2012,", "start": 2.96, "duration": 4.28}, {"text": "to a great Empire with a city in the middle of a lake and a habit of hucking people off of pyramids,", "start": 7.24, "duration": 3.98}, {"text": "to its less-than-willing participation in New World globalization", "start": 11.22, "duration": 3.18}, {"text": "and its development into an independent nation-state.", "start": 14.4, "duration": 2.42}, {"text": "To put that into proper historical terminology, that's a lot of stuff going on.", "start": 16.82, "duration": 4.74}, {"text": "So to organize this and find out how Mexico became Mexico, let's do some history.", "start": 21.56, "duration": 5.04}, {"text": "This video is brought to you by Nord VPN, more on that later.", "start": 26.6, "duration": 3.14}, {"text": "While civilization along this stretch of land dates back thousands of years to players like the Olmecs, the Zapotecs and the Maya,", "start": 29.74, "duration": 5.94}, {"text": "our story begins in the power vacuum left by the collapse of the Toltec Empire in 1122AD.", "start": 35.68, "duration": 4.72}, {"text": "In the absence of any one dominant power, a series of small city-states carved out their own little corners of influence.", "start": 40.4, "duration": 5.44}, {"text": "200 years later, the Mexica tribe settled right in the middle of Lake Texcoco to fulfill...", "start": 45.84, "duration": 5.22}, {"text": "A Prophecy™", "start": 51.06, "duration": 0.86}, {"text": "* airhorn *", "start": 51.92, "duration": 0.5}, {"text": "They were told that the apparition of an eagle perched atop a cactus and eating a snake would mark their new home,", "start": 52.42, "duration": 5.04}, {"text": "so upon seeing it, rather than look a gift eagle in the beak,", "start": 57.46, "duration": 2.94}, {"text": "they camped out right in the lake and began building the city of Tenochtitlan.", "start": 60.4, "duration": 3.24}, {"text": "The Mexica then allied with two of their neighbors to form the Aztec Empire.", "start": 63.64, "duration": 3.5}, {"text": "Through a combination of military skills, some fetching outfits, and a trusty obsidian macuahuitl,", "start": 67.14, "duration": 4.78}, {"text": "the Aztec Empire grew to dominate the land from coast to coast.", "start": 71.92, "duration": 3.04}, {"text": "Meanwhile, the capital of Tenochtitlan became a fabulously huge and beautiful city of canals, palaces, markets, aqueducts, and more...", "start": 74.96, "duration": 6.72}, {"text": "* door breaks down *", "start": 81.68, "duration": 1.4}, {"text": "¿Donde esta el Dorado?\nWhere is el Dorado?", "start": 83.08, "duration": 1.62}, {"text": "And... then the conquistadors showed up.", "start": 84.7, "duration": 2.48}, {"text": "Some 30 years after Columbus accidentally wandered into the Caribbean, Spain was in full-on empire mode,", "start": 87.18, "duration": 5.6}, {"text": "though there wasn't a great deal to be found in the Antilles,", "start": 92.78, "duration": 2.32}, {"text": "some scouts brought word that there was a shiny big civilization to sack on the mainland to the west.", "start": 95.1, "duration": 4.28}, {"text": "So one enterprising gentleman by the name of Hernán Cortés defied the Crown's orders", "start": 99.38, "duration": 3.72}, {"text": "and hopped over to the mainland in 1519 with some 500 fellow conquistadors,", "start": 103.1, "duration": 4.18}, {"text": "the absolute greediest and nastiest brutes that Renaissance Spain had to offer.", "start": 107.28, "duration": 4.14}, {"text": "While the numbers game wasn't strictly in Spain's favour,", "start": 111.42, "duration": 2.32}, {"text": "they had steel swords and armor that made the obsidian blades and wooden shields look like paper mâché.", "start": 113.74, "duration": 4.72}, {"text": "Now the Aztecs, being a conquering Empire, had made a series of enemies, like their neighbors the Tlaxcalans,", "start": 118.46, "duration": 5.42}, {"text": "who were all too thrilled to offer thousands of warriors for Cortés' army,", "start": 123.88, "duration": 3.5}, {"text": "but perhaps the most deadly ally that Spain had in this fight was smallpox,", "start": 127.38, "duration": 3.78}, {"text": "which, among other European diseases, killed anywhere from half to 90% of the native Mesoamerican population.", "start": 131.16, "duration": 5.54}, {"text": "After Cortés kidnapped King Moctezuma, dodged an arrest attempt from his commanding officer,", "start": 136.7, "duration": 4.38}, {"text": "and ordered his ships to be burns to ensure there was no possibility of retreat,", "start": 141.08, "duration": 3.56}, {"text": "the conquistadors captured Tenochtitlan in 1521 after several battles and a long siege,", "start": 144.64, "duration": 4.68}, {"text": "and fully eradicated the Aztec Empire.", "start": 149.32, "duration": 2.42}, {"text": "And now with all that icky Pagan nonsense out of the way, Spain's got itself a brand new Spain!", "start": 151.74, "duration": 4.64}, {"text": "Step one was to stop Cortés from acting like a de facto monarch, because why would he exercise restraint now?", "start": 156.38, "duration": 5.28}, {"text": "Back in Spain, King Charles V created a series of advisory boards to attempt to rein in Cortés,", "start": 161.66, "duration": 5.04}, {"text": "but when that didn't work, Charles just stripped him of his powers and established the Viceroyalty of New Spain in 1535.", "start": 166.7, "duration": 5.5}, {"text": "Step two was building up a new capital on the site of Tenochtitlan,", "start": 172.2, "duration": 3.16}, {"text": "which was newly renamed after the old tenants of the Aztec Mexica tribe,", "start": 175.36, "duration": 3.8}, {"text": "which is where we get the name, Mexico.", "start": 179.16, "duration": 2.16}, {"text": "Step three was governing the place.", "start": 181.32, "duration": 2.16}, {"text": "In addition to the power of the monarchy, Spain formalized their superiority over the native peoples through a casta system,", "start": 183.48, "duration": 5.3}, {"text": "which classified everyone from Iberian-born Spaniards down to indigenous peoples", "start": 188.78, "duration": 3.92}, {"text": "with Mexican-born Criollos and mixed-blood Mestizos in the middle.", "start": 192.7, "duration": 3.14}, {"text": "Step three-and-a-half was adopting an old Aztec law mandating public labor", "start": 195.84, "duration": 3.34}, {"text": "and transforming that into the Spanish encomienda system,", "start": 199.18, "duration": 2.78}, {"text": "which wasn't technically slavery, but it was pretty dang close.", "start": 201.96, "duration": 3.58}, {"text": "Step four was Christianity.", "start": 205.54, "duration": 1.54}, {"text": "In New Spain, the Catholic Church had land, power, and an undying determination to convert everybody.", "start": 207.08, "duration": 5.56}, {"text": "Polytheism is usually pretty open to new gods, so getting Jesus in was fairly easy,", "start": 212.64, "duration": 5.1}, {"text": "but getting Quetzalcoatl, Tezcatlipoca, and the rest of the gang out was far trickier.", "start": 217.74, "duration": 5.12}, {"text": "So missionaries got a bit torch happy and burned countless texts.", "start": 222.86, "duration": 3.96}, {"text": "A few did attempts to limit the harmful effects of colonization,", "start": 226.82, "duration": 2.68}, {"text": "but they got pushback for suggesting that non-Spaniards had-", "start": 229.5, "duration": 2.98}, {"text": "* gasp *", "start": 232.76, "duration": 0.56}, {"text": "basic human dignity.", "start": 233.44, "duration": 1.28}, {"text": "And others used Aztec human sacrifice as justification that hippity-hoppity, your soul is my property,", "start": 234.88, "duration": 4.94}, {"text": "so, it was a rocky process.", "start": 239.82, "duration": 1.68}, {"text": "The Aztec heartland quickly became the new urban core,", "start": 241.5, "duration": 2.78}, {"text": "with spots like Mexico City and Guadalajara inland and Veracruz and Acapulco on the coasts,", "start": 244.28, "duration": 4.7}, {"text": "but cities were soon going up all over New Spain.", "start": 248.98, "duration": 2.56}, {"text": "Though as this is colonialism we're talking about,", "start": 251.54, "duration": 2.56}, {"text": "the real aim was to bring resources and wealth back to Iberia, and that came in the form of food and silver.", "start": 254.1, "duration": 5.64}, {"text": "While some Spaniards were still hunting for El Dorado, and surprising nobody but themselves, failing horribly,", "start": 259.74, "duration": 5.78}, {"text": "silver became the dominant metal export.", "start": 265.52, "duration": 2.22}, {"text": "And the Old World soon got to taste cocoa, chiles, corn and tomatoes,", "start": 267.74, "duration": 3.64}, {"text": "which boosted and also stabilized the European food supply.", "start": 271.38, "duration": 2.94}, {"text": "The problem for Spain was that they didn't really have all that great a grasp on macroeconomics,", "start": 274.32, "duration": 4.12}, {"text": "so they over-inflated their economy and squandered their money on losing wars.", "start": 278.44, "duration": 3.86}, {"text": "Spanish powers swiftly dimmed and France and Britain soon got to flexing their might in the New World.", "start": 282.3, "duration": 4.78}, {"text": "And at the end of the 18th century, Mexico fought alongside America during their war of independence,", "start": 287.08, "duration": 4.36}, {"text": "and the Mexican soldiers who were there took some notes to bring home.", "start": 291.44, "duration": 2.86}, {"text": "At the turn of the 1800s, Mexicans were fed up with the casta system and its favoritism of Spanish-born Peninsulares,", "start": 294.3, "duration": 5.98}, {"text": "and with the success of recent American and Haitian revolutions,", "start": 300.28, "duration": 2.74}, {"text": "Mexico was willing to give it a go at themselves.", "start": 303.02, "duration": 2.12}, {"text": "On September 16th of 1810,", "start": 305.14, "duration": 1.76}, {"text": "a Carrillo Priest named Miguel Hidalgo took advantage of Spain's current kingless-ness", "start": 306.9, "duration": 3.6}, {"text": "to give the cry of Dolores and begin the war of independence,", "start": 310.5, "duration": 2.64}, {"text": "which... he... lost...", "start": 313.14, "duration": 2.08}, {"text": "but his idea lasted.", "start": 315.22, "duration": 1.38}, {"text": "The revolution went on in fits and starts for the next decade with some constitutions, but not a lot of independence.", "start": 316.6, "duration": 5.8}, {"text": "The problem was that nobody could agree on what they wanted out of the revolution - independence, a republic, equal rights? All three?", "start": 322.4, "duration": 7.3}, {"text": "Depends on who you asked.", "start": 329.7, "duration": 1.24}, {"text": "But the turning point came in 1820, when Spain, now\nre-kinged after the Napoleonic nonsense,", "start": 330.94, "duration": 4.96}, {"text": "got a newly-liberalised constitution.", "start": 335.9, "duration": 1.94}, {"text": "The higher classes feared that an exportation of those liberal ideas to Mexico would mean the end of their extremely cushy socio-economic status,", "start": 337.84, "duration": 6.86}, {"text": "so a general in the Spanish army by the name of Agustín de Iturbide flipped and teamed up with the revolutionary leader Vicente Guerrero", "start": 344.7, "duration": 6.78}, {"text": "to hash out some compromises for a new independent government.", "start": 351.48, "duration": 2.9}, {"text": "These three guarantees of monarchy, egalitarianism, and Catholicism, became the goals of the revolution,", "start": 354.38, "duration": 5.34}, {"text": "and when their combined armies marched on Mexico City,", "start": 359.72, "duration": 2.28}, {"text": "they had no trouble yeeting the Spanish loyalists right on out of there", "start": 362.0, "duration": 3.02}, {"text": "and forming an independent Mexican Empire with Iturbide as Emperor.", "start": 365.02, "duration": 3.48}, {"text": "So now Mexico's got independence,", "start": 368.5, "duration": 1.76}, {"text": "but what about that carefully crafted political compromise that kind of held this whole operation together?", "start": 370.26, "duration": 4.94}, {"text": "... It went pretty quickly at the window.", "start": 375.66, "duration": 3.04}, {"text": "Nobody seemed to be happy with the new government,", "start": 378.7, "duration": 2.16}, {"text": "and most aristocrats carried on not giving rights to the Mestizos and natives.", "start": 380.86, "duration": 3.9}, {"text": "Iturbide was ousted and later executed, and Central America seceded from the Mexican Empire.", "start": 384.76, "duration": 5.06}, {"text": "Not a great start.", "start": 389.82, "duration": 1.14}, {"text": "As time went on, the economy was stagnant", "start": 390.96, "duration": 1.72}, {"text": "because no government was strong or consistent enough to create an enforced rule,", "start": 392.68, "duration": 3.64}, {"text": "so the local economy shriveled as corruption soared.", "start": 396.32, "duration": 2.46}, {"text": "The biggest figure to emerge in the half-century after Mexican independence was Antonio López de Santa Anna.", "start": 398.78, "duration": 4.98}, {"text": "A former general turned politician who served as president and/or dictator for most of the next two decades.", "start": 403.76, "duration": 5.22}, {"text": "Watch out, this becomes a trend.", "start": 409.7, "duration": 2.18}, {"text": "Santa Anna had the galaxy-brain idea of encouraging American immigrants to settle in the state of Coahuila y Tejas", "start": 412.06, "duration": 5.38}, {"text": "to shield from raids by the Comanche nation and also boost the northern economy.", "start": 417.44, "duration": 3.48}, {"text": "This failed spectacularly,", "start": 420.92, "duration": 1.68}, {"text": "as he essentially imported an entire population that was bound to agitate for more rights.", "start": 422.6, "duration": 5.06}, {"text": "When they did, Santa Anna effectively told them to shove it", "start": 427.66, "duration": 2.64}, {"text": "and then was surprised when they immediately revolted.", "start": 430.3, "duration": 2.26}, {"text": "Things got real at the Siege of the Alamo, but despite early Mexican victories,", "start": 432.56, "duration": 3.46}, {"text": "the Texan revolutionaries won the decisive Battle of San Jacinto in 18 minutes", "start": 436.02, "duration": 4.56}, {"text": "and personally captured Santa Anna to add insult to injury.", "start": 440.58, "duration": 3.34}, {"text": "They let him go but his problems got worse when Texas joined the ever-growing United States.", "start": 443.92, "duration": 4.26}, {"text": "Then Mexico had a mix-up over some soldiers killed on disputed land,", "start": 448.18, "duration": 3.06}, {"text": "which led to a second and even more disastrous war for Santa Anna.", "start": 451.24, "duration": 3.9}, {"text": "The U.S. invaded along the Pacific coast of California and the eastern Gulf Coast", "start": 455.14, "duration": 4.04}, {"text": "and routed Santa Anna to capture Mexico City and force a surrender.", "start": 459.18, "duration": 3.36}, {"text": "The resulting Treaty of Guadalupe Hidalgo saw Mexico cede all of its northern territories to the United States,", "start": 462.54, "duration": 5.4}, {"text": "from Colorado all the way to California.", "start": 467.94, "duration": 2.02}, {"text": "This was rough,", "start": 469.96, "duration": 1.22}, {"text": "as Mexico now languished in military failure, bad governance, and a deflated economy", "start": 471.18, "duration": 4.8}, {"text": "for another decade before Santa Anna was ousted for good in 1855.", "start": 475.98, "duration": 3.96}, {"text": "Two years later, a new constitution took power from the church to help prop the lower classes", "start": 479.94, "duration": 4.24}, {"text": "but this didn't sit super well with the church elite,", "start": 484.18, "duration": 2.62}, {"text": "so a civil war between conservative Catholics and liberal Democrats swiftly broke out.", "start": 486.8, "duration": 4.56}, {"text": "Yay...", "start": 491.96, "duration": 0.92}, {"text": "In the course of the four-year war, both sides borrowed huge sums of money from Spain, France, and England to finance their militaries,", "start": 493.2, "duration": 6.52}, {"text": "and when the Liberals won the war in 1861, Europe came to collect for both tabs,", "start": 499.72, "duration": 5.26}, {"text": "which goes to show that war profiteering is great, because no matter who wins, you still get rich.", "start": 504.98, "duration": 5.24}, {"text": "Easy!", "start": 510.42, "duration": 0.54}, {"text": "Obviously Mexico couldn't pay all of this, so they defaulted on their debts.", "start": 511.1, "duration": 3.94}, {"text": "In response, the French Emperor Napoleon the Third decided to take matters into his own Empire", "start": 515.04, "duration": 4.52}, {"text": "and invaded Mexico to place a Habsburg puppet on the throne.", "start": 519.56, "duration": 3.32}, {"text": "France landed on the Bay of Campeche and pushed towards Mexico City,", "start": 522.88, "duration": 3.06}, {"text": "but was spectacularly halted in its tracks by the Mexican army at the Battle of Puebla.", "start": 525.94, "duration": 4.26}, {"text": "This is what Cinco de Mayo is about -", "start": 530.2, "duration": 1.98}, {"text": "it's not so much an Independence Day as an Anti-Re-Colonialism Day,", "start": 532.18, "duration": 4.0}, {"text": "which is different, but has the same core energy to it.", "start": 536.18, "duration": 3.12}, {"text": "Unfortunately, the war wasn't over,", "start": 539.3, "duration": 1.78}, {"text": "and France regrouped to capture Mexico City and install their puppet Maximilian on the throne.", "start": 541.08, "duration": 4.44}, {"text": "Three years later, the Mexican Republican Army recaptured the north", "start": 545.52, "duration": 3.0}, {"text": "and America shot some nasty eyes at France,", "start": 548.52, "duration": 2.24}, {"text": "so they decided, uh, better off not fighting a war on two fronts, and then they withdrew.", "start": 550.76, "duration": 4.32}, {"text": "The new Mexican government set about some much-needed reforms,", "start": 555.08, "duration": 2.66}, {"text": "because oh man, Mexico has been having a rough century here.", "start": 557.74, "duration": 4.36}, {"text": "The next four decades saw the country secularized, reform the central government to be stronger and more efficient,", "start": 562.1, "duration": 4.76}, {"text": "build infrastructure and modernize the army.", "start": 566.86, "duration": 2.34}, {"text": "That last one is relevant because the 1880s through 1910s had another military strong man turned politician", "start": 569.2, "duration": 5.28}, {"text": "who rigged elections and manipulated the army to stay in power.", "start": 574.48, "duration": 3.0}, {"text": "After 'winning' an especially controversial election in 1910, widespread revolts forced him to flee.", "start": 577.48, "duration": 6.24}, {"text": "But this revolution ran into trouble when the leaders failed to agree on new government,", "start": 583.72, "duration": 3.7}, {"text": "so Mexico descended into a decade of open rebellion.", "start": 587.42, "duration": 2.72}, {"text": "The revolutionaries were defeated and a couple more military strongmen held the country,", "start": 590.14, "duration": 3.88}, {"text": "but things started looking up in the second half of the century,", "start": 594.02, "duration": 2.54}, {"text": "as Mexico's involvement in World War Two kick-started decades of economic progress that continues to this day.", "start": 596.56, "duration": 5.28}, {"text": "I wasn't lying when I said that Mexican history is busy, but it's also extremely complex,", "start": 601.84, "duration": 4.22}, {"text": "and the Mexican identity is one of the most fascinating and trickiest artifacts of this history.", "start": 606.06, "duration": 4.68}, {"text": "For instance, in the 80s, there was a new statue of Cortés, his Nahua wife Malintzin, and their Mestizo son Martín,", "start": 610.74, "duration": 5.58}, {"text": "which intended to celebrate the convergence of cultures.", "start": 616.32, "duration": 2.64}, {"text": "But instead it was met by fierce student protests,", "start": 618.96, "duration": 2.22}, {"text": "who saw Cortés as a predator, and Malintzin, or La Malinche, as a traitor to her Nahua people.", "start": 621.18, "duration": 5.46}, {"text": "The debate over the statue is a very recent microcosm of the beautiful harmonies and the stark contrasts that make up Mexico's history.", "start": 626.64, "duration": 7.58}, {"text": "A story that's deep, inspiring, and sometimes dismaying, but above all else, very much alive.", "start": 634.22, "duration": 6.96}, {"text": "As we've seen, it can be hard to protect your Empire from conquistadors,", "start": 641.6, "duration": 3.68}, {"text": "but it's easy to protect your online data from hackers and thieves with today's sponsor, Nord VPN.", "start": 645.28, "duration": 4.72}, {"text": "The digital world is vast and speedy, but it can also be extremely shady.", "start": 650.0, "duration": 4.06}, {"text": "With a virtual private network or VPN, you can keep your data safe from hackers and spyware", "start": 654.06, "duration": 4.3}, {"text": "and also hop around to different corners of the net.", "start": 658.36, "duration": 2.26}, {"text": "While the conquistadors took entire months to cross the Atlantic like a bunch of slow losers,", "start": 660.62, "duration": 4.1}, {"text": "Nord VPN's military-grade security and servers in over 60 countries let you hop from Spain to Mexico with a click!", "start": 664.72, "duration": 6.06}, {"text": "And Nord VPN is offering you 70% off a three year plan and a free bonus month", "start": 670.78, "duration": 4.239}, {"text": "if you go to NordVPN.com/OverlySarcastic and use code \"OVERLYSARCASTIC\".", "start": 675.02, "duration": 4.54}, {"text": "Whether you're punching a hole in online government censorship", "start": 679.56, "duration": 2.38}, {"text": "or hopping across the Atlantic to see what's going on with Netflix en español,", "start": 681.94, "duration": 3.52}, {"text": "it's important to be secure, and Nord VPN is consistently among the highest rated VPNs around.", "start": 685.46, "duration": 4.8}, {"text": "Whenever I'm browsing on public Wi-Fi in a library or café, I always feel safe with Nord VPN.", "start": 690.26, "duration": 4.92}, {"text": "Again, head over to NordVPN.com/OverlySarcastic and use the code \"OVERLYSARCASTIC\"", "start": 695.18, "duration": 5.06}, {"text": "to get 70% off three years of secure internet and one bonus month free.", "start": 700.24, "duration": 3.8}, {"text": "Thanks so much for watching.", "start": 704.48, "duration": 1.2}, {"text": "This one was a big research undertaking for me, but I loved digging into the history of my national neighbor.", "start": 705.68, "duration": 4.64}, {"text": "One thing I learned while making this is that there's a sea shanty all about General Santa Anna,", "start": 710.32, "duration": 4.28}, {"text": "and though it's not strictly accurate to Santa Anna's actual history,", "start": 714.6, "duration": 3.26}, {"text": "it is a banger of a track, so I linked it down in the description.", "start": 717.86, "duration": 3.14}, {"text": "Give it a listen, and I'll see you in the next one.", "start": 721.0, "duration": 1.78}, {"text": "Subtitler: I think I did nearly as much research as Blue while making these subtitles. The auto-generated ones were appalling. Hope you enjoyed!", "start": 723.0, "duration": 1.0}]