[{"text": "Tfue VS FaZe Clan, (make sure to like and subscribe to get more content)", "start": 0.0, "duration": 1.52}, {"text": "The fascinating story of a kid who went from playing Fortnite in his bedroom", "start": 2.34, "duration": 3.82}, {"text": "to joining one of the most respected teams in E-sports", "start": 6.16, "duration": 2.86}, {"text": "exploding in popularity and eventually surpassing the team who built him up. (we all know tfue is getting sued by face)", "start": 9.02, "duration": 3.52}, {"text": "It's a story of ambition and hard work, success,", "start": 12.54, "duration": 3.26}, {"text": "and...", "start": 15.9, "duration": 0.5}, {"text": "Betrayal?", "start": 16.4, "duration": 0.78}, {"text": "._.", "start": 17.18, "duration": 2.0}, {"text": "That's a big question mark!", "start": 20.08, "duration": 1.04}, {"text": "What we know is that Tfue was locked in a contract with FaZe clan for the next 3 years!", "start": 21.12, "duration": 4.3}, {"text": "and in order to get out,", "start": 25.46, "duration": 1.04}, {"text": "he's suing the company that gave him a platform to succeed,", "start": 26.54, "duration": 2.98}, {"text": "but did FaZe Clan actually take advantage of Tfue by giving him a \"bad contract?\"", "start": 29.92, "duration": 5.28}, {"text": "Is Tfue's decision to sue justified?", "start": 35.28, "duration": 2.46}, {"text": "And how will this lawsuit affect the world of eSports as a whole?", "start": 37.74, "duration": 3.3}, {"text": "It's an interesting case and", "start": 41.04, "duration": 1.26}, {"text": "certainly a cautionary tale for anybody who will ever sign a contract in their life;", "start": 42.3, "duration": 3.62}, {"text": "Which statistically speaking is the majority of people. Unless, of course, you have a purple goose handling your business.", "start": 45.93, "duration": 6.239}, {"text": "You may think Wilfur is just a cute little good boy;", "start": 52.17, "duration": 2.58}, {"text": "Which, I mean, he is, but you'd be surprised to find out that he's a goddang shark in the business world.", "start": 54.75, "duration": 5.969}, {"text": "Sometimes he leaves the house for days at a time and I'm just sitting there on my couch", "start": 60.879, "duration": 3.68}, {"text": "Scrolling through Instagram to all of a sudden see some crazy photo of him shaking hands with the king of Saudi Arabia.", "start": 64.68, "duration": 6.419}, {"text": "Nani!?", "start": 71.54, "duration": 0.74}, {"text": "I don't know what he does in his spare time, but I'm pretty sure managing", "start": 72.28, "duration": 3.22}, {"text": "my YouTube channel is at the bottom of the list of his sources of income. How do you think Wilfur makes his money?", "start": 75.509, "duration": 4.62}, {"text": "Let me know down in the comments 'cause I have no idea.", "start": 80.13, "duration": 2.73}, {"text": "What I do know is that he did get me a brand deal for this video, which is:", "start": 82.86, "duration": 3.75}, {"text": "Skillshare. A lot of you guys DM me on my Instagram", "start": 87.28, "duration": 2.4}, {"text": "Asking for animation tips, and as much as I like to help,", "start": 89.74, "duration": 3.02}, {"text": "I can't squeeze into a few words all the knowledge", "start": 92.88, "duration": 2.43}, {"text": "You need to get started. Especially with so many people one on one, and let's be honest. It's unlikely", "start": 95.31, "duration": 5.76}, {"text": "you're gonna go to a place outside", "start": 101.07, "duration": 1.79}, {"text": "your house, pay a few hundred dollars to have some old guy teach you about how they used to do animation a hundred years ago.", "start": 102.86, "duration": 6.46}, {"text": "But, thanks to Skillshare, you don't have to do any of that.", "start": 109.32, "duration": 3.18}, {"text": "With a premium membership, you get unlimited access to any of the thousands of online courses they have on the website.", "start": 112.829, "duration": 5.16}, {"text": "For example, one that I found very helpful is a simple character animation course by Fraser Davidson", "start": 118.06, "duration": 5.66}, {"text": "where he explains how to create a basic walk cycle in After Effects.", "start": 123.72, "duration": 3.63}, {"text": "It's a great way to get started with basic animation principles that you can then experiment with and build up your skills.", "start": 127.35, "duration": 5.599}, {"text": "And if you're not into animation, you can learn music production, video editing, or creative writing;", "start": 132.95, "duration": 5.07}, {"text": "It's a great platform to fuel your hobbies and perhaps even build a lifelong career in a creative field. If you choose an annual subscription,", "start": 138.02, "duration": 7.76}, {"text": "The monthly fee is less than $10, and you can enjoy as many premium courses as you wish.", "start": 145.78, "duration": 5.29}, {"text": "That is so much more affordable than in-person courses", "start": 151.07, "duration": 3.07}, {"text": "that, again, can cost you hundreds of dollars. And if you click the link in the description,", "start": 154.14, "duration": 4.37}, {"text": "You will get a two-month free trial that you can cancel at any time if you're unsatisfied.", "start": 158.51, "duration": 4.289}, {"text": "It's important that you use that", "start": 162.9, "duration": 1.71}, {"text": "Specific link so that they know you came from this channel and then they will keep supporting us in the future.", "start": 164.61, "duration": 4.279}, {"text": "Thank you, Skillshare,  for this opportunity and for sponsoring this video", "start": 169.14, "duration": 3.36}, {"text": "Turner Tenney, AKA Tfue, started putting up content in", "start": 178.98, "duration": 3.52}, {"text": "2014 when he was just 16 years old. Even from his very first video on YouTube,", "start": 182.79, "duration": 4.009}, {"text": "you can tell he dominated at first-person shooters. In this case: Call of Duty. If you pick any video of his between", "start": 186.8, "duration": 5.699}, {"text": "2014 and now, no matter what shooter he's playing,", "start": 192.78, "duration": 2.66}, {"text": "It's an undeniable fact that he's very good at what he does. Over the following couple of years,", "start": 195.44, "duration": 4.649}, {"text": "He had a slow and steady growth, both on YouTube as well as Twitch. By 2018,", "start": 200.09, "duration": 4.05}, {"text": "He had 65K subscribers on YouTube and 85K followers on Twitch. Now, that's not a bad number. But after four years,", "start": 204.14, "duration": 6.779}, {"text": "Especially for someone as skilled as Tfue, he was nowhere near the spot that he truly deserved.", "start": 211.62, "duration": 4.49}, {"text": "Unfortunately, the reality is there are many good gamers, many great content creators, but very few have an organic breakthrough into the mainstream.", "start": 216.84, "duration": 7.19}, {"text": "In fact, there's so many people making content nowadays that unless you're super lucky with the algorithm,", "start": 224.03, "duration": 5.19}, {"text": "Your best chance is for someone bigger to put a spotlight on you.", "start": 229.22, "duration": 3.33}, {"text": "It's like you're in that claw machine from Toy Story,", "start": 232.55, "duration": 2.19}, {"text": "You know, with the aliens, not everybody will make it out.", "start": 234.74, "duration": 2.64}, {"text": "The claw only chooses one. And in the case of Tfue, the claw was operated by FaZe Banks.", "start": 237.38, "duration": 6.3}, {"text": "I met Tfue back in April, a little bit over a year ago now. When I met him, I got into a random game with him,", "start": 243.72, "duration": 4.8}, {"text": "noticed very quickly that he was", "start": 248.52, "duration": 1.439}, {"text": "Incredibly good at the video", "start": 249.959, "duration": 1.161}, {"text": "game that we were playing, which was Fortnite, watched his twitch after that session to see if that was just a good game he had;", "start": 251.12, "duration": 4.89}, {"text": "It wasn't. I noticed and was very surprised at the fact that he had about a hundred subs.", "start": 256.01, "duration": 4.95}, {"text": "I contacted Cloak and I told, \"Please play with my homie Tfue, he's really fucking good-- just... scrim with him,", "start": 260.96, "duration": 5.44}, {"text": "Give him a chance.\" And Cloak's response to that was something along the lines of, \"We have this person, this person, this person, this person in mind,", "start": 266.42, "duration": 5.88}, {"text": "We don't want to play with Tfue.\" Again, I pushed him. \"Yo, just play with him.", "start": 272.3, "duration": 3.24}, {"text": "Just pleeaase scrim with him, just give me that much, that's all I ask.\" And he did! The rest is simply history.", "start": 275.66, "duration": 5.19}, {"text": "They played together, and they fucking crushed it. They won scrim after scrim and they were stoked, Everyone was like (fuck?)", "start": 280.85, "duration": 5.16}, {"text": "This is really where Tfue started to really make his name.", "start": 286.01, "duration": 2.25}, {"text": "So that's the story of how Tfue got to be in FaZe clan or, at least, Banks' version of it.", "start": 288.33, "duration": 4.61}, {"text": "April of 2018 is the month", "start": 292.949, "duration": 1.671}, {"text": "He discovered T food and it's also the month when the contract was signed in four years thief who had made it on his own", "start": 294.62, "duration": 5.489}, {"text": "To 85 thousand followers on Twitch just two months after signing with faze clan", "start": 300.11, "duration": 3.869}, {"text": "He had over a million", "start": 303.979, "duration": 1.451}, {"text": "Followers and the momentum kept growing and growing to the point where he was soon considered to be the best", "start": 305.43, "duration": 4.82}, {"text": "Fortnight player in the world as of today. He's got over 6 million followers on Twitch and over 10 million subscribers on YouTube", "start": 310.32, "duration": 6.889}, {"text": "could he have reached this number on his own maybe but for", "start": 317.24, "duration": 2.88}, {"text": "comparison it took ninja 3 years to get from 85 thousand to a million organically faze gave T Fuu a", "start": 320.37, "duration": 5.75}, {"text": "Significant shortcut of just two months to reach the same number. That's not nothing", "start": 326.43, "duration": 3.98}, {"text": "Now we've already mentioned T Fu's contract but what exactly is there in this problematic agreement between him and face clan", "start": 336.32, "duration": 6.35}, {"text": "Well, there's two big reasons why T. Fuu is unhappy with the contract number one", "start": 342.67, "duration": 4.139}, {"text": "He has to stay with phase plan exclusively for three years", "start": 346.81, "duration": 3.3}, {"text": "Which is a lot and number two face Glenn takes a big chunk of his revenue in some cases up to 80 percent", "start": 350.11, "duration": 6.059}, {"text": "Which again is a lot but the contract also states that they've given him all the equipment he needs to perform", "start": 356.3, "duration": 6.35}, {"text": "computer accessories gaming chair, etc", "start": 363.2, "duration": 2.449}, {"text": "Which he probably couldn't afford at that point on his own and they're paying him a salary of $2,000 per month", "start": 365.65, "duration": 5.55}, {"text": "Now is this a bad contract?", "start": 371.2, "duration": 2.699}, {"text": "Well for T foo of today, absolutely", "start": 373.9, "duration": 1.87}, {"text": "As the best player in the world to have somebody basically own half of what you make must be incredibly", "start": 375.77, "duration": 5.959}, {"text": "Frustrating and to two thousand dollars per month is not even pocket money for him at this point", "start": 381.89, "duration": 4.19}, {"text": "but for the t foo of April 2018 with a much smaller audience a", "start": 386.08, "duration": 4.259}, {"text": "Guaranteed paid three-year contract of playing in the best team in a sport sounded like a dream come true", "start": 390.59, "duration": 5.51}, {"text": "It's a legitimate paradox the contract a young T foo signed is mostly unfair for the T fo of today", "start": 396.1, "duration": 6.269}, {"text": "But if young T foo hadn't signed the contract maybe who wouldn't be the t flow of today", "start": 402.37, "duration": 4.23}, {"text": "You can't have one without the other is like the chicken and the egg", "start": 406.6, "duration": 3.149}, {"text": "Jesus I know you're a goose Wilfer. I'm just trying to make a point here", "start": 410.93, "duration": 3.26}, {"text": "Now it's already been established that face banks and teeth who we're very good friends", "start": 420.18, "duration": 3.799}, {"text": "We know that from Banks's video. We know that from the chemistry that's clearly there in the videos. They're together", "start": 423.99, "duration": 5.059}, {"text": "And we also know that from the tattoo that banks has on his leg of T Fu's name", "start": 429.05, "duration": 4.29}, {"text": "Yeah, that doesn't look very good", "start": 433.34, "duration": 1.44}, {"text": "now does it but this needs to be looked at as a business transaction face clan as a", "start": 434.78, "duration": 4.709}, {"text": "Business invested in T foo as an asset and there are entitled to get a return on their investment", "start": 439.74, "duration": 5.419}, {"text": "It's like you'd be investing in Facebook when it was just Mark Zuckerberg in his dorm room", "start": 445.22, "duration": 3.72}, {"text": "You buy him a computer", "start": 448.94, "duration": 0.96}, {"text": "You pay him a salary you basically create a whole environment that helps him build Facebook and years later", "start": 449.9, "duration": 5.729}, {"text": "You should technically own Facebook stock worth millions of dollars Mark Zuckerberg. Can't just be like, sorry my dude. I'm bigger than you now", "start": 455.63, "duration": 7.71}, {"text": "I don't feel like paying you back anymore, but you wouldn't be here without my help", "start": 463.34, "duration": 3.75}, {"text": "No, I'm pretty sure I would there's a contract. Yeah, I don't know I shouldn't have signed it. I was stupid", "start": 467.18, "duration": 6.239}, {"text": "Yeah, but you did listen, I don't have time for this. You'll be hearing from my lawyers. No, look I'm neither of their side", "start": 473.42, "duration": 6.45}, {"text": "I'm trying to look at this as objectively as I can but I can't help but feel like this fallout is mainly caused by T", "start": 479.87, "duration": 5.85}, {"text": "Foo not respecting the deal that he willingly accepted", "start": 485.72, "duration": 3.179}, {"text": "It's been alleged and pretty much confirmed by T Fu's brother that Turner doesn't just want out of the contract", "start": 488.9, "duration": 5.88}, {"text": "He wants to start his own organization a direct competitor against face clan", "start": 494.78, "duration": 4.409}, {"text": "and to me it looks like teeth who's hiding under this pretext that he wants to create a", "start": 499.19, "duration": 4.2}, {"text": "Platform where players are not being taken advantage of by the establishment", "start": 503.61, "duration": 3.47}, {"text": "But in reality, he's someone who outgrew the establishment and now wants to become the establishment. It's not a good look", "start": 507.08, "duration": 6.659}, {"text": "You can't deny that face. Glenn was aware of T Foos unexpected exponential growth. They never even collected all the money", "start": 513.74, "duration": 6.66}, {"text": "They were entitled to by contract", "start": 520.4, "duration": 1.77}, {"text": "I don't know if this was strategic or simply a sign of goodwill, but it is a fact they only took", "start": 522.17, "duration": 4.949}, {"text": "$60,000 despite being entitled to legally strip him of millions of dollars", "start": 527.88, "duration": 3.739}, {"text": "Not only that but they approached him with a revised version of the contract that said that face clan would no longer take any", "start": 531.62, "duration": 6.51}, {"text": "Percentage from T foo and they would pay him millions of dollars just to stay on the team which T foo refused to sign", "start": 538.23, "duration": 6.83}, {"text": "As I'm working on this video new information has come out from T", "start": 550.26, "duration": 3.38}, {"text": "Fu's lawyer that Turner supposedly offered an alternative contract to face clan, which they also allegedly turned down", "start": 553.64, "duration": 6.27}, {"text": "So apparently we're in this he-said she-said situation", "start": 559.91, "duration": 2.459}, {"text": "and", "start": 562.59, "duration": 0.63}, {"text": "Nobody can know what really went down but just based on the information that's been made public so far The Fault in my opinion lies", "start": 563.22, "duration": 6.679}, {"text": "On T Fu's shoulders. He's the one that signed the agreement", "start": 569.9, "duration": 2.82}, {"text": "he had a", "start": 572.72, "duration": 0.61}, {"text": "six-month period where he could have terminated the deal before getting locked down for the three years ensuing phase clan at this point seems", "start": 573.33, "duration": 6.95}, {"text": "Uncalled for as if he's unwilling to take responsibility for his own signature. He even admits it in his response video", "start": 580.38, "duration": 6.619}, {"text": "I didn't know any better. I'm an idiot. I'd never signed it in the first place this three-year contract. That's right", "start": 587.0, "duration": 6.03}, {"text": "You shouldn't have signed it but you did and that signature is", "start": 593.03, "duration": 3.21}, {"text": "Legally binding that should be the end of the story now a lawsuit of this size could take a couple of years to get solved", "start": 596.52, "duration": 6.349}, {"text": "And in all probability it's gonna get settled outside the courtroom because neither party wants to drag it on for so long", "start": 602.87, "duration": 5.94}, {"text": "So in conclusion, it's all just a big mess", "start": 608.87, "duration": 2.85}, {"text": "If you don't want to end up in a situation like this", "start": 611.72, "duration": 2.01}, {"text": "make sure to read a contract before you sign it and if you legally agreed to something you should carry out your", "start": 613.73, "duration": 5.609}, {"text": "Responsibilities because otherwise, it's just bad business ethics. Who do you think is in the right and who's in the wrong?", "start": 619.68, "duration": 4.699}, {"text": "Are you on t foo side or on face plant side?", "start": 624.38, "duration": 2.369}, {"text": "There's gonna be a pole up in here in the corner where you can cast your vote", "start": 626.75, "duration": 3.36}, {"text": "I'm curious to see what the public opinion is", "start": 630.11, "duration": 2.0}, {"text": "What is this you did what you signed my soul away to the devil is someone call me. Ah", "start": 633.15, "duration": 7.219}, {"text": "Yes, my new slave. What? No, that's not even my signature", "start": 641.1, "duration": 4.099}, {"text": "It's always a pleasure in Business Week. Let's go slave", "start": 646.68, "duration": 4.169}]