[{"text": "This video is sponsored by square space helping you build your own beautiful website", "start": 0.03, "duration": 5.399}, {"text": "This past summer in Bali was everything I wanted it to be and more", "start": 9.91, "duration": 3.439}, {"text": "It was the kind of trip that gets you enough content to post on Instagram for a whole month", "start": 14.11, "duration": 4.46}, {"text": "So that everyone thinks you're constantly traveling the kind of trip that changes you as a person", "start": 18.67, "duration": 4.789}, {"text": "And gets you at least 6,000 new followers. I", "start": 23.89, "duration": 2.69}, {"text": "learned so much about myself on this trip, but there was one thing that really stood out to me and that is", "start": 27.34, "duration": 5.209}, {"text": "You don't need a storyline to make your travels look epic", "start": 33.19, "duration": 2.84}, {"text": "All you need is a voiceover in a soft Airy voice and with the right dramatic pauses", "start": 36.64, "duration": 4.369}, {"text": "it'll sound", "start": 42.489, "duration": 1.381}, {"text": "inspirational", "start": 43.87, "duration": 1.11}, {"text": "I've learned that all you need are shots of yourself walking along the beach and a flowy outfit leading your faceless boyfriend places", "start": 44.98, "duration": 6.319}, {"text": "Places like untouched waterfalls pristine rice fields mountains I didn't climb in blue ass water and", "start": 51.37, "duration": 5.93}, {"text": "With the right color grading and uplifting cinematic music. I can make average looking places look totally insta worthy", "start": 57.879, "duration": 6.559}, {"text": "I've learned that fancy hotels are only $30 a night here, but everyone thinks I'm loaded", "start": 65.17, "duration": 5.09}, {"text": "That to get that epic hiking photo just change into a completely different outfit at the top", "start": 70.78, "duration": 4.58}, {"text": "Wait, hannah. What are you doing?", "start": 75.97, "duration": 2.0}, {"text": "but you can't swim here!", "start": 77.97, "duration": 2.0}, {"text": "The best shots are the ones where you gaze and wonder your surroundings", "start": 81.43, "duration": 3.109}, {"text": "Surroundings like waterfalls, that'll make you say. Holy shit. Look at that waterfall", "start": 85.27, "duration": 4.4}, {"text": "I'm here to run through", "start": 89.67, "duration": 1.6}, {"text": "Rainforest and an outfit that's not made for running and to run around third-world countries and inappropriate outfits and go swimming in the clearest", "start": 91.27, "duration": 6.23}, {"text": "Water you've ever seen but this time in a different swimsuit and of course", "start": 97.5, "duration": 4.019}, {"text": "we all know that it's not a travel film unless there's a surprising amount of sexually seductive movements and uncomfortably close shots with my but", "start": 101.52, "duration": 6.33}, {"text": "I'm here to fill your feed with slow motion palm trees white sand the poolside my butt clear watered my eye", "start": 108.039, "duration": 6.77}, {"text": "Opening for some reason and sand on my butt. Why is there always sand up my butt?", "start": 114.939, "duration": 4.31}, {"text": "I'm not gonna show you the stress of making our flight sometime getting ripped off by your taxi driver or being severely", "start": 119.28, "duration": 5.489}, {"text": "Sleep-deprived because that's not desirable", "start": 124.99, "duration": 2.12}, {"text": "Basically, I'm here to show you how amazing my life is but not how you could do it yourself", "start": 127.899, "duration": 4.94}, {"text": "This is a travel flex", "start": 133.72, "duration": 2.449}, {"text": "Wow, so, this video was a bit different", "start": 187.84, "duration": 2.479}, {"text": "I've never made a parody video before but I had a lot of fun putting it together", "start": 190.739, "duration": 3.3}, {"text": "I've been writing the script and you filming it putting other shots together for a couple of months now, so", "start": 194.04, "duration": 4.979}, {"text": "Yeah, I hope that you enjoy that I hope that it all paid off in the end", "start": 199.599, "duration": 2.479}, {"text": "Obviously this whole entire video is one big joke", "start": 202.079, "duration": 3.0}, {"text": "I'm not trying to call anyone out and not throwing shade on certain people because honestly", "start": 205.079, "duration": 4.53}, {"text": "I don't even watch that many travel vloggers. These are just kind of little cliches and and", "start": 209.61, "duration": 4.829}, {"text": "overuse little things that I've seen on like", "start": 215.23, "duration": 2.36}, {"text": "Instagram and you know the kinds of like travel videos that Union lag promotes and stuff like that", "start": 217.75, "duration": 4.069}, {"text": "these are the the jokes and the cliches that I myself am guilty of doing and", "start": 221.819, "duration": 5.009}, {"text": "The things that Jess and I really like to joke about with my filming staff also editing", "start": 227.049, "duration": 4.76}, {"text": "This video was very difficult for me to do because I don't really like to show that much skin, especially in", "start": 231.81, "duration": 6.839}, {"text": "This region, but I felt like for the video it was kind of necessary", "start": 239.44, "duration": 3.649}, {"text": "Considering the over sexualized nature of a lot of travel films, but that's topic for another video", "start": 243.849, "duration": 5.81}, {"text": "but that's also why the American accent helped me to like", "start": 249.879, "duration": 2.9}, {"text": "like remove myself from the video like like I'm not watching myself in this video and I'm watching some like like", "start": 253.0, "duration": 7.369}, {"text": "Black head American chick with mashed hits he's about to get her DMS destroyed rather than it just being me", "start": 260.68, "duration": 6.32}, {"text": "So also don't read too much into my American accent", "start": 267.0, "duration": 2.13}, {"text": "I'm not trying to like make fun of Americans or anything like the the feel of the video is", "start": 269.13, "duration": 4.349}, {"text": "enhanced a lot more by therefore wistful like", "start": 273.82, "duration": 2.0}, {"text": "American accent rather than like a blocky Australian accent as this just my opinion", "start": 276.28, "duration": 4.94}, {"text": "Also, the biggest thing in the world goes to Jess for helping me film this video", "start": 281.22, "duration": 5.729}, {"text": "I honestly could not have done it without you. We filmed all of these shots", "start": 286.949, "duration": 3.839}, {"text": "So so so many and we did this like holding hands like running along the beach shot", "start": 290.789, "duration": 5.4}, {"text": "13 times and she didn't complain once I", "start": 296.53, "duration": 3.08}, {"text": "Appreciate you so much Jess if we've got to check out Jess's YouTube channel", "start": 300.19, "duration": 3.17}, {"text": "She has a bunch of like travel videos icon set videos and things like that. Just got a lot of great ideas", "start": 303.36, "duration": 3.839}, {"text": "So go check out her channel", "start": 307.21, "duration": 1.88}, {"text": "I've also made a video just kind of recently about how I really feel about like travel influences and", "start": 309.09, "duration": 5.73}, {"text": "Instagramers and Instagram in general and how that's changing the travel game at the moment so you can go and check out that video", "start": 315.13, "duration": 5.839}, {"text": "There I think it'll be there", "start": 321.43, "duration": 1.61}, {"text": "Yes", "start": 323.04, "duration": 0.18}, {"text": "and that one is a bit more pointed and", "start": 323.22, "duration": 2.0}, {"text": "Dissect a lot of the issues that is cram causes in the travel", "start": 325.36, "duration": 3.229}, {"text": "This video is all just a bit of fun though. So don't they're not always not mutually connected. That's not even the same", "start": 328.59, "duration": 6.99}, {"text": "Anyway, I hope that you liked this video", "start": 335.86, "duration": 1.7}, {"text": "There's going to be some bloopers at the very end. But first here is a quick message from this video sponsor", "start": 337.56, "duration": 5.19}, {"text": "Take it away Hannah. Thanks for that Hannah guys. This video is sponsored by Squarespace", "start": 343.0, "duration": 5.239}, {"text": "If you have not heard of Squarespace already", "start": 348.51, "duration": 1.71}, {"text": "I don't know what rock you've been living under because every man and his dog has lots of nice Squarespace", "start": 350.22, "duration": 4.769}, {"text": "And I'm also really happy about it", "start": 354.99, "duration": 1.62}, {"text": "Thank you very much", "start": 356.61, "duration": 0.93}, {"text": "Squarespace is of course the all of one platform to help you create your beautiful online presence with just the click of a button", "start": 357.54, "duration": 5.85}, {"text": "I made my own Squarespace website in like under an hour", "start": 363.39, "duration": 3.989}, {"text": "I think and I really like how it looks it was so easy to use there's a bunch of templates to usually just", "start": 367.38, "duration": 5.339}, {"text": "drag and drop things and you can customize everything if you'd like to and very very very", "start": 372.79, "duration": 4.19}, {"text": "Helpful, if you are a travel blogger or a travel in or anything like that", "start": 377.26, "duration": 4.229}, {"text": "You can geotag all your blog posts if you like", "start": 381.49, "duration": 2.519}, {"text": "You can simultaneously post between all of your platforms", "start": 384.009, "duration": 2.52}, {"text": "The people that go to your website can also choose to very easily share that to their social media", "start": 386.53, "duration": 4.259}, {"text": "Thus enhancing your online presence", "start": 391.4, "duration": 2.54}, {"text": "So if you have not already gotten a Squarespace website head to Squarespace", "start": 393.94, "duration": 3.69}, {"text": "Comm for a free trial and then when you're ready to launch go to Squarespace. Calm slash Hana", "start": 397.789, "duration": 4.55}, {"text": "currently Hana", "start": 403.16, "duration": 1.289}, {"text": "Currently her go Express. We've gone currently Hana for 10% off your first purchase of a domain or a website", "start": 404.449, "duration": 6.08}, {"text": "thank you so much for watching this video and thank you Squarespace for sponsoring this video and now here in the blue is", "start": 410.66, "duration": 6.739}, {"text": "Great big let's go", "start": 420.32, "duration": 2.419}, {"text": "Good all these little prickles", "start": 428.7, "duration": 2.0}, {"text": "Oh, what's that is that my free breakfast", "start": 435.21, "duration": 6.95}, {"text": "Oh", "start": 453.23, "duration": 2.0}, {"text": "Who is she mercy", "start": 460.93, "duration": 2.299}, {"text": "Johana what? What are you doing?", "start": 467.78, "duration": 2.0}, {"text": "To travel for a living", "start": 474.14, "duration": 2.0}]