[{"text": "Sponsored by Squarespace whether you need a domain website or online store make your next move with Squarespace.", "start": 0.52, "duration": 5.75}, {"text": "Four words that changed lives in the 90s:", "start": 6.64, "duration": 2.36}, {"text": "It was more than a bracelet", "start": 11.5, "duration": 1.4}, {"text": "It was a cultural revolution. Maybe some of you watching this don't remember WWJD,", "start": 13.019, "duration": 4.981}, {"text": "To you, it's just a Christian meme, a meme for Jesus.", "start": 18.0, "duration": 3.329}, {"text": "But \"what would Jesus do\" was a way of life for like a year, maybe two.", "start": 21.33, "duration": 4.17}, {"text": "it was this thing that made you reflect for a second before you went ahead and sinned anyways", "start": 25.5, "duration": 4.709}, {"text": "and when I say cultural revolution, I do mean it was", "start": 30.39, "duration": 2.97}, {"text": "a revolution, I mean Topanga war WWJD bracelet on Boy Meets World, that's--that's my proof.", "start": 34.09, "duration": 5.239}, {"text": "Well, thank you Topanga! your wrist prooves that you're Christian.", "start": 39.329, "duration": 7.971}, {"text": "So, it got us thinking, because the 90s were such a simple time, but what would Jesus do in", "start": 48.1, "duration": 5.629}, {"text": "2018?", "start": 53.8, "duration": 2.34}, {"text": "Things are a bit more complex now. Aren't they? I mean we live in a rapidly changing world. What would Jesus do now?", "start": 56.14, "duration": 5.989}, {"text": "How would he react? Liberal: \"Hey, listen, Jesus, uh that last portion of your sermon today, was a little", "start": 62.129, "duration": 6.09}, {"text": "problematic.\"", "start": 68.5, "duration": 1.56}, {"text": "Jesus: \"What? It's the same thing I've always been saying?\" Liberal: \"Right, but it wasn't very inclusive", "start": 70.06, "duration": 5.54}, {"text": "I'm sure it was just an oversight but you forgot to include the people who don't call on your name. Don't worry", "start": 75.67, "duration": 6.589}, {"text": "You still have time to fix this. I've actually composed an apology tweet for you. Just go ahead and send this.\"", "start": 82.259, "duration": 5.1}, {"text": "Jesus: \"So, I", "start": 88.329, "duration": 1.65}, {"text": "Need your forgiveness?\"", "start": 89.979, "duration": 2.621}, {"text": "And I think he might have a bit of culture shock when it comes to the more conservative", "start": 92.9, "duration": 4.329}, {"text": "types too. Conservative: \"Did I hear correctly that Jesus himself is coming to church this morning?\" Girl: \"Yeah, he is. Conservative: \"Okay", "start": 97.329, "duration": 6.38}, {"text": "I'm trying not to panic because somebody turned over all the coffee tables in the Welcome Center cafe!\"", "start": 103.71, "duration": 5.61}, {"text": "Jesus: \"Oh, wow! and you have a bookstore too!\"", "start": 109.32, "duration": 4.559}, {"text": "I think Jesus probably would utilize social media to spread the good news", "start": 113.88, "duration": 3.93}, {"text": "But maybe little differently than we do. Like I don't think he would be so", "start": 117.81, "duration": 5.309}, {"text": "self-righteous about it. Jesus: \"You have heard it said...", "start": 124.0, "duration": 3.049}, {"text": "A thread.\" And I also don't think he would do that whole like \"humble brag thing\".", "start": 128.259, "duration": 4.76}, {"text": "Jesus: \"Wow! That moment when you go to the pool and end up healing a blind man, just a normal Tuesday.", "start": 133.09, "duration": 5.389}, {"text": "#blest\" And all of his tweets get 12 retweets except later on, they start only getting 11. Dead giveaway.", "start": 139.09, "duration": 7.25}, {"text": "Jesus: \"wow, I never knew a kiss could hurt so much.", "start": 146.489, "duration": 3.24}, {"text": "#Betrayed #LessonLearned #IProphesiedThis\"", "start": 150.37, "duration": 4.07}, {"text": "Actually, I can't really think of a good way that the good Lord could use Twitter. I don't think he'd use Twitter.", "start": 154.75, "duration": 5.179}, {"text": "Maybe he'd have a podcast or somethin'.", "start": 159.93, "duration": 2.7}, {"text": "Jesus: \"Imagine you're a father.", "start": 163.269, "duration": 2.0}, {"text": "You wake up one morning, make some breakfast, but then you realize, your son, is gone.", "start": 165.28, "duration": 5.899}, {"text": "he took your money and disappeared", "start": 171.519, "duration": 2.36}, {"text": "and you're not even mad. You just want him back. Where. is. your son?\"", "start": 174.73, "duration": 5.029}, {"text": "*music*", "start": 179.759, "duration": 2.0}, {"text": "\"From town of Bethlehem productions, it's Prodigal. One parable told week by week. I'm Jesus.\"", "start": 182.709, "duration": 5.6}, {"text": "But assuming he did get his message out there, I honestly don't know how well it would be received", "start": 188.739, "duration": 5.21}, {"text": "I mean", "start": 193.95, "duration": 0.599}, {"text": "I know it's easy to assume that we'd all be a lot more receptive than the folks that got triggered by him 2,000 years ago", "start": 194.549, "duration": 7.35}, {"text": "But no, we wouldn't.", "start": 202.54, "duration": 1.8}, {"text": "0% chance.", "start": 204.34, "duration": 1.32}, {"text": "Jesus: \"Blessed are the poor, for Caesar shall take care of them so you don't have to worry about it!\"", "start": 205.66, "duration": 4.91}, {"text": "Guy: \"Wow Jesus, your sermons have been really great lately. Jesus: \"Thanks! I'm trying to appeal to the kids.\"", "start": 210.75, "duration": 5.85}, {"text": "I'm sure whatever Jesus would say in 2018 would be just as uncomfortable to us as was what he said to them back then because", "start": 216.989, "duration": 7.559}, {"text": "What he said back then is still very uncomfortable today.", "start": 225.43, "duration": 3.11}, {"text": "Oh, what if he had a Facebook account?", "start": 229.45, "duration": 2.35}, {"text": "Jesus: \"Hey guys. I just wanted to make a big deal about the fact that I'm deleting my Facebook account,", "start": 231.97, "duration": 4.609}, {"text": "I just think it's a huge, huge waste of time and I want to be more productive.", "start": 237.15, "duration": 4.2}, {"text": "So, text me if you need me or just pray.\"", "start": 241.35, "duration": 3.689}, {"text": "Guy: \"He'll be back in three days, guaranteed!\"", "start": 247.92, "duration": 2.08}, {"text": "Let me ask you a question guys, what is stopping you from building a website? I mean, it's 2018.", "start": 253.3, "duration": 5.24}, {"text": "Everybody needs their own space on the web", "start": 258.609, "duration": 1.85}, {"text": "If the reason you don't have a website is because it's scary and overwhelming to try and build one", "start": 260.459, "duration": 4.83}, {"text": "I have good news for you. Our friends over at Squarespace make it so simple to build a website. No experience necessary.", "start": 265.29, "duration": 7.169}, {"text": "They have professional", "start": 272.65, "duration": 1.83}, {"text": "award-winning templates to get you started", "start": 274.48, "duration": 1.65}, {"text": "And you don't have to know how to code or anything like that to publish your site", "start": 276.13, "duration": 4.22}, {"text": "plus there are no confusing patches or upgrades to worry about. Just", "start": 280.35, "duration": 4.049}, {"text": "Easily build your site and it'll run great whether you want to set up an online shop show off your artwork display your resume", "start": 284.5, "duration": 6.739}, {"text": "Squarespace has a template that will work great for you. Oh and you can also set up a custom domain really easily as well", "start": 291.61, "duration": 6.2}, {"text": "So if you have a project that needs a website", "start": 297.81, "duration": 2.04}, {"text": "It's time to make your next move. No more delaying do what we did and head over to Squarespace.com/cow", "start": 299.85, "duration": 6.15}, {"text": "to get started. Oh and use that link because if you do, you're gonna get 10% off your first purchase. That's squarespace.com/cow", "start": 306.0, "duration": 5.94}, {"text": "Jesus: \"Hey guys, I just wanted to inform you that...Goodbye!\"", "start": 318.0, "duration": 3.4}, {"text": "Jesus: \"You have heard it said...", "start": 323.17, "duration": 2.0}, {"text": "a thread. a thread. a thread. a thread a thread a thread a thread. He took your money and disappeared and", "start": 326.26, "duration": 7.489}, {"text": "You're not even mad. You just want him back. Where is your son?", "start": 334.42, "duration": 3.199}, {"text": "From town of Bethlehem productions.\" *laughter*", "start": 341.95, "duration": 2.0}]