[{"text": "This video brought to you in part by Manscaped:", "start": 0.02, "duration": 2.16}, {"text": "Listen, I already told you about how Manscaped keeps you fresh when things get swampy.", "start": 2.18, "duration": 4.58}, {"text": "I go to the gym on occasion, I got real life experience with The Swamp!", "start": 6.76, "duration": 3.76}, {"text": "And that's why I like Manscaped's Perfect Package 2.0,", "start": 10.52, "duration": 2.68}, {"text": "now, last time we talked about the waterproof Lawn Mower 2.0 trimmer,", "start": 13.2, "duration": 3.36}, {"text": "but I've become a big fan of the Crop Preserver ball deodorant.", "start": 16.56, "duration": 3.1}, {"text": "It not only keeps you from smellin' swampy, it's also anti-chafe,", "start": 19.66, "duration": 3.6}, {"text": "which is good for keepin' your buddies feelin' good too!", "start": 23.26, "duration": 2.32}, {"text": "Focus on your gains, not your chafe pains, that's what Pops always taught me!", "start": 25.58, "duration": 3.42}, {"text": "Get 20% off your order, with free shipping and free travel bag, when you use the promo code SSFF20.", "start": 29.0, "duration": 5.74}, {"text": "All Manscaped products feature a 30-day money-back guarantee,", "start": 34.74, "duration": 3.08}, {"text": "and it's already 20% off an already-great savings with the promo code SSFF20!", "start": 37.82, "duration": 5.12}, {"text": "Thanks to Manscaped for sponsoring this part of the show!", "start": 42.94, "duration": 2.16}, {"text": "Hey! I'm Derek Alexander, this is Stop Skeletons From Fighting,", "start": 46.32, "duration": 2.8}, {"text": "and the other day, I was at a retro game shop and I found this beauty for five dollars!", "start": 49.12, "duration": 5.72}, {"text": "THIS is an Xbox 360 HD DVD Drive,", "start": 54.94, "duration": 3.12}, {"text": "and it sent me down a rabbit hole like you wouldn't believe,", "start": 58.06, "duration": 3.8}, {"text": "first to find actual HD DVDs - remember these, everyone?", "start": 61.86, "duration": 3.22}, {"text": "They look like Blu-rays, but with a distinct crimson hue?", "start": 65.08, "duration": 3.5}, {"text": "Thanks to everyone who tweeted me back, by the way, appreciate the help.", "start": 68.7, "duration": 2.6}, {"text": "- but then also, to understand why this thing came to be!", "start": 71.3, "duration": 3.56}, {"text": "And it turns out, it was a lot!", "start": 74.96, "duration": 2.12}, {"text": "This weird, official Microsoft-released HD DVD Drive took me on a journey", "start": 77.08, "duration": 4.56}, {"text": "through not just the format war between HD DVD and Blu-ray,", "start": 81.64, "duration": 3.86}, {"text": "but to the struggle for the living room, and finally onto full-on conspiracy!", "start": 85.5, "duration": 4.42}, {"text": "[♫ X-Files theme ♫]", "start": 89.92, "duration": 2.1}, {"text": "Welcome to Past Mortem, where we break down and explore the stories of video games, and in this episode", "start": 92.02, "duration": 4.94}, {"text": "we're gonna look at how Sony's championing of Blu-ray on the PlayStation 3 almost cost them everything,", "start": 97.0, "duration": 5.46}, {"text": "how the future of home video was fought on video game consoles,", "start": 102.46, "duration": 3.42}, {"text": "and how Microsoft, along with HD DVD architect Toshiba,", "start": 105.88, "duration": 3.36}, {"text": "turned what should have just been a minor disagreement about HD standards into an all-out war.", "start": 109.26, "duration": 5.36}, {"text": "Before we jump in the deep end, let's talk a little bit about the tech behind home video:", "start": 128.54, "duration": 4.76}, {"text": "DVD was the official successor to VHS, and movies are written onto DVD discs using red lasers.", "start": 133.3, "duration": 5.78}, {"text": "The next generation of home video, HD video, was made possible", "start": 139.08, "duration": 3.26}, {"text": "And that's actually how HD DVD works too,", "start": 149.923, "duration": 2.82}, {"text": "they're both HD DVDs... that run on blue-rayed laser technology.", "start": 152.743, "duration": 5.08}, {"text": "I dunno.", "start": 159.623, "duration": 0.62}, {"text": "Anyway: Blue laser technology gave HD DVD and Blu-ray the ability to store high-resolution video on discs,", "start": 160.383, "duration": 6.3}, {"text": "and this is how the home video market moved from standard def to high-def.", "start": 166.683, "duration": 4.02}, {"text": "Many companies were behind both formats and helped develop the technology,", "start": 170.843, "duration": 4.12}, {"text": "but just for the sake of simplicity, we are going to refer to them as Sony's Blu-ray and Toshiba's HD DVD,", "start": 174.963, "duration": 5.9}, {"text": "since they were the primary forces behind each format.", "start": 180.863, "duration": 3.08}, {"text": "And while they were competitors, it turns out that HD DVD and Blu-ray weren't really all that different,", "start": 184.003, "duration": 6.1}, {"text": "and in terms of image quality, were pretty comparable!", "start": 190.103, "duration": 2.56}, {"text": "But that's not to say there weren't still differences, though:", "start": 192.683, "duration": 2.4}, {"text": "Blu-ray could store more data than HD DVD because of its Sony-developed physical disc structure,", "start": 195.083, "duration": 5.18}, {"text": "and had tighter anti-copying measures.", "start": 200.263, "duration": 2.28}, {"text": "Toshiba's HD DVD, on the other hand, was cheaper and had better interactivity,", "start": 202.543, "duration": 4.4}, {"text": "which, by the way, the interactivity was developed by Microsoft, just keep that in your back pocket for now.", "start": 207.003, "duration": 4.42}, {"text": "But all these technical differences between the two formats,", "start": 211.523, "duration": 2.56}, {"text": "you know what was the most important? Which companies supported them.", "start": 214.143, "duration": 3.84}, {"text": "Okay, and with all that out of the way:", "start": 218.123, "duration": 1.8}, {"text": "Sony had been helping develop Blu-ray technology since the proper launch of DVD in the late nineties.", "start": 220.043, "duration": 6.36}, {"text": "Soon Toshiba, who basically headed the DVD format,", "start": 226.403, "duration": 3.16}, {"text": "caught wind of this and started developing its own HD format.", "start": 229.563, "duration": 3.44}, {"text": "And the thing I wanna stress is that even though this format struggle between HD DVD and Blu-ray", "start": 233.063, "duration": 4.2}, {"text": "was fought on the video game console front, you'll see that in a second,", "start": 237.263, "duration": 3.22}, {"text": "it was mostly all about the home video market, you see,", "start": 240.483, "duration": 3.08}, {"text": "the global video industry was basically controlled by six major Hollywood studios:", "start": 243.563, "duration": 4.88}, {"text": "Warner Bros., Paramount, Universal, Disney, Fox, and Sony Pictures.", "start": 248.543, "duration": 3.92}, {"text": "By the way, it's only five studios now, and that should scare you.", "start": 252.503, "duration": 0.92}, {"text": "[CHOMP!]\nBy the way, it's only five studios now, and that should scare you.", "start": 253.423, "duration": 0.5}, {"text": "By the way, it's only five studios now, and that should scare you.", "start": 253.923, "duration": 1.64}, {"text": "[burp!]", "start": 255.563, "duration": 0.88}, {"text": "But that's the future, back in 2005 where our story really begins,", "start": 256.443, "duration": 3.72}, {"text": "the popular thinking was that if you could sway all the major studios to your side, then your format would win.", "start": 260.183, "duration": 5.54}, {"text": "Sony had a major advantage over Toshiba because it already owned... er, Sony Pictures, obviously.", "start": 265.843, "duration": 5.18}, {"text": "And pretty quickly, Disney also threw in its lot with Blu-ray.", "start": 271.023, "duration": 3.54}, {"text": "So Sony already had two of the six major studios on their side, things were looking really good for them,", "start": 274.783, "duration": 4.96}, {"text": "but then they really drew a line in the sand by announcing in Spring 2005", "start": 279.763, "duration": 3.8}, {"text": "that the hotly anticipated PlayStation 3 would have a Blu-ray drive.", "start": 283.563, "duration": 4.12}, {"text": "FYI, this was Sony trying to end the HD DVD battle before it even started!", "start": 287.803, "duration": 5.0}, {"text": "Remember, the PlayStation 2 was, at the time, on its way to becoming the best-selling console ever.", "start": 292.923, "duration": 5.18}, {"text": "It was not only a wild success, its ability to play DVD movies was a huge boon for the system in the early days.", "start": 298.163, "duration": 6.66}, {"text": "PlayStation had unmatched brand loyalty, and Sony was suddenly poised to do the same for Blu-ray.", "start": 304.843, "duration": 5.86}, {"text": "It also showed that Sony was 100% completely committed to Blu-ray.", "start": 310.803, "duration": 3.86}, {"text": "Synergy for the win!", "start": 314.663, "duration": 1.28}, {"text": "They were basically betting the farm on Blu-ray.", "start": 315.983, "duration": 2.8}, {"text": "And this is when Microsoft, Sony's main competitor in the video game world,", "start": 319.103, "duration": 4.42}, {"text": "or at least the one they were most focused on, took notice.", "start": 323.523, "duration": 2.74}, {"text": "Until this point, Microsoft had largely stayed out of the HD format war,", "start": 326.263, "duration": 4.22}, {"text": "but they couldn't let this shot from Sony go unanswered!", "start": 330.483, "duration": 2.98}, {"text": "But Sony was an entertainment/hardware manufacturer, a consumer electronics company,", "start": 333.543, "duration": 4.66}, {"text": "and Microsoft was... well, mostly a software company, and they had a different focus:", "start": 338.203, "duration": 4.56}, {"text": "Microsoft saw the future of media as online streaming,", "start": 342.803, "duration": 2.98}, {"text": "and they were busy, at the time, building the Xbox 360 to be an all-in-one living room entertainment device.", "start": 345.783, "duration": 5.24}, {"text": "It's why they call it 360! Get it?", "start": 351.043, "duration": 1.8}, {"text": "It's like - it's like a circle! It's all around you!", "start": 353.063, "duration": 2.32}, {"text": "You can't escape it! I'm dizzy!", "start": 355.583, "duration": 1.88}, {"text": "So since Microsoft already dominated the workplace,", "start": 357.543, "duration": 2.7}, {"text": "they saw their game consoles as one of their entry points to owning the home as well.", "start": 360.243, "duration": 4.8}, {"text": "So they started publicly and privately fighting the Blu-ray format:", "start": 365.143, "duration": 3.86}, {"text": "Blu-ray's stringent anti-piracy, which Sony implemented in order to get Fox on board,", "start": 369.083, "duration": 4.68}, {"text": "in particular became a public-facing issue for Microsoft.", "start": 373.843, "duration": 3.06}, {"text": "They wanted their users to be able to buy a movie, rip it to their computer, and then stream it to their Xbox 360,", "start": 376.983, "duration": 5.98}, {"text": "which is pretty tough to do when everything's DRM'd to s***!", "start": 382.963, "duration": 3.12}, {"text": "This is reportedly what Bill Gates screamed at Sony CEO Howard Stringer at a closed-door meeting in mid-2005,", "start": 386.083, "duration": 7.3}, {"text": "which is kinda hilarious, considering Gates' history with digital rights management.", "start": 393.383, "duration": 4.44}, {"text": "Even Stringer reportedly thought that there might have been more to this story.", "start": 397.983, "duration": 3.42}, {"text": "Regardless, by Fall 2005, HD DVD had a LOT of catching up to do.", "start": 401.483, "duration": 4.86}, {"text": "Toshiba had only been able to bring Universal to its side, and didn't really have any significant industry partners.", "start": 406.503, "duration": 5.5}, {"text": "Blu-ray, on the other hand, had already exclusively signed on three of the major movie studios,", "start": 412.083, "duration": 4.18}, {"text": "with deals with Paramount and WB already in the works,", "start": 416.263, "duration": 2.58}, {"text": "and most of the consumer electronics industry on its side,", "start": 418.843, "duration": 3.42}, {"text": "Blu-ray was basically locked in, this war was over before it even started!", "start": 422.263, "duration": 5.14}, {"text": "And actually, Toshiba was ready to come to the table, but they had a secret weapon,", "start": 427.483, "duration": 4.68}, {"text": "with Microsoft backing them behind closed doors, they came to Sony with an offer:", "start": 432.163, "duration": 4.36}, {"text": "Let's merge HD DVD and Blu-ray, with everything on the table for compromise,", "start": 436.603, "duration": 4.1}, {"text": "which Sony flat-out refused!", "start": 440.863, "duration": 2.14}, {"text": "And of course they did!", "start": 443.003, "duration": 1.38}, {"text": "But then, why did Toshiba, and by proxy Microsoft, even waste Sony's time with attempts of compromise?", "start": 444.643, "duration": 5.52}, {"text": "Because this was a diversion, a gigantic troll, dredging up painful memories for Sony!", "start": 450.183, "duration": 5.82}, {"text": "After the decades-spanning Sony Betamax and JVC VHS war of the seventies and eighties,", "start": 456.083, "duration": 5.86}, {"text": "which you might have heard of, but maybe forgot that it involved Sony, like I did,", "start": 461.963, "duration": 3.54}, {"text": "there actually was a DVD war in the mid-nineties!", "start": 465.503, "duration": 2.64}, {"text": "Now, you might not have heard of any DVD drama because it actually never got off the ground.", "start": 468.143, "duration": 5.06}, {"text": "The players are familiar: Sony sponsored a special version of DVD, and Toshiba countered with their own.", "start": 473.303, "duration": 5.4}, {"text": "It was about to become another knock-down, drag-out war,", "start": 478.843, "duration": 2.88}, {"text": "but no-one wanted a repeat of the long, painful Betamax-VHS battle, so big industry players intervened.", "start": 481.723, "duration": 6.56}, {"text": "Eventually Sony and Toshiba agreed to combine their two formats", "start": 488.363, "duration": 3.46}, {"text": "with the new DVD disc that came out in 1996, borrowing bits of technology from each.", "start": 491.823, "duration": 5.16}, {"text": "But for Sony, there was one problem:", "start": 496.983, "duration": 1.96}, {"text": "Because of the compromises, they weren't able to get the lion's share of the royalties.", "start": 498.943, "duration": 4.9}, {"text": "Because essentially, that's what physical format wars are all about: Royalties!", "start": 503.883, "duration": 4.68}, {"text": "On every player and every disc sold! It's a really good racket!", "start": 508.663, "duration": 3.56}, {"text": "And DVD was monstrously successful, quickly replacing VHS,", "start": 512.263, "duration": 3.78}, {"text": "meaning that Sony had lost out on two good revenue opportunities so far.", "start": 516.163, "duration": 4.0}, {"text": "Fool me once, fool me twice, you know the saying.", "start": 520.303, "duration": 1.72}, {"text": "So, Sony was NOT about ready to start playing nice.", "start": 522.023, "duration": 3.62}, {"text": "Microsoft was, of course, aware of all of this.", "start": 525.663, "duration": 2.66}, {"text": "They wanted Sony to continue focusing on Blu-ray, and were betting they'd reject compromise.", "start": 528.363, "duration": 4.58}, {"text": "And I mean... Sony already had most of the tech and home video industry on their side,", "start": 532.943, "duration": 4.04}, {"text": "they really had no incentive to negotiate!", "start": 536.983, "duration": 2.2}, {"text": "So Microsoft got busy:", "start": 539.183, "duration": 1.6}, {"text": "They reportedly called around and scuttled Blu-ray's talks with the two studios they hadn't nailed down yet,", "start": 540.803, "duration": 5.38}, {"text": "Paramount and Warner Bros., turning them purple, meaning they'd support both formats.", "start": 546.183, "duration": 4.02}, {"text": "And then Microsoft publically came out in mid-2005 supporting HD DVD over Blu-ray.", "start": 550.203, "duration": 5.66}, {"text": "They were committed to HD DVD,", "start": 555.983, "duration": 2.0}, {"text": "making them the only major company outside of Toshiba that supported the format.", "start": 557.983, "duration": 4.18}, {"text": "The war was officially on.", "start": 562.283, "duration": 2.22}, {"text": "And that war was being fought on multiple fronts:", "start": 565.343, "duration": 2.5}, {"text": "Microsoft launched the Xbox 360 a couple months later in November 2005.", "start": 567.843, "duration": 4.36}, {"text": "Overall, it was a pretty successful launch,", "start": 572.203, "duration": 2.04}, {"text": "and you'd hope it would be, since neither Nintendo or Sony were shipping their next-gen consoles yet.", "start": 574.243, "duration": 4.36}, {"text": "But after the poor sales and profit margins of the original Xbox,", "start": 578.623, "duration": 3.64}, {"text": "Microsoft had mandated that the Xbox 360 be as cheap to make as possible.", "start": 582.323, "duration": 4.96}, {"text": "It was also rushed to the market in order to beat out the PlayStation 3,", "start": 587.283, "duration": 3.18}, {"text": "resulting in manufacturing problems, causing things like the dreaded Red Ring of Death,", "start": 590.463, "duration": 3.74}, {"text": "did not have an HDMI port, it launched with composite cables,", "start": 594.223, "duration": 3.64}, {"text": "and lacked a next-gen HD player.", "start": 597.903, "duration": 2.38}, {"text": "That's right, baby! Xbox 360 ran on dee-vee-dees!", "start": 600.463, "duration": 3.78}, {"text": "... but not HD DVDs? Wait...", "start": 604.483, "duration": 2.94}, {"text": "I mean, just because Microsoft didn't put HD DVD in 360...", "start": 607.623, "duration": 3.7}, {"text": "That didn't mean they weren't actually throwing their full weight behind it, right?", "start": 611.443, "duration": 3.32}, {"text": "Right? Right!", "start": 615.003, "duration": 1.18}, {"text": "So, in January 2006, Peter Moore announced that Xbox would be releasing an HD DVD drive later that year.", "start": 616.183, "duration": 5.9}, {"text": "Ah, you see? They just didn't have time to put one in before launch, that's all!", "start": 622.343, "duration": 3.48}, {"text": "It's fine, don't worry, it's good, okay. Phew.", "start": 625.883, "duration": 1.94}, {"text": "Because facts were that next-generation players, and even the PS3, were dealing with horrible delays.", "start": 627.883, "duration": 5.52}, {"text": "Toshiba and Microsoft were banking on HD DVD beating Blu-ray to market, the same way Xbox 360 beat PS3.", "start": 633.403, "duration": 6.48}, {"text": "And they did! The first HD DVD player came out in April 2006 for $499,", "start": 639.983, "duration": 5.48}, {"text": "but they just didn't have as much lead time as they wanted,", "start": 645.463, "duration": 2.7}, {"text": "because the first Blu-ray player came out only two months later, for a whopping $1,000!", "start": 648.163, "duration": 5.18}, {"text": "Whoo! I told you one of these formats was cheaper than the other!", "start": 653.343, "duration": 2.96}, {"text": "Also, because of the ramp-up to all these players, there were massive blue laser diode shortages.", "start": 656.323, "duration": 5.08}, {"text": "And a diode is... not important, okay, y'know what,", "start": 661.403, "duration": 3.36}, {"text": "There were shortages, that's the important thing, the diode, they didn't have a lot of 'em,", "start": 664.923, "duration": 3.06}, {"text": "so now all that mattered is that now they had to delay its planned Spring launch to November 2006,", "start": 667.983, "duration": 5.46}, {"text": "which gave enough time for Microsoft to clap back with the release of their Xbox 360 HD DVD Drive,", "start": 673.583, "duration": 5.32}, {"text": "and by the way, I think this is really relevant:", "start": 678.903, "duration": 2.64}, {"text": "A vast majority of people did not even have HDTV's yet, and couldn't really watch HD video.", "start": 681.643, "duration": 6.46}, {"text": "Gamers especially had this problem, as you could see from the controversy storm", "start": 688.183, "duration": 2.88}, {"text": "around Dead Rising's choice to make the game difficult to play in standard definition.", "start": 691.063, "duration": 4.56}, {"text": "Literally! Capcom only tested the game on HDTV's,", "start": 695.663, "duration": 3.06}, {"text": "and essential dialog was difficult or impossible to read if you played the game on a 4:3 tube TV.", "start": 698.723, "duration": 5.34}, {"text": "Just remember that context as we dive into the Xbox 360 HD DVD Drive, here it is!", "start": 704.063, "duration": 5.2}, {"text": "This beauty sold for $199 at launch - again, we got ours for $5.", "start": 709.463, "duration": 4.34}, {"text": "So! This drive hooks up to the Xbox 360 via a USB.", "start": 713.823, "duration": 4.1}, {"text": "Because 360's did not have HDMI out at the time, people would need HDTVs with component hookups,", "start": 717.983, "duration": 5.9}, {"text": "or VGA hookups if they bought an adapter,", "start": 723.883, "duration": 2.78}, {"text": "to fully appreciate the next generation of video!", "start": 726.723, "duration": 2.4}, {"text": "Even if one managed to have this,", "start": 729.203, "duration": 2.06}, {"text": "it was really rare and expensive to have an HDTV that supported something other than HDMI, even at the time,", "start": 731.263, "duration": 5.82}, {"text": "some of the most popular HDTV's, like the Sony A2000 series, had compatibility issues with the drive.", "start": 737.083, "duration": 6.62}, {"text": "What is your problem?", "start": 743.803, "duration": 1.06}, {"text": "Don't give me that look!", "start": 746.343, "duration": 0.92}, {"text": "Beyond that, like we said earlier, most gamers", "start": 747.323, "duration": 2.56}, {"text": "- and I say gamers 'cuz you need a 360 to hook this up - didn't even have HDTV's yet!", "start": 749.883, "duration": 4.84}, {"text": "Y'know, we've so far been focusing on the how and the why all this was made,", "start": 754.723, "duration": 3.7}, {"text": "without talking about the bigger issue here:", "start": 758.423, "duration": 2.6}, {"text": "The market was WAY not ready for this HD move!", "start": 761.143, "duration": 3.0}, {"text": "So basically, this HD DVD drive was for no-one.", "start": 764.163, "duration": 3.98}, {"text": "Sorry bud. That's why you were $5.", "start": 768.223, "duration": 2.52}, {"text": "Despite this, the Xbox 360 HD DVD player was priced", "start": 770.783, "duration": 3.5}, {"text": "so that if you bought the cheapest model of Xbox 360 and the drive,", "start": 774.283, "duration": 3.5}, {"text": "it would cost the same as the cheapest PS3,", "start": 777.783, "duration": 2.78}, {"text": "so as long as you had an Xbox 360, and you were all about that dongle lifestyle, it was a decent deal!", "start": 780.563, "duration": 5.38}, {"text": "But the drive wasn't the only thing Microsoft did to up their competitive edge on the PS3.", "start": 786.003, "duration": 4.94}, {"text": "Beyond already having a few gaming-focused features like achievements,", "start": 790.943, "duration": 3.54}, {"text": "they also revised their hardware so that each 360 was sold at a profit,", "start": 794.483, "duration": 4.46}, {"text": "and more importantly, they launched their digital video download and rental store on Xbox Live.", "start": 798.943, "duration": 4.98}, {"text": "Microsoft was makin' some serious moves.", "start": 804.063, "duration": 2.32}, {"text": "They had not only taken one more step towards their final goal of being a one-stop entertainment shop,", "start": 806.383, "duration": 5.28}, {"text": "home video streaming had officially arrived to game consoles.", "start": 811.783, "duration": 4.04}, {"text": "The PlayStation 3's launch, on the other hand, was pretty rough:", "start": 815.903, "duration": 3.54}, {"text": "The decision to bet the farm and include a Blu-ray player jacked up the price by an estimated $125,", "start": 819.483, "duration": 5.58}, {"text": "making the PS3 cost $499, or $599 for the more souped-up version.", "start": 825.063, "duration": 4.82}, {"text": "This price point was a disaster for Sony, and for most gamers, the much cheaper Xbox was the easy choice.", "start": 830.003, "duration": 6.08}, {"text": "How in the world could Sony justify such an incredible price?!", "start": 836.083, "duration": 3.4}, {"text": "Well, remember that this was the generation where it wasn't just about gaming anymore,", "start": 839.483, "duration": 4.22}, {"text": "and while $499 was very expensive for a game console, it was NOT for a Blu-ray player!", "start": 843.703, "duration": 5.42}, {"text": "To understand Sony, you need to know that the PS3 was the first Blu-ray player released under $1,000", "start": 849.183, "duration": 6.32}, {"text": "and worked better than most others on the market at the time!", "start": 855.503, "duration": 2.92}, {"text": "Though it was probably the loudest, amirite?", "start": 858.523, "duration": 1.86}, {"text": "[loud fan buzzing]", "start": 860.383, "duration": 0.68}, {"text": "ZIABAMA: \"... how loud the PS3 fan is, like...\"\n[loud fan buzzing]", "start": 861.063, "duration": 2.8}, {"text": "\"Check it out...\"\n[loud fan buzzing]", "start": 863.863, "duration": 1.06}, {"text": "[loud fan buzzing]", "start": 864.923, "duration": 1.16}, {"text": "DEREK: Amirite?\n[loud fan buzzing]", "start": 866.083, "duration": 0.92}, {"text": "[loud fan buzzing]", "start": 867.003, "duration": 0.78}, {"text": "They were actually gouging themselves with that price, since they were losing $200-300 per console sold.", "start": 867.783, "duration": 6.3}, {"text": "To make matters worse, the PS3 as a gaming system just didn't have the software it needed at launch,", "start": 874.083, "duration": 5.24}, {"text": "its exclusive launch game highlights being Resistance, Ridge Racer,", "start": 879.323, "duration": 3.44}, {"text": "and Genji: Days of the Blade, which... wasn't great.", "start": 882.763, "duration": 2.54}, {"text": "Okay... they're fine games, but remember:", "start": 885.363, "duration": 2.14}, {"text": "They had to compete with Gears of War on Xbox!", "start": 887.503, "duration": 2.94}, {"text": "So, PS3's sat on the shelf, and Sony closed out 2006 with only 1 million units sold in North America,", "start": 890.443, "duration": 6.7}, {"text": "way under its goal of 2.4 million units.", "start": 897.203, "duration": 3.08}, {"text": "But let's bring it back to Blu-ray versus HD DVD:", "start": 900.423, "duration": 3.1}, {"text": "It's 2007 now, and one of the major problems with this HD war was that it was making consumers gun-shy.", "start": 903.523, "duration": 6.68}, {"text": "Most people just weren't jumping on the HD bandwagon yet", "start": 910.303, "duration": 3.02}, {"text": "because they didn't want to be stuck with the losing format.", "start": 913.323, "duration": 3.36}, {"text": "Microsoft, for example, understood that, in fact,", "start": 916.823, "duration": 2.6}, {"text": "Microsoft didn't release a 360 with an HDMI port until the Elite model in April 2007,", "start": 919.443, "duration": 5.98}, {"text": "almost a year and a half after launch!", "start": 925.443, "duration": 1.82}, {"text": "Yes, they released an HD player before HDMI for the system!", "start": 927.283, "duration": 3.98}, {"text": "Even still, there wasn't a huge incentive for most people to buy in on HD... yet.", "start": 931.303, "duration": 4.94}, {"text": "That's why even though Sony's one-million PS3's was way under projections,", "start": 936.243, "duration": 3.96}, {"text": "it was still significant in the battle for the HD home video market.", "start": 940.203, "duration": 3.86}, {"text": "Sony was using the PS3 as a Blu-ray Trojan horse,", "start": 944.063, "duration": 3.42}, {"text": "sold as a new game console, but used as an HD video player too!", "start": 947.483, "duration": 4.06}, {"text": "If only they had the games to really move boxes off shelves.", "start": 951.623, "duration": 2.9}, {"text": "KAZ HIRAI: \"Riiidge Racer! Remember that one?\"", "start": 954.583, "duration": 2.5}, {"text": "DEREK: Still, Sony's plan was working!", "start": 957.143, "duration": 1.9}, {"text": "Thanks to the PS3, Blu-ray was outselling HD DVD at a rate of two-to-one,", "start": 959.043, "duration": 4.52}, {"text": "and this was despite some aggressive price reduction rebates from Toshiba.", "start": 963.563, "duration": 3.64}, {"text": "Soon, two of the biggest dealers in movies, Blockbuster and Target, dropped HD DVD from their stores.", "start": 967.263, "duration": 5.36}, {"text": "By mid-2007, PlayStation was lagging behind Xbox,", "start": 972.623, "duration": 3.78}, {"text": "but Blu-ray's lead on HD DVD was pretty much cemented.", "start": 976.403, "duration": 3.86}, {"text": "The war was considered mostly over... again.", "start": 980.283, "duration": 3.26}, {"text": "But then! In a suprise move in August 2007,", "start": 984.583, "duration": 3.74}, {"text": "Paramount and its partner Dreamworks Animation Studios made a deal for exclusivity on HD DVD", "start": 988.323, "duration": 5.66}, {"text": "in exchange for a reported $150 million and some free advertising.", "start": 993.983, "duration": 4.7}, {"text": "That's right, they're going red, baby!", "start": 998.683, "duration": 2.64}, {"text": "Just in time for HD DVD to cinch two of the most popular movies of the year,", "start": 1001.343, "duration": 3.98}, {"text": "Shrek the Third and Transformers.", "start": 1005.323, "duration": 2.14}, {"text": "But... why this sudden move?!", "start": 1007.463, "duration": 2.36}, {"text": "And we're not exactly sure, accounts differ:", "start": 1009.963, "duration": 2.66}, {"text": "Paramount said they MIGHT have gotten some payment,", "start": 1012.623, "duration": 2.36}, {"text": "and Microsoft said there MIGHT be payment, though they didn't write any checks,", "start": 1014.983, "duration": 4.02}, {"text": "which, like... I dunno, this whole thing's really weird, and we don't know what to tell ya!", "start": 1019.003, "duration": 4.0}, {"text": "But perhaps, and this is a super-big \"perhaps\",", "start": 1023.003, "duration": 2.22}, {"text": "someone who was very interested in prolonging the HD DVD/Blu-ray war, at the cost of companies like Sony,", "start": 1025.303, "duration": 6.18}, {"text": "AND was big enough that it wouldn't miss $150 million,", "start": 1031.523, "duration": 3.62}, {"text": "handed over some dosh just to keep the fight going.", "start": 1035.143, "duration": 3.02}, {"text": "Personally, my money's on Microsoft, even though they denied.", "start": 1038.323, "duration": 3.28}, {"text": "I mean look at this: Sony was losing the video game war,", "start": 1041.603, "duration": 2.88}, {"text": "but they were killing it in the home video war, by a huge margin!", "start": 1044.483, "duration": 3.9}, {"text": "And then Paramount suddenly wants to keep this war going,", "start": 1048.443, "duration": 3.06}, {"text": "even though top execs already said that this whole war doesn't matter?", "start": 1051.503, "duration": 3.84}, {"text": "Fall 2007 was a really late time to suddenly have an interest in this format war,", "start": 1055.483, "duration": 5.06}, {"text": "we definitely can't prove anything, but it just doesn't add up!", "start": 1060.543, "duration": 3.68}, {"text": "At the very least, Microsoft was involved in the HD DVD promotion group that was in charge of commercials,", "start": 1064.303, "duration": 5.56}, {"text": "and signed another generous deal with Paramount's parent company, Viacom, later that year.", "start": 1070.023, "duration": 5.0}, {"text": "Whatever the case, this seemed poised to prolong the HD DVD battle for another year at least.", "start": 1075.883, "duration": 5.96}, {"text": "It also made Warner Bros., who was responsible for a majority of the physical video market at the time,", "start": 1081.843, "duration": 5.3}, {"text": "the only purple studio standing.", "start": 1087.203, "duration": 2.1}, {"text": "As the year closed out, the PS3 had sold 3.25 million units total.", "start": 1089.343, "duration": 4.4}, {"text": "Overall, though it had been shaken by the Paramount deal, Blu-ray maintained its edge over HD DVD.", "start": 1093.743, "duration": 5.54}, {"text": "Sony was making strides in the home video market,", "start": 1099.283, "duration": 2.56}, {"text": "though at a high cost to their former dominance in the video game market.", "start": 1101.843, "duration": 3.94}, {"text": "In January 2008, right before the opening of the Consumer Electronics Show,", "start": 1107.723, "duration": 4.76}, {"text": "right when it would have had the maximum impact", "start": 1112.483, "duration": 2.0}, {"text": "and would have given HD DVD the least amount of wiggle room,", "start": 1114.483, "duration": 3.5}, {"text": "Warner Bros. surprised announced that it was dropping HD DVD in favor of Blu-ray.", "start": 1118.143, "duration": 5.44}, {"text": "To borrow the lingua franca of the time,", "start": 1123.643, "duration": 2.46}, {"text": "Warner Bros. basically spawn-camped on HD DVD and then tea-bagged them while they were down!", "start": 1126.163, "duration": 4.32}, {"text": "Is that too much? I was playing a lot of Halo at the time, it seemed like an appropriate way to put that...", "start": 1130.743, "duration": 3.68}, {"text": "... anyway, I just can't oversell to you what a big deal this was!", "start": 1134.583, "duration": 3.78}, {"text": "And this time, this decision wasn't the result of some calculated backdoor deal:", "start": 1138.363, "duration": 4.22}, {"text": "You see, Warner Bros. had been selling Total HD discs that could work on both players,", "start": 1142.603, "duration": 4.98}, {"text": "but after the Paramount deal, they decided to sell both formats side-by-side and let the market decide.", "start": 1147.583, "duration": 5.22}, {"text": "One of these first movies was Harry Potter and the Order of the Phoenix, and guess what?", "start": 1152.883, "duration": 3.48}, {"text": "The Blu-ray version sold better, and that was that.", "start": 1156.703, "duration": 2.48}, {"text": "By choosing sides, Warner Bros. gave Blu-ray control of 75% of the home video market.", "start": 1159.283, "duration": 5.68}, {"text": "Toshiba claimed HD DVD wasn't dead,", "start": 1165.043, "duration": 2.36}, {"text": "but it also cancelled its big HD DVD press conference later that day at the Consumer Electronics Show.", "start": 1167.403, "duration": 4.96}, {"text": "They then, in a desperate move, slashed the prices of HD DVD players by 50%,", "start": 1172.403, "duration": 5.04}, {"text": "but it wasn't enough: Pretty soon two more big players in the home video business,", "start": 1177.623, "duration": 4.16}, {"text": "Wal-Mart and Netflix, dropped HD DVD, and Toshiba finally gave in.", "start": 1181.783, "duration": 4.34}, {"text": "In mid-February 2008, Toshiba announced they would no longer make HD DVD players.", "start": 1186.203, "duration": 5.14}, {"text": "After that, the rest of the supporters fell like dominoes:", "start": 1191.363, "duration": 2.86}, {"text": "Universal and Paramount went all-in on Blu-ray,", "start": 1194.243, "duration": 2.36}, {"text": "and Microsoft begrudingly discontinued Xbox HD DVD drives a few days later.", "start": 1196.603, "duration": 5.42}, {"text": "After only one year and ten months of official battle,", "start": 1202.103, "duration": 3.3}, {"text": "Blu-ray ended up outselling HD DVD by a factor of four-to-one,", "start": 1205.483, "duration": 4.26}, {"text": "with 81% of all Blu-ray players being PlayStation 3's.", "start": 1209.743, "duration": 4.06}, {"text": "Xbox 360 HD DVD Drive, by the way, accounted for only 30% of HD DVD players on the market.", "start": 1213.843, "duration": 6.38}, {"text": "HD DVD was officially dead.", "start": 1220.763, "duration": 2.64}, {"text": "Blu-ray, and by extension Sony, was the winner.", "start": 1223.403, "duration": 2.96}, {"text": "Or were they?", "start": 1227.643, "duration": 0.88}, {"text": "Y'know, one thing I've learned about Microsoft is that it's always about the long con.", "start": 1228.523, "duration": 3.96}, {"text": "And to explain what I mean, we're gonna turn to one of the most esteemed intellectual leaders of our time...", "start": 1232.583, "duration": 5.08}, {"text": "... Michael- Michael Bay? Is that right?", "start": 1238.103, "duration": 1.92}, {"text": "Michael Bay.", "start": 1241.443, "duration": 0.7}, {"text": "BAY: \"What you don't understand is corporate politics.\"", "start": 1243.703, "duration": 2.66}, {"text": "\"Microsoft wants both formats to fail so they can be heroes and make the world move to digital downloads.\"", "start": 1246.363, "duration": 6.16}, {"text": "\"That's the dirty secret no-one's talking about,\"", "start": 1252.643, "duration": 2.46}, {"text": "\"that's why Microsoft is handing out $100 million checks to studios\"", "start": 1255.103, "duration": 3.74}, {"text": "\"just to embrace the HD DVD and not the leading and superior Blu-ray.\"", "start": 1258.843, "duration": 4.7}, {"text": "\"They want confusion in the market until they perfect digital downloads.\"", "start": 1263.763, "duration": 4.52}, {"text": "\"Time will tell, and you will see the truth.\"", "start": 1268.463, "duration": 2.66}, {"text": "\"I'm Michael Bay, professional ****bag,\"", "start": 1271.363, "duration": 2.22}, {"text": "\"signing out from the Shoot for the Edit forums after Transformers went HD DVD.\"", "start": 1273.583, "duration": 5.02}, {"text": "Okay, stick with me here:", "start": 1278.803, "duration": 1.48}, {"text": "Just because the peeing robots guy thinks it's all a conspiracy theory... doesn't mean it isn't!", "start": 1280.443, "duration": 5.22}, {"text": "It's hard for me to explain all of Microsoft's actions otherwise,", "start": 1285.863, "duration": 3.38}, {"text": "the multiple times they've rescued HD DVD from oblivion,", "start": 1289.303, "duration": 2.82}, {"text": "without actually doing the thing that would have saved it: Putting an HD DVD drive inside the 360!", "start": 1292.243, "duration": 5.86}, {"text": "Because we know the PS3 won this format war for Sony!", "start": 1298.143, "duration": 4.02}, {"text": "Can you imagine how different all this would have been if 360 had HD DVD built in?", "start": 1302.463, "duration": 5.54}, {"text": "So for once, I agree with the Hollywood director that just won't let feathered hair die!", "start": 1308.303, "duration": 6.18}, {"text": "BAY: \"This sentence was directed by Michael Bay.\"", "start": 1314.543, "duration": 1.54}, {"text": "Microsoft at least partially used HD DVD to distract Sony", "start": 1316.703, "duration": 3.84}, {"text": "and push everyone onto its upcoming video streaming services, of which Xbox 360 would be the center of.", "start": 1320.543, "duration": 5.88}, {"text": "You see, a few months after the death of HD DVD,", "start": 1326.783, "duration": 2.9}, {"text": "Microsoft unveiled its newer, more casual-friendly NXE redesign,", "start": 1329.683, "duration": 4.46}, {"text": "and announced that Xbox 360 would be the first and only console system with Netflix,", "start": 1334.143, "duration": 6.38}, {"text": "an exclusivity they held for about a year.", "start": 1340.523, "duration": 2.42}, {"text": "And this would be in addition to its other video rental and download store,", "start": 1342.943, "duration": 3.6}, {"text": "launched a year and a half earlier in 2006.", "start": 1346.543, "duration": 2.92}, {"text": "Sony, on the other hand, had only just launched its video download store and trophies,", "start": 1349.523, "duration": 4.72}, {"text": "and was seriously lagging behind Xbox on streaming.", "start": 1354.243, "duration": 2.96}, {"text": "Since Sony's online services were free, they weren't able to compete with the quality of Xbox Live,", "start": 1357.203, "duration": 5.18}, {"text": "which was largely funded through its $50-a-year Gold membership.", "start": 1362.383, "duration": 3.84}, {"text": "Self-plug: We actually went over a lot of this in our Netflix video, if you wanna know more!", "start": 1366.263, "duration": 4.52}, {"text": "Sony was so focused on cornering the physical market and its delicious royalties", "start": 1371.163, "duration": 4.58}, {"text": "that they weren't able to see that the future of entertainment was going to be online streaming,", "start": 1375.803, "duration": 4.68}, {"text": "or they were so invested in finally getting a piece of that physical media market", "start": 1380.483, "duration": 3.78}, {"text": "that they weren't able to course-correct to streaming fast enough.", "start": 1384.263, "duration": 3.24}, {"text": "I get it! Losing to Betamax and DVD was just too painful for them, and they couldn't see straight!", "start": 1387.943, "duration": 5.24}, {"text": "Microsoft knew this, and exploited it.", "start": 1393.183, "duration": 2.12}, {"text": "It's hard to break down exactly how much money Sony made off of Blu-ray.", "start": 1395.343, "duration": 4.06}, {"text": "How the royalties for Blu-ray are split between all the founding companies has never been disclosed,", "start": 1399.483, "duration": 4.5}, {"text": "but by 2014, Sony admitted that it no longer thinks it would be able to make back its investment on Blu-ray.", "start": 1403.983, "duration": 6.22}, {"text": "That includes R&D, marketing, persuading industry and studio players onto their side, and hardware.", "start": 1410.363, "duration": 5.82}, {"text": "The PS3 itself would go on to overtake the 360 in global sales, but it lost Sony billions!", "start": 1416.323, "duration": 6.7}, {"text": "And Blu-ray still isn't the dominant force in physical home video market, no!", "start": 1423.083, "duration": 4.42}, {"text": "That crown still belongs to DVD!", "start": 1427.563, "duration": 2.44}, {"text": "Right now, go to Best Buy, go to Wal-Mart, you will still see more DVD's than Blu-rays! In 2019!", "start": 1430.223, "duration": 6.22}, {"text": "Imagine ten years ago, still seeing more VHS tapes than DVD's!", "start": 1436.563, "duration": 3.56}, {"text": "When Blu-ray and HD DVD launched in 2006, YouTube was already a sensation.", "start": 1440.283, "duration": 5.42}, {"text": "Remember to comment and rate five stars, y'all!", "start": 1445.703, "duration": 1.76}, {"text": "And it was already apparent that the physical market was on its way out:", "start": 1447.523, "duration": 3.56}, {"text": "Today the home video market is bigger than it's ever been, and digital absolutely dominates it.", "start": 1451.163, "duration": 5.88}, {"text": "The fact of the matter is that Sony was so focused on not being Betamax or the loser on DVD's again,", "start": 1457.043, "duration": 5.14}, {"text": "that they failed to see that the cheapest, most convenient solution had once again beaten them,", "start": 1462.183, "duration": 4.02}, {"text": "only this time, it was all online.", "start": 1466.203, "duration": 1.78}, {"text": "As for everyone else, Toshiba was actually fine after pulling out of the HD market.", "start": 1468.203, "duration": 4.3}, {"text": "It turns out finished electronic goods like HD DVD players and TV's", "start": 1472.503, "duration": 3.68}, {"text": "accounted for less than 10% of their bottom line anyway.", "start": 1476.183, "duration": 2.96}, {"text": "Microsoft would continue to largely dominate the PS3 for most of the generation,", "start": 1479.203, "duration": 4.44}, {"text": "though by the end, cracks were beginning to show.", "start": 1483.643, "duration": 2.3}, {"text": "I wonder if ports like the four-disc Wolfenstein on Xbox 360 made them regret sticking with a DVD drive.", "start": 1485.943, "duration": 6.56}, {"text": "Their ultimate goal, to have the Xbox brand as the streaming entertainment center of the living room,", "start": 1492.503, "duration": 4.96}, {"text": "might have worked if they hadn't so thoroughly bungled the announcement of Xbox One,", "start": 1497.603, "duration": 4.48}, {"text": "and Sony was ready to jump on that, and dominated this generation of consoles with the PlayStation 4.", "start": 1502.183, "duration": 5.5}, {"text": "[chuckles] I mean, it's kind of ironic that Microsoft probably plays Sony a royalty", "start": 1507.703, "duration": 4.42}, {"text": "for every Xbox One sold, because of the Blu-ray drive!", "start": 1512.123, "duration": 2.9}, {"text": "But now? We're actually gearing up for a new entertainment war,", "start": 1515.183, "duration": 3.48}, {"text": "and Sony and Microsoft have joined forces, at least for now, for the transition to streaming video games,", "start": 1518.663, "duration": 5.96}, {"text": "all in the service of making sure Google and others don't beat them at their own game.", "start": 1524.623, "duration": 4.04}, {"text": "[sigh] War never changes...", "start": 1529.143, "duration": 2.32}, {"text": "Big shout-out to Geoff from Mother's Basement for being our Michael Bay in this video,", "start": 1532.023, "duration": 3.46}, {"text": "links to his channel in the description below, and hey!", "start": 1535.483, "duration": 2.66}, {"text": "This video, this channel, why don'tcha like, comment, subscribe, all that stuff, if you wanna watch videos early,", "start": 1538.363, "duration": 5.88}, {"text": "if you wanna be a part of the podcast or the exclusive Discord, that's all attached to our Patreon,", "start": 1544.243, "duration": 5.06}, {"text": "every single one of these awesome people right here not only supports the show,", "start": 1549.303, "duration": 2.74}, {"text": "but they get access to all that stuff, and you can join their ranks too,", "start": 1552.043, "duration": 2.82}, {"text": "so go click on that link, give what you can, but hey, or just keep watchin' man, we got -", "start": 1554.863, "duration": 4.82}, {"text": "I gotta get goin' cuz we got more videos we're makin' right now! We never stop!", "start": 1559.683, "duration": 3.76}, {"text": "So, thanks so much for watching, we'll see you again real soon!", "start": 1563.563, "duration": 3.22}, {"text": "Give us five stars, follow me on Myspace!", "start": 1568.143, "duration": 2.04}]