[{"text": "Bobby Meisner", "start": 0.0, "duration": 1.569}, {"text": "One of the greatest artists of our generation. If you guys aren't familiar with Bobby Meisner", "start": 1.569, "duration": 3.979}, {"text": "he's a youtuber that has blown up a little bit recently. A couple months ago", "start": 5.548, "duration": 3.532}, {"text": "he posted this video called LIFE of a BILLIONAIRE'S SON", "start": 9.08, "duration": 3.26}, {"text": "It's a video talking about how his dad was like a really successful", "start": 12.36, "duration": 2.22}, {"text": "businessman and sold a company for a lot of money when he was pretty young and now Bobby has", "start": 14.95, "duration": 4.999}, {"text": "more money than he knows what to do with. Needless to say six figures. He was only four", "start": 20.32, "duration": 4.94}, {"text": "Well, not really", "start": 25.26, "duration": 1.29}, {"text": "I think he was like 15 when his dad sold the company", "start": 26.55, "duration": 2.79}, {"text": "But nevertheless Bobby has been taking time out of his busy", "start": 29.34, "duration": 2.54}, {"text": "billionaire schedule to show us peasants what it's like to have so much money that you could literally buy-- a country", "start": 32.22, "duration": 6.5}, {"text": "So today I just kind of wanted to watch a couple of Bobby's videos and get a little bit of a glimpse into the life", "start": 38.73, "duration": 4.99}, {"text": "of a billionaire son. See what it's like. Maybe check out some of the crazy parties he has some of the wild adventures he goes", "start": 43.739, "duration": 5.76}, {"text": "on. It's gonna be lit. So this is a video that Bobby posted in November", "start": 49.5, "duration": 3.029}, {"text": "It's called life of a billionaire son. And so many people in the commentary community especially I've already talked about this video", "start": 52.53, "duration": 5.31}, {"text": "So I'm gonna sort of skim through it. This video is sort of like a summary of his life up till this point.", "start": 57.84, "duration": 5.92}, {"text": "\"Your life, is like a movie and", "start": 63.78, "duration": 2.42}, {"text": "You're the main character", "start": 66.64, "duration": 1.68}, {"text": "so why wouldn't you make it the greatest movie you've ever seen\"", "start": 68.32, "duration": 4.18}, {"text": "because... my favorite movie's Star Wars and Jedi aren't real. I like that", "start": 72.5, "duration": 5.4}, {"text": "the first thing he says in this video clues you into the fact that he has like no idea what normal people's lives are like", "start": 77.909, "duration": 5.79}, {"text": "He just kind of assumes everybody has the ability to make their lives like this hollywood-esque", "start": 83.7, "duration": 4.41}, {"text": "Movie, I mean honestly, why doesn't everybody just make their lives a fucking movie, dude?", "start": 89.11, "duration": 4.25}, {"text": "How hard is it to be born into wealth? Can't be that hard cuz I did it and I'm super lazy. \"Who is Bobby?", "start": 93.36, "duration": 6.599}, {"text": "Basically a little bit of a misfit kid\" (Danny) Aw", "start": 104.34, "duration": 2.78}, {"text": "\"a kid who has everything. Bobby likes to live life fast", "start": 107.12, "duration": 3.04}, {"text": "fast cars", "start": 111.159, "duration": 2.0}, {"text": "beautiful girls", "start": 113.17, "duration": 2.0}, {"text": "parties\"", "start": 115.479, "duration": 1.89}, {"text": "Bobby's just a misfit kid. That's who he is. He doesn't fit in you wouldn't understand him", "start": 117.369, "duration": 4.52}, {"text": "He's only into weird quirky things like beautiful girls and fast cars and parties poor guy. Nobody understands him", "start": 121.89, "duration": 7.05}, {"text": "So then he explains a little bit about his life and how he grew up", "start": 128.97, "duration": 2.519}, {"text": "He actually grew up living with his mom because his parents were divorced and until he was 15", "start": 131.489, "duration": 4.529}, {"text": "He grew up a pretty average life his mom wasn't like super wealthy or anything", "start": 136.019, "duration": 3.42}, {"text": "He says he wasn't really rich, but he wasn't really poor but when Bobby was 15", "start": 139.44, "duration": 3.479}, {"text": "That's when everything changed. His dad sold his company for a lot of money and I guess Bobby was just like peace mom", "start": 142.92, "duration": 6.899}, {"text": "I'm gonna go I'm gonna go live with dad. He's ballin out here", "start": 150.16, "duration": 3.949}, {"text": "So I'm just gonna, I'm just gonna go be a billionaire if that's cool", "start": 154.11, "duration": 2.849}, {"text": "\"This is when he sold his company for 300 million dollars", "start": 156.959, "duration": 4.05}, {"text": "then my life changed forever\"", "start": 161.34, "duration": 2.76}, {"text": "His dad sold this company for", "start": 164.1, "duration": 1.56}, {"text": "300 million dollars and that's how I became the son of a billionaire", "start": 165.88, "duration": 4.7}, {"text": "or", "start": 172.12, "duration": 0.5}, {"text": "wait", "start": 172.63, "duration": 2.0}, {"text": "He must have invested it?", "start": 176.8, "duration": 2.26}, {"text": "\"I moved to Europe", "start": 181.16, "duration": 1.58}, {"text": "My dad started getting a lot of nice things.\" Yeah, my dad started getting a lot of nice things", "start": 183.16, "duration": 6.1}, {"text": "It just sounds so weird for him to be saying it in such a cool voice", "start": 189.42, "duration": 2.82}, {"text": "Sounds so weird to brag about something your dad did. My dad started bringing a lot of really pretty girls", "start": 192.34, "duration": 5.69}, {"text": "Around and my dad has a really good work ethic and I was also there", "start": 198.13, "duration": 4.639}, {"text": "\"We got a villa in San Tropez", "start": 203.58, "duration": 2.0}, {"text": "*rock music*", "start": 206.78, "duration": 2.0}, {"text": "Houses in Monaco\" Then there's this whole section called", "start": 210.28, "duration": 2.34}, {"text": "\"Stereotypes\" In this section", "start": 212.78, "duration": 1.74}, {"text": "He talks about how he's always hated how rich kids have this negative stigma where people", "start": 214.53, "duration": 4.47}, {"text": "assume that just because he's rich and he's inherited wealth that he is some spoiled brat who has no respect for responsibility and", "start": 219.28, "duration": 7.729}, {"text": "No work ethic and that's always been something that bothered him. And then he tells the story about how for his 18th birthday", "start": 227.29, "duration": 6.229}, {"text": "He played hooky from his elite private boarding school and went to the south of France to party and that's how we beat that", "start": 233.52, "duration": 6.0}, {"text": "stereotype, I guess", "start": 239.68, "duration": 2.32}, {"text": "\"I started a YouTube channel", "start": 242.2, "duration": 0.99}, {"text": "I also partnered with my best friend Brandon to create Candyland productions in order to make a living out of something", "start": 243.19, "duration": 6.949}, {"text": "we love by creating films for brands and artists", "start": 250.14, "duration": 3.479}, {"text": "I'm even going to be creating videos for the legendary musician, Julian Pareto\"", "start": 253.62, "duration": 4.47}, {"text": "Anyway, the whole gist of this video is that he's trying to convince you that he's not your typical rich kid", "start": 258.09, "duration": 5.73}, {"text": "He's not your average billionaire son", "start": 263.82, "duration": 2.009}, {"text": "Because he's got ambition and a vision and a YouTube channel and I guess his vision for this YouTube channel is to create", "start": 266.229, "duration": 7.61}, {"text": "branded and", "start": 274.18, "duration": 0.989}, {"text": "sponsored videos for companies and that's how he's gonna make money and that's how he's going to", "start": 275.169, "duration": 4.4}, {"text": "Make his own dreams come true and build his own Empire. So...", "start": 279.64, "duration": 3.829}, {"text": "Will it work? This is his most recent video. It's called billionaire's holiday in Cape Town South Africa", "start": 284.32, "duration": 5.64}, {"text": "\"Art is the closest we come to experiencing how a stranger feels\"", "start": 296.1, "duration": 4.56}, {"text": "Who said that? Why does that quote have no citation?", "start": 300.8, "duration": 2.18}, {"text": "It's in quotes", "start": 302.99, "duration": 0.9}, {"text": "like somebody famous said it but it", "start": 303.89, "duration": 1.99}, {"text": "doesn't tell you who. Doesn't matter who I guess. Doesn't matter who said it because someone said it and if someone said it than it", "start": 305.88, "duration": 5.839}, {"text": "must be true.", "start": 311.72, "duration": 2.0}, {"text": "AAAA! Oh", "start": 317.4, "duration": 1.32}, {"text": "I thought he was a ghost for a second", "start": 319.1, "duration": 2.0}, {"text": "That would be an interesting twist if he was like, I'm not like other rich kids. I've", "start": 321.11, "duration": 3.389}, {"text": "been dead for 20 years.", "start": 325.02, "duration": 2.26}, {"text": "\"Hey. How are you?\"", "start": 327.62, "duration": 2.34}, {"text": "Good? \"Good!\"", "start": 333.24, "duration": 1.74}, {"text": "\"For those of you don't know me my name is Bobby", "start": 334.98, "duration": 2.63}, {"text": "I'm a 23 year old Australian American citizen and I've been living in the UK since the age of 15", "start": 337.86, "duration": 6.109}, {"text": "My favorite color is red\" There's something really weird about this shot like right from the start", "start": 344.55, "duration": 4.609}, {"text": "I kind of got a weird vibe from it", "start": 349.16, "duration": 1.92}, {"text": "It's just I don't know kind of strange the way he's looking into the camera and all the like the awkward pauses. The weird", "start": 351.08, "duration": 5.16}, {"text": "ambient wind sound I feel like he's just looking right into my soul", "start": 356.34, "duration": 3.679}, {"text": "like he's looking right through the camera through the internet out of my computer screen and right into my wallet and", "start": 360.12, "duration": 6.59}, {"text": "judging how poor I am. I don't like this. He knows he knows how much money is in my bank account", "start": 367.11, "duration": 4.339}, {"text": "He knows it's not a billion dollars and he's disappointed", "start": 371.45, "duration": 3.089}, {"text": "\"Now there's one thing that I love more than anything", "start": 375.18, "duration": 3.56}, {"text": "Do you know what that is?", "start": 379.86, "duration": 2.0}, {"text": "Filmmaking, I love it more than fast cars more than jets", "start": 382.92, "duration": 3.92}, {"text": "Girls parties candy Christmas you get it?\" Yeah, I get it", "start": 387.45, "duration": 4.04}, {"text": "I know what good things are you don't have to keep listing good things cuz I know what those are", "start": 391.49, "duration": 4.709}, {"text": "I know what good things are. \"I love", "start": 396.2, "duration": 2.0}, {"text": "filmmaking. I'm pretty good at it too.\" Yep. You could say I'm pretty good at filmmaking", "start": 398.67, "duration": 4.91}, {"text": "I mean the cameraman did just run into a tree and instead of", "start": 403.89, "duration": 6.139}, {"text": "redoing the take I just went with it, but that was an artistic choice", "start": 410.55, "duration": 3.47}, {"text": "Because I'm an artist. \"Recently I made a promotional campaign\"", "start": 414.84, "duration": 3.649}, {"text": "You can tell that the cameraman keeps running into these tree branches that are on the side of this alleyway", "start": 420.44, "duration": 5.02}, {"text": "cuz they keep jiggling every time he walks by them", "start": 425.48, "duration": 2.73}, {"text": "Maybe they should have picked a better spot to film this then this random alleyway", "start": 428.21, "duration": 3.809}, {"text": "I assume he's got like a mansion with a long hallway he could have filmed this in. It probably would have been a better", "start": 432.02, "duration": 4.62}, {"text": "attention-grabber than just walking down this plain-looking alley", "start": 436.76, "duration": 3.72}, {"text": "It's just such a weird and", "start": 440.48, "duration": 1.66}, {"text": "avoidable thing to not have your cameraman getting whacked in the back of the head with a tree branch every five seconds.", "start": 442.14, "duration": 5.68}, {"text": "\"Now that you've", "start": 447.82, "duration": 0.549}, {"text": "got to know me a bit better, I want to know you. I want to know what makes you tick", "start": 448.369, "duration": 4.131}, {"text": "What your passion is?\" Oh, well, I like to pet my dog. I like making YouTube videos. I like to make music- \"Anyway", "start": 453.21, "duration": 7.789}, {"text": "London is pretty cold.\" *Danny with pouty voice* Why'd you even ask if you don't care? \"London is pretty cold", "start": 461.64, "duration": 4.04}, {"text": "so", "start": 466.29, "duration": 1.08}, {"text": "It's time for us to go on a journey", "start": 467.37, "duration": 2.0}, {"text": "What?!? This video is so awkward so far. It's just like so much awkward silence between his lines", "start": 474.61, "duration": 6.139}, {"text": "I feel like they should have done some jump cuts or something and then the end he just feels like it's too cold in London", "start": 480.749, "duration": 4.62}, {"text": "so let's get out of here and then he walks away and I don't know what I", "start": 485.65, "duration": 3.559}, {"text": "expected maybe for him to get in like a nice car and drive away or for it to just cut but the way he just", "start": 489.279, "duration": 5.15}, {"text": "like walks in silence", "start": 494.43, "duration": 2.0}, {"text": "Away, like what? Is he gonna walk?", "start": 496.839, "duration": 2.0}, {"text": "To the airport. So then it turns into a bit of a travel vlog. He goes to the airport with his friend", "start": 499.36, "duration": 4.549}, {"text": "There's this 30-second clip of his friend. Just insulting him your adoptive", "start": 504.069, "duration": 4.1}, {"text": "Mom you ran away from your mom for your", "start": 509.86, "duration": 2.0}, {"text": "floating hand", "start": 512.769, "duration": 0.861}, {"text": "so that's weird talking about how like he abandoned his mom to go live with his dad and", "start": 513.63, "duration": 4.709}, {"text": "Reap the benefits of having a rich dad all pretty mean things to say", "start": 518.56, "duration": 3.919}, {"text": "I mean", "start": 522.479, "duration": 0.6}, {"text": "I guess they're true", "start": 523.079, "duration": 0.721}, {"text": "If we're to believe what he said maybe he hired this guy to like keep him humble or something", "start": 523.8, "duration": 5.07}, {"text": "Is that a thing that rich people do?", "start": 528.87, "duration": 1.45}, {"text": "We just tried to sign in and we got a screen that says your flight departs from different terminal", "start": 530.32, "duration": 4.25}, {"text": "We are really not off to a good start here at the airport", "start": 534.57, "duration": 3.359}, {"text": "They find out that they're at the wrong", "start": 537.93, "duration": 1.87}, {"text": "Terminal for their flight and they're gonna be late to their flight because they have to go all the way to another terminal", "start": 539.8, "duration": 5.149}, {"text": "So this fast-paced music kicks in they start running to their gate for a second", "start": 544.949, "duration": 3.72}, {"text": "You're sort of like on the edge of your seat. You're like, oh no, I hope they make it", "start": 548.67, "duration": 2.94}, {"text": "I hope they make their flight and they don't have to reschedule but then they start like stopping to dance and", "start": 551.61, "duration": 5.7}, {"text": "Just stand around and talk in the middle of this", "start": 557.769, "duration": 2.929}, {"text": "intense running sequence when they're supposedly about to miss their flight and it immediately makes you not", "start": 561.01, "duration": 5.479}, {"text": "nervous that they're gonna miss their flight anymore because it's", "start": 566.62, "duration": 2.57}, {"text": "Pretty clear that they're not really very worried about it", "start": 569.56, "duration": 2.869}, {"text": "And even if they are gonna miss your flight, you feel like they kind of deserve it because they're just standing around in filming", "start": 572.43, "duration": 4.769}, {"text": "There's a shot at Bobby's friend running by while Bobby films", "start": 577.199, "duration": 2.97}, {"text": "Which was clearly staged because Bobby had to go ahead and then wait for his friend to run past so they obviously didn't film that", "start": 580.17, "duration": 6.51}, {"text": "While running cuz Bobby's not running, but the tension keeps building", "start": 586.68, "duration": 3.389}, {"text": "They're sprinting even their luggage knows that they're in a rush and it's just flying down the hallway", "start": 590.079, "duration": 5.18}, {"text": "And then there's this shot which I am just", "start": 597.48, "duration": 3.289}, {"text": "So confused about I have so many questions. What is this? What is going on here? What is this? What are they dancing?", "start": 601.41, "duration": 6.889}, {"text": "Bobby's just sort of like doing this his friend is like skipping like what the fuck is going on?", "start": 608.339, "duration": 6.409}, {"text": "They're gonna miss their flight. They're too busy dancing. And also who's filming this. I thought it was just them two at the airport", "start": 614.749, "duration": 6.09}, {"text": "that's what the entire rest of the video made it seem like and now all the sudden there's a random other person filming them from", "start": 620.839, "duration": 6.179}, {"text": "This weird like blocked off section. They're like behind glass. This is so confusing", "start": 627.019, "duration": 4.049}, {"text": "It all makes you wonder were they ever even late because they stopped an awful lot to film. You can't deny that", "start": 631.199, "duration": 5.359}, {"text": "It's good filmmaking now because you know what, they say a good filmmaker always leaves his audience questioning everything if that is a quote", "start": 636.559, "duration": 7.38}, {"text": "Someone said that don't ask you but somehow", "start": 644.669, "duration": 2.09}, {"text": "Miraculously, they make their flight and they get to Cape Town South Africa Oh every welcome to South Africa where the mountains meet the sea", "start": 647.279, "duration": 7.19}, {"text": "The girls are beautiful and the party's a while. And of course want to Bobby's favors", "start": 654.779, "duration": 5.45}, {"text": "Boss cause those three things that Bobby loves that just makes it so he can't fit in anywhere", "start": 661.199, "duration": 5.059}, {"text": "You can't relate to anybody because he's got such a weird interest beautiful girls who likes that shit gross", "start": 666.259, "duration": 5.1}, {"text": "So this is where the branded aspect of the content starts to come into play", "start": 671.36, "duration": 3.299}, {"text": "Apparently this whole video is an advertisement for this like luxury car lounge where you can go and hang out and rent luxury cars", "start": 674.79, "duration": 7.25}, {"text": "So the two boys are two boys show up. They both high-five the same person", "start": 682.049, "duration": 4.88}, {"text": "When I first saw that cut I think that the the cut of him doing the trick on that skateboard is just like a random", "start": 691.589, "duration": 5.179}, {"text": "Cut that he throws into transition", "start": 696.769, "duration": 1.771}, {"text": "but I thought", "start": 698.54, "duration": 0.759}, {"text": "at first", "start": 699.299, "duration": 0.6}, {"text": "that he was trying to make it seem like he said that he said why don't we go up to the VIP lounge and then", "start": 699.899, "duration": 5.239}, {"text": "Immediately like did a kickflip on the skateboard like he's been on the skateboard the entire time", "start": 705.139, "duration": 4.979}, {"text": "I thought that was a really weird editing choice for him to make it seem like he's like hey", "start": 710.119, "duration": 3.63}, {"text": "Let's go up to the VIP lounge and then just does a kickflip. Is that a kickflip? I don't know. What a kickflip is", "start": 713.749, "duration": 5.64}, {"text": "So now they're in this area with all these cool cars Bobby's impressing all the girls with his cool skateboard tricks", "start": 726.16, "duration": 5.45}, {"text": "And at first I thought that this was the VIP lounge that he was talking about", "start": 731.61, "duration": 3.299}, {"text": "It's just a giant room full of cars", "start": 734.91, "duration": 1.8}, {"text": "But apparently this is just a sequence where they're walking through this section to get to the VIP lounge", "start": 736.71, "duration": 4.5}, {"text": "So finally they show up in the VIP lounge", "start": 741.21, "duration": 2.52}, {"text": "Everyone takes a seat Bobby and his friend pour themselves a drink and they give a little speech", "start": 743.83, "duration": 4.429}, {"text": "Let's take them out. Let's get the whole crew. That's all of us here. Let's get all of us", "start": 759.49, "duration": 4.849}, {"text": "Let's make sure that we get all of us", "start": 764.34, "duration": 2.0}, {"text": "and let's go take out the Porsche in the Ferrari so", "start": 766.63, "duration": 2.36}, {"text": "Did they just go up to the VIP lounge?", "start": 769.66, "duration": 2.179}, {"text": "to say that to say", "start": 772.45, "duration": 2.0}, {"text": "Let's go we have cars to drive. I'm so confused by the progression of this video", "start": 774.64, "duration": 4.549}, {"text": "They like walk through the nice cars to get to the VIP lounge and then the second they sit down there", "start": 779.2, "duration": 5.66}, {"text": "they're like", "start": 784.86, "duration": 0.52}, {"text": "Let's go check out the cars and then they walk back", "start": 785.38, "duration": 2.63}, {"text": "Downstairs to go check out the cars that they were literally just walking past", "start": 788.08, "duration": 3.5}, {"text": "I guess they had to go to the lounge because they're advertising this whole place and I want to show off the VIP lounge", "start": 791.58, "duration": 4.919}, {"text": "But then why didn't they just start in the VIP lounge? Why did they start in like the normal-looking lobby?", "start": 796.5, "duration": 5.55}, {"text": "They could have just started in the VIP lounge", "start": 802.05, "duration": 1.71}, {"text": "I also like that Bobby starts off his speech by saying the good news is that we have a Porsche and a Ferrari to take", "start": 803.76, "duration": 6.239}, {"text": "Out today as if there's gonna be bad news", "start": 810.0, "duration": 2.0}, {"text": "along with it because usually when you say the good news is", "start": 812.23, "duration": 2.899}, {"text": "That's then followed up by but the bad news is and then you say something bad", "start": 815.32, "duration": 4.13}, {"text": "But in this case, there's no bad news cuz they're all rich", "start": 819.45, "duration": 2.609}, {"text": "He's like the bad news is oh, wait, are we all still rich? Okay, we're all still rich. So there's no bad news", "start": 822.06, "duration": 4.71}, {"text": "We're good. Let's go take the cars. Let's make sure we get the whole crew this time guys whole crew all six of us", "start": 826.77, "duration": 4.619}, {"text": "So let's make sure that we are the whole crew when we go down there", "start": 831.39, "duration": 2.22}, {"text": "anyway", "start": 833.61, "duration": 0.3}, {"text": "I guess they give their little speech the two boys pound their drinks that they're just poured for themselves and then they go for a", "start": 833.91, "duration": 5.64}, {"text": "fast Drive", "start": 839.55, "duration": 2.0}, {"text": "All right, yes now it's time for some sick car action they finally got the cars out", "start": 851.07, "duration": 5.39}, {"text": "This is what I assume", "start": 856.46, "duration": 1.05}, {"text": "the whole video is supposed to be about", "start": 857.51, "duration": 1.72}, {"text": "Showing off the sweet cars that you can go to this place and rent for the day", "start": 859.23, "duration": 3.289}, {"text": "So let's check out some of this sweet car action", "start": 862.52, "duration": 3.03}, {"text": "What", "start": 868.62, "duration": 2.0}, {"text": "So after like 20 seconds of driving around I guess the police showed up and we're like hey you can't", "start": 871.68, "duration": 6.829}, {"text": "Race here that's illegal and they have to stop getting arrested in a foreign country is not very fun", "start": 879.21, "duration": 5.45}, {"text": "So it was time for us to get the fuck out of here", "start": 885.0, "duration": 2.6}, {"text": "They just barely avoided getting arrested I think looks like they got away clean this time because they drove away in their fast cars", "start": 892.2, "duration": 5.809}, {"text": "so that's the end of the whole video and now I'm kind of", "start": 898.01, "duration": 2.64}, {"text": "Confused this whole video and I guess the premise for Bobby meissner's entire channel is I'm not a spoiled rich kid", "start": 901.59, "duration": 6.859}, {"text": "I have a work ethic. I have a vision I'm gonna create", "start": 908.45, "duration": 3.54}, {"text": "Sponsored content so he created this video for this exotic car club", "start": 912.6, "duration": 4.039}, {"text": "Which first off seems like a really nice thing to advertise like what percentage of Bobby's viewers do you think are also?", "start": 916.83, "duration": 6.83}, {"text": "billionaire sons that can afford to go to an exotic car club", "start": 923.97, "duration": 3.2}, {"text": "But even with that being said like is this a good?", "start": 927.17, "duration": 2.789}, {"text": "advertisement for this exotic car club it sort of makes it seem like if you take these cars out onto the road you're gonna get", "start": 930.18, "duration": 5.539}, {"text": "Arrested I will give them props though, if that car area does look pretty fun to walk through", "start": 935.72, "duration": 4.59}, {"text": "I would have no problem walking through that", "start": 940.31, "duration": 2.0}, {"text": "Walking back on through it and walking right back on through again Bobby's channels", "start": 943.2, "duration": 4.34}, {"text": "So interesting to me because he's the son of a billionaire", "start": 947.54, "duration": 2.969}, {"text": "He has like everything that you could ever ask for but his YouTube videos are still not", "start": 950.76, "duration": 4.7}, {"text": "Very good and that's not to say that they could it be there are plenty of really rich people who make just fine", "start": 956.13, "duration": 5.869}, {"text": "YouTube videos, I mean Will Smith is an insanely rich person, but he puts a lot of work and money into his YouTube videos", "start": 962.36, "duration": 6.57}, {"text": "I'm not saying that Will Smith's YouTube videos are my favorite YouTube videos", "start": 968.93, "duration": 3.029}, {"text": "I'm just saying that's an example of somebody who has blown up on YouTube making", "start": 971.96, "duration": 4.14}, {"text": "Content that people like I guess it just goes to show that no matter how much money you have", "start": 976.35, "duration": 4.07}, {"text": "How rich your dad is that doesn't necessarily mean that you're gonna be good at YouTube", "start": 981.15, "duration": 5.51}, {"text": "It takes work, it takes practice and it takes the whole krill you got to make sure you have the whole crew going", "start": 986.66, "duration": 5.309}, {"text": "Anyway, Greg. I hope you enjoyed this little look into a billionaires life. But now it's time to hear from our sponsor", "start": 991.97, "duration": 5.279}, {"text": "Hey guys, it's me. Danny from the video. You just watched and this is my data. I love my data so much", "start": 997.25, "duration": 6.24}, {"text": "I love storing it looking at it", "start": 1003.49, "duration": 2.219}, {"text": "Petting it I even love sharing it with my friends sometimes but what I don't love is when websites and hackers and other online", "start": 1006.05, "duration": 7.519}, {"text": "Scoundrels try to steal my precious information. It's mine and it's private you think I want people seeing this", "start": 1014.12, "duration": 6.44}, {"text": "No one can ever see this", "start": 1021.53, "duration": 2.0}, {"text": "It would ruin me. That's why I use Express VPN expressvpn offers", "start": 1023.57, "duration": 4.099}, {"text": "So many features anonymity and privacy so you can't be tracked by websites or your internet service provider the ability to unblock content", "start": 1027.67, "duration": 6.51}, {"text": "That's not available in your country, but most importantly to me", "start": 1034.18, "duration": 2.969}, {"text": "Security nobody's gonna steal this data. I like to do a lot of my work in coffee shops", "start": 1037.79, "duration": 4.13}, {"text": "Whether it be things like writing videos or sending sensitive emails or paying off hitmen", "start": 1041.92, "duration": 4.65}, {"text": "But when you're on a public Wi-Fi like the ones at coffee shops", "start": 1046.57, "duration": 2.549}, {"text": "It's pretty easy for hackers to get ahold of your precious data", "start": 1049.12, "duration": 2.609}, {"text": "but with expressvpn", "start": 1051.73, "duration": 1.27}, {"text": "Nobody's gonna steal this data one of the best things about it is it's super easy to set up you can download and install it", "start": 1053.0, "duration": 4.849}, {"text": "in minutes", "start": 1057.85, "duration": 0.6}, {"text": "It just takes a little bit of this and a little bit of this and you're good to go expressvpn offers the fastest speeds", "start": 1058.45, "duration": 5.339}, {"text": "24/7 customer service it works out of Windows Mac iOS", "start": 1064.49, "duration": 3.38}, {"text": "Android and more and it's less than $7 a month with a 30-day money-back guarantee", "start": 1068.72, "duration": 4.61}, {"text": "What's not to love?", "start": 1073.7, "duration": 1.1}, {"text": "Take back your internet privacy today and find out how you can get three months of expressvpn", "start": 1074.8, "duration": 3.419}, {"text": "for free by visiting the link in my description", "start": 1078.29, "duration": 2.0}, {"text": "It's expressvpn comm slash. Danny gonzalez. That's expr ESS VPN comm slash", "start": 1080.53, "duration": 5.729}, {"text": "Danny gonzalez for three months free with a one-year package visiting expressvpn comm slash. Danny gonzalez", "start": 1086.26, "duration": 5.25}, {"text": "Not only helps you guys keep your internet secure, but it also helps support this channel", "start": 1091.51, "duration": 4.38}, {"text": "so thank you to expressvpn for sponsoring this video and thank you to you guys for", "start": 1095.9, "duration": 3.92}, {"text": "Checking out expressvpn. Alright guys. Well, I hope you enjoyed this video really quick", "start": 1100.34, "duration": 4.309}, {"text": "Thank you guys for the overwhelming response to the slime video that I posted last week", "start": 1104.65, "duration": 4.109}, {"text": "I was obviously hoping that that would be well-received since I put a lot of time and effort", "start": 1108.76, "duration": 5.07}, {"text": "That video and the response to it is like completely blown me away", "start": 1114.029, "duration": 3.15}, {"text": "I've gotten way better feedback than I thought I would so thank you guys for enjoying that that's definitely something that I've wanted to do", "start": 1117.179, "duration": 5.729}, {"text": "more of I've been making", "start": 1122.909, "duration": 1.57}, {"text": "Comedy music like this since I was in high school and I sort of stopped doing it once I started doing commentary", "start": 1124.479, "duration": 5.21}, {"text": "I really liked doing the music stuff", "start": 1129.69, "duration": 1.5}, {"text": "So hopefully you guys like it too and I will continue to try to shoehorn that into all of my videos. Just kidding", "start": 1131.19, "duration": 5.699}, {"text": "Not all of them, but some of them as I said before you can stream slime on any major streaming service", "start": 1136.889, "duration": 5.76}, {"text": "I will put the link to that in the description or you can just search", "start": 1142.649, "duration": 2.459}, {"text": "Danny Gonzalez on modify or iTunes or anything like that?", "start": 1145.269, "duration": 2.63}, {"text": "You can also still get merch at Danny Gonzalez dots store and with that being said", "start": 1147.899, "duration": 4.02}, {"text": "Thank you. Pepperoni Stromboli for turning out my notifications. You are truly Gregg", "start": 1151.96, "duration": 3.679}, {"text": "I'll see you guys next time where I rub a lamp and a man comes out and he grants my wishes", "start": 1155.639, "duration": 4.92}]