[{"text": "The pixel buds come with a charging case, features exclusive to pixel phones, and they're priced at", "start": 0.16, "duration": 7.08}, {"text": "$159 making them pretty much the Android equivalent to Apple's air pods", "start": 8.02, "duration": 5.18}, {"text": "But are these even close to as good? and can they deliver on their promise of offering magical", "start": 14.04, "duration": 6.78}, {"text": "Real-time translation, just like they did in the scripted onstage demo. I think kind of blue would suit you", "start": 21.609, "duration": 7.1}, {"text": "alright", "start": 29.349, "duration": 1.531}, {"text": "We will see", "start": 30.88, "duration": 2.0}, {"text": "Massdrop's best-selling Sennheiser HD", "start": 41.31, "duration": 2.75}, {"text": "6xx headphones are available again for only 200 US dollars, so check them out at the link in the video description", "start": 44.7, "duration": 6.77}, {"text": "First things first the pixel buds are not truly Wireless", "start": 52.53, "duration": 4.01}, {"text": "But unlike some other neck buds like the j-bird freedoms", "start": 56.91, "duration": 4.579}, {"text": "There's no battery bump or inline control", "start": 61.559, "duration": 3.529}, {"text": "Everything is contained within the earbuds themselves", "start": 65.61, "duration": 2.629}, {"text": "So why then does this cable exist at all?", "start": 69.63, "duration": 3.379}, {"text": "Well, it's actually integral to the buds design starting with the fit the loop formed at the cables end actually goes inside-ish", "start": 73.74, "duration": 7.6}, {"text": "your ear and then can be adjusted for a nice snug fit and to keep them in", "start": 81.5, "duration": 6.42}, {"text": "In practice, it causes a little bit more faffing about to put them in the cable slips", "start": 87.92, "duration": 5.4}, {"text": "but it works surprisingly well to hold them in place and", "start": 93.42, "duration": 3.35}, {"text": "being able to hang them around your neck, it could be argued is a convenient way to keep track of them and", "start": 97.47, "duration": 6.289}, {"text": "and besides, if you prefer", "start": 104.4, "duration": 2.0}, {"text": "truly Wireless pixel buds you can just DIY it any way by cutting the...", "start": 106.68, "duration": 5.62}, {"text": "I'm just kidding not only would cutting off the cable void your warranty", "start": 113.86, "duration": 4.2}, {"text": "You'd also be totally screwed because the cable does conduct audio signals not to mention power", "start": 118.44, "duration": 7.009}, {"text": "The buds 5 hour,  120 milliamp hour battery is completely contained within the left", "start": 125.849, "duration": 6.41}, {"text": "Bud and is not split between the two earphones like with Apple's air pods", "start": 132.26, "duration": 5.22}, {"text": "To charge the battery you will need the included charging case. It is not as small or convinient", "start": 138.18, "duration": 6.82}, {"text": "Or premium feeling as the air pods case. I have some doubts about its long-term durability, and the lip around the edge is", "start": 145.98, "duration": 7.729}, {"text": "pretty stupid", "start": 155.01, "duration": 1.619}, {"text": "Okay, I actually you know what I don't like it very much", "start": 156.629, "duration": 2.69}, {"text": "but the process of putting the buds in is about as good as it could be considering that there's a cable to deal with and", "start": 159.36, "duration": 6.709}, {"text": "it includes a", "start": 166.41, "duration": 2.0}, {"text": "magic pairing mechanism similar to apples provided that you're running Android nougat and", "start": 168.42, "duration": 5.24}, {"text": "That you have a little bit of luck", "start": 174.66, "duration": 2.449}, {"text": "But let's just take them back out and use them compared to the air pods", "start": 177.66, "duration": 3.889}, {"text": "Which only have one gesture which can be remapped depending on your preference per Bud to pause?", "start": 181.55, "duration": 6.0}, {"text": "skip track or", "start": 188.13, "duration": 1.65}, {"text": "summon Siri", "start": 189.78, "duration": 1.44}, {"text": "Google's offers less flexibility at this time, but it does support more gestures", "start": 191.22, "duration": 5.419}, {"text": "Thanks to a capacitive surface", "start": 196.74, "duration": 1.88}, {"text": "That is built into the right", "start": 198.62, "duration": 1.92}, {"text": "bud so you can actually tap to play and pause", "start": 200.54, "duration": 3.329}, {"text": "You can double tap to have notifications read to you", "start": 204.18, "duration": 3.229}, {"text": "You can swipe to adjust volume and you can hold it to summon the Google assistant, which by the way is", "start": 207.42, "duration": 7.04}, {"text": "awesome on the pixel buds the instant you touch the button no latency or even an", "start": 215.61, "duration": 6.74}, {"text": "Acknowledgment tone you can just start talking. What's the price of Bitcoin?", "start": 222.57, "duration": 3.799}, {"text": "Ordering it to play songs, get directions or even send text messages something that isn't supported on the Google home", "start": 226.95, "duration": 7.4}, {"text": "Yet", "start": 234.57, "duration": 1.02}, {"text": "Sorry, I can't send text yet. Oh and one more thing how about that real-time translation?", "start": 235.59, "duration": 6.47}, {"text": "Now two months ago Dennis", "start": 242.67, "duration": 1.52}, {"text": "And I tried out a different product with that same promise and the results were how do we put this tactfully?", "start": 244.19, "duration": 6.929}, {"text": "totally broke dick", "start": 251.4, "duration": 1.65}, {"text": "Okay, so now I'm actually not very certain if it's working properly", "start": 253.05, "duration": 5.389}, {"text": "So let's see if Google can do any better today you're not Dennis", "start": 263.94, "duration": 4.25}, {"text": "Can you get Dennis ok so you ready to try again", "start": 269.7, "duration": 3.859}, {"text": "You kill me hello, it is very nice to meet you oh", "start": 282.9, "duration": 3.619}, {"text": "Yeah audience, ooh", "start": 292.89, "duration": 2.0}, {"text": "Wow it went through a lot of different iterations there.", "start": 299.88, "duration": 6.38}, {"text": "Why is it that whenever we try to do one of these scenarios we end up dating", "start": 317.07, "duration": 4.25}, {"text": "Okay", "start": 351.15, "duration": 2.0}, {"text": "So alright thanks Dennis", "start": 353.669, "duration": 2.87}, {"text": "There are some good things here umm. I don't speak", "start": 358.47, "duration": 3.47}, {"text": "This is based on Google Translate rather than whatever that broken thing we were using before was so the translations are actually pretty good", "start": 366.81, "duration": 7.25}, {"text": "but a", "start": 374.7, "duration": 1.469}, {"text": "couple of issues first of all this functionality with the pixel buds only works with the pixel or pixel 2 series of phones and", "start": 376.169, "duration": 7.97}, {"text": "What was the point of that", "start": 386.46, "duration": 2.12}, {"text": "What was the difference between using pixel buds and just using Google Translate", "start": 390.6, "duration": 5.149}, {"text": "So, okay, let's move on to the one more fairly important thing that we have to discuss here", "start": 400.05, "duration": 5.899}, {"text": "How do the pixel buds sound?", "start": 406.2, "duration": 2.39}, {"text": "actually", "start": 409.29, "duration": 1.05}, {"text": "Not bad compared to the air pods. They have a wider soundstage and are more", "start": 410.34, "duration": 4.25}, {"text": "full-bodied", "start": 415.14, "duration": 1.11}, {"text": "Definitely less tinny meaning. I would say they sound better than the air pods overall", "start": 416.25, "duration": 4.729}, {"text": "With that said despite all of our comparisons between the two here the buds aren't", "start": 421.56, "duration": 6.5}, {"text": "Really competing with the air pods anyway even though they can totally work with an iPhone including Siri integration", "start": 428.88, "duration": 7.069}, {"text": "What they're competing with is all the other?", "start": 436.83, "duration": 2.27}, {"text": "Bluetooth headphones that an Android user might buy in the post headphone jack era and", "start": 439.47, "duration": 5.389}, {"text": "as long as your device supports the features that you want to use with them and", "start": 445.35, "duration": 4.069}, {"text": "you don't mind the relatively cumbersome in our experience pairing and", "start": 450.15, "duration": 4.609}, {"text": "Easier insertion process, I think they are a pretty good choice", "start": 456.24, "duration": 5.389}, {"text": "You know what else is a good choice", "start": 463.26, "duration": 2.0}, {"text": "Crunchyroll the site created by anime fans for anime fans offering the most current episodes of new shows", "start": 465.3, "duration": 6.2}, {"text": "Straight from Japan like Knights and magic and my hero academia season 2 all the content on their site is professionally", "start": 471.75, "duration": 7.16}, {"text": "Subtitled and our link gives you a free trial of their premium service completely ad free", "start": 479.01, "duration": 5.78}, {"text": "and if you enjoy the many benefits of premium like", "start": 484.79, "duration": 2.639}, {"text": "1080p streaming getting new episodes of shows straight from Japan within an hour of their premiere and", "start": 487.5, "duration": 5.239}, {"text": "Being able to stream anywhere anytime from a variety of devices like your phone tablet", "start": 492.99, "duration": 4.519}, {"text": "Or game console you can continue your premium membership to crunchyroll for just 695 a month so go to crunchyroll.com", "start": 497.51, "duration": 5.61}, {"text": "slash Linus and sign up today, so", "start": 503.4, "duration": 2.45}, {"text": "Thanks for watching guys if this video sucked", "start": 506.46, "duration": 1.97}, {"text": "You know what to do?", "start": 508.43, "duration": 0.81}, {"text": "But if it was awesome get subscribed hit that like button or check out the link to where to buy the stuff we featured in", "start": 509.24, "duration": 5.699}, {"text": "the video description", "start": 514.94, "duration": 1.27}, {"text": "Also linked down. There's our merch store, which has cool shirts like this one as well as our community forum, which you should totally join", "start": 516.21, "duration": 6.71}]