[{"text": "This episode was brought to you by Skillshare", "start": 0.22, "duration": 2.0}, {"text": "[Bare Necessities instrumental plays]", "start": 6.98, "duration": 9.1}, {"text": "Question: What kind of bear is best?", "start": 17.02, "duration": 2.92}, {"text": "Every so often, the meta-game of outside breaks into the mainstream for a bit", "start": 20.2, "duration": 3.9}, {"text": "Famous examples include the 'choose two' puzzle or the 'horse-sized duck or a hundred duck-sized horses' meme", "start": 24.3, "duration": 6.0}, {"text": "but perhaps the most famous example is the simple question posed by Jim Halpert in", "start": 30.4, "duration": 4.4}, {"text": "Season 3 episode 21 of the office where he asks what kind of bear is best", "start": 34.96, "duration": 3.98}, {"text": "But before we answer that, let's take a step back and hear how Dwight responds", "start": 39.34, "duration": 3.47}, {"text": "'There are basically two schools of thought' -- he doesn't get to finish his sentence before he gets cut off but he's right", "start": 42.81, "duration": 4.87}, {"text": "There are two schools of thought, those being generalist approach and the specialist approach", "start": 47.82, "duration": 4.36}, {"text": "So which school of thought is better when trying to optimize a bear build?", "start": 52.52, "duration": 3.1}, {"text": "I think the best way to answer that is to outline each approach's most relevant members, and rank each of them on a tier list.", "start": 55.88, "duration": 6.14}, {"text": "So without further ado, let's get into it", "start": 62.1, "duration": 1.56}, {"text": "Perhaps one of the most famous examples of a specialist bear is the Panda", "start": 64.03, "duration": 3.319}, {"text": "I don't think many players would dispute that pandas are easily one of the worst builds in the current meta", "start": 67.35, "duration": 4.949}, {"text": "What they will dispute is why. A lot of players think that pandas are garbage because they have an extremely low respawn rate", "start": 72.82, "duration": 6.229}, {"text": "But pandas actually give birth just as often as other bears. Yes, it's rare, but that hasn't stopped the higher tier bears", "start": 79.36, "duration": 5.94}, {"text": "What's really holding these bears back is their absolute dependence on bamboo", "start": 85.98, "duration": 3.44}, {"text": "Of all the specialized bears pandas are by far the most over specialized. The combination of stats and abilities", "start": 89.64, "duration": 5.88}, {"text": "they've got have made it", "start": 95.52, "duration": 1.26}, {"text": "So even if they decided to stop being strict herbivores and pursue a more generalist approach, they can't really do it without a massive re-spec.", "start": 96.78, "duration": 5.96}, {"text": "They've got the bite force comparable to lions and tigers", "start": 102.94, "duration": 2.92}, {"text": "But with mobility and stealth as low as theirs, there's no way they'd ever be able to make use of it against another player", "start": 106.06, "duration": 4.96}, {"text": "Pandas used most of their evolution points on their special ability 'pseudo-thumb' a bony like appendage that allows them to better", "start": 111.72, "duration": 5.939}, {"text": "Hold on to bamboo. The rest of their evolution points, I assume, were spent on their ridiculous palette swap", "start": 117.659, "duration": 5.25}, {"text": "This is the only bear could even consider being below average", "start": 123.459, "duration": 2.69}, {"text": "We have to jump all the way up to C tier before we get to the next lowest bear", "start": 126.42, "duration": 3.22}, {"text": "Next on the tier list we have the Sloth Bear and the Sun Bear", "start": 130.22, "duration": 2.78}, {"text": "These bears use another specialist type build, this time focusing on insects", "start": 133.56, "duration": 4.22}, {"text": "Now sloth bears and Sun bears are miles ahead of the Panda in viability", "start": 137.9, "duration": 3.98}, {"text": "Insects, especially beehives are a great source of xp, assuming you can tank the damage from the stings", "start": 142.32, "duration": 4.82}, {"text": "Not only that, but unlike bamboo, insects are pretty much everywhere", "start": 147.78, "duration": 3.58}, {"text": "So habitat loss due to a human builder player doesn't pose as big a problem to them as it does for pandas", "start": 151.4, "duration": 5.24}, {"text": "What keeps them down is that although they're great at tearing into well-fortified ant and bee bases. They're actually not very good at defending themselves", "start": 156.98, "duration": 7.06}, {"text": "They have losing matchups against every other key player in their region", "start": 164.22, "duration": 3.32}, {"text": "Including pythons, leopards, doles, and tigers, and for that I have to place them in C tier", "start": 167.61, "duration": 5.029}, {"text": "The highest ranking specialist type bear on our list is the polar bear", "start": 172.89, "duration": 3.44}, {"text": "The polar bear is one of the biggest land predators in the entire game, but despite the ridiculously high power stat", "start": 176.52, "duration": 5.719}, {"text": "They have pretty bad matchups against the other popular Arctic classes", "start": 182.24, "duration": 3.06}, {"text": "I've actually done an entire video on the Arctic meta which you can watch here, but the long and short of it", "start": 185.36, "duration": 4.46}, {"text": "Is that their immense strength doesn't really come in handy that much", "start": 189.83, "duration": 2.65}, {"text": "Since their best strategy to score elims on seals is to catch them off guard when they come up to recharge their stamina gauge", "start": 192.74, "duration": 5.44}, {"text": "They don't have the mobility to chase seals down in the water nor do they have the strength to defeat walruses on land", "start": 198.6, "duration": 5.08}, {"text": "So in my opinion, there's far too much luck involved in the polar bear gameplay to write them any higher than B tier", "start": 204.3, "duration": 5.06}, {"text": "So that's all the specialist bears, now we're on to the generalist bears", "start": 209.46, "duration": 3.14}, {"text": "Generalist builds if done right will pretty much always outclassed their specialized counterparts", "start": 213.44, "duration": 4.46}, {"text": "Since they're much more prepared to cope with the rapid shifts of the meta like for example", "start": 218.16, "duration": 3.799}, {"text": "If human players need materials to build their forts, or if the ice starts to melt", "start": 221.959, "duration": 4.26}, {"text": "In addition these next builds differ from the others because they've got the Bear's signature move: 'hibernate'", "start": 226.95, "duration": 5.18}, {"text": "Hibernation is key to the success of the bear players", "start": 233.07, "duration": 2.599}, {"text": "because it allows them to completely skip the time of year that they're least suited to", "start": 235.88, "duration": 3.66}, {"text": "Now this does incur some difficulty on the player since if they fail to collect enough loot to get them through the winter", "start": 239.82, "duration": 5.3}, {"text": "Hibernation will actually drain their HP and possibly even lead to a game over", "start": 245.18, "duration": 3.88}, {"text": "But if the Bears' abilities are used correctly, this shouldn't be too big an issue", "start": 249.66, "duration": 3.559}, {"text": "The first of the generalist bears on our list is the brown bear", "start": 253.62, "duration": 2.809}, {"text": "Brown bears have one of the highest power stats in the game with their sheer force being outclassed only by bull, cattle, and elephant builds.", "start": 256.799, "duration": 6.86}, {"text": "They've also got fairly high mobility. Although it can't quite match that of the wolves or elk that they share a server with", "start": 264.09, "duration": 5.779}, {"text": "But both of these stats are put to good use because of the animals' high intelligence one of the highest among solitary builds", "start": 270.6, "duration": 6.41}, {"text": "This lets Bears use their strengths to successfully raid the treasure chests that human settlements control.", "start": 277.41, "duration": 5.0}, {"text": "Now unlike its more specialized counterparts", "start": 282.96, "duration": 2.45}, {"text": "It doesn't have the same venom resistances that would allow the Sun Bear and sloth bear to easily", "start": 285.41, "duration": 3.87}, {"text": "Take out the eusocial insect players, so it's certainly not invincible by any stretch", "start": 289.48, "duration": 3.92}, {"text": "But it can make up for these inconsistencies by doing what it does best: Griefing salmon mains", "start": 294.06, "duration": 5.42}, {"text": "The salmon questlines final objective is to return to their spawn point and unfortunately", "start": 299.72, "duration": 4.68}, {"text": "This exploit is pretty common knowledge among the bear subreddits and whatnot", "start": 304.4, "duration": 3.329}, {"text": "Brown bears have almost as good a matchup against fish as Ospreys do, it's really unfair honestly", "start": 307.92, "duration": 5.48}, {"text": "There are a few varieties of brown bear of which the grizzly is actually the weakest.", "start": 313.58, "duration": 4.3}, {"text": "Sitting at the high end of A tier the strongest variety of brown bear, the Kodiak bear", "start": 318.06, "duration": 4.66}, {"text": "Can just barely sneak its way into S tier along with the last bear on our list:", "start": 322.92, "duration": 4.36}, {"text": "The black bear. Black bears are true champions of adaptability", "start": 327.36, "duration": 3.78}, {"text": "when the anthropocene patch dropped", "start": 331.74, "duration": 2.0}, {"text": "Every other North American bear actually quit the server, including one of the Ice Age Metas' top tiers: the cave bear", "start": 333.75, "duration": 5.839}, {"text": "Cave bears and the florida spectacled bear were both specialists that were unable to adapt to the new meta", "start": 339.93, "duration": 5.6}, {"text": "But the black bear player base has flourished.", "start": 345.53, "duration": 2.33}, {"text": "This is thanks to having slightly scaled back versions of all the brown bears abilities plus extremely high arboreal mobility", "start": 348.12, "duration": 6.68}, {"text": "This allows them to get access to valuable loot sources such as tree nuts, beehives, and bird's nests", "start": 355.139, "duration": 5.51}, {"text": "So yeah", "start": 360.74, "duration": 0.76}, {"text": "Jim is kinda right when he says the classic line 'false black bear' skills are essential for any effective character", "start": 361.5, "duration": 6.92}, {"text": "But instead of spending millions of years saving up the evolution points necessary to get them, you can unlock skills right now by using Skillshare", "start": 368.42, "duration": 6.8}, {"text": "Skillshare is an online learning community with over 20,000 classes in design, business, technology, and more", "start": 375.87, "duration": 5.63}, {"text": "Premium membership gives you unlimited access to high-quality", "start": 382.08, "duration": 2.209}, {"text": "Courses on must know topics so you can improve your skills unlock new opportunities and do the work you love", "start": 384.539, "duration": 4.67}, {"text": "My favourite course of theirs Is their one on motion graphics, which is taught by Kurt's Cassatt", "start": 389.849, "duration": 4.13}, {"text": "Join, the millions of students already learning on Skillshare today with the special offer. That's just for my subscribers", "start": 394.72, "duration": 4.94}, {"text": "You can try a skill share for free for two months by using the link in the description", "start": 399.98, "duration": 3.92}, {"text": "Thank you so much for watching", "start": 404.09, "duration": 1.1}, {"text": "And if you've got an idea for a build that you'd like me to cover", "start": 405.19, "duration": 2.55}, {"text": "please leave your suggestions in the comments below.", "start": 407.74, "duration": 2.429}, {"text": "and Special thanks to my patrons on patreon if you'd like to see more from me my patreon and social media are in the description", "start": 410.32, "duration": 5.78}]