[{"text": "Massachusetts General Hospital, 1845.", "start": 0.489, "duration": 1.981}, {"text": "A group of the most distinguished doctors in Boston gather to see something incredible.", "start": 2.47, "duration": 5.029}, {"text": "Dentist Horace Wells has claimed to have performed several tooth extractions using nitrous oxide as an anesthetic.", "start": 7.809, "duration": 5.99}, {"text": "He promises a pain-free procedure and end to the agony of dental surgery. Wells is confident, cool,", "start": 13.799, "duration": 6.66}, {"text": "He's done this before.", "start": 20.68, "duration": 1.41}, {"text": "He gasses the volunteer a colleague with a bag of nitrous oxide and fixes his dental key around the man's rotten tooth.", "start": 22.09, "duration": 6.439}, {"text": "He pulls. The man screams then yelling that Wells is a fraud.", "start": 28.72, "duration": 4.64}, {"text": "He leaps up and dashes for the confused dentist to assistance. [They] try to hold the furious man back,", "start": 33.36, "duration": 5.309}, {"text": "but they fail, and he chases Wells across the stage. The audience in turn furious at this apparent hoax turns on wells as well.", "start": 38.67, "duration": 7.65}, {"text": "\"Throw him out!\" They shout this is a university, not a circus! thus began the greatest revolution in dentistry and", "start": 46.75, "duration": 7.699}, {"text": "aesthetics.", "start": 55.0, "duration": 2.0}, {"text": "This episode is sponsored by child and teen checkups program of Minnesota. As a parent, of course, you're worried about your child,", "start": 62.17, "duration": 6.59}, {"text": "So you should visit your nearest clinic for a wellness check free for infants through young adults.", "start": 68.76, "duration": 4.259}, {"text": "And you'll be happy knowing your child is healthy. Learn more at the links below", "start": 73.02, "duration": 3.69}, {"text": "When we last left off the air for chard had revolutionized the practice of dentistry with his textbook, the surgeon dentist. Giving dentistry a", "start": 77.47, "duration": 7.369}, {"text": "scientific basis and spreading knowledge that early dentists often concealed as trade secrets, and", "start": 85.09, "duration": 4.79}, {"text": "Following fauchard, more books expanded the information available on dentistry. Making France the leading nation in oral care.", "start": 90.369, "duration": 6.05}, {"text": "In fact, the word dentist itself is a French one, a legacy from this time period by the 18th century.", "start": 96.42, "duration": 5.909}, {"text": "Dentists had developed new tools such as the dental key, which pulled teeth without damaging gums.", "start": 102.88, "duration": 5.3}, {"text": "Like the old pliers did, and French dentists even started pioneering braces that gradually moved teeth into more optimal position.", "start": 108.18, "duration": 7.049}, {"text": "They also improved dentures, crafting full mouth sets from ivory, carved horse teeth,", "start": 115.329, "duration": 4.85}, {"text": "porcelain, and even human teeth.", "start": 120.49, "duration": 2.209}, {"text": "Though denture makers often did advise these teeth is coming from dead soldiers,", "start": 122.95, "duration": 4.16}, {"text": "A lot of them actually came from buying them off the poor or enslaved or in many cases from grave robbers. Yeah,", "start": 127.11, "duration": 6.599}, {"text": "You know what?", "start": 134.409, "duration": 0.8}, {"text": "I'm just gonna pretend they were bought at cost from the tooth fairy.", "start": 135.209, "duration": 2.729}, {"text": "The Scottish surgeon John Hunter, father of scientific surgery even experimented with transplanting teeth from living donors, though", "start": 138.22, "duration": 6.949}, {"text": "none lasted more than a year. See, the recipients gums at first grew into the gaps of the dead donated tooth", "start": 145.17, "duration": 5.399}, {"text": "But because it didn't have a root, it easily tore and dang it Rob we talked about this last time man!", "start": 150.64, "duration": 6.259}, {"text": "Ease up on the gross stuff! Okay? We already talked about corpse teeth..", "start": 156.9, "duration": 3.14}, {"text": "(Ahem), but though technology was improving dentures were often uncomfortable and ill-fitting, making it difficult to eat or even talk", "start": 160.66, "duration": 4.82}, {"text": "making it difficult to eat or even talk.", "start": 165.48, "duration": 2.0}, {"text": "Most were held in the mouth by springs, with a", "start": 168.36, "duration": 2.34}, {"text": "tendency to leap out if the wearer opened their mouth too wide. and if they broke they'd fill the patient's mouth with shrapnel, in fact", "start": 170.769, "duration": 7.07}, {"text": "George Washington who only had one tooth by the time he became president, by the way,", "start": 177.94, "duration": 4.28}, {"text": "was so pained by his dentures, that he rarely ate or even spoke at state dinners.", "start": 182.22, "duration": 5.52}, {"text": "Yeah, that portrait on the one dollar bill, That's a man trying to deal with severe oral discomfort. In truth,", "start": 187.82, "duration": 6.04}, {"text": "Many of these dentures were more aesthetic than practical. The beginning of cosmetic dentistry.", "start": 193.88, "duration": 4.84}, {"text": "Because this dental revolution was especially fed by life at the French royal court, where appearances were extremely important to gaining and maintaining", "start": 199.36, "duration": 7.86}, {"text": "power.", "start": 207.909, "duration": 1.14}, {"text": "Cosmetic dentistry was a service for the rich,", "start": 209.049, "duration": 2.059}, {"text": "Increasingly served by consumer products like tooth cleaning powders, brushes, and whitening solutions. Many that did more harm than good.", "start": 211.419, "duration": 6.92}, {"text": "In addition, new artistic movements placed more emphasis on the mouth. and began to consider the open mouth smile,", "start": 218.62, "duration": 5.389}, {"text": "showing teeth as a symbol of beauty, health, and happiness.", "start": 224.169, "duration": 3.02}, {"text": "Apparently, people in Europe didn't use to smile with their mouths open.", "start": 227.859, "duration": 2.839}, {"text": "Everyone was just Mona lisa, saying it pretty hard.", "start": 231.069, "duration": 2.449}, {"text": "but all these new advances in dentistry did come along at just the right time, because", "start": 233.68, "duration": 4.429}, {"text": "Europeans had just discovered something.", "start": 238.389, "duration": 1.85}, {"text": "They really really liked sugar in all its forms,", "start": 240.239, "duration": 3.69}, {"text": "Refined sugar in the newly popular drinks tea and coffee plus molasses and pastries.", "start": 244.419, "duration": 4.34}, {"text": "Europeans went nuts for all that stuff, and it had serious consequences for people's oral health. Tooth decay,", "start": 249.22, "duration": 6.47}, {"text": "already a serious problem due to their love of sucrose (Sugar.) filled bread products went into overdrive.", "start": 256.0, "duration": 4.579}, {"text": "But the glory days of French dentistry were coming to an end. With the revolution sweeping the country,", "start": 260.859, "duration": 5.15}, {"text": "association with the royal court did them no favors, and as a result the center of the profession was about to move to", "start": 266.86, "duration": 6.589}, {"text": "America in the mid 19th century. trade started to professionalize jobs,", "start": 273.639, "duration": 4.52}, {"text": "like dentistry were no longer something that silversmiths could just do on the side, or learn through an apprenticeship. And it had to be", "start": 278.16, "duration": 6.419}, {"text": "regulated and connected to a degree and in", "start": 284.77, "duration": 2.36}, {"text": "1839. The cause of professional dentistry got a big boost when the world's first College of Dentistry opened in Baltimore, along with its first", "start": 287.47, "duration": 7.79}, {"text": "scientific journal. and professional organization 20 years later. American oral health professionals formed the American Dental Association (ADA)", "start": 295.36, "duration": 7.01}, {"text": "Solidifying dentistry as an independent medical field. British dentists by contrast became a subset of surgeons,", "start": 303.07, "duration": 6.229}, {"text": "but whether", "start": 309.46, "duration": 1.05}, {"text": "independent or part of the surgeons trade, the 19th century is when dentist's offices and tools began to look like what we'd recognized today. The", "start": 310.51, "duration": 7.429}, {"text": "office itself previously just like, an office. Increasingly took on the sterile appearance of a laboratory,", "start": 317.94, "duration": 5.609}, {"text": "With hard surfaces that were easy to clean and later disinfect.", "start": 323.8, "duration": 3.559}, {"text": "Adjustable dentist chairs replaced the leather lounges the French dentist had used, and also dental assistants", "start": 327.789, "duration": 5.36}, {"text": "Mostly young women became a part of nearly every practice, adding two extra hands that made more operations possible.", "start": 333.22, "duration": 5.869}, {"text": "Vulcanized rubber made it easy to mold dentures and bridges to fit the patient's mouth,", "start": 339.789, "duration": 3.74}, {"text": "Eliminating the dangerous and uncomfortable springs. and while pedal operated dentistry drills had existed since the late 1700s,", "start": 343.93, "duration": 6.38}, {"text": "The electric drill made fillings far more efficient and extractions less necessary. And okay,", "start": 350.38, "duration": 5.419}, {"text": "I know no one likes that drill, but it is definitely preferable to someone scraping out the rotten bits with a sharp spoon.", "start": 355.8, "duration": 6.33}, {"text": "Which is what they used to do.", "start": 362.2, "duration": 2.239}, {"text": "But the biggest advancement was....", "start": 365.05, "duration": 2.0}, {"text": "anesthetic. Finally delivering what dentist had promised for centuries a painless operation.", "start": 367.66, "duration": 4.729}, {"text": "Yet since you watched the opening of this episode,", "start": 373.09, "duration": 2.6}, {"text": "you can probably guess that some weird nonsense happened before that, and you would be right because the first", "start": 375.69, "duration": 6.389}, {"text": "Anesthetic used in dentistry was nitrous oxide. And before a medical tool, it was used for cheap entertainment.", "start": 382.21, "duration": 6.019}, {"text": "Everyone knew that nitrous oxide did some shall we say,", "start": 389.32, "duration": 3.139}, {"text": "strange things to the body in mind. in the 19th century traveling showmen,", "start": 393.16, "duration": 4.249}, {"text": "Mostly charlatans claiming to be doctors and giving pseudo-scientific lectures ,would go from city to city putting on", "start": 397.57, "duration": 5.839}, {"text": "\"Gas frolics\". Where they'd take members of the audience dose them with a bag of nitrous and just sort of see what happened.", "start": 403.6, "duration": 7.339}, {"text": "Sometimes they'd laugh or babble uncontrollably, while at other times", "start": 411.37, "duration": 3.349}, {"text": "they might lose all feeling and run around the stage vaulting into and off of furniture without registering pain.", "start": 414.72, "duration": 6.66}, {"text": "It was after one such display in", "start": 421.48, "duration": 2.269}, {"text": "1844 that a Boston dentist named Horace Wells (Same dude,)", "start": 424.21, "duration": 2.69}, {"text": "wondered whether the substance that would finally usher in pain free dentistry, had been under their noses or rather on their stages all along.", "start": 427.15, "duration": 7.489}, {"text": "He started to use nitrous oxide on patients during extractions and hey, it worked!", "start": 434.8, "duration": 5.329}, {"text": "Excited he set up a demonstration,", "start": 440.77, "duration": 1.95}, {"text": "Claiming he'd extract a tooth from his former student: William Morton, without pain.", "start": 442.72, "duration": 3.92}, {"text": "And well you saw how that went. See, Wells was worried about accidentally overdosing Morton and killing him on stage.", "start": 446.64, "duration": 6.69}, {"text": "So he went a little light with the gas. Wells career was over.", "start": 453.52, "duration": 3.44}, {"text": "Victim of the difficulty in finding a proper nitrous dosage which would eventually preclude it from use as an anesthetic.", "start": 457.21, "duration": 5.779}, {"text": "He'd died in a prison as a destitute chloroform addict.", "start": 463.0, "duration": 3.08}, {"text": "Morton, on the other hand, would help discover and", "start": 466.48, "duration": 2.54}, {"text": "Pioneer the use of ether rags as an alternative. Though to be honest,", "start": 469.12, "duration": 3.47}, {"text": "his ending was no better. After the world had hailed his great humanitarian innovation, Morton tried to patent it and get rich.", "start": 472.59, "duration": 6.959}, {"text": "Instead he too ended in poverty and mired in litigation.", "start": 479.95, "duration": 3.589}, {"text": "Oh, and you know what? On that subject, the guy who created the vulcanized rubber dentures?", "start": 483.54, "duration": 4.47}, {"text": "He sued everyone - but that ended real quick. When one of the guys he was suing shot him. Lesson:", "start": 488.01, "duration": 6.149}, {"text": "Don't do something nice for medical science, then sue everybody. And then we have, oh boy. Nope. You know what?", "start": 494.16, "duration": 6.839}, {"text": "I'm just gonna skip this part about dentistry's short love affair with cocaine as an injectable anesthetic, thank you very much.", "start": 501.0, "duration": 5.55}, {"text": "But as dark as its beginning was the anesthetics revolution essentially created modern dentistry.", "start": 506.76, "duration": 5.489}, {"text": "Anesthetic made more extensive operations possible from tooth implants, to root canals, to wisdom teeth removal. And it also inadvertently", "start": 512.86, "duration": 6.77}, {"text": "Increased people's regular check-ups, because once the pain of dental operations was largely gone,", "start": 519.94, "duration": 4.58}, {"text": "Patients were a lot less hesitant to visit their dentist for a cleaning and assessment. And listen,", "start": 524.86, "duration": 5.0}, {"text": "I could go on and on about all of the technological achievements dentists experienced during the 20th century, how x-rays", "start": 529.86, "duration": 6.42}, {"text": "revolutionized how we identify and treat problems. How fluoride has improved oral health, and how floss works", "start": 536.53, "duration": 5.419}, {"text": "so much better than the wooden toothpicks people used before. But you know all that that's the world we all live in now and ideally,", "start": 542.02, "duration": 6.71}, {"text": "Visit twice a year and on that note. I'll say it again.", "start": 548.92, "duration": 2.899}, {"text": "Please go visit your dentist at least twice a year, if you're able, because as brutal as those ancient dentists were in last week's episode;", "start": 552.16, "duration": 6.409}, {"text": "they did realize something that many dentists forgot about until recently. Your oral health is part of your total health.", "start": 558.85, "duration": 6.709}, {"text": "It's all one system. tooth obsesses left untreated can lead to brain infections, and", "start": 565.66, "duration": 5.119}, {"text": "People with poor oral health are more at risk for heart attack because infections can travel via the bloodstream.", "start": 570.91, "duration": 5.419}, {"text": "During World War one, soldiers actually died from lack of dental care.", "start": 576.76, "duration": 3.859}, {"text": "Going to the dentist today is more comfortable and less", "start": 580.99, "duration": 2.6}, {"text": "painful than any other time in history. And look, we do know it can be expensive and sometimes isn't covered by insurance.", "start": 583.78, "duration": 6.169}, {"text": "One possible workaround is trying to find the nearest dental college.", "start": 590.31, "duration": 3.51}, {"text": "Aspiring dental hygienists always need practice, and most offer free cleanings. Not to mention,", "start": 594.1, "duration": 5.179}, {"text": "there are also programs that provide free services. And,", "start": 599.28, "duration": 3.209}, {"text": "speaking of which,", "start": 603.37, "duration": 1.95}, {"text": "Once again, thanks so much to child and teen checkups program of Minnesota for sponsoring this series. As a parent,", "start": 605.32, "duration": 6.169}, {"text": "I imagine you're always a little worried about your child. Are they healthy? Are you missing anything?", "start": 611.49, "duration": 4.2}, {"text": "But that's why there's free child and teen checkups.", "start": 615.76, "duration": 2.809}, {"text": "Just bring your child to your clinic for a free wellness check, whether they're a new infant or 20 years young almost adult. Or any", "start": 618.73, "duration": 6.77}, {"text": "age in between your doctor will check hearing, vision, teeth. That's a big one. And offer wellness information for your child's age.", "start": 625.5, "duration": 7.2}, {"text": "So you can be happy knowing your child's healthy and best of all, it's all completely free. Learn more at the links below.", "start": 632.82, "duration": 6.84}]