[{"text": "Thanks to Brilliant for sponsoring this video\nand for offering my subscribers 20% off their", "start": 0.16, "duration": 4.76}, {"text": "annual Premium subscriptions.", "start": 4.92, "duration": 2.02}, {"text": "When I worked at OPPO, I remember very clearly that the most burning question people on the OPPO forums had,", "start": 6.94, "duration": 4.82}, {"text": "which is what I managed, was how quickly Android updates would come to different phones.", "start": 11.76, "duration": 4.86}, {"text": "Like, when is this phone getting KitKat, when is that phone getting Lollipop, this sort of stuff.", "start": 16.62, "duration": 4.08}, {"text": "It would make or break kind of question for most forum users.", "start": 20.78, "duration": 3.98}, {"text": "And I also remember just how baffled OPPO software teams were by this approach.", "start": 24.76, "duration": 4.5}, {"text": "According to them, users should care about features, stability and performance, not Android versions.", "start": 29.26, "duration": 5.52}, {"text": "And while I think back then, 3-4-5 years ago, this might not have been entirely true,", "start": 34.9, "duration": 5.2}, {"text": "Google has certainly started worked towards making this true.", "start": 40.1, "duration": 3.38}, {"text": "So today, Android version, while not entirely\nirrelevant, are just not very important anymore.", "start": 43.48, "duration": 5.46}, {"text": "So in 50th episode of The Story Behind series, let's talk about why.", "start": 48.94, "duration": 3.98}, {"text": "Real quick before we start, if you want to\nsee more in-depth analysis of tech companies,", "start": 58.62, "duration": 3.7}, {"text": "especially from a business perspective, consider\nsubscribing to TechAltar.", "start": 62.32, "duration": 3.82}, {"text": "At this year's big Google developer conference,", "start": 66.14, "duration": 1.9}, {"text": "the company announced a hugely important change\nto Android, called Project Mainline that you", "start": 68.04, "duration": 4.47}, {"text": "have probably never heard about. The project\nmakes Android more modular, so these twelve", "start": 72.51, "duration": 4.92}, {"text": "critical parts of the operating system can\nbe updated separately from big Android updates.", "start": 77.43, "duration": 4.77}, {"text": "Unless you are a developer, none of these\nwill seem meaningful to you, but they are", "start": 82.2, "duration": 3.77}, {"text": "all lower level features that influence critical\nthings like security and app compatibility.", "start": 85.97, "duration": 5.41}, {"text": "With Mainline Google can use the Google Play Infrastructure", "start": 91.38, "duration": 2.96}, {"text": "to now update critically important components of\nAndroid directly, while the phone is running,", "start": 94.34, "duration": 5.04}, {"text": "without the user having to press a download\nbutton or reboot a device, and most importantly,", "start": 99.38, "duration": 5.14}, {"text": "without having to convince device makers and\nmobile carriers to do anything. Which never", "start": 104.52, "duration": 4.98}, {"text": "seemed to work well in the past.", "start": 109.5, "duration": 2.35}, {"text": "And Mainline is just the latest of many similar", "start": 111.85, "duration": 2.17}, {"text": "steps Google has taken over the last few years. In\nfact, the Play Store is used to deliver other", "start": 114.02, "duration": 5.2}, {"text": "critical updates too, through Google Play\nProtect since 2017 and Verify Apps before that,", "start": 119.22, "duration": 6.16}, {"text": "which scan apps you install on your phone,", "start": 125.38, "duration": 2.42}, {"text": "even the ones from outside of the Play Store\nto make sure they don't contain any malware.", "start": 127.8, "duration": 4.3}, {"text": "These solutions get updated through the Play\nStore again, in the background without needing", "start": 132.1, "duration": 4.24}, {"text": "an Android version update,", "start": 136.34, "duration": 1.44}, {"text": "and indeed, Google claims that the number\nof potentially harmful apps are at an all", "start": 137.82, "duration": 3.98}, {"text": "time low across its ecosystem, even for phones\nthat download apps from outside of the Play Store.", "start": 141.8, "duration": 5.4}, {"text": "Operating system level security patches aren't\nquite as automatic yet, they do still require", "start": 147.36, "duration": 5.08}, {"text": "input from manufacturers, but have been made\nmuch easier since the Android Security Bulletin", "start": 152.44, "duration": 4.58}, {"text": "was introduced in 2015. This created a system\nwhere security patches are clearly separated", "start": 157.02, "duration": 5.5}, {"text": "from Android Version updates and can be verified\nindividually right from the settings app of", "start": 162.53, "duration": 4.93}, {"text": "any Android phone. So security is nearly completely\ndecoupled from Android versions.", "start": 167.46, "duration": 5.4}, {"text": "And for a lot of the stuff developers need\nto make sure their apps run well, like APIs", "start": 172.86, "duration": 4.54}, {"text": "and programming languages, Google has made\nwork-arounds,", "start": 177.4, "duration": 2.34}, {"text": "with projects like Jetpack and AndroidX. I\ndon't want to get too technical here, in no", "start": 179.74, "duration": 5.4}, {"text": "small part because I am not an Android developer myself,", "start": 185.14, "duration": 3.02}, {"text": "but imagine you write an app that has to talk to the operating system to access the camera,", "start": 188.16, "duration": 3.82}, {"text": "or to get the user's location or name or something.", "start": 191.98, "duration": 3.24}, {"text": "On each Android version, those commands might\nbe slightly different, which would be a nightmare.", "start": 195.22, "duration": 5.34}, {"text": "But over time, Google has built tools like", "start": 200.66, "duration": 2.14}, {"text": "Jetpack to avoid this, so developers can write\nan app once, even in Kotlin, the fancy new", "start": 202.82, "duration": 5.29}, {"text": "programming language of choice for Android\ndevelopers, and the Jetpack tools will make", "start": 208.11, "duration": 3.89}, {"text": "sure that the app will work across Android versions.", "start": 212.0, "duration": 2.96}, {"text": "And so if security and developer tools are not directly tied to Android versions,", "start": 214.96, "duration": 4.58}, {"text": "then the only potential upside would be\nfeatures, UI tweaks and performance.", "start": 219.54, "duration": 4.16}, {"text": "You know, the stuff that you as a user should be able to see yourself.", "start": 223.7, "duration": 3.66}, {"text": "And while Google likes to tout new performance\nimprovements with each version, real-world", "start": 227.36, "duration": 4.5}, {"text": "tests like this one from Gary Sims that compare\nperformance on the same device running 4 different", "start": 231.87, "duration": 5.339}, {"text": "versions of Android, prove that the improvements\nare close to non-existent.", "start": 237.209, "duration": 3.831}, {"text": "My anecdotal evidence from my own updates\nand those around me that I see also seems", "start": 241.14, "duration": 5.459}, {"text": "to imply that battery life, performance and\nstability rarely ever get significantly better", "start": 246.599, "duration": 4.711}, {"text": "with new Android version updates. If anything,\nmanufacturers tend to spend less time optimizing", "start": 251.31, "duration": 5.28}, {"text": "updates that come out later than the software\nthat ships on their new phones that is used", "start": 256.59, "duration": 4.65}, {"text": "to convince you to make a purchase.", "start": 261.24, "duration": 2.36}, {"text": "And while as a smartphone enthusiast, I obviously love\ngetting new features, it has also become pretty clear", "start": 263.6, "duration": 5.12}, {"text": "to me over time that Android is a mature operating system and therefore, all the new features", "start": 268.72, "duration": 4.88}, {"text": "that we are getting, they are just nice little tweaks, not really groundbreaking stuff that we have to have.", "start": 273.6, "duration": 5.46}, {"text": "One could even argue that features and UI\nare more influenced by some heavily customized", "start": 279.08, "duration": 5.8}, {"text": "skins of manufacturers like Samsung, LG and Huawei than they are by the underlying Android versions.", "start": 284.88, "duration": 5.74}, {"text": "And Google themselves are increasingly packing", "start": 290.62, "duration": 2.0}, {"text": "much of their innovation into their apps like\nGoogle Photos instead of into the system itself.", "start": 292.62, "duration": 5.56}, {"text": "And there is a whole ethical question of whether or not it is good of Google to put their resources and efforts", "start": 298.18, "duration": 5.1}, {"text": "into improving their own walled gardens like Google Photos instead of putting their efforts into improving", "start": 303.28, "duration": 5.18}, {"text": "the open source operating system that is Android itself,", "start": 308.46, "duration": 2.98}, {"text": "but you know, that is a discussion for other video, and\neither way the result is that feature updates", "start": 312.26, "duration": 5.5}, {"text": "on Android just don't feel all that important anymore.", "start": 317.76, "duration": 2.82}, {"text": "So with most of the security and compatibility\naspects being separated from the underlying", "start": 320.58, "duration": 4.8}, {"text": "Android versions, with tools like Jetpack\nenabling more and more developers to write", "start": 325.38, "duration": 4.12}, {"text": "apps that work across versions, and by putting\nmost of their must-have features into apps,", "start": 329.5, "duration": 4.61}, {"text": "not the operating system itself, Google\nhas achieved something remarkable.", "start": 334.11, "duration": 3.91}, {"text": "They have kind of put an end to the constant struggle\nthat has been Android version upgrades as", "start": 338.08, "duration": 4.82}, {"text": "they have found ways to make them basically\nirrelevant. They are still nice to have, but not crucial.", "start": 342.92, "duration": 6.32}, {"text": "To be clear, I am not saying that you, the smartphone enthusiast should stop caring about Android updates.", "start": 349.24, "duration": 4.82}, {"text": "If there is a new feature or a new tweak that you really want to have from the new Android update,", "start": 354.06, "duration": 4.98}, {"text": "then yeah, wanting that that is perfectly reasonable.", "start": 359.04, "duration": 2.48}, {"text": "And I also think that we should continue to keep phone manufacturers to high standards.", "start": 361.52, "duration": 3.94}, {"text": "After all, we gave them money and we should be allowed to expect good software support in exchange.", "start": 365.46, "duration": 5.02}, {"text": "But I do think we should get a little smarter with our demands.", "start": 370.5, "duration": 3.82}, {"text": "Instead of just yelling \"Where is Android\nQ or Android Pie for my device\", we should", "start": 374.48, "duration": 4.48}, {"text": "focus first and foremost on security patches\nand Android versions shouldn't be the only", "start": 378.96, "duration": 4.68}, {"text": "metric by which we judge devices.", "start": 383.64, "duration": 2.16}, {"text": "So if someone likes Samsung's new One UI,\nXiaomi's MIUI or any other custom skin for", "start": 385.8, "duration": 6.1}, {"text": "either the features or the look and feel,", "start": 391.9, "duration": 2.08}, {"text": "or if they are OK with phones like those of LG being slow with Android updates", "start": 393.98, "duration": 4.12}, {"text": "in exchange for a lower price, we should see those as", "start": 398.1, "duration": 2.78}, {"text": "reasonable as long as security patches keep\ncoming. And thankfully most manufacturers", "start": 400.889, "duration": 4.771}, {"text": "seem to have improved in that regard over time.", "start": 405.66, "duration": 3.34}, {"text": "The best thing you can do for yourself on\nyour Android, or even iOS phone is learning", "start": 409.0, "duration": 3.94}, {"text": "something new. With Brilliant's app, you get\ninteractive courses that let you solve fascinating", "start": 412.94, "duration": 4.68}, {"text": "problems in math, science, and computer science\nfrom anywhere. What's awesome about", "start": 417.62, "duration": 4.72}, {"text": "these courses is that they're all totally\ninteractive.", "start": 422.34, "duration": 2.74}, {"text": "You will experiment with pendulum clocks to\nmaster the physics of motion, use rockets", "start": 425.34, "duration": 4.84}, {"text": "to model algebraic functions, and learn probability\nby playing blackjack. There are new challenges", "start": 430.18, "duration": 5.68}, {"text": "for you to tackle every day, and if you are\non iOS you can even download courses and solve", "start": 435.86, "duration": 5.02}, {"text": "them when you are offline. This is apparently coming to Android soon as well.", "start": 440.88, "duration": 4.24}, {"text": "So if you want to support TechAltar and get", "start": 445.12, "duration": 2.42}, {"text": "unlimited access to all of Brilliant's in-depth\nmath and science courses, you can head over", "start": 447.54, "duration": 4.69}, {"text": "to brilliant.org/techaltar/ to get 20% off\nyour annual Premium subscription.", "start": 452.23, "duration": 5.19}]