[{"text": "Today's video is sponsored by Raid Shadow Legends", "start": 0.06, "duration": 3.96}, {"text": "In today's video, we're going to explore whether or not you can turn pure soda into cotton candy", "start": 4.02, "duration": 3.75}, {"text": "Guys we've done some cool experiments making cotton candy and not too long ago", "start": 17.17, "duration": 4.1}, {"text": "We had one where we tested a bunch of different things that you guys wanted to see and in the response", "start": 21.27, "duration": 5.039}, {"text": "Comments to that video. I saw a lot of people saying they wanted to see us try to do this with soda", "start": 26.529, "duration": 6.08}, {"text": "they suggested we try and use the Mexican coke that is known for having cane sugar in it as opposed to high-fructose corn syrup and", "start": 32.739, "duration": 6.83}, {"text": "I started trying to think about whether or not this is something we can do in the past", "start": 39.879, "duration": 3.53}, {"text": "We have dehydrated soda and freeze-dried soda comparing what happens with high fructose corn syrup", "start": 43.41, "duration": 5.89}, {"text": "Versus real sugar in both of those cases with the freeze drying and the dehydrating we got sort of a thick syrup", "start": 49.36, "duration": 6.589}, {"text": "We didn't get anything that really looked like a hard candy or a dry powder, which is the kind of thing", "start": 56.64, "duration": 5.969}, {"text": "We would normally want to put into the cotton candy machine if it has any moisture in it", "start": 62.609, "duration": 3.84}, {"text": "It's not going to melt down and then form those thin strands that make up cotton candy", "start": 66.45, "duration": 4.709}, {"text": "It would just sort of", "start": 71.159, "duration": 0.851}, {"text": "Sludge out the sides or get sprayed in an arc around the dish and that's not what we wanted", "start": 72.01, "duration": 5.059}, {"text": "and at first I was trying to think about if there was anything we could do and we could freeze dry it multiple times or", "start": 77.07, "duration": 6.18}, {"text": "Dehydrated it over and over", "start": 83.53, "duration": 1.65}, {"text": "And I was thinking that it wasn't gonna work because we tried both of those and they just it doesn't go anywhere", "start": 85.18, "duration": 5.059}, {"text": "However, I did eventually remember that about a year and a half ago", "start": 90.4, "duration": 3.5}, {"text": "I did some experiments with trying to make hard candy out of soda", "start": 93.9, "duration": 3.779}, {"text": "if you've seen our thumbsucker video grant and I took molds of our thumbs and then", "start": 97.68, "duration": 4.559}, {"text": "we", "start": 102.43, "duration": 0.57}, {"text": "made hard candy just with sugar corn syrup and flavoring and report it into those molds adding lollipop stick giving us a lollipop in the", "start": 103.0, "duration": 7.339}, {"text": "Shape of our thumbs", "start": 110.34, "duration": 0.79}, {"text": "When I was prototyping that I did make hard candy out of soda just by heating it up on the stove until it reached", "start": 111.13, "duration": 5.51}, {"text": "What's known as the hard crack stage and then pouring it out and let it cool down?", "start": 116.64, "duration": 3.389}, {"text": "I thought maybe if I can get a hard candy out of it", "start": 120.03, "duration": 2.699}, {"text": "I could then take that hard candy break it up", "start": 122.729, "duration": 2.279}, {"text": "Put that in the cotton candy machine and try and make cotton candy from it. So today that's what we're going to do here", "start": 125.189, "duration": 5.76}, {"text": "I do have some what's his Mexican coke here in the US in Mexico. He was just known as coke", "start": 130.95, "duration": 5.12}, {"text": "It's just coca-cola that has sugar instead of high-fructose corn syrup. Other than that, it should be pretty much the same thing", "start": 136.34, "duration": 6.809}, {"text": "So here's the basic idea after several people requested it", "start": 143.15, "duration": 3.179}, {"text": "We tried to see if there is a way to turn soda into cotton candy", "start": 146.33, "duration": 3.389}, {"text": "We're gonna take you through the steps we tried and see what result we get", "start": 149.76, "duration": 3.319}, {"text": "We are going to try boiling this coke down until it heats up to the hard crack candy stage pouring it out", "start": 153.27, "duration": 6.649}, {"text": "Let it cool down into a hard candy then", "start": 159.92, "duration": 2.25}, {"text": "I'm going to try and break that up put it into our cotton candy machine and", "start": 162.17, "duration": 2.91}, {"text": "See if it will turn into actual Coca Cola flavored cotton candy or if it'll just burn and make a huge mess", "start": 165.21, "duration": 6.77}, {"text": "Along with that. We're gonna try a couple other things first", "start": 172.14, "duration": 2.96}, {"text": "We're going to see if it is possible to do this with", "start": 175.23, "duration": 3.259}, {"text": "Soda made with high fructose corn syrup in the United States at least that's by far more common", "start": 178.8, "duration": 4.19}, {"text": "It's easy to get your hands on", "start": 182.99, "duration": 1.36}, {"text": "Most things you're gonna get in a can or a two-liter bottle or going to have high fructose corn syrup in it", "start": 184.35, "duration": 4.55}, {"text": "And so as a precursor to that test", "start": 189.3, "duration": 2.569}, {"text": "We're actually just going to take pure corn syrup and try and heat that up to a hard crack stage and then we'll probably try", "start": 191.87, "duration": 5.279}, {"text": "It with some soda whether or not it works with the corn syrup just to cover all of our bases", "start": 197.15, "duration": 4.32}, {"text": "Now we've got everything set up here. I'm gonna go grab Callie and see if we can actually get this to work", "start": 201.99, "duration": 4.189}, {"text": "I've got the experiment set up for you ready to go", "start": 206.91, "duration": 2.389}, {"text": "Can't are you still playing raid shadow Legends?", "start": 210.12, "duration": 2.96}, {"text": "Yeah, that brand-new collection RPG game that's taking the mobile gaming world by storm", "start": 213.33, "duration": 4.639}, {"text": "Yeah, is that the one that like 10 million players have already downloaded in just three months?", "start": 218.22, "duration": 4.1}, {"text": "Yeah, it has great graphics and amazing storyline and 400 champions and I don't know why you're not playing with me right now", "start": 223.74, "duration": 7.159}, {"text": "Seriously, though. I mean the details on these champions are ridiculous. It seems like a really cool game", "start": 231.87, "duration": 5.059}, {"text": "It's got something for everyone. You can collect the characters. You can progress through the storyline. It's got incredible graphics", "start": 236.93, "duration": 5.37}, {"text": "I personally like the live player battles. That's my favorite part, but that could just be me guys", "start": 242.3, "duration": 5.099}, {"text": "This game is free-to-play. You can enjoy PvP battles in the arena in the dungeons. There's engaging in boss fights", "start": 247.4, "duration": 5.52}, {"text": "The game has a near-perfect score on the Playstore raid is growing super fast. There's a brand new update. That just went live", "start": 252.92, "duration": 6.6}, {"text": "there's a loyalty program for new users and there is a daily reward for the first 90 days that you", "start": 259.52, "duration": 6.299}, {"text": "Pretty much everyone. You should go ahead and click that link in the description down below", "start": 266.09, "duration": 4.04}, {"text": "You get fifty thousand silver when you start and a free epic champion as part of the new player program", "start": 270.97, "duration": 4.679}, {"text": "So yes, everyone should get the game. Are you ready for the experiment now?", "start": 275.65, "duration": 3.69}, {"text": "You know, I'm good you I you got this one", "start": 280.16, "duration": 3.109}, {"text": "Okay, can I maybe have my phone back?", "start": 283.94, "duration": 2.779}, {"text": "No, I drain my battery", "start": 287.66, "duration": 2.149}, {"text": "playing", "start": 290.539, "duration": 1.711}, {"text": "Playing rho2 legends. All right. Oh, I'll just get this", "start": 292.25, "duration": 3.709}, {"text": "All right, our coca-cola, we cooked it until it hit a hard crack stage poured it out", "start": 337.01, "duration": 4.17}, {"text": "Let it cool down some of it's still cooling down", "start": 341.18, "duration": 2.159}, {"text": "But I got these parts that have cooled down the most and it does break like a hard crack candy for the most part it", "start": 343.34, "duration": 5.94}, {"text": "might be a little bit softer than", "start": 349.28, "duration": 2.0}, {"text": "Some types of candy. Oh, there you go that warmed up a little bit some parts break some parts more or less", "start": 351.75, "duration": 6.05}, {"text": "So maybe that with soda?", "start": 357.8, "duration": 2.0}, {"text": "The actual hard crack stage is not quite the same as a sugar corn syrup water mixture", "start": 360.39, "duration": 5.479}, {"text": "But I am quite confident. We've removed all the moisture from this so I still want to try it", "start": 367.29, "duration": 3.829}, {"text": "I'm gonna put this in the machine and see if we can get coca-cola", "start": 371.12, "duration": 2.19}, {"text": "Cotton candy. I'm just gonna put a couple of pieces of this in here and see if we start getting anything", "start": 374.13, "duration": 4.489}, {"text": "whoa", "start": 379.38, "duration": 1.71}, {"text": "Instantly start getting stuff", "start": 381.09, "duration": 2.0}, {"text": "All right, I'm gonna try put more in at once because that just seems so scattered. I don't think it's elf together at all", "start": 383.25, "duration": 6.619}, {"text": "Oh, there we go", "start": 400.19, "duration": 3.209}, {"text": "Alright coca-cola", "start": 417.26, "duration": 1.62}, {"text": "Into cotton candy. Does it work? Well, we got some we definitely got some coca-cola cotton candy fluff", "start": 418.88, "duration": 6.47}, {"text": "it is not as fluffy as a regular cotton candy and", "start": 425.35, "duration": 3.27}, {"text": "I've discovered you really have to make sure", "start": 429.5, "duration": 2.45}, {"text": "You hit a hard crack stage if your candy is soft after you poured it out and let it cool down if it's still flexible", "start": 432.68, "duration": 6.44}, {"text": "It's not going to work. We actually had to take our coca-cola that we had already poured out. It was still too flexible", "start": 439.73, "duration": 5.69}, {"text": "So I had to put it back on the stove heat it back up", "start": 445.42, "duration": 2.1}, {"text": "And make sure it hit that hard crack stage and I actually just went by a tiny bit over", "start": 447.79, "duration": 4.32}, {"text": "to really make sure it would solidified down to where we needed it and", "start": 452.21, "duration": 3.649}, {"text": "It worked as for whether or not you would want to do this coca-cola has a lot of fairly bitter strong flavors in it", "start": 456.02, "duration": 6.529}, {"text": "Caffeine is a strong flavor. The caramel is a strong flavor", "start": 462.8, "duration": 2.809}, {"text": "The Cola flavor in general is pretty intense as well", "start": 465.61, "duration": 2.639}, {"text": "And when you do this, you kind of concentrate all those as well as adding like another", "start": 468.25, "duration": 4.23}, {"text": "bit of", "start": 473.0, "duration": 1.14}, {"text": "Boosted caramel flavor even slightly burned caramel flavor by getting it up to that high of a temperature. So", "start": 474.14, "duration": 5.179}, {"text": "If you really like the flavor of Coca Cola, then you might enjoy this stuff", "start": 479.84, "duration": 3.649}, {"text": "I'm not a huge fan and then how it sort of concentrates all those flavors", "start": 483.49, "duration": 3.69}, {"text": "It really gets it to a point where it I'm not really in love with this but it did work", "start": 487.18, "duration": 4.889}, {"text": "It does taste like Cola mixed with a little bit of burnt sugar", "start": 492.07, "duration": 3.779}, {"text": "I got a couple of their sugar based sodas and then we are also going to try the corn syrup and", "start": 495.85, "duration": 4.769}, {"text": "The corn syrup based soda as well and see if those also work", "start": 500.78, "duration": 3.799}, {"text": "Nice fluffy cotton candy though. I just can't put it incorrectly", "start": 512.529, "duration": 4.19}, {"text": "Oh", "start": 530.79, "duration": 2.0}, {"text": "Cotton candy and all parts of my face. So there you go. This is about how much cotton candy we got", "start": 534.16, "duration": 4.639}, {"text": "This was two", "start": 538.8, "duration": 1.21}, {"text": "Bottles of soda boiled down into a hard candy", "start": 540.01, "duration": 2.9}, {"text": "poured out", "start": 543.16, "duration": 0.9}, {"text": "allowed to cool then broken up into sort of a rough sugar and then put into the cotton candy machine and let's give this a", "start": 544.06, "duration": 5.78}, {"text": "test", "start": 549.84, "duration": 2.0}, {"text": "It tastes sort of like a strawberry cherry", "start": 553.27, "duration": 2.929}, {"text": "Cotton candy. All right", "start": 556.81, "duration": 1.46}, {"text": "This is the combination of our green apple and our berry flavored Jones soda", "start": 558.27, "duration": 6.45}, {"text": "You can see that like it broke into pieces, but then those pieces sort of started sticking together", "start": 564.76, "duration": 4.7}, {"text": "That might be a little unstable", "start": 572.23, "duration": 2.48}, {"text": "Seems like it's a lot maybe thicker strands and heavier", "start": 576.13, "duration": 3.799}, {"text": "And so it a lot of it just ends up on the bottom of a pan", "start": 580.42, "duration": 3.02}, {"text": "It doesn't float up into the air the same way traditional", "start": 583.44, "duration": 2.489}, {"text": "cotton candy does the green did not work as well as the pink it did create something, but it went on pretty", "start": 586.0, "duration": 6.739}, {"text": "sticky and thick and", "start": 593.74, "duration": 2.0}, {"text": "really not cotton like", "start": 596.02, "duration": 2.0}, {"text": "It's good though, it tastes like the combination of the sodas. This is some of our corn syrup sugar", "start": 602.08, "duration": 4.91}, {"text": "I just put pure corn syrup into the pot and heated it up until is that the hard crack stage?", "start": 607.38, "duration": 4.169}, {"text": "You can see that it is holding its shape pretty well", "start": 611.89, "duration": 2.69}, {"text": "That gives me some hope that this will actually work in the cotton candy machine. Let's give us a try", "start": 614.71, "duration": 4.669}, {"text": "Seeing a couple threads it might not be warmed up all the way yet. Oh now it's just throwing out globs", "start": 621.73, "duration": 7.219}, {"text": "This is like candy", "start": 629.65, "duration": 1.8}, {"text": "Saran wrap. Okay. All right. We got some cotton now", "start": 631.45, "duration": 3.619}, {"text": "All right, I'm gonna say it works, but it behaves differently", "start": 635.62, "duration": 2.959}, {"text": "from regular sugar", "start": 639.28, "duration": 2.0}, {"text": "So this is made of 100% corn syrup cooked up too hard crack stage", "start": 643.36, "duration": 5.059}, {"text": "for candy and then let cool and then put in the Machine this honestly looks like", "start": 648.82, "duration": 4.82}, {"text": "Fiberglass more than it looks like cotton. It's got like shards in there", "start": 654.94, "duration": 3.709}, {"text": "Just the way that looks honest-to-goodness that could be fiberglass, but it's made of corn syrup", "start": 658.72, "duration": 4.82}, {"text": "And it does not taste like cotton candy", "start": 668.93, "duration": 2.0}, {"text": "It's slightly sweet", "start": 674.309, "duration": 2.0}, {"text": "Has a much more fibery texture", "start": 676.41, "duration": 2.179}, {"text": "Just not nearly as much sugar flavor or flavor in general as a normal cotton candy", "start": 679.619, "duration": 6.2}, {"text": "Dissolves about the same sticks to your fingers about the same", "start": 687.629, "duration": 3.53}, {"text": "Honestly, I would call that", "start": 692.579, "duration": 1.68}, {"text": "Fiberglass candy more than cotton candy. Alright, this used to be orange Fanta", "start": 694.259, "duration": 5.059}, {"text": "now it is", "start": 699.959, "duration": 1.74}, {"text": "Orange Fanta sugar sort of we're gonna throw that in and see if it works. Oh", "start": 701.699, "duration": 4.34}, {"text": "Oh, that's actually working great", "start": 707.55, "duration": 2.599}, {"text": "Okay, that worked way better than I thought it was going to given what our corn syrup did when we tried to turn that into", "start": 718.72, "duration": 7.46}, {"text": "Cotton candy. I thought we'd get something similar because this uses high fructose corn syrup. What?", "start": 726.18, "duration": 4.289}, {"text": "This is this is a pretty good fluff right here", "start": 731.83, "duration": 2.959}, {"text": "there's not a ton of it and it is I think a little bit denser than normal cotton candy, but", "start": 734.79, "duration": 4.739}, {"text": "It it wish'd up quite nicely", "start": 741.22, "duration": 2.0}, {"text": "And you can definitely taste the orange way more like cotton candy", "start": 744.4, "duration": 3.35}, {"text": "Than fiberglass candy oddly dense though the way it sort of sticks together to itself", "start": 748.27, "duration": 4.159}, {"text": "Should you turn Coca Cola and other sodas into cotton candy it is possible", "start": 753.22, "duration": 4.429}, {"text": "If you cooked them to the point where they had a hard crack stage", "start": 757.65, "duration": 2.22}, {"text": "Turning into a hard candy and then break that up. You can make it work. The coke worked a little bit", "start": 760.42, "duration": 4.79}, {"text": "I actually think we had much better results with our red soda. That was actually a combination of a Jones soda", "start": 765.21, "duration": 5.129}, {"text": "That was red and a Fanta strawberry soda. So it's just sort of a combination of two sugar based red sodas", "start": 770.44, "duration": 7.01}, {"text": "That one worked pretty well, I was very interested in what happened with our corn syrup. We did get like a fluff", "start": 777.45, "duration": 5.76}, {"text": "That's more like fiberglass than cotton", "start": 783.21, "duration": 2.0}, {"text": "Very little flavor and then we got pretty good results with our corn syrup a soda", "start": 786.13, "duration": 3.89}, {"text": "that was an orange Fanta that worked pretty well a little bit more dense than regular cotton candy cotton candy with soda is", "start": 790.02, "duration": 6.209}, {"text": "Probably not your best bet you're not going to get as light and fluffy of an experience", "start": 796.3, "duration": 3.979}, {"text": "Unless you're using pure corn syrup. And then you lose out on all the flavor. Thanks again to our sponsor raid shadow legends", "start": 800.28, "duration": 5.31}, {"text": "Don't forget to click the link in the description to download the game get", "start": 805.59, "duration": 3.149}, {"text": "50,000 silver and a free epic champion as part of the new player program", "start": 809.23, "duration": 3.95}, {"text": "Guys, that's not all we've always got more for you to see check out the most recent video by clicking that box at the top", "start": 813.7, "duration": 4.549}, {"text": "And we will see you the next one doctor then", "start": 818.25, "duration": 2.0}]