[{"text": "I want to see if it's possible to eat healthy for one dollar a day for a full week", "start": 0.06, "duration": 4.47}, {"text": "I've shared my plans to do this with a few people and I always get the reaction", "start": 4.63, "duration": 3.649}, {"text": "Why so here's a very quick explanation and I'll go more in depth a little bit later on in this video", "start": 8.59, "duration": 4.759}, {"text": "There are a few reasons one. I'm very inspired by the resourcefulness of", "start": 13.349, "duration": 4.679}, {"text": "Mexicans and their creativity with such limited resources - it's a common stoic practice", "start": 18.64, "duration": 5.629}, {"text": "to experiment with less and to remind yourself how little you really needed to be happy in life and", "start": 24.46, "duration": 5.66}, {"text": "3 I've noticed a little bit of lifestyle creep. I seem to be spending more money every single month and", "start": 30.189, "duration": 6.049}, {"text": "that's a kind of alarming idea because", "start": 36.85, "duration": 2.209}, {"text": "The way I see things I'm not happier now than I was say six months ago and yet I'm spending more money", "start": 39.64, "duration": 5.389}, {"text": "So what's going on here? What does that say?", "start": 45.03, "duration": 2.0}, {"text": "I've seen a few videos that have a similar concept", "start": 47.41, "duration": 2.299}, {"text": "but what I always see is people going for freebies and trying to eat for free and", "start": 49.719, "duration": 4.46}, {"text": "For me that completely defeats the purpose like I am not accepting any freebies", "start": 54.82, "duration": 4.279}, {"text": "And I want to see what seven dollars can do", "start": 59.1, "duration": 3.24}, {"text": "So yeah this morning I went with my seven dollars to see what I could find. Let's do this thing", "start": 62.41, "duration": 4.549}, {"text": "Easy easy. I", "start": 72.15, "duration": 2.0}, {"text": "just did the", "start": 74.88, "duration": 2.0}, {"text": "Calculation for how much seven dollars equals in pesos and today as of me recording this. It's", "start": 77.16, "duration": 5.419}, {"text": "133 pesos and 51 cents. So that's what I have to work with this week.", "start": 83.46, "duration": 6.229}, {"text": "Well, here's the deal I usually shop and do like all my groceries at a local soup Adama", "start": 98.8, "duration": 5.5}, {"text": "It's like a local supermarket chain that exists here", "start": 104.3, "duration": 3.3}, {"text": "But I think that there are better prices in this other market where I see locals kind of go to shop", "start": 107.91, "duration": 5.269}, {"text": "So that is where I'm gonna attempt to make these purchases", "start": 113.85, "duration": 4.039}, {"text": "The spot I decided to hit up. There's known as Mercado Medellín.", "start": 118.68, "duration": 2.72}, {"text": "It's pretty cool, they've got pretty much everything you've need there and the atmosphere is really quite unique", "start": 123.84, "duration": 5.089}, {"text": "To give myself a fighting chance of really making this happen and like being successful with this if this is even possible", "start": 130.38, "duration": 5.809}, {"text": "I'm allowing myself to use the $7.00. However, I want now I don't recommend you do this. This might be a very stupid idea", "start": 136.68, "duration": 6.41}, {"text": "We're just gonna have to see but my idea really is not to starve myself and to make this this whole like torturous experience", "start": 143.61, "duration": 6.68}, {"text": "I want to see what I can do with limited resources", "start": 150.29, "duration": 3.089}, {"text": "When it comes but a terminal for the competency the best", "start": 154.739, "duration": 2.39}, {"text": "So the rules are have seven dollars to work with for all food and drink this week", "start": 158.31, "duration": 4.369}, {"text": "With the exception of water potable water actually does cost money here in Mexico", "start": 162.78, "duration": 3.86}, {"text": "But like I said, I'm gonna make that my one exception but beyond that", "start": 166.64, "duration": 3.029}, {"text": "Anything that costs any money is going to have to count against my seven dollar budget", "start": 170.52, "duration": 4.46}, {"text": "So that includes even things like gum coffee juice anything", "start": 174.98, "duration": 4.199}, {"text": "I'm also not allowing myself to use anything that I previously owned including salt oil", "start": 179.18, "duration": 4.26}, {"text": "Or anything else that I might need to cook I spent weeks thinking this over and trying to plan things out", "start": 184.14, "duration": 5.27}, {"text": "But I ultimately realized for this to happen. I just have to go for it and figure things out as I go", "start": 189.41, "duration": 4.619}, {"text": "I've tried chatting with the locals to get better deals", "start": 194.9, "duration": 2.24}, {"text": "All right, I just snagged and a whole kilo of", "start": 202.38, "duration": 2.72}, {"text": "Oats for 22 pesos feeling good of the winner right there.", "start": 206.41, "duration": 4.94}, {"text": "Personally find that I'm more creative when I impose limitations on myself. I", "start": 212.65, "duration": 3.47}, {"text": "Was particularly targeting staple foods stuff that I know that the government subsidizes stuff", "start": 218.05, "duration": 5.18}, {"text": "That is very cheap. But like look, we're not gonna have ramen", "start": 223.23, "duration": 3.509}, {"text": "Okay, ramen is not gonna be a part of this that is in my opinion", "start": 227.04, "duration": 4.08}, {"text": "Not a super healthy thing to consume especially like the instant ramen that you can buy in supermarkets. Oh no, no to that", "start": 231.12, "duration": 6.9}, {"text": "Okay", "start": 245.04, "duration": 2.0}, {"text": "I'm not gonna lie that went better than I was expecting", "start": 247.72, "duration": 2.869}, {"text": "What remains after my grocery shopping this morning is 49 pesos and one cent", "start": 276.71, "duration": 6.86}, {"text": "Which is about two and a half dollars", "start": 284.27, "duration": 2.0}, {"text": "So we got to see kind of how things go", "start": 286.52, "duration": 2.72}, {"text": "But that's sort of like my emergency fund in case things get real. My original idea was to ration everything out", "start": 289.52, "duration": 7.07}, {"text": "So I have the same exact thing to eat each day, but I think my current plan now is just to eat", "start": 296.59, "duration": 7.11}, {"text": "conservatively and", "start": 304.58, "duration": 1.89}, {"text": "See how things go", "start": 306.47, "duration": 1.99}, {"text": "Oh my God, what am I doing? All right, I", "start": 309.52, "duration": 3.36}, {"text": "Am really hungry I had oatmeal a few hours ago now it is", "start": 314.0, "duration": 5.96}, {"text": "4 o'clock 4:15, and so what I thought I'd do is prepare the beans in the rice that I bought", "start": 320.66, "duration": 7.399}, {"text": "Got to be clever here if I buy eggs or anything else for that matter", "start": 332.33, "duration": 4.609}, {"text": "That requires", "start": 338.63, "duration": 1.17}, {"text": "Any kind of oil I'll take the oil that's in", "start": 339.8, "duration": 3.559}, {"text": "The can here with the beans and save it just in case because I might need it", "start": 343.7, "duration": 4.309}, {"text": "I'm not gonna do all the rice at once because that would be a lot of rice", "start": 349.4, "duration": 4.55}, {"text": "But maybe like half of it so", "start": 355.01, "duration": 2.089}, {"text": "A lot. I think that's a lot of stuff", "start": 357.74, "duration": 2.0}, {"text": "So this juice is what I was talking about gotta save it that's gonna be useful", "start": 374.819, "duration": 5.149}, {"text": "Okay, so", "start": 386.519, "duration": 1.11}, {"text": "Here's the thing. I mean this this really is not that", "start": 387.629, "duration": 3.23}, {"text": "I just found it interesting", "start": 391.409, "duration": 2.0}, {"text": "While I was preparing this thinking about all the different ways that I embellish", "start": 393.599, "duration": 4.64}, {"text": "things", "start": 398.789, "duration": 2.0}, {"text": "Mmm really none that", "start": 403.169, "duration": 2.989}, {"text": "Okay, stay to update things are going a lot better than I was expecting I hope that isn't misplaced", "start": 408.659, "duration": 6.2}, {"text": "Optimism but yeah, I had oatmeal again this morning and I'm not even close to running out", "start": 415.379, "duration": 5.149}, {"text": "So I am feeling good about that. There's also an absolute surplus of rice. So those were good purchases", "start": 420.529, "duration": 6.779}, {"text": "however, I finished the can of beans that I bought and", "start": 427.439, "duration": 2.6}, {"text": "Of all the food that I have bought so far this week", "start": 430.86, "duration": 2.869}, {"text": "I think beans are like my favorites. So I might buy another can we're just gonna have to see how things go probably tonight", "start": 433.729, "duration": 6.69}, {"text": "what I'm gonna have is just", "start": 440.419, "duration": 1.24}, {"text": "rice rice and tortillas one thing that did dawn on me that I didn't even realize would be a consideration for", "start": 441.659, "duration": 5.63}, {"text": "This challenge was the fact that I can't have coffee now. I'm not like addicted to coffee", "start": 448.019, "duration": 6.17}, {"text": "I don't drink it all the time, but it's really nice", "start": 454.189, "duration": 2.489}, {"text": "especially", "start": 456.679, "duration": 0.52}, {"text": "like as a pick-me-up in the afternoon and I spent a lot of time working in coffee shops when I'm sick of being in my", "start": 457.199, "duration": 6.379}, {"text": "Apartment that's kind of a bummer. But I mean talk about first world problems, right? So", "start": 463.579, "duration": 5.43}, {"text": "anyway", "start": 469.529, "duration": 2.0}, {"text": "God but one of the side let's say benefits of all this that I also was not", "start": 473.55, "duration": 4.339}, {"text": "Expecting is the fact that I'm not wasting any energy thinking about what I'm gonna eat", "start": 477.959, "duration": 4.52}, {"text": "It's already sort of decided for me, you know", "start": 482.879, "duration": 2.329}, {"text": "And I tend to spend a lot of time trying to figure out what it is. I want to eat and where it is", "start": 485.209, "duration": 3.84}, {"text": "I want to go on top of the money that you spend and all those resources Mike", "start": 489.05, "duration": 4.5}, {"text": "Time energy and money that I usually spend on those sorts of things", "start": 493.67, "duration": 3.42}, {"text": "I'm able to save now for other projects and other things that I'm doing right now for this week. At least I", "start": 497.09, "duration": 4.679}, {"text": "Snagged two eggs for two pieces of pop and tried cooking them with my super clever oil from the can of beans technique", "start": 502.47, "duration": 5.66}, {"text": "So", "start": 513.81, "duration": 1.35}, {"text": "This did not quite work", "start": 515.16, "duration": 2.0}, {"text": "perfectly, but", "start": 517.77, "duration": 1.86}, {"text": "It's alright. Hey better than nothing this could use seasoning", "start": 519.63, "duration": 4.13}, {"text": "So the tip I realized is that if you can't add salt that's using burn your food a little bit it tastes better", "start": 524.37, "duration": 6.32}, {"text": "I'm not kidding", "start": 531.84, "duration": 2.0}, {"text": "All right, so, it's Wednesday my dudes. Yeah day three basically of this experiment and I gotta say", "start": 534.06, "duration": 7.61}, {"text": "Eating oatmeal with absolutely nothing just oatmeal and water", "start": 542.19, "duration": 4.34}, {"text": "It's not exactly like the most exciting fun breakfast to have I don't want to use the word nasty", "start": 546.72, "duration": 7.07}, {"text": "but it's", "start": 554.07, "duration": 1.29}, {"text": "Bland in the extreme and so I'll second you know", "start": 555.36, "duration": 3.26}, {"text": "Is there any way I could add sugar or flavor of any kind to this?", "start": 558.62, "duration": 4.559}, {"text": "And then I was like, well, what's fruit for I haven't even touched the fruit that I bought so far", "start": 563.18, "duration": 4.74}, {"text": "And so I just cut some orange. The citric scent of oranges is now filling my nostrils and", "start": 568.05, "duration": 8.0}, {"text": "This is good. This is a huge boost to morale. I'm gonna eat the oatmeal with the orange", "start": 577.11, "duration": 4.4}, {"text": "I think I do even going to be so adventurous as to add a banana into the mix good why not bananas?", "start": 581.51, "duration": 6.119}, {"text": "I'm sweet man. Look at me", "start": 587.63, "duration": 2.25}, {"text": "Mm-hmm. One thing at a time one meal at a time eating rice with tortillas", "start": 592.47, "duration": 4.82}, {"text": "Which is what I did last night is not super fun", "start": 597.29, "duration": 2.789}, {"text": "So I'm gonna have to take a moment today and get a little bit more creative about that as well", "start": 600.27, "duration": 5.599}, {"text": "I need to get some beans and maybe a maybe a vegetable our show that would be good. Right? Hey, how's it going?", "start": 606.3, "duration": 6.15}, {"text": "so I'm gonna go back to Matt Galland managing to buy a couple more cans of beans and", "start": 612.79, "duration": 4.46}, {"text": "Maybe a potato the reason being I'm gonna have to stay up until 3:30 a.m", "start": 617.68, "duration": 4.64}, {"text": "Tonight for a project that I'm working on and I know I'm gonna get hungry so I might as well be prepared. I", "start": 622.57, "duration": 5.539}, {"text": "Think this is an appropriate time to dip into my savings. We're going all out. I", "start": 628.63, "duration": 4.549}, {"text": "Ultimately bought two cans of beans and a potato for 39 and a half missiles", "start": 634.06, "duration": 3.919}, {"text": "this challenge is", "start": 639.399, "duration": 2.0}, {"text": "More difficult than I thought. I think the thing that's hitting me right now is that", "start": 642.52, "duration": 4.129}, {"text": "Okay, I'm doing this for like a week, right but there are people", "start": 647.29, "duration": 3.47}, {"text": "That live like this, you know, I'll give an example. I am now having to sort of ration out my tortillas", "start": 651.339, "duration": 5.3}, {"text": "I've got about 16 left. Today is day four", "start": 656.67, "duration": 2.88}, {"text": "And so I have about four left for each day", "start": 660.31, "duration": 2.57}, {"text": "And the idea of rationing things out so tightly is something kind of foreign to me", "start": 662.88, "duration": 4.95}, {"text": "Like I've never had to do that before I don't think I have an unhealthy relationship with food", "start": 667.83, "duration": 3.989}, {"text": "But it's something that I just get so much joy", "start": 671.82, "duration": 3.359}, {"text": "I just love eating good food. I just love it. I'm down to one banana left", "start": 675.79, "duration": 5.66}, {"text": "I was feeling really quite demoralized yesterday. I know it's silly to say that but I", "start": 681.45, "duration": 6.209}, {"text": "cannot imagine", "start": 688.329, "duration": 1.591}, {"text": "living like this", "start": 689.92, "duration": 2.0}, {"text": "I just wanted to kind of assess where things are at", "start": 695.99, "duration": 2.429}, {"text": "I've still got oats a fair amount of rice a potato a month to my last banana", "start": 698.66, "duration": 4.8}, {"text": "My last can of beans and 12 40s. I have four left to eat today", "start": 703.8, "duration": 5.21}, {"text": "Plus this toil juicing which I don't know. This technique is really working to be honest with you. I", "start": 710.01, "duration": 5.089}, {"text": "Just miss you tasty food and", "start": 716.61, "duration": 2.119}, {"text": "drinking coffee and you know little pleasures like that the last couple of days have been a", "start": 719.279, "duration": 5.63}, {"text": "Lot more difficult than the beginning of this week", "start": 725.4, "duration": 2.269}, {"text": "I'm feeling more tired than I usually do and I", "start": 727.67, "duration": 3.72}, {"text": "Have no idea if it has anything to do with the food that I'm eating and it might totally be a nocebo effect", "start": 731.73, "duration": 5.989}, {"text": "I'm totally willing to recognize that part of me is getting a little bit obsessive about rationing things out because I really want", "start": 737.73, "duration": 7.25}, {"text": "This to be successful", "start": 745.47, "duration": 1.25}, {"text": "I want to make it through the week and I also", "start": 746.72, "duration": 1.69}, {"text": "Think I have a little bit of a fear of running out. Like I think I'm taking this a little bit too seriously", "start": 748.41, "duration": 5.15}, {"text": "I'm noticing just how much I rely on it for kind of like daily pleasures", "start": 753.87, "duration": 6.589}, {"text": "There's no more fruit fruit is gone", "start": 760.62, "duration": 1.64}, {"text": "and I totally recognize that I have not included practically or any honestly vegetables in this entire week and", "start": 762.26, "duration": 7.38}, {"text": "Of course. I'm trying to eat as healthy as I can. But I just I feel like I can't afford it", "start": 770.22, "duration": 3.83}, {"text": "He doesn't fit into a dollar a day. I", "start": 774.05, "duration": 2.159}, {"text": "Decided it was time to see what I could get with my last pesos", "start": 776.82, "duration": 2.75}, {"text": "at a mini supermarket", "start": 780.69, "duration": 1.46}, {"text": "I got an onion for eight pesos and convinced them to give me an egg for my last base or and a half even though", "start": 782.15, "duration": 5.039}, {"text": "usually they sell them for two I", "start": 787.19, "duration": 2.0}, {"text": "Know you're thinking. Why are we in the negative Nathaniel? What is this and believe me? I share your frustration", "start": 793.05, "duration": 5.96}, {"text": "Okay, it was only an editing that I realized that I forgot to take into account the two eggs that I bought on day two", "start": 799.65, "duration": 6.619}, {"text": "I was under the impression that I still had my two half pesos", "start": 806.27, "duration": 3.209}, {"text": "And I thought I did things to perfection. But what we are seeing right now is poor math skills on full display", "start": 809.82, "duration": 7.039}, {"text": "Anyway, I appreciate that you've stuck around for this long. Might as well, see how this all ends, right", "start": 817.92, "duration": 4.85}, {"text": "At 7:00 p.m. On Sunday, which means we are almost there. I am so ready for this to be done", "start": 830.54, "duration": 5.059}, {"text": "All the food is gone except for a potato and half an onion", "start": 836.15, "duration": 3.529}, {"text": "And so that's what I'm preparing right now. It's just in the oven my plan at this point", "start": 840.29, "duration": 4.639}, {"text": "Honestly is to go to bed very early, so that things can just be done and tomorrow morning", "start": 844.93, "duration": 5.73}, {"text": "I'm gonna eat like a king check out the system that I've got here since I don't have aluminum foil", "start": 850.66, "duration": 4.979}, {"text": "And I feel like buying some would be cheating. I came up with a makeshift solution", "start": 856.22, "duration": 4.669}, {"text": "So the potato is within that makeshift contraption you'll see that right there", "start": 860.99, "duration": 5.57}, {"text": "So a few weeks have gone by and I've gotten the chance to reflect on things", "start": 875.0, "duration": 4.01}, {"text": "Let me just say that I already knew that it brings me a lot of joy in life", "start": 879.08, "duration": 4.099}, {"text": "I just always like to think about where the food comes from and what took place", "start": 883.18, "duration": 4.559}, {"text": "For it to arrive in the plate in front of me", "start": 888.14, "duration": 2.809}, {"text": "I wasn't originally planning on doing this but thinking about being restricted on what I can eat for a longer period of time", "start": 890.95, "duration": 6.57}, {"text": "Was a really depressing thought I feel very lucky that I always had enough while I was growing up", "start": 897.74, "duration": 5.15}, {"text": "and unfortunately", "start": 903.32, "duration": 1.01}, {"text": "We still live in a world where there are many people including children that do not I have", "start": 904.33, "duration": 4.799}, {"text": "Regularly asked for your support on my patreon. But today I'm going to do something a little bit different", "start": 909.35, "duration": 4.219}, {"text": "I've set up a GoFundMe campaign where you can donate money to action against hunger, which is a humanitarian organization", "start": 913.57, "duration": 6.539}, {"text": "That is making a huge effort to fight hunger around the world. I like that", "start": 920.11, "duration": 3.93}, {"text": "They put a focus on helping women and children instead of giving me money", "start": 924.04, "duration": 3.359}, {"text": "I'm going to ask that you send your money over there", "start": 927.4, "duration": 2.07}, {"text": "If you feel that this is an important cause so that we're not starting from zero", "start": 929.47, "duration": 3.659}, {"text": "I've gone ahead and done the first thousand dollars, which is about what I made on patreon last month", "start": 933.13, "duration": 4.049}, {"text": "So thank you to all my patrons. And yeah, I'm gonna be posting updates on my Instagram", "start": 937.18, "duration": 5.19}, {"text": "So thank you for watching this video and I'll see you soon", "start": 942.37, "duration": 3.21}]