[{"text": "Start building a website today with Squarespace.", "start": 0.0, "duration": 2.48}, {"text": "And use squarespace.com/cow to get 10% off.", "start": 2.48, "duration": 3.16}, {"text": "These days, the internet and the news are filled with headlines like this.", "start": 5.64, "duration": 4.34}, {"text": "It's official: millennials are the worst generation to ever exist in the history of mankind!", "start": 10.02, "duration": 4.7}, {"text": "What makes them so entitled? Why are they so lazy? And when did they emerge from the depths of hell?", "start": 14.72, "duration": 4.88}, {"text": "Find out tonight at 8.", "start": 19.6, "duration": 1.44}, {"text": "It's like everywhere you look, someone is complaining about those darn millennials.", "start": 21.04, "duration": 4.84}, {"text": "You millennials with your trigger warnings and your safe spaces! I would have given anything for a safe space ...", "start": 25.88, "duration": 5.92}, {"text": "in World War II!", "start": 32.26, "duration": 1.66}, {"text": "Adults are so frustrated with the youth of today.", "start": 33.92, "duration": 3.16}, {"text": "They're so scared for the future of the country because one day, one of these kids is gonna be the president.", "start": 37.08, "duration": 6.46}, {"text": "For my first act as president, I am criminalizing systematic oppression, okay? (APPLAUSE)", "start": 43.54, "duration": 5.0}, {"text": "I don't even know how we're gonna do that, but I'll tell you right now: if you offend me, you're probably going to jail.", "start": 48.54, "duration": 4.58}, {"text": "So let's back up because first off, I think it's kind of condescending to just lump a bunch of very diverse people into one group and then call that group \"millennials.\"", "start": 53.12, "duration": 9.9}, {"text": "Because, like, when people talk about millennials, I don't really associate myself with anything that millennials are associated with.", "start": 63.02, "duration": 7.14}, {"text": "For my next act as president, I am announcing that all national parks are now federally-owned safe spaces.", "start": 70.16, "duration": 6.72}, {"text": "(APPLAUSE)", "start": 76.88, "duration": 0.98}, {"text": "I think I speak for everyone when I say, \"Bigots, get out of the Grand Canyon!\"", "start": 77.86, "duration": 4.28}, {"text": "Like, I'm a millennial, but I want no part in that.", "start": 82.14, "duration": 3.56}, {"text": "Look, I agree, there are a lot of pretty awful kids out there.", "start": 85.7, "duration": 3.52}, {"text": "But if you are gonna lump us all together, it kind of begs the question: who raised the kids?", "start": 89.22, "duration": 6.04}, {"text": "Was it the adults? The parents? Did you do this?", "start": 95.26, "duration": 3.1}, {"text": "Because I'm pretty sure that you raised the children that you claim are terrible.", "start": 98.36, "duration": 4.48}, {"text": "Now, look, I know this is triggering to hear, and trust me, I know how hard it is to accept responsibility for your actions.", "start": 102.84, "duration": 6.58}, {"text": "Apparently, I don't do that ever.", "start": 109.42, "duration": 1.82}, {"text": "Can you believe these millennials? Unable to take responsibility for their own actions and then", "start": 111.24, "duration": 4.52}, {"text": "complaining all the time about how everybody but them is to blame for everything that's wrong. (LAUGHS)", "start": 115.76, "duration": 4.82}, {"text": "But if you're gonna put all the kids into one group and say that group is terrible, well, then we're gonna have to", "start": 120.58, "duration": 6.02}, {"text": "lump of all the parents who raised them into a group and say, \"It's your fault.\"", "start": 126.6, "duration": 4.82}, {"text": "I mean, if I had a kid—now, let's say I have a kid who's 16—if my 16-year-old acts like a complete idiot", "start": 131.42, "duration": 5.94}, {"text": "their whole life, it would be pretty stupid of me to walk around saying,", "start": 137.36, "duration": 3.84}, {"text": "Wow, 16-year-olds these days, am I right? They're all so bad. (LAUGHS)", "start": 141.2, "duration": 4.82}, {"text": "I mean, maybe that's what this is all about.", "start": 146.02, "duration": 1.66}, {"text": "Maybe adults these days are realizing,", "start": 147.68, "duration": 2.6}, {"text": "Wow, I had one job, and I blew it!", "start": 150.28, "duration": 2.62}, {"text": "and so all they can do is lump all of the kids into one group and claim that that group is awful.", "start": 152.9, "duration": 5.34}, {"text": "Because then ... then it's not the parents' fault, now is it?", "start": 158.24, "duration": 3.46}, {"text": "Clever!", "start": 161.7, "duration": 0.64}, {"text": "But look, everybody knows. Kids learn by example.", "start": 162.34, "duration": 2.6}, {"text": "If they become entitled, it's because they grew up around entitled people.", "start": 164.94, "duration": 3.22}, {"text": "If they're spoiled, it's because somebody spoiled them.", "start": 168.16, "duration": 2.4}, {"text": "If they're ignorant, arrogant, and unwilling to listen, it's because they spent their time around close-minded people.", "start": 170.56, "duration": 5.36}, {"text": "It doesn't take a rocket scientist.", "start": 175.92, "duration": 2.34}, {"text": "Look, I'm not trying to make excuses for millennials, okay?", "start": 178.26, "duration": 3.02}, {"text": "I agree: a lot of people my age are terrible.", "start": 181.28, "duration": 2.58}, {"text": "I'm just saying if millennials are bad, it's because you blew it.", "start": 183.86, "duration": 3.94}, {"text": "If you want millennials to be responsible for their actions, maybe you should have taught them how to do that.", "start": 187.8, "duration": 5.38}, {"text": "But, like I said, kids learn by example.", "start": 193.18, "duration": 3.04}, {"text": "Have you ever wanted to start your own website or blog, but you weren't sure how to get started?", "start": 199.04, "duration": 4.0}, {"text": "Or have you ever wanted to start an online store?", "start": 203.04, "duration": 2.44}, {"text": "If so, I would definitely check out Squarespace.", "start": 205.48, "duration": 2.48}, {"text": "Squarespace has easy-to-use tools that make building a website a breeze.", "start": 207.96, "duration": 3.8}, {"text": "They have beautiful templates that will have you up and running quick.", "start": 211.76, "duration": 2.76}, {"text": "And Squarespace Commerce will help you launch that online store you've always wanted to start.", "start": 214.52, "duration": 4.06}, {"text": "Plus, if you sign up for a year, you'll get a free custom domain.", "start": 218.58, "duration": 3.38}, {"text": "So go to squarespace.com/cow because there, you're gonna get 10% off your first purchase.", "start": 221.96, "duration": 4.62}, {"text": "That's squarespace.com/cow.", "start": 226.58, "duration": 2.2}]