[{"text": "This episode is brought to you by Dashlane;\nTry Dashlane Premium free for 30 days at www.dashlane.com/infographics", "start": 0.17, "duration": 7.09}, {"text": "and never forget another password and keep\nall your online accounts secure!", "start": 7.26, "duration": 3.45}, {"text": "It doesn’t matter how good you are, or how\nmuch criminal expertise the crack-team you", "start": 10.71, "duration": 4.77}, {"text": "put together has, there are still some places\na person just cannot get into. Maybe you want", "start": 15.48, "duration": 4.8}, {"text": "to break in to the Svalbard International\nSeed Vault. First you’d have to get to a", "start": 20.28, "duration": 3.85}, {"text": "remote island in the Arctic circle and then\nget past motion detectors, blast proof doors", "start": 24.13, "duration": 4.71}, {"text": "and a meter thick steel reinforced wall. And\nall for some seeds. Or maybe you want to get", "start": 28.84, "duration": 4.76}, {"text": "your hands on the 4,600 tons of gold in the\nBank of England gold vault. Well, bombs wouldn’t", "start": 33.6, "duration": 5.369}, {"text": "do much against the 8 foot thick walls,, and\nif you want to get in through the gigantic", "start": 38.969, "duration": 4.041}, {"text": "main doors you’ll need a set of three-feet\nlong keys. But to even get that far you’ll", "start": 43.01, "duration": 4.77}, {"text": "need to get past a state of the art security\nsystem.", "start": 47.78, "duration": 2.34}, {"text": "It’s not going to happen, at least, we don’t\nthink it will, but so-called impossible crimes", "start": 50.12, "duration": 4.149}, {"text": "have been committed before and another may\nsurprise us. But what about the USA’s Fort", "start": 54.269, "duration": 4.801}, {"text": "Knox, a place that has become a byword for\nsecurity. You’d be richer than you could", "start": 59.07, "duration": 4.12}, {"text": "imagine if you could get away with the loot,\nbut how on Earth would you go about the heist?", "start": 63.19, "duration": 4.64}, {"text": "Well, first of all you should know what’s\nin there.", "start": 67.83, "duration": 2.95}, {"text": "According to the Bureau of the Fiscal Reserve\nin 2018 there was 147,341,858.382 ounces of", "start": 70.78, "duration": 9.96}, {"text": "gold kept in Fort Knox. That’s around 4,177,071\nkilos. Most of that is in the form of gold", "start": 80.74, "duration": 7.35}, {"text": "bars and if you got your hands on it you could\nend up with around $200 trillion dollars at", "start": 88.09, "duration": 4.86}, {"text": "the price of gold today. Of course you’d\nprobably crash the gold market trying to sell", "start": 92.95, "duration": 4.029}, {"text": "off that much, but let’s just say you’d\nbe set for life.", "start": 96.979, "duration": 3.381}, {"text": "$200 trillion worth of gold sounds like a\nlot, and it is, but, according to the United", "start": 100.36, "duration": 5.09}, {"text": "States Mint this isn’t even close the largest\namount that has been stored there. The most", "start": 105.45, "duration": 4.449}, {"text": "gold the vault has held was in 1941 when it\nhad over four times as much at 649.6 million", "start": 109.899, "duration": 7.64}, {"text": "ounces. That’s around 18 million kilos give\nor take. Regardless of how many hundreds of", "start": 117.539, "duration": 4.82}, {"text": "millions of ounces of gold are in the vault,\nyou’re likely not going to be able to get", "start": 122.359, "duration": 3.69}, {"text": "it all out of there at once. You’ll probably\nbe limited to as much as you can get into", "start": 126.049, "duration": 4.02}, {"text": "the back of your trucks. U.S. law states that\nthe most weight the biggest tandem semi-trucks", "start": 130.069, "duration": 4.431}, {"text": "can carry is 80,000 pounds (36,000 kg), so\nlet’s just say you have one of those. Obviously", "start": 134.5, "duration": 5.22}, {"text": "if you’re pulling off the biggest gold heist\nin history, you’re not that worried about", "start": 139.72, "duration": 3.4}, {"text": "breaking the law concerning carrying too heavy\nof a load, but it’s likely the law is in", "start": 143.12, "duration": 4.199}, {"text": "place for a good reason. You don’t want\nany accidents during your heist or your truck", "start": 147.319, "duration": 4.081}, {"text": "breaking down, and you definitely don’t\nwant to get pulled over for carrying a too", "start": 151.4, "duration": 3.309}, {"text": "heavy load. We just checked today’s gold\nprice per kilo and it was about $43,000. That", "start": 154.709, "duration": 5.832}, {"text": "means with a full load you’d have a legal\nvalue of $1,548,000,000. We think that’s", "start": 160.541, "duration": 6.698}, {"text": "enough; you don’t want to be greedy afterall.", "start": 167.239, "duration": 2.171}, {"text": "Ok, now you’ve worked out the truck and\nhow much you’ll get away with, but how do", "start": 169.41, "duration": 3.602}, {"text": "you fill it up? We know this can’t be a\none man operation, there’s just too much", "start": 173.012, "duration": 4.238}, {"text": "weight to move. The U.S. mint says that usually\neach bar of gold measures 7 inches x 3 and", "start": 177.25, "duration": 5.48}, {"text": "5/8 inches x 1 and 3/4 inches and weighs approximately\n27.5 pounds (about 12.5 kilos). Heavy, but", "start": 182.73, "duration": 6.53}, {"text": "still light enough that it wouldn’t be too\nmuch trouble for the average adult to move", "start": 189.26, "duration": 3.12}, {"text": "around. But even with a good team and maybe\nsome industrial carts you have in your truck,", "start": 192.38, "duration": 4.29}, {"text": "it would still take a fair amount of time\nto fill up, since your truck can hold almost", "start": 196.67, "duration": 3.52}, {"text": "3,000 bars. Nothing you can’t handle though,\nyou have your A-Team after all, consisting", "start": 200.19, "duration": 4.93}, {"text": "of you, your buddy, your other buddy, and\na couple of guys you met at a concert last", "start": 205.12, "duration": 4.31}, {"text": "month.", "start": 209.43, "duration": 1.0}, {"text": "Ok, truck, carts, friends, big swole muscles\nready to lift - now it’s time to figure", "start": 210.43, "duration": 3.82}, {"text": "out how to actually get inside.", "start": 214.25, "duration": 1.85}, {"text": "First, you’ll have to break some bad news\nto the boys. Since the vault started storing", "start": 216.1, "duration": 4.19}, {"text": "gold in 1937, no one has ever broken into\nit. No one has even tried, because, well,", "start": 220.29, "duration": 5.6}, {"text": "it just seems so impossible.", "start": 225.89, "duration": 1.95}, {"text": "For starters, the vault is located on a military\nbase, hence the name “Fort” Knox. There", "start": 227.84, "duration": 4.861}, {"text": "are literally thousands of people living on\nthe base,and it’s huge, measuring 109,000", "start": 232.701, "duration": 3.999}, {"text": "acres (170 square miles, of 441 km²). At\nany given time around 30,000 soldiers might", "start": 236.7, "duration": 4.399}, {"text": "be stationed either on or close to the base\nalong with plenty of tanks, armored personnel", "start": 241.099, "duration": 4.581}, {"text": "carriers and military attack helicopters.\nSo you’ll have to get past them, as well", "start": 245.68, "duration": 4.479}, {"text": "as many heavily armed Mint Police, just to\nget to the depository. You should also know", "start": 250.159, "duration": 5.241}, {"text": "that the building where the vault is located,\nis totally out of bounds. There’s an extremely", "start": 255.4, "duration": 4.55}, {"text": "rigorous process to vet anyone coming to the\nvault. Absolutely no one is allowed to just", "start": 259.95, "duration": 4.58}, {"text": "show up and waltz in, no matter how important,\nno matter how good their documentation is,", "start": 264.53, "duration": 4.91}, {"text": "not even the President of the United States.", "start": 269.44, "duration": 1.92}, {"text": "So let’s be honest, you’re never getting\npast the thousands of military personnel,", "start": 271.36, "duration": 4.03}, {"text": "but let’s just say for the sake of fun that\nyou and your team have an ace in the hole.", "start": 275.39, "duration": 3.82}, {"text": "You have used mini drones that can bypass\ndetection to fly all over the base and spray", "start": 279.21, "duration": 4.61}, {"text": "a very powerful chemical agent in the air\nthat causes anyone who breathes it in to become", "start": 283.82, "duration": 4.15}, {"text": "unconscious for quite some time. Again, we\nknow this is a total fantasy but let’s just", "start": 287.97, "duration": 4.751}, {"text": "pretend you’re a rogue nerve agent scientist\nthat has developed the perfect knockout gas.", "start": 292.721, "duration": 4.969}, {"text": "You now at least have the opportunity to get\nyour truck close to the building housing the", "start": 297.69, "duration": 4.0}, {"text": "vault, but oops, it’s surrounded by ten\nfoot high electrified fences, but that’s", "start": 301.69, "duration": 4.52}, {"text": "not a big problem because you have special\ncutters. Also, now that you are close, even", "start": 306.21, "duration": 4.08}, {"text": "though everyone in the vicinity is knocked\nout, the radar is still active, and what that", "start": 310.29, "duration": 3.81}, {"text": "radar catches will be sent back to other bases.\nBut let’s just say you have managed to block", "start": 314.1, "duration": 4.43}, {"text": "the radar signals, because you met a guy in\na bar the other month who did a stint at Area", "start": 318.53, "duration": 4.32}, {"text": "51 and he knows all about jamming signals.", "start": 322.85, "duration": 2.89}, {"text": "Radar, electric fences, getting past that\nis heist 101 class stuff. The radar was the", "start": 325.74, "duration": 5.2}, {"text": "hard part, and the fences, even the electric\nones, as we said you can easily get past.", "start": 330.94, "duration": 4.53}, {"text": "But now another problem has arisen, because\nthat pretty lawn around the depository is", "start": 335.47, "duration": 4.55}, {"text": "littered with landmines. Okay, so you had\nto Google “How to get through a minefield”", "start": 340.02, "duration": 4.27}, {"text": "and you were pleasantly surprised to find\nlots of, hmm, experts. They told you to get", "start": 344.29, "duration": 4.21}, {"text": "ahold of a metal detector and mark your path\nas you go. Just in case though, you have some", "start": 348.5, "duration": 4.44}, {"text": "of those huge funny-looking military foam\nboots to spread your weight over a given surface.", "start": 352.94, "duration": 4.22}, {"text": "How did you get them? Well, let’s just say\nyou know a guy who knows a guy. You plan your", "start": 357.16, "duration": 4.42}, {"text": "route, marking your way with little flags,\nand that’s the track you will use with your", "start": 361.58, "duration": 3.83}, {"text": "gold-filled carts.", "start": 365.41, "duration": 1.02}, {"text": "You are finally at the building, thankfully\nwith all of your limbs still intact, and you", "start": 366.43, "duration": 3.981}, {"text": "are now well aware that it is filled with\narmed mint police. Time to get out the gas", "start": 370.411, "duration": 4.169}, {"text": "masks and fill that place with your special\ngo-to-sleep chemical concoction. After a few", "start": 374.58, "duration": 4.32}, {"text": "minutes filling the building you are pretty\nsure they are in La La Land. If the outer", "start": 378.9, "duration": 3.93}, {"text": "door is locked, no problem, this door you\ncan blast through. It will be the easiest", "start": 382.83, "duration": 4.16}, {"text": "door of the day. Inside you have to get to\nthe vaults at the bottom of the building,", "start": 386.99, "duration": 3.72}, {"text": "and this is how they have been described “A\ntwo level steel and concrete vault that is", "start": 390.71, "duration": 4.34}, {"text": "divided into compartments… The vault casing\nis constructed of steel plates, steel I-beams", "start": 395.05, "duration": 4.48}, {"text": "and steel cylinders laced with hoop bands\nand encased in concrete.” The door itself", "start": 399.53, "duration": 4.62}, {"text": "is said to weigh 20 tons. You cannot blast\nthrough this door, and it takes a number of", "start": 404.15, "duration": 4.76}, {"text": "combinations to open it and no one person\nin the world has the complete combination.", "start": 408.91, "duration": 3.96}, {"text": "In fact, all the different people who share\nsome knowledge of how to get in all have a", "start": 412.87, "duration": 4.72}, {"text": "set of different instructions. You would need\nto know who all these people are and get them", "start": 417.59, "duration": 3.91}, {"text": "all to tell you the truth.", "start": 421.5, "duration": 1.86}, {"text": "Luckily, you met a hacker the other month\nwho has spent years hacking military databases", "start": 423.36, "duration": 4.5}, {"text": "and especially anyone even remotely concerned\nwith the vault and its security. Prior to", "start": 427.86, "duration": 4.75}, {"text": "your heist you gained knowledge of these people,\nto the extent that you know what aftershave", "start": 432.61, "duration": 4.19}, {"text": "they use and who their favorite niece is.\nYou have kidnapped these people and are now", "start": 436.8, "duration": 4.0}, {"text": "presently showing them live feeds of their\nmost loved family members, including their", "start": 440.8, "duration": 3.79}, {"text": "beloved grandparents, cherished family pets,\nstaring down the barrel of your buddy’s", "start": 444.59, "duration": 4.84}, {"text": "gun. Violence is not your style, but it was\nthe only way you could get through those doors.", "start": 449.43, "duration": 4.71}, {"text": "They reluctantly each give up their part of\nthe combination and the massive doors swing", "start": 454.14, "duration": 4.55}, {"text": "open.", "start": 458.69, "duration": 1.0}, {"text": "What you see in front of you is just what\nThe New York Times saw when it became the", "start": 459.69, "duration": 3.05}, {"text": "only media outlet ever to get a peek inside\nthe vault. It said this, “Stacked from the", "start": 462.74, "duration": 4.83}, {"text": "floor 8 feet to the ceiling in a vault 6 feet\nwide and 12 feet deep were 36,236 bars, glistening", "start": 467.57, "duration": 7.76}, {"text": "in the half‐light.” A beautiful site to\nbe sure.", "start": 475.33, "duration": 2.97}, {"text": "Now you just need to move 80,000 pounds of\nawkward gold bars into your carts, up and", "start": 478.3, "duration": 4.23}, {"text": "out of the vault, through the rest of the\nbuilding, across your marked path through", "start": 482.53, "duration": 2.99}, {"text": "the minefield - watch your step- and load\nthem into your truck. If each cart can carry", "start": 485.52, "duration": 4.28}, {"text": "roughly 1,000 pounds without breaking then\nthat’s only 80 trips! So now you just need", "start": 489.8, "duration": 4.85}, {"text": "to hope that you can get the gold out and\nno signals of the breach have reached the", "start": 494.65, "duration": 3.77}, {"text": "authorities. And let’s not forget that most\nof these security measures we have talked", "start": 498.42, "duration": 3.61}, {"text": "about are mere speculation, there could be\nmany more that we’re unaware of. But let’s", "start": 502.03, "duration": 4.8}, {"text": "just say you have beaten the system, and now\nit’s just some grunt work getting all the", "start": 506.83, "duration": 4.19}, {"text": "gold to the truck. When fully loaded you and\nyour guys drive off into the sunset, hmm,", "start": 511.02, "duration": 4.42}, {"text": "let’s say sunrise. It’s better if the\njob is done at night. You are going to have", "start": 515.44, "duration": 4.019}, {"text": "to melt this gold down and then find a fence\nto get rid of it for you. Luckily you met", "start": 519.459, "duration": 4.221}, {"text": "a guy at the bowling alley the other month\nand he knows a guy who knows a guy who is", "start": 523.68, "duration": 3.94}, {"text": "buying a huge amount of gold. You heard his\nname was Gold-pinky or thumb or something", "start": 527.62, "duration": 4.75}, {"text": "like that.", "start": 532.37, "duration": 1.04}, {"text": "Job well done, give yourself a pat on the\nback. Of course the entire time you and your", "start": 533.41, "duration": 3.84}, {"text": "friends were doing this you have state of\nthe art disguises on as well as full-body", "start": 537.25, "duration": 3.839}, {"text": "outfits which would prevent you leaving behind\nany trace of you and your friends’ DNA.", "start": 541.089, "duration": 4.651}, {"text": "As for the equipment used and the truck, well,\nlet’s just say you met someone in the YouTube", "start": 545.74, "duration": 3.98}, {"text": "comments section who knows how to make inconvenient\nthings disappear. Congratulations, you’re", "start": 549.72, "duration": 4.64}, {"text": "now an overnight billionaire! Now to retire\nand spend the rest of your life looking over", "start": 554.36, "duration": 4.56}, {"text": "your shoulder wondering when the full weight\nof the US justice system and military will", "start": 558.92, "duration": 3.76}, {"text": "come crashing down on you.", "start": 562.68, "duration": 1.92}, {"text": "Okay, so we had to get pretty creative to\nfigure out a way to break in to Fort Knox,", "start": 564.6, "duration": 4.26}, {"text": "but most hackers don’t have the same issue.\nThe reality is that most people are incredibly", "start": 568.86, "duration": 4.45}, {"text": "vulnerable to having their personal information\nor accounts hacked and have no idea! No need", "start": 573.31, "duration": 5.199}, {"text": "to worry though, because Dashlane’s the\none and only tool you need to keep your personal", "start": 578.509, "duration": 3.961}, {"text": "info and digital accounts safe and secure,\nand their Dark Web monitoring services will", "start": 582.47, "duration": 4.69}, {"text": "immediately notify you if it finds any of\nyour personal information for sale on an online", "start": 587.16, "duration": 4.96}, {"text": "marketplace, so you can take steps to protect\nyourself right away! Don’t be like millions", "start": 592.12, "duration": 4.659}, {"text": "of victims every day, get Dashlane and keep\nyour digital life secure right now! Head on", "start": 596.779, "duration": 5.371}, {"text": "over to www.dashlane.com/infographics for\na free 30 day trial, and if you use the coupon", "start": 602.15, "duration": 6.729}, {"text": "code ‘infographics’ you can get 10% off\na premium subscription today!", "start": 608.879, "duration": 3.401}, {"text": "But seriously, do you think after hearing\nthis that it would be even remotely possible", "start": 612.28, "duration": 1.0}, {"text": "for someone to break into Fort Knox and steal\nthe gold? Tell us in the comments. Also, if", "start": 613.28, "duration": 1.0}, {"text": "you do end up with a billion dollars, be sure\nto check out our other episode Spend $1 Billion", "start": 614.28, "duration": 1.0}, {"text": "Dollars In 24 Hours or LOSE IT ALL - CHALLENGE.\nThanks for watching, and as always, don’t", "start": 615.28, "duration": 1.0}, {"text": "forget to like, share and subscribe. See you\nnext time.", "start": 616.28, "duration": 0.01}]