[{"text": "Hi, I want to make my own high voltage capacitor", "start": 0.03, "duration": 3.27}, {"text": "But what is a capacitor? It is basically made by any two electric", "start": 3.3, "duration": 4.019}, {"text": "Conductors placed close to each other with some electrical isolator between them. Like two wires", "start": 7.51, "duration": 5.33}, {"text": "running parallel to each other or two lovers separated by glass.", "start": 12.969, "duration": 3.739}, {"text": "I Love you, too", "start": 19.029, "duration": 0.83}, {"text": "a capacitor stores energy in form of electric fields. If there is a path to place some", "start": 19.859, "duration": 6.18}, {"text": "charges on one side", "start": 26.289, "duration": 2.0}, {"text": "then it attracts the opposing charges through the other path and charges the other side.", "start": 28.48, "duration": 6.56}, {"text": "Now even if I cut the paths it will hold on to its energy and the first popular capacitor that was made like", "start": 35.04, "duration": 6.119}, {"text": "300 years ago was called a Leyden jar", "start": 41.41, "duration": 2.569}, {"text": "It has quite a simple structure and I also noticed that the king of random Junior made one and I watch the video and", "start": 43.98, "duration": 6.27}, {"text": "Let's just say I don't appreciate misuse of capacitors", "start": 50.71, "duration": 3.349}, {"text": "That's quite rich coming from me, I guess and thanks to circuit specialists. I'll give away two hand tech scopes at the end", "start": 54.76, "duration": 6.83}, {"text": "I mean 200 megahertz two channel scope for [very low price]. What is your excuse for not scoping curves?", "start": 61.59, "duration": 6.84}, {"text": "Let's make a Leyden jar and explain it", "start": 68.43, "duration": 2.0}, {"text": "I took a plastic bottle for vitamin pills and peel the label off because they thinner the wall the higher the capacity", "start": 70.439, "duration": 7.26}, {"text": "I cover the outside of the bottle with aluminum foil as one side of the capacitor plate. Cut the extras", "start": 77.7, "duration": 5.459}, {"text": "Tape the edges with electric tape", "start": 83.74, "duration": 2.419}, {"text": "There", "start": 88.24, "duration": 1.05}, {"text": "Then we put a metal screw or nail", "start": 89.29, "duration": 2.36}, {"text": "at the center of the lead all the way in so you can get into the water in the bottle later", "start": 92.02, "duration": 5.0}, {"text": "I can't put metal plate on the inside of the bottle", "start": 97.02, "duration": 2.79}, {"text": "so instead I fill it with water which is not conductive and", "start": 99.81, "duration": 4.199}, {"text": "Then add salt to it to make it conductive", "start": 104.409, "duration": 3.05}, {"text": "So now the aluminum on the outside and the conductive saltwater on the inside are the two isolated", "start": 107.5, "duration": 5.479}, {"text": "conductive plates of my Capacitor", "start": 113.35, "duration": 1.35}, {"text": "and now I add some length of metal wire to the end of the screw which will help increase the surface", "start": 114.7, "duration": 6.35}, {"text": "Contact to the saltwater and reduce the resistance. Now, this is pretty much done", "start": 121.42, "duration": 4.669}, {"text": "But the actual Leyden jars have a smooth metal", "start": 126.09, "duration": 2.429}, {"text": "sphere at the end of the rod that removes all the sharp edges where the charges can run away from", "start": 128.59, "duration": 4.88}, {"text": "I don't have a metal sphere", "start": 133.47, "duration": 1.44}, {"text": "But I have a ping-pong ball that I can wrap inside aluminium foil and make it as smooth as possible", "start": 134.91, "duration": 5.489}, {"text": "put the end of it around the screw and", "start": 141.04, "duration": 3.05}, {"text": "Cover the rough surfaces with electric tape and we're done. Let's see if I can measure the capacitance", "start": 144.64, "duration": 5.449}, {"text": "According to the meter the Leyden jar is around one-and-a-half", "start": 150.64, "duration": 3.5}, {"text": "Nanofarads, which is pretty small but it's around what it should be", "start": 154.87, "duration": 2.69}, {"text": "Now King jr", "start": 158.739, "duration": 1.22}, {"text": "Used the PVC pipe and rubbed it with paper towel. PVC picks up negative charge and he charged the bottle like this", "start": 159.959, "duration": 6.21}, {"text": "Which is incorrect. Helping me with the material I need for my video. Thanks King", "start": 166.329, "duration": 4.67}, {"text": "What is wrong? A capacitor is a two terminal component: if charges come in from one side", "start": 171.34, "duration": 5.36}, {"text": "The opposing charges need to get in from the other side. The way King jr. Is doing it", "start": 176.7, "duration": 5.039}, {"text": "it is still getting charged but not as the capacitor it is but as", "start": 181.739, "duration": 3.6}, {"text": "Anything can pick up charge like this PVC pipe the outer", "start": 185.59, "duration": 3.199}, {"text": "Surface likes to become positive because the negative charges on the inside of the bottle repel the electrons on the outer surface", "start": 188.89, "duration": 6.86}, {"text": "But they have nowhere to go until he touches the surface", "start": 195.75, "duration": 2.94}, {"text": "Try grabbing the foil and then touching the nail to see if I get a shock", "start": 198.94, "duration": 3.47}, {"text": "Oh? I got a shock just from the foil", "start": 203.709, "duration": 2.99}, {"text": "That's not how it's normally supposed to go", "start": 207.31, "duration": 1.94}, {"text": "But so now the jar has a chance to give out some of its electrons to King Junior's body and become positive", "start": 209.25, "duration": 6.54}, {"text": "while King jr", "start": 216.37, "duration": 1.399}, {"text": "becomes more negatively charged", "start": 217.769, "duration": 2.0}, {"text": "now when he touches the center of the Leyden jar", "start": 220.08, "duration": 3.119}, {"text": "The discharge is not too great because both the center and his body are charged negatively and the remaining energy dissipates through his body.", "start": 223.2, "duration": 7.68}, {"text": "There was a little bit. Oh, a little bit of a shock. Let me show you how to do it properly", "start": 232.69, "duration": 4.61}, {"text": "The outer surface is connected to earth which is also connected through this wire to my body and grounds my body", "start": 237.34, "duration": 6.139}, {"text": "I hold the towel in one hand like this and", "start": 243.6, "duration": 2.759}, {"text": "Rub the PVC pipe against it while passing it over the center of the Leyden jar like this", "start": 247.27, "duration": 5.959}, {"text": "now when I do this the PVC pipe picks up negative charges and places them at the center of the Leyden jar which repels the", "start": 254.05, "duration": 7.249}, {"text": "Electrons on the outer surface into Earth the towel becomes positive", "start": 261.31, "duration": 3.98}, {"text": "So it sucks electrons from earth through my body and becomes neutral again", "start": 265.29, "duration": 4.259}, {"text": "So next time when I pass the PVC through it", "start": 269.55, "duration": 2.97}, {"text": "it can send more charges through. It's basically like I am pumping charges into the capacitor [gets shocked]", "start": 272.52, "duration": 6.66}, {"text": "I'll have to hold my hand a little bit further", "start": 281.74, "duration": 2.0}, {"text": "This is very much the same way a Van de Graaff machine works. Do you hear the charges going in?", "start": 283.96, "duration": 5.33}, {"text": "Okay, let's see if it picked up any charge. [gets shocked more intensely]", "start": 292.44, "duration": 6.48}, {"text": "I forgot to unground myself", "start": 299.56, "duration": 2.0}, {"text": "That was painful", "start": 301.75, "duration": 1.47}, {"text": "No more touching with hand. I made another grounded ball to discharge it. Let's try the different number of strokes", "start": 303.22, "duration": 6.26}, {"text": "I made it darker too, so you can see the arc", "start": 309.69, "duration": 2.79}, {"text": "Okay ten strokes", "start": 314.569, "duration": 2.0}, {"text": "Yeah a little bit. That looked like a one kilovolt discharge", "start": 317.749, "duration": 3.74}, {"text": "Here's 20 strokes", "start": 323.93, "duration": 2.0}, {"text": "Not bad was probably around five kilo volts", "start": 326.72, "duration": 2.48}, {"text": "and here's 50 strokes", "start": 331.8, "duration": 1.54}, {"text": "Wow that was strong maybe around 10 kilovolts", "start": 333.94, "duration": 4.14}, {"text": "Okay hundred strokes", "start": 340.36, "duration": 2.0}, {"text": "Whoa-ho-ho", "start": 342.92, "duration": 1.76}, {"text": "That was like fifteen sixteen kilovolts. And then the King junior tried to charge his Leyden jar using one of those plasma globes", "start": 344.68, "duration": 7.7}, {"text": "Which is very much the same as a Tesla coil, and that wont work either", "start": 352.38, "duration": 4.42}, {"text": "nothing", "start": 357.76, "duration": 1.2}, {"text": "Nothing whatsoever", "start": 358.969, "duration": 1.47}, {"text": "the reason is simple something like a Tesla coil outputs high frequency AC arcs while a", "start": 360.439, "duration": 5.27}, {"text": "Capacitor shorts AC so there wouldn't be any charge buildup on the capacitor", "start": 366.02, "duration": 5.179}, {"text": "Now I want to see how much current it can send through my body", "start": 371.199, "duration": 2.67}, {"text": "So I'm gonna use a one ohm shunt resistor in series with my body", "start": 373.87, "duration": 3.539}, {"text": "so every volt is one amp and twenty strokes or around five kilo volts and measure across the shunt", "start": 377.409, "duration": 7.32}, {"text": "using my scope", "start": 384.979, "duration": 1.951}, {"text": "Okay, twenty strokes, of course", "start": 386.93, "duration": 2.179}, {"text": "This is not going to be super accurate due to the line inductances and the fast nature of the discharge but we'll see", "start": 389.109, "duration": 6.251}, {"text": "Okay ready", "start": 397.92, "duration": 1.06}, {"text": "[agonized yelp] oh ****", "start": 400.06, "duration": 2.16}, {"text": "Wow, it hurts where it goes in and where it goes out to the ground", "start": 402.68, "duration": 3.88}, {"text": "Of course, this is much worse because it's capacitance is around five times larger than a regular discharge a  human body experiences", "start": 406.759, "duration": 6.889}, {"text": "So the duration of the pulse is much longer and a five kilo volt on this one can hurt as much as twenty five", "start": 413.649, "duration": 6.15}, {"text": "kilo volt of a regular discharge", "start": 419.8, "duration": 1.769}, {"text": "I like King junior or senior. Try this one", "start": 421.569, "duration": 3.089}, {"text": "and if you look at the plot you see there is a", "start": 424.659, "duration": 2.04}, {"text": "faster spike of up to 12 amps through my body and then the current stays around five amps and", "start": 426.88, "duration": 5.92}, {"text": "discharges slowly to zero in around seven microseconds", "start": 433.26, "duration": 4.08}, {"text": "Here's the screenshot if you want to see more accurately. So although the voltage and current are super high", "start": 437.629, "duration": 5.45}, {"text": "I'm saved by the fact that the pulse duration is very short", "start": 443.08, "duration": 3.569}, {"text": "So the energy is limited. If the voltage is high the current is high. Now this capacitor works", "start": 446.649, "duration": 5.47}, {"text": "but it's a piece of junk. Why? Because every capacitor has an equivalent series resistance or ESR that we try to minimize", "start": 452.12, "duration": 7.47}, {"text": "But this guy has a huge one. The huge ESR contributor of this Leyden jar is the awful", "start": 459.9, "duration": 6.049}, {"text": "conductivity of salt water if I [gets zapped]", "start": 466.2, "duration": 2.08}, {"text": "[curses]", "start": 468.7, "duration": 2.0}, {"text": "Forgot to discharge the damn thing. Let's open it. Now if I measure the resistance between the salt water and the top ball", "start": 470.8, "duration": 7.02}, {"text": "Around three to four kilo-ohms. It's huge compared to regular capacitors with milli-ohm ESR.", "start": 478.89, "duration": 6.95}, {"text": "Now I want to make a high voltage high-capacity low ESR capacitor and for that I bought this which is a desk cover made of \"material\"", "start": 485.84, "duration": 8.9}, {"text": "I suppose it's some sort of mylar or something", "start": 494.98, "duration": 2.34}, {"text": "I cut two sheets out of it and hopefully there are no punctures on it", "start": 497.33, "duration": 3.6}, {"text": "Otherwise the high voltage will always find a way and arc through and ruin the voltage rating", "start": 500.93, "duration": 4.44}, {"text": "I also cut two sheets of aluminum foil half an inch shorter than the mylar on each side and I'll glue it on the mylar", "start": 505.37, "duration": 6.6}, {"text": "I put some glue on and spread it in a very thin layer", "start": 511.97, "duration": 4.289}, {"text": "Then I stitch my aluminum foil on right at the center", "start": 519.39, "duration": 3.83}, {"text": "And make sure it's completely flat and thin", "start": 525.279, "duration": 3.45}, {"text": "Very nice", "start": 530.93, "duration": 1.769}, {"text": "Then I just tape a piece of flattened wire like this to one corner of this sheet", "start": 532.699, "duration": 6.559}, {"text": "Then I flip it around and glue the next sheet of aluminum right behind the first one", "start": 539.42, "duration": 3.979}, {"text": "Now I tape another wire to the opposite corner of the first wire on the second sheet", "start": 546.549, "duration": 5.63}, {"text": "Okay, we have our basic capacitor, let's measure its capacity", "start": 553.779, "duration": 3.469}, {"text": "At around 5 nano-farad you're already ahead. But now we'll roll this tight this way", "start": 558.639, "duration": 5.84}, {"text": "the layers will overlap multiple times increasing the capacitance much more", "start": 564.48, "duration": 5.009}, {"text": "But now that I think about it rolling it should only bring the outer surface of one", "start": 572.589, "duration": 4.339}, {"text": "Beside the outer surface of the other one. So double the surface area and double the capacitance. Am I wrong? Let's check it.", "start": 577.02, "duration": 7.2}, {"text": "Crap, I totally forgot first I had to put this second layer of mylar. Otherwise, I would short the two layers", "start": 584.42, "duration": 6.2}, {"text": "and now we roll again", "start": 591.66, "duration": 2.24}, {"text": "Ok, let's see what we've got. There you go much smaller than the Leyden jar and it's capacity is", "start": 594.999, "duration": 6.38}, {"text": "around 10 nano farad much more than the Leyden jar and I think it can still do upwards of 10 to 20 kilo volts", "start": 602.559, "duration": 6.559}, {"text": "This will take forever to charge using my PVC pipe though being almost 10 times my Leyden jar if this took 20 strokes to get", "start": 609.119, "duration": 7.65}, {"text": "A decent arc. This will take around 200", "start": 616.769, "duration": 2.369}, {"text": "Well, I can charge it to 2,000 volts using my microwave transformer through a puny single diode rectifier", "start": 619.139, "duration": 5.7}, {"text": "Let's give it a try", "start": 625.569, "duration": 2.0}, {"text": "Okay, is it charged?", "start": 629.03, "duration": 2.0}, {"text": "Let's see", "start": 631.16, "duration": 1.83}, {"text": "Ouh it is charged! Well not big enough, though", "start": 632.99, "duration": 3.53}, {"text": "I really wish I had a Van de Graaff machine so I could charge it to a million volt or more", "start": 636.52, "duration": 4.38}, {"text": "Maybe I should make one of those", "start": 640.9, "duration": 1.87}, {"text": "[GIVEAWAY TIME]", "start": 642.77, "duration": 2.0}, {"text": "The good people at circuit specialists have provided two hantek scopes to give away to my patrons and viewers", "start": 644.9, "duration": 5.719}, {"text": "I have used this scope briefly before and have seen good feedbacks about it, too", "start": 650.62, "duration": 4.44}, {"text": "So if you are also into scoping curves", "start": 655.06, "duration": 2.219}, {"text": "You can become my patron at patreon.com or sign up from the link in the description for free", "start": 657.28, "duration": 5.16}, {"text": "It is on sale for [very low price]. So, you know how much you can learn by seeing actual waveforms. Do you?", "start": 662.44, "duration": 6.39}, {"text": "[pch puttaputta pch puttaputta pu-pch]", "start": 669.38, "duration": 1.96}, {"text": "[pch puttaputta pch puttaputta pu-pch]", "start": 671.4, "duration": 2.04}, {"text": "[pch puttaputta pch puttaputta pch putta-pch puttaputta pch pu-pch]", "start": 673.46, "duration": 4.14}]