[{"text": "Tunnels play an important role in our constructed\nenvironment as passageways for mines, conveyance", "start": 0.12, "duration": 5.36}, {"text": "for utilities, and routes for transportation.\nBut, excavating a tunnel underground in unstable", "start": 5.48, "duration": 6.46}, {"text": "material can lead to some dangerous situations,\nlike the 2010 mining accident in Chile when", "start": 11.94, "duration": 5.78}, {"text": "33 men were trapped deep in subsurface for\nmore than 2 months. Hey I’m Grady, and this", "start": 17.72, "duration": 6.2}, {"text": "is Practical Engineering. On today’s episode\nwe’re talking how engineers stabilize tunnel", "start": 23.92, "duration": 5.42}, {"text": "excavations to keep them from collapsing.", "start": 29.36, "duration": 2.8}, {"text": "This video is sponsored by Dollar Shave Club - more on that later.", "start": 43.209, "duration": 5.501}, {"text": "Rocks are heavy. That may seem self-evident,\nlike many fundamental principles of civil", "start": 48.71, "duration": 5.41}, {"text": "engineering. But when you build things underground,\nit starts to become a major consideration.", "start": 54.12, "duration": 5.7}, {"text": "Just like atmospheric pressure is created\nby the weight of air molecules pressing down", "start": 59.82, "duration": 4.21}, {"text": "on each other, pressure exists in the subsurface\nof the Earth from the weight of the soil and", "start": 64.03, "duration": 4.56}, {"text": "rock above. This pressure compresses the material\nin the subsurface more and more the further", "start": 68.59, "duration": 5.77}, {"text": "down you go. Building a horizontal passageway,\nor a tunnel, through this material, interrupts", "start": 74.36, "duration": 6.08}, {"text": "the flow of these compressive forces. Just\nlike if you remove a column from a building,", "start": 80.44, "duration": 5.87}, {"text": "excavating a tunnel takes away the support\nfrom the material above. Where you once had", "start": 86.31, "duration": 4.83}, {"text": "compression throughout the subsurface, now\nyou’ve created a zone of tensile stress,", "start": 91.14, "duration": 4.79}, {"text": "where the material above the tunnel is trying\nto pull away from itself.", "start": 95.93, "duration": 4.54}, {"text": "Many materials react differently to tension\nthan they do to compression, and soil and", "start": 100.47, "duration": 4.25}, {"text": "rock are no different. You can imagine soil\nas a collection of individual particles. The", "start": 104.72, "duration": 5.851}, {"text": "only reason a soil mass has any strength at\nall is because of the friction between those", "start": 110.571, "duration": 4.709}, {"text": "particles. But friction is a function of the\nforce pressing the particles together. So,", "start": 115.28, "duration": 4.83}, {"text": "if you instead reverse that force and pull\nthe particles apart, the soil loses all its", "start": 120.11, "duration": 5.86}, {"text": "strength. Some soils, like clay, do have a\ncertain amount of natural attraction between", "start": 125.97, "duration": 5.739}, {"text": "the particles, called cohesion, but it’s\nnot enough on its own to resist significant", "start": 131.709, "duration": 4.411}, {"text": "forces. In other words, you can’t make a\nrope out of soil - it has no strength against", "start": 136.12, "duration": 5.55}, {"text": "tension. If you build a tunnel in soil, you\nhave to replace the support you removed with", "start": 141.67, "duration": 5.28}, {"text": "some other way to transfer the load of the\nsoil above. This is why many tunnels are lined", "start": 146.95, "duration": 5.659}, {"text": "with materials like steel or concrete, to\nprovide support to the tunnel walls and transfer", "start": 152.609, "duration": 4.771}, {"text": "the stresses in the subsurface around the\ntunnel. These lining systems add a major cost", "start": 157.38, "duration": 5.46}, {"text": "to the tunnel construction.", "start": 162.84, "duration": 1.61}, {"text": "Rock, on the other hand, behaves a little\nbit differently in that it does have some", "start": 164.45, "duration": 4.42}, {"text": "tensile strength. You could make a rope from\nit. Not that it would be particularly useful,", "start": 168.87, "duration": 4.38}, {"text": "but it’s a good way to imagine the difference\nbetween soil and rock mechanics. In fact rock", "start": 173.25, "duration": 5.459}, {"text": "generally has more strength than soil for\nall types of stress. This additional strength", "start": 178.709, "duration": 5.17}, {"text": "gives rock the ability to transfer forces\naround a tunnel just like the lining discussed", "start": 183.879, "duration": 4.911}, {"text": "before. But, it’s not as simple as saying\ntunnels in soil require support and tunnels", "start": 188.79, "duration": 4.9}, {"text": "in rock don’t. Geologists use the term “massive”\nto describe rock that is uniform without layers", "start": 193.69, "duration": 5.9}, {"text": "or joints. Unfortunately, not all rock is\nmassive. In fact, most geologic units of rock", "start": 199.59, "duration": 6.489}, {"text": "in the subsurface have at least some amount\nof jointing, or natural breaks. In many cases,", "start": 206.079, "duration": 5.641}, {"text": "the jointing of rock follows specific patterns\nthat can be observed and mapped. But, the", "start": 211.72, "duration": 5.22}, {"text": "problem with joints is that they have no tensile\nstrength, and so no ability to transfer tensile", "start": 216.94, "duration": 5.24}, {"text": "stress. You can see that jointed rock starts\nto behave more like a soil just with much", "start": 222.18, "duration": 4.94}, {"text": "larger particles. So, even tunnels through\nrock often require some type of support to", "start": 227.12, "duration": 5.86}, {"text": "prevent collapse.", "start": 232.98, "duration": 1.339}, {"text": "But, what if there was a way to take advantage\nof the superior strength of rock without going", "start": 234.319, "duration": 4.95}, {"text": "to the added trouble and expense of lining\nthe tunnel to provide support? Well it turns out there is.", "start": 239.28, "duration": 5.2}, {"text": "Rock bolts are a type of reinforcement\nfor stabilizing rock excavations, usually", "start": 251.68, "duration": 5.2}, {"text": "made from steel bars or bolts. I built this\ndemonstration to show how they work. This", "start": 256.88, "duration": 5.23}, {"text": "is essentially the frame of a table, but the\ntop is completely open. I attached a bottom", "start": 262.11, "duration": 5.5}, {"text": "to the frame to represent temporary shoring\nof a tunnel roof. Even though our permanent", "start": 267.61, "duration": 5.36}, {"text": "support system doesn’t rely on this, it’s\nnecessary until we get the rock bolts installed.", "start": 272.97, "duration": 5.69}, {"text": "My rock bolts are just actual bolts with large\nfender washers to spread out the load. You", "start": 278.66, "duration": 5.31}, {"text": "can see that I spaced them out in a nice grid\npattern. Actual rock bolts are similarly installed", "start": 283.97, "duration": 5.5}, {"text": "in a pattern along a tunnel.", "start": 289.47, "duration": 2.9}, {"text": "For the rock material of the tunnel roof,\nI’m using gravel. Of course, there are a", "start": 292.37, "duration": 4.28}, {"text": "few differences from the real world and my\ndemonstration here. First, in the real world,", "start": 296.65, "duration": 4.87}, {"text": "the rock is there first. We don’t get the\nconvenience of adding the rock after the tunnel", "start": 301.52, "duration": 4.22}, {"text": "is already in place. Real rock bolts are installed\nby drilling into the native material. The", "start": 305.74, "duration": 5.899}, {"text": "other difference is the scale. Although there\nisn’t a fine line between soil and rock", "start": 311.639, "duration": 4.441}, {"text": "mechanics, gravel really falls into the soil\nside. It would never be feasible to use this", "start": 316.08, "duration": 5.66}, {"text": "many rock bolts just to stabilize a gravel\nmass. Rock bolts are most feasible when you’re", "start": 321.74, "duration": 6.63}, {"text": "tunneling through jointed rock where you can\nput a little more space between the bolts,", "start": 328.37, "duration": 4.389}, {"text": "but this demo is just to show that it can\nbe done.", "start": 332.759, "duration": 3.071}, {"text": "To tension the rock bolts, I tightened washers\nand nuts onto each one. Another obvious difference", "start": 335.83, "duration": 5.489}, {"text": "between my demo and the real world is that\nwe don’t normally having access to the top", "start": 341.319, "duration": 4.111}, {"text": "of the bolts to add nuts and washers. Instead,\nthe rock bolts are secured at their ends by", "start": 345.43, "duration": 4.94}, {"text": "some other method. Two of the most common\nmethods of anchoring are a wedge device and", "start": 350.37, "duration": 5.68}, {"text": "pumping in grout. It’s very similar to putting\nan anchor in concrete or even hanging a picture", "start": 356.05, "duration": 5.459}, {"text": "frame in drywall. Once the bolts were tensioned,\nit was time to remove the temporary bottom.", "start": 361.509, "duration": 5.78}, {"text": "You can see I lost a little bit of gravel\nbetween the rock bolts, but the majority of", "start": 367.289, "duration": 3.661}, {"text": "the rock is spanning gap. I’ve essentially\ncreated a bridge made from gravel. But you", "start": 370.95, "duration": 5.469}, {"text": "know that supporting its own weight isn’t\nexciting enough for this channel. So I decided", "start": 376.419, "duration": 4.06}, {"text": "to put my own safety on the line as a test\nsubject. The rockbolted gravel could support", "start": 380.479, "duration": 4.72}, {"text": "my weight, even with a few hops. You can see\nthings flexing a bit underneath, but the simulated", "start": 385.199, "duration": 5.56}, {"text": "tunnel ceiling held strong. There are lot\nof ways to conceptualize what’s happening", "start": 390.759, "duration": 9.91}, {"text": "here. At the most basic level, the bolts are\ncreating a continuous zone of compression", "start": 400.669, "duration": 5.231}, {"text": "in the gravel. I’ve taken a fractured rock\nmass and knitted it back together, giving", "start": 405.9, "duration": 5.019}, {"text": "it the ability to resist tensile stress. This\nis very similar to post-tensioned reinforcement", "start": 410.919, "duration": 5.571}, {"text": "used in some concrete structures.", "start": 416.49, "duration": 1.739}, {"text": "Like I mentioned before, trying to support\na gravel ceiling using rockbolts isn’t the", "start": 418.229, "duration": 5.051}, {"text": "most appropriate use. They do have their limitations.\nBut, this simple construction method dramatically", "start": 423.28, "duration": 6.45}, {"text": "reduces the cost of making tunnels through\nrock safe from collapse. And public safety", "start": 429.73, "duration": 5.26}, {"text": "is priority number one for civil engineers.\nDo you have questions about tunnels or any", "start": 434.99, "duration": 5.01}, {"text": "other topic in engineering? If so, post it\nin the comments below. Thank you for watching", "start": 440.0, "duration": 5.099}, {"text": "and let me know what you think.", "start": 445.099, "duration": 4.681}, {"text": "Thanks to Dollar Shave Club for sponsoring\nthis video. Just about every video topic on", "start": 449.78, "duration": 5.33}, {"text": "this channel was first conceived in the shower.\nIt’s the perfect combination of monotony", "start": 455.11, "duration": 5.839}, {"text": "and absence of distractions that my brain\nneeds to be creative. The very last thing", "start": 460.949, "duration": 5.21}, {"text": "I want to try and remember in the shower is\nwhether I need more soap or shaving cream.", "start": 466.159, "duration": 4.831}, {"text": "Dollar Shave Club is pretty much a a one-stop\nshop for grooming products: everything you", "start": 470.99, "duration": 4.28}, {"text": "need to look, feel, and smell your best delivered\nright to your doorstep at a frequency that", "start": 475.27, "duration": 5.41}, {"text": "you choose, and for much cheaper than the\ngrocery store prices. This is the stuff I", "start": 480.68, "duration": 5.0}, {"text": "got in my first box - it’s not just razors.\nSupport Practical Engineering and get your", "start": 485.68, "duration": 5.509}, {"text": "Daily Essentials Starter Set from Dollar Shave\nClub for only $5 by visiting the link in the", "start": 491.189, "duration": 5.651}, {"text": "description below. Get it for yourself, or\ngive it as gift to a friend. That’s Dollarshaveclub.com/practicalengineering.", "start": 496.84, "duration": 6.43}, {"text": "Again, thank you for watching, and let me\nknow what you think.", "start": 503.27, "duration": 4.789}]