[{"text": "This guy took a package from my porch and now he's about to open it in his car", "start": 0.0, "duration": 3.78}, {"text": "But what he doesn't know is this is a custom-built bait package that is recording him on four different cameras", "start": 3.78, "duration": 4.8}, {"text": "And it's about to unleash a pound of the world's finest glitter along with some other surprises.", "start": 8.58, "duration": 4.05}, {"text": "But to understand how he got to this point first. We need to rewind a bit.", "start": 12.63, "duration": 3.239}, {"text": "About seven months ago, I noticed a package being reported as delivered but it never arrived.", "start": 17.199, "duration": 4.25}, {"text": "So when I checked our security cameras, I noticed this lovely couple out for a stroll.", "start": 21.449, "duration": 4.68}, {"text": "As you can see, they have backpacks on and they're just going around the neighborhood", "start": 33.28, "duration": 3.38}, {"text": "making an afternoon out of this.", "start": 36.94, "duration": 1.58}, {"text": "If you ever been in a situation like this,", "start": 38.52, "duration": 1.77}, {"text": "you just sort of feel violated. And then I took this to the police and even with the video evidence,", "start": 40.29, "duration": 4.829}, {"text": "they said it's just not worth their time to look into -  so then you also feel powerless and I just felt like", "start": 45.25, "duration": 4.849}, {"text": "something needs to be done to take a stand against dishonest punks like this. And then I was like: hold up,", "start": 50.26, "duration": 5.45}, {"text": "I built a dartboard that moves to get a bulls-eye every time. I spent nine years designing hardware that's currently roving around on another freaking", "start": 55.739, "duration": 7.889}, {"text": "planet. if anyone was going to make a revenge bait package and over-engineer the crap out of it,", "start": 63.629, "duration": 5.069}, {"text": "it was going to be me.", "start": 68.7, "duration": 1.14}, {"text": "So I started with a sketch and some CAD and then I hit up my buddy Sean who is really good with this type of", "start": 69.84, "duration": 4.529}, {"text": "small electronic stuff, and we got to work. Ultimately, when they open the package", "start": 74.369, "duration": 4.41}, {"text": "I just wanted to celebrate their choice of profession with a cloud of glitter because, I mean, who doesn't love glitter?", "start": 78.81, "duration": 6.419}, {"text": "That's easy. I could just do that passively with like a spring when it opens", "start": 85.299, "duration": 4.61}, {"text": "But I also wanted to record their reaction and that's what makes the engineering here an order of magnitude more", "start": 89.909, "duration": 4.95}, {"text": "difficult because if you think about it", "start": 94.93, "duration": 1.31}, {"text": "This thing has to sit on a porch all day and it can't be plugged in and you have no idea when someone will come", "start": 96.24, "duration": 5.22}, {"text": "And pick this up", "start": 101.46, "duration": 0.659}, {"text": "so it's not like you could just hit record on the camera and then put it in the box because you're gonna run out of", "start": 102.119, "duration": 4.17}, {"text": "battery and storage space on top of that", "start": 106.29, "duration": 2.43}, {"text": "I need some way to recover this footage in case I never get the big package back so after six months and lots of design", "start": 108.72, "duration": 5.939}, {"text": "Iterations and so much testing here's where we landed", "start": 114.7, "duration": 3.529}, {"text": "This custom printed circuit board is the brains of the operation", "start": 122.42, "duration": 2.449}, {"text": "It has a built-in accelerometer", "start": 125.18, "duration": 1.38}, {"text": "And when it's jostle that will check the GPS signal to see if it's been moved from the porch", "start": 126.56, "duration": 4.22}, {"text": "and if so", "start": 130.78, "duration": 0.63}, {"text": "It sends a signal to all the phones to wake up and start recording and I'm using four phones that have a wide-angle", "start": 131.41, "duration": 5.279}, {"text": "Filming mode and are angled back and this 3d printed portion is contoured this way because it represents the field of view of the phones", "start": 136.91, "duration": 6.649}, {"text": "So as you can see", "start": 143.78, "duration": 1.16}, {"text": "I'm guaranteed to capture their reaction no matter which way they open it from and nestled in here", "start": 144.94, "duration": 4.829}, {"text": "We've got a can of fart spray. No joke, you can clear a room with one spray of this stuff", "start": 149.769, "duration": 4.68}, {"text": "so we made a cam on a small motor that sprays it five times and not only is this just a nice touch but we", "start": 154.45, "duration": 5.699}, {"text": "Keep repeating five sprays every 30 seconds until they throw the package out of their car or house", "start": 160.15, "duration": 5.399}, {"text": "Before they realize there's four phones inside this", "start": 165.65, "duration": 2.75}, {"text": "Increases our chances of finding it because we always know the package location at all times due to the GPS on the phones", "start": 168.5, "duration": 5.899}, {"text": "But even if we don't recover it all four phones have LTE data plans", "start": 174.4, "duration": 3.96}, {"text": "So they upload the footage to the cloud so I can still see what happened", "start": 178.36, "duration": 3.119}, {"text": "And then for the pièce de résistance we have a cup here on top that spins from a motor underneath", "start": 181.48, "duration": 5.009}, {"text": "So once you load in a but ton of the world's finest glitter the motor spins really fast and the centrifugal force", "start": 186.5, "duration": 5.329}, {"text": "Fires it evenly in all directions. Let me cut holes on the side of the lid and cover them with one-way film", "start": 191.989, "duration": 4.91}, {"text": "so two of the cameras can see them as they walked away and then finally to make it look like an actual delivered package we", "start": 196.9, "duration": 5.22}, {"text": "Added some shrink wrap and a delivery label", "start": 202.12, "duration": 2.25}, {"text": "Which is perhaps my favorite part of the whole thing because if the thief wasn't in such a hurry", "start": 204.37, "duration": 4.44}, {"text": "They'd see that the package is actually coming from my childhood hero and inspiration for this project Kevin McCallister. I", "start": 208.82, "duration": 6.769}, {"text": "Even looked up and amusing the address of the actual house", "start": 220.73, "duration": 3.11}, {"text": "They filmed the movie in and of course it's being shipped to his boys", "start": 223.84, "duration": 3.269}, {"text": "Harry and Marv and there's a charge port in the bottom because if it doesn't get stolen in a given day I can bring it", "start": 227.329, "duration": 5.9}, {"text": "In and then recharge all the batteries in the system overnight", "start": 233.23, "duration": 2.55}, {"text": "So the idea is the bad guy comes and takes it off your porch then lifts the lid and these two limit switches", "start": 235.78, "duration": 4.979}, {"text": "Tell the circuit board brain inside that the lids been removed", "start": 240.76, "duration": 3.36}, {"text": "and then that sets everything in motion and I may be biased but sometimes a well engineered design is", "start": 244.22, "duration": 5.309}, {"text": "beautiful", "start": 250.05, "duration": 2.0}, {"text": "And because the phones have GPS we created a virtual geo fence around my house", "start": 277.62, "duration": 3.8}, {"text": "So I get a notification when the package has been moved off the property", "start": 281.63, "duration": 2.7}, {"text": "So I put it out on the porch and now all that was left to do was wait", "start": 284.33, "duration": 3.389}, {"text": "Okay, so I was at work and I got a notification that the Geo fence we set up had been tripped", "start": 290.13, "duration": 4.669}, {"text": "So then I checked the cameras and sure enough. The package is gone", "start": 294.84, "duration": 2.869}, {"text": "So I checked the GPS and sort of tracked it and it appears there in a car because they seem to leave my house", "start": 297.71, "duration": 5.88}, {"text": "Pretty quickly, but it seems to have stopped in a parking garage", "start": 303.84, "duration": 3.29}, {"text": "Which is where I'm headed to now and if you're new here, this isn't a prank channel", "start": 307.73, "duration": 3.66}, {"text": "So I am completely out of my comfort zone", "start": 311.39, "duration": 2.099}, {"text": "And there she is", "start": 315.15, "duration": 2.089}, {"text": "This is like recovering the black box of a crashed airplane it would still work", "start": 327.289, "duration": 4.609}, {"text": "even if I didn't get the box back that footage would upload to the cloud but it's just faster to plug the phones in so", "start": 331.899, "duration": 5.01}, {"text": "I'm gonna go home and find out how this", "start": 336.909, "duration": 2.0}, {"text": "Somehow ended up here. So it appears he was walking down the sidewalk and then suddenly makes a hard left", "start": 339.709, "duration": 5.54}, {"text": "Then he takes the package and gets in his car and eventually makes it to this parking garage where this glorious sequence unfolds", "start": 346.669, "duration": 7.07}, {"text": "My car dude everything oh my god", "start": 374.119, "duration": 5.779}, {"text": "My friend Cece has also had some packages stolen so she has to leave it on her porch for a few days to", "start": 385.219, "duration": 4.97}, {"text": "So the moral of the story is just don't take other people's stuff", "start": 563.15, "duration": 3.26}, {"text": "Not only is it not cool, but on the plus side, you'll never find yourself in this situation or perhaps even worse this one", "start": 566.54, "duration": 6.619}, {"text": "Who you had?", "start": 574.64, "duration": 2.0}, {"text": "This video was all about protecting your packages from bad guys with this six-month over-engineered monstrosity, but lucky for you", "start": 579.57, "duration": 6.559}, {"text": "It's way easier to protect yourself from online bad guys", "start": 586.13, "duration": 3.21}, {"text": "Thanks to the fine folks at Nord VPN who also happened to be supporting this video as you know", "start": 589.34, "duration": 4.649}, {"text": "VPN stands for virtual private network", "start": 594.12, "duration": 2.27}, {"text": "so you could surf the web anonymously your", "start": 596.39, "duration": 2.0}, {"text": "Location stays private and your data is encrypted and even though I'm not a bad guy with something to hide", "start": 598.44, "duration": 4.22}, {"text": "I generate a spinning glitter cup of data online every day", "start": 602.66, "duration": 3.839}, {"text": "which I would prefer not to be used against me like you reading a lot of the news stories lately and as a bonus if", "start": 606.54, "duration": 4.73}, {"text": "You ever get a message about a video not being available in your country technically", "start": 611.27, "duration": 3.69}, {"text": "Which is the click of a mouse your computer can virtually teleport to any country", "start": 614.96, "duration": 3.899}, {"text": "you want", "start": 618.86, "duration": 0.49}, {"text": "cry an or view P n is the best because they're super fast with", "start": 619.35, "duration": 3.38}, {"text": "Thousands of servers across the globe and they also have Apple and Android apps for mobile browsing which are free with your account", "start": 622.8, "duration": 5.179}, {"text": "So if you travel internationally or give in today's headlines, you're ready to start taking your privacy more seriously", "start": 627.98, "duration": 4.89}, {"text": "You can go to Noor VPN comm slash mark Grover or use the link in the video description", "start": 632.87, "duration": 3.78}, {"text": "for 75% off their three year plans", "start": 636.99, "duration": 2.69}, {"text": "So, it's Nord VPN comm slash mark Grover", "start": 639.92, "duration": 2.67}, {"text": "And if you use the code marker over at checkout, they'll know I sent you and they'll give you an extra month free", "start": 642.59, "duration": 4.769}, {"text": "Thanks for watching", "start": 647.4, "duration": 2.0}]