[{"text": "Sad friend: Oh my God Dom! My boyfriend stood me up last minute to hang out with his friends again for the tenth time this week", "start": 0.06, "duration": 7.74}, {"text": "Dom: Hmm", "start": 8.41, "duration": 1.14}, {"text": "Dom: Maybe you should break up with him", "start": 9.55, "duration": 1.91}, {"text": "Sad friend: Oh my God dom my boyfriend keeps talking about other girls and comparing me to them", "start": 11.46, "duration": 7.56}, {"text": "Dom: hmm", "start": 19.1, "duration": 0.76}, {"text": "Dom: Maybe you should break up with him.", "start": 19.86, "duration": 2.46}, {"text": "Sad friend: (sniff) OH (sniff) MY GOD DOM (sniff)", "start": 22.34, "duration": 2.44}, {"text": "Sad friend: I walked in on two girls and an old bald man on top of my boyfriend on our four-year anniversary (starts to cry)", "start": 24.9, "duration": 7.94}, {"text": "Dom: Wow, amazing.", "start": 34.22, "duration": 1.34}, {"text": "It was almost as if there were no signs that foreshadowed this", "start": 35.6, "duration": 3.74}, {"text": "you dumb bitch", "start": 39.56, "duration": 1.62}, {"text": "Intro music (yay!)", "start": 41.44, "duration": 3.96}, {"text": "Dom: BREAK UPS", "start": 45.94, "duration": 0.8}, {"text": "AND WHY THEY AREN'T ALWAYS A BAD THING", "start": 46.74, "duration": 2.28}, {"text": "Yeah, yeah, I know valentine's day wasn't too long ago,", "start": 49.54, "duration": 3.38}, {"text": "and many people celebrated their love for one another and their partners", "start": 53.0, "duration": 2.9}, {"text": "But I feel like we got to give some attention to the not so healthy relationships", "start": 55.9, "duration": 3.86}, {"text": "And I'mma bet that a lot of you watching are probably in one.", "start": 59.76, "duration": 3.2}, {"text": "YEAH! That's right! I'll be inducing some breakups! Let's go! (claps self)", "start": 63.14, "duration": 2.88}, {"text": "Random commenter: Oh my God, Dom that's so heartless.", "start": 66.18, "duration": 2.3}, {"text": "Just because you've been through some bad breakups doesn't mean other should too.", "start": 68.48, "duration": 3.74}, {"text": "Dom: So you're saying that even though. They're in a bad relationship", "start": 73.1, "duration": 2.38}, {"text": "Were either or both of them don't feel any form of fulfillment or growth with their partner", "start": 75.52, "duration": 4.639}, {"text": "They should stay together for the sake of preserving a toxic relationship and avoiding a breakup", "start": 80.159, "duration": 4.95}, {"text": "Just because it's a sad thing to happen", "start": 85.109, "duration": 2.351}, {"text": "Funny story someone actually contacted me one time is tell me that his girlfriend broke up with him after watching one of my videos", "start": 88.12, "duration": 4.66}, {"text": "And I just thought oh, that's pretty unfortunate. Sorry dude", "start": 93.04, "duration": 3.289}, {"text": "but if she was so influenced by my stories to reflect on her own relationship", "start": 96.509, "duration": 3.33}, {"text": "And make a judgement based on that reflection then either", "start": 100.21, "duration": 2.9}, {"text": "she came to some sort of realization that you guys probably aren't compatible", "start": 103.11, "duration": 3.55}, {"text": "or she failed to interpret my content as rhetorical and jump to a conclusion", "start": 106.66, "duration": 4.04}, {"text": "Without properly discussing it with you.", "start": 110.76, "duration": 2.64}, {"text": "To which I say good riddance my dude. You deserve better. I'm sure most of you", "start": 113.54, "duration": 3.0}, {"text": "I'm sure most of you have a friend or know someone who's just honestly in a shit show of a relationship", "start": 116.56, "duration": 4.04}, {"text": "I commonly [see] this problem with my girl friends,", "start": 120.6, "duration": 2.26}, {"text": "friends whom are girls", "start": 122.94, "duration": 1.16}, {"text": "But guys also get their fair share of the abuse I empathize with them", "start": 124.11, "duration": 3.659}, {"text": "And I want to help because I've been in some pretty bad relationships, but I probably should have broken off sooner", "start": 127.77, "duration": 4.56}, {"text": "But since I was too stubborn to let it end early", "start": 132.33, "duration": 2.279}, {"text": "I wanted to keep giving second chances that weren't necessarily deserved when my friends talk to me for advice", "start": 134.609, "duration": 5.431}, {"text": "I try to see both sides of the story even [if] I don't have direct access to it", "start": 140.04, "duration": 4.02}, {"text": "I may try to give the other party the benefit of the doubt or try to come up with evidence of their benevolence", "start": 144.06, "duration": 4.8}, {"text": "Also Dom: Oh shit that was fire. I should write that down.", "start": 149.28, "duration": 2.08}, {"text": "Original Dom: because the friend is sometimes so clouded with emotion that they can't think rationally", "start": 151.96, "duration": 3.54}, {"text": "but sometimes those friends don't", "start": 155.92, "duration": 1.95}, {"text": "necessarily come to you for actual advice and are so fixated on their point of view on the", "start": 157.87, "duration": 4.19}, {"text": "relationship that they just need someone to spill their thoughts to", "start": 162.1, "duration": 3.08}, {"text": "but there comes a point where the rants just get ridiculous", "start": 165.6, "duration": 2.9}, {"text": "And you wonder why even stay with them?", "start": 168.51, "duration": 2.49}, {"text": "Why is this person worth fighting for?\n Why not just break up?", "start": 171.0, "duration": 4.68}, {"text": "End the source of your misery. It seems like such an easy option, right?", "start": 175.72, "duration": 4.24}, {"text": "But I can understand why it can be so difficult to go through. I think deep down", "start": 179.98, "duration": 4.1}, {"text": "Those friends constantly asking for advice want to hear that option from a third party.", "start": 184.08, "duration": 4.18}, {"text": "Dom to friend: Why don't you just break up?", "start": 188.266, "duration": 2.264}, {"text": "I think they need to hear that question because it's at that point that they realize there's only two options for them to choose from", "start": 190.53, "duration": 5.729}, {"text": "stay together or don't.", "start": 196.5, "duration": 2.5}, {"text": "When presented with this ultimatum", "start": 199.1, "duration": 2.26}, {"text": "they'll either realise that the good in the relationship over ways the bad", "start": 201.36, "duration": 3.32}, {"text": "and that we're obligated to accept the flaws and others and in ourselves in order to respect each other and find balance", "start": 204.68, "duration": 6.08}, {"text": "or they realise that their partner is a worthless piece of shit and is undeserving of their love", "start": 210.76, "duration": 5.28}, {"text": "and if you're wondering", "start": 216.04, "duration": 1.1}, {"text": "What some of those red flags are that tell you to probably get the hell out let me give you a little boost", "start": 217.14, "duration": 4.739}, {"text": "(point 1) they shoot down your self-esteem and make you seem like you're not good enough for the world and assures you that they're doing you a", "start": 222.25, "duration": 5.449}, {"text": "favor by being with you, and I you should be lucky to have them basically they force you to be dependent on them", "start": 227.7, "duration": 5.489}, {"text": "but make you feel worthless for doing so.", "start": 233.189, "duration": 2.01}, {"text": "(Point 2) They are possessive and deny your freedom to see your friends or talk to people in general. A lack of trust.", "start": 235.51, "duration": 5.24}, {"text": "But if their lack of trust is backed up by your history of being an unfaithful piece of shit then okay, you probably deserve it.", "start": 240.82, "duration": 6.02}, {"text": "(Point 3) They treat you differently between public and private situations. This applies to social media as well", "start": 248.0, "duration": 4.3}, {"text": "(Point 4) They pressure you sexually when you've made it clear the you're not ready and feel uncomfortable.", "start": 252.4, "duration": 4.5}, {"text": "Fuck you Steve", "start": 256.98, "duration": 0.98}, {"text": "(Point 5) They find every reason to argue with you not to solve an issue.", "start": 257.96, "duration": 3.14}, {"text": "But for the sake of being right and to feel above you", "start": 261.109, "duration": 2.63}, {"text": "(Point 6) They dig up the past to use as ammunition in those arguments when you two have already moved on from those disputes", "start": 263.99, "duration": 5.809}, {"text": "(Point 7) They are stubborn and incapable of feeling remorse even when they are proven to be at fault", "start": 269.93, "duration": 5.066}, {"text": "(Point 8) They always aim to victimise themselves, so that you feel sorry for them and excuse their faults", "start": 275.0, "duration": 4.78}, {"text": "(Point 9) They are overly protective of their phones and conversations with other people", "start": 279.78, "duration": 3.6}, {"text": "They're secretive about things they act suspicious without reassuring you of their loyalty or they're probably planning you a surprise party", "start": 283.52, "duration": 7.24}, {"text": "(Point 10) Their words are inconsistent with their actions.", "start": 290.84, "duration": 3.24}, {"text": "(Point 11) They support trump", "start": 294.08, "duration": 1.24}, {"text": "(Point 12) They are unsupported of your dreams and ambitions and discourage you from pursuing them.", "start": 295.82, "duration": 4.84}, {"text": "(Point 13) The relationship feels too one-sided and unbalanced", "start": 300.86, "duration": 2.8}, {"text": "one of you is trying much harder than the other.", "start": 303.88, "duration": 2.22}, {"text": "But while not all relationships can achieve a perfect balance", "start": 306.26, "duration": 2.76}, {"text": "Surely you can tell when someone is lacking effort", "start": 309.16, "duration": 2.26}, {"text": "And the list goes on, there are dozens of other reasons that I can't possibly cover.", "start": 311.88, "duration": 4.539}, {"text": "But if none of these apply to you, then you're either in a healthy relationship or you're single", "start": 316.42, "duration": 4.98}, {"text": "Congratulations, you probably couldn't relate to this video. I'm sorry", "start": 322.08, "duration": 4.02}, {"text": "I understand that all relationships are case-By-case", "start": 327.32, "duration": 2.74}, {"text": "And by no means am I encouraging anyone to end theirs because their partner was late for that one dinner.", "start": 330.06, "duration": 5.919}, {"text": "Or you find out they don't like fedo chinio alfredo", "start": 335.979, "duration": 1.381}, {"text": "I'm sorry for your loss", "start": 337.36, "duration": 1.62}, {"text": "but I am encouraging anyone who's currently in a toxic or abusive relationship", "start": 339.04, "duration": 3.72}, {"text": "to build a determination to escape and relinquish your dependency on someone who doesn't treat you with respect.", "start": 342.76, "duration": 5.06}, {"text": "Someone who doesn't make you feel special because chances are someone else is out there", "start": 347.9, "duration": 4.62}, {"text": "Waiting for you to give them the opportunity to actually do so", "start": 352.78, "duration": 3.36}, {"text": "<3", "start": 356.3, "duration": 2.16}, {"text": "Advert", "start": 358.56, "duration": 0.5}, {"text": "Dom: If I know one thing it's that anime will always treat me right just kidding", "start": 359.06, "duration": 4.52}, {"text": "It's pretty much an emotional roller-coaster with every single one I watch but don't take my word for it", "start": 363.59, "duration": 4.709}, {"text": "you guys can also join in on the fun and entertainment and occasional sadness when you get too attached to the character by trying a", "start": 368.3, "duration": 5.97}, {"text": "crunchyroll premium membership for 30 days all you got to do is go to crunchyroll.com/domics or click the link in the description", "start": 374.37, "duration": 7.22}, {"text": "Emotional Roller coasters and anime emotional Roller coasters in Manga and emotional Roller coasters and drama titles they got it all", "start": 381.9, "duration": 6.799}, {"text": "Quality add three 1080p episodes as soon as an hour after japan release professionally subtitled episodes in a convenient app on most devices", "start": 389.13, "duration": 7.94}, {"text": "It's my go-to place for when I want to range over the death of a dog", "start": 397.65, "duration": 2.839}, {"text": "Rest in Peace Danny and still salty over that knee to the face again. That's crunchyroll.com/Domics The link below", "start": 400.65, "duration": 6.649}, {"text": "enjoy :)", "start": 407.88, "duration": 2.0}]