[{"text": "Back in 2016 Apple famously removed the headphone\njack from the iPhone 7, and while customers", "start": 0.14, "duration": 6.52}, {"text": "and companies alike mocked Apple for releasing\na flagship smartphone without a headphone", "start": 6.66, "duration": 4.83}, {"text": "jack, it eventually became clear within the\nnext couple years that the iPhone 7 had set", "start": 11.49, "duration": 5.06}, {"text": "a trend that virtually every other smartphone\nmanufacturer would follow. This is Greg with", "start": 16.55, "duration": 5.289}, {"text": "Apple Explained and I want to thank Hover\nfor sponsoring this video. If you want to", "start": 21.839, "duration": 4.35}, {"text": "help decide which video topics I cover, make\nsure you’re subscribed and these voting", "start": 26.189, "duration": 4.06}, {"text": "polls will show up in your mobile activity\nfeed.", "start": 30.249, "duration": 3.211}, {"text": "Now I want to start off by sharing some background\nknowledge of the 3.5mm headphone jack. Which", "start": 33.46, "duration": 5.501}, {"text": "is one of the most unique I/O ports to ever\nexist, and there are a few reasons for this.", "start": 38.961, "duration": 4.819}, {"text": "First, it was invented over fifty years ago\nin the 1960’s, which means it came out before", "start": 43.78, "duration": 5.329}, {"text": "the VCR player, a product many of you may\nnot even recognize since it’s been obsolete", "start": 49.109, "duration": 4.86}, {"text": "for so long. But the headphone jack was able\nto stand the test of time and remain relevant", "start": 53.969, "duration": 5.64}, {"text": "even to this day. Which brings me to the second\nthing that makes the port so special, it can", "start": 59.609, "duration": 5.211}, {"text": "actually be upgraded with modern features\nby simply adding another ring to its sleeve.", "start": 64.82, "duration": 5.159}, {"text": "That’s why older headphone jacks only have\none or two rings, while today we’re used", "start": 69.979, "duration": 4.481}, {"text": "to seeing three. And those extra rings added\ncapabilities like stereo audio and audio input,", "start": 74.46, "duration": 6.6}, {"text": "without the need to redesign an entirely new\nconnector, not to mention modern headphones", "start": 81.06, "duration": 4.79}, {"text": "are backward compatible with older products.\nBut there’s one more important quality of", "start": 85.85, "duration": 4.369}, {"text": "the headphone jack, it served as a ubiquitous\nindustry standard for audio in and out.", "start": 90.219, "duration": 5.44}, {"text": "Now what do I mean by that? Well, when a company\nmakes a product, they have to decide what", "start": 95.659, "duration": 4.71}, {"text": "ports would be best to include. And different\ncompanies made different decisions. I mean,", "start": 100.369, "duration": 5.221}, {"text": "just look at all the different USB ports that\nexist on the market today, companies have", "start": 105.59, "duration": 4.39}, {"text": "to decide which one is best suited for their\nproduct. That’s why you tend to have different", "start": 109.98, "duration": 4.239}, {"text": "chargers for different devices. I can’t\ncharge my Nintendo Switch with my iPhone power", "start": 114.219, "duration": 5.18}, {"text": "cable, and I can’t charge my MacBook Pro\nwith my external monitor’s power cable.", "start": 119.399, "duration": 5.01}, {"text": "Different products tend to require different\nports. But the 3.5mm headphone jack is a rare", "start": 124.409, "duration": 5.85}, {"text": "exception. Because it was basically adopted\nby the entire tech industry, despite there", "start": 130.259, "duration": 4.831}, {"text": "being many other options for audio as you\ncan see here. The fact that you could buy", "start": 135.09, "duration": 4.509}, {"text": "an iPod and plug its headphones into literally\nany other MP3 player on the market was an", "start": 139.599, "duration": 5.571}, {"text": "incredible benefit that I think was often\noverlooked. So it’s clear the headphone", "start": 145.17, "duration": 4.37}, {"text": "jack is an exceptional piece of technology,\nbut in recent years, many tech companies have", "start": 149.54, "duration": 4.92}, {"text": "decided not to include it in their products\nanymore. And it all started with Apple.", "start": 154.46, "duration": 6.609}, {"text": "In 2016, Apple held their annual press event\nin the fall and fans from all over the world", "start": 161.069, "duration": 4.531}, {"text": "were eager to see what the next generation\niPhone had in store, and hopes were very high.", "start": 165.6, "duration": 5.13}, {"text": "Because after the incremental iPhone 6S release\nthe previous year, we knew the iPhone 7 was", "start": 170.73, "duration": 5.07}, {"text": "due to receive a more dramatic update. Although\nmany were disappointed when the device was", "start": 175.8, "duration": 4.549}, {"text": "revealed, mainly because its design was virtually\nunchanged, but also because it was missing", "start": 180.349, "duration": 4.931}, {"text": "a headphone jack. Which some users felt was\na must-have feature for a smartphone. It left", "start": 185.28, "duration": 5.15}, {"text": "people wondering why Apple decided to remove\nsuch an important port from their most popular", "start": 190.43, "duration": 5.54}, {"text": "product. And what reason did Apple give? Well,\nPhil Schiller gave three: [clip]", "start": 195.97, "duration": 40.98}, {"text": "Now, I wish Phil Schiller would’ve left\nout the statement about courage since it just", "start": 236.95, "duration": 21.55}, {"text": "became an internet meme and overshadowed the\nmore legitimate reasons for removing the headphone", "start": 258.5, "duration": 4.51}, {"text": "jack. Like the fact that it took up valuable\nspace inside the phone that could be used", "start": 263.01, "duration": 4.22}, {"text": "for features like the Taptic Engine. Apple\nwas also able to include a 14% larger battery", "start": 267.23, "duration": 5.88}, {"text": "which delivered an extra 1-2 hours of battery\nlife, and the iPhone 7 achieved an IP67 waterproofing", "start": 273.11, "duration": 7.11}, {"text": "certification thanks to the absence of the\nheadphone jack. Not to mention the lightning", "start": 280.22, "duration": 4.73}, {"text": "connector could serve as an audio port to\ndeliver even higher quality sound than before.", "start": 284.95, "duration": 4.72}, {"text": "Lastly, the transition to wireless headphones\nwould happen faster if all smartphones ditched", "start": 289.67, "duration": 5.1}, {"text": "the headphone jack. But there are two sides\nto this story, so let me explain how some", "start": 294.77, "duration": 4.89}, {"text": "users were feeling about Apple’s decision.", "start": 299.66, "duration": 2.6}, {"text": "It seemed suspicious that the iPhone’s headphone\njack was removed at the same time the AirPods", "start": 302.26, "duration": 5.13}, {"text": "were introduced. In fact, right after Phil\nSchiller finished justifying ditching the", "start": 307.39, "duration": 4.53}, {"text": "headphone jack, he announced their new wireless\nheadphones. Suggesting Apple was trying to", "start": 311.92, "duration": 5.02}, {"text": "sell more AirPods by removing the iPhone’s\nheadphone jack and making it more inconvenient", "start": 316.94, "duration": 5.01}, {"text": "to use traditional wired earbuds. Because\nif you think about it, Apple could’ve waited", "start": 321.95, "duration": 4.49}, {"text": "a year or two to remove the iPhone’s headphone\njack and allow more time for the industry", "start": 326.44, "duration": 4.24}, {"text": "to transition to wireless, making things easier\nfor iPhone users, but they decided against", "start": 330.68, "duration": 5.28}, {"text": "it. And when it comes to Apple’s argument\nthat the iPhone needed room for things like", "start": 335.96, "duration": 4.31}, {"text": "its Taptic Engine, that may not be entirely\ntrue. Because a YouTube channel called Strange", "start": 340.27, "duration": 5.26}, {"text": "Parts was actually able to put a headphone\njack in an iPhone 7 himself without removing", "start": 345.53, "duration": 5.53}, {"text": "any vital components. It’s actually an incredible\nvideo that I highly recommend you watching,", "start": 351.06, "duration": 5.03}, {"text": "you can find a link to it in the description.\nThere was also speculation that Apple was", "start": 356.09, "duration": 3.5}, {"text": "trying to earn more money from royalties by\nlicensing their lightning connector to third", "start": 359.59, "duration": 4.47}, {"text": "party headphone manufacturers, but I don’t\nthink that was as big a factor as some were", "start": 364.06, "duration": 4.56}, {"text": "claiming.", "start": 368.62, "duration": 1.01}, {"text": "Now as you can imagine there was a significant\namount of backlash from consumers and tech", "start": 369.63, "duration": 4.2}, {"text": "bloggers over the removal of the headphone\njack from the iPhone 7. Some people even refused", "start": 373.83, "duration": 5.06}, {"text": "to buy it for that reason alone. So how significantly\nwere iPhone sales effected? Well, sales of", "start": 378.89, "duration": 5.95}, {"text": "the device didn’t appear to be effected\nat all. Apple sold 38.9 million units in the", "start": 384.84, "duration": 5.25}, {"text": "first quarter of 2017 which made the iPhone\n7 and 7 Plus the best-selling smartphones", "start": 390.09, "duration": 6.19}, {"text": "in the world. And most users didn’t seem\nto miss the headphone jack, probably because", "start": 396.28, "duration": 4.311}, {"text": "of the included adapter that allowed users\nto connect their favorite wired headphones", "start": 400.591, "duration": 4.019}, {"text": "anyway.", "start": 404.61, "duration": 1.0}, {"text": "Now I should mention this wasn’t the first\ntime apple removed a popular component from", "start": 405.61, "duration": 4.12}, {"text": "a product. They did it with the 1998 iMac\nby removing the floppy drive, the 2008 MacBook", "start": 409.73, "duration": 6.11}, {"text": "by removing the firewire port, the 2008 MacBook\nAir by removing the CD drive, and the 2015", "start": 415.84, "duration": 6.59}, {"text": "MacBook by removing the USB-A ports. And every\ntime this happened, Apple received criticism", "start": 422.43, "duration": 5.41}, {"text": "from people in the tech community. But this\nbacklash was just the first phase of public", "start": 427.84, "duration": 4.58}, {"text": "opinion, the second phase was when users began\nadapting to the changes Apple made, and the", "start": 432.42, "duration": 5.17}, {"text": "third phase happened once users admitted the\ntechnology Apple left out was no longer necessary.", "start": 437.59, "duration": 5.06}, {"text": "That’s why computers today don’t have\nfloppy drives and it’s very hard to find", "start": 442.65, "duration": 4.22}, {"text": "notebooks that still include CD drives. And\nthe headphone jack is already following the", "start": 446.87, "duration": 6.43}, {"text": "same trajectory. Because even though it was\nonly removed from the iPhone two and a half", "start": 453.3, "duration": 4.63}, {"text": "years ago, other smartphone manufactures have\nalready begin to follow Apple’s lead. Samsung", "start": 457.93, "duration": 5.93}, {"text": "removed the headphone jack from their Galaxy\nA8s and Galaxy Fold, along with the Pixel", "start": 463.86, "duration": 5.08}, {"text": "2, Moto Z3, OnePlus 6T, Xperia XZ2, HTC U12\nPlus, Huawei Mate 20 Pro, and more. So clearly", "start": 468.94, "duration": 10.43}, {"text": "there must be some benefit to removing the\nheadphone jack if virtually every major smartphone", "start": 479.37, "duration": 5.49}, {"text": "manufacturer has already done it.", "start": 484.86, "duration": 1.81}, {"text": "But I should mention that the headphone jack\nisn’t only being removed from smartphones.", "start": 486.67, "duration": 4.71}, {"text": "Apple also left it out of their new iPad Pros\nin 2018, and some are wondering if they’ll", "start": 491.38, "duration": 5.28}, {"text": "eventually remove it from their MacBook or\nMacBook Air notebooks. So what does the demise", "start": 496.66, "duration": 4.27}, {"text": "of the headphone jack actually mean for everyday\nusers? Well, it means you have two options:", "start": 500.93, "duration": 5.69}, {"text": "carry around an adapter to use wired headphones\nwith your device, or buy wireless headphones", "start": 506.62, "duration": 4.74}, {"text": "and never worry about plugging into a headphone\njack again. And if you’ve had any experience", "start": 511.36, "duration": 4.9}, {"text": "with high quality wireless headphones, you\nprobably found it difficult to go back to", "start": 516.26, "duration": 4.37}, {"text": "the wired equivalent. I remember when the\nAirPods were first announced and people dismissed", "start": 520.63, "duration": 4.88}, {"text": "them as overpriced and ugly. After all, you\ncould buy wired headphones with better sound", "start": 525.51, "duration": 4.74}, {"text": "quality for the same price. But many people\nunderestimated the unbelievable level of convenience", "start": 530.25, "duration": 5.77}, {"text": "AirPods provided. And that’s why they’ve\nbecome such a huge success.", "start": 536.02, "duration": 4.01}, {"text": "So I think most people would agree that the\nfuture is wireless, but some may have a problem", "start": 540.03, "duration": 5.65}, {"text": "with how we get there. As I mentioned before,\nthere is some truth to the fact that Apple", "start": 545.68, "duration": 4.78}, {"text": "was very abrupt. Forcing users into an uncomfortable\nposition that could’ve been avoided if the", "start": 550.46, "duration": 5.211}, {"text": "headphone jack had been included on iPhone\nfor at least another few years. Giving wireless", "start": 555.671, "duration": 4.949}, {"text": "technology time to become more affordable\nand widely adopted by users. But I think overall,", "start": 560.62, "duration": 6.43}, {"text": "users weren’t bothered by Apple’s approach.\nWith some, like Jonathan Kim even calling", "start": 567.05, "duration": 4.69}, {"text": "it a non-issue. And I actually think he made\na pretty good point when he said, “in 2018,", "start": 571.74, "duration": 5.3}, {"text": "complaining about smartphones losing the 3.5mm\njack is actually advocating for more wires — which", "start": 577.04, "duration": 6.7}, {"text": "get tangled, snagged, frayed, require you\nto be attached to a device, and can lead to", "start": 583.74, "duration": 4.9}, {"text": "devices getting damaged when they accidentally\nget yanked to the floor or off your head.", "start": 588.64, "duration": 4.94}, {"text": "And for audio, we simply don’t need wires\nand the problems that go with them anymore.”", "start": 593.58, "duration": 5.05}, {"text": "Now if you guys are looking to buy a domain\nname for your website I highly recommend using", "start": 598.63, "duration": 4.59}, {"text": "Hover. I used their service to buy my own\nappleexplained.com domain, and the purchase", "start": 603.22, "duration": 4.77}, {"text": "was as simple as buying something from Amazon.\nWhat I love about Hover is that I could purchase", "start": 607.99, "duration": 4.26}, {"text": "my domain once my YouTube channel started\nto get popular, without the obligation of", "start": 612.25, "duration": 4.32}, {"text": "creating a website at the same time. That\nway, I could ensure no one tried taking my", "start": 616.57, "duration": 4.51}, {"text": "domain name before I was ready to build a\nwebsite. And when I was finally ready to create", "start": 621.08, "duration": 3.92}, {"text": "my site, I was able to connect my domain to\nany website builder I wanted. That’s because", "start": 625.0, "duration": 4.91}, {"text": "it’s hosted by Hover, rather than the website\nbuilder itself. Which gives me flexibility", "start": 629.91, "duration": 5.04}, {"text": "if I ever want to change the website building\nservice I use. But probably my favorite thing", "start": 634.95, "duration": 4.42}, {"text": "about Hover is that they don’t try to up-sell\nyou, something that’s really common with", "start": 639.37, "duration": 4.12}, {"text": "similar services. And that makes the experience\nof buying and managing a custom domain much", "start": 643.49, "duration": 4.63}, {"text": "more pleasant. Now Hover is offering you guys\na 10% discount, so if you’ve been thinking", "start": 648.12, "duration": 4.74}, {"text": "about claiming your custom domain name, now\nis the best time to do it. Just go to hover.com/appleexplained", "start": 652.86, "duration": 6.62}, {"text": "and get 10%-off your first purchase.", "start": 659.48, "duration": 5.21}]