[{"text": "So earlier this month the brand-new Rocko's Modern Life revival special premiered on Netflix", "start": 0.03, "duration": 4.829}, {"text": "If you haven't seen it yet and you don't want it to be ruined I suggest moving this video forward to this timecode", "start": 5.08, "duration": 6.139}, {"text": "Static Cling is absolutely remarkable", "start": 12.04, "duration": 2.179}, {"text": "The creators brought forth the original tone and comedy the series in such a way that it felt totally seamless", "start": 14.73, "duration": 5.549}, {"text": "the animation quality in particular felt like it had been animated by the same team as before but in a higher resolution", "start": 20.38, "duration": 5.66}, {"text": "Which is something that I certainly haven't felt about things such as hey Arnold's the jungle movie", "start": 26.38, "duration": 4.549}, {"text": "But the greatest part of the special was its intelligence. With a title like Rocko's Modern Life", "start": 31.02, "duration": 6.92}, {"text": "It's not a great shot that the original show often intended to form some", "start": 38.02, "duration": 3.64}, {"text": "Commentary on the modern world, being very political in the process. And Static Cling followed in this pursuit daring to ask", "start": 41.829, "duration": 7.01}, {"text": "why people want or need a revival of a 90s children's cartoon 20-some odd years later and what it says about our", "start": 49.0, "duration": 7.16}, {"text": "relationship with our past and our future", "start": 56.3, "duration": 2.68}, {"text": "The plot revolves around Rocco and his friends some 20 years after being trapped in space due to the rocket ship in the finale", "start": 59.02, "duration": 6.6}, {"text": "Landing in our time and trying to learn to fit in with the culture of the late 2010s", "start": 66.01, "duration": 3.949}, {"text": "Rocco finds himself in shock and decides to put on his favorite show", "start": 70.42, "duration": 3.889}, {"text": "The Fatheads only to find out that it's been off the air for years due to the country switch to HD broadcasting", "start": 74.46, "duration": 5.62}, {"text": "Rocko insists that they have to bring the show back", "start": 80.14, "duration": 3.04}, {"text": "but learns that its creator left years ago to do soul-searching and hasn't been heard from since", "start": 83.439, "duration": 5.33}, {"text": "An obsessed Rocco decides that he needs a Fathead special and decides to hunt down the original show's creator", "start": 88.93, "duration": 5.75}, {"text": "A character who in the original show had been characterized by a persistent", "start": 94.78, "duration": 3.48}, {"text": "Unhappiness and a tendency to snap at those who are close to them. The reason why that is important", "start": 98.26, "duration": 5.38}, {"text": "Is that when Rocco finally finds the creator it's revealed that she is now a woman having transitioned off-screen", "start": 103.649, "duration": 6.36}, {"text": "Character: \"I'm not your son, I'm your daughter.", "start": 110.009, "duration": 2.431}, {"text": "And I'm finally happy.\" and what follows is a brilliant illustration of how bringing about something great and finding one's happiness", "start": 112.5, "duration": 2.4}, {"text": "and what follows is a brilliant illustration of how bringing about something great and finding one's happiness", "start": 114.9, "duration": 4.62}, {"text": "often means embracing", "start": 119.52, "duration": 1.12}, {"text": "the past while allowing things to change.", "start": 120.64, "duration": 2.56}, {"text": "And while many people have grown quite red-faced over this and have tried to claim that the storyline", "start": 123.2, "duration": 4.58}, {"text": "distracts from the rest of the episode", "start": 127.9, "duration": 1.72}, {"text": "In reality, it truly helps bring about the special's take on what nostalgia really is and how we should look at it.", "start": 129.62, "duration": 6.54}, {"text": "Shows like Rocko's Modern Life are overall important because they can help young viewers", "start": 136.16, "duration": 5.2}, {"text": "understand important issues from the starting line up to this point most illustrations of trans culture and the sort of medium had been greatly", "start": 141.42, "duration": 2.48}, {"text": "Up to this point, most illustrations of trans culture in this sort of medium had been greatly", "start": 143.9, "duration": 5.0}, {"text": "inflammatory, featuring storylines of characters changing gender for the sake of tricking others or", "start": 148.96, "duration": 5.74}, {"text": "Using it as a tool to commit a crime and while it's easy to laugh this off as pure edginess", "start": 154.72, "duration": 5.42}, {"text": "It's not really surprising that these are qualities that many people still associate these groups with", "start": 160.14, "duration": 6.74}, {"text": "As subdues as this is, representation is basically just showing a person casually existing. The reason it deserves commendation", "start": 166.96, "duration": 5.68}, {"text": "is that illustrating trans women as regular people who have simply found a means to become healthy and happy is something that", "start": 172.72, "duration": 7.12}, {"text": "Entertainment has long avoided and the fact that I see people trying to argue today that these shows have suddenly become political", "start": 179.86, "duration": 7.46}, {"text": "Astounds me because these sorts of messages have always been presented in these shows", "start": 187.34, "duration": 4.9}, {"text": "It's just that a lot of us", "start": 192.43, "duration": 1.649}, {"text": "Weren't smart enough at the time to notice the details and that's why today I want to highlight a few", "start": 194.079, "duration": 5.63}, {"text": "examples of programs that have proved willing to push the boundaries of their networks comfort to tell their audience something about the world outside of", "start": 199.87, "duration": 6.919}, {"text": "What was regularly expected", "start": 206.79, "duration": 2.16}, {"text": "In short:", "start": 208.95, "duration": 0.909}, {"text": "political messages in kids cartoons", "start": 209.859, "duration": 2.779}, {"text": "So this first one is the tiniest bit of a stretch and I'm pretty sure that what I'm", "start": 214.98, "duration": 5.58}, {"text": "Implicating isn't actually what the writer intended but I think it's a really interesting topic to cover anyway, so I'm gonna talk about it", "start": 220.62, "duration": 7.4}, {"text": "[Fairly Odd Parents Theme Song]", "start": 229.2, "duration": 1.28}, {"text": "At its peak the fairly oddparents was one of the smartest Nicktoons to ever hit the air. Near its end it got a little lethargic", "start": 230.5, "duration": 8.7}, {"text": "But those early", "start": 239.32, "duration": 0.809}, {"text": "Stories were still some of the best TV I ever saw growing up and I still think about a lot of them today", "start": 240.129, "duration": 5.029}, {"text": "One episode that stands out in general is titled The Same Game and featured in it", "start": 245.409, "duration": 5.12}, {"text": "One of the most important lessons that one can come to realize about the world", "start": 250.53, "duration": 3.36}, {"text": "so the story goes that Timmy and his friends are playing with their ball when they accidentally knock it over the fence and into the", "start": 253.89, "duration": 6.029}, {"text": "Yard of dr. Bender, the streets dentist, who was portrayed as very cruel and judgemental", "start": 259.92, "duration": 4.3}, {"text": "Bender soon arrives and takes the ball for himself and tells Timmy that he simply doesn't deserve to have it", "start": 264.28, "duration": 6.1}, {"text": "His reasoning? His teeth are", "start": 270.58, "duration": 2.08}, {"text": "Imperfect and thus he doesn't deserve things as nice as his lost item", "start": 272.66, "duration": 4.44}, {"text": "If you're thinking that sort of sounds like a mild extension of Foppington's Law", "start": 277.11, "duration": 3.63}, {"text": "Then you're already on the same logical path as I am. Timmy sulks home and has a bright idea", "start": 280.74, "duration": 5.67}, {"text": "no one can taunt him for being different", "start": 286.68, "duration": 2.26}, {"text": "If everything is exactly the same", "start": 289.0, "duration": 2.16}, {"text": "thus he adapts that thought into a wish and soon everyone in the universe looks identical", "start": 291.16, "duration": 6.109}, {"text": "An army of gray blobs", "start": 297.58, "duration": 2.0}, {"text": "many consequences", "start": 299.83, "duration": 1.14}, {"text": "Befall this wish, the greatest being that every fairy on earth has trouble finding their child and thus face Wish Back-up, but timmy decides", "start": 300.97, "duration": 6.859}, {"text": "To trek on with his mission. But, much to his shock, his neighbors still refused to give him back his ball", "start": 307.829, "duration": 6.051}, {"text": "Timmy: \"You're a big, gray blob just like me! [Laughing]", "start": 314.82, "duration": 3.1}, {"text": "Blob: \"Actually, we're the grayest and the blobbiest!", "start": 317.92, "duration": 2.84}, {"text": "In fact, only blobs as gray and blobby as we are, can have a gray ball as one like this!\"", "start": 320.76, "duration": 7.48}, {"text": "Now in some sense the moral of this seems blatantly obvious", "start": 328.24, "duration": 3.5}, {"text": "Everyone is the same on the inside, jerks are always gonna be jerks cuz that's just how they are blah, blah blah", "start": 332.26, "duration": 5.839}, {"text": "But I think there's a much bigger lesson to be taken from all this:", "start": 338.169, "duration": 3.031}, {"text": "The plot of this episode is that Timmy faces negative", "start": 341.2, "duration": 3.08}, {"text": "repercussions for some element of his person that is beyond his control", "start": 344.28, "duration": 3.92}, {"text": "And so he creates a world where everyone is", "start": 348.2, "duration": 2.68}, {"text": "Exactly the same but in his new world", "start": 350.88, "duration": 3.2}, {"text": "hierarchies prevail and in order to justify said hierarchies, key players essentially invent", "start": 354.1, "duration": 7.24}, {"text": "Racism to keep their power justified. You may be a gray blob, but we are grayer and blobbier", "start": 361.38, "duration": 6.9}, {"text": "And thus we are superior to you and we have the right to keep certain things", "start": 368.28, "duration": 6.179}, {"text": "from you", "start": 375.16, "duration": 1.32}, {"text": "Despite creating a world where bigotry is supposed to be impossible", "start": 376.48, "duration": 3.42}, {"text": "It persists and is reborn", "start": 379.96, "duration": 3.34}, {"text": "The reason this is so important is so much fiction around this time ended up portraying this sort of both sides", "start": 383.3, "duration": 5.48}, {"text": "Argument for situations like these", "start": 388.84, "duration": 2.36}, {"text": "Well, this episode blatantly makes the case", "start": 391.2, "duration": 1.59}, {"text": "That bigotry is more than just a few people not being able to put up with how different they are", "start": 392.79, "duration": 5.03}, {"text": "Instead, it's sort of a constant that some people need to justify their place in society", "start": 397.82, "duration": 4.54}, {"text": "A pillar that they use to keep other people down for their own personal gain. What could this ball possibly symbolize?", "start": 402.46, "duration": 6.289}, {"text": "political power,", "start": 409.39, "duration": 1.2}, {"text": "Money, cheap labor, it could be pretty much anything", "start": 410.59, "duration": 3.43}, {"text": "But the main lesson is that someone is always profiting from injustice and indeed they often create", "start": 414.02, "duration": 5.58}, {"text": "Inequality just to profit more and so to them it must always exist", "start": 419.62, "duration": 4.7}, {"text": "No matter the conditions", "start": 424.6, "duration": 1.44}, {"text": "And in these cases the only real way to defeat these people is to rise up and fight them one on one", "start": 426.04, "duration": 6.32}, {"text": "Is this what the teens are calling", "start": 432.36, "duration": 2.36}, {"text": "Praxis?", "start": 435.84, "duration": 1.8}, {"text": "I literally don't know. Anyways, I'm bad at transitions. I'm just gonna play some static", "start": 437.65, "duration": 5.19}, {"text": "Usually on this show when I do a video like this", "start": 444.43, "duration": 2.389}, {"text": "I usually try and include like three examples", "start": 446.82, "duration": 2.4}, {"text": "But I think for this video it makes a lot more sense to just stop and do a bunch of these in rapid succession", "start": 449.22, "duration": 4.619}, {"text": "In nearly 2000s show Recess a memorable episode featured TJ discovering that his school had adopted a sort of juvenile", "start": 453.96, "duration": 6.94}, {"text": "monetary system of using monster cards to pay for", "start": 460.9, "duration": 3.28}, {"text": "Basically everything on the playground while initially broke because of his inability to buy new cards", "start": 464.38, "duration": 2.62}, {"text": "While initially broke because of his inability to buy new cards,", "start": 467.0, "duration": 2.0}, {"text": "He figures out very quickly that he can get a lot of money very quickly by subcontracting workers to do his job for him", "start": 469.57, "duration": 6.26}, {"text": "He resorts to cheap child labor and hierarchies to collect more cards than anyone else in school", "start": 475.83, "duration": 5.159}, {"text": "eventually", "start": 481.269, "duration": 0.5}, {"text": "He chooses to use his collected power to own literally everything", "start": 481.769, "duration": 3.48}, {"text": "Fixing prices to his own standards and charging wages for everything possible", "start": 485.709, "duration": 3.8}, {"text": "This causes an economic crash and he is only allowed to continue gaining wealth after he signs a contract which guarantees better", "start": 489.699, "duration": 6.769}, {"text": "Standards for those below him.", "start": 496.54, "duration": 1.44}, {"text": "An episode of the cartoon series Spongebob Squarepants feature discussion of how lowbrow humor and poor", "start": 497.98, "duration": 4.42}, {"text": "Representation and entertainment can accidentally lead to the dehumanization of an entire race of people", "start": 502.4, "duration": 5.54}, {"text": "Lady:\" Don't stand too close to a squirrel, Billy. You'll catch it's Stupid.\"", "start": 508.36, "duration": 3.64}, {"text": "I always bring this episode up because it's always relevant", "start": 512.0, "duration": 3.04}, {"text": "Also remember that episode when Mr. Krabs's", "start": 515.46, "duration": 1.799}, {"text": "greed inspires him to make a jellyfish factory, essentially torturing sentient creatures for his own personal gain without any realistic", "start": 517.259, "duration": 7.5}, {"text": "punishment?", "start": 525.009, "duration": 1.56}, {"text": "I usually keep this one locked away in the depths of my mind because it was really upsetting when I was young", "start": 526.569, "duration": 5.731}, {"text": "In Ned's Declassified School Survival Guide, one of the bully characters has a secret life as a member of the knitting club", "start": 532.3, "duration": 4.189}, {"text": "Despite this being a group that he and the other bullies torment", "start": 536.58, "duration": 3.06}, {"text": "An ongoing arc in the series involves him wanting to tell his friends", "start": 539.64, "duration": 2.82}, {"text": "But worrying that he would be ostracized for his lifestyle", "start": 542.46, "duration": 2.22}, {"text": "this is probably an allegory for something but I just can't-", "start": 545.76, "duration": 2.6}, {"text": "An episode of the cartoon series SpongeBob SquarePants was so blatantly about how unions are good that you sort of have to turn your mind", "start": 548.64, "duration": 5.6}, {"text": "Off to not see it today", "start": 554.25, "duration": 1.75}, {"text": "Squidward:\"Nobody gives a care about the fate of Labor as long as they can get their instant gratification\"", "start": 556.0, "duration": 4.459}, {"text": "Oh, and hey, look, there's also a Rugrats episode", "start": 561.24, "duration": 2.88}, {"text": "That's about the exact same thing", "start": 564.12, "duration": 1.88}, {"text": "The show Rocko's Modern Life featured an episode about Rocco's neighbor,", "start": 566.0, "duration": 3.06}, {"text": "Despite claiming to hate clowns in a society", "start": 569.16, "duration": 2.2}, {"text": "Which also seems to hate clowns,", "start": 571.379, "duration": 1.871}, {"text": "having a second life as a clown and being afraid to tell all of his friends and loved ones about this out of fear of", "start": 573.25, "duration": 5.059}, {"text": "being ostracized", "start": 578.309, "duration": 2.0}, {"text": "Again I feel like this is an allegory somehow but I just -", "start": 580.6, "duration": 3.3}, {"text": "The show Rocko's Modern Life featured a corporation called Conglomo that is so massive", "start": 583.9, "duration": 3.6}, {"text": "That it owns everything", "start": 587.58, "duration": 1.92}, {"text": "Including the people in the town", "start": 589.5, "duration": 2.3}, {"text": "A huge effort is made in the show of exploring all of the negative side effects of this", "start": 591.8, "duration": 3.56}, {"text": "Depicting those in charge as evil idiots who just want as much money and power as possible", "start": 595.44, "duration": 4.1}, {"text": "The show Rocko's Modern Life featured an episode where", "start": 599.76, "duration": 2.62}, {"text": "Conglomo has a huge part in destroying the environment", "start": 602.38, "duration": 2.519}, {"text": "Despite the wishes of the people and featured an ending that implied that those who choose not to fight", "start": 604.899, "duration": 4.46}, {"text": "Pollution and the destruction of the planet were tempting death itself", "start": 609.46, "duration": 3.46}, {"text": "And finally the most obvious one of all-", "start": 612.92, "duration": 3.5}, {"text": "Papa Smurf is Karl Marx", "start": 616.42, "duration": 3.06}, {"text": "Okay, that one's a stretch", "start": 619.48, "duration": 1.82}, {"text": "I know it's getting pretty passe to trash Ben Shapiro", "start": 621.3, "duration": 2.7}, {"text": "but while researching this topic one of the first clips I found was him bitching about the fact that", "start": 624.12, "duration": 4.68}, {"text": "Sesame Street is leftist propaganda?", "start": 629.62, "duration": 2.26}, {"text": "And it's so unexplicable to me and yet it's also a really good example", "start": 631.88, "duration": 3.3}, {"text": "Of how people tend to argue about these things.", "start": 635.38, "duration": 3.12}, {"text": "News Anchor: \"You're taking on Elmo and Sesame Street and Big Bird in your book.\"", "start": 638.5, "duration": 3.52}, {"text": "Shaprio:\"Yeah, I kind of want to take him out back and cap him", "start": 642.12, "duration": 2.06}, {"text": "Prem time propaganda is really about the liberal bias in the Hollywood industry. I talked to one of the guys who's at children's television workshop", "start": 646.63, "duration": 3.37}, {"text": "I talked to one of the guys who's at children's television workshop originally,", "start": 650.0, "duration": 2.86}, {"text": "and he said that the whole purpose of Sesame Street was to cater to black and Hispanic", "start": 652.9, "duration": 4.66}, {"text": "Youths who quote-unquote \"did not have reading literature in the house\"\"", "start": 657.57, "duration": 2.53}, {"text": "Quinton: Throughout this clip,", "start": 660.1, "duration": 0.68}, {"text": "These fox news commentators keep claiming that this is somehow evil and bad for children", "start": 660.78, "duration": 4.83}, {"text": "But they won't give any goddamn examples of why", "start": 665.61, "duration": 3.029}, {"text": "Benny gets mad because the Sesame Street website tells parents to not use gender biases when buying", "start": 669.1, "duration": 5.959}, {"text": "Toys and then this weird guy goes on some rant about how a gay guy was elected prom queen?", "start": 675.19, "duration": 6.41}, {"text": "Shapiro: 'And by the way, if you go on the Sesame Street website it talks about when you're bringing up your child, make sure that you use", "start": 681.96, "duration": 3.84}, {"text": "Gender-neutral language, make sure that you give your boys dolls and make sure that you give your girls firetrucks'", "start": 685.92, "duration": 6.08}, {"text": "Fox New Anchor: 'Yeah, and that that's setting up a problem.", "start": 692.13, "duration": 1.97}, {"text": "Just this year a high school in Virginia", "start": 694.1, "duration": 3.68}, {"text": "Named a guy who was openly gay as prom queen.'", "start": 697.78, "duration": 3.34}, {"text": "Quinton: These people are such snowflakes! They get so easily triggered about everything! My god!", "start": 701.62, "duration": 6.17}, {"text": "It's a prom queen at a high school you've never heard of before! Who cares?!", "start": 707.88, "duration": 6.46}, {"text": "How can you actively dedicate your", "start": 714.48, "duration": 2.0}, {"text": "Platform to bitching about the Rights' lack of freedom of speech while also getting mad about the Left using their freedom of speech", "start": 716.5, "duration": 5.989}, {"text": "Take a shower, Ben. Your hair looks like you dipped it in olive oil", "start": 722.98, "duration": 3.109}, {"text": "So moving on", "start": 727.21, "duration": 1.2}, {"text": "There's one final show which was created entirely with the intention of being a piece of political discussion", "start": 728.41, "duration": 6.69}, {"text": "One which was once synonymous with the entire concept of cartoons meant for children that certainly deserves to be talked about", "start": 735.1, "duration": 6.86}, {"text": "[Captain Planet Theme Song]", "start": 743.86, "duration": 7.32}, {"text": "Ted Turner is famous for three things:", "start": 751.24, "duration": 2.36}, {"text": "Being really bad at colorizing old movies,", "start": 753.6, "duration": 2.0}, {"text": "Creating a large amount of networks and organizations", "start": 755.6, "duration": 2.4}, {"text": "Which are still alive today,", "start": 758.02, "duration": 1.68}, {"text": "And having a record for seeking out environmentalist pursuits.", "start": 759.7, "duration": 2.9}, {"text": "It was this final passion which inspired him to create", "start": 762.6, "duration": 2.9}, {"text": "Captain Planet and the Planeteers, a show which has been endlessly berated by everyone under the Sun for being really old and cheesy", "start": 765.52, "duration": 7.2}, {"text": "There's this strange cycle you go through as you grow up with this show", "start": 773.08, "duration": 4.26}, {"text": "As a kid, you think that this must be an entirely accurate", "start": 777.34, "duration": 2.86}, {"text": "portrayal of the environmental crisis", "start": 780.24, "duration": 2.56}, {"text": "As a teenager, you realize it's a little cartoony and is probably heavily one-sided", "start": 782.8, "duration": 5.3}, {"text": "And then as an adult you realize it's an entirely accurate portrayal of the environmental crisis", "start": 788.26, "duration": 5.72}, {"text": "The catchphrase of Captain Planet in the show itself is: The power is yours", "start": 794.0, "duration": 5.02}, {"text": "At first glance, this comes across something like only you can prevent forest fires, as if it's a call to take", "start": 799.02, "duration": 5.08}, {"text": "Responsibility for how small issues in one's life can impact the environment", "start": 804.1, "duration": 3.62}, {"text": "indeed the show often goes out of its way to tell its audience about how they", "start": 807.91, "duration": 3.109}, {"text": "Personally can have a hand in saving the world", "start": 811.15, "duration": 2.03}, {"text": "They can recycle they can be careful about how much energy they use and so on and so forth", "start": 813.18, "duration": 4.469}, {"text": "but it's very overt about the fact that the bad guys who are causing the significant issues in the show are never", "start": 817.649, "duration": 5.551}, {"text": "Representatives of the audience", "start": 823.2, "duration": 2.6}, {"text": "It's always some cartoonish rat mogul who is polluting the planet and causing permanent damage", "start": 825.8, "duration": 5.78}, {"text": "Who chooses to ignore the destruction they're causing", "start": 831.7, "duration": 2.54}, {"text": "because it doesn't really affect them and yeah", "start": 834.84, "duration": 3.64}, {"text": "Yeah, that's pretty much it", "start": 838.6, "duration": 2.5}, {"text": "If anything the phrase the power is yours isn't a way of telling you that pollution is your fault", "start": 841.1, "duration": 4.68}, {"text": "But instead of saying that taking action against those who are destroying the earth is the key to making things better", "start": 845.84, "duration": 5.1}, {"text": "With the showrunners literally telling you to find the names and addresses of these specific 100 people and to then attack them with fire?", "start": 851.26, "duration": 7.039}, {"text": "For legal reasons, I have to say no", "start": 859.12, "duration": 2.33}, {"text": "dun dun dun another one bites the dust-", "start": 862.42, "duration": 3.58}, {"text": "The message was very clearly that the earth is something that needs to be saved and", "start": 866.0, "duration": 3.48}, {"text": "Overt activism is the only option that we really have in a modern world", "start": 869.58, "duration": 4.08}, {"text": "But Captain Planet and the Planeteers is also a show that is well-known for very blunt coverage of many other topics", "start": 873.82, "duration": 6.469}, {"text": "From street violence to really dated episodes about the war on drugs", "start": 880.75, "duration": 3.859}, {"text": "but the most famous and infamous out of these is called a", "start": 885.31, "duration": 3.38}, {"text": "Formula of hate which attempted to educate its audience on the topic of HIV awareness", "start": 889.209, "duration": 4.76}, {"text": "Now I sort of have mixed feelings about if I should really include this one", "start": 894.94, "duration": 4.01}, {"text": "because the episode is most known today for having a very strange cheesy early 90s tone that makes the serious messaging feel sort of", "start": 899.29, "duration": 7.97}, {"text": "Harder to take in?", "start": 907.81, "duration": 1.39}, {"text": "Doctor: 'You tested positive for the HIV virus and that leads to AIDS, but you don't have AIDS.'", "start": 909.2, "duration": 5.18}, {"text": "Mother: 'How could it happen?'", "start": 914.38, "duration": 1.7}, {"text": "Boy : 'Who cares how I got it-  it stinks!'", "start": 916.08, "duration": 2.06}, {"text": "Mother: 'Todd? Todd?!'", "start": 920.019, "duration": 2.0}, {"text": "During the story the episode's rat villain begins to spread misinformation about his condition", "start": 922.12, "duration": 4.909}, {"text": "so that those in his community begin to shame him and", "start": 927.19, "duration": 2.75}, {"text": "Treat him like an outsider and it's only when Captain Planet shows up and begins to educate the town's folk that things start to take", "start": 930.01, "duration": 6.109}, {"text": "A turn for the better", "start": 936.12, "duration": 1.34}, {"text": "Captain Planet: 'Deal with the real, people! Get the facts! If Todd had any other disease you'd be cheering him on!", "start": 937.46, "duration": 6.28}, {"text": "Right now Todd needs your support.", "start": 943.78, "duration": 3.12}, {"text": "One of the main reasons I think this episode is worth highlighting despite all of its goofiness", "start": 946.9, "duration": 3.08}, {"text": "Is that it's actually based on a true story", "start": 950.04, "duration": 2.14}, {"text": "Ryan White was a high school student in Indiana who was diagnosed with HIV after a contaminated blood treatment", "start": 952.769, "duration": 6.119}, {"text": "His family was shocked to find out that instead of his community supporting him", "start": 958.889, "duration": 3.78}, {"text": "He was barred from returning to school by paranoid parents and teachers and was treated like an absolute outsider", "start": 962.67, "duration": 5.729}, {"text": "This eventually led to some death threats and close encounters and they had to leave the county", "start": 968.889, "duration": 5.211}, {"text": "A wave of hatred", "start": 974.1, "duration": 1.63}, {"text": "mixed with homophobia and ignorance caused the American people to turn on anyone diagnosed with HIV", "start": 975.73, "duration": 7.25}, {"text": "a constant comment", "start": 983.44, "duration": 0.829}, {"text": "a lot of people have when they look back at shows like this is this sense of displeasure that", "start": 984.269, "duration": 4.53}, {"text": "Television had to teach kids something that their parents refused to", "start": 989.079, "duration": 3.821}, {"text": "For instance in the 1960s the children of blatant racist segregationists", "start": 992.9, "duration": 3.8}, {"text": "would turn on their TVs to see Mr. Rogers", "start": 996.76, "duration": 2.56}, {"text": "tell them that racism is for chumps and that segregation doesn't make sense", "start": 999.329, "duration": 4.38}, {"text": "But in the case of Captain Planet and the Planeteers it goes one step further", "start": 1004.019, "duration": 3.41}, {"text": "This episode wasn't just telling kids something that their parents should have it was telling the American public", "start": 1007.92, "duration": 5.69}, {"text": "Something that the White House should have", "start": 1013.769, "duration": 2.431}, {"text": "The former administration who had left just as the show jerk-off knew for years that Americans", "start": 1016.2, "duration": 5.3}, {"text": "were dying from the AIDS epidemic", "start": 1021.5, "duration": 2.12}, {"text": "They knew that a parade of misinformation had caused the people of the country to turn on the", "start": 1023.62, "duration": 5.18}, {"text": "LGBTQ community out of hate and fear and they chose to do nothing", "start": 1028.84, "duration": 4.54}, {"text": "Because they just really didn't care about gay people dying. It's not any more complex than that", "start": 1033.9, "duration": 5.419}, {"text": "They laughed in the face of people who were asking about this", "start": 1039.319, "duration": 3.119}, {"text": "They ignored calls for action and they let Americans die because most of those Americans were in the gay community", "start": 1042.44, "duration": 6.82}, {"text": "And Captain Planet,", "start": 1049.38, "duration": 2.18}, {"text": "as goofy a concept as it was, did a better job of representing the seriousness of the HIV epidemic and", "start": 1051.56, "duration": 6.64}, {"text": "Fighting the misinformation around it than most anyone else in power did at that time", "start": 1058.409, "duration": 4.16}, {"text": "By telling its audience that not supporting the victims of this sickness was something so evil that it had to be", "start": 1062.9, "duration": 6.98}, {"text": "personified by a giant", "start": 1069.88, "duration": 2.52}, {"text": "Mutated sewer rat", "start": 1072.42, "duration": 2.98}, {"text": "Out of all the topics that I've chosen to highlight in this episode", "start": 1075.4, "duration": 3.06}, {"text": "Captain Planet is arguably the most laughable today", "start": 1078.56, "duration": 2.82}, {"text": "But it was heavily ahead of its time in terms of using its stories to prepare its audience for a world", "start": 1081.539, "duration": 5.599}, {"text": "that could be just as serious and upsetting as stories like this one and for that I", "start": 1087.149, "duration": 5.45}, {"text": "Really think it deserves a lot more praise than it tends to get", "start": 1092.76, "duration": 3.019}, {"text": "So some concluding thoughts to wrap us up here", "start": 1096.63, "duration": 2.809}, {"text": "I often see people complain about how media has become political and especially entertainment meant for younger people", "start": 1099.44, "duration": 6.93}, {"text": "But when one goes back to older stories to things that we all grew up on", "start": 1106.71, "duration": 4.339}, {"text": "We come to realize that these elements were always at play. These shows were always", "start": 1111.179, "duration": 5.66}, {"text": "ALWAYS political", "start": 1116.84, "duration": 1.74}, {"text": "What changes is us, the viewers", "start": 1118.58, "duration": 3.44}, {"text": "We get older we start to understand the world and thus we start to see the parallels between the world", "start": 1122.02, "duration": 6.1}, {"text": "And what is shown on TV", "start": 1128.279, "duration": 1.921}, {"text": "When people cry for entertainment without these elements what they're really highlighting is that they're nostalgic for a time", "start": 1130.2, "duration": 5.68}, {"text": "where they didn't understand enough of the world to care about these elements and to some extent these shows have sort of a", "start": 1135.88, "duration": 6.32}, {"text": "responsibility to tell their audience about the world, to make them see the", "start": 1142.3, "duration": 4.84}, {"text": "differences between right and wrong. And it's impossible to do that without dipping into topics seen as", "start": 1147.389, "duration": 5.42}, {"text": "Political at the time and shows that do manage to do this are usually the ones that we remember and commend as time goes on", "start": 1153.269, "duration": 6.74}, {"text": "one other comment about this", "start": 1160.169, "duration": 2.0}, {"text": "My friend Sara recently tweeted something that I thought was really important to discussions like this. She said", "start": 1162.72, "duration": 5.989}, {"text": "what is and isn't considered politics is in fact something political in and of itself", "start": 1169.38, "duration": 6.26}, {"text": "This is upsettingly true", "start": 1175.64, "duration": 2.66}, {"text": "I get so goddamn tired of people saying that video games become political not when they discuss war or", "start": 1178.3, "duration": 6.72}, {"text": "actual politics but when they start to feature a greater diversity in your options for who you can play as", "start": 1185.18, "duration": 7.4}, {"text": "specifically when games feature lesbian or trans characters as options in their storylines and the question becomes", "start": 1193.289, "duration": 6.38}, {"text": "Who profits from these narratives?", "start": 1200.25, "duration": 2.929}, {"text": "Of saying that diversity is political and that being political is inherently the worst thing you can be", "start": 1203.76, "duration": 6.679}, {"text": "Just imagine for a moment living in a world where people consider your entire identity to be so", "start": 1210.779, "duration": 5.75}, {"text": "polarizing in discussion that the idea, of you existing of you breathing in front of their face is", "start": 1216.779, "duration": 6.38}, {"text": "Political to the extent that people who are like you shouldn't be allowed in pop culture", "start": 1223.74, "duration": 5.06}, {"text": "No, it's infuriating, short-sighted and blatantly ignorant", "start": 1228.8, "duration": 4.74}, {"text": "The world is political. Things that discuss and represent the world accurately", "start": 1233.54, "duration": 4.36}, {"text": "have to be political sometimes", "start": 1237.9, "duration": 2.7}, {"text": "If you can't handle that, there's a lovely moon sitting in our orbit", "start": 1240.6, "duration": 4.04}, {"text": "Just waiting for some idiot to colonize it", "start": 1244.64, "duration": 2.38}, {"text": "Sudden tone shift. I am very excited to announce", "start": 1249.86, "duration": 2.719}, {"text": "This video is once again", "start": 1252.58, "duration": 1.18}, {"text": "sponsored by our friends at Privacy.com", "start": 1253.76, "duration": 2.84}, {"text": "I always love when these guys want to do a sponsor because it's a service that I actually", "start": 1256.6, "duration": 3.58}, {"text": "Really love so in a modern age security on the Internet can be a little iffy", "start": 1260.18, "duration": 4.19}, {"text": "It seems every few months supposedly secure", "start": 1264.37, "duration": 2.13}, {"text": "organizations leak the information of their customers because of basic incompetence and let's not even discuss the people who are actually", "start": 1266.54, "duration": 6.2}, {"text": "Maliciously trying to get your information on purpose in this day and age using the same card everywhere", "start": 1272.76, "duration": 6.78}, {"text": "You purchase stuff online is like using the same password on every account that you visit", "start": 1279.549, "duration": 4.8}, {"text": "You're just asking for your bank account to be accessed that way and once that happens", "start": 1284.35, "duration": 4.439}, {"text": "You got to get a new card and then you got to find out all the subscriptions that you use that card on and change", "start": 1288.789, "duration": 5.31}, {"text": "It out. It's a pain. But with privacy those worries are a fear of the past. The process is very simple", "start": 1294.1, "duration": 5.609}, {"text": "You just make an account connect your new account to your bank account or debit card and then you can create and use an infinite", "start": 1299.71, "duration": 5.52}, {"text": "Amount of virtual cards you can set spending limits to make sure that you aren't overcharged on monthly", "start": 1305.23, "duration": 4.439}, {"text": "subscriptions or you can set the card to just one use", "start": 1309.83, "duration": 2.959}, {"text": "So even if your info gets stolen it won't matter because the card was only intended to work for that one purchase", "start": 1313.1, "duration": 6.469}, {"text": "This is really useful for all the strange things that I tend to buy on the internet that are probably sort of shady corners", "start": 1319.64, "duration": 5.75}, {"text": "But that's a topic for an entirely different video", "start": 1325.46, "duration": 2.93}, {"text": "And when you use my link at Privacvy.com/Quinton, you will get an extra five dollars added to your account", "start": 1328.39, "duration": 5.849}, {"text": "That's a free five dollar credit that you can use", "start": 1334.61, "duration": 3.319}, {"text": "Anywhere you'd like and with the chrome add-on the simplicity the service goes one step further", "start": 1338.09, "duration": 4.069}, {"text": "Let's say I want to buy this random book I picked out", "start": 1342.26, "duration": 2.239}, {"text": "All I have to do is go to the payment page click on this little logo add in a name and boom", "start": 1344.5, "duration": 5.339}, {"text": "Within just a few seconds I've added a whole new level of security to my life once again go to", "start": 1350.029, "duration": 5.06}, {"text": "Privacy.com/Quinton to get your free five dollars now and use it any way you'd like, that's p-r-i-v-a-c-y .com slash q-u-i-n-t-o-n", "start": 1355.089, "duration": 8.491}, {"text": "A big thanks to my patreon supporters who helped me fund this video without you guys", "start": 1364.9, "duration": 3.18}, {"text": "It would be so hard to stay afloat in this day and age", "start": 1368.08, "duration": 2.19}, {"text": "I'm doing a deal right now where if I get to a hundred and eighty-five supporters", "start": 1370.309, "duration": 4.16}, {"text": "I am going to make a video dedicated to reviewing the infamous film", "start": 1374.47, "duration": 3.75}, {"text": "To Boldly Flee and that is something a lot of people have wanted me to do for very long time", "start": 1378.409, "duration": 4.52}, {"text": "And if I reach that goal, I'm gonna do it", "start": 1383.0, "duration": 2.479}, {"text": "Maybe that's where you want to spend some of your $5.00 or you know books, charity. Whatever it's your money", "start": 1385.669, "duration": 6.95}, {"text": "I also wanted to end the video by suggesting that you guys check out this two-part video by my friend Jack Saint About LGBTQ", "start": 1392.62, "duration": 7.38}, {"text": "Representation in 90s cartoons. It's an absolutely incredible video from an equally fantastic channel and a really cool", "start": 1400.0, "duration": 7.28}, {"text": "dude, and basically if you've enjoyed this video, it's gonna be right up your alley", "start": 1407.29, "duration": 4.889}, {"text": "With that-", "start": 1412.18, "duration": 0.7}, {"text": "I've been Quinton Reviews, and that's all you need", "start": 1412.88, "duration": 4.5}]