[{"text": "This video has been sponsored by Nord VPN. Right \nnow they're offering 75% off 3 year plans, as  ", "start": 0.0, "duration": 6.48}, {"text": "well as one month free, which you can get by going \nto nordvpn.com/nilered. As a kid I can sometimes  ", "start": 6.48, "duration": 8.13}, {"text": "remember looking through dirt, and finding little \nbits that looked almost like gold. And almost  ", "start": 14.61, "duration": 5.19}, {"text": "every time, I would get really excited thinking \nthat I was rich or something, only to be quickly  ", "start": 19.8, "duration": 4.53}, {"text": "shut down, and told that it was worthless fool's \ngold. At the time I kind of just accepted that  ", "start": 24.33, "duration": 5.19}, {"text": "answer, and I threw away what I had found, without \nreally questioning much. What I didn't know though  ", "start": 29.52, "duration": 5.4}, {"text": "was that despite it being way less valuable than \ngold, it was still a really interesting compound.  ", "start": 34.92, "duration": 5.31}, {"text": "The mineral name for fool's gold is pyrite or iron \npyrite, and its chemical name is iron disulfide.  ", "start": 40.23, "duration": 6.21}, {"text": "It's chemical formula is pretty simple just FeS2, \nbut what makes it really cool, is the different  ", "start": 46.44, "duration": 7.02}, {"text": "ways that it can crystallize. The appearance that \nit ultimately takes on, will depend heavily on the  ", "start": 53.46, "duration": 5.1}, {"text": "environment that it was formed in. Some important \nfactors that affected, are things like purity,  ", "start": 58.56, "duration": 4.77}, {"text": "time, pressure and temperature. For example \npirate from a certain region in Spain, tends  ", "start": 63.33, "duration": 6.75}, {"text": "to form these oddly perfect looking cubes, which \nhonestly still kind of look fake to me. Their size  ", "start": 70.08, "duration": 6.36}, {"text": "and distribution can also vary quite a bit, and \nsome crystals can get really big like this one.  ", "start": 76.44, "duration": 5.07}, {"text": "The base unit cell that builds the pyrite \ncrystal is cubic, and under these circumstances,  ", "start": 82.71, "duration": 4.53}, {"text": "the macroscopic crystal that formed, was cubic as \nwell. However, impurities and the other conditions  ", "start": 87.24, "duration": 7.17}, {"text": "that I mentioned earlier, can alter how these \nunits build on each other, and it can affect the  ", "start": 94.41, "duration": 4.35}, {"text": "final appearance. So depending on where you are in \nthe world and what the geological conditions are  ", "start": 98.76, "duration": 4.95}, {"text": "in that place, it can look quite different. For \nthis video, I'm gonna be focusing on pyrite, but  ", "start": 103.71, "duration": 6.03}, {"text": "I did want to mention that it is possible, for the \niron disulfide to have a non cubic unit cell. It  ", "start": 109.74, "duration": 6.42}, {"text": "can instead be something called orthorhombic, and \nwhen this happens, it forms a different mineral  ", "start": 116.16, "duration": 4.89}, {"text": "called marcasite. This one's a lot more brittle \nthough, less stable, and has a different color. In  ", "start": 121.05, "duration": 5.82}, {"text": "any case, now that we know a bit about what fool's \ngold is in general, I want to dive a bit more into  ", "start": 126.87, "duration": 5.76}, {"text": "its physical and chemical properties. So to start \noff just in appearance and feel, I think it's  ", "start": 132.63, "duration": 6.0}, {"text": "really similar to metal, and color wise, it can be \nclose to that of gold, and it's also often found  ", "start": 138.63, "duration": 5.61}, {"text": "in the same area as gold, so it's not surprising \nthat they can sometimes get mixed up. The biggest  ", "start": 144.24, "duration": 5.76}, {"text": "difference though, is that gold is never found \nas these sharp and highly ordered structures,  ", "start": 150.0, "duration": 4.53}, {"text": "and it's usually just found as an amorphous chunk \nlike this. And another major difference is that  ", "start": 154.53, "duration": 5.82}, {"text": "gold is really soft and malleable, whereas pyrite \nis really hard and brittle. So if it's hit with  ", "start": 160.35, "duration": 5.91}, {"text": "something like a hammer, the pirate would shatter \ninto pieces, whereas the gold, would just get  ", "start": 166.26, "duration": 4.62}, {"text": "flattened. Also in terms of its density it's only \naround 5 grams per cubic centimeter, whereas gold  ", "start": 170.88, "duration": 6.36}, {"text": "is about 19.3. With small quantities it might be \nhard to tell, but once you get a decent amount of  ", "start": 177.24, "duration": 6.66}, {"text": "the pyrite, the weight difference is pretty \nobvious. So when a big chunk is found it's  ", "start": 183.9, "duration": 5.19}, {"text": "relatively easy to tell a difference, and it's \nonly really an issue when you have lots of small  ", "start": 189.09, "duration": 4.56}, {"text": "bits. For example here, in a clip that I found on \nYouTube, it really does look like gold. However  ", "start": 193.65, "duration": 7.2}, {"text": "this was only because the really shiny pyrite \nwas reflecting a lot of the light from the sun,  ", "start": 200.85, "duration": 4.59}, {"text": "and making it hard to tell its color. Once he \nmoved to the shade though the brassy yellow color  ", "start": 205.44, "duration": 5.46}, {"text": "of the pyrite became quite evident, but the color \nof the gold stayed the same. His other simple test  ", "start": 210.9, "duration": 5.82}, {"text": "was based on the fact like I mentioned before, \nthat the density of pyrite is way less than that  ", "start": 216.72, "duration": 4.53}, {"text": "of gold. Just by gently swishing around the \nwater, the heavier gold is able to stay put,  ", "start": 221.25, "duration": 5.31}, {"text": "but the lighter pyrite is moved around. From its \noverall metallic and shiny look, a lot of people  ", "start": 226.56, "duration": 6.24}, {"text": "would think that it's conductive and, well they're \nright it kind of is. It's not nearly as conductive  ", "start": 232.8, "duration": 5.52}, {"text": "as a proper metal though, and it's classified \nas a semiconductor. In general, semiconductor  ", "start": 238.32, "duration": 5.49}, {"text": "materials are used pretty extensively in the \nelectronics industry, and it has been suggested,  ", "start": 243.81, "duration": 4.53}, {"text": "that pyrite might have some use there as well. \nCurrently I think the major use of it related to  ", "start": 248.34, "duration": 6.75}, {"text": "things that are electronic, is in non-rechargeable \nenergizer lithium batteries. In this battery,  ", "start": 255.09, "duration": 5.88}, {"text": "one of the electrodes is the lithium itself and \nthe other one, is made by coating iron disulfide  ", "start": 260.97, "duration": 5.07}, {"text": "on a thin layer of aluminum. Okay so now for the \nfun part, where I get to play around with it,  ", "start": 266.04, "duration": 5.97}, {"text": "and learn more about its chemical properties. It \nwould have been insane to sacrifice my really nice  ", "start": 272.01, "duration": 4.98}, {"text": "cube so instead, I bought a bunch of ugly ones \nfrom eBay. I really don't remember exactly how  ", "start": 276.99, "duration": 6.03}, {"text": "much it cost, but it was quite cheap, and probably \nonly around $20 for the whole bag of them. For  ", "start": 283.02, "duration": 6.66}, {"text": "the first test, I just put a small amount of \nconcentrated hydrochloric acid, on one of the  ", "start": 289.68, "duration": 4.68}, {"text": "pieces. I let it sit there for a few minutes, \nbut it didn't look like much was happening.  ", "start": 294.36, "duration": 4.83}, {"text": "There should have been a reaction going on, but I \njust think it's really slow. The iron disulfide is  ", "start": 299.19, "duration": 6.57}, {"text": "FeS2, but I thought that it might react faster \nif I converted it to just FES. This can be done  ", "start": 305.76, "duration": 6.51}, {"text": "pretty easily by just heating the pyrite to its \ndecomposition temperature, which starts at around  ", "start": 312.27, "duration": 4.8}, {"text": "540°C. To do this, I just carefully shot it with \na blowtorch until it looked like the surface was  ", "start": 317.07, "duration": 6.69}, {"text": "turning black. Some pieces of pyrite also started \ncracking off, but I'll talk about that in a bit.", "start": 323.76, "duration": 5.61}, {"text": "When it cooled down, I added the HCL \nagain and the effect was very subtle,  ", "start": 333.33, "duration": 5.67}, {"text": "but it was there. Like last time, I left \nit for a few minutes and when I removed it,  ", "start": 339.0, "duration": 5.64}, {"text": "almost all of the blackness had disappeared. \nThe HCL had also taken on a yellow color,  ", "start": 344.64, "duration": 5.46}, {"text": "which you can see on the paper towel. So the major \nthing that happened here was a reaction between  ", "start": 350.1, "duration": 5.19}, {"text": "the black FeS that I made, and the hydrochloric \nacid. This lead to the formation of Fe(ii)Cl,  ", "start": 355.29, "duration": 6.18}, {"text": "as well as hydrogen sulfide gas. The amount that \nwas reacting here was so little though that it  ", "start": 361.47, "duration": 6.0}, {"text": "wasn't really possible to see any gas coming off. \nHowever I wanted the effect to be much clearer so  ", "start": 367.47, "duration": 6.57}, {"text": "I decided to try heating the pyrite more, and to \nconvert as much as I could to the FES. Initially  ", "start": 374.04, "duration": 6.06}, {"text": "it looked decent and the whole surface was turning \nblack but then suddenly, pieces of it started to  ", "start": 380.1, "duration": 5.43}, {"text": "shoot off. I'm not 100% sure what caused this, but \nI think it is a direct result of the decomposition  ", "start": 385.53, "duration": 5.79}, {"text": "of the FeS. In order for it to break down to FES, \nit needs to kick off a sulfur. It's fine if this  ", "start": 391.32, "duration": 7.44}, {"text": "happens on the surface of it because the sulfur \njust boils off, and then burns in the air to make  ", "start": 398.76, "duration": 4.71}, {"text": "SO2. However if this happens in the cube, there's \nno place for the sulfur gas to go. So I imagine  ", "start": 403.47, "duration": 7.56}, {"text": "that it starts building up pressure, and it \neventually gets to a breaking point. To a certain  ", "start": 411.03, "duration": 4.71}, {"text": "extent there's also probably some water mixed into \nthe mineral, which also can cause it to explode. I  ", "start": 415.74, "duration": 5.52}, {"text": "continued heating the large piece that remained \nand initially some pieces did come off of it,  ", "start": 421.26, "duration": 5.88}, {"text": "but eventually it stopped. I'm not exactly sure \nwhy it stopped breaking apart, but I'm assuming  ", "start": 427.14, "duration": 5.76}, {"text": "that it was somehow able to release some of the \ngas pressure. I kept heating it until most of  ", "start": 432.9, "duration": 5.49}, {"text": "it had become red-hot, and then I let it cool \ndown. As it cooled, the surface of it slowly  ", "start": 438.39, "duration": 5.76}, {"text": "got oxidized by oxygen in the air to make what I \nassumed was red Fe(iii)2O3. When it eventually got  ", "start": 444.15, "duration": 7.35}, {"text": "to room temperature, I thought that it was pretty \ninteresting, because it didn't look like the  ", "start": 451.5, "duration": 3.87}, {"text": "fool's gold at all anymore. There was absolutely \nno goldish yellow color left, and it was all just  ", "start": 455.37, "duration": 5.64}, {"text": "black and red. Like I just said, I think the \nred stuff was Fe(iii)2O3, but I'm not sure  ", "start": 461.01, "duration": 6.09}, {"text": "if the black stuff was FES, or Fe(ii)O. I tried \ntesting it again, by just adding some hydrochloric  ", "start": 467.1, "duration": 6.63}, {"text": "acid to the surface of it, and it kind of just \nsoaked it up. If you recall from before though,  ", "start": 473.73, "duration": 5.37}, {"text": "when I tried this with the intact pyrite, the acid \njust sat there. So apparently as it decomposed,  ", "start": 479.1, "duration": 5.76}, {"text": "it got a lot more porous. I broke it apart \nwith a hammer, and what I thought was cool,  ", "start": 484.86, "duration": 5.4}, {"text": "was that it was possible to see all the different \nlayers. On the outside was the fully reacted and  ", "start": 490.26, "duration": 5.64}, {"text": "oxidized stuff, but then right underneath it was \na layer of black FeS. Then just below that was  ", "start": 495.9, "duration": 6.48}, {"text": "the still fully intact FeS2. I really thought that \nthe heat penetrated much deeper, but apparently it  ", "start": 502.38, "duration": 6.51}, {"text": "didn't. Onto this I tried adding the hydrochloric \nacid again, and it worked a bit better. It was  ", "start": 508.89, "duration": 6.45}, {"text": "possible to see a small amount of bubbling, but \nit still wasn't as good as I would have liked it  ", "start": 515.34, "duration": 4.65}, {"text": "to be. To get it to react vigorously, I would need \nto convert a lot more to the FES. And to do this,  ", "start": 519.99, "duration": 6.66}, {"text": "I first had to crush it up. This really isn't \nvery hard to do though, because the pyrite is  ", "start": 526.65, "duration": 5.22}, {"text": "actually quite brittle. So I just added some of \nit to a mortar, and started bashing it. This was  ", "start": 531.87, "duration": 5.97}, {"text": "what I had after a few minutes, and I probably \ncould have crushed it a bit more, but I figured  ", "start": 537.84, "duration": 4.65}, {"text": "this was good enough. This was all added to a test \ntube, and I did my best to flush it with nitrogen.", "start": 542.49, "duration": 5.16}, {"text": "Then just like all the other times I blasted it \nwith a blowtorch. The reason I used the nitrogen,  ", "start": 552.0, "duration": 6.0}, {"text": "was that I hoped without any oxygen present, the \nsulfur would be able to come off, and knock it  ", "start": 558.0, "duration": 4.89}, {"text": "immediately converted to SO2. After only heating \nit a bit, it all started turning black, and I  ", "start": 562.89, "duration": 6.42}, {"text": "could see that there was a gas being released \nfrom the powder. Because of the background it  ", "start": 569.31, "duration": 4.44}, {"text": "was hard to see, but there was also a white \nvapor that had filled the tube. At the time,  ", "start": 573.75, "duration": 4.86}, {"text": "it didn't occur for me to test it, but it was \nalmost definitely sulfur maybe along with a  ", "start": 578.61, "duration": 5.1}, {"text": "bit of water vapor. What I think is cool, is that \nindustrially, pyrite is used in a very similar way  ", "start": 583.71, "duration": 6.12}, {"text": "to this, to generate elemental sulfur. Depending \non the purpose, the sulfur can be kept as is,  ", "start": 589.83, "duration": 5.64}, {"text": "or can also be converted to SO2 for \nthe paper industry, or even to SO3,  ", "start": 595.47, "duration": 5.43}, {"text": "to make sulfuric acid. When I felt like most of \nit had converted to FES, I stopped heating it,  ", "start": 600.9, "duration": 6.84}, {"text": "and I let it cool. I probably should have \nrefilled the tube with nitrogen though,  ", "start": 607.74, "duration": 4.26}, {"text": "because as it cooled, the surface was oxidized \nand it turned red. I figured this was fine because  ", "start": 612.0, "duration": 5.91}, {"text": "most of it was still black, but then I mix things, \nand saw there was still a whole bunch of pyrite.  ", "start": 617.91, "duration": 5.22}, {"text": "I apparently had the same issue as before, where \nit only really converted the stuff on the outside,  ", "start": 623.13, "duration": 4.77}, {"text": "and the stuff in the center, was more or less \nintact. This time though, I thought I still  ", "start": 627.9, "duration": 5.67}, {"text": "made more than enough, so I continued on with \nthe testing. When it got to room temperature,  ", "start": 633.57, "duration": 4.95}, {"text": "I dumped it all onto a dish, and it honestly \nkind of looked the same. Nonetheless I took a  ", "start": 638.52, "duration": 5.52}, {"text": "small sample of it, and I placed it onto another \ndish, and tried adding hydrochloric acid again.", "start": 644.04, "duration": 5.01}, {"text": "This time the reaction was way more vigorous, \nand a gas was definitely being produced. H2S  ", "start": 651.33, "duration": 6.84}, {"text": "is extremely potent, and even in small quantities \nit smells like rotten eggs. So a very simple test  ", "start": 658.17, "duration": 6.15}, {"text": "for it, is technically just to try and smell \nit. This was all done in my fume hood though,  ", "start": 664.32, "duration": 4.65}, {"text": "which apparently worked quite well, because I \ndidn't smell anything. The only real way for me to  ", "start": 668.97, "duration": 5.22}, {"text": "smell it would be to bend over and to get really \nclose to it. The problem with this though, is that  ", "start": 674.19, "duration": 5.52}, {"text": "H2S is also super toxic around the same level \nas cyanide gas, so I wasn't too excited about  ", "start": 679.71, "duration": 6.78}, {"text": "trying to take a breath of it. The much smarter \nthing is to instead use test strips. These are  ", "start": 686.49, "duration": 6.24}, {"text": "made pretty easily by soaking paper in a solution \nof lead acetate, and then letting it dry. Now if  ", "start": 692.73, "duration": 6.6}, {"text": "I was in fact making H2S, then the lead acetate \non these strips, should be able to react with it,  ", "start": 699.33, "duration": 6.12}, {"text": "to make black PbS. And when I did this, that was \nexactly what happened. I was making the H2S here  ", "start": 705.45, "duration": 7.89}, {"text": "mostly as a demo, but in general it is a useful \nchemical. In the lab, it's usually produced the  ", "start": 713.34, "duration": 6.21}, {"text": "same way, where a strong acid is reacted with FeS. \nHowever the FeS is rarely made from pyrite, and  ", "start": 719.55, "duration": 7.71}, {"text": "it's usually either purchased, or made directly, \nby reacting iron and sulfur powder. It leads to an  ", "start": 727.26, "duration": 6.42}, {"text": "extremely exothermic reaction, and this is a clip \nfrom one of the first videos that I ever posted  ", "start": 733.68, "duration": 5.16}, {"text": "to this channel. The videos that I made back then \nwere totally different, but if you're interested  ", "start": 738.84, "duration": 4.68}, {"text": "in checking it out, there's a link in the \ndescription. In any case I think that's about it,  ", "start": 743.52, "duration": 5.61}, {"text": "pyrite might not be as nearly as valuable as \nactual gold, but I think it has enough of its  ", "start": 749.13, "duration": 4.89}, {"text": "own unique properties and uses, that it more than \nmakes up for this. And honestly, I think the cheap  ", "start": 754.02, "duration": 5.88}, {"text": "price is actually a good thing, because it means \nthat most people can buy it relatively easily.  ", "start": 759.9, "duration": 4.23}, {"text": "For example, I think the large cube sample that \nI have, is one of the coolest things that I own,  ", "start": 764.13, "duration": 5.43}, {"text": "but it only cost me something around $100. In \nCanadian dollars, that's about two grams of gold,  ", "start": 769.56, "duration": 6.66}, {"text": "which is not only not very much, but also nothing \nreally impressive to look at. In any case,  ", "start": 776.22, "duration": 6.06}, {"text": "this was the first video that I did on a mineral \nand I had a lot of fun doing it. I definitely plan  ", "start": 782.28, "duration": 5.26}, {"text": "to do this again with another mineral, so in the \ncomments, let me know what you'd like to see. I  ", "start": 787.54, "duration": 4.53}, {"text": "ended up getting really behind schedule editing \nthis video, so I'm probably gonna be posting it  ", "start": 792.07, "duration": 6.99}, {"text": "from the airport, on my way to Japan for vacation. \nTo do this though, I'll have to connect to the  ", "start": 799.06, "duration": 5.43}, {"text": "public airport Wi-Fi, which isn't really secure, \nand kind of makes me nervous. However luckily,  ", "start": 804.49, "duration": 6.12}, {"text": "services like Nord VPN exist, which allow me to \nkeep my data safe, by encrypting everything that's  ", "start": 810.61, "duration": 5.82}, {"text": "sent, and received by my computer. This way, I can \nlog into all my accounts, or even buy things with  ", "start": 816.43, "duration": 6.06}, {"text": "my credit card, without worrying about getting my \ninfo or passwords stolen. On top of this though,  ", "start": 822.49, "duration": 5.46}, {"text": "there are a whole bunch of other benefits of \nNord VPN. For example, it has a built-in add  ", "start": 827.95, "duration": 5.43}, {"text": "and malware blocker, and it also anonymizes \nyou on the internet, making it difficult to  ", "start": 833.38, "duration": 4.86}, {"text": "track or spy on your activity. What I especially \nlike, is that they have a super easy to use app,  ", "start": 838.24, "duration": 5.79}, {"text": "that works on all mobile devices, as well as \nlaptops and desktops. All I need to do is just  ", "start": 844.03, "duration": 5.82}, {"text": "click one button, and it's done automatically. \nThere is also the option to do it manually though,  ", "start": 849.85, "duration": 5.28}, {"text": "and you can choose from one of their over 5,000 \nservers, around the world. So with that being  ", "start": 855.13, "duration": 5.4}, {"text": "said, I've been using Nord VPN for about a year \nnow, and I highly recommend it. Also right now,  ", "start": 860.53, "duration": 6.18}, {"text": "they're offering a great deal, that gives you \n75% off their three-year plan, as well as one  ", "start": 866.71, "duration": 5.19}, {"text": "extra free month. You can get this by going to \nnordvpn.com/nilered, or by clicking the link in  ", "start": 871.9, "duration": 6.66}, {"text": "the description. As a side note, some of you might \nbe wondering why I'm posting the video on the way  ", "start": 878.56, "duration": 5.94}, {"text": "to Japan, and not when I get there. My answer to \nthis is kind of simple, where A I don't really  ", "start": 884.5, "duration": 6.21}, {"text": "want to be working on videos once I get there, \nand B I just think it could be fun. I'm gonna be  ", "start": 890.71, "duration": 5.52}, {"text": "having a 14 hour plane ride between Minnesota \nand Tokyo, and I just thought that it could  ", "start": 896.23, "duration": 4.41}, {"text": "be interesting, to buy Wi-Fi and to answer your \ncomments from the air. As usual a big thanks goes  ", "start": 900.64, "duration": 19.8}, {"text": "out to all my supporters on Patreon. Everyone who \nsupports me can see my videos at least 24 hours  ", "start": 920.44, "duration": 6.09}, {"text": "before I post them to YouTube. Also everyone \non Patreon can directly message me, and if you  ", "start": 926.53, "duration": 6.0}, {"text": "support me with five dollars or more, you'll \nget your name, at the end like you see here.", "start": 932.53, "duration": 3.93}]