[{"text": "Hi. Today, I'd like to talk about one of the most stupid products out there called USB killer.", "start": 0.0, "duration": 6.06}, {"text": "It looks like one of these USB flash memories that you plug into your device, computer, or phone then BOOM", "start": 6.06, "duration": 6.299}, {"text": "It kills your device. Let's buy one to try.", "start": 12.36, "duration": 3.18}, {"text": "It's...", "start": 16.26, "duration": 0.58}, {"text": "$218?! Forget about it, if I ever want to kill something I have my own ways. Here's one way for a dollar or two.", "start": 17.06, "duration": 8.1}, {"text": "Never try this, of course. Very dangerous.", "start": 25.68, "duration": 2.54}, {"text": "It is illegal to destroy other people's properties, but this is my wife's computer mine, hers, what's the difference?", "start": 29.52, "duration": 6.62}, {"text": "*sparks*", "start": 36.62, "duration": 0.5}, {"text": "F-[beep].", "start": 37.48, "duration": 0.78}, {"text": "It's gone... Very effective. I have more cheap ways", "start": 38.38, "duration": 2.96}, {"text": "But why? Let's see how the USB killer works... 'When plugged into a device the USB killer", "start": 41.34, "duration": 5.22}, {"text": "rapidly charges its capacitors from the USB power lines. When the device is charged, -200 volt DC", "start": 46.56, "duration": 6.44}, {"text": "is discharged over the data lines of the host device. The cycle is repeated many times per second.'", "start": 53.01, "duration": 6.24}, {"text": "Okay,", "start": 59.289, "duration": 0.5}, {"text": "then what is it for? Can it eliminate your sensitive data quickly?", "start": 59.789, "duration": 3.511}, {"text": "Is data affected? 'When tested on computers the device is not designed or intended to erase data.' Then what is it for?", "start": 63.96, "duration": 8.22}, {"text": "Abuse.", "start": 72.46, "duration": 1.04}, {"text": "'USBKill.com strongly condemns malicious use of the product.' What is this for then?", "start": 73.5, "duration": 5.54}, {"text": "'The USB killer is developed and sold as a testing device.'? The industry's most powerful ESD tester.'?", "start": 79.18, "duration": 7.129}, {"text": "This is not an ESD tester, read the title!", "start": 86.31, "duration": 2.279}, {"text": "It's a USB killer. A tester is used by a designer to improve a product.", "start": 88.59, "duration": 4.29}, {"text": "The killer is designed to kill. The new version is one and a half times more", "start": 92.88, "duration": 4.02}, {"text": "powerful and three times faster discharge cycle. If it is a tester, why does it have to get stronger? Are there no limits?", "start": 97.09, "duration": 6.709}, {"text": "What is this USB killer tester? 'Protect yourself against USB power surge attacks.'?", "start": 104.04, "duration": 6.059}, {"text": "So they make the weapon and sell the defense against it too? And now with Anonymous Edition, so it's not obvious", "start": 110.29, "duration": 6.199}, {"text": "It's a USB killer. What are they testing? People's intelligence to see if they plug anything into their computer?", "start": 116.5, "duration": 5.659}, {"text": "Hm, 'strongly condemned malicious use.' It is made", "start": 122.68, "duration": 2.329}, {"text": "stronger, to make sure it kills, but it can't erase your data. Like, if police raids my home and I want to quickly", "start": 125.16, "duration": 5.58}, {"text": "get rid of my tax fraud data from my computer, it doesn't help... Not that I have such data.", "start": 130.74, "duration": 5.34}, {"text": "No consumer standard I know requires passing such an ESD test.", "start": 136.08, "duration": 3.96}, {"text": "If it walks like a duck and [beep]s like a duck, then it's for malicious use! It is made", "start": 140.04, "duration": 5.03}, {"text": "for people to kill each other's devices. What other purpose does it serve?", "start": 145.07, "duration": 3.71}, {"text": "I mean there are arsons who like to set sh*t on fire and then there are USB killers.", "start": 148.78, "duration": 4.34}, {"text": "Vandals. People who like to destroy other people's properties. And that's why this video is sponsored by", "start": 153.18, "duration": 5.2}, {"text": "Audible. If you feel the urge to destroy something, put your headsets on get a nice book from audible self-help category,", "start": 158.61, "duration": 7.16}, {"text": "get comfortable and let the knowledge and wisdom run through you,", "start": 166.05, "duration": 4.19}, {"text": "and you shall find salvation...", "start": 170.84, "duration": 2.28}, {"text": "Seriously, use my link audible.com/electroboom", "start": 173.76, "duration": 3.3}, {"text": "Or text ElectroBOOM at 500-500,", "start": 177.2, "duration": 2.16}, {"text": "and get 30 day of free trial and one free audiobook and two audible originals! Use the link!", "start": 179.42, "duration": 6.34}, {"text": "Use the link now...", "start": 185.76, "duration": 1.18}, {"text": "I'm sure you will find a book that will help your condition. Whatever it is.", "start": 186.94, "duration": 3.76}, {"text": "So we won't waste your money on a USB killer and it's so expensive, too. You want to kill a device,", "start": 190.7, "duration": 5.22}, {"text": "just dunk it in water when it's on. Or just for a few dollars, you can buy a hammer.", "start": 196.04, "duration": 4.74}, {"text": "*heaves then smashes computer*", "start": 201.1, "duration": 0.68}, {"text": "If you want to spend a bit more money,", "start": 201.94, "duration": 0.76}, {"text": "you can buy a handsaw, a chainsaw, hydraulic press or if you're in US, you can buy a sh*tgun.", "start": 203.2, "duration": 5.98}, {"text": "*shotgun reload*", "start": 209.18, "duration": 0.6}, {"text": "but if you are in Soviet, Russia, the USB kills you...", "start": 210.02, "duration": 3.82}, {"text": "*USSR Anthem*", "start": 213.86, "duration": 3.18}, {"text": "Okay, I'll show you how to make some cheap high voltage sources that you can use to kill your own electronics.", "start": 217.04, "duration": 5.28}, {"text": "I can't imagine any other legal reason for it. Obviously, the first source is in your wall outlet", "start": 222.32, "duration": 5.22}, {"text": "like I showed. Even Wikipedia doesn't say if it is good for any reasonable purpose.", "start": 227.54, "duration": 4.47}, {"text": "College of Saint Rose incident... 'A former student of the College of Saint Rose pleaded guilty to destroying", "start": 232.86, "duration": 5.659}, {"text": "59 COMPUTERS AT THE COLLEGE USING A USB KILLER... He also destroyed seven computer monitors and stuff.' So far", "start": 238.92, "duration": 6.949}, {"text": "It's only used for malicious purposes. I'm telling you there is no other reason for it. Oh, hey.", "start": 245.87, "duration": 4.35}, {"text": "[Mehdi 2] Hey, man, take a listen to my latest mixtape on this.", "start": 250.22, "duration": 2.96}, {"text": "[Original Mehdi] Ooh, let's hear it out...", "start": 253.18, "duration": 0.96}, {"text": "*fumbles USB*", "start": 254.14, "duration": 1.319}, {"text": "Backwards?", "start": 255.959, "duration": 1.81}, {"text": "Backwards again.", "start": 258.26, "duration": 0.7}, {"text": "[Mehdi 2] Hurry up, caveman.", "start": 259.42, "duration": 1.06}, {"text": "[Original Mehdi] There we go.", "start": 260.76, "duration": 0.5}, {"text": "*sparks*", "start": 261.58, "duration": 0.5}, {"text": "F*CK!", "start": 262.08, "duration": 0.64}, {"text": "[Mehdi 2, laughing] It was a prank, man, you're such an idiot! You plug anything into your computer? Now it's gone.", "start": 262.88, "duration": 5.84}, {"text": "Hm, you should see the look on your face right now.", "start": 268.76, "duration": 2.16}, {"text": "[Original Mehdi] But, I trusted you...", "start": 270.92, "duration": 1.52}, {"text": "[Mehdi 2] It was just a prank, bro.", "start": 272.6, "duration": 1.36}, {"text": "Don't beat yourself up for your stupidity.", "start": 273.96, "duration": 2.1}, {"text": "[Original Mehdi] My life's work was on this computer.", "start": 276.06, "duration": 1.72}, {"text": "[Mehdi 2] Eh, don't worry.", "start": 277.78, "duration": 0.78}, {"text": "It kills your USB port and likely your motherboard. But won't erase your data.", "start": 278.56, "duration": 5.0}, {"text": "[Original Mehdi] Ah, then we are good. High-five!", "start": 283.56, "duration": 0.5}, {"text": "*Mehdi high fives himself*", "start": 284.06, "duration": 0.5}, {"text": "Yeah, unless you have solid-state drive memory, that is!", "start": 284.64, "duration": 2.32}, {"text": "*sad music*", "start": 286.96, "duration": 2.52}, {"text": "Okay, here are a few cheap ways after all, I'm an expert at that.", "start": 289.48, "duration": 3.63}, {"text": "But frankly some of my methods may kill more than your device. So never try them on anything.", "start": 293.11, "duration": 4.59}, {"text": "And remember, it's illegal to use any of these to damage other people's properties!", "start": 297.77, "duration": 4.339}, {"text": "You have already seen my 120 volt to USB converter.", "start": 302.11, "duration": 3.06}, {"text": "It probably burns everything in your computer and sets your battery on fire and eventually burns your whole house down. Very effective.", "start": 305.36, "duration": 7.76}, {"text": "Oh, you want something more subtle? Okay.", "start": 313.12, "duration": 2.06}, {"text": "Here, I've torn my old camera apart to get to its heart, which is the flash capacitor.", "start": 315.18, "duration": 5.58}, {"text": "These babies can hold hundreds of volts and output short pulses of hundred amps.", "start": 320.92, "duration": 5.48}, {"text": "Now take a FULL BRIDGE RECTIFIER and solder a power plug to its AC lines.", "start": 326.4, "duration": 6.48}, {"text": "Then solder the flash capacitor to the DC output of the rectifier,", "start": 333.56, "duration": 4.44}, {"text": "minding its polarity. Then solder only the USB data lines to the DC output", "start": 338.36, "duration": 5.42}, {"text": "across the capacitor. Now It's ready to go. You just plug it into the power line,", "start": 344.06, "duration": 4.369}, {"text": "It charges right away and you can unplug. Then you charge-", "start": 348.429, "duration": 3.391}, {"text": "SH*T! *bleep*", "start": 351.88, "duration": 1.54}, {"text": "Yep, it is holding close to 170 volt DC. So we better isolate the circuit", "start": 353.42, "duration": 6.7}, {"text": "vigorously with a lot of...", "start": 360.2, "duration": 1.92}, {"text": "electric tape. Okay. Let's plug it in and listen for it...", "start": 362.12, "duration": 4.14}, {"text": "*snap*", "start": 367.6, "duration": 0.5}, {"text": "There you go. The capacitor discharges over your motherboard and kills a few things. Oh you want it to be battery-operated now, huh?", "start": 368.26, "duration": 6.5}, {"text": "*sighs*", "start": 374.76, "duration": 1.04}, {"text": "Too bad, I guess we could use the same camera to charge the capacitor, but I totally broke it now.", "start": 375.8, "duration": 5.14}, {"text": "Hold that thought...", "start": 382.62, "duration": 0.96}, {"text": "*piano music*", "start": 383.58, "duration": 1.56}, {"text": "Nyah, there, I'm back with four", "start": 385.14, "duration": 2.88}, {"text": "Disposable cameras with flash. I picked these up from my local photo studio where they recycle them.", "start": 388.02, "duration": 6.4}, {"text": "See the circuit works fine with battery and everything. Let's open it up. Okay, here we are. Now. How does it work?", "start": 394.44, "duration": 6.28}, {"text": "Ow! Sh*t!", "start": 400.8, "duration": 1.88}, {"text": "Ooh, the capacitor charges up to 300 volts. This stupid flash capacitor is still charged.", "start": 402.69, "duration": 6.079}, {"text": "Let's discharge it first before touching it...", "start": 408.769, "duration": 1.991}, {"text": "*BANG* Sh*t.", "start": 411.24, "duration": 1.28}, {"text": "These things are violent, okay. I think I figured out how it works, first, you close these contacts for the...", "start": 412.52, "duration": 6.2}, {"text": "Flash to charge and then you close these two to make it flash. Ow, my eyes.", "start": 419.58, "duration": 5.93}, {"text": "So really, all you need to do is to wire the USB data lines to your flash and every time you take a picture a", "start": 425.82, "duration": 5.98}, {"text": "Computer dies. Chicka-boom. Oh, this solution is too big for you? Let me show you an even smaller one.", "start": 431.8, "duration": 5.46}, {"text": "I bought this novelty gun from my local dollar store and when you press the trigger-", "start": 437.56, "duration": 3.88}, {"text": "AH, SH*T! RRGH!", "start": 441.44, "duration": 0.94}, {"text": "WHY?!", "start": 442.38, "duration": 1.71}, {"text": "It zaps you when you press the trigger. A very cool trick to end a few friendships. Here, I've opened it up", "start": 444.09, "duration": 5.959}, {"text": "These are the batteries and this is a tiny transformer. That's like a car ignition coil.", "start": 450.05, "duration": 5.13}, {"text": "And this is the chip that turns the transformer on and off. Let's measure the output.", "start": 455.18, "duration": 5.04}, {"text": "Look at this! Pulses over 1.1 kilovolt happening around every 10 milliseconds,", "start": 460.68, "duration": 5.21}, {"text": "so really just hook these up to the data line of your USB.", "start": 465.89, "duration": 3.0}, {"text": "But I can imagine they can't really supply too much current.", "start": 469.14, "duration": 2.899}, {"text": "So I use a puny high voltage single diode to charge the capacitor from the output of the circuit so that the", "start": 472.11, "duration": 6.8}, {"text": "capacitor can provide the super high current. Let's start charging the capacitor...", "start": 479.12, "duration": 4.1}, {"text": "Wow the voltage rises so slowly. This circuit really can't provide too much output current. Let's wait for it...", "start": 484.94, "duration": 6.52}, {"text": "*cheery piano music*", "start": 491.68, "duration": 2.4}, {"text": "*sigh* Nevermind this solution takes too long to charge because the circuit can output very little current", "start": 494.16, "duration": 5.1}, {"text": "*pop*", "start": 499.32, "duration": 0.5}, {"text": "Use the previous solutions.", "start": 500.28, "duration": 2.0}, {"text": "I mean, don't use them. Just learn the circuits.", "start": 502.62, "duration": 2.72}, {"text": "So there. Some interesting solutions to create high voltage sources, but let's not kid ourselves beside abuse,", "start": 505.34, "duration": 6.239}, {"text": "there is no reason to use a USB killer on a computer. They keep pushing it as a tester.", "start": 511.58, "duration": 4.769}, {"text": "No. A product designer has to design pair standards for real-life situations.", "start": 516.649, "duration": 4.799}, {"text": "Like if the USB cable gets pinched it must be able to withstand", "start": 521.448, "duration": 4.112}, {"text": "short-circuit within the power and data lines, or reverse polarity protection, or real-life human body.", "start": 525.6, "duration": 5.38}, {"text": "Electrostatic discharge, like the one I showed in my first video ever.", "start": 530.98, "duration": 3.9}, {"text": "\"The tip of the gun here simulates a human finger- *zap*", "start": 534.94, "duration": 2.76}, {"text": "ack, sh*t!", "start": 537.82, "duration": 1.06}, {"text": "Always be careful with your tools.\"", "start": 539.76, "duration": 2.14}, {"text": "Selling this junk as a tester is like selling a bomb to test your house against earthquake.", "start": 541.9, "duration": 5.0}, {"text": "No manufacturer has to pass such stupid criteria. You can always make something stronger to kill your device.", "start": 546.9, "duration": 5.88}, {"text": "Although I don't know do they actually use bombs to simulate earthquakes?", "start": 553.08, "duration": 4.04}, {"text": "Even if they do,", "start": 557.12, "duration": 0.8}, {"text": "they won't sell it to regular people. And they already say on their website that it will likely not erase your data.", "start": 557.929, "duration": 5.85}, {"text": "See what they do is that they take the 5 volt supply of the USB port and", "start": 563.94, "duration": 3.84}, {"text": "charge a capacitor to over 200 volt DC and then switch that high voltage over the data lines.", "start": 567.98, "duration": 5.84}, {"text": "The first thing it will kill is your USB interface.", "start": 574.14, "duration": 3.02}, {"text": "Everything else will likely survive. If the pulse is super strong,", "start": 577.439, "duration": 3.65}, {"text": "it may kill your processor still your memories may survive. If you're super lucky and the pulse is very strong,", "start": 581.089, "duration": 6.78}, {"text": "It may kill the solid-state memory chips and remove your data. Or also kill the hard disk drive interface", "start": 587.869, "duration": 7.811}, {"text": "electronics, which won't remove your data because the data is written on magnetic disks.", "start": 595.94, "duration": 5.28}, {"text": "So if you think this will clear your browser history it very likely won't.", "start": 601.22, "duration": 4.409}, {"text": "Unless your laptop is hit by a lightning, your data will be recoverable.", "start": 605.76, "duration": 4.04}, {"text": "Abuse and vandalism. There is no other reason for it.", "start": 609.8, "duration": 2.82}, {"text": "So before you buy it ask yourself, did you take your pill this morning?", "start": 612.62, "duration": 4.12}, {"text": "Or maybe you should see a doctor for the urges you get to destroy people's property.", "start": 616.74, "duration": 4.54}, {"text": "Either way reading, a good book can help you find your center.", "start": 621.29, "duration": 3.809}, {"text": "*water coming out of tap and groaning in annoyance*", "start": 625.099, "duration": 2.0}, {"text": "Or even better, use audible to listen to a book while doing one of those long, repetitive,", "start": 627.1, "duration": 5.76}, {"text": "mindless tasks. If you're a bookworm or just a juvenile larva getting into books audible has what you're looking for.", "start": 633.16, "duration": 7.04}, {"text": "You can download the book on your device and you'll own it.", "start": 640.2, "duration": 2.72}, {"text": "And even if you don't like the book you got, you can swap it.", "start": 642.92, "duration": 2.669}, {"text": "Make sure to use my link audible.com/electroboom", "start": 645.72, "duration": 3.68}, {"text": "Or text ElectroBOOM to 500-500,", "start": 649.4, "duration": 2.46}, {"text": "and get a book from any category you like, from nature to science, to business, to physics,", "start": 652.02, "duration": 5.66}, {"text": "professionally narrated, some by famous authors and actors. I have already finished listening to Tesla's autobiography.", "start": 657.92, "duration": 6.98}, {"text": "And now I have some opinions about this gentleman.", "start": 664.91, "duration": 3.149}, {"text": "Now, I'd like to get the Astrophysics for People in a Hurry written and narrated by the soothing voice of the Neil deGrasse Tyson.", "start": 668.06, "duration": 7.48}, {"text": "\"...Up to T=10-\"", "start": 675.54, "duration": 2.08}, {"text": "Thanks for watching!", "start": 677.66, "duration": 8.42}]