[{"text": "There are literally", "start": 0.039, "duration": 1.981}, {"text": "thousands of", "start": 2.02, "duration": 1.169}, {"text": "imperfect choices for mechanical keyboards out there and", "start": 3.189, "duration": 3.14}, {"text": "You can customize them a little, add some o-rings here, change some key caps there, Luke actually did a guide.", "start": 6.78, "duration": 6.78}, {"text": "Luke: \"Welcome to the ultimate Mechanical keyboard guide\"", "start": 13.56, "duration": 2.32}, {"text": "but unless you have the know-how to actually build one yourself", "start": 15.88, "duration": 4.52}, {"text": "You're at the mercy of those that do, or are you?", "start": 20.46, "duration": 4.34}, {"text": "What if I told you it didn't have to be like that?", "start": 25.42, "duration": 3.409}, {"text": "What if I told you that there are more options out there than you might have realized what if I told you that?", "start": 29.28, "duration": 7.3}, {"text": "Today's video is brought to you by ifixit.", "start": 36.96, "duration": 2.78}, {"text": "ifixit's pro tech tool kit gives you the tools you need to tackle any electronics repair challenge.", "start": 39.74, "duration": 4.42}, {"text": "visit ifixit.com/linus at the link below and get yours today", "start": 44.16, "duration": 3.66}, {"text": "Linus Singing: \"Do you want to build a keyboard", "start": 48.36, "duration": 2.82}, {"text": "use any switches that you like", "start": 51.24, "duration": 2.76}, {"text": "It could be. ahh. ah.\"", "start": 54.82, "duration": 2.38}, {"text": "Alright, so let's go over what we set out to accomplish here because when Anthony first came to me with this idea", "start": 58.02, "duration": 6.14}, {"text": "he had like these grand visions of", "start": 64.17, "duration": 2.309}, {"text": "programming", "start": 67.119, "duration": 1.141}, {"text": "microcontrollers and soldering diodes using 3d printed or laser-cut chassis and a bunch of other things that are really cool, but", "start": 68.26, "duration": 7.819}, {"text": "This is our first rodeo so we decided to focus on getting one working first", "start": 77.259, "duration": 4.58}, {"text": "So with that in mind then we narrowed our search to parts that can bolt together", "start": 82.299, "duration": 4.819}, {"text": "relatively easily", "start": 87.82, "duration": 1.74}, {"text": "Meaning though that we can expect to pay a premium looking at what's available there's a lot of ten keyless components out there", "start": 89.56, "duration": 6.68}, {"text": "But then even more options for the smaller and simpler", "start": 96.25, "duration": 3.979}, {"text": "60% layout so we settled on that starting at mechanicalkeyboards.com for some essential supplies", "start": 100.84, "duration": 5.389}, {"text": "Cherry MX brown RGB key switches", "start": 107.049, "duration": 2.63}, {"text": "three choices of beautiful", "start": 110.68, "duration": 2.029}, {"text": "Anodized aluminum cases to put everything into and then a selection of Springs that we can use to actually", "start": 113.77, "duration": 6.26}, {"text": "customize the feel of our switches", "start": 120.549, "duration": 2.389}, {"text": "So this way we could make the caps lock key or the function key more difficult to press", "start": 122.939, "duration": 5.64}, {"text": "Accidentally, and then we could even reduce the actuation force of keys like w,a,s,d", "start": 128.95, "duration": 4.55}, {"text": "Or even the whole alphanumeric set to improve our speed while maintaining that satisfying tactile bump of the Cherry MX brown", "start": 134.099, "duration": 7.589}, {"text": "Like the beauty here whoop is that the sky's the limit", "start": 142.15, "duration": 4.639}, {"text": "for Customizability, but", "start": 149.68, "duration": 1.949}, {"text": "while it's really fun to play around with a bag full of cherry MXs a", "start": 151.629, "duration": 4.34}, {"text": "chassis and a bag of key switches a keyboard", "start": 156.579, "duration": 3.32}, {"text": "Does not make so we are going to need to wire them up now some folks do this manually but a PCB", "start": 160.12, "duration": 7.58}, {"text": "Preferably one that is well documented is much easier not to mention a lot tinier now", "start": 168.4, "duration": 5.72}, {"text": "There are lots of options out there", "start": 174.12, "duration": 2.22}, {"text": "but for our project we turned to banggood where we found not only this nice wooden case actually this thing's really nice and", "start": 176.34, "duration": 6.929}, {"text": "Wrist rest but also Satan no seriously", "start": 183.4, "duration": 3.649}, {"text": "We found the satan GH 60 a fully programmable keyboard PCB that seems to check all the essential boxes", "start": 187.2, "duration": 7.529}, {"text": "It's got macro support and RGB variant", "start": 194.909, "duration": 3.12}, {"text": "And it is widely used in the DIY community as a budget option", "start": 198.03, "duration": 3.989}, {"text": "so with the power of satan and a plate to go over it we started to write", "start": 202.269, "duration": 6.95}, {"text": "I said no soldering for this video", "start": 210.4, "duration": 2.0}, {"text": "So we just really wanted to make that Satan joke so maybe we'll do a follow up later with the Dark Prince GH60", "start": 212.5, "duration": 4.579}, {"text": "anyway after some more digging for a plug-and-play option we found this on a store called", "start": 217.09, "duration": 5.0}, {"text": "Kbd fans the geek customized GK 64 from semi tech", "start": 222.43, "duration": 5.239}, {"text": "This PCB is pre-built with hot swap terminals, so not only will we not need to solder anything ourselves,", "start": 227.949, "duration": 6.17}, {"text": "we can much more easily pull our key switches if you want to adjust the springs or", "start": 234.519, "duration": 4.459}, {"text": "Replace them altogether and it gets bonus points for using a detachable USB type-c connection and having multiple", "start": 239.29, "duration": 6.86}, {"text": "RGB modes including", "start": 246.76, "duration": 2.0}, {"text": "Check this out you guys this lit AF sound activated mode", "start": 249.04, "duration": 4.909}, {"text": "courtesy of a little microphone built into the keyboard", "start": 254.44, "duration": 2.989}, {"text": "Before you ask that microphone can't be used for sound input and for good reason", "start": 263.05, "duration": 4.97}, {"text": "I mean imagine your clanmates if you put your headset", "start": 268.14, "duration": 2.91}, {"text": "microphone right next to your cherry MX blues, right", "start": 272.05, "duration": 3.289}, {"text": "Anyway, so while we were talking to way over at KBDfans,we also requested his stylish Tina chassis a", "start": 275.92, "duration": 7.039}, {"text": "full set of key caps and", "start": 283.51, "duration": 2.0}, {"text": "stabilizers and another plate to fit our GK 64 which finally completes then our", "start": 286.45, "duration": 5.809}, {"text": "component checklist oh", "start": 292.9, "duration": 2.0}, {"text": "And we also got these which I caught Anthony working on", "start": 295.45, "duration": 5.419}, {"text": "And he assured me was productive, but I will let you guys be the judge", "start": 301.81, "duration": 5.029}, {"text": "All this left now is to put it together and see how well it works um, okay, so let's assemble this thing", "start": 307.72, "duration": 5.69}, {"text": "So we start with what ?screwing down the PCB? Yes, that was relatively straightforward", "start": 315.28, "duration": 4.88}, {"text": "So spacebar", "start": 321.91, "duration": 2.0}, {"text": "Where's the hole I can't do this so that seems to go on that way mm-hmm", "start": 324.97, "duration": 5.059}, {"text": "What'd they do that on the doodad cool? This is fun?", "start": 331.12, "duration": 3.5}, {"text": "All good in hood", "start": 338.2, "duration": 1.17}, {"text": "But it doesn't even sit like evenly like it's bowed up in the middle", "start": 339.37, "duration": 3.739}, {"text": "So you're sure it wouldn't be faster to clip these into here, and then put the whole thing down hmm", "start": 343.45, "duration": 3.859}, {"text": "Yeah, it's probably better to do that. Okay, wait, but there's to know there's some wiggle room. Yeah exactly", "start": 347.92, "duration": 5.3}, {"text": "oh...", "start": 353.6, "duration": 1.4}, {"text": "Yeah, yeah here, let's grab. Let's grab the stiffer one for the spacebar yeah", "start": 361.42, "duration": 5.0}, {"text": "Like a much stiffer one. Okay? Where's 100-meter grams cool? Oh?", "start": 367.23, "duration": 4.01}, {"text": "Okay, cool. Yeah, let's try it", "start": 372.3, "duration": 0.5}, {"text": "I dont think I'd recommend it", "start": 372.8, "duration": 1.5}, {"text": "Oh", "start": 375.75, "duration": 1.38}, {"text": "Wow, it's like. It's like yeah. It feels like it's pushing you away from the table. Okay progress. Let's do a quick light up test", "start": 377.13, "duration": 7.49}, {"text": "Hey", "start": 385.44, "duration": 1.2}, {"text": "Not bad", "start": 386.64, "duration": 1.74}, {"text": "huh all right so now we can put all the", "start": 388.38, "duration": 2.99}, {"text": "key caps on!", "start": 392.22, "duration": 2.0}, {"text": "oh,these aren't labeled", "start": 394.53, "duration": 1.65}, {"text": "or Are they?", "start": 396.18, "duration": 2.0}, {"text": "Well backspace isn't working. O isn't it working", "start": 402.03, "duration": 2.539}, {"text": "How concerned out of ten should be beyond that about that?", "start": 405.99, "duration": 3.559}, {"text": "Here we go and that is one bent ass pin right there", "start": 411.09, "duration": 6.049}, {"text": "bent right over", "start": 418.92, "duration": 1.95}, {"text": "Yeah, I would recommend buying some extras if you're gonna undertake a project like this so everything is tested all in all I'd say", "start": 420.87, "duration": 7.85}, {"text": "that 60%", "start": 428.72, "duration": 2.0}, {"text": "It's gonna take some getting used to you got a super short shift over here your delete key is way down here", "start": 431.94, "duration": 5.39}, {"text": "You don't have function keys obviously, but overall", "start": 438.42, "duration": 3.32}, {"text": "Pretty pleased with the with the end product here. It's compact its programmable", "start": 442.44, "duration": 5.929}, {"text": "It's super portable. We don't have the ability to RGB sync it with you know", "start": 448.65, "duration": 5.509}, {"text": "Asus AURA or Razer synapse or anything", "start": 454.71, "duration": 2.719}, {"text": "but", "start": 457.5, "duration": 0.99}, {"text": "We could change out its case anytime we wanted we can make adjustments to the force of the individual keys", "start": 458.49, "duration": 6.29}, {"text": "I mean, it's fantastic", "start": 464.78, "duration": 2.0}, {"text": "So you might be sitting there thinking gee that sounds great linus does that mean I should do it, too?", "start": 467.19, "duration": 5.809}, {"text": "well that", "start": 473.7, "duration": 1.74}, {"text": "Really depends on how much you value your time", "start": 475.44, "duration": 2.989}, {"text": "And how much you value your money?", "start": 478.83, "duration": 2.539}, {"text": "Not only did this involve about an hour's worth of work not accounting all the research of finding all the parts and ordering them our", "start": 481.74, "duration": 7.429}, {"text": "bulk together approach means that our total cost", "start": 489.48, "duration": 2.66}, {"text": "topped", "start": 493.049, "duration": 1.781}, {"text": "350 US dollars before shipping or taxes", "start": 494.83, "duration": 3.949}, {"text": "I mean many people already bulk at the idea of a hundred dollar keyboard", "start": 498.779, "duration": 5.1}, {"text": "So this is clearly a deep rabbit hole for the amateur the more adventurous among us could", "start": 503.879, "duration": 7.26}, {"text": "Salvage from old keyboards or even build or 3d print their own cases", "start": 511.81, "duration": 4.519}, {"text": "But there will always be caveats no matter who you are", "start": 516.37, "duration": 3.949}, {"text": "You won't get a warranty by going totally custom, so if you care about that", "start": 520.629, "duration": 6.2}, {"text": "So in the end then while this may not be", "start": 527.92, "duration": 2.839}, {"text": "Hands-down the best mechanical keyboard ever certainly not for the price", "start": 531.49, "duration": 4.369}, {"text": "Nor was it quite as down and dirty DIY as it could have been its uniquely ours and for some people", "start": 536.35, "duration": 7.429}, {"text": "That's gonna be worth it", "start": 543.819, "duration": 1.281}, {"text": "So let us know would you build your own keyboard in the comments below and let us know if you'd like to see more", "start": 545.1, "duration": 6.57}, {"text": "DIY keyboard stuff in the future", "start": 552.879, "duration": 1.82}, {"text": "Maybe next time I'll even let Anthony at the soldering iron", "start": 554.699, "duration": 3.119}, {"text": "blue apron is perfect for those of you out there trying to keep to your New Year's resolutions especially if they were eating healthier and", "start": 558.22, "duration": 7.28}, {"text": "Cooking at home blue apron allows you to create delicious chef inspired recipes at home", "start": 565.99, "duration": 5.0}, {"text": "By delivering all the farm-fresh ingredients you need right to your doorstep in exactly the right proportions", "start": 571.42, "duration": 5.75}, {"text": "No waste and no trips to the grocery", "start": 577.42, "duration": 2.69}, {"text": "Store they offer two types of plans the two-person plan and the family plan and there are eight", "start": 580.18, "duration": 5.809}, {"text": "Recipes to choose from each week now instead of six so you can pick any combination", "start": 586.48, "duration": 5.51}, {"text": "you'd like and they're always adding new dishes to the menu blue apron recipes are delivered in a", "start": 591.99, "duration": 5.039}, {"text": "Refrigerated box so the ingredients will stay fresh even if you're not at home, and they ship to most of the USA", "start": 597.129, "duration": 6.2}, {"text": "There's no commitment", "start": 603.339, "duration": 0.98}, {"text": "you can skip or cancel the service at any time and prices starting as low as", "start": 604.319, "duration": 3.57}, {"text": "$8.99 per serving check it out at the link in the video description", "start": 608.35, "duration": 2.929}, {"text": "And the first 100 people to sign up will get 30 bucks off their first blue apron order", "start": 611.5, "duration": 4.849}, {"text": "So thanks for watching guys if this video sucked", "start": 617.079, "duration": 2.21}, {"text": "Do you know what to do?", "start": 619.29, "duration": 0.63}, {"text": "But if it was awesome get subscribed hit that like button or check out the link to where to buy the stuff we featured in", "start": 619.92, "duration": 5.13}, {"text": "The video description also linked down. There's our merch storage has cool shirts like this one and our community forum, which you should totally join", "start": 625.05, "duration": 6.96}, {"text": "Three hundred and fifty bucks. This is expensive, but like", "start": 632.71, "duration": 2.479}, {"text": "Listen to this thing", "start": 637.18, "duration": 2.0}, {"text": "You could kill a man", "start": 639.7, "duration": 2.0}]