[{"text": "The year was 2017", "start": 0.02, "duration": 2.72}, {"text": "and while the Marvel Cinematic Universe was gearing up for a giant Avengers movie", "start": 2.88, "duration": 5.78}, {"text": "another superhero team was about to form.", "start": 8.7, "duration": 3.88}, {"text": "Made up of a justice obsessed vigilante who fights crime as a way to deal with a childhood loss", "start": 12.58, "duration": 6.48}, {"text": "a super-strong warrior woman who could... kind of fly", "start": 19.08, "duration": 4.4}, {"text": "an impossibly cool invulnerable muscle man", "start": 23.48, "duration": 4.28}, {"text": "and a naive kid; they were finally going to team up.", "start": 27.76, "duration": 4.38}, {"text": "And yeah, not every character's individual solo story was a slam dunk", "start": 32.14, "duration": 4.42}, {"text": "but there was promise, and this was the chance for this set of heroes to finally come together", "start": 36.56, "duration": 5.46}, {"text": "and show the world that they were on the Avengers level.", "start": 42.02, "duration": 3.64}, {"text": "I am of course talking about Marvel Netflix's \"The Defenders\"", "start": 46.06, "duration": 3.86}, {"text": "I mean you probably saw the title of this video, knew I wasn't talking about the Justice League,", "start": 49.92, "duration": 4.76}, {"text": "but still, solid bit.", "start": 54.68, "duration": 1.46}, {"text": "*Music Plays*", "start": 56.14, "duration": 2.0}, {"text": "I'm willing to bet that you have not seen \"The Defenders\", and even if you saw it,", "start": 60.94, "duration": 4.49}, {"text": "I have a feeling you've forgotten most of it.", "start": 65.43, "duration": 2.49}, {"text": "It came and went.", "start": 67.92, "duration": 1.34}, {"text": "This epic team-up show, it wasn't bad, but it left practically no impact", "start": 69.28, "duration": 5.86}, {"text": "And, like with \"Justice League\", some missed opportunities killed me", "start": 75.72, "duration": 4.32}, {"text": "probably more because I loved \"Daredevil\" and \"Jessica Jones\"", "start": 80.1, "duration": 4.12}, {"text": "I liked \"Luke Cage\"", "start": 84.34, "duration": 1.42}, {"text": "\"Iron Fist\" was also a show", "start": 85.76, "duration": 1.9}, {"text": "I wanted \"The Defenders\" to be great", "start": 87.7, "duration": 3.0}, {"text": "...and yet, it wasn't.", "start": 91.24, "duration": 2.6}, {"text": "So, like with \"Justice League\", I got to thinking;", "start": 93.84, "duration": 3.2}, {"text": "\"What could they have done differently?\"", "start": 97.04, "duration": 2.12}, {"text": "Was there a version of this story that could have worked?", "start": 99.54, "duration": 3.08}, {"text": "A story that would bring together Daredevil, Jessica Jones, Luke Cage, and Iron Fist in a satisfying and fun way?", "start": 102.62, "duration": 6.92}, {"text": "I think there is, but it would take way more than one small change", "start": 110.12, "duration": 5.62}, {"text": "you would need one giant change that would create an entirely different series.", "start": 115.74, "duration": 5.6}, {"text": "So I would like to share that with you", "start": 121.56, "duration": 2.12}, {"text": "My \"Defenders\" rewrite", "start": 123.86, "duration": 2.04}, {"text": "However, I feel like I need to set the stage.", "start": 126.12, "duration": 2.96}, {"text": "To move forward, we first need to look backwards.", "start": 129.08, "duration": 3.46}, {"text": "So in this video, I'm going to lay the foundation for my rewrite", "start": 132.62, "duration": 3.74}, {"text": "discuss some of \"The Defenders\" biggest issues", "start": 136.52, "duration": 3.2}, {"text": "and give you a sense for how I'm going to address those issues without going into specifics", "start": 139.72, "duration": 5.12}, {"text": "and we'll end with the change itself;", "start": 144.84, "duration": 2.44}, {"text": "the big idea that I believe would have set \"The Defenders\" on the path to victory.", "start": 147.28, "duration": 4.34}, {"text": "So, if you'll indulge me, here is why I believe Marvel Netflix's \"The Defenders\" did not work", "start": 151.9, "duration": 7.7}, {"text": "Marvel Netflix's \"The Defenders\" was, at least for me, a huge big bag of disappointment.", "start": 159.98, "duration": 7.52}, {"text": "I don't know anyone who watched it and considered it the slam-dunk that the original \"Avengers\" was when it was released in 2012.", "start": 167.5, "duration": 6.54}, {"text": "If you've seen the show", "start": 174.04, "duration": 1.22}, {"text": "I don't need to explain why fight choreography was pretty uninteresting compared to \"Daredevil\"", "start": 175.26, "duration": 4.78}, {"text": "which years before it set the high bar for TV action scenes.", "start": 180.08, "duration": 3.68}, {"text": "Action was also pretty difficult to see, the pacing felt uneven", "start": 183.76, "duration": 3.84}, {"text": "And besides the issues Danny Rand brings to the series by just being the Danny Rand from \"Iron Fist\"", "start": 187.72, "duration": 6.38}, {"text": "although to be fair to \"The Defenders\", at least in this series", "start": 194.1, "duration": 2.98}, {"text": "characters we like get to take him down a peg and call him", "start": 197.18, "duration": 3.12}, {"text": "Stick: \"-a thundering dumbass.\"", "start": 200.3, "duration": 2.0}, {"text": "that's a good move", "start": 202.3, "duration": 1.32}, {"text": "but besides Danny, the clear biggest issue with \"The Defenders\" was the Hand.", "start": 203.62, "duration": 4.26}, {"text": "In case you're not familiar, the Hand was introduced in the back half of season two of \"Daredevil\"", "start": 207.9, "duration": 4.64}, {"text": "It is highly implied that Nobu, one of Kingpin's cohorts from season one of \"Daredevil\"", "start": 212.54, "duration": 4.54}, {"text": "was part of the Hand, although it wasn't confirmed until season two.", "start": 217.1, "duration": 3.5}, {"text": "It also turned out that Madame Gao from season one of \"Daredevil\" was also a member of the Hand", "start": 220.6, "duration": 5.06}, {"text": "even though the running theory through \"Daredevil\" season one was that she was a character called Crane Mother", "start": 225.66, "duration": 4.88}, {"text": "mostly because she ~really~ seemed like she was Crane Mother.", "start": 230.54, "duration": 3.74}, {"text": "And then in the first season of \"Iron Fist\"", "start": 234.28, "duration": 2.4}, {"text": "we were introduced to more members of the Hand", "start": 236.72, "duration": 2.92}, {"text": "besides confirmation that Gao was one of the leaders of the Hand", "start": 239.68, "duration": 2.94}, {"text": "or as they are known, and I swear this is what they call themselves, if you haven't seen the show buckle up;", "start": 242.62, "duration": 4.46}, {"text": "\"The Fingers\"", "start": 247.12, "duration": 0.94}, {"text": "We also met a character named Bakuto who I absolutely hate", "start": 248.06, "duration": 3.7}, {"text": "and not only was he leading a Hand sponsored recruitment centre", "start": 251.76, "duration": 2.96}, {"text": "whatever he was doing seemed to be at odds with Gao and her Hand activities since he kidnapped her.", "start": 254.72, "duration": 5.68}, {"text": "So right off the bat: problems.", "start": 260.4, "duration": 1.6}, {"text": "The Hand was a part of the worst two non-diamondback aspects of Marvel Netflix phase one.", "start": 262.0, "duration": 6.02}, {"text": "They hadn't produced any extremely compelling characters or any fun fight scenes", "start": 268.02, "duration": 4.48}, {"text": "and on top of that they don't seem to have any consistent purpose.", "start": 272.54, "duration": 3.06}, {"text": "It just felt like whoever was writing any individual show at that time was able to decide what the Hand was", "start": 275.6, "duration": 5.42}, {"text": "regardless of whether that lined up with the previously established Hand", "start": 281.1, "duration": 3.8}, {"text": "This all came to a head in \"The Defenders\", where the Hand and was the sole antagonist", "start": 284.94, "duration": 4.64}, {"text": "It was revealed that there were three other Fingers of the Hand that didn't get along and kind of did their own thing", "start": 289.58, "duration": 6.68}, {"text": "Besides Madame Gao, who was established as the magical leader of a New York City heroin enterprise", "start": 296.3, "duration": 5.56}, {"text": "and Bakuto, the remarkably incompetent magical leader of a New York City's sleepaway camp", "start": 301.86, "duration": 5.42}, {"text": "There was also Murakami whose entire character amounted to \"he speaks Japanese\" and \"he has a sword\"", "start": 307.32, "duration": 5.07}, {"text": "Sowande, an African warlord or something, who cares", "start": 312.39, "duration": 2.93}, {"text": "and they were led by Alexandra, a rich lady who gave a couple of speeches", "start": 315.36, "duration": 4.24}, {"text": "and then spent all of the Hand's black goo on resurrecting the character that a low-level Hand was able to kill three shows ago", "start": 319.6, "duration": 8.06}, {"text": "and, oh yeah", "start": 327.72, "duration": 0.76}, {"text": "The Hand was after black goo that granted them temporary immortality", "start": 328.48, "duration": 4.56}, {"text": "The goo was made of ground-up dragon bones that were", "start": 333.04, "duration": 4.42}, {"text": "-and I swear this is the real plot of this show-", "start": 337.46, "duration": 3.52}, {"text": "the dragon bones were buried far underneath a New York City", "start": 340.98, "duration": 4.22}, {"text": "and if removed, New York City would collapse into an evil dragon-shaped sinkhole. ~I think~", "start": 345.2, "duration": 6.08}, {"text": "It wasn't necessarily unclear, but it was so nonsensical that my brain has trouble comprehending it", "start": 351.28, "duration": 5.16}, {"text": "the same way I have trouble understanding the fourth dimension", "start": 356.46, "duration": 2.72}, {"text": "Honestly, everything about the Hand was disappointing, and people have talked about this before", "start": 359.2, "duration": 5.24}, {"text": "Patrick Willems has a great video called:", "start": 364.5, "duration": 2.32}, {"text": "Where it goes through the comic history of the Hand", "start": 368.74, "duration": 2.18}, {"text": "and relates that to why they don't work in the Netflix shows and \"The Defenders\" specifically", "start": 370.96, "duration": 5.16}, {"text": "So what can we learn from the Hand?", "start": 376.12, "duration": 2.0}, {"text": "What were they lacking and how can we address that with a new villain?", "start": 378.14, "duration": 3.749}, {"text": "I think I boiled that down to three things that I've assembled into a numbered list", "start": 381.889, "duration": 4.11}, {"text": "We'll figure out what those are, and then we'll go forward and get a villain or villain group that can address all of those shortcomings.", "start": 386.0, "duration": 6.5}, {"text": "Number listing #1: Good antagonists should be physically threatening.", "start": 392.64, "duration": 4.58}, {"text": "I don't think this is all that complicated, most of them are.", "start": 397.3, "duration": 3.6}, {"text": "This is the one that most movies get right. If anything, a lot of the times they go overboard on this,", "start": 400.9, "duration": 5.32}, {"text": "but to create tension, it should be believable that at some point your antagonist can kill your protagonist.", "start": 406.3, "duration": 5.68}, {"text": "Take Frank Castle: the Punisher from season two of \"Daredevil\"", "start": 412.1, "duration": 3.52}, {"text": "He wasn't the villain, but he was definitely an antagonist for a while", "start": 415.62, "duration": 3.6}, {"text": "He was completely capable of killing Matt.", "start": 419.3, "duration": 3.0}, {"text": "Frank didn't seem to want to, but if he had to he could, and if Matt got into a fight with Frank", "start": 422.3, "duration": 5.52}, {"text": "it would be tense because we wouldn't know how that fight was going to go", "start": 427.94, "duration": 3.629}, {"text": "...but then you think about that in terms of the Hand.", "start": 431.569, "duration": 3.131}, {"text": "Not only have two main characters completely destroyed the Hand in their own series", "start": 434.7, "duration": 5.2}, {"text": "Matt in \"Daredevil\" season two beat up a ton of ninjas", "start": 440.02, "duration": 3.06}, {"text": "and in season one he lit one of their field generals on fire", "start": 443.08, "duration": 4.86}, {"text": "and then Danny in the first season of \"Iron Fist\" also beat a ton of Hand members", "start": 447.96, "duration": 4.62}, {"text": "and apparently killed -but I guess didn't kill-", "start": 452.64, "duration": 2.82}, {"text": "but pretty much killed Bakuto, one of the five Fingers of the Hand.", "start": 455.46, "duration": 3.88}, {"text": "So right off the bat, we have two characters that are pretty capable of fighting the Hand.", "start": 459.44, "duration": 3.88}, {"text": "On top of that, we've got Jessica Jones, who has super strength and is somewhat invulnerable", "start": 463.32, "duration": 4.84}, {"text": "She spends most of the fight scenes in this show just tossing Hand ninjas around", "start": 468.16, "duration": 4.62}, {"text": "She doesn't seem to be in much danger.", "start": 472.84, "duration": 1.64}, {"text": "And then there's the worst offender: Luke Cage, a bulletproof, indestructible guy", "start": 474.48, "duration": 4.92}, {"text": "who you could reasonably assume you could put in a room with every single member of the Hand", "start": 479.48, "duration": 4.9}, {"text": "and as long as there was no time limit, he could kill all of them", "start": 484.42, "duration": 2.88}, {"text": "because they don't have any method for stopping him.", "start": 487.3, "duration": 2.72}, {"text": "The one member of the team that potentially could is Sowande", "start": 490.1, "duration": 3.96}, {"text": "who has some sort of pressure point based martial art", "start": 494.12, "duration": 3.08}, {"text": "that is set up in a way that makes it seem like he's going to be Luke Cage's big problem", "start": 497.2, "duration": 5.24}, {"text": "and he's gonna be able to neutralize Luke Cage through the series", "start": 502.54, "duration": 3.28}, {"text": "and in the fight at the Chinese restaurant", "start": 505.82, "duration": 1.26}, {"text": "Sowande uses this pressure point technique to knock out Luke Cage", "start": 507.08, "duration": 3.96}, {"text": "and Luke Cage is captured by Sowande and his faction of the Hand", "start": 511.04, "duration": 4.4}, {"text": "but then, off-screen, Luke Cage escapes, defeats all of Sowande's goons", "start": 515.52, "duration": 5.04}, {"text": "Defeats Sowande and then brings him to the Defenders hideout where his head is promptly cut off by Stick", "start": 520.7, "duration": 6.72}, {"text": "So none of the villains in this series are really that threatening", "start": 527.42, "duration": 4.38}, {"text": "We as an audience have no indication that our heroes are in any real danger", "start": 531.8, "duration": 4.979}, {"text": "Especially since these are just ninjas", "start": 536.9, "duration": 2.66}, {"text": "Like some of them seem a little stronger than usual; supplemented by magic or chi or energy or something?", "start": 539.66, "duration": 5.12}, {"text": "but like, you get the feeling that if at the end of this Frank Castle just rolled up holding that minigun", "start": 544.78, "duration": 5.96}, {"text": "that is teased in all of the promotion for these shows but never appears", "start": 550.74, "duration": 3.96}, {"text": "I think an unfinished \"Punisher\" season two", "start": 554.72, "duration": 1.979}, {"text": "He could just kill all of them", "start": 556.7, "duration": 1.98}, {"text": "kind of like he does at the end of \"Daredevil\" season two, so who cares?", "start": 558.68, "duration": 3.94}, {"text": "So we need some antagonists that are physical threats to our heroes for some reason", "start": 562.76, "duration": 5.46}, {"text": "Next", "start": 568.22, "duration": 0.5}, {"text": "#2 on my numbered-list:", "start": 568.72, "duration": 1.8}, {"text": "We need an antagonist that can facilitate interesting action scenes", "start": 570.52, "duration": 4.44}, {"text": "This is also kind of a no-brainer, and a lot of movies get this right", "start": 574.96, "duration": 4.26}, {"text": "although otherwise quality movies like \"Black Panther\" and \"Wonder Woman\" both end with action sequences that aren't bad", "start": 579.26, "duration": 6.08}, {"text": "but I guess come off as a little underwhelming, and for different reasons in \"Black Panther\"", "start": 585.36, "duration": 4.219}, {"text": "It's just two guys bouncing around, scratching each other with essentially identical panther suits", "start": 589.58, "duration": 5.86}, {"text": "and in Wonder Woman, it's just Aries throwing tanks and lightning and whatever at Diana until she kills him", "start": 595.5, "duration": 6.18}, {"text": "There's not a lot of creativity in those action sequences", "start": 601.68, "duration": 3.2}, {"text": "and it doesn't just have to be that the way that your antagonist fights is fun to watch", "start": 604.94, "duration": 4.42}, {"text": "the antagonist just needs to facilitate interesting action sequences.", "start": 609.36, "duration": 3.82}, {"text": "Think about Killgrave in \"Jessica Jones\"", "start": 613.26, "duration": 2.72}, {"text": "He's not a physical match for Jessica Jones", "start": 615.98, "duration": 2.82}, {"text": "but he can mind-control characters that would be a physical match for Jessica Jones", "start": 618.8, "duration": 4.9}, {"text": "like the Luke Cage action sequence", "start": 623.7, "duration": 2.4}, {"text": "or he can create scenarios that turn into interesting action sequences.", "start": 626.1, "duration": 4.1}, {"text": "Compare that with the Hand", "start": 630.2, "duration": 1.42}, {"text": "some have different weapons than others", "start": 631.62, "duration": 1.86}, {"text": "But almost every fight is the four Defenders first wave of goons like a beat'em up arcade game", "start": 633.58, "duration": 6.6}, {"text": "Goons show up, the hero punches him or throws him into a wall or something", "start": 640.24, "duration": 3.74}, {"text": "they fall down, another goon shows up. It's not very fun to watch", "start": 643.98, "duration": 3.76}, {"text": "and it especially highlights one of the other big problems with \"The Defenders\":", "start": 647.74, "duration": 3.0}, {"text": "all of the heroes punch.", "start": 650.74, "duration": 1.2}, {"text": "Luke Cage takes a lot of hits and punches", "start": 651.94, "duration": 2.7}, {"text": "Jessica Jones is kind of a blunt instrument just tossing guys into walls", "start": 654.64, "duration": 4.14}, {"text": "and Iron Fist and Daredevil are essentially the same guy.", "start": 658.94, "duration": 2.86}, {"text": "So in an action sequence like this one at the end of the series", "start": 661.81, "duration": 3.0}, {"text": "It's really hard to tell who's who, they're all doing more or less the same thing, it gets boring", "start": 664.81, "duration": 4.35}, {"text": "So we need villains that can create interesting action sequences", "start": 669.16, "duration": 3.9}, {"text": "And finally, #3 on my numbered-list, most importantly, and the thing that \"The Defenders\" got -I would say- most wrong", "start": 673.18, "duration": 7.7}, {"text": "There needs to be some sort of ideological difference between your heroes and your villains", "start": 680.96, "duration": 4.96}, {"text": "Just something that sets them apart, some clear philosophy that the villains hold and the heroes oppose.", "start": 685.93, "duration": 6.57}, {"text": "It doesn't have to be as explicit as \"The Dark Knight\" where the heroes are constantly talking about their philosophies", "start": 692.54, "duration": 6.98}, {"text": "\"I think my philosophy is that the people in Gotham are good and your philosophy is that they are bad and your philosophy is about chaos and mine is about justice\"", "start": 699.52, "duration": 7.28}, {"text": "That doesn't need to happen as explicitly, although, like in season one of Daredevil", "start": 706.84, "duration": 4.82}, {"text": "you can have characters like Fisk and Matt talking about what they believe how that makes them similar and how that makes them different", "start": 711.68, "duration": 7.12}, {"text": "They both want to protect this city, but Matt believes in punishing criminals and not killing people", "start": 718.82, "duration": 6.6}, {"text": "And Fisk believes that sometimes you have to get your hands dirty and cut off a guy's head with a car door", "start": 725.46, "duration": 5.72}, {"text": "and this is where the Hand really loses it", "start": 731.22, "duration": 2.62}, {"text": "because season to season, the Hand does not seem to have any consistent ideology", "start": 733.84, "duration": 6.22}, {"text": "no belief system, no real consistent goals", "start": 740.06, "duration": 3.66}, {"text": "The only indication that they're even after all these dragon bones is that at one point we see a big hole.", "start": 743.72, "duration": 7.0}, {"text": "It's not like the characters in season two of \"Daredevil\" are constantly talking about \"How are we gonna get to these dragon bones?\"", "start": 750.72, "duration": 6.18}, {"text": "It seems like something that's set up pretty late in the game.", "start": 756.92, "duration": 2.88}, {"text": "And because these different factions of the Hand don't get along", "start": 759.8, "duration": 3.26}, {"text": "it's impossible to figure out what they even want.", "start": 763.06, "duration": 2.58}, {"text": "What makes them similar besides the fact that the five of them left K’un-Lun at the same time?", "start": 765.64, "duration": 5.9}, {"text": "And the five of them all want to be immortal?", "start": 771.68, "duration": 3.26}, {"text": "And they're all okay with killing people?", "start": 774.94, "duration": 3.08}, {"text": "But since we don't know what the Hand wants because the Hand doesn't seem to know what the Hand wants", "start": 778.06, "duration": 5.72}, {"text": "We can't contrast that with what our heroes want, to reveal things about our heroes, and the conflict itself.", "start": 783.96, "duration": 6.96}, {"text": "So those are my three things;", "start": 790.92, "duration": 1.54}, {"text": "I want believable danger, creative action sequences, and ideological conflict.", "start": 792.46, "duration": 5.38}, {"text": "Those aren't all the things that an antagonist has to facilitate", "start": 797.84, "duration": 3.28}, {"text": "There's plenty of others, but I think those are the three areas where the Hand fails the most.", "start": 801.16, "duration": 5.12}, {"text": "So to address that, we would need a villain or group of villains that are dangerous for some reason", "start": 806.28, "duration": 4.8}, {"text": "maybe because of some magical -I don't know- superpowers or weapons or something", "start": 811.2, "duration": 5.56}, {"text": "And ideally it would be something that our heroes have not faced yet and beaten", "start": 816.91, "duration": 3.929}, {"text": "It would be a new thing, a new danger where they have to solve new problems", "start": 820.84, "duration": 4.5}, {"text": "and with those problems, you would want something that would facilitate creative action sequences", "start": 825.34, "duration": 4.1}, {"text": "So, it wouldn't just be problems that you could punch your way out of", "start": 829.44, "duration": 3.36}, {"text": "Heroes would need to work together in different ways, and to do that you would just need to not have waves of identical ninjas", "start": 832.88, "duration": 7.46}, {"text": "Give your villains some personality, define what they can do, what makes them dangerous and go from there", "start": 840.4, "duration": 4.68}, {"text": "This one's not all that tricky", "start": 845.08, "duration": 1.5}, {"text": "However, it would help if your villains were different in interesting ways from each other", "start": 846.58, "duration": 4.8}, {"text": "and then finally, some sort of ideological difference and we have to nail down what the villains believe", "start": 851.4, "duration": 6.42}, {"text": "What they care about, what their goal is, how our heroes get in the way of our villains achieving that goal", "start": 857.88, "duration": 5.68}, {"text": "so that the conflict between the two is interesting and natural", "start": 863.56, "duration": 3.28}, {"text": "and, I don't know, since there's four Defenders;", "start": 866.84, "duration": 3.8}, {"text": "Daredevil, Jessica Jones, Luke Cage, and Iron Fist", "start": 870.64, "duration": 3.8}, {"text": "it would probably help if there were four villains", "start": 874.5, "duration": 1.84}, {"text": "That kind of match-up would be fun because there would be one-on-four fights", "start": 876.34, "duration": 3.7}, {"text": "where someone like Daredevil has to take these guys on and he's super outmatched", "start": 880.04, "duration": 3.26}, {"text": "But that forces all four of our heroes to come together so they can stand a chance against these four villains", "start": 883.36, "duration": 5.3}, {"text": "And I guess ideally you would want someone from the comics, someone that's fought the Defenders in the past", "start": 888.66, "duration": 4.56}, {"text": "Ideally a team of villains whose first appearance was in a Defenders comic and one that probably won't make it into the movies", "start": 893.3, "duration": 7.2}, {"text": "Although maybe they'd fit into one of the Disney Plus shows, but at this point in history those didn't exist", "start": 900.52, "duration": 5.04}, {"text": "and, wouldn't you know it, there is such a group of villains", "start": 905.56, "duration": 3.2}, {"text": "and they have not been in any movie or MCU connected TV show to this point", "start": 908.8, "duration": 5.12}, {"text": "and there are four of them, they are known as", "start": 913.92, "duration": 2.58}, {"text": "\"The Wrecking Crew\"", "start": 916.52, "duration": 1.05}, {"text": "So for really basic introduction, and I would change a little bit of this origin story", "start": 917.57, "duration": 4.09}, {"text": "so that they have more of an interesting ideological difference between the Defenders", "start": 921.66, "duration": 4.02}, {"text": "The Wrecking Crew are led by a character named the Wrecker", "start": 925.76, "duration": 3.08}, {"text": "His real name is Dirk Garthwaite. He has an indestructible crowbar that he stole from Loki", "start": 928.91, "duration": 6.14}, {"text": "He uses it to fight Thor and originally he was a solo act,", "start": 935.05, "duration": 3.57}, {"text": "but he shares his power with three fellow inmates named Dr. Elliot Franklin, Brian Calusky, and Henry Camp", "start": 938.62, "duration": 7.4}, {"text": "and the four of them together are known as the Wrecking Crew.", "start": 946.02, "duration": 3.22}, {"text": "They all have some form of super strength and invulnerability", "start": 949.24, "duration": 3.56}, {"text": "Like I said Dirk, also known as the Wrecker, has an indestructible magic crowbar", "start": 952.84, "duration": 4.54}, {"text": "The function: it's kind of like Thor's hammer, although not exactly the same way.", "start": 957.38, "duration": 3.56}, {"text": "Dr. Elliott Franklin is known as Thunderball", "start": 960.94, "duration": 2.04}, {"text": "He is super strong and has a wrecking ball on a chain that he tosses around.", "start": 962.98, "duration": 4.22}, {"text": "He's awesome; one of my favorite character designs in comics.", "start": 967.2, "duration": 2.56}, {"text": "Calusky is known as Piledriver", "start": 969.76, "duration": 1.8}, {"text": "He has big fists and he can punch real good", "start": 971.56, "duration": 2.3}, {"text": "Then you've got Henry Camp who is the Bulldozer, who is essentially a weaker Juggernaut", "start": 973.86, "duration": 4.78}, {"text": "They rob banks, they are on the Masters of Evil frequently", "start": 978.64, "duration": 3.98}, {"text": "and they fight guys like Spider-Man and the Defenders", "start": 982.62, "duration": 3.32}, {"text": "They show up a lot on the cartoons, but they've never been in any of the live-action movies so far.", "start": 985.94, "duration": 4.36}, {"text": "I think there's good chance we'll see them in one of the Disney Plus shows", "start": 990.3, "duration": 3.1}, {"text": "I think they'd be really good antagonists for She-Hulk specifically", "start": 993.4, "duration": 3.9}, {"text": "but I really think they would have been perfect for \"The Defenders\"", "start": 997.3, "duration": 3.02}, {"text": "So, the Wrecking Crew", "start": 1000.46, "duration": 2.16}, {"text": "That's my big change", "start": 1002.8, "duration": 1.86}, {"text": "But how would they factor into this story?", "start": 1004.66, "duration": 2.44}, {"text": "Why would they have been more successful villains for the series according to the points I've laid out?", "start": 1007.1, "duration": 5.52}, {"text": "Why would they be a match for our heroes? How would they facilitate interesting action sequences?", "start": 1012.66, "duration": 5.6}, {"text": "What ideological differences would they present?", "start": 1018.26, "duration": 3.72}, {"text": "Well, we'll find out in part one of \"The Defenders\" rewrite", "start": 1022.26, "duration": 5.18}, {"text": "Oh, and one more thing", "start": 1027.7, "duration": 1.94}, {"text": "If Bakuto and his awfulness have also made katanas uncool by association", "start": 1029.64, "duration": 5.98}, {"text": "I would highly recommend the documentary:", "start": 1035.66, "duration": 2.58}, {"text": "It is a truly fascinating look at the samurai sword through the story of two apprentices and a master sword polisher", "start": 1040.22, "duration": 7.4}, {"text": "I love this documentary, it covers the creation of katanas, the polishing the selling, the auctions, and even the sword polishing contests", "start": 1047.639, "duration": 7.5}, {"text": "I never quite understood the fascination with katanas, but after seeing this I get it", "start": 1055.139, "duration": 4.53}, {"text": "they're pretty amazing.", "start": 1059.669, "duration": 1.451}, {"text": "You can find \"In Love with the Samurai Sword\" and thousands of other documentaries and non-fiction titles on this video sponser;", "start": 1061.12, "duration": 9.12}, {"text": "You know Curiosity Stream, it was founded by the founder of the Discovery Channel", "start": 1071.84, "duration": 3.94}, {"text": "and on Curiosity Stream you can   documentaries and learn about everything", "start": 1075.8, "duration": 4.18}, {"text": "from the history of the universe to squirrels.", "start": 1079.98, "duration": 2.62}, {"text": "Go check out their catalogue, they have something for everyone", "start": 1082.6, "duration": 2.9}, {"text": "and you, that's right, you can go to", "start": 1085.5, "duration": 2.74}, {"text": "for unlimited access to the world's top documentaries and non-fiction series", "start": 1090.92, "duration": 4.26}, {"text": "and enter the promo code \"nando\" when prompted during the signup process and your membership is free for the first 30 days", "start": 1095.2, "duration": 8.12}, {"text": "I think you're gonna dig it. Go give it a shot. As always. You got to thank my patrons", "start": 1103.34, "duration": 4.32}, {"text": "You guys are the best if you want to see your name up here, get access to videos early, and other cool stuff", "start": 1107.66, "duration": 4.72}, {"text": "Throw in literally any amount of money at patreon.com/nandovmovies", "start": 1112.38, "duration": 4.96}, {"text": "You have no idea how much I appreciate it", "start": 1117.34, "duration": 2.14}, {"text": "Also, I gotta plug my podcast \"Mostly Nitpicking\"", "start": 1119.64, "duration": 3.2}, {"text": "where every week me and my co-host DJ pick apart a piece of pop culture by looking exclusively at the details", "start": 1122.84, "duration": 5.68}, {"text": "Last couple of weeks we've been doing our \"Dance to Joker\" series", "start": 1128.56, "duration": 3.3}, {"text": "where we look at all the movies that have featured the Joker in some role", "start": 1131.86, "duration": 3.82}, {"text": "So starting with \"Batman\" '66", "start": 1135.76, "duration": 2.58}, {"text": "\"Batman\" '89", "start": 1138.48, "duration": 1.48}, {"text": "\"Batman Beyond: Return of the Joker\"", "start": 1139.96, "duration": 2.2}, {"text": "\"The Dark Knight\"", "start": 1142.16, "duration": 1.36}, {"text": "\"Suicide Squad\"", "start": 1143.52, "duration": 0.96}, {"text": "\"The Lego Batman Movie\"", "start": 1144.48, "duration": 1.88}, {"text": "and ending with the new Joaquin Phoenix \"Joker\" movie", "start": 1146.36, "duration": 2.24}, {"text": "So if you enjoy stuff like that listen to us, you can find us wherever podcasts are found", "start": 1148.6, "duration": 5.22}, {"text": "we're also on YouTube at the Mostly Nitpicking YouTube channel", "start": 1153.82, "duration": 3.6}, {"text": "It's not a livestream, but it might be where we livestream videos eventually", "start": 1157.43, "duration": 3.809}, {"text": "But just where we upload audio of the podcast in case you prefer to listen to the podcasts on YouTube", "start": 1161.24, "duration": 5.489}, {"text": "which a couple people have mentioned they do", "start": 1166.729, "duration": 1.771}, {"text": "Finally, follow me on Twitter:", "start": 1168.5, "duration": 1.68}, {"text": "twitter.com/nandovmovies", "start": 1170.18, "duration": 1.8}, {"text": "it's where I post updates on videos and podcasts", "start": 1171.98, "duration": 3.2}, {"text": "and where we'll talk about some sort of movie news like when we get the image of WandaVision", "start": 1175.18, "duration": 6.04}, {"text": "I'll talk about why I think that looks so cool", "start": 1181.22, "duration": 1.83}, {"text": "Like, I love the Tom King Vision run and the idea of-", "start": 1183.05, "duration": 3.59}, {"text": "-obviously not necessarily adapting that but doing something kind of in that vein like what if-", "start": 1186.64, "duration": 4.3}, {"text": "50s sitcom family, but worse. Could be super cool", "start": 1190.94, "duration": 4.14}, {"text": "So it's twitter.com/nandovmovies", "start": 1195.16, "duration": 2.86}, {"text": "That's all I got. I'll see you next time.", "start": 1198.12, "duration": 2.04}, {"text": "*Music Plays*", "start": 1200.16, "duration": 2.0}, {"text": "Subtitles are hard", "start": 1209.44, "duration": 0.5}]