[{"text": "This video is brought to you by cheddar who recently launched their own YouTube channel", "start": 0.0, "duration": 3.92}, {"text": "that makes videos about business, technology and media.", "start": 3.92, "duration": 3.04}, {"text": "Check out their video about the solution to disappearances in the Bermuda Triangle next.", "start": 7.02, "duration": 4.54}, {"text": "If you look at earth today, you'll find that there are seven point four billion humans living on it", "start": 11.56, "duration": 4.76}, {"text": "including you right now watching this video.", "start": 16.32, "duration": 2.4}, {"text": "About half of all of us on this planet are currently connected to the Internet, which means that we can", "start": 18.72, "duration": 5.14}, {"text": "Instantly communicate with billions of other people all around the world whenever we want to.", "start": 23.86, "duration": 4.74}, {"text": "But despite how much progress in technology the rest of the world we experience has made,", "start": 28.6, "duration": 5.3}, {"text": "there still exists today hundreds of tribes consisting of thousands of people who live just like our ancient ancestors did", "start": 33.9, "duration": 6.88}, {"text": "10,000 years ago, and many of them have no idea that the outside world, our world, exists.", "start": 40.78, "duration": 6.78}, {"text": "Most continents don't have anybody living on them who are completely unaware of modern civilization.", "start": 47.56, "duration": 5.66}, {"text": "The last Native American in the United States who lived most of his life completely removed", "start": 53.22, "duration": 4.66}, {"text": "from American culture was found in 1911 and the last uncontacted Aboriginal hunter-gatherers", "start": 57.88, "duration": 6.08}, {"text": "in Australia were found and contacted just in 1984.", "start": 63.96, "duration": 4.18}, {"text": "So there's only a handful of places left in the world where you can still find these uncontacted people.", "start": 68.14, "duration": 6.02}, {"text": "A handful in the congo basin of africa, a few on the Andaman Islands in the Indian Ocean and several on", "start": 74.16, "duration": 5.48}, {"text": "the Pacific island of New Guinea, but by far the vast majority of uncontacted people remaining in the world,", "start": 79.64, "duration": 5.68}, {"text": "97% of them are currently living on the South American continent,", "start": 85.48, "duration": 4.24}, {"text": "primarily in the deep dark and hard to get to parts of the Amazon rainforest.", "start": 90.009, "duration": 4.069}, {"text": "Over a hundred tribes consisting of thousands of people have been living here generation after generation", "start": 94.6, "duration": 5.74}, {"text": "For thousands of years ever since humans first arrived on the continent roughly 15,000 years ago.", "start": 100.34, "duration": 5.78}, {"text": "But how can it be that so many of these people still don't know about our modern world?", "start": 106.26, "duration": 5.68}, {"text": "The answer largely has to do with geography.", "start": 111.94, "duration": 2.76}, {"text": "The Amazon rainforest is enormous, larger than the entire Indian subcontinent", "start": 114.7, "duration": 4.96}, {"text": "but with a population under 20 million, meaning that several cities across the world have more people than that.", "start": 119.66, "duration": 5.94}, {"text": "The reason so few people live here is because really why would anybody want to?", "start": 125.6, "duration": 4.58}, {"text": "It's covered with dense forests, dangerous wildlife and historically has never really been developed by any modern civilization.", "start": 130.18, "duration": 6.52}, {"text": "There's only one bridge across the entire length of the Amazon River and", "start": 136.7, "duration": 4.1}, {"text": "the largest city in the region called Manaus in Brazil is primarily only accessible by boat or by plane.", "start": 140.8, "duration": 5.68}, {"text": "The rest of the Amazon interior is even more difficult to access,", "start": 146.48, "duration": 3.46}, {"text": "so the uncontacted people who live here are both difficult to actually reach and it's difficult for them to leave even if they wanted to.", "start": 149.94, "duration": 6.94}, {"text": "The other reason why they still exist is because the governments of the countries whose", "start": 156.88, "duration": 3.6}, {"text": "territory they live in have decided to leave them alone and refrain from first contacts because", "start": 160.48, "duration": 5.36}, {"text": "previous attempts to contact isolated tribes has ended in catastrophe.", "start": 165.84, "duration": 4.06}, {"text": "When Europeans first started arriving in large numbers to the new world after Columbus's discovery", "start": 169.9, "duration": 5.0}, {"text": "in 1492, 80% to 95% of the indigenous population of the Americas died within 150 years.", "start": 174.9, "duration": 8.56}, {"text": "Mostly due to diseases like measles and smallpox brought by the European conquerors.", "start": 183.46, "duration": 5.02}, {"text": "The indigenous people who had lived for thousands of years separated from the rest of the world", "start": 188.48, "duration": 4.26}, {"text": "had not developed the immunities to disease as the Europeans did by living side-by-side", "start": 192.74, "duration": 4.78}, {"text": "with animals like cattle and pigs. When the Europeans arrived the natives stood no chance to the biological", "start": 197.52, "duration": 6.7}, {"text": "cancer that ravaged their continent. And the surviving uncontacted tribes of today faced that exact same", "start": 204.28, "duration": 6.26}, {"text": "problem when encountering us. A tribe in Colombia for example was contacted a few decades ago by modern anthropologists", "start": 210.56, "duration": 7.2}, {"text": "but the tribes population was cut down to less than half its size simply because of diseases the anthropologists accidentally exposed them to in addition to.", "start": 217.76, "duration": 8.82}, {"text": "In addition to that first encounters with isolated tribes can sometimes result in violence.", "start": 226.58, "duration": 5.78}, {"text": "Clashes in Equador between uncontacted tribes and loggers cutting down the forests around them erupted in 2006 and 2007", "start": 232.36, "duration": 7.36}, {"text": "that left 30 tribes people and ten loggers dead. Loggers, oil prospectors, drug traffickers and hunters all", "start": 239.72, "duration": 7.34}, {"text": "occasionally stumble upon an uncontacted tribe in the jungle by accident still today.", "start": 247.06, "duration": 4.8}, {"text": "And the resulting encounters can obviously end up being pretty tense.", "start": 251.86, "duration": 3.7}, {"text": "There's a man who lives in the Amazon in Brazil called the loneliest man in the world. An indigenous", "start": 255.56, "duration": 5.34}, {"text": "uncontacted man who lives alone and is believed to be the last surviving member of his tribe. The language", "start": 260.9, "duration": 5.58}, {"text": "he speaks is unknown as is the name of the tribe He once belonged to and his existence first became known about in 1996.", "start": 266.48, "duration": 6.94}, {"text": "the Brazilian government sent numerous expeditions to find him that all failed until", "start": 273.42, "duration": 5.1}, {"text": "2007 and when they finally encountered him,", "start": 278.52, "duration": 3.04}, {"text": "He shot one of them in the chest with a bow and arrow. Later evidence found what was believed to be his old village,", "start": 281.56, "duration": 5.68}, {"text": "bulldozed and destroyed by illegal loggers or settlers. After this incident the Brazilian government declared a 42 square mile", "start": 287.53, "duration": 7.489}, {"text": "exclusion zone around him that's illegal for anybody to trespass into.", "start": 295.27, "duration": 3.889}, {"text": "He's the only human that exists in that entire area and it's illegal for", "start": 299.259, "duration": 4.04}, {"text": "anybody to visit him and he's still there because video was taken of him this year in 2018 cutting down a tree.", "start": 303.58, "duration": 7.2}, {"text": "The Brazilian government maintains a policy today of zero contact with uncontacted peoples", "start": 310.78, "duration": 5.32}, {"text": "but maintains occasional flyovers to check up on their numbers and how they're doing, which can yield some", "start": 316.1, "duration": 5.08}, {"text": "incredible photographs like these", "start": 321.2, "duration": 2.119}, {"text": "We can only speculate about what these people must be thinking at the sight of seeing an airplane flying above them,", "start": 323.319, "duration": 6.32}, {"text": "but imagine for a moment if earth was considered an uncontacted area by some advanced alien species.", "start": 329.64, "duration": 6.24}, {"text": "They may treat us the same way that we treat our uncontacted peoples.", "start": 335.88, "duration": 4.1}, {"text": "We limit our contact out of respect for their own safety, but maintain occasional flyovers for check-ups and to satisfy our own curiosity.", "start": 340.0, "duration": 8.66}, {"text": "Curiosity about the unknown is always fascinating to humans.", "start": 348.66, "duration": 3.68}, {"text": "It's just part of what makes us who we are.", "start": 352.349, "duration": 2.04}, {"text": "my friends at cheddar have created a very interesting video about why ships go missing in the Bermuda Triangle.", "start": 354.6, "duration": 5.92}, {"text": "The link to their video and channel is in the description,", "start": 360.52, "duration": 2.399}, {"text": "and I strongly encourage you to check it out and consider subscribing to them", "start": 362.919, "duration": 3.89}, {"text": "if you enjoy the kinds of videos that I create.", "start": 366.809, "duration": 2.871}, {"text": "They make informational videos about business technology and media and they just recently launched their channel.", "start": 369.68, "duration": 5.56}, {"text": "So if you're looking to learn more about our world, go and check them out next.", "start": 375.24, "duration": 3.869}]