[{"text": "Hi, what is a brushed DC motor? It's a motor that runs on DC voltage", "start": 0.0, "duration": 5.13}, {"text": "APPLAUSE", "start": 5.13, "duration": 1.53}, {"text": "How to drive it? You just stick it to a DC voltage.", "start": 6.78, "duration": 3.02}, {"text": "[motor turns on]\nHey! Hey", "start": 9.92, "duration": 1.72}, {"text": "Calm your sh**t", "start": 11.64, "duration": 2.0}, {"text": "Shaft! I said calm your shaft. What you have to keep-", "start": 13.66, "duration": 2.8}, {"text": "It exists everywhere - from your hairdrier-", "start": 16.46, "duration": 3.12}, {"text": "Yes, it's a DC motor", "start": 19.58, "duration": 1.06}, {"text": "They pass the AC through the heater element to drop the voltage and then pass it through a", "start": 20.64, "duration": 4.56}, {"text": "F U L L   B R I D G E   R E C T I F I E R", "start": 25.2, "duration": 1.5}, {"text": "to give it to the motor\n(whirring)", "start": 26.7, "duration": 1.86}, {"text": "They exist in cordless drills, although some drills have brushless DC motors", "start": 28.56, "duration": 5.0}, {"text": "But that's another story, and they exist in fans and toys and drones and vibrators of your mobile phones", "start": 33.56, "duration": 6.68}, {"text": "Let's make a simple one.", "start": 40.84, "duration": 0.96}, {"text": "First, I want to make the Stator, the stationary part of the motor out of these plastic old CD covers.", "start": 42.04, "duration": 5.539}, {"text": "I just cut some walls out of it", "start": 47.579, "duration": 2.819}, {"text": "Then we glue the walls together", "start": 51.85, "duration": 2.209}, {"text": "There. A tiny little stator box", "start": 57.03, "duration": 2.18}, {"text": "Then we need two permanent magnets with North on one side and South on the other side", "start": 59.43, "duration": 4.279}, {"text": "Then we just glue the magnet North in on one side", "start": 63.71, "duration": 4.11}, {"text": "and South in on the other side", "start": 68.97, "duration": 2.0}, {"text": "Like this", "start": 71.36, "duration": 1.44}, {"text": "Then we just poke two holes right between the magnets on the walls", "start": 73.56, "duration": 4.68}, {"text": "Now to make the rotor, the part of the motor that rotates, we take a nail and", "start": 79.68, "duration": 4.34}, {"text": "cut the end off. Then we take some steel wire and twist it around the nail to shape a cross", "start": 84.3, "duration": 5.599}, {"text": "Something like this, a little bit off-center and the same length on both sides", "start": 90.75, "duration": 3.979}, {"text": "Now we get some magnet wire which is basically coated copper wire and we can get this from old wall adapters and", "start": 94.95, "duration": 6.29}, {"text": "Wrap it always in the same direction around the steel wire", "start": 101.46, "duration": 4.069}, {"text": "So we make something like this, then we remove the coating from the end of the wires", "start": 107.69, "duration": 5.119}, {"text": "Then we place the nail in the holes of our stator", "start": 113.84, "duration": 3.47}, {"text": "Now you see if I pass electricity through the coil it tries to re-align itself", "start": 118.31, "duration": 4.73}, {"text": "If I can grab it", "start": 123.86, "duration": 1.94}, {"text": "it keeps shaking", "start": 128.8, "duration": 1.14}, {"text": "Agh", "start": 130.36, "duration": 0.5}, {"text": "Okay, see it tries to re-align itself with the magnetic fields and rotate", "start": 132.28, "duration": 4.44}, {"text": "Now we put some electric tape on the nail to isolate it, (then) move the wires to a location", "start": 137.3, "duration": 5.1}, {"text": "Perpendicular to the coil and cut the extra pieces and remove their coating", "start": 142.4, "duration": 5.32}, {"text": "Now we need to make something called a commutator, which is just contacts to these wires, and brushes that will touch them", "start": 148.32, "duration": 6.22}, {"text": "I made my rotor too small. Maybe you want to make yours a little bit larger", "start": 154.569, "duration": 4.29}, {"text": "So it's easier to work with. For the contacts, I need something rugged so I'm gonna cut the metal off of this food can.", "start": 158.86, "duration": 6.389}, {"text": "Have to sand the surface to expose the conductive metal. I can even solder my wires to them.", "start": 167.78, "duration": 6.0}, {"text": "There you go. Not bad, eh?", "start": 174.5, "duration": 1.62}, {"text": "Okay, the moment of truth. I'm connecting my power supply using these wires as brushes over my commutator. Let's see if it  turns", "start": 177.34, "duration": 7.98}, {"text": "(commutator spins loudly)\nThere you go! Haha", "start": 188.06, "duration": 2.8}, {"text": "Success! See how much arcs are flying off of the commutator", "start": 191.94, "duration": 3.7}, {"text": "The amount of heat and current is damaging my contacts and glues", "start": 200.6, "duration": 3.58}, {"text": "I should have made it better. but the commutator and brushes are the downside of brushed DC motors. This is an actual rotor", "start": 204.2, "duration": 7.32}, {"text": "I took from a small motor and can work in the same setup. There we go", "start": 211.52, "duration": 3.8}, {"text": "Now, what do you know. Designed much better than my rotor", "start": 217.7, "duration": 3.8}, {"text": "They don't make two pole rotors anyway, it's always three and above.", "start": 222.56, "duration": 3.86}, {"text": "Now there are tons of different", "start": 226.43, "duration": 1.119}, {"text": "Motor designs and you have to pick one for your actually the proper torque depending on your room to use gears to increase your select", "start": 227.549, "duration": 7.28}, {"text": "what RPM the motor should grow you need to study torque and speed limited by the space and weight in your design and", "start": 234.83, "duration": 6.539}, {"text": "Maximum voltage and current is typically stronger turning one way than the other", "start": 241.56, "duration": 4.1}, {"text": "What I'm trying to say is that there are a bunch of mechanical considerations", "start": 245.66, "duration": 3.269}, {"text": "To pick a proper motor and you let your mechanical engineer minions to take care of those low level stuff", "start": 249.12, "duration": 5.57}, {"text": "You are here to drive it now", "start": 254.69, "duration": 1.95}, {"text": "There are a bunch of challenges driving any motor which is typically at startup and shutdown and during the operation", "start": 256.64, "duration": 6.539}, {"text": "So, let's see what they are", "start": 263.18, "duration": 1.049}, {"text": "but a lot of what I'll say applies to all electric motors the brushes and contacts of a motor which is called the", "start": 264.229, "duration": 6.15}, {"text": "Commutator is an interesting arrangement if you think about it", "start": 270.45, "duration": 3.349}, {"text": "it converts the DC input to AC over the coil because as the rotor turns it flips the", "start": 273.8, "duration": 6.0}, {"text": "Polarity over the coil if we turn the motor manually if we generate electricity", "start": 279.93, "duration": 4.52}, {"text": "Simply because we are moving the rotor coils through magnetic fields", "start": 285.06, "duration": 4.16}, {"text": "This generates AC over the coils say around hundred Hertz", "start": 289.62, "duration": 3.89}, {"text": "but the commutator", "start": 293.51, "duration": 1.75}, {"text": "rectifies it at the input and", "start": 295.26, "duration": 1.86}, {"text": "If you look closely you will see that I have a brand new four channel keysight scope", "start": 297.12, "duration": 5.059}, {"text": "They just came up with this scope. This is the new brother of our", "start": 302.18, "duration": 3.39}, {"text": "Sister, I mean, I'm not sure I don't want to assume it's gender the new model of my to Channel school", "start": 306.33, "duration": 5.57}, {"text": "It has all the great features of my beloved school comes in Batman black 4 channel 2 megahertz", "start": 311.9, "duration": 6.16}, {"text": "And I'll give away four of these at the end of the video. You can sign up from the link in the description", "start": 318.36, "duration": 4.589}, {"text": "Which also puts you in keysight's wave 2019 equipment giveaway", "start": 322.95, "duration": 4.41}, {"text": "Which happens in March more detail at the end?", "start": 327.36, "duration": 2.07}, {"text": "Now I'm going to spit out a ton of information around DC motor drive. It is guaranteed to hurt your brain", "start": 329.43, "duration": 6.69}, {"text": "So save yourselves or buckle up so a motor with permanent magnets acts as a generator to outputting a bumpy voltage", "start": 336.12, "duration": 7.529}, {"text": "But even when we run it from a power supply that generation action still happens and creates", "start": 343.65, "duration": 5.339}, {"text": "electromotive force or voltage that comes back from the motor that we call back EMF a", "start": 349.21, "duration": 5.179}, {"text": "Simplified model of the motor winding looks like this the inductance of the winding in series with the resistance", "start": 354.58, "duration": 5.989}, {"text": "Of the wires in series with an AC source for back EMF this regenerative voltage source", "start": 360.67, "duration": 6.109}, {"text": "Exists on all the windings of the rotor and it's voltage is dependent on the speed of the motor", "start": 367.06, "duration": 5.3}, {"text": "Starting from zero when the motor is not turning and goes up by speed all the way close to the supply voltage the back EMF", "start": 372.64, "duration": 6.5}, {"text": "Sources of different windings get rectified through the commutator similar to a three-phase even fuller bridge", "start": 379.27, "duration": 6.349}, {"text": "rectifier and create a bumpy DC source", "start": 385.96, "duration": 3.019}, {"text": "So you can model the DC motor at the supply lines like this the inductance of the winding", "start": 388.98, "duration": 5.339}, {"text": "series with the total resistance of the motor series with a rough DC voltage supply now", "start": 394.39, "duration": 5.57}, {"text": "Here's the interesting part for a well-made and lubricated motor", "start": 399.96, "duration": 3.599}, {"text": "We expect a small input", "start": 403.56, "duration": 1.93}, {"text": "current when no load is attached to the motor it is because when we start a motor and it speeds up", "start": 405.49, "duration": 5.419}, {"text": "the back EMF voltage Rises close to the supply voltage", "start": 411.13, "duration": 3.77}, {"text": "creating a small voltage drop across the motor resistance", "start": 415.57, "duration": 3.89}, {"text": "Which means small current draw the winding inductance is short circuit for DC", "start": 419.46, "duration": 4.889}, {"text": "But as you load the motor it slows down and so the back EMF voltage drops causing a higher voltage across", "start": 424.63, "duration": 6.86}, {"text": "Resistance or higher current draw the higher current results in a stronger magnetic", "start": 431.65, "duration": 4.699}, {"text": "Field and so the motor turns with a stronger torque to keep up with the load", "start": 436.51, "duration": 4.16}, {"text": "This is why if the motor ceases to rotate it can burn because the back EMF", "start": 440.67, "duration": 4.859}, {"text": "drops to zero and the entire supply voltage falls across there is", "start": 445.69, "duration": 4.19}, {"text": "Store knowing all these. Let's start a motor using a battery and measure the current on the scope", "start": 450.06, "duration": 5.16}, {"text": "See the current spikes to around 80", "start": 456.94, "duration": 2.329}, {"text": "amps even for this tiny motor and then drops to around 3 amps it is because at the beginning there is no back EMF to", "start": 459.37, "duration": 6.41}, {"text": "lower the current and the current drops as the back EMF", "start": 465.78, "duration": 2.88}, {"text": "Rises with the rise of the motor speed they call this initial spark the inrush current motors like engine starters draw over", "start": 468.85, "duration": 7.94}, {"text": "200 amps of inrush. We had a motor at work that would draw over 800 amps of inrush", "start": 476.98, "duration": 5.239}, {"text": "This imposes a huge startup challenge for systems that can't handle this much current", "start": 482.22, "duration": 4.829}, {"text": "You might say the motor has a series inductor", "start": 487.05, "duration": 2.58}, {"text": "That should limit the current know the electrical time constant", "start": 489.63, "duration": 3.029}, {"text": "Being L over R is very small in milliseconds much smaller than the mechanical time constant", "start": 492.91, "duration": 5.389}, {"text": "So the current jumps to maximum which is the supply voltage divided by resistance very quickly around 2 milliseconds here", "start": 498.669, "duration": 7.19}, {"text": "Before the motor has time to speed up and lower the current over 100 milliseconds here", "start": 506.139, "duration": 5.839}, {"text": "Now, let's turn off the motor and look at it voltage", "start": 512.169, "duration": 2.989}, {"text": "Look at that I turn off the motor around here. Then it's kind of flat for around 6 microseconds", "start": 516.46, "duration": 7.159}, {"text": "Then there is a huge negative spike of over hundred volts", "start": 523.62, "duration": 4.41}, {"text": "The reason it's flat at the beginning is that when I disconnect the wires?", "start": 528.06, "duration": 3.51}, {"text": "There is a tiny arch between them for a few microseconds that limits the motor voltage", "start": 531.67, "duration": 5.0}, {"text": "but as soon as the arc goes away BAM", "start": 536.92, "duration": 2.36}, {"text": "There's a huge voltage spike when we discharge an inductive load like a motor", "start": 539.28, "duration": 4.319}, {"text": "They induct hands energy discharges creating a large negative voltage spike that can create an arc across the contacts", "start": 543.88, "duration": 7.76}, {"text": "This arc momentarily shorts the discharge energy this initially limits the voltage across the motor", "start": 551.8, "duration": 6.47}, {"text": "But when the arc goes away the voltage jumps to minus hundred volts as we saw if there was no arc the voltage would jump", "start": 558.27, "duration": 7.229}, {"text": "Thousands of volts without protection any circuit would blow up", "start": 565.6, "duration": 3.41}, {"text": "This is one of the main reasons that the commutator", "start": 569.01, "duration": 2.579}, {"text": "Brushes get burned and wear away the main downside of brushed DC", "start": 571.839, "duration": 3.83}, {"text": "Motors because when those brushes switch around there will be high temperature arcs between the contacts that wear them away", "start": 575.74, "duration": 6.71}, {"text": "If we look at the shutdown voltage again over a longer period you see after the negative inductive spark the voltage returns", "start": 582.769, "duration": 6.9}, {"text": "Positive and declines slowly. This is the back EMF at work. The motor hasn't stopped yet as it has momentum", "start": 589.829, "duration": 6.409}, {"text": "The fuzzy noise is due to commutator switching", "start": 596.239, "duration": 2.82}, {"text": "So the back EMF voltage goes down as the motor stops this can cause us trouble later", "start": 599.059, "duration": 4.89}, {"text": "Or we can suck the back EMF energy out and use it which would result in the motor stopping faster", "start": 603.949, "duration": 5.88}, {"text": "That's called regenerative braking now. I'm running the motor from my power supply measuring the current and if I short the contact", "start": 609.86, "duration": 7.589}, {"text": "See it draws around 70 amps from the motor sucking the back EMF energy. I'm stopping the motor quickly", "start": 618.629, "duration": 7.1}, {"text": "Ok, so there are problems driving motors. Let's calm down and try to solve them first the high voltage spike at shutdown", "start": 626.519, "duration": 7.219}, {"text": "It's a simple one as a good solution. We can just add a reverse diode across the motor", "start": 633.739, "duration": 5.73}, {"text": "This diode is called the flyback or freewheeling diode when we run the motor that diode is off", "start": 639.509, "duration": 5.299}, {"text": "but when we disconnect the motor and the voltage of the motor flips", "start": 644.809, "duration": 3.84}, {"text": "The diode turns on and the current loops through the diode for the short time constant of the inductor", "start": 649.47, "duration": 5.839}, {"text": "so the reverse voltage across the motor will be", "start": 655.309, "duration": 2.4}, {"text": "limited to the diode voltage around minus 1 volt and after the inductive energy goes away the back EMF kicks in", "start": 657.779, "duration": 6.89}, {"text": "Hmm. Let's try it. I put a diode across the motor contacts and if I turn it on", "start": 665.1, "duration": 4.909}, {"text": "My diode blew up it was in Reverse", "start": 672.869, "duration": 2.809}, {"text": "So in this method we can only run the motor in one direction", "start": 676.41, "duration": 2.989}, {"text": "Trying again. I turn it off and you see the voltage only goes negative a little bit", "start": 679.98, "duration": 5.059}, {"text": "There are no arcs and the voltage rises back up due to back EMF. Ok one problem solved now", "start": 685.04, "duration": 5.82}, {"text": "How do we help the large start of inrush current one good solution would be to raise the supply voltage", "start": 690.86, "duration": 5.579}, {"text": "Slowly to have a limited current while the motor Rams stop and that's exactly what we do", "start": 696.6, "duration": 5.809}, {"text": "We limit the supply applied to the motor using PWM or pulse width modulation. Imagine", "start": 702.41, "duration": 5.789}, {"text": "We have a switch and we turn it on and off quickly at a fixed frequency", "start": 708.199, "duration": 3.359}, {"text": "Initially we get a short on time", "start": 712.559, "duration": 2.0}, {"text": "so the motor has time to ramp up and we increase the on time until it reaches the maximum speed the", "start": 714.559, "duration": 6.32}, {"text": "Switches we use in our circuits are fast in channel MOSFET transistors because they have a very small on resistance and wastes little power", "start": 721.22, "duration": 7.4}, {"text": "I'm not going to talk about MOSFETs on how to drive them properly", "start": 728.75, "duration": 2.989}, {"text": "That's a whole other topic if we turn on the motor straight up the inrush current rises to", "start": 731.74, "duration": 5.19}, {"text": "maximum with the time constant of L over R", "start": 737.09, "duration": 2.389}, {"text": "Then drops slowly as the motor ramps up first off", "start": 739.64, "duration": 3.38}, {"text": "Your initial pwm on time should be shorter than this rise time, which is in mini seconds", "start": 743.02, "duration": 5.489}, {"text": "Otherwise the current reaches maximum and it defeats the purpose now picking up the PWM frequency", "start": 748.51, "duration": 4.5}, {"text": "Is important for best control the PWM period should be shorter than this", "start": 753.17, "duration": 4.82}, {"text": "Inductive rise or fall time say smaller than three time constants, and that's me talking from experience", "start": 758.15, "duration": 5.419}, {"text": "It might be written somewhere more formally let me explain imagine", "start": 763.85, "duration": 3.95}, {"text": "The motor is running and we have this voltage across it then we turn it off", "start": 767.8, "duration": 3.66}, {"text": "We have the negative inductive kick clamped by the diode and then the back EMF", "start": 771.74, "duration": 4.94}, {"text": "if the pwm goes on during the back EMF", "start": 776.96, "duration": 2.839}, {"text": "We are letting some of the back EMF during the off time. Then the voltage goes back up and the cycle continues", "start": 779.87, "duration": 6.65}, {"text": "This means that the motor current drops to zero every cycle this results in an unpredictable", "start": 787.37, "duration": 6.559}, {"text": "Voltage across the motor because this regeneration voltage depends on speed and rpm and things", "start": 794.21, "duration": 5.449}, {"text": "So for better control, we pick a higher frequency to keep this voltage out this way", "start": 800.0, "duration": 4.849}, {"text": "the motor voltage would be nice and square with its", "start": 804.85, "duration": 2.52}, {"text": "Average equal to the duty cycle times the supply voltage and the motor current would be a nice ripple e DC", "start": 807.5, "duration": 6.109}, {"text": "Equal to the supply current average divided by the duty cycle here", "start": 813.98, "duration": 4.309}, {"text": "I have a MOSFET transistor series with my motor and I'm driving its gate from my function generator", "start": 818.29, "duration": 5.79}, {"text": "And I'm measuring the motor voltage and PWM input", "start": 824.21, "duration": 3.829}, {"text": "I'm running the PWM at 50% and you see if I change the frequency", "start": 828.11, "duration": 4.369}, {"text": "It doesn't affect the speed of the motor", "start": 832.58, "duration": 2.179}, {"text": "Until I lower it so far that the regeneration voltage gets into the off time", "start": 835.19, "duration": 5.899}, {"text": "You see the motor is running faster with the same TWM", "start": 841.22, "duration": 3.2}, {"text": "This additional back here voltage is raising the average voltage across the motor which also changes by load and speed", "start": 844.7, "duration": 7.469}, {"text": "That's why we keep the frequency higher", "start": 853.019, "duration": 3.14}, {"text": "To keep the voltage across the motor constant for better control", "start": 857.16, "duration": 4.039}, {"text": "now you see changing the pwm can nicely change their speed and", "start": 861.629, "duration": 4.85}, {"text": "this is how we manage the inrush current by controlling the motors of life instead of turning the motor dead on we", "start": 866.85, "duration": 6.38}, {"text": "PWM it on and off and control the current until it hits the curve", "start": 873.42, "duration": 4.429}, {"text": "we want", "start": 877.85, "duration": 0.669}, {"text": "we can control it to completely remove the inrush or allow some acceptable inrush to get in if you raise the", "start": 878.519, "duration": 6.77}, {"text": "Current slowly the motor ramps up slowly. So in some application that we need a more responsive motor", "start": 885.36, "duration": 5.63}, {"text": "We allow some inrush currents so that the motor can kick on faster now", "start": 890.99, "duration": 4.289}, {"text": "Let me show you some current plots the motor draws current from the supply in the on time and loops the current through the diode", "start": 895.279, "duration": 6.69}, {"text": "in the off time", "start": 901.97, "duration": 1.059}, {"text": "So the supply current is the same as the motor in the on time and zero in the off time", "start": 903.029, "duration": 5.059}, {"text": "which is the same as the transistor current and", "start": 908.089, "duration": 2.19}, {"text": "The diode current is zero in the on time and the same as the motor current in the off time", "start": 910.41, "duration": 5.15}, {"text": "Now this is important. We have to pick our components so that they can handle this current", "start": 915.6, "duration": 4.58}, {"text": "Also, you see that we are switching large currents through the supply and diodes", "start": 920.18, "duration": 4.169}, {"text": "So the electromagnetic radiations become an issue filtering for those is a whole other issue. I won't discuss here", "start": 924.35, "duration": 6.299}, {"text": "Are you tired yet? But wait, there's more so far. We have been driving the motor through a puny single transistor", "start": 930.649, "duration": 6.45}, {"text": "It's time for a half bridge driver see running the current through the diode wastes some good power", "start": 937.1, "duration": 6.39}, {"text": "So if instead we replace it with a low on resistance transistor", "start": 943.889, "duration": 4.73}, {"text": "We could save much more power like with this toggle switch. I can switch it on and off but", "start": 948.839, "duration": 5.059}, {"text": "I guess I can switch it at kilohertz frequency", "start": 957.93, "duration": 2.389}, {"text": "Remember when switching the motor voltage with the flyback diode at low frequency PWM", "start": 961.11, "duration": 4.489}, {"text": "The back EMF voltage would get in during the off time", "start": 965.85, "duration": 3.02}, {"text": "Because the diode would turn off but if we replace the diode with a switch like I did or a MOSFET it won't turn off", "start": 969.0, "duration": 6.38}, {"text": "shorting the back EMF voltage and breaking the motor", "start": 975.6, "duration": 2.66}, {"text": "So this is important when using a half bridge the PWM frequency must be fast faster than the inductive discharge time", "start": 978.27, "duration": 6.89}, {"text": "Otherwise, you will stop the motor every cycle now", "start": 985.2, "duration": 2.809}, {"text": "Let me turn on the motor using my half bridge if I can turn on the PWM", "start": 988.01, "duration": 5.309}, {"text": "that's", "start": 994.23, "duration": 2.0}, {"text": "Know clearly at the moment. I don't have the means to drive the half bridge an important thing running a half bridge", "start": 996.36, "duration": 5.66}, {"text": "Is that the two switches must never turn on at the same time?", "start": 1002.02, "duration": 3.239}, {"text": "otherwise", "start": 1005.48, "duration": 0.5}, {"text": "They'll short the power supply a huge current will shoot through them and they'll blow up the control signals must be such that one transistor", "start": 1005.98, "duration": 7.559}, {"text": "Turns off before the other one turns on and for safety", "start": 1013.55, "duration": 3.41}, {"text": "We keep a time gap between them called a dead time during which both transistors are off for better control though", "start": 1016.96, "duration": 6.539}, {"text": "We want that time to be as short as safely possible", "start": 1023.5, "duration": 2.13}, {"text": "You might \"Ask if both transistors are off at the same time then what will absorb that high voltage inductive kick?\"", "start": 1025.79, "duration": 6.439}, {"text": "Well, the good thing about MOSFETs is that they naturally have these internal diodes that do the job", "start": 1032.24, "duration": 4.88}, {"text": "So, let's see what happens", "start": 1037.37, "duration": 1.43}, {"text": "When we PWM the motor. The motor can connect to the ground or positive doesn't make a difference in control", "start": 1038.8, "duration": 4.89}, {"text": "First the top FET is on and the current flows through the motor and the motor voltage is positive", "start": 1044.03, "duration": 5.119}, {"text": "Then the top FET turns off and the motor current runs through the body diode of the lower FETs and the motor voltage", "start": 1049.31, "duration": 6.559}, {"text": "Drops below ground for the short period of dead time until the low FET turns on and the current runs through it", "start": 1056.09, "duration": 7.13}, {"text": "Then the low FET turns off and the current runs through the body diode again until we turn the top FET on", "start": 1063.89, "duration": 6.199}, {"text": "This is what you see if you probe the motor voltage", "start": 1070.31, "duration": 2.389}, {"text": "So at start off we ramp up the PWM duty", "start": 1072.92, "duration": 3.049}, {"text": "cycle to limit the inrush current and it's powered down we can just turn off the switches and let the motor stop on its", "start": 1076.22, "duration": 6.05}, {"text": "Own or ramp down the duty cycle if we ramp down the duty cycle", "start": 1082.27, "duration": 4.439}, {"text": "Faster than the natural motor slow down rate", "start": 1086.96, "duration": 2.75}, {"text": "This act will suck the back EMF energy from the motor and force it to slow down faster by pumping", "start": 1089.71, "duration": 6.69}, {"text": "current back into the power supply you can use this current to charge a battery as in", "start": 1096.62, "duration": 4.489}, {"text": "Regenerative braking what if you don't have a battery or supplier to absorb this current?", "start": 1101.33, "duration": 4.43}, {"text": "It will push your supply voltage high probably too high and kills all your circuits", "start": 1105.76, "duration": 4.469}, {"text": "this has happened", "start": 1110.3, "duration": 0.98}, {"text": "Before the easiest solution in this case is to turn off all the switches when a high voltage is detected and stopped pumping the current", "start": 1111.28, "duration": 6.78}, {"text": "I", "start": 1118.06, "duration": 1.0}, {"text": "Think we took care of everything but no so using a half bridge", "start": 1119.06, "duration": 3.89}, {"text": "You can change the duty cycle to change the energy input to the motor and control the speed but not the direction", "start": 1122.95, "duration": 6.239}, {"text": "That's why we put two half bridge drivers together to make a full bridge driver", "start": 1129.19, "duration": 5.429}, {"text": "Which they also call an H bridge because it looks like an H there are four switches and the motor connects between the two halves", "start": 1134.78, "duration": 6.38}, {"text": "If you turn these two switches on the motor turns one way and if you turn these two on the motor turns the other way", "start": 1141.37, "duration": 6.03}, {"text": "there are different ways to drive an H bridge, but for example", "start": 1147.4, "duration": 2.88}, {"text": "We can turn this off and that on continuously and PWM these two for one direction or turn this off and that on", "start": 1150.28, "duration": 7.29}, {"text": "Continuously and PWM this one for the opposite direction", "start": 1157.97, "duration": 2.99}, {"text": "I think we successfully scratched the surface of how to drive brushed DC motors. There's not much left", "start": 1160.96, "duration": 5.909}, {"text": "The rest would be how to choose transistors problems, right?", "start": 1166.91, "duration": 3.079}, {"text": "The switches properly features to expect from a driver I design and filter for EMI. I designed the PCB layout gave way", "start": 1169.99, "duration": 7.59}, {"text": "GIVEAWAY TIME!                                           \n   So thanks to keysight", "start": 1178.52, "duration": 1.4}, {"text": "I'll give away two of these new babies to my patrons at patreon.com", "start": 1179.92, "duration": 3.54}, {"text": "And another two to the viewers who can register for free from the link in the description that link also", "start": 1183.53, "duration": 5.9}, {"text": "Automatically puts you in the keysight wave 2019 view away. They are giving away over", "start": 1189.5, "duration": 5.0}, {"text": "$350,000 worth of tests here to over hundred people from March 1st to 15th", "start": 1196.07, "duration": 4.789}, {"text": "super scopes meters", "start": 1201.35, "duration": 1.62}, {"text": "function generators you get an early entry up to February 28th safe from my link and one entry per day during the March period", "start": 1202.97, "duration": 7.79}, {"text": "signing off at wave keysight.com", "start": 1210.92, "duration": 2.0}, {"text": "also two schools from December and one from January you win scopes and tools from Turkey India and us", "start": 1213.14, "duration": 6.29}, {"text": "Thanks to keysight and the support of my patrons to support education", "start": 1219.56, "duration": 3.799}]