[{"text": "[A Classic Domics Opening]", "start": 0.2, "duration": 3.72}, {"text": "As many of you guys know I was born in the Philippines and moved to Canada when I was seven years old.", "start": 5.24, "duration": 4.74}, {"text": "It wasn't for another 15 years that I would return after I graduated from university.", "start": 10.22, "duration": 4.76}, {"text": "I was 22 and my parents figured it was time we all went back to visit.", "start": 15.2, "duration": 3.6}, {"text": "Now 15 years away from your homeland can really change you.", "start": 19.02, "duration": 3.34}, {"text": "Although my parents did their best to preserve the culture at home, I kind of just stopped speaking Tagalog.", "start": 22.7, "duration": 5.34}, {"text": "I was able to fully understand it with my parents and other Filipino adults spoke to me.", "start": 28.26, "duration": 3.98}, {"text": "But ended up just replying in English.", "start": 32.32, "duration": 1.96}, {"text": "I still use a few terms like saying \"opo\" to my elders and \"Kain na.\" to tell everyone it's time to eat,", "start": 34.78, "duration": 5.32}, {"text": "and, \"Mmm. Ang bango!\" when I let out a fart.", "start": 40.3, "duration": 2.46}, {"text": "But other than a few phrases I had a lot of trouble keeping up a conversation if I needed to reply in Tagalog as well.", "start": 42.88, "duration": 5.5}, {"text": "So I was pretty nervous going back having to meet relatives that I barely remember,", "start": 48.68, "duration": 4.0}, {"text": "catching up with my cousins who were all grown up like me and just", "start": 52.84, "duration": 3.48}, {"text": "adjusting myself back into the way of life in the Philippines.", "start": 56.32, "duration": 3.14}, {"text": "I think language was the hardest part, when people spoke to me", "start": 59.98, "duration": 3.18}, {"text": "I knew what words and phrases to reply with but it didn't feel right coming out of my mouth.", "start": 63.16, "duration": 4.68}, {"text": "So when in doubt I just ended up speaking English, but with a Filipino accent.", "start": 67.84, "duration": 4.54}, {"text": "They knew English well over there.", "start": 72.44, "duration": 1.68}, {"text": "It was considered the second language along with Spanish.", "start": 74.4, "duration": 2.54}, {"text": "Although my relatives were cool with it I was always worried to speak to strangers.", "start": 77.14, "duration": 3.74}, {"text": "The whole way there my mom kept warning us specifically my younger sister", "start": 81.2, "duration": 3.82}, {"text": "and I since we spoke the least Tagalog to \"Avoid speaking out loud because if we're in the jeepney-", "start": 85.02, "duration": 4.76}, {"text": "-and they hear you, they'll know you're not from here and want to kidnap you and hold you for ransom.\"", "start": 89.78, "duration": 4.04}, {"text": "So the first week or so whenever we go out to eat or shop,", "start": 94.3, "duration": 2.84}, {"text": "I have to pretend like a mute in fear of my kidneys getting stolen", "start": 97.14, "duration": 3.15}, {"text": "and just hope my parents, aunts, uncles and cousins can communicate for me.", "start": 100.29, "duration": 4.17}, {"text": "It wasn't until we went to this one salon that I realized it didn't even matter.", "start": 104.46, "duration": 4.04}, {"text": "My mom and sisters decided to get a \"Mani-Pedi\" and facial treatment and they extended the invitation to me. My dad was off hanging out", "start": 108.79, "duration": 7.069}, {"text": "with his brother so I decided cool. Yeah, let's make me beautiful.", "start": 115.86, "duration": 2.819}, {"text": "So we get there and my mom and my older sister go first.", "start": 119.02, "duration": 3.05}, {"text": "I'm chilling in the lobby, but it was kind of a small and intimate place.", "start": 122.07, "duration": 3.209}, {"text": "So I was still able to speak with my mom and sister.", "start": 125.29, "duration": 2.299}, {"text": "Along with the employees who were working on them. The two ladies are having a conversation with each other and then I hear", "start": 127.81, "duration": 5.81}, {"text": "\"Gago in Denim Koreano\", and I understood what she said right away, because as I mentioned I could understand Tagalog well.", "start": 133.72, "duration": 6.35}, {"text": "I just had trouble speaking and at first", "start": 140.07, "duration": 2.19}, {"text": "I didn't realize what they meant because my younger sister, and I were the only ones waiting in the lobby-", "start": 142.26, "duration": 3.599}, {"text": "-and I got kind of intrigued like \"Whoa-", "start": 145.86, "duration": 2.16}, {"text": "there's Koreans here in Mindoro?\", but then I realized oh, they're talking about me.", "start": 148.02, "duration": 6.089}, {"text": "Because although I'm Filipino. I'm on the lighter skinned end of the spectrum", "start": 154.75, "duration": 3.74}, {"text": "and Filipinos are generally known to be darker skinned, and even though I have small slanted eyes. I was like \"Me? Korean?\"", "start": 158.56, "duration": 6.529}, {"text": "I usually get Chinese or Vietnamese or Thai or whatever, but sure okay?", "start": 165.09, "duration": 4.38}, {"text": "That's kind of rare.", "start": 169.47, "duration": 1.0}, {"text": "So then I realized it doesn't even matter if I don't reveal my weak", "start": 170.47, "duration": 3.199}, {"text": "-communication skills, when I already look like I'm not from here and can't blend in with the people.", "start": 173.83, "duration": 3.979}, {"text": "One thing I couldn't get used to was maids.", "start": 178.12, "duration": 2.18}, {"text": "Some relatives that I stayed with had maids in their household which I didn't even realize were maids right away.", "start": 180.43, "duration": 4.939}, {"text": "Because these were people haven't seen in 15 years with kids who weren't even around before I left. So when we got to their place-", "start": 185.59, "duration": 6.2}, {"text": "and they didn't introduce the girl in the kitchen cooking breakfast.", "start": 191.79, "duration": 2.609}, {"text": "I was like, huh?", "start": 194.4, "duration": 1.03}, {"text": "Okay", "start": 195.43, "duration": 0.5}, {"text": "That may be they will later and in the Philippines the maids and their family usually live with the main family", "start": 195.93, "duration": 6.719}, {"text": "Often in an extension of the house, so they were pretty much in service all day every day", "start": 203.08, "duration": 4.4}, {"text": "And we ended up never being introduced", "start": 207.48, "duration": 2.399}, {"text": "So it was safe to assume that they were the maid I", "start": 209.88, "duration": 2.91}, {"text": "Just couldn't get used to having that kind of service either. I felt kind of spoiled in a way", "start": 213.16, "duration": 4.79}, {"text": "I was raised to kind of just do shit on your own and take initiative", "start": 217.95, "duration": 3.089}, {"text": "You know be independent even as a guest in someone else's house", "start": 221.11, "duration": 3.83}, {"text": "I'll make the effort to pick up my plate when I'm done eating and bring it to the sink to wash or at least rinse", "start": 224.97, "duration": 5.82}, {"text": "Out the host might try to stop me", "start": 230.79, "duration": 2.19}, {"text": "But I'd at least want to let him know that I have some level of decency and consideration, but in that situation", "start": 232.98, "duration": 5.369}, {"text": "I was apparently in the wrong and when I got up after eating my delicious", "start": 238.42, "duration": 3.83}, {"text": "Longanisa and eggs my cousin immediately interrupts and pretty much dunks my plate back down to the table yells geeky", "start": 242.53, "duration": 6.44}, {"text": "I forgot the maids name", "start": 248.97, "duration": 1.41}, {"text": "So I'm just gonna call it a kiki then the maid drops", "start": 250.38, "duration": 2.279}, {"text": "Whatever. She was doing in the other room runs in and collects my dish to clean out the kitchen sink", "start": 252.66, "duration": 4.41}, {"text": "I had no idea how to react [I] didn't know if I was [being] rude by trying not to be rude", "start": 257.07, "duration": 5.459}, {"text": "my dishes", "start": 263.13, "duration": 0.4}, {"text": "But it was the same thing at the mall food court as well after I was done eating I picked up my tray and look", "start": 263.53, "duration": 4.55}, {"text": "For a trash can that didn't exist next thing", "start": 268.08, "duration": 3.089}, {"text": "I know this worker comes out all panicked and pleads me to keep my trash and tray on the table for them to clean up", "start": 271.17, "duration": 4.289}, {"text": "I was raised better than this but overall I'd say my trip was filled with amazing experiences", "start": 275.6, "duration": 6.1}, {"text": "it was great to see relatives again since I don't really have any in Canada and I got to travel around the different islands and", "start": 281.7, "duration": 6.299}, {"text": "Really appreciate the country went to palauan and floated through the scary-ass underground River went to Bohol and saw the chocolate hills", "start": 288.0, "duration": 6.929}, {"text": "Not actually made of chocolate", "start": 295.18, "duration": 1.8}, {"text": "visited my parents", "start": 296.98, "duration": 0.81}, {"text": "Hometown of San Jose and Mindoro and got to see where they grew up and just going around manila where I was born and seeing", "start": 297.79, "duration": 5.449}, {"text": "The culture and lifestyle that differed from what I was used to in Canada although", "start": 303.24, "duration": 3.75}, {"text": "I consider Canada my home since it contains the majority of my memories and experiences", "start": 306.99, "duration": 3.9}, {"text": "I'll never forget my roots and where I came from and hopefully you guys never forget your origins as well", "start": 311.44, "duration": 5.059}, {"text": "This video has been brought to you by ancestry the global leader in Family history and consumer genomics", "start": 318.04, "duration": 5.75}, {"text": "I've always been curious as to where I came from and how far back down the bloodline", "start": 324.01, "duration": 3.95}, {"text": "I can see even though my parents have told me that. We're full filipino", "start": 327.96, "duration": 3.359}, {"text": "I have my suspicions that there's more to it than that", "start": 331.32, "duration": 2.7}, {"text": "So recently I've decided to discover more about my family history", "start": 334.26, "duration": 3.029}, {"text": "Using Ancestries Dna service that allows people to uncover their ethnic mix", "start": 337.6, "duration": 4.429}, {"text": "Discover relatives and find new details about their unique family history with a simple DNA test", "start": 342.22, "duration": 5.029}, {"text": "So you might have a cousin in a country you never thought you'd be familiar with I did my dNa test a couple of weeks", "start": 347.68, "duration": 5.66}, {"text": "Ago, and now have my results and have revealed it to my family on Christmas", "start": 353.34, "duration": 3.059}, {"text": "And I'll be sure to show footage of that in another video", "start": 356.62, "duration": 2.66}, {"text": "If you'd like to start your own Dna discoveries ancestry is offering a 10 percent discount if you go to ancestry.com", "start": 359.28, "duration": 6.0}, {"text": "Dominic's or click the link in the description. It's available", "start": 366.45, "duration": 2.849}, {"text": "internationally in over 30 markets so almost everyone should be able to participate you may find out things about your heritage that even your", "start": 369.85, "duration": 6.29}, {"text": "Grandparents might be unaware of I think one time my parents mentioned that we may have some japanese in our blood", "start": 376.21, "duration": 4.91}, {"text": "But because it's so far back down the bloodline", "start": 381.12, "duration": 2.13}, {"text": "I've always just disregarded it whenever talking about my ethnicity with others, but now", "start": 383.25, "duration": 4.11}, {"text": "I may be able to shine some truth to it if you guys end up discovering something totally surprising about your origins", "start": 387.36, "duration": 4.649}, {"text": "Share some of your results in the comments or post or tweet me and use hashtag my ancestry again", "start": 392.26, "duration": 5.69}, {"text": "That's ancestry.com slash Domics link in the description and as always enjoy", "start": 397.95, "duration": 4.98}, {"text": "FIN", "start": 410.969, "duration": 5.931}]