[{"text": "[INTRO ♪]", "start": 0.1, "duration": 3.4}, {"text": "In the Florida Keys at Ernest Hemingway's old house there’s a whole colony of cats with too many toes.", "start": 3.5, "duration": 5.46}, {"text": "The story goes that Hemingway was once gifted a six-toed cat, named Snow White or maybe Snowball—the details are kind of sketchy—by an old sea captain.", "start": 8.96, "duration": 8.08}, {"text": "Now, that cat’s six-toed descendants \nroam freely on the estate.", "start": 17.04, "duration": 3.9}, {"text": "This story is so widely circulated that cats\nwith extra toes are often referred to as Hemingway cats.", "start": 20.94, "duration": 5.92}, {"text": "But these felines’ fancy feet can also teach us something—about the genes that build our bodies, and how they’re passed down across generations.", "start": 26.86, "duration": 7.86}, {"text": "The scientific name for too many fingers or toes is polydactyly, which comes from a combination of two Greek words:", "start": 34.72, "duration": 6.24}, {"text": "poly, meaning many, and dactylos, which means digits.", "start": 40.96, "duration": 3.6}, {"text": "It’s not just cats who can have too many\ndigits.", "start": 44.57, "duration": 2.43}, {"text": "Polydactyly can affect a variety of vertebrates, like chickens, dogs, guinea pigs and mice.", "start": 47.0, "duration": 5.08}, {"text": "And humans, like that guy who killed Inigo Montoya’s father.", "start": 52.08, "duration": 3.04}, {"text": "Although it affects many species, it’s still pretty rare—even though much of the time, having six fingers is actually controlled by a dominant allele.", "start": 55.12, "duration": 7.66}, {"text": "An allele, or version of a gene, is dominant when it only needs to be present in one copy in your cells for its associated traits to be discernible.", "start": 62.78, "duration": 8.4}, {"text": "So do you have six fingers on your right hand? No?\nOkay, don’t prepare to die I guess.", "start": 71.18, "duration": 5.64}, {"text": "Just because a gene is dominant doesn’t necessarily mean it’s common.", "start": 76.82, "duration": 3.54}, {"text": "It’s actually a lot more complicated than that.", "start": 80.36, "duration": 2.3}, {"text": "The development of complex, finger-having organisms like us starts with one cell: a zygote.", "start": 82.66, "duration": 5.52}, {"text": "That cell begins to divide into more cells, and at various points in the development process, those cells turn into arms, legs, a heart, a brain, and everything else.", "start": 88.18, "duration": 9.08}, {"text": "This process is called cellular differentiation, and what the cells turn into is dictated by your genes.", "start": 97.26, "duration": 6.32}, {"text": "Scientists first characterized one of these important developmental genes back in the 1980s in studies of fruit fly development.", "start": 103.58, "duration": 7.26}, {"text": "They noticed that a group of flies with a specific mutation turned out stumpy and covered in spiky protrusions.", "start": 110.84, "duration": 6.64}, {"text": "So naturally they named the gene hedgehog, because it made the flies look a little bit like hedgehogs.", "start": 117.48, "duration": 6.16}, {"text": "And… fly\nbiologists are like that, I guess.", "start": 123.64, "duration": 2.78}, {"text": "Fast forward to the 1990s, where researchers had found three versions of the hedgehog gene in mammals—one of them being sonic hedgehog.", "start": 126.42, "duration": 7.66}, {"text": "Yes, named after that Sonic.", "start": 134.08, "duration": 2.24}, {"text": "The sonic hedgehog gene codes for a type of protein known as a morphogen.", "start": 136.32, "duration": 3.94}, {"text": "A morphogen is a kind of molecular signal that gets sent out to cells to tell them what to become.", "start": 140.26, "duration": 4.9}, {"text": "When a cell detects the presence of sonic hedgehog, a complex chain of molecular events is touched off, eventually resulting in changes in how that cell’s genes are expressed.", "start": 145.16, "duration": 9.7}, {"text": "How a cell responds to sonic hedgehog’s signal depends on just how much of the protein it detects.", "start": 154.86, "duration": 5.72}, {"text": "Which can lead to complex patterns, like our fingers and toes.", "start": 160.58, "duration": 3.58}, {"text": "Our hands and feet start out as a lump of tissue called a limb bud.", "start": 164.17, "duration": 3.23}, {"text": "Sonic hedgehog is especially concentrated in an area on one side of that lump of cells, and there’s less of it as you go to the other end.", "start": 167.4, "duration": 7.3}, {"text": "An area of tissue that detects a lot of sonic hedgehog becomes a pinky; none at all, and you get a thumb.", "start": 174.7, "duration": 5.5}, {"text": "If there’s too much of that signal in the wrong place, though, other fingers start to develop—and that’s how you get polydactyly.", "start": 180.2, "duration": 6.86}, {"text": "This is how a polydactyly-causing mutation can be dominant:", "start": 187.06, "duration": 3.24}, {"text": "A bunch of genes influence sonic hedgehog signaling, and it only takes a single faulty copy of a gene to put some sonic hedgehog where it doesn’t belong.", "start": 190.3, "duration": 9.7}, {"text": "Depending on how much sonic hedgehog is present and where, you can end up with different outcomes.", "start": 200.0, "duration": 5.319}, {"text": "If lots of sonic hedgehog is present on the thumb side of the hand, that can lead to the development of two thumbs.", "start": 205.32, "duration": 6.06}, {"text": "Cats with extra thumbs: their only weakness, solved.\nNo can opener is safe.", "start": 211.38, "duration": 4.71}, {"text": "Now, there are a handful of other forms of polydactyly, influenced by a handful of different genes,", "start": 216.09, "duration": 5.71}, {"text": "as well as a condition called syndactyly, where a lack of sonic hedgehog signal results in fused fingers and toes.", "start": 221.8, "duration": 6.74}, {"text": "Development requires a ton of genes to work together, and a single mutation can be enough to nudge sonic hedgehog all out of whack.", "start": 228.54, "duration": 7.24}, {"text": "Which just goes to show that building a human—or a cat—is a pretty impressive feat of cell sculpting.", "start": 235.78, "duration": 6.64}, {"text": "Thanks for watching this episode of SciShow, and thanks to our lovely patrons who support everything we do.", "start": 242.42, "duration": 5.74}, {"text": "If you’d like to help us out, and earn some extra neat perks along the way, check out patreon.com/scishow.", "start": 248.16, "duration": 6.28}, {"text": "[OUTRO ♪]", "start": 254.44, "duration": 9.54}]