[{"text": "It was Stephen Fry", "start": 3.399, "duration": 1.731}, {"text": "I think who said: \"A true thing poorly expressed is a lie.\" It's the theory that", "start": 5.13, "duration": 7.08}, {"text": "the language they speak determines how you think and...", "start": 12.91, "duration": 3.019}, {"text": "Yeah, it effects how you see everything. The point being that there is no thought without expression, no content", "start": 16.6, "duration": 7.879}, {"text": "without form that an idea however profound it feels to you does not really exist", "start": 24.48, "duration": 6.719}, {"text": "until you can write it down or in some cases", "start": 31.84, "duration": 3.049}, {"text": "put it on film. To watch Denis Villeneuve's arrival is to watch a filmmaker in command of the language, his ideas", "start": 35.59, "duration": 7.43}, {"text": "presuppose just to say that he has a firm grasp on", "start": 43.6, "duration": 3.38}, {"text": "craft. I can't really tell you how soothing this is for me as a filmgoer to feel that", "start": 47.53, "duration": 4.939}, {"text": "I'm in the hands of someone who knows why the film is constructed the way it is.", "start": 52.469, "duration": 4.17}, {"text": "So much of today's filmmaking is all over the place to the point where the viewer has to exert themselves", "start": 56.92, "duration": 5.18}, {"text": "more to compensate for a lack of focus. In this way, I think Arrival is the perfect response to the bad movies", "start": 62.44, "duration": 7.07}, {"text": "we see so much of. Pretty much everything they do wrong arrival does right, it is effective and impactful", "start": 69.51, "duration": 6.959}, {"text": "and it does this by focusing on the very thing that affects and impacts us-", "start": 76.47, "duration": 4.589}, {"text": "language, but I think Arrival is just as concerned with the language of film as it is with written or spoken or alien", "start": 81.729, "duration": 7.73}, {"text": "language, for example the first couple scenes are kind of like an enlarged", "start": 89.46, "duration": 3.989}, {"text": "experiment in the kuleshov effect- the phenomenon in which a viewer derives meaning from two sequential shots that Hitchcock famously", "start": 93.82, "duration": 7.729}, {"text": "illustrated by turning a kindly gentleman into a pervert by replacing a single reverse shot", "start": 101.68, "duration": 5.959}, {"text": "Villeneuve does the same thing in Arrival,", "start": 107.829, "duration": 1.97}, {"text": "but on the scene level. The first scene is a montage of the birth and", "start": 109.799, "duration": 4.23}, {"text": "young death of Amy Adams' daughter, the second scene is Adams coming to teach at her school on the day of the aliens' arrival.", "start": 114.25, "duration": 7.279}, {"text": "Because of the tragedy we witness in the first scene and our assumption that the film's timeline is linear", "start": 121.63, "duration": 5.18}, {"text": "we read Adams disinterest here as", "start": 126.85, "duration": 2.989}, {"text": "despondency and her general dry demeanor as one of deep sadness and heartache.", "start": 130.479, "duration": 4.76}, {"text": "It's not until we finish the film and learn that the opening montage happens after the events of the movie,", "start": 135.24, "duration": 5.519}, {"text": "that we understand Adams in the second scene was merely a blank canvas that we attached meaning to.", "start": 141.04, "duration": 7.31}, {"text": "\"Montage means the assembly of pieces of film which moved in rapid succession before the eye,", "start": 148.72, "duration": 7.55}, {"text": "create an idea.\" What separates Villeneuve from many other filmmakers is his ability to generate", "start": 157.239, "duration": 6.02}, {"text": "ideas with cinematic craft then on another level mingle those ideas, collide and blend them to create a higher order of", "start": 163.39, "duration": 7.699}, {"text": "meaning.", "start": 171.22, "duration": 1.44}, {"text": "So what's the meaning for example that Villeneuve suggests with this Kuleshov effect experiment, perhaps that the future can", "start": 172.66, "duration": 6.739}, {"text": "influence the past?", "start": 179.59, "duration": 1.59}, {"text": "That's certainly a reasonable thing to derive from this kind of", "start": 181.18, "duration": 3.32}, {"text": "experience in the film, in fact it's an idea that turns out to be the key to the climax of Arrival as Adams learns that", "start": 184.569, "duration": 6.38}, {"text": "the Aliens are higher dimensional beings that can see all of time at once, and", "start": 190.95, "duration": 5.069}, {"text": "uses that skill to access future events to influence her present. \"I called you didn't I?\"", "start": 196.269, "duration": 5.42}, {"text": "\"Yes, you did.\" But you could also read another meaning from the same experience, namely that communication is", "start": 203.53, "duration": 6.769}, {"text": "limited by", "start": 210.85, "duration": 1.32}, {"text": "perspective. From our perspective at the beginning of the film everything tells us that Adams is grieving, only later", "start": 212.17, "duration": 6.589}, {"text": "do we learn that that wasn't true. This too is a major theme of Arrival- the limits of human communication are", "start": 218.76, "duration": 6.509}, {"text": "reinforced and expanded upon in probe throughout the film, the limits of our", "start": 226.12, "duration": 3.889}, {"text": "biology of relying on what our senses report, the limits imposed on us by our culture or our own", "start": 230.38, "duration": 6.019}, {"text": "personalities. \"Trust me you can", "start": 236.829, "duration": 2.0}, {"text": "understand communication", "start": 239.38, "duration": 1.53}, {"text": "and still end up single.\" In conversation with the aliens communication is literally imagined as a screen- a mediator that blurs", "start": 240.91, "duration": 6.859}, {"text": "intention. Now screens can connect us, they can also divide us and it's the same with communication. Communication is a", "start": 248.11, "duration": 7.009}, {"text": "link between two parties,", "start": 255.459, "duration": 1.641}, {"text": "but it's a link that often facilitates split. \"Language is the foundation of civilization is a glue that holds the people together,", "start": 257.1, "duration": 7.649}, {"text": "is the first weapon drawn in a conflict.\" \"We are falling asleep at the wheel people you know what I'm talking about", "start": 265.18, "duration": 5.899}, {"text": "I know you do.\" What's important here is not that both these readings are", "start": 271.08, "duration": 3.45}, {"text": "valid, they are, but that both have echoes elsewhere in the film and echo off each other, a theme once introduced isn't", "start": 274.6, "duration": 7.129}, {"text": "wasted. The alien language is circular,", "start": 281.83, "duration": 2.51}, {"text": "so the film is too. The difficulty of cooperation in the small group at the Montana site echoes the difficulty of cooperation between", "start": 284.34, "duration": 6.959}, {"text": "Nations. Louise's understanding of her displacement in time happens simultaneously with the audience's realization that the events depicted", "start": 291.7, "duration": 7.489}, {"text": "aren't linear. \"Non-zero-sum game?\"", "start": 299.65, "duration": 2.0}, {"text": "Every theme is filtered through other moments and characters and eventually other", "start": 302.02, "duration": 4.369}, {"text": "themes until it starts to feel like something solid, you start to think what is the relationship between", "start": 306.58, "duration": 5.69}, {"text": "language and time.", "start": 312.91, "duration": 1.68}, {"text": "Maybe it's that the mind is not a thing, but a process, language happening in time, just like film is", "start": 314.59, "duration": 7.25}, {"text": "communication occurring in time. [Speaking Russian]", "start": 322.389, "duration": 5.39}, {"text": " ", "start": 328.479, "duration": 4.49}, {"text": "So much of Arrival seems to be about the possibility of meaning", "start": 333.97, "duration": 6.709}, {"text": "in film. What is it? Where does it come from? I think Villeneuve imagines it as an alien spacecraft:", "start": 340.96, "duration": 6.29}, {"text": "mysterious, obscure, an expression that's not quite written or spoken language, and so always difficult to decipher.", "start": 347.889, "duration": 6.92}, {"text": "Something when bored out of craft and character and story is always hovering over the film.", "start": 355.45, "duration": 5.929}, {"text": "It's always in the background seen from different angles impossible to avoid.", "start": 361.38, "duration": 4.649}, {"text": "Arrival isn't just a repudiation of bad movies because it leads by example.", "start": 366.52, "duration": 4.49}, {"text": "It's also I think an act of exploration into what makes a movie great.", "start": 371.56, "duration": 5.149}, {"text": "It explores the kind of unique perspective that a film can gift to the filmgoer like a language", "start": 376.71, "duration": 6.809}, {"text": "gifted by aliens, and what kind of brand new world that perspective", "start": 384.04, "duration": 5.539}, {"text": "allows us to see.", "start": 390.28, "duration": 2.0}, {"text": "Hey everybody, thanks for watching. Happy Wednesday and happy Valentine's day to my girlfriend who's sitting right over there. Even though it's a daylight", "start": 400.909, "duration": 6.529}, {"text": "I recorded this on the all-time stay so I love you baby. Anyway. Thank you squarespace for sponsoring", "start": 407.439, "duration": 5.01}, {"text": "this video.", "start": 413.18, "duration": 1.319}, {"text": "If you don't know squarespace has beautiful award-winning designer templates for websites for your business", "start": 414.499, "duration": 5.45}, {"text": "so if you're a musician or a restaurant, or whatever,", "start": 420.05, "duration": 3.679}, {"text": "Squarespace is the perfect all-in-one tool for designing a website for that", "start": 424.339, "duration": 3.62}, {"text": "It's flexible the domain name is really easy, and you don't have to know coding or anything", "start": 427.96, "duration": 3.75}, {"text": "and if you use the offer code-", "start": 432.229, "duration": 1.77}, {"text": "Nerdwriter you can get 10% off your first purchase, which is which is pretty cool. Anyway", "start": 433.999, "duration": 4.52}, {"text": "thanks guys for that, and I'll see the rest of you next", "start": 438.52, "duration": 2.279}, {"text": "Wednesday, love you, baby.", "start": 441.589, "duration": 2.0}]