[{"text": "Hey guys, ChrisFix here, and hooooolllyyy smokes. I finally did it, I bought my dream car.", "start": 7.58, "duration": 6.74}, {"text": "It's sitting right off-screen over there. Yet, it doesn't feel real", "start": 14.32, "duration": 4.68}, {"text": "Now, being a YouTuber is an interesting job", "start": 19.16, "duration": 2.54}, {"text": "I never expected to do this. I always just wanted to help people", "start": 21.82, "duration": 3.06}, {"text": "I wanted to make videos to teach people how to fix their cars at home in their driveway using common hand tools", "start": 24.88, "duration": 5.44}, {"text": "That way they can learn how to fix their own car. They could get a new passion, a new hobby, maybe a new career", "start": 30.34, "duration": 4.84}, {"text": "But it's always been about helping people and showing them the proper way to fix their cars and", "start": 35.2, "duration": 3.86}, {"text": "Obviously it was working out because I hit", "start": 39.28, "duration": 2.06}, {"text": "100,000 subscribers and YouTube sent me out this exclusive silver play button", "start": 42.05, "duration": 4.279}, {"text": "Not many people around the world had this play button", "start": 46.54, "duration": 2.46}, {"text": "It felt so good to get it and this is about the time when I realized I have something good going on here.", "start": 49.0, "duration": 4.58}, {"text": "I have something I'm helping a lot of people and I'm gonna work on this channel full-time", "start": 53.66, "duration": 3.88}, {"text": "Now, fast-forward a little over a year and I hit 1 million subscribers", "start": 57.64, "duration": 5.22}, {"text": "This is something that nobody thinks is obtainable and I did it! I gave up so much", "start": 62.86, "duration": 4.4}, {"text": "There was so much hard work, so much passion into each video to try to make this possible to help as many people as possible", "start": 67.38, "duration": 5.82}, {"text": "And I did it! And I remember tearing up as I was unboxing this thing", "start": 73.32, "duration": 3.4}, {"text": "My parents were watching me and I could see how proud they were", "start": 76.72, "duration": 3.46}, {"text": "Even though they weren't completely sure what my job actually was", "start": 80.5, "duration": 3.34}, {"text": "They weren't even sure if I could sustain myself and make a living out of this", "start": 83.98, "duration": 2.72}, {"text": "Heck, I wasn't even sure that I could", "start": 86.76, "duration": 1.6}, {"text": "What an amazing feeling, now fast-forward just a little more and I have hit 2 million subscribers", "start": 88.44, "duration": 4.86}, {"text": "So I thought it was time to get a dream car", "start": 93.3, "duration": 1.8}, {"text": "But not a dream car for me, a dream car for my mom", "start": 95.12, "duration": 3.42}, {"text": "My mom and dad have always supported me, even though they didn't know if this YouTube thing was a good idea,", "start": 98.54, "duration": 5.4}, {"text": "and I should probably stick to my normal career", "start": 104.06, "duration": 1.96}, {"text": "No matter what they still supported everything I did. They let me use this driveway,", "start": 106.16, "duration": 3.76}, {"text": "Let me use their garage and let me fill it with tools and for that I got my mom her dream car", "start": 109.92, "duration": 5.06}, {"text": "What an incredible video I'll link it in the description. You'll definitely be chopping onions as you watch that video", "start": 115.04, "duration": 5.02}, {"text": "It is probably one of my favorite videos to date", "start": 120.06, "duration": 2.82}, {"text": "And then now we come to present time right now this video,", "start": 122.88, "duration": 3.64}, {"text": "I've hit over 5 million subscribers!", "start": 126.7, "duration": 3.12}, {"text": "But this time YouTube doesn't give you a plaque for this milestone and I figured after all this hard work the 16 hour days", "start": 129.94, "duration": 5.159}, {"text": "Not taking a full day off for 4 years basically doing as much as I can to help other people", "start": 135.099, "duration": 4.949}, {"text": "Well, it was finally time to reward myself", "start": 140.049, "duration": 2.25}, {"text": "Plus I needed a daily driver instead of driving all my project cars because you guys know what that's like", "start": 142.31, "duration": 5.269}, {"text": "So I bought my dream car or in this case my dream truck", "start": 147.84, "duration": 4.02}, {"text": "A 1996 a.m. General Hummer h1", "start": 157.12, "duration": 2.98}, {"text": "Now hold up, hold up. I know before you start commenting. Of course, it's unreliable. It gets horrible fuel economy", "start": 160.92, "duration": 6.16}, {"text": "They're so slow. They make no power their ride is super harsh. They're uncomfortable. Wait, wait, wait, hold up", "start": 167.1, "duration": 5.099}, {"text": "This is no regular Hummer", "start": 172.2, "duration": 2.43}, {"text": "This is a super special Hummer and I'm gonna show you why but first even if it was a stock normal Hummer", "start": 174.63, "duration": 6.809}, {"text": "This is what I've wanted since I was a little kid and like any dream car as a kid, you have posters on the wall", "start": 181.48, "duration": 5.66}, {"text": "this poster sums it up true the", "start": 187.14, "duration": 2.0}, {"text": "H1 isn't for everyone, but it didn't matter to me because I found something that I really liked. I wanted so bad", "start": 189.16, "duration": 7.13}, {"text": "So anytime I could find a model. I would go and pick it up and I'd play with it", "start": 196.3, "duration": 4.669}, {"text": "Imagining what it would be like to have my own Hummer and what is really cool is?", "start": 201.25, "duration": 3.86}, {"text": "What was once a model car I would play with is now the real thing", "start": 205.18, "duration": 3.56}, {"text": "Sitting in my driveway, but it didn't stop at model cars every single video game that had the Hummer in it", "start": 209.26, "duration": 6.53}, {"text": "I had to get because I wanted to drive it", "start": 215.79, "duration": 2.25}, {"text": "I wanted this car that bad and I already told you I have super supportive parents", "start": 218.04, "duration": 4.259}, {"text": "Even when I was a kid, they would take me to the local dealership just to go and look at the Hummers", "start": 222.3, "duration": 4.619}, {"text": "it's like a kid going to Disney World and", "start": 226.92, "duration": 2.0}, {"text": "Every time I went I'd make sure I'd pick up a brochure and then I'd spend all night long", "start": 229.06, "duration": 4.669}, {"text": "Just looking at everything looking at the Hummers going off-road and wanting to do exactly that forwarding water like that", "start": 233.73, "duration": 6.21}, {"text": "Reading all the statistics going up and down mountains and Hills and I mean as a kid this was paradise", "start": 240.22, "duration": 6.559}, {"text": "I got to see all the options at head and it's just such a cool thing and opening up", "start": 246.78, "duration": 4.739}, {"text": "this brochure is just bringing back good memories and", "start": 251.519, "duration": 2.37}, {"text": "Speaking of Disney GM sponsors test track. It's a ride at Disney World and", "start": 254.44, "duration": 4.429}, {"text": "That's me and my sister right there", "start": 259.45, "duration": 1.67}, {"text": "And yes", "start": 261.12, "duration": 0.48}, {"text": "That is a Hummer", "start": 261.6, "duration": 1.36}, {"text": "Every time I'd go on the ride the thing I liked the most was going to check out the Hummer seeing it up close", "start": 262.96, "duration": 5.059}, {"text": "Seeing the interior and just walking around and getting pictures in front of it", "start": 268.09, "duration": 3.74}, {"text": "So after all the toy cars the brochures the posters the Disneyworld seeing these cars at the dealership", "start": 271.83, "duration": 5.669}, {"text": "I finally did it this Hummer right here is mine and with less than 12,000 made from 92 to", "start": 277.5, "duration": 6.839}, {"text": "2006 this was not easy to find and a lot of these Hummers are in badge shape", "start": 285.19, "duration": 4.58}, {"text": "They cost a ton of money and they cost even more money to fix up", "start": 289.98, "duration": 3.269}, {"text": "so let me show you the advertisement that caught my eye and how I found this so the same exact site that I found the", "start": 293.25, "duration": 6.389}, {"text": "$300 del Sol and the same exact site that I found my mom's dream car", "start": 299.77, "duration": 3.98}, {"text": "I've been searching Auto Tempest every day for my dream car the good thing about this site is it searches a bunch of different sites?", "start": 303.75, "duration": 7.079}, {"text": "All at once so eBay and cars calm for example", "start": 310.83, "duration": 2.94}, {"text": "It'll search all of that so you don't have to go to each individual website", "start": 313.77, "duration": 3.21}, {"text": "So it's really helpful and if you go in search for a Hummer, well, there are tons of Hummers for sale", "start": 316.98, "duration": 6.209}, {"text": "Even though there's not really many out there. So I searched and searched and finally I found this one", "start": 323.19, "duration": 5.519}, {"text": "He didn't have too many pictures posted on here", "start": 328.71, "duration": 2.07}, {"text": "but this was definitely one of my favorite colors and this thing looked hooked up and when I took a look down in the description", "start": 330.78, "duration": 5.22}, {"text": "Man, this thing was hooked up. This is exactly what I wanted. And as you know, the rest is history", "start": 336.55, "duration": 5.029}, {"text": "So this is the third car I found on this website. I'll link this in the description", "start": 341.58, "duration": 4.83}, {"text": "So you guys could try it out and I want to thank Auto Tempest for supporting the video", "start": 346.41, "duration": 3.66}, {"text": "I also want to thank you guys because on", "start": 350.07, "duration": 2.609}, {"text": "Instagram you guys sent me tons of DMS with all different Hummers from all over the United States", "start": 352.93, "duration": 5.45}, {"text": "Trying to help me find my dream car. So I really appreciate all the support from everyone", "start": 358.6, "duration": 5.0}, {"text": "So a reputable shop that only works on Hummers built this one and customized it. Here's the invoice", "start": 363.6, "duration": 5.099}, {"text": "It's six pages long and we TC the total at the end here this build without the cost of the Hummer cost the guy", "start": 368.7, "duration": 6.3}, {"text": "58 thousand dollars and that's with a 12,000 dollar credit", "start": 375.37, "duration": 2.75}, {"text": "So this build cost seventy thousand dollars on top of the cost of the Hummer?", "start": 378.12, "duration": 4.41}, {"text": "So let me show you the main things that this build included and why this is the ultimate Hummer", "start": 382.53, "duration": 4.829}, {"text": "So let's dive right into it", "start": 387.51, "duration": 1.44}, {"text": "so the first thing and the most major", "start": 388.95, "duration": 1.81}, {"text": "Modification that makes this Hummer special is located under the hood to open the hood. We have to move this push bar", "start": 390.76, "duration": 4.97}, {"text": "So you have to pull this out first", "start": 395.73, "duration": 1.63}, {"text": "And then you could push the push bar forward so that we have access to the hood now with the hood", "start": 397.36, "duration": 4.67}, {"text": "We have a latch here that you just unlatch and now we can lift up the lightweight fiberglass hood", "start": 402.03, "duration": 4.41}, {"text": "So when this was stock it had a six point five liter turbo diesel engine made it to a four-speed automatic transmission. It made", "start": 406.72, "duration": 6.979}, {"text": "170 horsepower and", "start": 414.46, "duration": 2.0}, {"text": "294 pounds of torque and that is four eight eight thousand pound truck now", "start": 416.92, "duration": 4.82}, {"text": "It was slow zero to sixty was 16 seconds. Yes, zero-to-sixty was 16 seconds. Not the quarter-mile zero-to-sixty", "start": 421.74, "duration": 6.809}, {"text": "It was very slow. And on a good day. You got 10 miles a gallon so it wasn't very efficient", "start": 428.55, "duration": 4.829}, {"text": "So that old transmission and engine was yanked out and they installed this this is a Duramax diesel", "start": 433.38, "duration": 5.16}, {"text": "6.6 liter", "start": 439.06, "duration": 1.14}, {"text": "Lmm diesel engine made it to a Allison 1000 6-speed automatic transmission", "start": 440.2, "duration": 5.63}, {"text": "This engine has many upgrades full straight pipe four inch exhaust", "start": 445.83, "duration": 3.57}, {"text": "upgraded radiator upgraded intercooler and much more so it makes", "start": 450.07, "duration": 3.38}, {"text": "450 horsepower and", "start": 454.9, "duration": 2.0}, {"text": "900 foot-pounds of torque and what I'm telling you this thing is a torque monster. I'm not even kidding. This is insane. Why not?", "start": 457.39, "duration": 5.899}, {"text": "Let's go for a ride first off. Listen to how good this sounds", "start": 463.3, "duration": 4.25}, {"text": "It's not too loud and the turbo spool sounds amazing, but the best part is with the upgraded Duramax engine and Allison Transmission", "start": 470.47, "duration": 7.32}, {"text": "It's super reliable and it drives like a normal car or truck on the road and I get an average of 15 miles a gallon", "start": 477.79, "duration": 6.209}, {"text": "Which is better than many pickup trucks and SUVs", "start": 484.0, "duration": 2.61}, {"text": "And then when you go to emerge on a highway this 8,000 pound truck we have a lot of traffic right here watch this", "start": 488.96, "duration": 6.77}, {"text": "Baby", "start": 499.6, "duration": 1.87}, {"text": "Just to give you an idea the zero to sixty in this takes only seven seconds", "start": 501.47, "duration": 4.01}, {"text": "Insanely fast and we merge into traffic with no problems at all", "start": 505.969, "duration": 4.41}, {"text": "Now when you add power and speed to a four ton vehicle", "start": 510.749, "duration": 3.319}, {"text": "You also have to have good braking", "start": 514.069, "duration": 1.801}, {"text": "So all four brake pads have been upgraded to alpha brakes which are huge and if you're looking over here", "start": 515.87, "duration": 6.119}, {"text": "And you don't see breaks. Don't worry. You're not going crazy", "start": 521.99, "duration": 2.339}, {"text": "Normally the brakes would be right here. But in this case we have a portal axle, which is an amazing piece of technology", "start": 524.839, "duration": 4.65}, {"text": "I'll explain it in a little but instead of having brakes right here like a normal car if we follow the axle into the frame", "start": 529.529, "duration": 5.75}, {"text": "Of the car you can see the brakes are located right in there. And so you could better visualize where these brakes are", "start": 535.279, "duration": 5.94}, {"text": "Let's step back for a second", "start": 541.22, "duration": 1.32}, {"text": "They're located right in the middle at the frame rails right there, and there's three benefits to that", "start": 542.54, "duration": 5.58}, {"text": "The first benefit is there's less unsprung weight because you don't have your brakes out at the wheels", "start": 548.12, "duration": 4.919}, {"text": "So you get better handling?", "start": 553.04, "duration": 1.32}, {"text": "the second benefit is you have way more protection up underneath for off-roading and making sure nothing hits the brakes or", "start": 554.36, "duration": 6.899}, {"text": "Damages the brakes and then the third one is with inboard brakes", "start": 561.54, "duration": 3.349}, {"text": "You're able to fit larger brakes and make more braking power and what I'm talking about braking power. It is incredible on this car", "start": 564.889, "duration": 6.299}, {"text": "Why not? Let's go test them out when I get to the cones. I'm gonna slam on the brakes", "start": 571.189, "duration": 4.26}, {"text": "So let's get up to 60 miles an hour. It's", "start": 575.449, "duration": 2.309}, {"text": "We can stop and we're a little bit above 60 and I'm gonna slam on the brakes", "start": 578.39, "duration": 4.379}, {"text": "Oh", "start": 584.18, "duration": 2.0}, {"text": "Man holy smokes", "start": 587.25, "duration": 2.0}, {"text": "That was insane. I can't believe how hard this thing breaks", "start": 589.65, "duration": 3.289}, {"text": "So now we can measure the distance from the front tires all the way to the cones", "start": 593.01, "duration": 3.98}, {"text": "Using this measuring wheel and we have just under a hundred and forty feet for this eight", "start": 597.39, "duration": 4.82}, {"text": "Thousand pound Hummer to stop from 60 miles an hour. So we have a crazy powerful and reliable Duramax engine", "start": 602.46, "duration": 6.32}, {"text": "We have a super-strong allison transmission and those brakes are crazy good to stop this 8,000 pound beast", "start": 608.78, "duration": 6.719}, {"text": "But wait, there is more", "start": 615.5, "duration": 1.81}, {"text": "so when they did the conversion they had to take the body of the car and lift it off the frame and since they had", "start": 617.31, "duration": 5.45}, {"text": "Access to the frame, they sealed and painted the entire thing check out these pictures", "start": 622.76, "duration": 3.66}, {"text": "This is what the car looked like at the shop getting the conversion done", "start": 626.55, "duration": 2.989}, {"text": "And since my buddy wanted to test out the weight capacity of his new lift", "start": 629.57, "duration": 3.57}, {"text": "I was able to get a good look underneath the Hummer. So check this out the underside of this truck is spotless", "start": 633.14, "duration": 5.94}, {"text": "There's no rust at all and everything is painted and looks amazing", "start": 639.08, "duration": 3.75}, {"text": "You can also see the undercarriage protection like this diff protector and the sheet steel that protects the fuel tanks", "start": 643.02, "duration": 6.14}, {"text": "So nothing punctures the tanks while you're off-roading", "start": 649.16, "duration": 2.0}, {"text": "It also has the transmission and engine protection and basically the whole underside has the optional undercarriage protection kit", "start": 651.27, "duration": 7.16}, {"text": "So when you go off-road or drive over cars, which I will be doing to finish up this video", "start": 658.43, "duration": 4.859}, {"text": "You don't damage the vital parts of the truck and I still can't believe how clean this truck is and not only is everything looking", "start": 663.29, "duration": 6.539}, {"text": "clean and painted but it's also brand new all the suspension components from the lower ball joints to the upper ball joints including", "start": 669.83, "duration": 6.239}, {"text": "12,000 pound axles. Well, they're all brand new on all four corners", "start": 676.86, "duration": 4.07}, {"text": "So not only aesthetically does this truck look good", "start": 681.0, "duration": 2.42}, {"text": "But it also performs like a brand new truck with all the suspension components being brand new now talking about the aesthetics and off-road", "start": 683.42, "duration": 6.779}, {"text": "Capabilities they added a front push bar. And the reason why I need a good front push bar is because", "start": 690.27, "duration": 4.01}, {"text": "This is a lightweight fiberglass. So you want to make sure there's no intrusion of sticks or branches or anything into the engine bay", "start": 694.86, "duration": 6.079}, {"text": "They have brand new xenon headlights, which work really? Well check this out at night", "start": 700.97, "duration": 4.739}, {"text": "Here's a dark road with the lights off and then when we switch them on", "start": 705.71, "duration": 2.849}, {"text": "You could see everything plus there's a nice cutoff so you don't blind other drivers, but look at that", "start": 709.36, "duration": 5.069}, {"text": "It is nice and bright and these are amazing headlights for a truck designed in the 80s. Now what doesn't work", "start": 714.429, "duration": 5.309}, {"text": "Well are the off-road lights with them on and they light the hood of the car up and make you night blind", "start": 719.739, "duration": 5.73}, {"text": "It's just old technology the halogen lights just aren't good as the new LEDs which are a lot brighter and throw the light better", "start": 725.47, "duration": 6.57}, {"text": "And those off-road lights are located right up there on the custom light bar. There's four of them. They're halogen. They're old-school", "start": 732.399, "duration": 6.75}, {"text": "They draw a lot of amperage ends. You saw they don't light up very well", "start": 739.149, "duration": 3.659}, {"text": "So I'm gonna replace those with some high quality LED lights. I need to figure that out", "start": 742.809, "duration": 3.66}, {"text": "but the other thing that this thing has is a", "start": 746.47, "duration": 2.219}, {"text": "12,000 pound winch bumper. So there is a 12,000 pound winch in here. It could pull literally everything", "start": 749.269, "duration": 5.359}, {"text": "I pulled the car with the brakes on and a Hummer didn't even budge", "start": 754.629, "duration": 3.419}, {"text": "So we'll have no problem pulling ourselves out of anything we get stuck in or helping other people get out of whatever they get stuck", "start": 758.049, "duration": 5.4}, {"text": "In and the good thing about this aftermarket bumper is we maintain the stock 72 degree approach angle", "start": 763.449, "duration": 5.429}, {"text": "That's 18 degrees away from climbing a vertical wall", "start": 769.04, "duration": 3.199}, {"text": "And this is impressive because stock without a winch the approach angle is 72 degrees and stuck with the Hummer winch bumper the approach angle", "start": 772.239, "duration": 7.44}, {"text": "Gets cut to 47 degrees", "start": 779.679, "duration": 1.33}, {"text": "And so you could see the difference right here is the massive stock winch bumper compare that to this custom one", "start": 781.009, "duration": 5.989}, {"text": "Which is really low profile. So this is a nice upgrade now at the back of the Hummer", "start": 786.999, "duration": 4.11}, {"text": "We have a custom ladder rack bumper. So we have a bumper with a ladder that goes up to the roof", "start": 791.11, "duration": 4.079}, {"text": "I'll show you that in a second and this custom ladder rack bumper has", "start": 795.189, "duration": 3.239}, {"text": "Helicopter d-rings. Yes. You heard right helicopter d-rings", "start": 799.1, "duration": 3.5}, {"text": "And the reason why they call the helicopter d-rings is because in the military, this is where they would strap your Hummer to a helicopter", "start": 802.6, "duration": 5.88}, {"text": "Transported into the middle of the battlefield or into remote locations. They even parachute these Hummers Adam planes", "start": 809.209, "duration": 6.14}, {"text": "So this rear bumper is no joke", "start": 815.39, "duration": 2.539}, {"text": "It is very strong and it has a trailer hitch on it", "start": 817.93, "duration": 2.82}, {"text": "And this trailer hitch is something I needed because well check this out", "start": 820.75, "duration": 3.179}, {"text": "Because I finally have a truck that could tow", "start": 824.24, "duration": 2.089}, {"text": "I picked up a twenty eight foot aluminum trailer for the drift car and my future project cars", "start": 826.329, "duration": 5.52}, {"text": "So check this now", "start": 831.86, "duration": 2.059}, {"text": "This is such a huge trailer 28 feet and this truck pulls it effortlessly", "start": 834.019, "duration": 5.75}, {"text": "It's a bare-bones trailer because I'm gonna show you guys how to hook this up instead of spending a ton of money and getting everything", "start": 839.89, "duration": 5.369}, {"text": "Already put in it. I'm gonna show you how to save half the cost", "start": 845.26, "duration": 2.579}, {"text": "Anyway, that's for another video at the site escape door the drift car future projects", "start": 848.029, "duration": 4.79}, {"text": "All that stuff is going to be right here and I'm gonna have a giant toolbox in the front with cabinets", "start": 852.82, "duration": 4.919}, {"text": "It's gonna be awesome and the best thing is because of my dream car", "start": 857.779, "duration": 3.98}, {"text": "I'm able to get something like this because I'm able to tow it and this Hummer tows it perfectly", "start": 861.76, "duration": 4.229}, {"text": "Barely any sag in the rear and we haven't even done weight distribution. There's no car in here yet", "start": 866.12, "duration": 4.609}, {"text": "So it's so nice, and I'm so glad I was able to get a trailer", "start": 870.73, "duration": 3.69}, {"text": "So that is where that tow hitch will come in handy, and if you can't tell already I'll be using this dream truck", "start": 874.43, "duration": 5.539}, {"text": "It's not gonna sit in the garage. It's not going to be used everyone smile. It's gonna be my daily", "start": 879.97, "duration": 4.26}, {"text": "So we're gonna be towing things with it. We're gonna be going off-road and check out this room in the back here", "start": 884.23, "duration": 4.619}, {"text": "There's plenty of room back here for a fishing tackle for whatever it is camping supplies", "start": 888.85, "duration": 4.83}, {"text": "stuff that you need to put in the back of a truck and", "start": 893.839, "duration": 2.36}, {"text": "I love how that sounds and now there's even more room upstairs and yes upstairs so you could actually climb up this and", "start": 896.6, "duration": 7.429}, {"text": "That gives you access to this gargantuan roof rack where you could store whatever you want on it", "start": 904.459, "duration": 4.91}, {"text": "It's cool because you could actually walk on the roof of your car now", "start": 909.37, "duration": 3.0}, {"text": "Not only can you store stuff up here?", "start": 912.37, "duration": 1.68}, {"text": "But if you want you go camping you pitch a tent up here if you're going to the beach set up some chairs", "start": 914.05, "duration": 4.859}, {"text": "Put the fishing poles out and you got a nice vantage point from up here. It's pretty cool. So there you go", "start": 919.04, "duration": 5.03}, {"text": "There are all the modifications to this truck that make it perform just as good as it looks now", "start": 924.07, "duration": 5.339}, {"text": "Since this is gonna be my daily another important part of this truck is gonna be the interior", "start": 929.41, "duration": 3.9}, {"text": "So lets check it out!", "start": 933.649, "duration": 1.281}, {"text": "Now inside the Hummer is super nice and comfortable has almost like a trucker feel to it", "start": 934.93, "duration": 5.13}, {"text": "the captains seats are super comfortable", "start": 940.08, "duration": 2.22}, {"text": "and since this is not the military version, this is the civilian version", "start": 942.3, "duration": 3.0}, {"text": "We have a nice air conditioning system", "start": 945.3, "duration": 2.5}, {"text": "this is actually the upgraded one, so its a $3000 upgrade", "start": 947.8, "duration": 2.84}, {"text": "So it blows colder and warmer since we have such a big interior, you have a radio and a sound system. That sounds pretty good", "start": 950.7, "duration": 6.04}, {"text": "So that is very nice it's enjoyable to drive around just play some music", "start": 960.74, "duration": 4.309}, {"text": "we have power windows power locks your normal shifter to put it into drive and reverse and we", "start": 965.05, "duration": 5.039}, {"text": "Have tons of gauges here that give you a lot of good information", "start": 970.31, "duration": 2.899}, {"text": "voltage oil pressure water temperature fuel", "start": 973.91, "duration": 3.109}, {"text": "Rpms now my favorite ones. There's two awesome gauges on this now", "start": 977.69, "duration": 3.38}, {"text": "My favorite ones all the fuel gauge and the central tire inflation system", "start": 981.07, "duration": 3.539}, {"text": "The reason why the fuel gauge is so cool is because we have two tanks in this", "start": 984.71, "duration": 3.26}, {"text": "So if you see this right here", "start": 987.98, "duration": 1.55}, {"text": "You can see it says fuel main and auxiliary watch the fuel gauge as I switch from main to auxiliary", "start": 989.53, "duration": 6.21}, {"text": "So the main tank is 25 gallons. The auxiliary tank is 17 gallons giving us a total of 42 gallons over", "start": 996.5, "duration": 5.69}, {"text": "600 miles of range and there's just something about being able to go from a half a tank to a full tank with the flip", "start": 1002.71, "duration": 6.26}, {"text": "Of a switch. That's really cool. Now. My next favorite feature engage is the central tire inflation system", "start": 1008.97, "duration": 4.89}, {"text": "So with this with the flip of a switch, we could inflate all four tires", "start": 1014.05, "duration": 4.039}, {"text": "Deflate all four tires", "start": 1019.06, "duration": 1.38}, {"text": "Or we could pick the front and inflate just the front or just the rear", "start": 1020.44, "duration": 3.919}, {"text": "So if we're at the trail or something and we want to deflate the tires", "start": 1024.73, "duration": 2.87}, {"text": "You just hit this and the air will get let out of the tires", "start": 1027.6, "duration": 2.849}, {"text": "No need to get out of the car and deflate each one by hand and you can see how the tire", "start": 1030.45, "duration": 4.199}, {"text": "bulges out which gives you more surface area therefore more grip and then when you're done going offroad you flip the switch and", "start": 1034.75, "duration": 6.68}, {"text": "Inflate your tires no more waiting on lines for the air pump at the beach or the off-road park", "start": 1041.86, "duration": 5.24}, {"text": "You don't have to go to the gas station. You don't have to wait for all the other jeeps and trucks", "start": 1047.1, "duration": 4.019}, {"text": "You just flip that switch and you drive now", "start": 1051.12, "duration": 2.73}, {"text": "It's gonna take some getting used to and what I don't really like is there's no horn here", "start": 1053.85, "duration": 3.509}, {"text": "You hit this. There's nothing the horn is actually located on the signal stalk and", "start": 1057.36, "duration": 4.05}, {"text": "The horn also doesn't sound that great for this truck", "start": 1062.08, "duration": 2.419}, {"text": "It should be like manly and beefy because there's a giant truck coming at you. It's like a little Italian horn there", "start": 1064.5, "duration": 5.16}, {"text": "So we're gonna have to fix that another thing", "start": 1069.66, "duration": 1.98}, {"text": "that's kind of strange is how far away you are to your", "start": 1071.64, "duration": 3.089}, {"text": "Passenger but to pet Cooper I have to really reach over there. You're so far away coop", "start": 1074.89, "duration": 4.489}, {"text": "I can't reach the passenger side and the interior here is huge because we have this dog box right here", "start": 1079.38, "duration": 5.88}, {"text": "So the dog box is actually a housing for the engine", "start": 1085.26, "duration": 2.759}, {"text": "The engine is right here because it's a mid-engine vehicle and underneath this is actually the engine in the military", "start": 1088.019, "duration": 5.55}, {"text": "They'll pull this out and you'll be able to get access to it and easily replace stuff", "start": 1093.57, "duration": 3.209}, {"text": "Then we have the transmission that goes back here and then the transfer case under here", "start": 1096.779, "duration": 3.63}, {"text": "so the reason why they do this is because it allows the engine transmission transfer case to be lifted up into the vehicle and", "start": 1100.409, "duration": 5.94}, {"text": "Provide amazing ground clearance 16 inches from the factory and you still maintain a low center of gravity", "start": 1106.57, "duration": 6.619}, {"text": "which is amazing and another reason why this truck is just", "start": 1113.289, "duration": 2.989}, {"text": "So wide is because it needs to fit within the tracks of a tank", "start": 1116.38, "duration": 4.159}, {"text": "So when this is out on a convoy, it doesn't have to go off-road the tanks flatten the ground pretty good", "start": 1120.539, "duration": 5.58}, {"text": "So the wheels fit right in the tracks of the tanks and that gives the soldiers a smooth ride", "start": 1126.12, "duration": 4.349}, {"text": "So it's actually really comfortable in here. It has almost like a cockpit feeling to it. And the front here for driving is great", "start": 1130.47, "duration": 6.359}, {"text": "Great visibility, but let me show you the back and with such a large truck. What do you guys think?", "start": 1136.83, "duration": 4.199}, {"text": "How many people can we fit in here eight? Well, you'd be wrong", "start": 1141.029, "duration": 2.97}, {"text": "The Hummer actually doesn't have a lot of seating room in the civilian", "start": 1144.0, "duration": 2.819}, {"text": "Configuration because we have this giant doghouse in the middle that houses the engine transmission and transfer case", "start": 1147.19, "duration": 5.57}, {"text": "so in reality", "start": 1152.76, "duration": 0.93}, {"text": "We could see four people comfortably and the wagon this one specifically has the option of this weird bench seat", "start": 1153.69, "duration": 6.989}, {"text": "I guess you could use four kids. There's really not much legroom, and there's really not much Headroom", "start": 1160.679, "duration": 4.469}, {"text": "You'd hit your head against the top if you're an adult sitting here", "start": 1165.149, "duration": 2.52}, {"text": "But I'm probably gonna remove it and put some type of storage rack or something in here", "start": 1167.789, "duration": 3.239}, {"text": "That we don't have to put everything in the back", "start": 1171.33, "duration": 1.809}, {"text": "But as a passenger", "start": 1173.139, "duration": 1.5}, {"text": "There's four of them that could sit comfortably and I really mean comfortably you have these nice leather seats", "start": 1174.639, "duration": 4.58}, {"text": "You have plenty of legroom and speaking of legroom. Let me show you something on the passenger side", "start": 1179.22, "duration": 4.199}, {"text": "This is a really cool option that most Hummers don't have and it's this knee cutout right here when they do the engine swap", "start": 1183.85, "duration": 6.199}, {"text": "They add in this knee cut out because stock it's horrible", "start": 1190.08, "duration": 3.66}, {"text": "This protrudes out here and takes away all your legroom and as a passenger you want to be comfortable and have as much leg room", "start": 1193.799, "duration": 5.489}, {"text": "as possible", "start": 1199.289, "duration": 0.48}, {"text": "So now there's plenty of room and this is just a really nice simple feature that makes this truck nice to ride in", "start": 1199.769, "duration": 5.91}, {"text": "So daily driving this Hummer is not gonna be difficult", "start": 1205.809, "duration": 2.69}, {"text": "It's actually going to be because of all the options it has but this Hummer isn't perfect", "start": 1208.5, "duration": 4.919}, {"text": "There are a couple issues. We need to fix let me show you what they are as you guys already know", "start": 1213.419, "duration": 4.38}, {"text": "I don't like to buy vehicles that are perfect because I like to fix them up", "start": 1217.799, "duration": 3.39}, {"text": "I save the money on the purchase price for doing my own work and this does need a bunch of work", "start": 1221.19, "duration": 5.04}, {"text": "It only has 20,000 miles on the swap, but it's due for a bunch of fluid changes the oils brand-new the coolants brand-new", "start": 1226.23, "duration": 6.449}, {"text": "But it needs brand new fluid in the portal axles. There's four of those", "start": 1232.679, "duration": 3.78}, {"text": "There's two differentials that need fluid the transmission needs fluid and the filter and the transfer case needs fluid", "start": 1236.46, "duration": 5.79}, {"text": "So all of that would cost a lot of money", "start": 1242.25, "duration": 2.13}, {"text": "If a Hummer mechanic did it also?", "start": 1244.38, "duration": 1.87}, {"text": "We need to put in some new switches for the windows and for the locks because the front ones don't work", "start": 1246.25, "duration": 4.939}, {"text": "We need to add a light bulb for the central tire inflation system gauge", "start": 1251.19, "duration": 3.3}, {"text": "And since we have seventy thousand dollars put into the car with engine and transmission all that", "start": 1254.49, "duration": 5.76}, {"text": "We want to make sure that we protect it. So I'm getting some locking fuel caps to put in", "start": 1260.25, "duration": 3.839}, {"text": "So nothing goes into the tank that shouldn't be there and finally we're gonna add a snorkel", "start": 1264.09, "duration": 4.89}, {"text": "So if we go off-road and we go in the water and get a little bit of a bow wake we don't have to worry", "start": 1268.98, "duration": 4.38}, {"text": "About sucking up water into our very expensive engine", "start": 1273.36, "duration": 3.119}, {"text": "so all that's gonna be pretty simple to do but it saves us a ton of money from the purchase price and it's gonna be", "start": 1276.48, "duration": 5.729}, {"text": "Pretty cool to show you guys how to do all this. It's very quick very easy. So let's get started", "start": 1282.21, "duration": 3.209}, {"text": "We're gonna start with the four portal axles and change the fluid in those", "start": 1285.419, "duration": 3.9}, {"text": "So to get the fluid out of the hub we need to take the wheel off", "start": 1289.659, "duration": 2.84}, {"text": "So to take the wheel off we need to jack up the Hummer and I ended up having to buy a new jack that could", "start": 1292.5, "duration": 4.409}, {"text": "Actually lift this huge truck and once it's lifted slide a jack stand", "start": 1296.909, "duration": 3.45}, {"text": "Under the frame and safely let down the truck onto the jack stand now", "start": 1300.49, "duration": 4.189}, {"text": "This might look a little bit different because this right here is the central tire inflation system", "start": 1304.679, "duration": 3.42}, {"text": "So what we need to do is remove this protector right here", "start": 1308.1, "duration": 2.339}, {"text": "And now there's a quick disconnect which we could disconnect like that and now we could remove all eight lug nuts holding in this giant", "start": 1311.679, "duration": 7.07}, {"text": "37 inch tire and with all the lugs removed carefully remove this very heavy", "start": 1318.97, "duration": 4.849}, {"text": "110 pound wheel and get it out of the way", "start": 1324.49, "duration": 2.51}, {"text": "So this back here is a portal axle and it's a pretty cool piece of technology", "start": 1327.0, "duration": 4.049}, {"text": "Because it gives you maximum ground clearance", "start": 1331.36, "duration": 2.029}, {"text": "So in a normal car or truck like underneath my pickup truck the axle goes straight into the hub so you only have this much", "start": 1333.46, "duration": 6.319}, {"text": "Ground clearance, you can't get any more than that unless if you increase the size the tires", "start": 1339.789, "duration": 4.1}, {"text": "But with a portal axle the axle comes in from the top and not in from the middle, so we increase our ground clearance", "start": 1343.89, "duration": 6.959}, {"text": "Significantly. We also allow ourselves to run central tire inflation, which goes through the middle and that's what goes into the hub", "start": 1351.37, "duration": 6.83}, {"text": "So that's the benefit of running a portal axle. You also have a gear reduction in here", "start": 1358.2, "duration": 3.779}, {"text": "So it's a one point nine five to one. So basically a two to one gear reduction", "start": 1362.1, "duration": 3.48}, {"text": "So every two spins of the axle equals one spin of the tyre", "start": 1365.58, "duration": 3.389}, {"text": "Basically doubling torque now in order to drain this we have the drain bolt underneath the portal axle right down there", "start": 1369.25, "duration": 6.65}, {"text": "So that's where we drain it from and then to fill it up. We have the fill bolt, which is right there", "start": 1375.9, "duration": 5.069}, {"text": "It's very simple", "start": 1380.97, "duration": 1.14}, {"text": "so let's change the fluid in this I", "start": 1382.11, "duration": 1.9}, {"text": "Always start by removing the fill bolt first cause if we remove the drain bolt first and can't remove the fill bolt", "start": 1384.01, "duration": 5.15}, {"text": "Well, how are you supposed to fill it back up? Okay", "start": 1389.16, "duration": 2.52}, {"text": "So with the fill bolt removed now, let's remove the drain bolt", "start": 1391.68, "duration": 2.579}, {"text": "So break this loose and remove it the rest of the way by hand now as that drains out", "start": 1394.26, "duration": 4.44}, {"text": "Let's add some teflon tape to the threads of the drain plug that way it seals the threads and it won't leak now we can", "start": 1398.7, "duration": 5.549}, {"text": "Put the drain plug back in and tighten it up so that it's snug don't over tighten it next", "start": 1404.25, "duration": 4.53}, {"text": "Let's fill this portal axle up with gear oil", "start": 1408.78, "duration": 1.95}, {"text": "It takes eighty w9d and you fill it up until it comes out of the fill hole", "start": 1410.73, "duration": 3.75}, {"text": "Then we could screw in our fill plug and snug it up and that's how you replace the fluid in the portal axles", "start": 1414.48, "duration": 5.55}, {"text": "Now there's three more I need to do so I'm gonna get the wheel on I'm not gonna bore you and show you the other", "start": 1420.03, "duration": 4.349}, {"text": "Three I'll get those done off-camera and then we'll move on to the next thing", "start": 1424.38, "duration": 3.57}, {"text": "So with the fluid changed in all four portal axles, the next thing to do is change the fluid in the differentials", "start": 1427.95, "duration": 5.789}, {"text": "There's a front differential and a rear differential. I already changed the fluid in the front differential", "start": 1433.74, "duration": 3.989}, {"text": "So let me show you how to change the fluid in the rear differential. Now this right here is the differential up", "start": 1437.77, "duration": 5.75}, {"text": "Here's the fill plug down here is the drain plug", "start": 1443.52, "duration": 2.64}, {"text": "So let's break loose the fill plug and remove it and then let's remove the drain plug and drain all the gear oil out", "start": 1446.26, "duration": 5.719}, {"text": "With all the oil drained out. Let's reinstall the plug and tighten it up. So it's snug next", "start": 1452.2, "duration": 5.119}, {"text": "Let's add the new gear oil and it takes about two quarts of oil and we know it's full when the oil comes out of", "start": 1457.32, "duration": 4.89}, {"text": "The fill hole just like that. So now let's tighten the fill bolt. So it's snug good", "start": 1462.21, "duration": 4.229}, {"text": "So with the differential fluid replaced in the front and rear differentials now, we can move on to replacing the transmission fluid", "start": 1466.69, "duration": 5.119}, {"text": "so this is our transmission pan right here and we have a drain plug so we don't have to undo the", "start": 1471.88, "duration": 4.88}, {"text": "Entire pan to drain it. We also have a transmission filter right here", "start": 1476.92, "duration": 3.81}, {"text": "So this is actually gonna be a really simple job", "start": 1480.73, "duration": 2.0}, {"text": "So first, let's break through the drain bolt and to remove it and the trans fluid looks nice and pink, which is good", "start": 1482.92, "duration": 5.88}, {"text": "So we'll let this drain completely", "start": 1488.8, "duration": 2.0}, {"text": "Reinstall the drain bolt and tighten it down. So it's snug", "start": 1490.88, "duration": 3.05}, {"text": "Good, so what the pan completely drained now?", "start": 1494.69, "duration": 2.839}, {"text": "Let's go and remove our filter", "start": 1497.53, "duration": 1.93}, {"text": "loosen the filter with an oil filter wrench and then it could come off the rest of the way by hand and", "start": 1499.46, "duration": 4.76}, {"text": "Let's try not to make a mess", "start": 1504.44, "duration": 1.46}, {"text": "So out with the old and in with the new and with the new filter since it goes straight up and down", "start": 1505.9, "duration": 5.369}, {"text": "I always like to fill filters up that way. They don't run dry when you first start up the car with the transmission", "start": 1511.27, "duration": 6.33}, {"text": "It's probably not really necessary. There's a ton of fluid still left in there anyway, but why not?", "start": 1517.6, "duration": 4.259}, {"text": "It takes a couple extra seconds and it's only beneficial. So now we could grab our filter", "start": 1521.86, "duration": 4.38}, {"text": "Another thing to do is lubricate this o-ring on the top here with a little bit of transmission fluid", "start": 1526.24, "duration": 3.78}, {"text": "That'll make it easier to come off when we have to replace this again", "start": 1530.02, "duration": 2.729}, {"text": "And now we could take this and install in the Hummer", "start": 1532.75, "duration": 2.46}, {"text": "So let's get this aligned and screw it on by hand and you only want to hand tighten oil and transmission filters", "start": 1535.28, "duration": 5.869}, {"text": "They don't ever have to be tightened any more than hand tight", "start": 1541.15, "duration": 3.03}, {"text": "And the last thing to do is to write the mileage on the filter just for a reference", "start": 1544.18, "duration": 4.049}, {"text": "So a year or more later, I could remember what the mileage was when I change this out. Okay", "start": 1548.23, "duration": 5.04}, {"text": "So with the pan drained and filter replaced", "start": 1553.27, "duration": 2.25}, {"text": "Let's head up to the engine where the dipstick is located", "start": 1555.53, "duration": 2.329}, {"text": "So we could fill this transmission back up and it's very important that you use the correct transmission fluid for your transmission", "start": 1558.2, "duration": 6.859}, {"text": "This Allison 1000 transmission uses decks around six full synthetic", "start": 1565.06, "duration": 3.66}, {"text": "If you use anything else it will damage it transmissions are very picky and we drained out about seven quarts", "start": 1568.72, "duration": 6.059}, {"text": "So now we need to fill with seven quarts now while this isn't a complete flush", "start": 1574.78, "duration": 3.75}, {"text": "It does change out about half the fluid which is good since our fluid was already in good shape and with his last quart finished", "start": 1578.53, "duration": 6.75}, {"text": "Up, we could remove the funnel and put the dipstick back in to take a cold measurement", "start": 1585.28, "duration": 4.949}, {"text": "Now, let's pull it out and look at that right at the cold fill line. Perfect", "start": 1590.3, "duration": 5.329}, {"text": "So with our transmission fluid replaced and good to go now", "start": 1595.63, "duration": 3.84}, {"text": "Let's go under the truck and replace the transfer case fluid this right here is the transfer case", "start": 1599.47, "duration": 4.859}, {"text": "It allows you to go into two-wheel drive or four-wheel drive", "start": 1604.33, "duration": 2.789}, {"text": "So let's change the fluid", "start": 1607.12, "duration": 1.63}, {"text": "Start by removing the fill and I don't know if you guys are noticing a pattern here and then remove the drain bolt", "start": 1608.75, "duration": 4.979}, {"text": "And it's good. We're changing this fluid out because that should be a bright red like our transmission fluid", "start": 1614.07, "duration": 5.09}, {"text": "So with all the fluid drained out now", "start": 1619.16, "duration": 1.62}, {"text": "Let's tighten up the drain bolt and you guessed it so that it's snug", "start": 1620.78, "duration": 3.119}, {"text": "then we can pump in the transmission fluid until it comes out of the fill hole and", "start": 1624.03, "duration": 3.529}, {"text": "Finally tighten down the fill bolt", "start": 1627.84, "duration": 1.64}, {"text": "And that's all there is to replacing the transfer case fluid", "start": 1629.48, "duration": 2.64}, {"text": "And with that all the fluids in this truck are brand new and the truck is ready to go", "start": 1632.46, "duration": 4.7}, {"text": "Well, almost we have a couple little things that we need to do", "start": 1637.429, "duration": 2.82}, {"text": "So let's start out by installing brand-new window switches and door locks. So here are the buttons that need to be replaced", "start": 1640.25, "duration": 5.819}, {"text": "Listen to this it locks perfectly fine, but there's no unlock at all", "start": 1646.34, "duration": 5.339}, {"text": "And then the windows don't work in either direction. So both of these need to get replaced", "start": 1651.679, "duration": 4.41}, {"text": "So to get access to the switches", "start": 1656.19, "duration": 1.76}, {"text": "we need to unscrew the four screws holding it in and then we can remove the wires from the back of the switches and", "start": 1657.95, "duration": 5.19}, {"text": "finally push the switches out of the holder so out with the old and in", "start": 1663.659, "duration": 4.01}, {"text": "with the new", "start": 1667.83, "duration": 1.11}, {"text": "and these just pushing through the holder like that and a little trick is to add some silicone paste to your electrical connectors and that", "start": 1668.94, "duration": 6.29}, {"text": "prevents moisture from corroding the connection then we could connect the wires to the new switches and", "start": 1675.23, "duration": 4.38}, {"text": "Screw in all four screws that hold the panel into place", "start": 1679.71, "duration": 3.199}, {"text": "All right. So let's try it out and we have our windows which work perfectly and", "start": 1683.1, "duration": 5.059}, {"text": "Beautiful the door locks work perfectly as well. So that is done and not only do these buttons work better", "start": 1689.61, "duration": 6.14}, {"text": "They light up and they look way better. These buttons are old and tired. So that's beautiful. Glad that is done next", "start": 1695.75, "duration": 7.14}, {"text": "Let's real quickly replace the light bulb inside the central tire inflation system gauge at night", "start": 1702.89, "duration": 4.649}, {"text": "You can see the lights work on everything except this gauge. So let's fix that and this gauge is held in with four screws", "start": 1707.539, "duration": 6.0}, {"text": "So let's loosen them all up and then we can pop the gauge out and let's take a look at the bulb", "start": 1713.539, "duration": 4.86}, {"text": "No wonder we don't have a bulb", "start": 1719.1, "duration": 1.88}, {"text": "So let's install a new bulb and hopefully that fixes that and a quick test beautiful and I'm glad that's all it was", "start": 1720.98, "duration": 5.939}, {"text": "So now let's get the gauge back into place and tighten down all four screws to hold it in", "start": 1727.11, "duration": 5.089}, {"text": "Beautiful. So let's try it out. All right, that's not talking about", "start": 1733.23, "duration": 3.679}, {"text": "Ok, the last two things we need to do super quick and easy fuel doors and snorkel", "start": 1737.46, "duration": 5.209}, {"text": "So let's go get these fuel doors installed", "start": 1742.669, "duration": 2.03}, {"text": "So let's come around the side of the truck and there are two fuel doors back here", "start": 1744.7, "duration": 3.329}, {"text": "We'll start with the main fuel tank and all we need to do is remove the six bolts holding the stock fuel filler in then", "start": 1748.03, "duration": 5.699}, {"text": "We can place the new fuel door over the stock one and then screw down the six brand new stainless steel", "start": 1753.73, "duration": 4.53}, {"text": "Bolts like so now let's open it up and there's one more bullet", "start": 1758.33, "duration": 4.099}, {"text": "We need to tighten that holds down the fuel filler cap", "start": 1762.43, "duration": 2.04}, {"text": "And then we can lock up the fuel door and check this out. This looks so good", "start": 1764.47, "duration": 4.769}, {"text": "Now we have a key to unlock it and to lock it", "start": 1769.24, "duration": 2.58}, {"text": "So nobody could put anything in our fuel tank and not only that but this looks amazing especially compared to the old-school style", "start": 1771.82, "duration": 6.959}, {"text": "So now let's install the other fuel cap on the auxilary tank and instead of showing you the entire process", "start": 1778.9, "duration": 4.949}, {"text": "out with the old and", "start": 1784.52, "duration": 1.71}, {"text": "in with the new and the last thing to do is get my key chain and put the new key on there that way when", "start": 1786.23, "duration": 6.02}, {"text": "I fill up I'll be able to open the fuel tank", "start": 1792.25, "duration": 2.369}, {"text": "So these look great and they function nobody could get in here and put anything in the fuel tanks. Perfect", "start": 1794.62, "duration": 6.21}, {"text": "One more thing left to do and the last thing is to install a snorkel all this is is a PVC", "start": 1800.93, "duration": 5.78}, {"text": "Coupler pipe and the reason why this is so important to do is because we're actually going to be using this truck", "start": 1806.9, "duration": 5.15}, {"text": "Off-road for real we're gonna have water up to here, but we're going to be pushing a bow wake a bow", "start": 1812.18, "duration": 4.579}, {"text": "It could potentially come up and over and then this is where the air intake is for the engine", "start": 1816.76, "duration": 5.16}, {"text": "So if a bow weight comes over and floods this well", "start": 1821.92, "duration": 2.729}, {"text": "We could ingest water into the engine which would cause it the hydro lock", "start": 1824.65, "duration": 3.15}, {"text": "So a simple solution is just to raise this up a little bit and that's where this PVC pipe will come in handy", "start": 1827.8, "duration": 5.429}, {"text": "We're gonna make it look nice", "start": 1833.23, "duration": 1.23}, {"text": "It's not going to look cheap and it's actually going to look like it fits plus it's going to be completely functional", "start": 1834.46, "duration": 4.739}, {"text": "So let's go paint this black. Now any time you paint prep is the most important thing", "start": 1839.27, "duration": 5.06}, {"text": "We're going to be using an adhesion promoter primer and the same brand we're going to be using a flat protective", "start": 1844.33, "duration": 4.919}, {"text": "Enamel not to prep our PVC you want to make sure you scuff up the surface", "start": 1849.71, "duration": 3.38}, {"text": "So we're using 400 grit", "start": 1853.09, "duration": 1.44}, {"text": "So it has some scratches on it for the paint to bite into and after it's all scuffed up now", "start": 1854.53, "duration": 5.01}, {"text": "we want to grab some soapy water and", "start": 1859.54, "duration": 1.51}, {"text": "just spray it down to remove all the dirt and debris and any dust and oils we have on here now we could go and", "start": 1861.05, "duration": 6.469}, {"text": "Paint this so we're going to start with an adhesion promoter", "start": 1867.52, "duration": 2.88}, {"text": "you want to do three light and even coats and this stuff is going to help bond our black paint to the", "start": 1870.4, "duration": 5.579}, {"text": "PVC so", "start": 1876.08, "duration": 0.919}, {"text": "Less likely to flake and it'll have better durability and after letting that drive for five minutes now we can move on to our flat", "start": 1876.999, "duration": 6.119}, {"text": "Black color coat just like the primer coat we want to spray three light and even coats working all the way around the PVC coupler", "start": 1883.119, "duration": 6.75}, {"text": "Make sure you use an overlapping pattern to build up the coats and always follow the instructions on the spray can especially for drying times", "start": 1889.869, "duration": 6.719}, {"text": "Now as we wait for that to dry, let's remove the snorkel top", "start": 1899.029, "duration": 3.229}, {"text": "all we have to do is unscrew the hose clamp and then slide this off and", "start": 1902.259, "duration": 4.38}, {"text": "When the snorkel is dry we can install it and look at how good this came out", "start": 1907.159, "duration": 4.039}, {"text": "So set it in place and then I'm gonna tap it down into the fitting. So it's watertight and", "start": 1911.389, "duration": 5.239}, {"text": "finally add that snorkel top and tighten it down and", "start": 1917.329, "duration": 3.47}, {"text": "Check that out. That looks so good", "start": 1922.159, "duration": 2.0}, {"text": "Not only does it match the black and it looks amazing", "start": 1924.159, "duration": 2.609}, {"text": "But it's completely functional if we have a bow wave and it comes over", "start": 1926.839, "duration": 3.53}, {"text": "We're not gonna suck in water now because this is lifted up now. It is time to actually put this thing to the test", "start": 1930.499, "duration": 6.949}, {"text": "We're gonna go off-roading. We're gonna go through some water and we're gonna go ride over some cars", "start": 1937.629, "duration": 5.01}, {"text": "So let's get out there", "start": 1942.679, "duration": 1.71}, {"text": "So there aren't too many legal spots to go off-road in, New Jersey", "start": 1944.389, "duration": 3.29}, {"text": "But I do know a few in South Jersey and to get to one of them. There are some decent ruts", "start": 1947.839, "duration": 4.7}, {"text": "We need to cross. Luckily with this Hummers 16-inch ground clearance and four-wheel drive system. Well stuff like this", "start": 1952.539, "duration": 6.0}, {"text": "So let's go and test out the snorkel and the waterboarding capabilities of this truck", "start": 1959.75, "duration": 4.59}, {"text": "Alright check this out", "start": 1965.13, "duration": 2.0}, {"text": "We are about to test out that snorkel and I mean test out there is some deep water here", "start": 1967.35, "duration": 6.739}, {"text": "We're in between two cranberry bogs and there is a flooded path here. He goes over 30 inches", "start": 1974.09, "duration": 4.949}, {"text": "So we're allowed to go technically 30 inches before we have an issue", "start": 1979.04, "duration": 3.3}, {"text": "but we could definitely go over as long as it's not for extended periods of time and we're not", "start": 1982.34, "duration": 3.689}, {"text": "Stopping in it", "start": 1986.13, "duration": 0.68}, {"text": "We could stop in 30 inches, but that's why we have the snorkel so that if we get a bow wake or something", "start": 1986.81, "duration": 4.589}, {"text": "We don't have to worry about water getting sucked in so I aired down the tires", "start": 1991.4, "duration": 3.719}, {"text": "We have a nice big", "start": 1995.37, "duration": 1.44}, {"text": "Footprint, and we're about to try this out and see if we make it time to put the Hummer to the test, baby", "start": 1996.81, "duration": 6.559}, {"text": "And that was insane, oh man, let's turn around because we need to do that again", "start": 2020.7, "duration": 5.789}, {"text": "And we have order up to the top of the hood and remember our tires are 37 inches tall", "start": 2042.789, "duration": 5.579}, {"text": "So we're in over three and a half feet of water", "start": 2048.369, "duration": 2.669}, {"text": "effortlessly", "start": 2052.009, "duration": 1.32}, {"text": "Holy", "start": 2053.329, "duration": 1.23}, {"text": "smokes that was insane", "start": 2054.559, "duration": 1.85}, {"text": "So we were way above we were like right about here on water and there's a little bit water in here", "start": 2056.409, "duration": 5.159}, {"text": "Not a big deal it drains out, but we made it", "start": 2061.569, "duration": 2.85}, {"text": "We made it all the way across that was insane the snorkel Oh check this out. I got some lily pads up here", "start": 2064.419, "duration": 7.83}, {"text": "the snorkel worked perfect", "start": 2072.769, "duration": 2.36}, {"text": "that is", "start": 2075.129, "duration": 1.091}, {"text": "Exactly what we wanted if there was a batwake that came over which we didn't have too much water come up too high", "start": 2076.22, "duration": 5.449}, {"text": "But if there was a bad weight coming over it wouldn't suck it in like the stock location", "start": 2081.669, "duration": 3.899}, {"text": "That's exactly what we wanted and man. Oh, man", "start": 2085.569, "duration": 2.939}, {"text": "What a cool cool thing to do a cool thing to be able to go through that much water confidently", "start": 2088.509, "duration": 6.39}, {"text": "There was no tire spin you can air down no problem at all. Oh, man, I love this thing", "start": 2094.899, "duration": 5.639}, {"text": "Now the next thing we're doing is even crazier", "start": 2100.75, "duration": 2.699}, {"text": "I can't wait you guys I've been I've been planning this out for so long. You guys are gonna love it is nuts", "start": 2103.72, "duration": 5.159}, {"text": "okay, so to finish off this video in the most epic way I could think of we're gonna be doing something really crazy and", "start": 2109.64, "duration": 7.729}, {"text": "awesome", "start": 2117.41, "duration": 1.199}, {"text": "I've been planning this out in my head for the longest time. Finally. I'm able to do it", "start": 2118.609, "duration": 4.699}, {"text": "So let me show you what we're gonna be doing", "start": 2123.309, "duration": 2.01}, {"text": "All right", "start": 2126.38, "duration": 0.56}, {"text": "and there's no better way to finish up this video then take my dream car the Hummer and", "start": 2126.94, "duration": 5.729}, {"text": "Drive it over a pair of cars. Every Hummer owner has to do this. It's just it's a rite of passage", "start": 2133.039, "duration": 4.729}, {"text": "So we have two Honda Civics here. Don't worry", "start": 2137.809, "duration": 2.719}, {"text": "They're gonna get scrapped anyway for you Honda lovers and we're gonna go and drive over them now", "start": 2140.529, "duration": 4.56}, {"text": "I am a little bit nervous", "start": 2145.089, "duration": 1.45}, {"text": "This is uh watching a video is one thing but actually doing it in real life is completely different", "start": 2146.539, "duration": 4.94}, {"text": "So it's it's a little scary. But what we're gonna be doing is pulling the car right up to the front here", "start": 2151.48, "duration": 5.129}, {"text": "There's a couple things that can go wrong", "start": 2156.619, "duration": 1.611}, {"text": "We need to make sure that the roof", "start": 2158.23, "duration": 1.69}, {"text": "collapses evenly on each one so that we don't roll over and then at the end when we're gonna go off I'm actually going to", "start": 2159.92, "duration": 6.199}, {"text": "Go completely off. That's the goal. We're gonna go all the way to the back and drive completely off", "start": 2166.119, "duration": 5.429}, {"text": "I have to be careful because there is an overhang on the Hummer", "start": 2171.549, "duration": 2.61}, {"text": "It is armored, but I don't want to damage it just cut this thing. I don't want to ruin it", "start": 2174.16, "duration": 4.209}, {"text": "So let's finish this up in an awesome finale just drive over some Honda's", "start": 2178.49, "duration": 4.26}, {"text": "Okay, let's get my seatbelt on and I can't believe I'm about to do this", "start": 2184.98, "duration": 4.429}, {"text": "I'm gonna air down the tires just a little bit just so we could get some extra grip and here we go", "start": 2189.41, "duration": 5.67}, {"text": "Let's drive over some cars", "start": 2195.08, "duration": 2.0}, {"text": "And I'm gonna drive up right to the front until I bump up on the cars and now we're gonna send it", "start": 2197.22, "duration": 5.3}, {"text": "Holy smokes, this is insane. I'm running over actual cars", "start": 2218.71, "duration": 5.03}, {"text": "This is so crazy. I can't see anything the Hummers just tilt it up into the air", "start": 2224.8, "duration": 5.089}, {"text": "And I think I'm not getting any grip, okay, basically I need more speed so if back off the cars and try", "start": 2246.88, "duration": 7.729}, {"text": "Come on baby, let's get some grip here. Oh, there we go", "start": 2279.58, "duration": 4.34}, {"text": "All right, whoo, yeah", "start": 2287.2, "duration": 3.379}, {"text": "All right", "start": 2317.88, "duration": 1.71}, {"text": "There we go", "start": 2319.59, "duration": 2.0}, {"text": "So that is how you finish up a video on your dream truck. How insane was that going over?", "start": 2321.66, "duration": 5.75}, {"text": "these cars", "start": 2327.41, "duration": 0.67}, {"text": "was just it's it's like you can't feel the adrenaline through the video and it looks like nothing when you do it in a", "start": 2328.08, "duration": 5.81}, {"text": "YouTube video but in real life it is", "start": 2334.11, "duration": 2.27}, {"text": "Intense. It's so cool", "start": 2336.96, "duration": 1.47}, {"text": "it's such a weird feeling to feel the roof collapse the glass collapse the car tilting sideways and", "start": 2338.43, "duration": 6.589}, {"text": "This thing is just a beast the undercarriage protection worked the central tire inflation system worked. Everything worked. That is what I'm talking about", "start": 2345.09, "duration": 7.639}, {"text": "I don't know if you could tell if I'm excited here, but I do want to thank you guys. This is", "start": 2352.73, "duration": 3.6}, {"text": "incredible and it's only because of you guys that I was able to get my dream truck and", "start": 2356.88, "duration": 4.729}, {"text": "Hopefully my videos have been helpful", "start": 2362.28, "duration": 1.44}, {"text": "And if you guys were helped by any of my videos if you fix something on your car or truck or if you're able to", "start": 2363.72, "duration": 5.449}, {"text": "Learn something new comment below tell me what you were able to learn. That's what drives me. That's what keeps me going", "start": 2369.17, "duration": 5.76}, {"text": "Keeps me pushed", "start": 2375.26, "duration": 0.78}, {"text": "I haven't had a day off a full entire day off in four years because of making videos and running this YouTube channel", "start": 2376.04, "duration": 6.78}, {"text": "Totally ok with me because that's what drives me teaching you guys teaching the whole entire world how to properly fix their car save money", "start": 2383.31, "duration": 6.41}, {"text": "All that that's what it's all about to me", "start": 2389.72, "duration": 1.89}, {"text": "So comment below and let me know what you've learned for my channel also", "start": 2391.61, "duration": 3.449}, {"text": "Let me know what your dream car or truck is. This is incredible", "start": 2395.06, "duration": 3.63}, {"text": "I hope the hard work that you guys put in the passion that you guys put in to your job to your work", "start": 2398.69, "duration": 4.439}, {"text": "Pays off and you'll be able to get your dream vehicle as always", "start": 2403.2, "duration": 3.949}, {"text": "Thank you very much for all the support", "start": 2407.15, "duration": 1.15}, {"text": "If you guys enjoy the video remember to give it a thumbs up", "start": 2408.3, "duration": 2.39}, {"text": "If you're not a subscriber", "start": 2410.69, "duration": 1.17}, {"text": "Consider hitting that subscribe button and be sure to check the links in the description because I have some awesome stuff for you guys", "start": 2411.86, "duration": 6.12}]