[{"text": "I'm Geraldo Rivera, and you're about to witness a live television event.", "start": 0.2, "duration": 3.92}, {"text": "A massive, concrete vault has been discovered.", "start": 4.12, "duration": 2.6}, {"text": "Well tonight, for the first time, that vault is going to be open, live!", "start": 6.72, "duration": 4.2}, {"text": "(Squidward): HOLY SHRIMP!", "start": 14.62, "duration": 1.12}, {"text": "(MatPat): Hello, Internet!", "start": 31.98, "duration": 0.92}, {"text": "Welcome to Film Theory,", "start": 32.9, "duration": 2.32}, {"text": "the show that uncovers sea crits [secrets] with all the determination and success of Plankton.", "start": 35.22, "duration": 4.66}, {"text": "(whispering): Aw, shoot, that's not really a good thing, is it?", "start": 39.88, "duration": 2.18}, {"text": "Spongebob Squarepants as a franchise has been so omnipresent since its debut in 1999", "start": 42.06, "duration": 5.2}, {"text": "that I think most of us assume that it would never go away.", "start": 47.26, "duration": 2.66}, {"text": "Which is part of the reason why the loss of Stephen Hillenburg, its creator, at age 57 by ALS was so tragic.", "start": 49.92, "duration": 6.42}, {"text": "It's not exaggerating in the slightest to say that he gave us some of the most iconic characters,", "start": 56.34, "duration": 5.26}, {"text": "most quotable lines,", "start": 61.6, "duration": 1.38}, {"text": "and memorable moments of recent history.", "start": 62.98, "duration": 2.96}, {"text": "He is, without question, one of the most influential people in children's programming", "start": 65.94, "duration": 4.52}, {"text": "and current internet culture.", "start": 70.46, "duration": 1.68}, {"text": "It's probably for all those reasons that one of the most requested Film Theory topics of last year has been from Spongebob;", "start": 72.14, "duration": 6.44}, {"text": "specifically the question that all us burger lovers, sponge lovers, and spongy-burger lovers wanna know--", "start": 78.58, "duration": 6.34}, {"text": "what is the Krabby Patty's secret formula?", "start": 84.92, "duration": 3.64}, {"text": "It's a question that's persisted for so long that it feels like it should be sacrilegious to try and answer it.", "start": 88.56, "duration": 5.26}, {"text": "But...if there's one thing that Film Theory stands for, it's treating nothing as sacred.", "start": 93.82, "duration": 4.94}, {"text": "So today, Spongebob is on the menu, and I consider it my honor to see if we can find out the secret formula", "start": 98.76, "duration": 6.3}, {"text": "that tickles the taste buds of our imagination,", "start": 105.06, "duration": 2.16}, {"text": "or if this secret will remain trapped in Bikini Bottom forever.", "start": 107.22, "duration": 3.96}, {"text": "The biggest problem with trying to figure out the Krabby Patty's secret formula is that anytime it comes up in the show,", "start": 111.18, "duration": 5.28}, {"text": "we run into some suspicious problems.", "start": 116.46, "duration": 2.52}, {"text": "These problems make it hard to pinpoint just what the secret formula actually is.", "start": 118.98, "duration": 4.08}, {"text": "We know for a fact that the secret formula for a Krabby Patty is referring to the patty itself,", "start": 123.06, "duration": 4.54}, {"text": "and not what's actually on the burger, because we already know the full list of what goes on these things...", "start": 127.6, "duration": 5.98}, {"text": "...or, do we?", "start": 133.58, "duration": 1.48}, {"text": "The Krusty Krab is surprisingly fast and loose with this information since as early as season 1, episode 6--", "start": 135.06, "duration": 6.46}, {"text": "the episode \"Pickles\"--", "start": 141.52, "duration": 1.06}, {"text": "Spongebob reveals all the ingredients to a Krabby Patty with the works:", "start": 142.58, "duration": 3.88}, {"text": "(Spongebob): I can't put a patty on a bun with lettuce, cheese, onions, tomatoes, ketchup, mustard, pickles and top bun together in that order!", "start": 146.46, "duration": 7.18}, {"text": "(MatPat): From the mouth of the chef himself.", "start": 153.64, "duration": 1.78}, {"text": "But then the story changes, because two seasons later we hear a different recipe", "start": 155.42, "duration": 4.88}, {"text": "from the Krusty Krab commercial shown in \"As Seen On TV\"--season 3, episode 7.", "start": 160.3, "duration": 4.82}, {"text": "(Mr. Krabs): We start with a fresh patty, grilled and juicy.", "start": 165.12, "duration": 2.76}, {"text": "(Mr. Krabs): Add some crisp undersea veggies and cheese, topped off with secret sauce and some buns.", "start": 167.88, "duration": 6.1}, {"text": "(Mr. Krabs): Voilà, a Krabby Patty!", "start": 173.98, "duration": 2.6}, {"text": "(MatPat): It's pretty significantly different.", "start": 176.58, "duration": 2.0}, {"text": "This one is missing mustard, tomatoes and onions, which are not underseas veggies.", "start": 178.58, "duration": 4.76}, {"text": "I'll give him cucumbers since, I guess, those could be sea cucumbers.", "start": 183.34, "duration": 3.6}, {"text": "And this one has secret sauce, which Spongebob didn't list at all, despite him describing a Krabby Patty \"with the works\"--", "start": 186.94, "duration": 6.88}, {"text": "literally everything on it.", "start": 193.82, "duration": 2.4}, {"text": "(TV Host): Can you make me one with everything?", "start": 196.22, "duration": 3.08}, {"text": "(MatPat): Oh, and uh, by the way.", "start": 199.3, "duration": 1.44}, {"text": "At no point is it said in the show that you need a pinch of Poseidon powder,", "start": 200.74, "duration": 4.34}, {"text": "like some recent rumors circulating the Internet have been saying--that was a mistake on the fan wiki", "start": 205.08, "duration": 4.46}, {"text": "and it has actually no grounding in the show itself.", "start": 209.54, "duration": 3.04}, {"text": "That's why you gotta be careful when trusting non-primary sources.", "start": 212.58, "duration": 2.92}, {"text": "Though, I will say \"Poseidon powder\" is slang for cocaine.", "start": 215.5, "duration": 3.98}, {"text": "And if cocaine were indeed the secret ingredient of these patties,", "start": 219.48, "duration": 3.0}, {"text": "it would result in the addictive power and taste of love that the Krabby Patty often possesses.", "start": 222.48, "duration": 4.94}, {"text": "So, maybe it wasn't that far off--but like I said, no actual evidence of it in the show.", "start": 227.42, "duration": 4.22}, {"text": "Because, if there was evidence of it in the show, you know I would be all over that like Squidward on a vault full of Krabby Patties.", "start": 231.64, "duration": 6.44}, {"text": "Telling you your favorite cartoon characters are addicted to cocaine is, like, my favorite pastime.", "start": 238.08, "duration": 4.48}, {"text": "So, what is really going on here?", "start": 242.56, "duration": 2.34}, {"text": "Well, for the answer maybe we can turn to the real recipe.", "start": 244.9, "duration": 3.1}, {"text": "Luckily, in \"Krabby Road\"--season 6, episode 1--Plankton dupes Spongebob into joining his band", "start": 248.0, "duration": 6.28}, {"text": "which gives him a chance to steal the Krabby Patty secret formula,", "start": 254.28, "duration": 3.1}, {"text": "and for the first and, to my knowledge, only time, we actually get a glimpse of it right before Plankton is caught.", "start": 257.38, "duration": 7.98}, {"text": "And what we see is...", "start": 265.36, "duration": 1.88}, {"text": "(record scratch)", "start": 267.24, "duration": 0.58}, {"text": "...gibberish?", "start": 267.82, "duration": 0.96}, {"text": "What's the deal?", "start": 268.78, "duration": 0.88}, {"text": "This is the official Krabby Patty secret formula kept in the restaurant,", "start": 269.66, "duration": 3.2}, {"text": "so why is just a bunch of gobbledygook?", "start": 272.86, "duration": 3.36}, {"text": "Well, two different possibilities exist:", "start": 276.22, "duration": 2.12}, {"text": "Possibility 1: It's the real formula, but it's written down using some kind of coded cypher.", "start": 278.34, "duration": 5.06}, {"text": "And if Plankton had the right decryption key, he could translate that garbled gibberish into the real thing.", "start": 283.4, "duration": 5.3}, {"text": "Possibility 2: This ingredients list isn't real. Mr Krabs is lying about the recipe.", "start": 288.7, "duration": 6.66}, {"text": "And if you try to break apart this formula, this starts to seem more and more likely.", "start": 295.36, "duration": 4.58}, {"text": "One of the most common ways to break a simple cypher is with frequency analysis,", "start": 299.94, "duration": 3.9}, {"text": "the idea being that if you have a long enough string of text, you can match certain letters in the cypher to certain letters based on their frequency.", "start": 303.84, "duration": 6.84}, {"text": "For example, a letter that appears a lot of times in the cypher is more likely to be a vowel like \"e\" or \"a\"", "start": 310.68, "duration": 6.24}, {"text": "or consonant like \"s\" or \"t\".", "start": 316.92, "duration": 1.92}, {"text": "But when we run Spongebob's Krabby Patty formula through a frequency analysis tool, we find these results:", "start": 318.84, "duration": 5.54}, {"text": "the most common letters are \"h\" and \"g\" followed by \"s\", \"f\" and \"d\".", "start": 324.38, "duration": 3.56}, {"text": "The frequency analysis tool doesn't suggest any possible solutions to the cypher.", "start": 327.94, "duration": 3.72}, {"text": "g-d-s-g-e-h-s-g is pretty hard to map onto anything when it has so many repeating letters,", "start": 331.66, "duration": 6.62}, {"text": "let alone a word that would actually show up in an ingedients list.", "start": 338.28, "duration": 3.06}, {"text": "Plugging that into a cryptogram solver, the only words that could possibly translate into these letters are", "start": 341.34, "duration": 6.0}, {"text": "\"kickback\", \"gangling\", \"tastiest\" and \"elsewise\".", "start": 347.34, "duration": 3.94}, {"text": "None of these are Krabby Patty ingredients; you can't have 4 cups of \"elsewise\".", "start": 351.28, "duration": 4.08}, {"text": "\"Tastiest\" looks promising, but if you try to use that cypher to solve the rest of the recipe you just get even more gibberish,", "start": 355.36, "duration": 6.0}, {"text": "and none of the other words work out.", "start": 361.36, "duration": 1.8}, {"text": "But the letters and their frequency could still provide another hint.", "start": 363.16, "duration": 3.38}, {"text": "You see, they're all letters from the middle part of the keyboard", "start": 366.54, "duration": 3.32}, {"text": "and the two most common letters are \"h\" and \"g\" specifically,", "start": 369.86, "duration": 3.34}, {"text": "which are in the absolute dead center of the keyboard.", "start": 373.2, "duration": 3.58}, {"text": "What would fit perfectly with this arrangement of letters as if someone like Mr. Krabs just wanted Spongebob", "start": 376.78, "duration": 5.74}, {"text": "to think that this was the secret recipe, so he just mashed on the keyboard to produce these non-words--", "start": 382.52, "duration": 5.58}, {"text": "and here's where Mr. Krabs' real secret formula starts to come out.", "start": 388.1, "duration": 3.82}, {"text": "It's all a ruse. There is no secret formula.", "start": 391.92, "duration": 3.46}, {"text": "It's why the ingredients list for the Krabby Patty seems so variable throughout the series", "start": 395.44, "duration": 4.12}, {"text": "both with and without the special sauce", "start": 399.66, "duration": 2.3}, {"text": "why the official patty recipe is a bunch of keyboard mashing.", "start": 401.96, "duration": 3.56}, {"text": "It's here that we learn a very important lesson about Spongebob as well as our own world:", "start": 405.52, "duration": 4.4}, {"text": "it's not about the food, it's about the business.", "start": 409.92, "duration": 3.3}, {"text": "Mr. Krabs is a lot of things, and one thing he is not is an expert chef.", "start": 413.22, "duration": 4.16}, {"text": "But what he is, is an expert businessman.", "start": 417.38, "duration": 3.04}, {"text": "The secret to the Krusty Krab success isn't his amazing recipe, but his amazing marketing ability.", "start": 420.42, "duration": 6.24}, {"text": "He creates the mystery around his Patty as a one-of-a-kind burger.", "start": 426.66, "duration": 4.0}, {"text": "But lets face it, this is a hamburger...", "start": 430.66, "duration": 2.0}, {"text": "Krabby burger...", "start": 432.66, "duration": 0.9}, {"text": "whatever, it's not unique.", "start": 433.56, "duration": 1.14}, {"text": "The secret formula is all just a big marketing ploy.", "start": 434.7, "duration": 3.48}, {"text": "Doesn't seem likely? Just look at examples in the real world.", "start": 438.18, "duration": 2.68}, {"text": "Technically, there is nothing about a McDonalds burger you can't replicate at home, or at another restaurant.", "start": 440.86, "duration": 6.1}, {"text": "Comparing the Big Mac to the Big King, these things are esentially the same.", "start": 446.96, "duration": 4.3}, {"text": "Most of the value from McDonalds lies in the brand that people trust.", "start": 451.26, "duration": 3.9}, {"text": "To produce 100,000 burgers per day at over 30,000 locations around the globe,", "start": 455.16, "duration": 4.26}, {"text": "all making it possible to go to almost any city in the world, see those Golden Arches and say:", "start": 459.42, "duration": 4.52}, {"text": "\"Yeah, I know what kind of experience I'm gonna have there.", "start": 463.94, "duration": 2.32}, {"text": "\"I don't know if I'll like anything else around here, so I might as well get the good old reliable Big Mac", "start": 466.26, "duration": 3.9}, {"text": "\"instead of taking a chance at that Mom and Pop hoagie stand.\"", "start": 470.16, "duration": 2.74}, {"text": "McDonalds' brand is reliability, the Krusty Krab's brand is uniqueness.", "start": 472.9, "duration": 6.0}, {"text": "It's the reason that McDonalds spends $2 billion a year on advertising.", "start": 478.9, "duration": 5.58}, {"text": "You could make the best food in the world, but if no one knows about it you're gonna go out of business pretty quickly.", "start": 484.48, "duration": 4.22}, {"text": "But if you're a savvy businessman like Mr. Krabs, or $137 billion company like McDonalds,", "start": 488.7, "duration": 5.18}, {"text": "creating awareness for your brand is a lot more important than serving up patties that are objectively the best tasting.", "start": 493.88, "duration": 6.54}, {"text": "The Krabby Patty is the ultimate guerrilla marketing tactic:", "start": 500.42, "duration": 3.42}, {"text": "you start a rumor about your own franchise that makes it sound vague and mysterious,", "start": 503.84, "duration": 4.12}, {"text": "(Spongebob): Love it! Kind of vague and mysterious.", "start": 508.26, "duration": 2.34}, {"text": "(MatPat): and then, rather than spend money on marketing you let word of mouth do the work for you", "start": 510.6, "duration": 4.14}, {"text": "and you get people talking about your product without having to spend a dime.", "start": 514.74, "duration": 3.48}, {"text": "(customers all talking in agreement)\n(Customer): Well, that sounds very interesting!", "start": 518.22, "duration": 2.22}, {"text": "(MatPat): Don't think Mr. Krabs' tactic worked?", "start": 520.44, "duration": 1.96}, {"text": "Spongebob debuted in the 1990's and people are still talking about the Krabby Patty secret formula,", "start": 522.4, "duration": 6.14}, {"text": "trying to uncover the elusive bit of knowledge in a fictional show,", "start": 528.54, "duration": 3.66}, {"text": "a piece of knowledge that doesn't really exist!", "start": 532.2, "duration": 3.34}, {"text": "For a real world example, consider the nameless juice brand.", "start": 535.54, "duration": 3.4}, {"text": "A brand of lemonade that refuses to actually put a brand name on itself and instead is just known for its mysterious flavor.", "start": 538.94, "duration": 5.92}, {"text": "The actual secret behind the fruity drink is that it contains some vegetable juice as well,", "start": 544.86, "duration": 4.32}, {"text": "which makes it about as unique as V8--so basically not at all.", "start": 549.18, "duration": 3.52}, {"text": "That said, the mystery around that brand has driven massive underground word of mouth.", "start": 552.7, "duration": 5.36}, {"text": "Heck, even McDonalds' own secret sauce is just mayonnaise, pickles, mustard and a few spices.", "start": 558.06, "duration": 5.24}, {"text": "But the fact that they call it \"secret\" makes it seem like it's more exclusive, and therefore more in demand, than it really is.", "start": 563.3, "duration": 7.04}, {"text": "So both in real life and in 2000's cartoons, it's not about having the Krabby Patty secret formula,", "start": 570.34, "duration": 5.14}, {"text": "it's just about having something you call a secret formula.", "start": 575.48, "duration": 4.1}, {"text": "And as a bonus in Spongebob, it distracts Mr. Krabs' main competitor by sending Plankton on a wild goose chase", "start": 579.58, "duration": 5.66}, {"text": "for a formula that he's never actually gonna be able to find.", "start": 585.24, "duration": 3.64}, {"text": "The only thing that throws a monkey wrench into Mr. Krabs' plans, though, are his employees.", "start": 588.88, "duration": 4.22}, {"text": "Hence, he hires someone like Squidward, who doesn't really care about the secret, and Spongebob.", "start": 593.1, "duration": 4.6}, {"text": "Spongebob is honest to a fault, a real stand-up sponge, and he doesn't take kindly to things like fraud and deception.", "start": 597.7, "duration": 6.02}, {"text": "So if Spongebob knew about the Krabby Patty's lack of a secret formula, he might let that slip", "start": 603.72, "duration": 4.66}, {"text": "or feel guilty about implicitly lying to everyone everytime he served up a burger.", "start": 608.38, "duration": 4.22}, {"text": "And so Mr. Krabs' solution? Slap his claws onto the keyboard for a minute and give Spongebob a fake formula.", "start": 612.6, "duration": 6.38}, {"text": "Make him think it's real, and don't worry if it ends up getting stolen.", "start": 618.98, "duration": 3.78}, {"text": "It sounds outlandish, or just a cop-out to say that there's no real formula and that there's nothing secret", "start": 622.76, "duration": 5.44}, {"text": "to the Krabby Patty that makes it magically delicious.", "start": 628.2, "duration": 2.3}, {"text": "I mean, we all remember how Squidward completely lost his mind the first time he sunk his teeth into a Krabby Patty in just one bite.", "start": 630.5, "duration": 6.34}, {"text": "(Squidward): I love Krabby Patties!", "start": 636.84, "duration": 2.82}, {"text": "(MatPat): Surely, there must be something at work here, and there is. It's just marketing, once again.", "start": 639.66, "duration": 5.64}, {"text": "According to Aaron Garvey,", "start": 645.3, "duration": 1.26}, {"text": "an assistant professor of marketing at the\nUK Gatton College of Business and Economics,", "start": 646.56, "duration": 3.9}, {"text": "the way that people feel about a product is heavily linked to psychology and their brand association with that product.", "start": 650.46, "duration": 6.44}, {"text": "In his research, he found, quote:", "start": 656.9, "duration": 1.86}, {"text": "\"You could take the exact same product that you were thinking about taking to market,", "start": 658.76, "duration": 3.6}, {"text": "\"and you could put it in front of consumers,", "start": 662.36, "duration": 1.94}, {"text": "\"and you could change what price you were going to launch it at,", "start": 664.3, "duration": 2.22}, {"text": "\"and you could change what brand it was.", "start": 666.52, "duration": 1.62}, {"text": "\"And they would have dramatically different impressions of that product.", "start": 668.14, "duration": 3.3}, {"text": "\"And they would tell you incredibly different things about the product.", "start": 671.44, "duration": 3.28}, {"text": "\"That they thought it was made of different materials, that they thought it weighed more, or it weighed less.\" [END QUOTE]", "start": 674.72, "duration": 4.96}, {"text": "So if Mr. Krabs says that the Krabby Patty's secret formula is what makes it so delicious,", "start": 679.68, "duration": 4.14}, {"text": "he's actually not lying.", "start": 683.82, "duration": 1.84}, {"text": "If he has created a brand association, created what is essentially a legendary burger,", "start": 685.66, "duration": 5.38}, {"text": "people will experience it differently.", "start": 691.04, "duration": 2.68}, {"text": "If what people believe about a product's weight or materials is dependent on the brand they believe it is,", "start": 693.72, "duration": 4.24}, {"text": "that effect is going to be just as strong, if not stronger, when it comes to totally subjective qualities, like how good a burger tastes.", "start": 697.96, "duration": 7.62}, {"text": "The Krabby Patty secret formula might have started as a lie,", "start": 705.58, "duration": 3.44}, {"text": "but now the real secret ingredient is an ingredient that everyone thinks is there,", "start": 709.02, "duration": 4.46}, {"text": "but one that doesn't truly exist.", "start": 713.48, "duration": 2.76}, {"text": "But, hey...!", "start": 716.42, "duration": 1.04}, {"text": "Have you ever wanted to be a grillmaster like Spongebob,", "start": 717.46, "duration": 2.8}, {"text": "or a rich, successful businessman like Mr. Krabs?", "start": 720.26, "duration": 3.26}, {"text": "Well, whatever your career goals, I bet you're ready for Skillshare, our sponsor for today.", "start": 723.52, "duration": 5.06}, {"text": "(Spongebob): I'm ready! I'm ready!", "start": 728.58, "duration": 1.62}, {"text": "(MatPat): Skillshare is where actual, real life experts can teach you everything you need to know to fry up the best burgers in all of Bikini Bottom,", "start": 730.2, "duration": 6.74}, {"text": "or just make a fortune by managing a business that isn't a Chum Bucket.", "start": 736.94, "duration": 4.22}, {"text": "I've talked plenty about Skillshare in the past about how they're a learning community", "start": 741.16, "duration": 4.42}, {"text": "where you can learn everything from production skills to YouTube strategies", "start": 745.58, "duration": 3.68}, {"text": "from some of the top people in their fields.", "start": 749.26, "duration": 2.58}, {"text": "But, one thing that I haven't mentioned yet is that they also have culinary classes.", "start": 751.84, "duration": 4.72}, {"text": "Personally, I suck in the kitchen--like really, really bad.", "start": 756.56, "duration": 4.7}, {"text": "But I am getting better, and I'm learning from Skillshare.", "start": 761.26, "duration": 3.36}, {"text": "One thing that I have always been nervous about has been cutting and chopping.", "start": 764.62, "duration": 2.94}, {"text": "But thanks to the 12 minute video, \"Knife Skills: A Mini Class to Chop Like a Chef\",", "start": 767.56, "duration": 4.22}, {"text": "I am...well...I-I'm not a pro, but I'm slightly less of a hole.", "start": 771.78, "duration": 4.62}, {"text": "And mind you, that has nothing to do with the class; the class is great, it's more to do with me.", "start": 776.4, "duration": 3.68}, {"text": "I also love ice cream and there's a class dedicated to \"How to Make Gelato...\".", "start": 780.08, "duration": 3.86}, {"text": "Even more general classes like, \n\"DIY Food Photography: Capturing Food in Your Kitchen\"\ncan bring out your inner hipster!", "start": 783.94, "duration": 7.18}, {"text": "And then once you've learned how to take pictures of your food instead of, you know, eating said food,", "start": 791.12, "duration": 4.66}, {"text": "you could then monetize your photography chops with a class specifically on becoming an Instagram influencer.", "start": 795.78, "duration": 5.54}, {"text": "Yes! There are classes for you to take pictures of your food and then other classes for you to learn how to monetize the pictures of said food.", "start": 801.32, "duration": 6.66}, {"text": "So why wait?", "start": 807.98, "duration": 0.78}, {"text": "Start raking in more than just sand dollars, click on the link in the description below,", "start": 808.76, "duration": 3.82}, {"text": "which I am also showing here on screen in case you're that person who wants the unique pleasure of typing in a long string of text into your URL bar.", "start": 812.58, "duration": 6.3}, {"text": "Watch out ladies, this person knows how to spend a Friday night!", "start": 818.88, "duration": 3.18}, {"text": "And check out their premium membership, which gives you unlimited access to all of their 25,000+ courses.", "start": 822.06, "duration": 7.62}, {"text": "It's an investment in yourself for less than $10 a month.", "start": 829.68, "duration": 3.66}, {"text": "And the first 1000 of you watching to use the link in the description will get 2 months absolutely free.", "start": 833.34, "duration": 6.26}, {"text": "So, go! Do it! Start the year off right by doing yourself a favor.", "start": 839.6, "duration": 4.26}, {"text": "Link is in the description, and while you're busy Krabby Patty-ing it up, I'll still be here working on those knife skills.", "start": 843.86, "duration": 5.38}, {"text": "Oh-oh, good Lord. Those blades are so big...yaaah!", "start": 849.24, "duration": 3.86}]