[{"text": "This video is sponsored by Vikings: War of Clans!", "start": 0.28, "duration": 3.18}, {"text": "If you ever looked at history and wished you could experience a world of swords, conquest and empires;", "start": 3.8, "duration": 4.54}, {"text": "then you should check out Vikings: War of Clans; a free to play strategy game, where you build your clan into a nation.", "start": 8.34, "duration": 6.12}, {"text": "How you raise your empire is entirely up to you.", "start": 14.6, "duration": 2.42}, {"text": "Crush your enemies with vast armies,", "start": 17.02, "duration": 1.84}, {"text": ", craft a nation of trade with friends while applying diplomacy or build impregnable cities that will endure the ages.", "start": 18.86, "duration": 6.12}, {"text": "Download the game from the link in the description below and not only will you be helping us create content for you", "start": 25.18, "duration": 5.12}, {"text": "but you will begin your journey with 200 gold and a protection shield as you set out to rule the clans!", "start": 30.3, "duration": 6.36}, {"text": "It's the middle of the ninth century.", "start": 41.22, "duration": 1.9}, {"text": "The deeds of the renowned Charles the Great have faded over the last thirty years,", "start": 43.12, "duration": 4.84}, {"text": "as the empire he created was constantly weakened by both internal and external threats.", "start": 47.96, "duration": 6.08}, {"text": "Charlemagne's only living son and heir Louis the Pious struggled to maintain power and control over the unruly regional lords,", "start": 54.04, "duration": 9.22}, {"text": "but even considering his talents, Louis was simply a monarch of a smaller calibre compared to his famous father.", "start": 63.26, "duration": 7.22}, {"text": "His reign was marked by a series of exhausting civil wars and border quarrels,", "start": 70.98, "duration": 4.66}, {"text": "and while Louis did much to retain his power and secure the future of the Carolingian Empire,", "start": 75.88, "duration": 5.54}, {"text": "the results of his efforts were meagre.", "start": 81.5, "duration": 2.68}, {"text": "Louis the Pious eventually died in 840 at the age of 62 and his three living sons, being unable to follow their father’s wishes,", "start": 84.34, "duration": 8.54}, {"text": "raised their banners to fight over Louis' inheritance.", "start": 92.88, "duration": 3.2}, {"text": "Yet again the Frankish Empire plunged into civil war, which lasted for the next three years and eradicated any remaining trace of unity between the belligerents.", "start": 96.22, "duration": 10.4}, {"text": "In 843 the war came to an end and the Treaty of Verdun was signed,", "start": 106.88, "duration": 5.6}, {"text": "which essentially divided Charlemagne's empire into three distinct parts ruled by the three sons of the late emperor Louis the Pious.", "start": 112.7, "duration": 8.38}, {"text": "In such circumstances, Louis' youngest son, Charles the Bald became the very first King of West Francia, the westernmost part of the divided empire.", "start": 121.28, "duration": 10.72}, {"text": "His initial position was hardly enviable.", "start": 132.34, "duration": 3.0}, {"text": "Although the dynastic dispute between the brothers seemed to be settled at least for a time,", "start": 135.52, "duration": 5.5}, {"text": "Charles wasn't too popular within his own domain and just a few vassals pledged loyalty to him.", "start": 141.28, "duration": 6.54}, {"text": "His rule over regions such as Brittany and Aquitaine was in fact only nominal with those areas on the verge of open rebellion.", "start": 148.08, "duration": 8.88}, {"text": "But Charles' most impending problem was an external one.", "start": 157.34, "duration": 3.8}, {"text": "His early rule coincided with the expansion of Scandinavian raiders – the Vikings,", "start": 161.32, "duration": 5.96}, {"text": "who since the end of the eighth century began ravaging the coasts of the British Isles and Western Europe,", "start": 167.28, "duration": 5.5}, {"text": "in search for wealth and glory.", "start": 172.78, "duration": 2.74}, {"text": "The Norsemen were well oriented in the local politics of the Frankish states and exploited their lack of unity,", "start": 175.66, "duration": 6.64}, {"text": "even sailing up major rivers and pillaging riverside settlements.", "start": 182.3, "duration": 4.5}, {"text": "Frankish rulers, who were so busy fighting amongst themselves, did little to strengthen their countries defences against seaborne raids.", "start": 186.8, "duration": 9.36}, {"text": "The rough-and-ready solution to decrease the countries vulnerability to Viking attacks", "start": 196.44, "duration": 4.72}, {"text": "was to allow them to settle along the northern Frankish coasts and rivers", "start": 201.16, "duration": 4.54}, {"text": "in the hope that they would protect the mainland against other Norsemen.", "start": 205.7, "duration": 4.24}, {"text": "It wasn't an extensively popular tactic among the Vikings in first half of 9th century,", "start": 209.94, "duration": 5.74}, {"text": "but still, some temporary settlements were established.", "start": 215.68, "duration": 4.58}, {"text": "In 841 one of the Norse chieftains, named Ragnar was awarded land in northern Francia and nominally became a vassal of Charles the Bald.", "start": 220.52, "duration": 9.64}, {"text": "It is still subject to debate, but there's a slight possibility, that the man King Charles gave land to,", "start": 230.44, "duration": 6.48}, {"text": "was the near-legendary Ragnar Lothbrok, a famous Viking hero and ruler.", "start": 236.92, "duration": 6.0}, {"text": "But since there's barely any evidence to support this theory, we'll refer to this character, as just Ragnar.", "start": 243.0, "duration": 7.36}, {"text": "Anyway, a few years later, Ragnar lost his bridgehead in northern Francia along with the favour of King Charles.", "start": 250.6, "duration": 8.16}, {"text": "This led the Norse chieftain to seek revenge and punish the Frankish king for his supposed lack of support and cooperation.", "start": 258.9, "duration": 7.64}, {"text": "In early spring of the year 845, Ragnar led more than one hundred longships up the river Seine", "start": 267.0, "duration": 6.76}, {"text": "and swiftly attacked and burnt the city of Rouen.", "start": 273.76, "duration": 3.26}, {"text": "Upon hearing this, Charles hastily gathered an army, a couple thousand strong", "start": 277.58, "duration": 5.12}, {"text": "and sent it west to defend rich settlements and monasteries lying along the river Seine", "start": 282.7, "duration": 5.68}, {"text": "and the strategically important city of Paris.", "start": 288.38, "duration": 3.62}, {"text": "Norse and Frankish forces clashed in the middle of March some kilometres north of the city.", "start": 292.0, "duration": 6.0}, {"text": "As the Franks were divided into two contingents, occupying both banks of the river,", "start": 298.08, "duration": 5.02}, {"text": "Ragnar took the advantage and stormed the weaker detachment.", "start": 303.1, "duration": 4.16}, {"text": "Battle ensued, but the Danes were far more numerous and quickly overwhelmed their enemy.", "start": 307.64, "duration": 5.32}, {"text": "The Frankish unit was eradicated, and those who remained on the battlefield, were taken into captivity.", "start": 313.08, "duration": 5.96}, {"text": "Watching the course of the encounter from the other side of the river,", "start": 319.48, "duration": 3.36}, {"text": "the morale of the second Frankish detachment plummeted", "start": 322.84, "duration": 3.66}, {"text": "and Charles' men abandoned their plan to stop the invaders, and scattered in chaos.", "start": 326.5, "duration": 5.62}, {"text": "The King’s makeshift effort to stop the Danish raiders proved to be futile.", "start": 332.46, "duration": 5.06}, {"text": "Thanks to this initial victory, Ragnar's men had the road to the riches of Paris wide open.", "start": 337.9, "duration": 6.74}, {"text": "The Danes reached the outskirt of the city on the 28th of March and began preparing for the siege.", "start": 344.8, "duration": 6.52}, {"text": "Hoping to terrorize the defenders morale,", "start": 351.74, "duration": 2.22}, {"text": "Ragnar moved the prisoners he had taken in victorious skirmish a few days earlier to the island on the Seine River", "start": 354.14, "duration": 6.8}, {"text": "and had them hanged, much to citizens’ dread.", "start": 361.02, "duration": 3.86}, {"text": "The city was largely undefended and not truly prepared for either an assault or prolonged siege.", "start": 365.44, "duration": 6.88}, {"text": "Ragnar was most likely aware of this and early the next day, on Easter Sunday, he attempted to storm the walls.", "start": 372.56, "duration": 7.66}, {"text": "The undermanned garrison and poorly maintained fortifications couldn’t pose a meaningful threat to 5,000 voracious Norse invaders,", "start": 380.42, "duration": 9.06}, {"text": "leading to a quick and brutal assault.", "start": 389.48, "duration": 3.08}, {"text": "Ragnar’s men eventually breached into the city and soon an exhaustive plunder of Paris’ churches and monasteries began.", "start": 392.56, "duration": 8.88}, {"text": "King Charles was in trouble, as his relief force was swiftly defeated", "start": 401.72, "duration": 4.4}, {"text": "and he lost one of the most important cities in his kingdom to the Danish invaders.", "start": 406.12, "duration": 4.88}, {"text": "He could have tried to assemble an army big enough to fend off Ragnar’s party,", "start": 411.36, "duration": 4.42}, {"text": "but this solution required the support of the nobles of West Francia,", "start": 415.94, "duration": 4.22}, {"text": "among which, Charles wasn’t too popular and their loyalty was questionable at best.", "start": 420.44, "duration": 5.92}, {"text": "Instead, Charles decided to use the royal treasury to pay Ragnar a ransom and thus save Paris from being destroyed.", "start": 426.84, "duration": 8.34}, {"text": "It wasn’t an ideal solution, but Charles had hardly any other choice.", "start": 435.66, "duration": 4.86}, {"text": "He bought himself some time to unravel the most pressing issues of the new kingdom", "start": 440.82, "duration": 5.24}, {"text": "and perhaps prepare his realm better for the possibility of future Norse raids in the years to come.", "start": 446.3, "duration": 6.84}, {"text": "More than 5,000 pounds of gold and silver was transported to Norse-occupied Paris to placate the invaders.", "start": 453.48, "duration": 7.92}, {"text": "A possible factor that could have influenced Ragnar’s decision was that upon taking the city,", "start": 461.7, "duration": 5.3}, {"text": "the Vikings were stricken with plague, whittling his fighting force.", "start": 467.1, "duration": 4.04}, {"text": "Anyway, Charles’ offer was generous enough for the Danes to agree to depart with the city reasonably intact.", "start": 471.64, "duration": 8.16}, {"text": "Although Ragnar’s forces pillaged the Frankish countryside on their way back to the shore,", "start": 480.16, "duration": 5.16}, {"text": "for a time Charles the Bald was rid of the Norse raiders.", "start": 485.32, "duration": 4.32}, {"text": "The Sack of Paris was probably one of the most resounding events of the early Viking Age.", "start": 489.64, "duration": 5.6}, {"text": "Taking such an important city made the Frankish rulers realise", "start": 495.48, "duration": 4.3}, {"text": "how vulnerable their realms were against this new Scandinavian threat,", "start": 500.0, "duration": 5.16}, {"text": "which from the middle of the ninth century became a major concern for every Frankish ruler for the next two hundred years.", "start": 505.16, "duration": 9.26}]