[{"text": "What's going on guys new lightsaber giveaway in today's video all you have to do is hit like if you enjoyed the video and comment", "start": 0.03, "duration": 5.879}, {"text": "Below which lightsaber you want contest ends February 6th alright. Let's get on with the video", "start": 5.91, "duration": 5.76}, {"text": "Alrighty, so here's a video", "start": 16.99, "duration": 1.4}, {"text": "I've been wanting to make for a pretty long time at least since The Last Jedi came out", "start": 18.39, "duration": 3.899}, {"text": "And I've been working on the script going back and forth here and there and to be honest", "start": 22.289, "duration": 3.51}, {"text": "Just been really nervous to actually release this so I hope you guys enjoy it before we begin", "start": 25.8, "duration": 4.71}, {"text": "I just want to say first and foremost that I'm not making this video to say that I'm better than Rian Johnson or the team", "start": 30.51, "duration": 5.49}, {"text": "at Lucasfilm and Disney", "start": 36.0, "duration": 1.17}, {"text": "I'm just the youtuber and a giant Star Wars fan with a bit of a different vision than Ryan", "start": 37.17, "duration": 4.709}, {"text": "So that's all it is that said let's start this video with a question. How do I even go about making this?", "start": 41.879, "duration": 5.73}, {"text": "I would have to rewrite the whole movie and wow that would be cool", "start": 47.609, "duration": 3.191}, {"text": "It would be a three-hour video of still images panning in and out of the screen so what I'm gonna do", "start": 50.98, "duration": 5.09}, {"text": "Is make this", "start": 56.07, "duration": 1.27}, {"text": "Extremely condensed and even so I will make several parts to this as I don't want to miss details of scenes or have it be", "start": 57.34, "duration": 6.259}, {"text": "Rushed so here's the first part and of course as I've mentioned in other videos if you want me to make a more", "start": 63.6, "duration": 5.639}, {"text": "realistic version of the last Jedi with changing some of the subtleties and little things from the actual movie", "start": 69.4, "duration": 5.629}, {"text": "I will do that as well however this one is going to be the absolutely insane and", "start": 75.03, "duration": 5.25}, {"text": "Totally different fan fiction that you guys wanted as for now", "start": 80.68, "duration": 3.259}, {"text": "Let's finally get to part one so without further ado. I give you my version of Star Wars Episode eight?", "start": 84.28, "duration": 7.37}, {"text": "As the movie pans down through space as it always does we don't start with PO like we did in the film rather we see", "start": 182.849, "duration": 6.139}, {"text": "Mustafar come into view when all of a sudden kylo ren's thai destroyer inspired by his grandfather", "start": 189.06, "duration": 5.179}, {"text": "Blasts past the camera shaking the screen and speeding towards the volcano planets as we get a closed cockpit view of kylo without his mask", "start": 194.4, "duration": 7.1}, {"text": "Sweating and nervous he enters the atmosphere", "start": 201.9, "duration": 2.3}, {"text": "Blending on none other than Darth Vader's castle as the ships door opens and kylo comes before the massive door Darth Vader's fortress", "start": 204.599, "duration": 7.639}, {"text": "He boughs as we get an aerial shot of just how massive it is compared to him reaching out and using the force to open", "start": 212.28, "duration": 6.739}, {"text": "The door he is denied as only Vader's presents could open the gates", "start": 219.019, "duration": 3.57}, {"text": "themselves looking to a bowl that rests on a small pillar at kylos eyes", "start": 222.9, "duration": 3.83}, {"text": "He realizes this was intended for Vader's massive robotic height the writing he recognized it", "start": 226.799, "duration": 5.54}, {"text": "He knew what he had to do grabbing a knife from his belt", "start": 232.34, "duration": 2.729}, {"text": "He slit his palm and allowed the sacred Skywalker blood to drip down into the basin", "start": 235.069, "duration": 5.31}, {"text": "Recognizing that he was the heir to the throne as the doors began to open he realized that this must have been some sort of", "start": 240.84, "duration": 5.779}, {"text": "Failsafe if they didn't open the doors himself someday as he enters inside the lights begin to dim on cold dark and mysterious", "start": 246.62, "duration": 7.889}, {"text": "He looks to the left the far left Arabic writing inscribed on the wall red", "start": 255.06, "duration": 4.97}, {"text": "temple seeing stairs that let down a spiral stone staircase he walks to it determined his footsteps echoing in the", "start": 260.34, "duration": 7.85}, {"text": "massive Grand Hall of his grandfather's castle", "start": 268.47, "duration": 3.169}, {"text": "Were brought to the planet of Ock two and we see the beautiful ocean as ray moves to hand an aged Luke Skywalker", "start": 273.06, "duration": 6.14}, {"text": "The lightsaber of his father as Luke looks at it stunned and bewildered", "start": 279.3, "duration": 4.04}, {"text": "He takes the weapon his mechanical hands shaking observing it", "start": 283.62, "duration": 3.679}, {"text": "He looks down at it as tears swell within his eyes", "start": 287.3, "duration": 3.119}, {"text": "Mumbling something to herself that Rey can't make out Luke says through fought back tears", "start": 290.76, "duration": 4.489}, {"text": "Father as he looks up at Rey assume tears streaming down his weathered hairy face", "start": 295.71, "duration": 4.879}, {"text": "He asks her who are you as ray tells him?", "start": 300.779, "duration": 3.38}, {"text": "She's been sent here by his sister Leia to help fight the first order and lead the resistance as a beacon of hope he looks", "start": 304.159, "duration": 6.51}, {"text": "Down and shakes his head slowly staring at the historic weapon", "start": 310.669, "duration": 3.509}, {"text": "I I can't as she looks confused watching him walk past her pocketing his old lightsaber", "start": 314.179, "duration": 5.459}, {"text": "She follows him to his Hut. Why won't you help us the galaxy needs you she says I need more time", "start": 319.709, "duration": 6.17}, {"text": "I'm not ready as luke turns to speak he sees the Millennium Falcon far down below", "start": 325.879, "duration": 4.5}, {"text": "Turning to Rey he begins to trust her immediately. Did you come alone? He asked?", "start": 330.589, "duration": 4.11}, {"text": "Where's Han where's Chewie as she moves to point Luke runs past her and hugs Chewbacca?", "start": 334.699, "duration": 4.769}, {"text": "Both of them emotional and have not seen one another for decades as Luke looks up with a warm smile at his old friend", "start": 339.629, "duration": 6.38}, {"text": "He makes a joke about Han being out of shape and taking forever to climb the steps as Rey and Chewie fall silent Luke", "start": 346.009, "duration": 6.089}, {"text": "Steps backwards a look of concern dawning over his face", "start": 352.289, "duration": 3.47}, {"text": "Where's Han as Rey begins to tell him he silences her and looks to Chewie Chewie?", "start": 356.069, "duration": 5.209}, {"text": "Where's Han?", "start": 362.009, "duration": 2.0}, {"text": "Chewie speaks Wookiee Luke falls to the ground crying tears harder than he can remember as Chewie pulls him up and cries with him", "start": 364.079, "duration": 7.13}, {"text": "explaining that Ben solo has turned to the dark side fully and is the cause of Hans death as a", "start": 371.519, "duration": 5.33}, {"text": "Means of providing his loyalty to Snoke Luke begins to cry this time not with sadness", "start": 376.919, "duration": 5.599}, {"text": "But with rage every single hut around them begins to shake as stones fall and the clouds begin to circle the clear skies", "start": 382.86, "duration": 6.379}, {"text": "Lightning crackling from above as the ground stand-on begins to separate and chewy", "start": 389.549, "duration": 4.6}, {"text": "Let's have a massive bowl to bring Luke back to his senses before he unleashes powers", "start": 394.15, "duration": 4.89}, {"text": "He kept dormant for decades", "start": 399.04, "duration": 1.93}, {"text": "Index as he stops his sobbing", "start": 400.97, "duration": 2.359}, {"text": "He turns to Rey the anger in his eyes beginning to swell when all goes silent, and he says", "start": 403.33, "duration": 5.85}, {"text": "Where's Ben?", "start": 410.24, "duration": 2.0}, {"text": "As general Leia leads the resistance to fight the first order in space", "start": 414.95, "duration": 3.44}, {"text": "Poe dameron is brought into view with his x-wing in front of an entire battalion of rebels new and old", "start": 418.46, "duration": 6.049}, {"text": "Going through a several minute high action space battle against Huck's and his fleet of", "start": 424.7, "duration": 3.77}, {"text": "Destroyers we see a scene similar to that in the last Jedi when Snoke finally appeared before Huck's as a hologram", "start": 428.54, "duration": 6.049}, {"text": "furious slamming Huck's his face to the floor where we see several of his teeth missing or at least a crooked broken nose as the", "start": 435.35, "duration": 7.25}, {"text": "Rebels begin to win against the first order with Admiral Ackbar leading one of the battalions", "start": 442.6, "duration": 4.799}, {"text": "Returning back to Mustafar we see kylo invaders dungeons where his Sith temple was located beneath the castle itself", "start": 448.37, "duration": 6.5}, {"text": "surrounded by rivers of lava and cliffs leading to the planets very core", "start": 455.12, "duration": 3.98}, {"text": "He is surrounded by the ancient belongings of his grandfather walking past duplicates of his suit parts like an armory", "start": 459.11, "duration": 6.38}, {"text": "He observes the ancient Sith holocrons scattered about", "start": 465.5, "duration": 3.079}, {"text": "Hoping to find what he was looking for in search of something he has wanted for a long", "start": 468.92, "duration": 3.92}, {"text": "Hoping that it even exists here to this day", "start": 473.79, "duration": 2.6}, {"text": "He begins to become impatient the dark side swelling further within him as he hears a whisper", "start": 476.55, "duration": 5.69}, {"text": "When he quickly turns to his left", "start": 482.4, "duration": 1.77}, {"text": "No", "start": 484.17, "duration": 0.6}, {"text": "It must have just been an echo he thought to himself", "start": 484.77, "duration": 2.299}, {"text": "When he hears the whisper of his name again in the cave below as he walks to the opening seeing nothing but darkness", "start": 487.41, "duration": 6.62}, {"text": "He ignites his flickering red light paper and puts it in front of him as he here as a woman who called to him", "start": 494.13, "duration": 5.36}, {"text": "this voice it was a voice he had never heard before but as if he knew who it was it was soft and", "start": 499.86, "duration": 6.17}, {"text": "Beautiful the voice of his own mother didn't sound so angelic", "start": 506.19, "duration": 2.99}, {"text": "Moving through the darkness of the cave itself unsure of anything just like his future", "start": 509.37, "duration": 4.459}, {"text": "He used the crimson glow of his weapon as a guide as he came to a wall", "start": 513.9, "duration": 4.01}, {"text": "He began to become very impatient a cave leading to nowhere", "start": 517.92, "duration": 3.5}, {"text": "He thought the voice it vanished", "start": 521.46, "duration": 2.39}, {"text": "But yet something still pulled him to this spot to stay here feel the voice there was again", "start": 523.85, "duration": 6.449}, {"text": "But this time it was a man. He did not recognize this voice either. It was powerful heroic", "start": 530.3, "duration": 5.88}, {"text": "He wanted to hear it again. Who are you speak to me? I?", "start": 536.22, "duration": 3.559}, {"text": "Order you to speak feel", "start": 540.6, "duration": 2.059}, {"text": "What did that mean Kyle of thought as he sheathed his weapon the blackness of the cave swallowing him like a nightmare?", "start": 542.82, "duration": 5.809}, {"text": "Kylo was not afraid", "start": 549.15, "duration": 1.08}, {"text": "He reached out with his arm fingers turning the force to its very tuned like a dial the grandson of", "start": 550.23, "duration": 5.96}, {"text": "Skywalker was surely gifted with the force itself as a small platform", "start": 556.26, "duration": 3.679}, {"text": "Shaped box began to slide out from the caves wall illuminating the cave with a dim light that attracted kylo to see what was inside", "start": 560.01, "duration": 7.25}, {"text": "Feeling the rage build within him this nonsense of the time being wasted", "start": 567.57, "duration": 4.489}, {"text": "He saw it was nothing more than just a necklace a miss shapen wooden square small enough to be a pendant in one's hand", "start": 572.06, "duration": 7.08}, {"text": "Useless he thought he reached his hand within when he felt the world beneath him moving under his feet in an open field the Sun", "start": 579.48, "duration": 7.1}, {"text": "Blaring on his face looking around he heard Birds water", "start": 586.8, "duration": 4.22}, {"text": "Where was he?", "start": 591.02, "duration": 1.29}, {"text": "What was this place laughter emanated to his right far away, but clear to his years that was when he saw them", "start": 592.31, "duration": 6.869}, {"text": "And a woman they were young one wore the tunic of a Padawan with a braid much like he had when he was younger", "start": 599.699, "duration": 6.179}, {"text": "Training under Luke Skywalker running towards them the world began to shift again when he found himself this time in the dark", "start": 606.009, "duration": 6.14}, {"text": "At a massive glowing orb dancing about in a stadium filled with aliens from across the galaxy", "start": 613.329, "duration": 5.69}, {"text": "Everything lost its brightness as two people from the back began to illuminate into view they were almost close enough to hear an old", "start": 619.629, "duration": 7.309}, {"text": "Short man with a long protruding nose sat next to some robed boy", "start": 627.16, "duration": 4.13}, {"text": "He couldn't have been much younger than kylo himself seeing only the sides of their faces as kylo yelled them to respond they didn't hear", "start": 631.359, "duration": 7.61}, {"text": "He leaned forwards over one of the pods and hopes to get them to respond when he fell below the stadium", "start": 638.97, "duration": 5.459}, {"text": "Whirling on a view as he landed in a red office the color of a lightsaber that he had never seen before", "start": 644.799, "duration": 5.21}, {"text": "Swung at his head as he ducked and purple blurred using his quick Skywalker reflexes", "start": 650.109, "duration": 4.46}, {"text": "He ignited his lightsaber", "start": 654.569, "duration": 1.05}, {"text": "But it was too late the Purple Haze had gone back through to his head and sliced her to meet the red of another", "start": 655.619, "duration": 6.36}, {"text": "Kylo was unharmed turning around to see the face of the same old man from the Opera", "start": 662.139, "duration": 4.429}, {"text": "Swinging at them both the red of his lightsaber blinds his vision to reveal that he is in a Jedi Temple", "start": 666.789, "duration": 5.09}, {"text": "But not like Master Luke's this one was much larger. It was empty however hearing blaster fire", "start": 671.879, "duration": 6.63}, {"text": "He raised his already", "start": 678.539, "duration": 1.03}, {"text": "Ignited lightsaber as he sought jedi masters all around him as they surrounded the same young man as before in the opera the man bared", "start": 679.569, "duration": 7.13}, {"text": "A scar much like hands on his face above his right", "start": 686.699, "duration": 2.64}, {"text": "He used the force like holy kylo could dream of", "start": 689.64, "duration": 3.269}, {"text": "swinging his blue lightsaber with such speed and precision", "start": 693.399, "duration": 2.66}, {"text": "Dropping all the Jedi around him to the floor", "start": 696.37, "duration": 2.209}, {"text": "seeing children run away in fear as the men walked further into the abyss as the ground opens up to bring kylo back to the", "start": 698.68, "duration": 6.26}, {"text": "Planet he was on but something was different. Where was Vader's castle. Where was his ship as he looked to the right", "start": 704.94, "duration": 6.419}, {"text": "He saw a bearded man jumped to a hill waving his arms to someone there", "start": 711.36, "duration": 4.229}, {"text": "He was again the same young man with a long feathered hair from the Opera and the office and the temple he looked different", "start": 715.589, "duration": 6.9}, {"text": "His eyes defiant and full of hatred", "start": 722.82, "duration": 2.459}, {"text": "Kylo began to realize", "start": 725.7, "duration": 1.29}, {"text": "What was happening?", "start": 726.99, "duration": 0.58}, {"text": "as obi-wan walked past him tears in his eyes kind of went to see what waited for him at the bottom of the hill the", "start": 727.57, "duration": 6.259}, {"text": "Sight threw him to his knees as it began to gasp", "start": 733.829, "duration": 2.73}, {"text": "Unable to breathe at all he was strapped to a bed in agonizing pain", "start": 737.92, "duration": 4.07}, {"text": "He didn't even know could exist screaming for help for someone to get him out of this dream", "start": 741.99, "duration": 5.099}, {"text": "Unable to fathom how he was still alive he saw that decrepit old man again cloaked", "start": 747.399, "duration": 5.66}, {"text": "Hovering over him like a devil like a phantom", "start": 753.459, "duration": 3.2}, {"text": "And he began to laugh and raised his hands fur keeper falling as kylo landed out of breath back on the stone floor", "start": 756.66, "duration": 6.179}, {"text": "Kylo threw the necklace away his face whiter than a ghost he scurried from the cave like a lost dog", "start": 764.14, "duration": 5.659}, {"text": "And as he was about to enter the lava, surrounded temple. He was frozen in place and levitated to the air again", "start": 769.8, "duration": 6.45}, {"text": "Unable to breathe this time without his control as the shock pans to the back of Snoke scarred head and the collar of his", "start": 776.829, "duration": 7.91}, {"text": "elegant", "start": 784.87, "duration": 1.14}, {"text": "Expensive and ancient golden robes bringing kylo towards him with the force his massive hand hovering above kylo", "start": 786.01, "duration": 7.339}, {"text": "Waving for him to come closer the giant gold encrusted", "start": 793.75, "duration": 3.349}, {"text": "Obsidian black ring on his finger as the camera slowly lowers to his other hand by his side", "start": 797.589, "duration": 5.9}, {"text": "We see him twirling something between his fingers a familiar black and chrome", "start": 803.56, "duration": 5.389}, {"text": "Object as we see snoke's perched an ugly lips voice", "start": 809.199, "duration": 3.71}, {"text": "Come come boy. I have", "start": 813.55, "duration": 2.719}, {"text": "seek", "start": 817.46, "duration": 2.0}, {"text": "Well that was part one guys there are obviously tons of different scenarios as to where this can all lead for part two", "start": 824.899, "duration": 5.359}, {"text": "But I'd like for you guys to let me know where you want the last Jedi to go", "start": 830.259, "duration": 3.78}, {"text": "I figure this part would only take maybe one fifth of the whole movie so maybe just thirty minutes at most", "start": 834.04, "duration": 4.949}, {"text": "Now also there are tons of other ways that this film could have started", "start": 839.379, "duration": 3.27}, {"text": "But this is just one of the versions that I had in my head, so I thought might as well start with this one", "start": 842.66, "duration": 4.07}, {"text": "I'd love to know what you guys think or would want to happen from here. Let me know down below", "start": 846.73, "duration": 3.69}, {"text": "What you thought of it and by all means you don't have to like this version job there was nothing wrong with the last Jedi", "start": 850.42, "duration": 4.44}, {"text": "However, this was just another version", "start": 854.86, "duration": 2.339}, {"text": "This is just a plain", "start": 857.199, "duration": 0.911}, {"text": "Fanfiction as to another way that it could go if you guys do want Part two and I'll get straight to work on that so", "start": 858.11, "duration": 5.509}, {"text": "Let me know as well. Thanks for watching today's fanfiction. I hope you all enjoyed it", "start": 863.619, "duration": 3.39}, {"text": "I will see you all in the next episode until then my fellow Jedi and Sith friends", "start": 867.009, "duration": 5.34}, {"text": "Remember the force will be with you always", "start": 872.869, "duration": 3.8}]