[{"text": "It’s late May of the year 1941.", "start": 0.0, "duration": 3.02}, {"text": "A two ship German battle-group attempts to break off into the Atlantic on its mission to raid Allied merchant convoys.", "start": 3.22, "duration": 6.5}, {"text": "But due to an unplanned string of events, German commander, Admiral Lütjens,", "start": 10.12, "duration": 4.4}, {"text": "is compelled into facing the Royal Navy’s Home Fleet, attempting to prevent the Bismarck from entering the open Atlantic.", "start": 14.52, "duration": 6.6}, {"text": "A fierce artillery trade-off ensued resulting in the sinking of HMS Hood, a symbolic British warship.", "start": 21.52, "duration": 5.88}, {"text": "Enraged, the Royal Navy now employs every possible means to track down and destroy the German raiders.", "start": 27.68, "duration": 6.98}, {"text": "The hunt has begun.", "start": 34.8, "duration": 2.08}, {"text": "While the hunt for the Bismarck is on, you too can rule the seas! This video is sponsored by World of Warships Blitz!", "start": 37.92, "duration": 6.58}, {"text": "Free to play via the AppStore or Google Play, World of Warships Blitz allows you to command some of history’s greatest warships in thrilling, tactical combat.", "start": 44.5, "duration": 9.0}, {"text": "And if you download the game using the link in description below, once you have skipped to the level 4", "start": 53.5, "duration": 4.84}, {"text": "you will receive a bonus prize pack!", "start": 58.34, "duration": 2.32}, {"text": "With thousands of players, and hundreds of ships and customizations to choose from,", "start": 60.66, "duration": 3.86}, {"text": "it falls on you, captain, as to how you will conquer the waves.", "start": 64.52, "duration": 4.7}, {"text": "It is the cool, breezy morning of the 24th of May 1941.", "start": 74.18, "duration": 4.96}, {"text": "A mere hour has passed since the German task force sank the iconic HMS Hood", "start": 79.14, "duration": 5.56}, {"text": "and considerably damaged another British capital ship, HMS Prince of Wales, forcing her to retreat.", "start": 84.7, "duration": 6.9}, {"text": "Both German vessels saw great elation among their crews following this spectacular victory,", "start": 91.6, "duration": 6.2}, {"text": "but the commander of the battlegroup, admiral Lütjens, was already preoccupied sketching plans for the immediate future,", "start": 98.12, "duration": 7.58}, {"text": "as he had no doubt, that the threat posed by the Royal Navy was only temporarily deterred.", "start": 105.7, "duration": 6.32}, {"text": "The most impending problem for the Germans was the damage that the Bismarck sustained in the course of the recent battle.", "start": 112.02, "duration": 6.6}, {"text": "Two hits dealt by the Prince of Wales caused the pride of the German navy to both leak precious fuel", "start": 118.68, "duration": 6.22}, {"text": "and at the same time allowed a couple thousand tonnes of salt water into another compartment,", "start": 124.9, "duration": 5.6}, {"text": "which made her slightly list to port and down by the bow.", "start": 130.5, "duration": 3.8}, {"text": "Technically, it wasn’t a huge issue though, as the ship’s artillery, propulsion and even the crew remained intact,", "start": 134.3, "duration": 7.4}, {"text": "but with less than 3,000 tonnes of fuel available, Lütjens had a narrow set of options to choose from.", "start": 141.74, "duration": 6.6}, {"text": "The Operation Rheinübung was no longer feasible due to the Bismarck’s damage affecting her range,", "start": 148.72, "duration": 6.58}, {"text": "and the plan was no longer a secret to the Royal Navy,", "start": 155.3, "duration": 3.4}, {"text": "which, as Lütjens expected, was about to use all available means to neutralize his task force.", "start": 158.7, "duration": 7.3}, {"text": "The German admiral had to either turn and use one of the available passages to get back to the nearest friendly ports in Norway,", "start": 166.2, "duration": 6.74}, {"text": "or carry on into the North Atlantic and eventually reach the safe haven of German occupied France.", "start": 172.94, "duration": 6.22}, {"text": "The Norwegian option seemed more reasonable,", "start": 179.3, "duration": 3.04}, {"text": "but Lütjens expected the possible presence of British heavy units in the area between them and Scapa Flow", "start": 182.62, "duration": 6.76}, {"text": "and considered this route as too risky.", "start": 189.38, "duration": 3.14}, {"text": "Instead, he decided to steam towards St Nazaire.", "start": 192.62, "duration": 3.16}, {"text": "The French coast was further away, but the route through the open Atlantic offered a better opportunity to shake off the British pursuers", "start": 196.42, "duration": 7.48}, {"text": "and a much better position to attack Allied convoys once the Bismarck was fully operational again.", "start": 203.9, "duration": 5.76}, {"text": "Moreover, Lütjens successfully used the French option months earlier,", "start": 210.16, "duration": 4.68}, {"text": "coming back to the port of Brest with two other German battlecruisers.", "start": 214.92, "duration": 4.28}, {"text": "Still, the Bismarck’s group was shadowed by two British heavy cruisers equipped with superior radar,", "start": 219.34, "duration": 6.7}, {"text": "followed by the damaged HMS Prince of Wales.", "start": 226.04, "duration": 2.98}, {"text": "so the chase group under admiral John Tovey had a reliable information on German positions.", "start": 229.02, "duration": 6.44}, {"text": "The problem was, that Tovey’s force was more than 350 miles away,", "start": 235.74, "duration": 5.44}, {"text": "and the damaged Bismarck was still able to cruise at 28 knots, about the same speed as that of the British heavy warships were capable of.", "start": 241.32, "duration": 8.68}, {"text": "Thus, unless she was slowed down, there was little chance of her to be intercepted.", "start": 250.14, "duration": 6.0}, {"text": "In the late afternoon of the 24th May Lütjens took advantage of a rain squall,", "start": 256.42, "duration": 5.4}, {"text": "made a sharp turn to starboard and briefly engaged with the trailing British group,", "start": 261.96, "duration": 4.94}, {"text": "granting cover for the undamaged Prinz Eugen to detach unseen and steam away to harass Atlantic convoys.", "start": 266.9, "duration": 8.36}, {"text": "The Bismarck resumed her original course with all three British ships now trailing to her port side.", "start": 275.46, "duration": 6.4}, {"text": "But several hours later a new threat emerged.", "start": 282.58, "duration": 3.08}, {"text": "One of Tovey’s ships, aircraft carrier HMS Victorious adjusted her course,", "start": 285.66, "duration": 5.58}, {"text": "which eventually enabled her to launch a squadron of torpedo bombers in an attempt to damage and slow down the Bismarck.", "start": 291.24, "duration": 7.38}, {"text": "Yet inexperienced pilots mistakenly prepared to attack HMS Norfolk,", "start": 298.88, "duration": 4.7}, {"text": "which alerted German anti-aircraft gunners, who immediately opened fire at the enemy.", "start": 303.58, "duration": 5.94}, {"text": "But none of the attacking planes were shot down, and the British were able to launch nine torpedoes at the Bismarck,", "start": 309.7, "duration": 6.12}, {"text": "though only one reached its target, hitting the battleship’s main armour belt with no significant damage.", "start": 315.82, "duration": 6.84}, {"text": "Soon, the chase entered open waters and the pursuers were forced to adopt zig-zag manoeuvrings", "start": 323.1, "duration": 5.74}, {"text": "in order to avoid German U-boats that might have been patrolling the area,", "start": 328.84, "duration": 4.78}, {"text": "according to British intelligence reports.", "start": 333.62, "duration": 2.82}, {"text": "As a result, the Bismarck was repeatedly out of range of Suffolk’s radar.", "start": 336.6, "duration": 5.06}, {"text": "Coincidentally, Lutjens ordered a 270 turn to starboard hoping to break off radar contact, circling behind her pursuers.", "start": 342.08, "duration": 9.28}, {"text": "Luckily, this move worked and the German admiral adjusted his course to France,", "start": 352.1, "duration": 5.22}, {"text": "fooling the British at the same time, who upon losing radar contact,", "start": 357.32, "duration": 4.1}, {"text": "steamed west at first and then, early in the morning dispersed to seek the Bismarck visually.", "start": 361.42, "duration": 7.04}, {"text": "It came as a shock for the British admiralty, as many of the Royal Navy ships were already low on fuel,", "start": 368.8, "duration": 6.12}, {"text": "and the actual position of the enemy battleship was now a mystery.", "start": 374.92, "duration": 4.54}, {"text": "From then on the plan to neutralize the warship", "start": 379.7, "duration": 3.02}, {"text": "which sank HMS Hood, the pride of the Royal Navy, hung in the balance.", "start": 382.72, "duration": 6.1}, {"text": "But just like the British, the Germans were also making mistakes.", "start": 389.2, "duration": 3.7}, {"text": "Admiral Lütjens remained unaware of the fact that he actually got rid of his pursuit and didn’t maintain radio silence,", "start": 393.22, "duration": 7.34}, {"text": "allowing codebreakers at Bletchley Park to determine the Bismarck’s approximate position", "start": 400.56, "duration": 5.72}, {"text": "and that she was steaming towards the French coast.", "start": 406.28, "duration": 3.22}, {"text": "Hope sparked again, as the narrowed search area gave a small chance to locate the Bismarck’s position", "start": 409.5, "duration": 6.78}, {"text": "before she could make safely into the range of the Luftwaffe operating from French air bases.", "start": 416.28, "duration": 6.34}, {"text": "The odds were still against the British though, as HMS Prince of Wales, Suffolk, Victorious and Repulse", "start": 422.62, "duration": 7.08}, {"text": "were forced to break off the search due to fuel shortages.", "start": 429.7, "duration": 3.68}, {"text": "This meant that Admiral Tovey’s only capital ships still in action", "start": 433.66, "duration": 4.76}, {"text": "were the HMS King George V and the old battleship HMS Rodney, both far away from the Bismarck’s approximate position.", "start": 438.42, "duration": 8.88}, {"text": "In the morning of the 26th of May the British Navy had a much needed stroke of luck,", "start": 447.7, "duration": 5.02}, {"text": "as one of the Catalina flying boats which had flown from its base on Lough Erne in Northern Ireland", "start": 452.86, "duration": 5.74}, {"text": "accidentally spotted the trail of the oil slick on the sea.", "start": 458.6, "duration": 4.2}, {"text": "Shortly, the Bismarck was located just short of 700 miles northwest of Brest.", "start": 463.06, "duration": 6.86}, {"text": "Seemingly this was good news, but her position also meant, that in less than a day", "start": 469.92, "duration": 5.46}, {"text": "the Bismarck would reach the safe area covered by the Luftwaffe and U-boats.", "start": 475.38, "duration": 5.52}, {"text": "Time was running out and the only chance the British had to intercept the German battleship was the Force H,", "start": 481.06, "duration": 7.28}, {"text": "a naval formation based in Gibraltar, under the command of vice-admiral James Somerville.", "start": 488.34, "duration": 6.38}, {"text": "As soon as Somerville was informed of the Bismarck’s position,", "start": 495.04, "duration": 3.34}, {"text": "he detached a light cruiser, HMS Sheffield to shadow the enemy", "start": 498.38, "duration": 4.7}, {"text": "and commanded the carrier, HMS Ark Royal, to immediately launch torpedo bombers.", "start": 503.08, "duration": 5.86}, {"text": "But the first squadron was not informed of Sheffield’s orders and mistook it for the Bismarck.", "start": 508.94, "duration": 5.74}, {"text": "Luckily, the dropped torpedoes were equipped with new,", "start": 515.02, "duration": 3.12}, {"text": "yet unreliable magnetic detonators and HMS Sheffield remained unscathed.", "start": 518.14, "duration": 5.44}, {"text": "Subsequently, the second squadron of Swordfish was launched, but this time equipped with older, contact detonators.", "start": 523.98, "duration": 7.54}, {"text": "On this occasion, the aviators picked the target correctly and despite heavy anti-aircraft fire,", "start": 531.9, "duration": 5.96}, {"text": "the torpedo attack finally yielded some results.", "start": 537.86, "duration": 3.44}, {"text": "The Bismarck was hit twice, as one torpedo hit mid-ship with minor damage,", "start": 541.66, "duration": 4.94}, {"text": "and another exploded at the stern, jamming both of battleship’s rudders.", "start": 546.68, "duration": 4.4}, {"text": "Damage control teams managed to repair the starboard one, but the port rudder remained blocked at a turning position.", "start": 551.3, "duration": 7.08}, {"text": "This meant, that the Bismarck lost her manoeuvrability and was unable to escape,", "start": 558.52, "duration": 5.84}, {"text": "being just a few hundred miles away from the safe zone.", "start": 564.52, "duration": 3.6}, {"text": "But even with crippled mobility, her powerful armaments and fire control systems were intact,", "start": 568.12, "duration": 6.32}, {"text": "a sufficient reason for bigger British vessels to keep their distance.", "start": 574.44, "duration": 5.38}, {"text": "Six destroyers kept the Bismarck busy with torpedo attacks during the night,", "start": 579.92, "duration": 4.24}, {"text": "but it was not until the next morning, when the final battle occurred.", "start": 584.16, "duration": 4.48}, {"text": "Eventually, the three remaining ships of Admiral Tovey’s Home Fleet loomed on the grey horizon, preparing for a final battle.", "start": 588.82, "duration": 8.44}, {"text": "HMS Rodney and HMS King George V drew and fired first salvoes at the slow moving Bismarck.", "start": 597.26, "duration": 7.58}, {"text": "The German battleship returned fire with her forward turrets,", "start": 605.16, "duration": 3.12}, {"text": "yet managed to only fire short of HMS Rodney,", "start": 608.28, "duration": 3.52}, {"text": "as her ability to aim accurately was somewhat decreased due to erratic movement caused by the jammed rudder.", "start": 611.8, "duration": 8.38}, {"text": "But the British shells soon reached their target causing initial damage and fires to breakout on board.", "start": 620.54, "duration": 6.26}, {"text": "The two heavy cruisers joined the battle and aimed their turrets at the strafed German battleship.", "start": 627.24, "duration": 5.66}, {"text": "For the next 90 minutes the Bismarck suffered relentless British fire,", "start": 633.14, "duration": 4.28}, {"text": "as hundreds of shells struck the venerable German battle-vessel", "start": 637.48, "duration": 4.18}, {"text": "causing massive damage to the ship and huge casualties to the crew.", "start": 641.66, "duration": 4.76}, {"text": "Yet despite this persisting cannonade and detonating the scuttling charges by her crew,", "start": 646.42, "duration": 5.78}, {"text": "the Bismarck refused to sink.", "start": 652.2, "duration": 2.82}, {"text": "As Tovey’s warships were dangerously low on fuel and shells, he sent them back to port,", "start": 655.44, "duration": 5.88}, {"text": "leaving HMS Dorsetshire to finish the job.", "start": 661.32, "duration": 3.62}, {"text": "Eventually, at 10:39 on the 27th of May, the Bismarck went under the waves.", "start": 665.34, "duration": 6.7}, {"text": "A little more than a hundred of her sailors were rescued,", "start": 672.32, "duration": 3.08}, {"text": "while the majority that managed to abandon the sinking Bismarck were left to the mercy of the water,", "start": 675.4, "duration": 5.56}, {"text": "as British ships left the scene after the U-boat alarm.", "start": 680.96, "duration": 3.6}, {"text": "More than 2,000 German sailors shared the fate of the iconic battleship.", "start": 684.56, "duration": 5.8}, {"text": "The loss of the Bismarck was a heavy blow for the Kriegsmarine,", "start": 690.7, "duration": 3.48}, {"text": "and also became a turning point in the war on Allied commerce convoys,", "start": 694.38, "duration": 4.44}, {"text": "as from that point on, German Naval Command abandoned the idea of using capital ships for raiding in favour of U-boats,", "start": 699.08, "duration": 8.62}, {"text": "which wreaked havoc on the Northern Atlantic for the next two years.", "start": 707.7, "duration": 4.1}, {"text": "Still the famous eight-day long voyage of the Bismarck became a highlight of the Battle of the Atlantic,", "start": 712.1, "duration": 6.98}, {"text": "and one of the most popular events of the Second World War in Europe.", "start": 719.08, "duration": 5.46}]