[{"text": "This video was sponsored by Squarespace.", "start": 0.0, "duration": 2.1}, {"text": "Okay, you guys have been tweeting at me.", "start": 2.1, "duration": 2.14}, {"text": "Marton, talk about Poco! \nWhy does Xiaomi need a second brand?", "start": 4.24, "duration": 3.96}, {"text": "In fact, why do all major Chinese smartphone makers have multiple brands?", "start": 8.2, "duration": 3.7}, {"text": "So in the 39th episode of my \"Story Behind\" series, let's talk multi-brand smartphone strategies.", "start": 11.98, "duration": 6.229}, {"text": "[Intro]", "start": 18.74, "duration": 0.56}, {"text": "Our story begins and ends with Xiaomi.", "start": 24.31, "duration": 3.55}, {"text": "The company completely changed the Chinese smartphone market in 2011", "start": 27.86, "duration": 3.02}, {"text": "When it launched with its crazy, online only business model that focused on cutting out the middlemen,", "start": 30.88, "duration": 5.12}, {"text": "not keeping any inventory, and selling phones with razor thin margins.", "start": 36.0, "duration": 3.749}, {"text": "Traditional phone makers like Oppo and Huawei,", "start": 40.0, "duration": 2.5}, {"text": "who have to give their offline retail partners often over 50% margins to sell their phones,", "start": 42.5, "duration": 5.0}, {"text": "simply couldn't compete with this model.", "start": 47.5, "duration": 3.73}, {"text": "Offline retail is expensive,", "start": 51.23, "duration": 0.5}, {"text": "so seeing Xiaomi's rise, they had to react. \nAnd they both came up with pretty much the same solution.", "start": 51.73, "duration": 5.07}, {"text": "Step 1: Launch an online brand which replicates most of Xiaomi's business model and offers similarly aggressive prices.", "start": 56.8, "duration": 6.619}, {"text": "After all, the Xiaomi model was innovative, but not exactly hard to copy.", "start": 63.519, "duration": 4.281}, {"text": "Step 2: Double down on offline retail with the Oppo and Huawei brands.", "start": 67.8, "duration": 3.569}, {"text": "After all, even with Xiaomi's success, the majority of people still bought their phones offline even in China,", "start": 71.59, "duration": 5.81}, {"text": "the most e-commerce focused country in the world.", "start": 77.619, "duration": 1.821}, {"text": "Online and offline retail had to be split into two brands, because they're such wildly different businesses.", "start": 79.44, "duration": 5.66}, {"text": "It costs a lot more to sell offline, so you need higher prices.", "start": 85.1, "duration": 3.6}, {"text": "But those high prices don't work well online with competitors like Xiaomi around.", "start": 88.7, "duration": 3.8}, {"text": "Hence, the need for two separate brands.", "start": 92.71, "duration": 2.59}, {"text": "The offline brands got the premium features first like how Vooc fast charging was on Oppo phones", "start": 95.3, "duration": 5.0}, {"text": "for two years before it arrived to OnePlus as Dash charge,", "start": 100.3, "duration": 2.92}, {"text": "or how Huawei phones got duo cameras, Bleica partnerships, and the newest Korean processors,", "start": 103.22, "duration": 5.38}, {"text": "before the honor models got them and so on.", "start": 108.6, "duration": 2.82}, {"text": "The offline brands also received much more premium marketing to turn them into fashionable, lifestyle brands", "start": 111.42, "duration": 5.48}, {"text": "all of which combined, were supposed to justify the higher price tags.", "start": 116.909, "duration": 4.091}, {"text": "In the meanwhile, the online brands had much more bare-bones devices that focused on", "start": 121.0, "duration": 4.28}, {"text": "having the best possible price to performance ratio.", "start": 125.28, "duration": 2.459}, {"text": "Buying online, better specs nearly always win as direct comparisons are very easy to make.", "start": 128.229, "duration": 5.371}, {"text": "And this plan, worked!", "start": 133.68, "duration": 1.589}, {"text": "Xiaomi was suddenly threatened online and had nothing to fight back with offline.", "start": 135.269, "duration": 4.23}, {"text": "The meteoric rise of Xiaomi was not only stopped, the company's sales actually started shrinking.", "start": 139.569, "duration": 5.531}, {"text": "Both Oppo and Huawei overtook Xioami in China and even Xiaomi's expansion abroad,", "start": 145.1, "duration": 4.66}, {"text": "especially to Brazil and India, started faltering too.", "start": 149.76, "duration": 3.44}, {"text": "Xiaomi had to do something. So just like the offline guys figured they could just go online,", "start": 153.2, "duration": 4.69}, {"text": "Xiaomi figured that they could just go offline.", "start": 158.17, "duration": 2.77}, {"text": "They just needed to find a way to undercut the offline brands on price significantly.", "start": 160.94, "duration": 4.56}, {"text": "Which, they did.", "start": 165.639, "duration": 1.241}, {"text": "Instead of having a separate online and offline brand like Oppo and Huawei had,", "start": 166.88, "duration": 4.82}, {"text": "they decided to stick with just one at first, and found ways to make more money outside of selling phones.", "start": 171.7, "duration": 5.9}, {"text": "Se, Oppo and Huawei make money primarily from selling phones.", "start": 177.6, "duration": 3.15}, {"text": "Xiaomi, though, doesn't. They sell phones  at cost, or even at a loss, and rely on making money on internet services.", "start": 181.06, "duration": 6.559}, {"text": "I made a whole video explaining this business model that you can see right here.", "start": 187.62, "duration": 3.92}, {"text": "And on top of that, Xiaomi stores", "start": 191.54, "duration": 1.539}, {"text": "don't only sell phones, but also lots of other items, too,", "start": 193.079, "duration": 3.9}, {"text": "like rice cookers, electric scooter thingies, power banks and so on,", "start": 196.98, "duration": 4.52}, {"text": "which a network of companies supplies them with, all under the Xiaomi brand.", "start": 201.5, "duration": 4.0}, {"text": "They make money from those too,", "start": 205.5, "duration": 1.469}, {"text": "which means that, unlike Oppo and Huawei, Xiaomi could keep their offline phone prices", "start": 206.97, "duration": 4.679}, {"text": "relatively low without hurting their online sales model too much.", "start": 212.109, "duration": 3.548}, {"text": "This diversification really worked for Xiaomi, as they're now back to the same insane growth numbers that they had before their streak was broken.", "start": 215.657, "duration": 7.152}, {"text": "One segment that they were especially successful in is", "start": 223.15, "duration": 2.65}, {"text": "the crucially important, 10 to 20 thousand rupees segment in India,", "start": 225.8, "duration": 4.28}, {"text": "the largest smartphone market after China.", "start": 230.08, "duration": 2.12}, {"text": "This is the most important smartphone segment in India,", "start": 232.26, "duration": 3.0}, {"text": "which is why companies developed their best bang for buck devices for it,", "start": 235.26, "duration": 3.86}, {"text": "like Xiaomi's Redmi phones, Oppo's F Series phones, Nokia's newly announced 5.1 and 6.1 devices,", "start": 239.12, "duration": 7.48}, {"text": "Samsung's J Series, and many others.", "start": 246.609, "duration": 2.671}, {"text": "And so far, Xiaomi's aggressive prices, combined with their focus on both online and offline retail channels,", "start": 249.28, "duration": 5.92}, {"text": "has made the Redmi the biggest winner in it.", "start": 255.2, "duration": 2.86}, {"text": "Which brings us to RealMe, Oppo's direct response to Redmi.", "start": 258.099, "duration": 4.601}, {"text": "Oppo, who lost significant market share in India to Xiaomi since its comeback,", "start": 262.7, "duration": 3.73}, {"text": "assigns Sky Li, formerly the head of Oppo India, to win back this crucially important segment from Xiaomi,", "start": 266.55, "duration": 6.25}, {"text": "and many of Oppo's best people were moved over there, showing not only its importance to Oppo,", "start": 272.8, "duration": 5.089}, {"text": "but also that, after spinning up OnePlus, the company has become an expert at creating new brands.", "start": 277.889, "duration": 5.55}, {"text": "Now, you might wonder, why not just have OnePlus launch a phone in this category.", "start": 283.44, "duration": 3.84}, {"text": "After all, they are supposed to be the bang for buck online brand of Oppo.", "start": 287.28, "duration": 4.199}, {"text": "But, there are a few difficulties with that.", "start": 291.509, "duration": 2.451}, {"text": "Oneplus just isn't a budget smartphone brand anymore,", "start": 293.96, "duration": 2.9}, {"text": "as they have slowly increased their prices from around 300 USD you all the way to over 500 now.", "start": 296.86, "duration": 6.04}, {"text": "They don't want to be seen as an ultra budget phone maker anymore.", "start": 302.909, "duration": 3.57}, {"text": "They want to make a profit selling phones, and the aren't all that \"online only\" either.", "start": 306.479, "duration": 4.721}, {"text": "The sell through carriers in Finland and the UK, and a couple of other countries by now as well.", "start": 311.2, "duration": 4.4}, {"text": "They've also tried launching a mid-range phone, the OnePlus X a few years ago,", "start": 315.659, "duration": 3.78}, {"text": "and they themselves admitted that it wasn't well received by fans.", "start": 319.44, "duration": 3.089}, {"text": "So, OnepLus is now focused on creating a premium flagship for enthusiasts,", "start": 322.84, "duration": 4.56}, {"text": "while RealMe can focus on beating Redmi.", "start": 327.4, "duration": 3.52}, {"text": "Which brings us to the Poco phone.", "start": 330.92, "duration": 2.019}, {"text": "My guess is that, As Ash from C4E Tech has said,", "start": 332.94, "duration": 3.329}, {"text": "Xiaomi's realized that using the same brand for both online and offline channels has, over time,", "start": 336.61, "duration": 5.73}, {"text": "started to limit Xiaomi, and that they wanted to create a device that can be", "start": 342.34, "duration": 3.78}, {"text": "ultra competitive by making it online only.", "start": 346.12, "duration": 2.94}, {"text": "They have also probably realized that Oneplus raising their prices gets Xiaomi a pretty big opening to", "start": 349.06, "duration": 5.899}, {"text": "significantly undercut them. After all, Oneplus has to make a profit from selling phones while Xiaomi doesn't.", "start": 355.24, "duration": 5.76}, {"text": "It's clear looking at the Poco launch event that they are pitching this phone directly against Oneplus,", "start": 361.0, "duration": 5.8}, {"text": "who makes up the bulk of flagship smartphone sales together with Samsung in India,", "start": 366.8, "duration": 3.802}, {"text": "and who is growing very quickly, giving Xiaomi a real headache.", "start": 370.602, "duration": 4.078}, {"text": "If things go well, Poco will be to Xiaomi what OnePlus is to Oppo,", "start": 374.68, "duration": 4.52}, {"text": "an even more competitive, even more bang for buck brand for enthusiasts.", "start": 379.2, "duration": 4.8}, {"text": "Launching multiple brands gives a company the ability to target completely different users", "start": 384.0, "duration": 4.9}, {"text": "that wouldn't be available to them if they only had one brand.", "start": 388.9, "duration": 3.38}, {"text": "Just think of Oppo and OnePlus.", "start": 392.28, "duration": 1.679}, {"text": "Hardcore smartphone enthusiasts tend to sneer at Oppo's selfie campaigns, while people who love", "start": 394.36, "duration": 5.029}, {"text": "fashion and luxury would probably want to have something more fancy than a OnePlus.", "start": 399.61, "duration": 4.81}, {"text": "Having both lets Oppo reach both groups. And, as the smartphone market matures,", "start": 404.42, "duration": 4.78}, {"text": "I totally expect to see more multi-brand companies in the future,", "start": 409.2, "duration": 3.779}, {"text": "just like we've seen in other consumer facing industries like cars and clothes as well.", "start": 413.23, "duration": 4.519}, {"text": "Fun fact: Did you know that OnePlus didn't own the oneplus.com domain name until about a year or two ago?", "start": 418.69, "duration": 6.17}, {"text": "They only had oneplus.net, which is a pretty nasty problem for a company who sells phones primarily through their website.", "start": 424.86, "duration": 7.14}, {"text": "If you want to launch your own website,  blog or webshop,", "start": 432.0, "duration": 3.1}, {"text": "be smarter than Oneplus. Get the right domain and build it using Squarespace.", "start": 435.2, "duration": 4.419}, {"text": "They have an easy drag-and-drop UI so you don't need to code if you don't want to,", "start": 439.62, "duration": 4.05}, {"text": "24/7 customer support for when you screw up something in the middle of the night,", "start": 443.98, "duration": 4.08}, {"text": "beautiful templates built by world-class designers, analytics, hosting, domain services, it's all there.", "start": 448.06, "duration": 6.24}, {"text": "And you'll never have to patch or upgrade anything.", "start": 454.3, "duration": 2.39}, {"text": "Go to squarespace.com/techaltar to get 10% off your first purchase of a website or domain", "start": 456.7, "duration": 6.3}, {"text": "and to help my channel out as well while you're at it.", "start": 463.0, "duration": 2.629}]