[{"text": "This video's brought to you in part by NordVPN.", "start": 0.06, "duration": 2.76}, {"text": "In the US, there are no regulations to stop your internet service provider from selling your data,", "start": 2.82, "duration": 4.9}, {"text": "I don't care if it's wrong or right, I just don't want my ISP to know", "start": 7.72, "duration": 3.2}, {"text": "how many times I went to the Wikipedia page for Greg Hastings Painball MAX'D.", "start": 10.92, "duration": 3.22}, {"text": "(It was a couple 'o times.)", "start": 14.14, "duration": 1.34}, {"text": "NordVPN encrypts your data so it can't be seen by your ISP or potential hackers.", "start": 15.56, "duration": 4.72}, {"text": "For a limited time, get 75% off a three-year plan at NordVPN.com/STOPSKELETONS.", "start": 20.28, "duration": 5.68}, {"text": "This special offer makes your subscription just $2.99 a month,", "start": 25.96, "duration": 2.8}, {"text": "so you can browse securely on up to six devices simultaneously, and for a short time,", "start": 28.76, "duration": 5.28}, {"text": "use the offer code 'STOPSKELETONS' at checkout to get an extra month for free!", "start": 34.04, "duration": 3.68}, {"text": "Link is in the description below,", "start": 37.72, "duration": 1.3}, {"text": "NordVPN.com/STOPSKELETONS and the offer code 'STOPSKELETONS'", "start": 39.02, "duration": 4.68}, {"text": "Thanks to NordVPN for sponsoring this part of the video!", "start": 43.78, "duration": 2.48}, {"text": "There couldn't possibly be a good reason for this disc, right?", "start": 46.92, "duration": 2.58}, {"text": "GRACE: I-- I mean...\nDEREK: It's got the Nintendo Seal of Quality though!", "start": 49.52, "duration": 2.72}, {"text": "Hello and welcome, you're watching Stop Skeletons From Fighting, I'm Derek Alexander,", "start": 52.3, "duration": 3.32}, {"text": "and this is a Netflix disc for the Wii.", "start": 55.92, "duration": 2.74}, {"text": "And no, it's not like a collection of Office episodes or anything like that,", "start": 58.86, "duration": 2.92}, {"text": "it was used to access Netflix streaming for your Nintendo Wii.", "start": 61.82, "duration": 3.72}, {"text": "And it was the best game on the system!", "start": 65.64, "duration": 1.94}, {"text": "\"Best game on Wii!\"", "start": 68.18, "duration": 1.6}, {"text": "Okay, so why do I need the physical thing to make the thing do a streaming thing?", "start": 69.9, "duration": 3.8}, {"text": "You didn't always need this disc, right? And yes, that is true!", "start": 73.7, "duration": 2.9}, {"text": "But the real answer is a little more complicated than you might thi--", "start": 76.6, "duration": 2.68}, {"text": "Microsoft.", "start": 79.28, "duration": 0.88}, {"text": "It was Microsoft.", "start": 80.8, "duration": 1.14}, {"text": "Okay, it actually IS a little more complicated than that.", "start": 82.32, "duration": 2.54}, {"text": "But when Microsoft was gearing up for the seventh generation of consoles, they had their eye on the prize:", "start": 84.94, "duration": 4.66}, {"text": "Crushing Sony and winning control of the living room.", "start": 89.66, "duration": 2.52}, {"text": "Sony was gonna give it their all too... or at least they tried to.", "start": 92.26, "duration": 4.04}, {"text": "But the problem was that no-one was prepared for what Nintendo did with the Wii.", "start": 96.46, "duration": 4.1}, {"text": "Suddenly, Microsoft and Sony had to scrap for second place, and no-one's happy with that!", "start": 100.64, "duration": 4.66}, {"text": "Except for Nintendo.", "start": 106.24, "duration": 1.04}, {"text": "But what does that have to do with Netflix?", "start": 107.28, "duration": 1.56}, {"text": "Well, the Wii proved that there is an untapped casual market out there", "start": 108.84, "duration": 3.52}, {"text": "that didn't care about having the bestest and most hardcore machine,", "start": 112.36, "duration": 3.3}, {"text": "as much as they cared about convenience and family-friendly fun!", "start": 115.66, "duration": 3.0}, {"text": "And that you could make a couple 'o bucks catering to it!", "start": 118.84, "duration": 2.94}, {"text": "Netflix was part of Phase 1 in a multi-stage attack that included things like the Kinect, for example.", "start": 121.92, "duration": 4.98}, {"text": "So Netflix, on the way to becoming \"& Chill\",", "start": 126.9, "duration": 3.56}, {"text": "and the content-spewing juggernaut they are today,", "start": 130.48, "duration": 2.38}, {"text": "decided to become a disc to transition out of shipping discs.", "start": 132.86, "duration": 3.5}, {"text": "This is the story of how Netflix became a weapon in the seventh-generation console war.", "start": 136.5, "duration": 4.9}, {"text": "Before Netflix became a juggernaut, making billions streaming original content,", "start": 154.04, "duration": 4.1}, {"text": "they weren't streaming anything at all!", "start": 158.14, "duration": 1.84}, {"text": "As most of you undoubtedly remember, Netflix used to only be a DVD rental company.", "start": 160.04, "duration": 4.88}, {"text": "Launched in 1998, they actually didn't make the jump to their monthly subscription model until 1999.", "start": 164.98, "duration": 5.26}, {"text": "From there they kept growing and growing, even offering themselves up to Blockbuster Video for sale,", "start": 170.3, "duration": 4.82}, {"text": "- they said no, by the way. Rest in peace -", "start": 175.38, "duration": 1.82}, {"text": "and recorded their first profit year in 2004.", "start": 177.2, "duration": 2.9}, {"text": "Naturally, there was the struggle to keep growing,", "start": 180.1, "duration": 2.18}, {"text": "and Netflix ultimately decided that streaming was the future.", "start": 182.28, "duration": 3.32}, {"text": "So they set to work on a physical Netflix box,", "start": 185.6, "duration": 2.58}, {"text": "which would be the all-in-one exclusive Netflix streaming solution.", "start": 188.18, "duration": 3.5}, {"text": "But! Then in 2005, YouTube exploded onto the scene, causing Netflix to rethink their strategy.", "start": 191.74, "duration": 5.96}, {"text": "Netflix should instead be everywhere and anywhere!", "start": 197.72, "duration": 3.04}, {"text": "That was their path to even more growth.", "start": 200.8, "duration": 2.2}, {"text": "They went from a box to an app.", "start": 203.0, "duration": 2.26}, {"text": "While Netflix was deciding to transition away from physical media,", "start": 205.92, "duration": 3.32}, {"text": "two other companies were doubling down on it: Sony and Microsoft.", "start": 209.24, "duration": 3.78}, {"text": "They were very busy duking out for supremacy over the living room.", "start": 213.02, "duration": 3.28}, {"text": "Microsoft rushed their Xbox 360 to market in time for the 2005 holiday season,", "start": 216.3, "duration": 4.52}, {"text": "beating Sony's PlayStation 3 by a full year.", "start": 220.82, "duration": 2.64}, {"text": "They even decided to support the competitor to Sony's new Blu-ray standard, Toshiba's HD DVD,", "start": 223.46, "duration": 5.6}, {"text": "for no real reason other than they had \"F*** you\" money,", "start": 229.1, "duration": 2.96}, {"text": "and also, being a Blu-ray player was the one thing the PS3 could hold over the Xbox 360.", "start": 232.06, "duration": 5.42}, {"text": "But that's not to say that Microsoft wasn't carefully watching the future of streaming media,", "start": 237.56, "duration": 4.18}, {"text": "especially since online downloads through their Xbox Live store were already making them buckets 'o bread.", "start": 241.74, "duration": 4.88}, {"text": "So they got to work on making technology to support media streaming, and came out with Silverlight,", "start": 246.7, "duration": 5.32}, {"text": "a framework used by Netflix once it officially rolled out its Watch Instant online service in 2007.", "start": 252.02, "duration": 5.96}, {"text": "Microsoft then had Netflix CEO Reed Hastings join their board of directors.", "start": 258.06, "duration": 4.62}, {"text": "Netflix and Microsoft were definitely gettin' pretty cozy, right?", "start": 262.86, "duration": 2.92}, {"text": "But back to the HD DVD/Blu-Ray war:", "start": 265.88, "duration": 2.48}, {"text": "Now, this particular format war was relatively short-lived.", "start": 268.38, "duration": 3.3}, {"text": "Even though Microsoft had functionally buried Sony with its console sales,", "start": 271.72, "duration": 3.54}, {"text": "and even released a little HD DVD add-on for the 360-", "start": 275.26, "duration": 2.96}, {"text": "Hey! Who had one of these things?!", "start": 278.22, "duration": 1.8}, {"text": "The fledgling format of HD DVD officially crashed and burned in January 2008,", "start": 280.04, "duration": 5.08}, {"text": "when Warner Bros. announced they would be pushing their library to Blu-ray.", "start": 285.12, "duration": 3.4}, {"text": "Now that Microsoft had lost the physical format war to Sony,", "start": 288.58, "duration": 3.08}, {"text": "they needed to win the next one: Streaming.", "start": 291.66, "duration": 2.2}, {"text": "Anything to dominate the living room.", "start": 293.9, "duration": 1.96}, {"text": "So, so far we've laid out the major players: Netflix, Sony, Microsoft,", "start": 296.16, "duration": 3.84}, {"text": "but we're ignoring the elephant in the room:", "start": 300.04, "duration": 2.6}, {"text": "Nintendo and the astronomical success of the Wii.", "start": 302.64, "duration": 3.44}, {"text": "Releasing in holiday 2006, the Wii was the moment when gaming transitioned from,", "start": 306.14, "duration": 4.3}, {"text": "at least perceived by the culture at the time, for weirdos and nerds and kids,", "start": 310.44, "duration": 4.74}, {"text": "to being something for truly everyone!", "start": 315.18, "duration": 1.94}, {"text": "Nintendo successfully tapped into the casual market for games,", "start": 317.12, "duration": 3.58}, {"text": "and was running circles around the competition!", "start": 320.82, "duration": 2.42}, {"text": "And that needed to be answered by Microsoft.", "start": 323.32, "duration": 2.9}, {"text": "So! At E3 2008, Xbox rolled out Phase 1 of their big plan", "start": 326.4, "duration": 4.36}, {"text": "to expand from being the default shooter console, to a console for the whole family.", "start": 330.76, "duration": 4.2}, {"text": "The New Xbox Experience, a.k.a. NXE.", "start": 335.08, "duration": 3.32}, {"text": "NXE rolled out an all-new, friendlier Xbox: The UI was all-new,", "start": 338.54, "duration": 3.94}, {"text": "they added Avatars, which were a blatant copy of Nintendo Miis,", "start": 342.48, "duration": 3.6}, {"text": "but they also exclusively included Netflix!", "start": 346.08, "duration": 3.06}, {"text": "Yes! Xbox was the first and only console with Netflix on it!", "start": 349.3, "duration": 3.84}, {"text": "Today Netflix is so ubiquitous that it accounts for 15% of all internet traffic,", "start": 353.14, "duration": 5.0}, {"text": "but in 2008, there was only one game console with Netflix!", "start": 358.14, "duration": 3.66}, {"text": "And with Xbox 360, you could even watch Netflix live with your friends in a party -", "start": 361.88, "duration": 4.1}, {"text": "Oh my god! There was a time when you could basically livestream Netflix!", "start": 365.98, "duration": 5.0}, {"text": "And it was only ten years ago!", "start": 371.16, "duration": 1.52}, {"text": "But there were a few catches:", "start": 372.68, "duration": 1.78}, {"text": "1: Users could only manage their Instant Queues from a computer, not the 360,", "start": 374.46, "duration": 4.94}, {"text": "2: It required users to be both Netflix subscribers and Xbox's $50-a-year Gold membership,", "start": 379.4, "duration": 5.78}, {"text": "and lastly, not all movies and shows available on the rest of Netflix would be available on Xbox 360.", "start": 385.18, "duration": 5.64}, {"text": "While you could still watch your Office,", "start": 390.82, "duration": 1.74}, {"text": "you couldn't enjoy properties from, say, Sony-owned Columbia Studios.", "start": 392.56, "duration": 4.08}, {"text": "[scoffs] Geez! C'mon Sony, that's petty, even for you!", "start": 396.64, "duration": 3.4}, {"text": "And well, how WAS Sony doing anyway?", "start": 400.2, "duration": 2.44}, {"text": "At that same E3, they announced that", "start": 402.66, "duration": 2.18}, {"text": "they would be adding on-demand video rentals to their PlayStation Store,", "start": 404.92, "duration": 3.14}, {"text": "a feature that, by the way, had already been available on Xbox 360 for over a year at that point.", "start": 408.06, "duration": 5.18}, {"text": "The fact is that even beyond PS3 lagging behind Xbox 360 in exclusive killer apps and games,", "start": 413.28, "duration": 5.3}, {"text": "they were also severely behind on Xbox's online features.", "start": 418.58, "duration": 3.56}, {"text": "Part of the reason is that Xbox was divided into two tiers:", "start": 422.18, "duration": 2.92}, {"text": "One that was free, and one where users could pay 50 bucks a year to use online multiplayer,", "start": 425.14, "duration": 4.32}, {"text": "while all of PlayStation Networks' sparse online features were free,", "start": 429.46, "duration": 3.34}, {"text": "meaning Sony wasn't making the same kinda money Xbox was making on their live features,", "start": 432.86, "duration": 4.34}, {"text": "so Sony had less to invest back into their online offerings.", "start": 437.2, "duration": 3.62}, {"text": "\"Ya gotta spend money to make money.\"", "start": 440.82, "duration": 1.48}, {"text": "PSN being free was theoretically a good tactic to grab users from Xbox Live,", "start": 442.3, "duration": 5.4}, {"text": "and was something of a sticking point for Sony.", "start": 447.7, "duration": 2.24}, {"text": "Here's a REAL quote from the director of PlayStation Network at the time:", "start": 450.06, "duration": 3.82}, {"text": "[laughing] Oh my god!", "start": 459.76, "duration": 1.98}, {"text": "It'd be a whole separate video just to break that quote down, so let's just move on!", "start": 461.74, "duration": 4.38}, {"text": "Woof!", "start": 466.22, "duration": 0.56}, {"text": "The New Xbox Experience officially launched in November 2008,", "start": 466.86, "duration": 3.18}, {"text": "accompanying slashed prices for all Xboxes, and the quiet release of the Jasper model of Xbox 360's,", "start": 470.04, "duration": 6.06}, {"text": "which, by the way, were the hardware fixes for the dreaded Red Ring of Death.", "start": 476.1, "duration": 3.92}, {"text": "In the first month after the deployment of NXE, over a million people downloaded Netflix,", "start": 480.1, "duration": 5.04}, {"text": "and Xbox Live started adding half a million new active users every month.", "start": 485.14, "duration": 4.22}, {"text": "It was also a good end of the year for Netflix:", "start": 489.4, "duration": 2.08}, {"text": "Over a quarter of its 9.4 million subscribers were using Watch Instant,", "start": 491.48, "duration": 3.92}, {"text": "and it was slowly spreading onto more devices.", "start": 495.4, "duration": 2.7}, {"text": "Microsoft also came out like a bandit, with a barrage of banger Xbox exclusives,", "start": 498.1, "duration": 3.92}, {"text": "and selling six million 360's worldwide over the holidays, for a total of 28.5 million.", "start": 502.02, "duration": 5.3}, {"text": "PlayStation did... er, a bit worse, with less high-performing exclusives,", "start": 507.5, "duration": 3.88}, {"text": "and selling 4 million PS3's worldwide, for a total of 21 million.", "start": 511.38, "duration": 3.64}, {"text": "Sony would continue to fall behind in online users as well:", "start": 515.02, "duration": 3.36}, {"text": "By June 2009, PlayStation Network only had about 11 million active users.", "start": 518.38, "duration": 4.62}, {"text": "Compare that to Xbox Live's 20 million, with about half of those being paying Gold users.", "start": 523.0, "duration": 4.88}, {"text": "So things were lookin' really good for Xbox, right?", "start": 527.96, "duration": 2.0}, {"text": "Well, as Summer 2009 crept into Fall 2009,", "start": 529.96, "duration": 3.48}, {"text": "Microsoft started making some perculiar public boasting:", "start": 533.44, "duration": 3.12}, {"text": "In August, they released an update that reiterated that Netflix was exclusive to the 360.", "start": 536.56, "duration": 5.0}, {"text": "\"This EXCLUSIVE partnership offers you the ability to INSTANTLY stream movies and television episodes\"", "start": 541.66, "duration": 5.52}, {"text": "\"from Netflix to the television via Xbox 360.\"", "start": 547.18, "duration": 3.04}, {"text": "\"Xbox 360 will be the ONLY game console to offer this movie-watching experience.\"", "start": 550.34, "duration": 5.46}, {"text": "And then they rebranded their on-demand video store as the Zune Marketplace,", "start": 556.18, "duration": 3.78}, {"text": "- Oh god, y'all remember the Zune?!", "start": 559.96, "duration": 1.96}, {"text": "Man, who had a Zune? Who's 'bout that Zune lifestyle? Hit me up!", "start": 562.06, "duration": 3.6}, {"text": "- and updated Silverlight to allow for people to stream downloads from the store, at 1080, with surround sound.", "start": 565.72, "duration": 6.08}, {"text": "Wait... you got Netflix exclusive,", "start": 571.86, "duration": 2.26}, {"text": "why're you also cramming in Zune and beefing up Silverlight all of a sudden?", "start": 574.12, "duration": 3.5}, {"text": "Hmm... could there be trouble in Netflix & Microsoft Land?", "start": 577.68, "duration": 3.1}, {"text": "Of course there was, I mean, you already know about this disc, right?", "start": 580.78, "duration": 2.78}, {"text": "So, Netflix had never been shy about its ambitions to be on every device ever,", "start": 583.56, "duration": 4.74}, {"text": "so Netflix was about to do what Netflix do:", "start": 588.3, "duration": 2.8}, {"text": "Tart it up with the competition!", "start": 591.18, "duration": 2.2}, {"text": "In October 2009, Sony announced that Netflix was coming to their consoles.", "start": 593.38, "duration": 4.88}, {"text": "It would be just like the Xbox Live, except it wouldn't require an extra paid subscription,", "start": 598.26, "duration": 4.56}, {"text": "and would need to be accessed with a special Netflix disc that you had to order.", "start": 602.82, "duration": 3.92}, {"text": "But still, the disc was free, and that wasn't so bad, right?", "start": 606.74, "duration": 3.0}, {"text": "From their press release: \"The free instant streaming disc leverages Blu-ray's BD-Live™ technology\"", "start": 609.82, "duration": 5.3}, {"text": "\"to access the Internet and activate the Netflix user interface on the PS3 system,\"", "start": 615.12, "duration": 4.24}, {"text": "\"which must be online via Wi-Fi or Internet.\"", "start": 619.36, "duration": 2.48}, {"text": "Wow! Blu-ray streaming!", "start": 622.04, "duration": 2.34}, {"text": "Blu-ray... BD-Live™! Whatever that is! It sounds like-", "start": 624.5, "duration": 3.76}, {"text": "Bull***. And it was bull****!", "start": 628.26, "duration": 2.24}, {"text": "It's total bull****! Stupid spin!!", "start": 630.5, "duration": 2.08}, {"text": "It's so dumb! Researching this stuff is so interesting!", "start": 633.1, "duration": 3.0}, {"text": "Can you believe this?! I love it!!", "start": 636.2, "duration": 2.24}, {"text": "Like, Netflix went to Brazil on the PS2, as well as on a disc!", "start": 638.72, "duration": 4.72}, {"text": "Ah, Brazil. Where Mortal Kombat 3 is on the Master System, and Netflix is on the PS2.", "start": 643.54, "duration": 4.36}, {"text": "Now obviously, this whole mumbo jumbo about Blu-ray BD Experience, Live, whatever, was just spin.", "start": 648.0, "duration": 5.76}, {"text": "The key part of the press release is this little phrase:", "start": 653.88, "duration": 2.94}, {"text": "\"to access the Internet and activate the Netflix user interface.\"", "start": 656.82, "duration": 3.54}, {"text": "Basically the disc just adds an extra step,", "start": 660.48, "duration": 2.64}, {"text": "so Netflix technically didn't go back on their deal to allow the 360 to be the only console to instantly stream.", "start": 663.12, "duration": 6.86}, {"text": "It was ballsy and ingenious, I mean...", "start": 670.2, "duration": 2.12}, {"text": "[clapping]\nWay to have no shame, Netflix. Well done.", "start": 672.58, "duration": 3.52}, {"text": "And like Microsoft, this deal with Netflix was just one in a string of moves from Sony", "start": 676.32, "duration": 4.48}, {"text": "to finally get the PlayStation 3 really moving.", "start": 680.8, "duration": 2.72}, {"text": "In September 2009, one month before the Netflix announcement,", "start": 683.52, "duration": 3.04}, {"text": "the PS3 Slim was released: It brought down the price of the PS3,", "start": 686.56, "duration": 3.58}, {"text": "and was the moment when the gap on console sales with Microsoft began to close.", "start": 690.14, "duration": 4.36}, {"text": "They also managed to have some genuine PS3 exclusive hits that year with Uncharted 2 and Infamous.", "start": 694.5, "duration": 5.06}, {"text": "Over the year of 2009, Netflix's subscriber numbers had climbed to over 12 million, they were on a ton of devices,", "start": 699.68, "duration": 6.26}, {"text": "and they had doubled the amount of subscribers using Watch Instant.", "start": 705.94, "duration": 2.96}, {"text": "But the big question that remained on everyone's lips,", "start": 708.9, "duration": 2.42}, {"text": "and I imagine yours too, since you made it this far in the video:", "start": 711.38, "duration": 2.64}, {"text": "While all this 360 and PS3 drama was cute,", "start": 716.38, "duration": 2.54}, {"text": "the facts remained that the Wii accounted for over HALF of the games market at that point.", "start": 718.92, "duration": 5.56}, {"text": "And finally, in January 2010, Netflix and Nintendo announced that they would be bringing Netflix to the Wii.", "start": 724.56, "duration": 5.86}, {"text": "Yes, finally we get to the disc!", "start": 730.58, "duration": 2.08}, {"text": "But don't forget, this was officially the second decade of the new millenium,", "start": 732.74, "duration": 3.32}, {"text": "and consumers were far away from the days when they had to choose", "start": 736.06, "duration": 3.04}, {"text": "between Blu-ray or HD DVD to hook up to their first HDTV.", "start": 739.1, "duration": 3.68}, {"text": "And while the Wii was a sales juggernaut, it lacked some  key high-definition features.", "start": 742.78, "duration": 4.98}, {"text": "When asked about this, Reggie Fils-Aimé, then-president of Nintendo America, replied that", "start": 747.78, "duration": 4.58}, {"text": "\"The vast majority of content that is available for streaming through Netflix is not HD content.\"", "start": 752.36, "duration": 4.48}, {"text": "\"So there's really no loss for Wii consumers - the fact that they can't get HD content through our system\",", "start": 756.84, "duration": 4.66}, {"text": "which was true in a lot of ways,", "start": 761.5, "duration": 1.54}, {"text": "but facts are that Netflix subscribers on the PS3 and Xbox 360 had access to over 1,000 HD titles!", "start": 763.04, "duration": 6.44}, {"text": "Tch! I'm sure Netflix wouldn't like to hear Reggie drag them through the mud like that.", "start": 769.48, "duration": 3.4}, {"text": "(... sorry, huh?)", "start": 772.88, "duration": 1.08}, {"text": "(He agreed with them?! What?!)", "start": 774.58, "duration": 1.86}, {"text": "Yeah, Netflix's spokesman totally agreed with Reggie, saying:", "start": 776.62, "duration": 3.3}, {"text": "... wow. It is amazing to hear Netflix refer to one of their flagship products as 'underwhelming'.", "start": 787.26, "duration": 6.08}, {"text": "But this is part of the overall Netflix strategy,", "start": 793.34, "duration": 2.88}, {"text": "because you know what Netflix prized over being \"best\"? Being the most convenient,", "start": 796.22, "duration": 4.6}, {"text": "and it would be pretty nice for Netflix to have access to the over 26 million Wiis in the United States alone.", "start": 800.82, "duration": 7.32}, {"text": "So there was no extra fee, no HD, just an extra disc.", "start": 808.44, "duration": 3.28}, {"text": "Discs started shipping for the Netflix subscribers that connected their accounts to their Wii in March 2010.", "start": 811.86, "duration": 5.46}, {"text": "In just seven months, over three million people used a disc", "start": 817.36, "duration": 4.5}, {"text": "to connect their Wii to the wild world of Netflix streaming offerings!", "start": 821.86, "duration": 4.0}, {"text": "Oh wow, King of the Hill! Remember when that used to be on Netflix?", "start": 826.12, "duration": 2.72}, {"text": "But that didn't matter anymore, because in October 2010, Microsoft's exclusivity deal ran out,", "start": 829.04, "duration": 4.86}, {"text": "and PS3 and Wii subscribers were free to go disc-free.", "start": 833.9, "duration": 3.48}, {"text": "Yep, just POOF! Millions of discs rendered completely useless, overnight!", "start": 837.38, "duration": 4.62}, {"text": "Now floating in an ocean near you!", "start": 842.26, "duration": 1.72}, {"text": "By mid-2011, the most popular way to watch Netflix was on a computer.", "start": 844.18, "duration": 4.1}, {"text": "The second-most popular? The Wii!", "start": 848.38, "duration": 2.16}, {"text": "Netflix didn't even discontinue its streaming services on the Wii until January 2019!", "start": 850.7, "duration": 5.0}, {"text": "And that's when Nintendo shut down the whole eShop and Wii stuff, like...", "start": 856.0, "duration": 3.42}, {"text": "I don't think Netflix ever actually shut it down, Nintendo shut it down!", "start": 859.72, "duration": 3.7}, {"text": "Today Netflix is primarily a streaming service,", "start": 864.06, "duration": 2.88}, {"text": "though they still do ship DVD's if you're into that.", "start": 866.94, "duration": 2.74}, {"text": "At this point you can get Netflix on smart TV's, phones, Blu-ray players, probably your microwave, I don't know.", "start": 869.72, "duration": 5.54}, {"text": "It's wild to think how massive they've become in just over a decade,", "start": 875.26, "duration": 4.7}, {"text": "to the point where Microsoft and Google and others in the games industry", "start": 879.96, "duration": 3.7}, {"text": "are using THEM as an example of what they want to become!", "start": 883.74, "duration": 3.26}, {"text": "At the end of the day, did Netflix help anyone win the console war?", "start": 887.26, "duration": 4.5}, {"text": "I mean, there were a lot of small victories, but in the long term? No, not really.", "start": 891.76, "duration": 4.16}, {"text": "But did Netflix use the console war as a tool in its belt for its own global domination? Absolutely!", "start": 896.16, "duration": 6.86}, {"text": "And it's gonna keep getting more interesting,", "start": 903.1, "duration": 1.94}, {"text": "I mean, Netflix just for the first time ever lost subscribers like a month ago,", "start": 905.06, "duration": 3.86}, {"text": "and then Disney's makin' some moves right now, like... I dunno!", "start": 909.06, "duration": 2.76}, {"text": "Anyway, that's gonna wrap it up for now, thank you for watching Past Mortem,", "start": 911.82, "duration": 2.68}, {"text": "for watching Stop Skeletons From Fighting, I'm Derek,", "start": 914.5, "duration": 1.9}, {"text": "we have a Patreon, shout-out to our Patreon supporters,", "start": 916.4, "duration": 2.92}, {"text": "every single one of these people is awesome and they help support the show,", "start": 919.32, "duration": 3.04}, {"text": "you can join their ranks as well as the Discord, and get the podcast, get the activity feed,", "start": 922.42, "duration": 5.02}, {"text": "and get videos early by going to Stop Skeletons From Fighting on Patreon,", "start": 927.44, "duration": 4.2}, {"text": "support what you can, we appreciate it,", "start": 931.64, "duration": 1.78}, {"text": "and hey, if you like the video... like, subscribe... all that stuff,", "start": 933.44, "duration": 4.22}, {"text": "I gotta tell you to ring the bell 'cuz that's where we are right now,", "start": 937.66, "duration": 2.9}, {"text": "we did a video a couple 'o years ago on the Xbox 360 Red Ring of Death,", "start": 940.62, "duration": 3.5}, {"text": "you've maybe seen it, but if you haven't, check it out!", "start": 944.16, "duration": 2.88}, {"text": "This video is actually kind of like, sort of like a next chapter of that, like a little mini-chapter after that.", "start": 947.1, "duration": 5.92}, {"text": "Um... the next full chapter after that video might be comin' sometime down the line,", "start": 953.04, "duration": 4.42}, {"text": "but anyway, that's it for now, thanks for watching, see you again real soon.", "start": 957.46, "duration": 3.66}]