[{"text": "I bet there's cash", "start": 0.0, "duration": 2.0}, {"text": "This is it escape room", "start": 5.529, "duration": 1.611}, {"text": "It's basically where you and some friends are placed in a room and you have to solve a series of puzzles and locks to get", "start": 7.14, "duration": 5.28}, {"text": "out in exactly one hour", "start": 12.42, "duration": 1.44}, {"text": "and today I'm gonna give you ten proven tips to dominate any type of escape room and I say proven because me and six of", "start": 13.86, "duration": 6.599}, {"text": "My buddies utilize these tips and even though about half of us", "start": 20.46, "duration": 2.489}, {"text": "I've never even done an escape room before we shattered the long-standing record for this room by finishing in 38 minutes with no clues", "start": 22.949, "duration": 6.21}, {"text": "Next we tried an even harder room to prove that it wasn't just luck and there again we finished in 46 minutes", "start": 29.349, "duration": 5.6}, {"text": "And so the evidence seemed compelling but for further proof", "start": 34.95, "duration": 3.209}, {"text": "I had my niece and nephew and a bunch of their friends first try a room without me telling them the tips", "start": 38.19, "duration": 5.13}, {"text": "They only made it about halfway through at the end of the full hour", "start": 43.32, "duration": 2.909}, {"text": "Then we walked through the ten tips together and then they went back to a new room with an equal level of difficulty and this", "start": 46.23, "duration": 5.819}, {"text": "Time that they finished in 55 minutes with no clues now", "start": 52.05, "duration": 2.909}, {"text": "you're probably thinking what qualifies me to be giving tips about escape rooms when I've only ever done three myself and the answer is", "start": 54.96, "duration": 6.84}, {"text": "Absolutely, nothing. They're actually not my tips. I tracked down the architect and designer of the red bull escaping the wind championships", "start": 62.14, "duration": 6.799}, {"text": "He's a college professor. His name is Scott Nicholson", "start": 69.03, "duration": 2.55}, {"text": "The problem is I live here in California and he's way over here in Brantford, Ontario in Canada", "start": 71.58, "duration": 5.25}, {"text": "And while that's typically a 12-hour trip through the magic of YouTube", "start": 76.96, "duration": 2.9}, {"text": "I knew I could make it there in just a six second travel montage", "start": 79.86, "duration": 3.209}, {"text": "Okay, so I am here now in Canada at the begin lab at Laurier University", "start": 96.03, "duration": 4.79}, {"text": "With Scott Nicholson Scott. What the heck do you do? What is this place?", "start": 101.43, "duration": 4.309}, {"text": "Well, this place is where I met games. Our focus here is actually making games to change the world", "start": 105.95, "duration": 3.779}, {"text": "So a lot of the games we make here of some sort of learning outcome", "start": 109.729, "duration": 2.58}, {"text": "Our goal is to help get people to learn stuff in a playful way", "start": 112.31, "duration": 2.069}, {"text": "So professor Nicholson and I hung out together for a day as he generously spilled out the information", "start": 114.38, "duration": 4.739}, {"text": "in his very large brain", "start": 119.19, "duration": 1.55}, {"text": "He even put me through a few challenges and puzzles of my own and so here are the ten tips", "start": 120.74, "duration": 3.959}, {"text": "I came away with after hanging out with him", "start": 124.7, "duration": 1.83}, {"text": "the first step is to think simple think", "start": 126.53, "duration": 2.0}, {"text": "Generally keep reminding yourself that the average person should be able to complete this room in one hour in a well-designed room", "start": 128.55, "duration": 5.719}, {"text": "You won't need any extra knowledge besides what you can just find in the room people tend to overanalyze and just go down a rabbit", "start": 134.269, "duration": 6.3}, {"text": "So for example in one room", "start": 140.7, "duration": 1.55}, {"text": "We found the travel log of a robber and he went from Washington down to Mexico City up to Toronto", "start": 142.25, "duration": 5.91}, {"text": "at first we were trying to look at the", "start": 148.58, "duration": 1.719}, {"text": "interstates", "start": 150.299, "duration": 0.5}, {"text": "He would travel on and maybe that was a code and then we're like maybe we should", "start": 150.799, "duration": 3.72}, {"text": "Unscramble the names of the countries and then we realized his path", "start": 154.86, "duration": 3.74}, {"text": "forms a V", "start": 159.239, "duration": 1.051}, {"text": "which happened to be the first letter in a combination lock we were trying to open if you can't find a simple answer to a", "start": 160.29, "duration": 5.36}, {"text": "Puzzle chances are it's because all the necessary information hasn't been revealed to you yet. So move on and then come back to it", "start": 165.65, "duration": 6.6}, {"text": "Later, the second tip deals with searching", "start": 172.25, "duration": 1.95}, {"text": "The first thing you should do in your to room is for everyone to split up and to start looking for clues and items", "start": 174.2, "duration": 5.159}, {"text": "Professor Nicholson actually put me through my own searching boot camp to point out the typical places that things are hidden", "start": 179.63, "duration": 4.859}, {"text": "There you go. Always look under tables always look under rugs", "start": 184.489, "duration": 3.24}, {"text": "they write codes on the back of rugs other spots might be in hollowed-out books or in pockets of clothing or", "start": 187.73, "duration": 5.25}, {"text": "Behind a door in the room a super common first-time mistake is to look in places", "start": 193.079, "duration": 3.74}, {"text": "You should for example, you won't find a clue by disassembling a ceiling light or a power outlet", "start": 196.82, "duration": 4.679}, {"text": "Another common searching mistake is to see Clues and things that aren't for example", "start": 201.709, "duration": 3.779}, {"text": "The bottom of this chair has letters and numbers from the factory", "start": 205.489, "duration": 3.27}, {"text": "But they're obviously not part of the room design because they don't fit with the theme", "start": 208.76, "duration": 3.15}, {"text": "Going back to tip 1 the clues and key items should be fairly obvious in a well", "start": 212.069, "duration": 4.97}, {"text": "Signed room and the more scape rooms you do the more you'll get a sense for what is and isn't a real clue tip 3", "start": 217.23, "duration": 5.19}, {"text": "Organize your stuff as you search the room put all the clues and items in one location", "start": 222.519, "duration": 4.55}, {"text": "So if you found three similar cups like this with numbers on the bottom group them together as you do this the bigger picture begins", "start": 227.08, "duration": 6.409}, {"text": "To emerge and it's easier to tell what you're missing", "start": 233.489, "duration": 2.34}, {"text": "don't let people just walk around with an item randomly in their hand that others don't know about you can ask before you start but", "start": 235.83, "duration": 6.149}, {"text": "Almost all rooms have a policy where you use one clue or one lock only one time", "start": 241.98, "duration": 4.889}, {"text": "so once you've used a clue or item put it in a discard pile and be sure to leave any key in the lock that", "start": 246.87, "duration": 5.79}, {"text": "It opened this helps avoid unnecessary wasting of time when a team member is working on a puzzle", "start": 252.66, "duration": 4.079}, {"text": "They don't realize has already been solved and used for tip four", "start": 256.81, "duration": 3.38}, {"text": "Now that your team is starting to make sense of the room", "start": 260.19, "duration": 2.279}, {"text": "laser", "start": 262.66, "duration": 0.569}, {"text": "focus on what is stopping you from moving forward you are going to feel overwhelmed at the beginning even with our record breaking times about", "start": 263.229, "duration": 6.89}, {"text": "Halfway through I thought there is no way we're gonna even come close to finishing", "start": 270.12, "duration": 3.809}, {"text": "But then you solve one thing and then everything else starts falling into place to help with this work", "start": 273.93, "duration": 4.92}, {"text": "Backwards from the thing that is stopping you identify that inputs it needs for example in this room", "start": 279.1, "duration": 4.939}, {"text": "You see there is a lock here", "start": 284.039, "duration": 1.621}, {"text": "And it looks like the key is right here, but you need some kind of hanger to fish it out now", "start": 285.66, "duration": 4.859}, {"text": "there's a cabinet on the wall that", "start": 290.52, "duration": 1.36}, {"text": "Probably contains that hanger and it has a lock that needs three letters and two numbers today", "start": 291.88, "duration": 5.029}, {"text": "You can focus on clues that will yield three numbers and two letters you won't be as vulnerable to red herrings", "start": 296.91, "duration": 4.47}, {"text": "So red herring is something that's put into the room that has no bearing upon the game. It can be something simple", "start": 301.38, "duration": 4.619}, {"text": "oh, this has got to be really important clearly or if some rooms even have red herring puzzles that", "start": 306.0, "duration": 5.549}, {"text": "Lead to nothing as a player. It's incredibly frustrating and so we've done some studies", "start": 312.28, "duration": 4.73}, {"text": "So most players hate red herrings because they're waste of our time", "start": 317.01, "duration": 3.419}, {"text": "About half designers hate red herrings and will not put them in their rooms and about half are like, yeah", "start": 320.889, "duration": 4.97}, {"text": "They're okay to have in the roof by working backwards on the immediate inputs that are needed", "start": 325.86, "duration": 4.2}, {"text": "You'll avoid wasting time on red herring clips tip 5 is about team rolls according to dr", "start": 330.06, "duration": 5.369}, {"text": "Nicholson poor", "start": 335.43, "duration": 0.94}, {"text": "Communication is the number one reason why teams fail his list of eight different roles that team members can be assigned which I will link", "start": 336.37, "duration": 5.66}, {"text": "below", "start": 342.03, "duration": 0.13}, {"text": "But the one that semen was critical in our experience was project manager", "start": 342.16, "duration": 3.29}, {"text": "Because it helps alleviate the issue of poor communication. The project manager shouldn't get overly involved in puzzles instead", "start": 345.82, "duration": 6.169}, {"text": "The project manager is the person people report to and say hey", "start": 351.99, "duration": 2.399}, {"text": "There's a four digit combination lock over there and the project manager will call that out", "start": 354.389, "duration": 4.2}, {"text": "Okay, everyone. We're looking for four digits. Someone comes up and says hey there's there's a five letter word lock there", "start": 358.59, "duration": 5.19}, {"text": "Okay, we're looking for five letters. There's a poster over there. That looks funny. Okay", "start": 363.78, "duration": 4.139}, {"text": "So everyone take a look at that poster if you're searching for something you might find it in that poster", "start": 367.919, "duration": 4.2}, {"text": "So the project manager should keep an idea of what are the active tasks what needs to be done?", "start": 372.12, "duration": 4.23}, {"text": "who's working on what and", "start": 376.72, "duration": 1.62}, {"text": "Keep the game flow going, but try to keep themselves out of getting buried in puzzles", "start": 378.34, "duration": 4.25}, {"text": "So they can keep a scan of what's happening", "start": 382.59, "duration": 2.22}, {"text": "So the first five tips focused on it general team strategies, but the last half will be about puzzle solving strategies", "start": 384.81, "duration": 5.97}, {"text": "you should be familiar with most common locks and their inputs because again if you're working back from what's stopping you and you know a", "start": 390.78, "duration": 5.94}, {"text": "Lock requires three letters, then everyone could just focus on finding three letters", "start": 396.72, "duration": 3.929}, {"text": "The standard key lock is the most obvious then a combination lock where you're just looking for four numbers in a specific order or here", "start": 400.65, "duration": 6.269}, {"text": "Where it's a combination lock of letters and numbers", "start": 406.919, "duration": 1.931}, {"text": "But five total then your classic dial lock where you need three numbers total and you start by spinning clockwise then open it like this", "start": 408.85, "duration": 7.189}, {"text": "Then you've got this directional lock which is a little trickier because they can have anywhere from two to thirty inputs", "start": 416.38, "duration": 5.029}, {"text": "squeeze down here three times to wipe it clean", "start": 421.6, "duration": 2.299}, {"text": "If you need to try again", "start": 423.9, "duration": 1.03}, {"text": "Finally you have one of these lock boxes that are again tricky because they've got anywhere from two to ten inputs", "start": 424.93, "duration": 5.209}, {"text": "But it's good to know. They can only use each number once and the order doesn't matter", "start": 430.139, "duration": 4.41}, {"text": "So one six zero five works", "start": 434.82, "duration": 1.719}, {"text": "But so does five zero six one a critical tip of locks is if you're pretty sure you have the right code", "start": 436.539, "duration": 5.809}, {"text": "But it's not opening have someone else try before you move on just given the pressure of the game", "start": 442.349, "duration": 4.83}, {"text": "We have this tip save us on three separate occasions", "start": 447.18, "duration": 2.52}, {"text": "and finally", "start": 449.86, "duration": 0.89}, {"text": "you can skip trying to figure out the last digit if you know all the rest of them just by trial and error because there", "start": 450.75, "duration": 4.829}, {"text": "Were only be ten options according to Professor Nicholson's research about half of all escape rooms will have some kind of code that you need", "start": 455.58, "duration": 6.57}, {"text": "To decipher. There's a few basic codes", "start": 462.15, "duration": 1.889}, {"text": "I've seen again and again and just knowing what they look like is useful now", "start": 464.039, "duration": 2.97}, {"text": "You're not gonna be expected to memorize the encoding scheme, but it tells you how we're looking for an encoding scheme", "start": 467.01, "duration": 4.949}, {"text": "So in the upper left anytime, you see dots and dashes you should be thinking Morse code", "start": 471.96, "duration": 3.779}, {"text": "Usually it's written", "start": 475.78, "duration": 1.069}, {"text": "But sometimes it can be lights that are flashing long and short or even long and sure", "start": 476.849, "duration": 3.63}, {"text": "Sounds the upper right is called Pigpen cipher and it's often disguised as hieroglyphics. The key will look something like this", "start": 480.64, "duration": 6.079}, {"text": "So see if you could decode the message then anytime you see dots in a group of six like this", "start": 486.82, "duration": 5.269}, {"text": "You know, you're looking at a Braille key each letter in Braille is some combination of six dots and finally, dr", "start": 492.1, "duration": 5.869}, {"text": "Nicholson said in his experience", "start": 497.97, "duration": 1.29}, {"text": "The only time you might not get to the coder key is if there are a set of numbers ranging from 1 to 26 in", "start": 499.26, "duration": 4.829}, {"text": "That case you match them up with a corresponding letter in the alphabet. So this becomes", "start": 504.09, "duration": 4.11}, {"text": "H-e-l-l-o", "start": 508.78, "duration": 1.23}, {"text": "Debate is about written clues. Dr", "start": 510.01, "duration": 2.39}, {"text": "Nicholson created this challenge for me of the four most common styles of hiding clues in written text", "start": 512.4, "duration": 4.679}, {"text": "Pause the video and see if you can find the four separate hidden messages here", "start": 517.36, "duration": 3.679}, {"text": "The first is the most obvious with the bold letters. Look at the watch face", "start": 521.039, "duration": 4.35}, {"text": "The second are all the words missing a letter. So remove the telephone", "start": 525.39, "duration": 3.899}, {"text": "Keypad find the secret next and this one stumped us for a little while in one of the rooms we did is to just look", "start": 529.81, "duration": 5.809}, {"text": "at the capitalized words", "start": 535.62, "duration": 1.39}, {"text": "The secret code is 6 7 3 4 and finally if you look at the first word of each new line on the left side", "start": 537.01, "duration": 7.969}, {"text": "The secret phrase is goodnight sweet prince", "start": 545.11, "duration": 3.08}, {"text": "Makini TVs is looking for something that stands out from the normal pattern you would expect to see which leads us to our second to", "start": 548.76, "duration": 5.88}, {"text": "Last tip look for patterns. Dr. Nicholson gave me one last challenge here. Now the lock that you have meit's indicates", "start": 554.64, "duration": 6.119}, {"text": "You need to enter things in the order of a red green blue. This one is pretty straightforward", "start": 560.76, "duration": 3.63}, {"text": "But what do you think the code is here?", "start": 564.55, "duration": 1.88}, {"text": "In fact pause the video if you want to decipher all 3 codes on the board here. The top is 4 3 6", "start": 566.43, "duration": 5.22}, {"text": "Based on the number of sides this one at the bottom", "start": 571.84, "duration": 2.57}, {"text": "You just need to count the different colored circles and then enter them in that order", "start": 574.41, "duration": 3.899}, {"text": "So 3 6 4 1 and finally in the middle, you see this digital numerical notation used a lot in escape rooms", "start": 578.31, "duration": 5.85}, {"text": "So here the code is 5 for 7 apologies to my colorblind peeps out there because you probably couldn't solve that last one", "start": 584.17, "duration": 6.83}, {"text": "Which is exactly the type of reason why you should cycle people through trying to solve the tough puzzles a fresh perspective", "start": 591.0, "duration": 5.91}, {"text": "Is all it takes in many cases this helped us multiple times. And for the final tip your guide is your friend", "start": 597.07, "duration": 6.289}, {"text": "Listen closely when they're giving their instructions at the beginning a lot of times they will give subtle hints about issues that trip a lot", "start": 603.37, "duration": 6.29}, {"text": "Of people up you can also ask some high-level questions", "start": 609.66, "duration": 2.13}, {"text": "like if they have a 1 lock", "start": 611.79, "duration": 1.669}, {"text": "Use policy and even if you don't want hints you can ask them to prompt you if you're way behind where most people would be", "start": 613.459, "duration": 5.25}, {"text": "At a certain point at the end of the day you're there to have fun", "start": 618.709, "duration": 2.669}, {"text": "so it's better to take a hint and feel the excitement of escaping the room than being stuck on a", "start": 621.54, "duration": 4.519}, {"text": "Frustrating clue for 40 minutes and finally fewer people is almost always better statistically", "start": 626.22, "duration": 5.089}, {"text": "You'll have a higher success rate because you don't have to deal with the issues of poor communication amongst 10 people", "start": 631.309, "duration": 4.92}, {"text": "But there's also a finite number of fun things to do in a room", "start": 636.23, "duration": 3.299}, {"text": "So the fewer people you have the more fun stuff that everyone gets to do to quote from dr", "start": 639.529, "duration": 5.039}, {"text": "Nichols's twitter my policy for the number of people in an escape room is the same as the number of people in a tent", "start": 644.639, "duration": 5.0}, {"text": "No matter what the package says, you'll have a better time at half capacity. So there you go", "start": 649.639, "duration": 4.53}, {"text": "Now, you know all the best strategies to dominate your next escape room", "start": 654.179, "duration": 3.62}, {"text": "All that's left is to get your brain in shape and to do that", "start": 657.8, "duration": 2.94}, {"text": "You got to use the logic courses at brilliant org on the off chance that you've never heard of them", "start": 660.869, "duration": 4.4}, {"text": "Brilliant is an interactive website that focuses on just teaching science courses through intuition instead of memorizing formulas", "start": 665.49, "duration": 6.529}, {"text": "But here's the trick", "start": 672.019, "duration": 1.18}, {"text": "passive learning doesn't work nearly as well as active learning so they teach a principle and then they follow up with engaging puzzles or an", "start": 673.199, "duration": 6.38}, {"text": "Interactive demo, so you actually retain the information you can access brunet org from your computer or use the app", "start": 679.649, "duration": 5.57}, {"text": "Which is super popular with 4.7 stars from over 40,000 ratings", "start": 685.22, "duration": 4.079}, {"text": "and so no matter your current level of understanding if you want to quickly get smarter about a bunch of different science topics while", "start": 689.299, "duration": 5.4}, {"text": "Basically playing games and doing puzzles you go to brilliant org slash mark Rover or use the link in the video description", "start": 694.86, "duration": 5.089}, {"text": "And as a fist bump from brilliant for using a link and supporting my channel", "start": 700.049, "duration": 3.47}, {"text": "The first 200 people will get 20% off their subscription. Thanks for watching", "start": 703.74, "duration": 4.459}]