[{"text": "This is the symphony of the seas: an 1,188 feet long, 8,880 person, 18 deck, 7 neighborhood", "start": 0.0, "duration": 8.3}, {"text": "beast of a cruise ship that makes the Titanic look like a kayak. It cost $1.4 billion dollars", "start": 8.349, "duration": 6.35}, {"text": "but cruise ships only lasts about 25 years; 25 years of", "start": 14.699, "duration": 4.231}, {"text": "constant cleaning and maintenance, plus an enormous amount of food, fuel, fees and employees.", "start": 18.93, "duration": 6.029}, {"text": "But tickets can cost just 60 or 70 dollars a day, cheaper than most retirement homes and a bit more fun", "start": 24.959, "duration": 7.32}, {"text": "So making profit and quite a bit of it means", "start": 32.52, "duration": 2.61}, {"text": "Optimizing everything from a ship's flag to its precise schedule. Like airlines, the business of cruising is one of low", "start": 35.13, "duration": 6.99}, {"text": "Margins at extreme scale. Cruise Lines are experts at finding clever ways to save money", "start": 42.18, "duration": 5.16}, {"text": "Norwegian cruises would even sail 1,100 miles into the middle of nowhere to avoid fines, they run a very tight ship", "start": 47.84, "duration": 7.66}, {"text": "Cruises can be long, short, salty or not", "start": 57.9, "duration": 2.96}, {"text": "But they all fall under three basic categories: Mainstream cruise lines optimized for scale", "start": 60.87, "duration": 5.64}, {"text": "They sell lots of tickets or not a lot of money", "start": 66.51, "duration": 2.969}, {"text": "Sometimes even at a loss. The average ticket sells for 1,293 dollars", "start": 69.7, "duration": 4.79}, {"text": "But cost the company even more in food fuel wages marketing and lots lots more. If everyone left their wallet at home,", "start": 74.619, "duration": 7.819}, {"text": "These cruise lines would go out of business, but the average person spends four hundred and twenty nine dollars on board", "start": 82.6, "duration": 6.349}, {"text": "They're the perfect captive audience. When your only choices are pepsi or sea water", "start": 88.95, "duration": 4.83}, {"text": "They can pretty much guarantee your purchase", "start": 93.78, "duration": 2.22}, {"text": "casinos, spas, shopping and drinks are key to making profit", "start": 96.0, "duration": 4.16}, {"text": "And why you can't bring your own, and since everyone walks from cabin to dining room at least once a day", "start": 100.17, "duration": 5.729}, {"text": "That's where they place lounges bars and casinos. There's no avoiding them. Premium wines are just the opposite", "start": 106.06, "duration": 6.319}, {"text": "they make most of their money upfront. The no screaming kids on board tax means they can spend more time in ports", "start": 112.38, "duration": 6.06}, {"text": "And Luxury ships may only hold a few hundred passengers", "start": 118.44, "duration": 3.74}, {"text": "But each pays more than enough to make the difference", "start": 122.18, "duration": 3.08}, {"text": "All three categories serve very different markets so a good company catches them all which is why so many brands are owned by just two mega corporations", "start": 125.26, "duration": 8.7}, {"text": "Carnival owns Holland America princess piano and Costa even an airline at one point and Royal Caribbean on", "start": 134.269, "duration": 6.62}, {"text": "Celebrity and Azamara. This way something like Costa, Concordia", "start": 141.05, "duration": 2.929}, {"text": "Doesn't damage the rest of the company's reputation. When a ship reaches the end of its life", "start": 144.29, "duration": 4.4}, {"text": "They can just hand it down to one of their other brands with lower standards, and a cruise ship is a vacation machine", "start": 148.69, "duration": 6.299}, {"text": "But it can never take a vacation November to April is when cold Americans escape to the Caribbean", "start": 154.989, "duration": 5.85}, {"text": "But keeping that many ships there all year round would be extremely costly so is moving around empty ships from one region to another", "start": 160.84, "duration": 6.929}, {"text": "So they don't. when Caribbean ships switch to Europe in April", "start": 168.049, "duration": 3.71}, {"text": "They sell repositioning tickets a one-way two-week cruise from Florida to say Amsterdam", "start": 171.76, "duration": 6.029}, {"text": "This way the ship is always making money and when one cruise ends the next begins", "start": 177.79, "duration": 4.949}, {"text": "Turnaround day is a miracle of coordination. In less than half a day 6,000 people exit the ship and a hotel,", "start": 183.17, "duration": 6.469}, {"text": "restaurant, a theater, laundromat, and theme park clean and reset as if nothing ever happened", "start": 189.799, "duration": 5.029}, {"text": "When the ship arrives back at port early in the morning the clock starts ticking. While passengers sleep all their luggage must be carried ashore", "start": 194.959, "duration": 7.25}, {"text": "Meanwhile trash is dumped, crew members switched, fuel pumped and a Costco of food and supplies", "start": 202.67, "duration": 5.719}, {"text": "loaded onto the ship. 700,000 eggs, 3,000 gallons of soda and 15,000 pounds of potatoes. By 10:30", "start": 208.79, "duration": 7.88}, {"text": "Passengers are gone and hundreds of housekeepers rushed to clean all 3,000 rooms", "start": 216.98, "duration": 4.819}, {"text": "Then paperwork needs filed, maintenance performed, towel animals folded, and lunch cooked by Mr. Fieri.", "start": 221.8, "duration": 6.44}, {"text": "All before new passengers arrive at one. By five o'clock", "start": 228.36, "duration": 3.3}, {"text": "The ship is on its way whether you're on it or not, because the sooner it reaches", "start": 231.709, "duration": 4.49}, {"text": "International waters the sooner the casino can start making Bank. Gambling is already very profitable", "start": 236.389, "duration": 5.81}, {"text": "But especially when it's unregulated, so don't go overboard. Ocean water is pumped in", "start": 242.2, "duration": 5.28}, {"text": "Desalinated and sent to rooms, which because surface area is so limited are mostly interiors", "start": 247.7, "duration": 5.44}, {"text": "but the real moneymakers are suites and balconies, so", "start": 253.15, "duration": 3.149}, {"text": "Profitable that some ships have fake windows with virtual views and the least desirable lower decks are reserved for the crew", "start": 256.609, "duration": 7.13}, {"text": "There's one for every 2 passengers, but you'll never see them off-duty", "start": 263.74, "duration": 3.75}, {"text": "They work long hours for 3 to 12 months at a time", "start": 267.49, "duration": 2.91}, {"text": "And they have to stay in their quarters when not working, and that's because a cruise ship can register in any country whose labor laws", "start": 270.41, "duration": 6.799}, {"text": "It prefers, most ships fly a flag of convenience", "start": 277.209, "duration": 2.931}, {"text": "Usually Panama or Liberia saving millions in wages. Pretty handy", "start": 280.48, "duration": 4.3}, {"text": "It's why you might have a Barbadian maitre d or latvian housekeeper, but never a pricey american", "start": 284.8, "duration": 5.97}, {"text": "the only problem is the passenger vessel services act of 1886.", "start": 290.77, "duration": 4.57}, {"text": "It says no foreign vessel shall transport passengers between", "start": 295.54, "duration": 3.24}, {"text": "ports in the United States. Acruise can take passengers from America to another country and then", "start": 298.97, "duration": 5.359}, {"text": "Coincidentally those same people back to America", "start": 304.669, "duration": 2.57}, {"text": "But never directly between American ports so short Pacific cruises often stop in Ensenada", "start": 307.24, "duration": 6.089}, {"text": "It's only 50 miles from the US but on a 6000 passenger cruise it saves 1.8", "start": 313.33, "duration": 5.7}, {"text": "million in fines", "start": 319.03, "duration": 1.12}, {"text": "But for cruises to Hawaii they had to get creative. Every week Norwegian cruise ships going to Hawaii would take a four-day", "start": 320.15, "duration": 7.69}, {"text": "1,135 mile detour to a tiny atoll with no running water or electricity called Tabuaeran", "start": 328.0, "duration": 6.86}, {"text": "But because they technically step foot in the Republic of Kiribati", "start": 334.86, "duration": 3.56}, {"text": "the trip is made 100% legal,", "start": 338.54, "duration": 2.0}, {"text": "And then Norwegian built the pride of America, because it's registered in the US it can avoid the detour", "start": 340.63, "duration": 5.519}, {"text": "But it's subject to American labor laws, which is why many cruises to Hawaii are more expensive. Meanwhile", "start": 346.15, "duration": 5.97}, {"text": "No port wants to be the next Tabuaeran so they fight to attract cruises. Cruise lines sell local activities for high", "start": 352.12, "duration": 6.33}, {"text": "Commissions and port fees are passed on to passengers", "start": 358.55, "duration": 3.11}, {"text": "But ideally passengers never leave company property so until", "start": 361.66, "duration": 4.1}, {"text": "2096 Walt Disney owns a small island in the Bahamas where they take their cruises called Castaway Cay", "start": 365.92, "duration": 5.94}, {"text": "And now other cruise lines are doing the same", "start": 371.86, "duration": 2.429}, {"text": "It's every company's dream, from the moment you step on board until you leave 10 pounds heavier", "start": 374.289, "duration": 5.22}, {"text": "You're under their magic spell", "start": 379.51, "duration": 1.78}, {"text": "but that's also the beauty of a crew: total convenience. the last thing you want to do on vacation is cook or clean or", "start": 381.29, "duration": 6.929}, {"text": "[AD] Remember passwords. Traveling in general is hard enough", "start": 388.44, "duration": 2.929}, {"text": "much less remembering airline hotel and other passwords, sitting by the pool", "start": 391.82, "duration": 3.959}, {"text": "Lemonade in hand and surfing the net is the last time you should need to remember your passwords", "start": 396.0, "duration": 4.85}, {"text": "Dashlane stores fills and can even generate those passwords for you anywhere in the world", "start": 401.01, "duration": 5.029}, {"text": "Across all your devices so you can make them as secure as you want without having to remember.", "start": 406.2, "duration": 4.639}, {"text": "Basically Dashlane brings the", "start": 411.06, "duration": 1.59}, {"text": "convenience of a cruise to your passwords. Using one password for everything just isn't secure and if you do what you're supposed to do and", "start": 412.65, "duration": 7.129}, {"text": "Make a long complicated password,", "start": 419.78, "duration": 1.71}, {"text": "You'll never remember it. Do you want to get into your account or do you not want to be hacked? Those are terrible", "start": 421.49, "duration": 5.819}, {"text": "options, and what makes Dashlane so great. It works on pretty much every platform", "start": 427.58, "duration": 4.36}, {"text": "And it's not some big complicated thing you have to setup.", "start": 431.94, "duration": 3.16}, {"text": "It just works, if it finds that one of your accounts is ever compromised", "start": 435.1, "duration": 3.66}, {"text": "It sends you a notification", "start": 438.77, "duration": 1.21}, {"text": "so you can change your password.", "start": 439.98, "duration": 1.53}, {"text": "For a ton of sites, Dashlane can even change your password for you with one click of a button", "start": 441.51, "duration": 4.549}, {"text": "I can't tell you how convenient that is", "start": 446.06, "duration": 2.56}, {"text": "why not make your life easier? your data is worth it. Click the link in the description and use the code", "start": 448.72, "duration": 5.22}, {"text": "'youtube2018' for 10% off the already very affordable premium plan, or try it completely free", "start": 453.94, "duration": 7.32}]