[
    {
        "text": "Hey adings, it's your ate sapphire",
        "start": 0.0,
        "duration": 1.69
    },
    {
        "text": "Don't click ahead yet because I have a few announcements to share with you before we get into this week's story",
        "start": 1.69,
        "duration": 5.18
    },
    {
        "text": "I am heading to VidCon this year",
        "start": 6.87,
        "duration": 1.92
    },
    {
        "text": "I will have a booth on the show floor where we'll be giving away pins shirts and posters",
        "start": 8.79,
        "duration": 4.5
    },
    {
        "text": "And I'll also have an official meet-and-greet",
        "start": 13.63,
        "duration": 2.63
    },
    {
        "text": "So make sure you're following us on Twitter and Instagram",
        "start": 16.289,
        "duration": 2.55
    },
    {
        "text": "To be notified of when I'm at the booth and to stay updated on when my meet-and-greet will be",
        "start": 18.97,
        "duration": 4.94
    },
    {
        "text": "can't wait to see you all there and don't forget to make sure you're subscribed to snarled and the Bell is turned on for",
        "start": 24.07,
        "duration": 5.809
    },
    {
        "text": "Notifications and now back to the show. Hey, I'm sapphire, want to hear something scary?",
        "start": 30.13,
        "duration": 5.719
    },
    {
        "text": "HOUSE OF DOON",
        "start": 40.27,
        "duration": 2.029
    },
    {
        "text": "Following is a story that Brookes grandfather told her to warn her to never go near the house of doon",
        "start": 44.62,
        "duration": 7.459
    },
    {
        "text": "When I was around 17 years old I had a friend named Fraser",
        "start": 54.16,
        "duration": 4.129
    },
    {
        "text": "He was a bit of a daredevil always taking risks and doing stupid stunts",
        "start": 58.719,
        "duration": 4.22
    },
    {
        "text": "He had no regard for his own safety",
        "start": 63.129,
        "duration": 2.36
    },
    {
        "text": "One night me Fraser and our friend Ashley were hanging out and Fraser mentioned the house of doon a house",
        "start": 65.89,
        "duration": 7.19
    },
    {
        "text": "That was about a half mile from the outskirts of the village",
        "start": 73.08,
        "duration": 2.489
    },
    {
        "text": "generally our town wasn't that superstitious but there was something about that place that scared all the locals so",
        "start": 76.78,
        "duration": 7.519
    },
    {
        "text": "Obviously, we all fell silent and then trying to steer clear of the subject, but this a really annoyed Fraser",
        "start": 84.61,
        "duration": 6.079
    },
    {
        "text": "I wish people would stop acting like the house is so dangerous",
        "start": 90.689,
        "duration": 3.66
    },
    {
        "text": "he said the thing was",
        "start": 94.99,
        "duration": 2.0
    },
    {
        "text": "None of us had actually ever gone near the house",
        "start": 97.659,
        "duration": 2.63
    },
    {
        "text": "Everything we knew about it was from the stories our parents told us. We didn't know why we had to avoid it",
        "start": 101.02,
        "duration": 6.2
    },
    {
        "text": "we just knew that we should and",
        "start": 107.35,
        "duration": 2.0
    },
    {
        "text": "Frazer wasn't the type of guy to follow the rules. Let's put an end to this stupid superstition and spend a night there together",
        "start": 109.93,
        "duration": 7.939
    },
    {
        "text": "right now",
        "start": 118.42,
        "duration": 1.11
    },
    {
        "text": "Me and Ashley shared a worried glance, but Fraser was very insistent",
        "start": 119.53,
        "duration": 4.069
    },
    {
        "text": "So without any real intention of spending the night we decided to follow Frazer to the house",
        "start": 124.44,
        "duration": 5.66
    },
    {
        "text": "We thought we could maybe talk him out of it",
        "start": 130.32,
        "duration": 2.0
    },
    {
        "text": "So we pull up to the garden of the house packed with our sleeping bags and flashlights",
        "start": 132.78,
        "duration": 4.4
    },
    {
        "text": "The garden was completely overgrown plants were wrapping around the gate the tarmac and the house the windows were shattered",
        "start": 137.55,
        "duration": 7.429
    },
    {
        "text": "The house was giving off an energy that to this day. I still can't describe accurately",
        "start": 145.53,
        "duration": 5.99
    },
    {
        "text": "Sitting in that car looking up at the bleak desolate building. It was enough to make me come to my senses",
        "start": 152.79,
        "duration": 6.589
    },
    {
        "text": "We decided that this was a really bad idea and we should head home",
        "start": 160.11,
        "duration": 3.47
    },
    {
        "text": "all of us except Fraser",
        "start": 164.31,
        "duration": 2.119
    },
    {
        "text": "You're really going to let fear control your lives. he taunted us. Everyone is afraid of this house and doesn't even know why",
        "start": 167.04,
        "duration": 7.069
    },
    {
        "text": "Don't you want to prove everyone wrong?",
        "start": 174.63,
        "duration": 2.0
    },
    {
        "text": "After about a half hour of arguing Fraser realized he wasn't going to convince us and let us spend the night in the car",
        "start": 177.51,
        "duration": 7.159
    },
    {
        "text": "While he spent the night in the house alone before he went inside he told us that he planned on staying in the Attic",
        "start": 184.77,
        "duration": 7.129
    },
    {
        "text": "Every 15 minutes or so",
        "start": 192.209,
        "duration": 1.611
    },
    {
        "text": "He would bang on the attic wall facing the front yard to give us a sign that he was still okay",
        "start": 193.82,
        "duration": 5.339
    },
    {
        "text": "Then at 8 a.m. He would return to the car. We wished him luck and watched as he confidently strutted into the house",
        "start": 199.62,
        "duration": 7.85
    },
    {
        "text": "We waited about five minutes went by until we heard a thud coming from the Attic",
        "start": 208.14,
        "duration": 6.65
    },
    {
        "text": "We saw the faint silhouette of an arm waving at us in the window",
        "start": 215.03,
        "duration": 3.75
    },
    {
        "text": "Relieved to know that he was still okay",
        "start": 219.27,
        "duration": 1.88
    },
    {
        "text": "Me and Ashley got comfy in the car",
        "start": 221.15,
        "duration": 2.07
    },
    {
        "text": "But there was no way we were going to fall asleep and just like Fraser promised every 15 minutes or so",
        "start": 223.41,
        "duration": 5.959
    },
    {
        "text": "We'd hear the reassuring thud it was now about 1 a.m",
        "start": 229.41,
        "duration": 4.339
    },
    {
        "text": "Me and Ashley were finally comfortable enough to slowly fall asleep. I",
        "start": 234.33,
        "duration": 4.279
    },
    {
        "text": "Wasn't sure how long I had been knocked out but I woke up to the same thud sound only it was a little bit faster",
        "start": 239.31,
        "duration": 6.5
    },
    {
        "text": "No longer every 15 minutes",
        "start": 246.63,
        "duration": 2.0
    },
    {
        "text": "More like every five seconds. I wasn't sure why Fraser was pounding more frequently now",
        "start": 249.27,
        "duration": 5.539
    },
    {
        "text": "But as long as he was okay, it didn't really matter. I",
        "start": 254.97,
        "duration": 3.17
    },
    {
        "text": "Fell back asleep. I",
        "start": 258.69,
        "duration": 2.0
    },
    {
        "text": "Didn't wake up until the Morning Sun shone on my face",
        "start": 261.78,
        "duration": 2.839
    },
    {
        "text": "Ashley had also just woken up",
        "start": 265.29,
        "duration": 2.0
    },
    {
        "text": "It was past 8 a.m. In the morning, but Fraser hadn't come back to the car yet",
        "start": 267.54,
        "duration": 4.25
    },
    {
        "text": "Fraser was still pounding on the attic wall",
        "start": 273.21,
        "duration": 2.51
    },
    {
        "text": "We figured he was just showing off now trying to prove to us that he could stay even longer in the house",
        "start": 276.36,
        "duration": 5.6
    },
    {
        "text": "But we really wanted to head back home now, and we weren't just gonna wait for Fraser to be ready to come down",
        "start": 282.66,
        "duration": 5.029
    },
    {
        "text": "Hey Fraser, I shouted up at the attic you proved your point. It's time to go home now",
        "start": 288.93,
        "duration": 5.39
    },
    {
        "text": "Ashley and I had no choice but to go get him ourselves",
        "start": 300.48,
        "duration": 3.199
    },
    {
        "text": "Although the house was still fairly creepy in the morning. We felt a little braver knowing that Fraser made it through the night",
        "start": 304.68,
        "duration": 6.679
    },
    {
        "text": "So we entered the house there were footprints in the dusty floor that showed us Fraser's path",
        "start": 311.669,
        "duration": 5.27
    },
    {
        "text": "We followed it up the deteriorating staircase and to the Attic",
        "start": 317.37,
        "duration": 4.25
    },
    {
        "text": "The thuds getting louder and louder as we got closer and closer",
        "start": 321.93,
        "duration": 4.46
    },
    {
        "text": "We opened the door",
        "start": 327.33,
        "duration": 2.0
    },
    {
        "text": "There was Fraser",
        "start": 329.88,
        "duration": 2.0
    },
    {
        "text": "hanging from the ceiling his body swinging back and forth and",
        "start": 332.13,
        "duration": 4.519
    },
    {
        "text": "every five seconds",
        "start": 337.32,
        "duration": 2.0
    },
    {
        "text": "slamming into the wall",
        "start": 339.63,
        "duration": 2.0
    },
    {
        "text": "Thank you to all of our patrons",
        "start": 344.58,
        "duration": 2.0
    },
    {
        "text": "Especially Ashley who had a character names after them in this episode",
        "start": 346.89,
        "duration": 3.619
    },
    {
        "text": "If you'd like to join our VIP program visit patreon.com slash snarled want more something scary",
        "start": 350.51,
        "duration": 6.329
    },
    {
        "text": "You can hear more stories over on the something scary podcast available for free on Apple",
        "start": 356.84,
        "duration": 5.369
    },
    {
        "text": "Podcasts or wherever you listen to your favorite shows. The links are in the",
        "start": 362.34,
        "duration": 3.589
    },
    {
        "text": "Description below if you'd like to submit a story send me an email at something scary at snarled calm",
        "start": 366.12,
        "duration": 5.839
    },
    {
        "text": "like and share this video if it gave you the chills and don't forget to subscribe to snarls and turn on the bell for",
        "start": 372.21,
        "duration": 5.93
    },
    {
        "text": "notifications and if you dare follow me on Media",
        "start": 378.419,
        "duration": 3.72
    },
    {
        "text": "until next time",
        "start": 382.81,
        "duration": 1.68
    },
    {
        "text": "sweet dreams",
        "start": 384.49,
        "duration": 2.0
    }
]