[{"text": "Welcome to all of you, my little rascals who rape hens...", "start": 0.0, "duration": 3.14}, {"text": "People often say that I am vulgar in my videos,", "start": 3.14, "duration": 2.24}, {"text": "so, this time, I'll mind my words and speak politely.", "start": 5.38, "duration": 3.695}, {"text": "The delicacy of my way of speaking will render this review as understandable as possible to all of those who cannot stand rude speeches.", "start": 9.075, "duration": 5.725}, {"text": "However, before starting this test on Sekiro, you've probably heard that", "start": 14.805, "duration": 3.5}, {"text": "\"Article 13\" has been voted with 348 voices supporting the article", "start": 18.32, "duration": 4.12}, {"text": "against 274 voices that dismissed it.", "start": 22.44, "duration": 1.7}, {"text": "To sum up, \"Article 13\", that has become \"Article 17\",", "start": 24.14, "duration": 2.64}, {"text": "demands that contents on the internet are filtered as soon as they come out.", "start": 26.78, "duration": 3.14}, {"text": "Whatever ... everyone will get to understand that this is quite impossible to implement;", "start": 29.92, "duration": 3.32}, {"text": "however, instead of complaining and trying to explain that this is bullshit to people that do not even have Internet", "start": 33.24, "duration": 4.14}, {"text": "- I am talking about European deputes...", "start": 37.38, "duration": 1.84}, {"text": "I'll provide a solution to you: use PureVPN", "start": 39.24, "duration": 3.12}, {"text": "that will locate your IP Address anywhere you want it in the world.", "start": 42.38, "duration": 3.16}, {"text": "You'll benefit, for example, of the American Netflix catalogue,", "start": 45.54, "duration": 2.96}, {"text": "way more furnished than the French one.", "start": 48.5, "duration": 1.86}, {"text": "Anyway, in regards of the moronic politics we have in Europe,", "start": 50.36, "duration": 2.44}, {"text": "we'll have to use a VPN. In the description box, you'll find a link for a one-month free trial - give yourself a treat!", "start": 52.8, "duration": 4.62}, {"text": "With this, it's time for my test on Sekiro.", "start": 57.42, "duration": 2.36}, {"text": "Who's there?         - *BURP*                                                (translator's note: in French, pun on \"c'est qui?'\" (SE-KI) that is, here, translated literally)", "start": 60.52, "duration": 1.6}, {"text": "Sekiro is a game developed by From Software ...", "start": 62.12, "duration": 2.78}, {"text": "the hell-made video game developer that is behind the Dark Souls series,", "start": 64.925, "duration": 3.17}, {"text": "a video game series largely acknowledged by all masochist gamers.", "start": 68.1, "duration": 3.04}, {"text": "To briefly sum up the game to those few who wouldn't know Dark Souls,", "start": 71.14, "duration": 3.48}, {"text": "it's a challenging game in which you will die plenty of times", "start": 74.62, "duration": 2.715}, {"text": "while fighting enemies that will make hell out of your life,", "start": 77.335, "duration": 2.84}, {"text": "demanding you to surpass yourself in order to go further,", "start": 80.18, "duration": 2.4}, {"text": "which will result in your self-contentment that is similar to an orgasm.", "start": 82.58, "duration": 3.04}, {"text": "Of course, tiny little Sekiro is made along the same lines as its spiritual father;", "start": 85.62, "duration": 3.62}, {"text": "so, it has to be said: there will be hell to pay.", "start": 89.24, "duration": 3.04}, {"text": "However, we're very far from a Dark Souls' cold, dejected and forsaken kingdom", "start": 92.28, "duration": 4.14}, {"text": "and which soundtrack would leave the happiest of you weeping.", "start": 96.42, "duration": 2.66}, {"text": "*To die", "start": 100.02, "duration": 4.24}, {"text": "that's", "start": 104.26, "duration": 1.38}, {"text": "that's such a real fun*", "start": 105.84, "duration": 8.1}, {"text": "No, the world in Sekiro is, well, not so funny either as it takes place in medieval Japan during the Sengoku period", "start": 114.16, "duration": 6.46}, {"text": "- and I spoil you a Dragon Ball joke.", "start": 120.76, "duration": 1.9}, {"text": "But, in general, it was an era during which", "start": 122.72, "duration": 2.02}, {"text": "many clans slaughtered each other.", "start": 124.76, "duration": 2.1}, {"text": "The current clan that dominates in game is the Ashina clan,", "start": 126.86, "duration": 2.72}, {"text": "that has actually existed, by the way,", "start": 129.58, "duration": 2.08}, {"text": "and you'll play a character that everyone names \"Wolf\",", "start": 131.66, "duration": 2.04}, {"text": "a Shinobi in charge of protecting Kuro, the Prince and heir", "start": 133.7, "duration": 3.26}, {"text": "and last survivor of a long lineage. Your character is bond to the Prince's protection through a ritual ordained by Kuro's father.", "start": 136.96, "duration": 4.94}, {"text": "And, of course, even though the Prince is a 10-year-old kid,", "start": 141.9, "duration": 2.235}, {"text": "you follow his orders like a puppy:", "start": 144.14, "duration": 2.46}, {"text": "\"So, go make me some hot chocolate and then we'll play fortnite.", "start": 146.62, "duration": 3.2}, {"text": "- Yes, Sir. And, afterwards, you may spit on me if you lose.\"", "start": 149.82, "duration": 2.64}, {"text": "\"I'm dumb.\"", "start": 153.425, "duration": 1.0}, {"text": "Besides this, yes, I play in French.", "start": 154.68, "duration": 2.86}, {"text": "Not everyone likes to read subtitles when playing, not everyone can understand", "start": 157.54, "duration": 3.235}, {"text": "the original dialogues. And for me, Japan is more than just animes and mangas.", "start": 160.775, "duration": 3.1}, {"text": "That's why I don't have to pretend to understand Japanese so as to show off. Anyway,", "start": 163.875, "duration": 3.06}, {"text": "I like Japan, subtitles piss me off and those who judge me, go suck dicks in Hell.", "start": 166.94, "duration": 3.6}, {"text": "Oh darn ... I said no swearing. Oh, to hell with it.", "start": 170.54, "duration": 2.5}, {"text": "In any case, I'm going to discuss the gameplay so I wouldn't have been able to stop my insults.", "start": 173.04, "duration": 3.0}, {"text": "So, the first challenge you'll face", "start": 176.04, "duration": 1.76}, {"text": "are the game's Terms of Services.", "start": 177.805, "duration": 2.28}, {"text": "I agree or disagree?", "start": 181.215, "duration": 1.52}, {"text": "Goddammit, I always make the wrong choice!", "start": 183.66, "duration": 1.82}, {"text": "No, I'm kidding, I'm not that bad - I went a bit further in the game.", "start": 185.48, "duration": 3.24}, {"text": "Want to see my first steps in Sekiro?", "start": 188.72, "duration": 2.26}, {"text": "That was just because I wanted to see what happens if I die.", "start": 190.98, "duration": 2.64}, {"text": "Because, you know, I'm a Pro Gamer. I'm paid to play video games.", "start": 193.62, "duration": 2.9}, {"text": "Thus I was certain to play through the game easily. Unfortunately, contrary to Dark Souls,", "start": 196.52, "duration": 2.94}, {"text": "you can't play as a magician specialised in fire. No, you have to play with your saber", "start": 199.46, "duration": 4.2}, {"text": "and your very Shinobi arm that enables you to use tools,", "start": 203.66, "duration": 3.42}, {"text": "like shurikens, a hatchet,", "start": 207.08, "duration": 2.1}, {"text": "a hat, a fan, my dick, ravens", "start": 209.205, "duration": 2.83}, {"text": "and other stupid things. Besides, of course, your character can develop", "start": 212.035, "duration": 2.71}, {"text": "its attack power in using trophies that you obtain when you kill a boss.", "start": 214.745, "duration": 3.635}, {"text": "You can also level-up your defense power", "start": 218.38, "duration": 2.54}, {"text": "and your vitality that is, as it matters, a joke as", "start": 220.925, "duration": 2.69}, {"text": "most attacks will kill you in one blow or two, when you're lucky.", "start": 223.615, "duration": 2.97}, {"text": "Therefore, one may think that because of such a challenge, the game has", "start": 226.585, "duration": 2.275}, {"text": "to be perfectly fair and that it efficiently answers", "start": 228.86, "duration": 2.52}, {"text": "to the gamer's moves so that the gamer can focus on his battles", "start": 231.38, "duration": 3.04}, {"text": "and not to get killed due to technical issues.", "start": 234.42, "duration": 2.7}, {"text": "It'd be downright disgusting to let the players play a character", "start": 237.12, "duration": 2.96}, {"text": "as delicate while you could die of issues due", "start": 240.08, "duration": 2.86}, {"text": "to the camera. It'd be downright disgusting not to see your", "start": 242.94, "duration": 3.18}, {"text": "enemy because the camera films a wall.", "start": 246.125, "duration": 2.755}, {"text": "It'd be downright disgusting if the camera would be squeezed against the wall", "start": 248.88, "duration": 3.36}, {"text": "focusing so much on your enemy that you could not even see your own character's moves.", "start": 252.245, "duration": 3.28}, {"text": "It'd be downright disgusting if such a challenging game", "start": 255.525, "duration": 2.69}, {"text": "would let you have a bug in the scenery", "start": 258.22, "duration": 2.48}, {"text": "and which would jeopardize your life when infiltrating somewhere. It'd be downright disgusting", "start": 260.7, "duration": 3.52}, {"text": "to have pop up a tutorial while in the middle of a fight. You know,", "start": 264.22, "duration": 2.595}, {"text": "right when you have to defend yourself from a blow.", "start": 266.815, "duration": 2.43}, {"text": "It'd be downright disgusting if sometimes assassinations", "start": 269.725, "duration": 3.05}, {"text": "highlighted with a bright red circle and quasi-obligatory", "start": 272.775, "duration": 2.62}, {"text": "for some boss fights just don't work.", "start": 275.4, "duration": 2.72}, {"text": "It'd be downright disgusting to randomly lose the targeting on your enemy", "start": 278.12, "duration": 3.1}, {"text": "which would prevent you to block a blow and,", "start": 281.225, "duration": 3.02}, {"text": "finally, it'd be downright disgusting that enemies could strike you through walls.", "start": 284.245, "duration": 3.795}, {"text": "That would be especially idiotic for such a challenging game.", "start": 288.04, "duration": 3.14}, {"text": "Goddammit, I agree to say that the game is challenging which", "start": 291.18, "duration": 3.74}, {"text": "is a very good point. However, that the game lacks technical accuracy,", "start": 294.925, "duration": 3.03}, {"text": "that's a no way. Whatever the game, to die because of bugs", "start": 297.955, "duration": 3.16}, {"text": "or technical issues, that's the worst that could happen to a gamer.", "start": 301.12, "duration": 3.0}, {"text": "But then, I still finished the game but I wasted quite a bit of time", "start": 304.12, "duration": 2.8}, {"text": "in starting from scratch some boss fights because the camera", "start": 306.92, "duration": 2.24}, {"text": "lost its focus or I lost targeting on my enemies. Even if this happens not that often.", "start": 309.18, "duration": 3.7}, {"text": "I admit, I mostly died because I lacked knowledge on how to play certain boss fights.", "start": 312.88, "duration": 2.875}, {"text": "But then, that's what I want! I want to die because I did wrong.", "start": 315.755, "duration": 2.69}, {"text": "And, even more so, I want to win because I played well. Like, for example,", "start": 318.445, "duration": 2.795}, {"text": "against this boss who's considered one of the game's most challenging.", "start": 321.24, "duration": 2.9}, {"text": "Yes, indeed, he who's paddling in a pool of acid. Comes in handy", "start": 324.295, "duration": 3.02}, {"text": "as while he very slowly dies, you can", "start": 327.315, "duration": 2.78}, {"text": "take your dog for a walk, wash some dishes, make love to your wife,", "start": 330.095, "duration": 2.92}, {"text": "take your dishes for a walk, make love to your dog, do the woman or", "start": 333.015, "duration": 3.08}, {"text": "every other activity that roughly takes 10 minutes. And yes, I already see some commenting:", "start": 336.095, "duration": 3.08}, {"text": "\"you could have fought him honorably.\"", "start": 339.18, "duration": 2.84}, {"text": "Listen well, I play as a Shinobi, not as a Samurai. Honor is achieved", "start": 342.02, "duration": 3.42}, {"text": "when a mission is a success regardless of the means used to reach the end.", "start": 345.44, "duration": 2.86}, {"text": "That said, to be honest, to see a boss commit suicide", "start": 348.3, "duration": 2.36}, {"text": "in front of you, that's way less alluring. See it this way, there's not much", "start": 350.66, "duration": 3.78}, {"text": "self-contentment. Now, let's talk about stealth in the game.", "start": 354.5, "duration": 2.66}, {"text": "That's very important to start a clash: stealth enables you to one-shot", "start": 359.385, "duration": 2.71}, {"text": "regular enemies while it also takes off 1 life of a mini-boss who", "start": 362.1, "duration": 3.14}, {"text": "are, sometimes, more challenging than a real boss.", "start": 365.24, "duration": 2.14}, {"text": "Stealth also enables you to highlight all the details the game developers accorded", "start": 367.38, "duration": 3.28}, {"text": "to the game's AI ...", "start": 370.66, "duration": 0.96}, {"text": "... - non-existent and thoroughly stupid.", "start": 371.96, "duration": 1.96}, {"text": "Seriously, between enemies on whom you throw some china right in the face but who", "start": 373.92, "duration": 3.86}, {"text": "are not sure that there's something behind the wall ... and the others on whom", "start": 377.78, "duration": 2.8}, {"text": "I throw plenty in the face and who don't move ...", "start": 380.58, "duration": 1.98}, {"text": "and those who are completely blind.", "start": 383.535, "duration": 2.07}, {"text": "Well, after all, the game's developers cannot program a camera,", "start": 386.12, "duration": 3.18}, {"text": "so then program and manage an AI ... pfff.", "start": 389.3, "duration": 2.055}, {"text": "*discretely......................*", "start": 391.355, "duration": 2.0}, {"text": "Truth be told, to be stealthy will come in", "start": 393.955, "duration": 2.22}, {"text": "handy against major and massive enemies,", "start": 396.18, "duration": 3.0}, {"text": "at least as massive as my passion for video games", "start": 399.18, "duration": 2.9}, {"text": "- of course. Even though this snake roughly has the same size as ma phal -", "start": 402.085, "duration": 3.13}, {"text": "\"Those who most speak about it, do the least.\" Ha!", "start": 405.215, "duration": 3.03}, {"text": "Nice argument for virgins. Your mother often speaks about her dick?", "start": 408.335, "duration": 3.12}, {"text": "No, so according to you, she's quite the shameless woman?", "start": 411.46, "duration": 2.48}, {"text": "Well, piss off. Of course, the game hasn't only flaws and", "start": 414.62, "duration": 3.095}, {"text": "some boss fights are actually really challenging - you die and you learn.", "start": 417.715, "duration": 2.93}, {"text": "This game tries to push you in a tight corner and its aim", "start": 420.645, "duration": 3.31}, {"text": "is to get you to try harder so that you earn the right to get to the next step.", "start": 423.96, "duration": 3.22}, {"text": "This game doesn't offer you everything on a plate; you'll have to deserve it.", "start": 427.22, "duration": 3.28}, {"text": "Challenges are no malleable parts of the gameplay;", "start": 430.5, "duration": 3.22}, {"text": "they're main parts of the gameplay. And contrary to Dark Souls,", "start": 433.72, "duration": 3.24}, {"text": "there is no easy way to approach the game. You'll have to fight in close-range", "start": 436.96, "duration": 3.335}, {"text": "with a katana.", "start": 440.295, "duration": 1.0}, {"text": "No luck for those used in playing as magicians. Indeed,", "start": 441.735, "duration": 2.88}, {"text": "you can no longer easily walk through the game while daring enjoying it.", "start": 444.62, "duration": 2.94}, {"text": "Here, you'll have to pay hell as everybody has to. But contrary to the others,", "start": 447.56, "duration": 3.235}, {"text": "are you up to the challenge? Will you be one of the few who finished the game,", "start": 450.8, "duration": 3.3}, {"text": "or will you belong to those people who", "start": 454.1, "duration": 2.755}, {"text": "bought the game but have found it so hard (like my dick) that they mark it", "start": 456.86, "duration": 3.18}, {"text": "0/20 on jeuxvideo.com out of revenge?", "start": 460.04, "duration": 1.68}, {"text": "LOL. Too bad at it, noobs? To crappy to play the game?", "start": 461.94, "duration": 2.36}, {"text": "\"I love the game, but I'm tired of dying several times in a row.", "start": 464.6, "duration": 2.5}, {"text": "As long as there's no easy game mode, the 0/20 is gonna stay.", "start": 467.1, "duration": 3.48}, {"text": "Yes, I rage, but it's legitimate.\" Of course, what a", "start": 470.6, "duration": 2.94}, {"text": "good idea to implement an easy game mode and thus rewrite the game's principles.", "start": 473.54, "duration": 3.68}, {"text": "Really, I'll never understand that.", "start": 477.22, "duration": 1.86}, {"text": "All year-long you have games that are easy and accessible for the greater part", "start": 479.24, "duration": 3.16}, {"text": "of those that are released. Why, for the only game that gives you", "start": 482.405, "duration": 2.96}, {"text": "some challenge, you absolutely want to level it down", "start": 485.365, "duration": 2.89}, {"text": "and empty it of its very essence so that your lack of", "start": 488.26, "duration": 2.945}, {"text": "determination to get further into the game", "start": 491.205, "duration": 1.695}, {"text": "turns it into a game so similar to the many others. Really, if you're tired of playing it,", "start": 492.9, "duration": 3.115}, {"text": "go watch the game on Games Movie Land. If the game's developers", "start": 496.015, "duration": 2.7}, {"text": "conceived the game in such a way, there must be a reason why. But after all,", "start": 498.72, "duration": 2.72}, {"text": "I understand why some rage because they bought the game 70€", "start": 501.44, "duration": 2.94}, {"text": "and end up stuck in the game, unable to move on, because, well...", "start": 504.385, "duration": 2.77}, {"text": "they either missed something or they're too bad at it. But, move your ass,", "start": 507.16, "duration": 3.3}, {"text": "once and for all, instead of begging for an easy game mode.", "start": 510.46, "duration": 2.5}, {"text": "I think you're to used at having control other things and that you're", "start": 512.965, "duration": 3.11}, {"text": "as capricious as a child. Unfortunately, the game is PEGI18.", "start": 516.08, "duration": 3.4}, {"text": "With this, let's get to the section: the press.", "start": 519.6, "duration": 1.64}, {"text": "And we'll start with gameblog.fr that marks the game 9/10.", "start": 523.6, "duration": 3.64}, {"text": "Well, the + points: \"it's very exhilarating to finish the game.\"", "start": 527.24, "duration": 2.62}, {"text": "And, \"fight mechanism that are absorbing and exhilarating.\"", "start": 530.025, "duration": 2.94}, {"text": "What's up with the word exhilarating, dammit? What did it to you? Leave that word be.", "start": 532.965, "duration": 3.975}, {"text": "\"Magnificent settings.\" Magnificent, magnificent ...", "start": 536.94, "duration": 2.1}, {"text": "It's nice but not much more, don't overdo it.", "start": 539.04, "duration": 2.42}, {"text": "At the same time, I wonder what you consider ugly at gameblog.fr.", "start": 541.46, "duration": 2.42}, {"text": "Because, yes, you know how to make hypocrisy magnificent! And I think that video game producers", "start": 543.88, "duration": 3.26}, {"text": "must find that very exhilarating. Ha.", "start": 547.14, "duration": 2.02}, {"text": "Now, let's talk about jeuxactu.com that marked the game 17/20.", "start": 549.56, "duration": 2.9}, {"text": "The + points: \"Japanese voices that are authoritative.\"", "start": 552.46, "duration": 3.12}, {"text": "What? What new language is \"authoritative Japanese\"?", "start": 555.58, "duration": 2.98}, {"text": "For the - points: \"not a very witty AI.\" Really, not very witty?", "start": 558.56, "duration": 4.04}, {"text": "A comatose oyster would act more naturally.", "start": 562.6, "duration": 2.92}, {"text": "Don't be afraid of words... This is a bullshit AI. Yes, BULLSHIT,", "start": 565.62, "duration": 3.46}, {"text": "Besides, I don't have much to say about the press", "start": 569.08, "duration": 2.5}, {"text": "because everyone says the same. To sum up: the game is challenging and it's nice", "start": 571.58, "duration": 2.88}, {"text": "but the AI and the camera are shit. Therefore, I'll now give my mark", "start": 574.46, "duration": 3.1}, {"text": "in concluding on some gamer's hypocrisy towards Sekiro.", "start": 577.56, "duration": 3.4}, {"text": "This review is a very good example.", "start": 580.96, "duration": 2.04}, {"text": "\"While used to challenges and tough games,", "start": 583.1, "duration": 2.9}, {"text": "this game is too tough", "start": 586.0, "duration": 1.58}, {"text": "and more than one player will recoil from it. We like challenges but not hard-challenges.\"", "start": 587.58, "duration": 4.74}, {"text": "Listen well, either you like challenges", "start": 592.32, "duration": 2.3}, {"text": "or you don't like them. I'm tired of those players who describe themselves as", "start": 594.62, "duration": 2.66}, {"text": "challengers so as to justify what cannot be justified. I really", "start": 597.28, "duration": 2.88}, {"text": "understand that gamers don't like the game because of its difficulty. That's not an issue.", "start": 600.16, "duration": 3.58}, {"text": "But don't put the blame on someone else because you give up.", "start": 603.74, "duration": 2.62}, {"text": "You just didn't try hard enough, that's it. To conclude,", "start": 606.36, "duration": 2.4}, {"text": "the issue lies not in the game, it's you ... / 20!", "start": 608.78, "duration": 3.08}, {"text": "Don't hesitate to watch other tests if you liked this one", "start": 611.86, "duration": 3.16}, {"text": "and don't forget the link for a one-month free VPN trial down in the description box.", "start": 615.02, "duration": 3.2}, {"text": "Please subscribe, like and", "start": 618.22, "duration": 2.335}, {"text": "follow me on Instagram. And what about the Ritz? But you gonna pay for it.", "start": 620.56, "duration": 3.7}, {"text": "With this, XOXO", "start": 624.26, "duration": 1.28}, {"text": "and see you soon for my test on Days Gone.", "start": 625.54, "duration": 2.815}, {"text": "I also remind you of my birthday on 26.04.", "start": 628.36, "duration": 2.7}, {"text": "Well then, ciao ciao ciao (???) and subscribe to Pewdiepie.", "start": 631.16, "duration": 2.08}]